{
  "version": "1754863138107",
  "generatedAt": "2025-08-10T21:58:58.107Z",
  "items": [
    {
      "id": "810e693f03f60d8f",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "image": null,
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "summary_90w": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out pu",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "ff411b9848315a10",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "image": null,
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "summary_90w": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war ",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "a5e6fcfedf05f1c5",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "image": null,
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "summary_90w": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Demo",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "4f1f37653cdfeb01",
      "title": "US hunter reportedly killed by buffalo during expedition in South Africa",
      "url": "https://www.theguardian.com/world/2025/aug/06/hunter-killed-by-buffalo-south-africa",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T14:04:02.000Z",
      "image": null,
      "raw": "Asher Watkins, 52, of Texas died while tracking 1.3-ton Cape buffalo on a hunting trip in the country’s Limpopo province\nAn American game hunter was killed by a buffalo he was stalking during a hunting expedition in South Africa over the weekend, according to multiple reports.\nAsher Watkins, 52, of Texas, died on 3 August while tracking a 1.3-ton Cape buffalo in South Africa’s Limpopo province, according to a statement from Coenraad Vermaak Safaris (CV Safaris), the company that organized the hunting trip.\n Continue reading...",
      "summary_90w": "Asher Watkins, 52, of Texas died while tracking 1.3-ton Cape buffalo on a hunting trip in the country’s Limpopo province\nAn American game hunter was killed by a buffalo he was stalking during a hunting expedition in South Africa over the weekend, according to multiple reports.\nAsher Watkins, 52, of Texas, died on 3 August while tracking a 1.3-ton Cape buffalo in South Africa’s Limpopo province, ac",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "c3736746accf95b7",
      "title": "Prince Harry among those criticised in report on dispute at Sentebale charity",
      "url": "https://www.theguardian.com/uk-news/2025/aug/06/prince-harry-among-those-criticised-in-report-on-dispute-at-sentebale-charity",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-05T23:00:38.000Z",
      "image": null,
      "raw": "Watchdog says all parties, including trustees, patrons and chair Sophie Chandauka, should not have had row in public\nThe Charity Commission has criticised Prince Harry for allowing a row with the chair of his African charity to “play out publicly”, as the watchdog cleared him of racism.\nThe prince was engaged in a public war of words earlier this year with the chair of the Sentebale charity, Dr Sophie Chandauka, after his resignation as a patron.\n Continue reading...",
      "summary_90w": "Watchdog says all parties, including trustees, patrons and chair Sophie Chandauka, should not have had row in public\nThe Charity Commission has criticised Prince Harry for allowing a row with the chair of his African charity to “play out publicly”, as the watchdog cleared him of racism.\nThe prince was engaged in a public war of words earlier this year with the chair of the Sentebale charity, Dr So",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "68ad98316d8e2c47",
      "title": "7 password managers to help keep your apps safe",
      "url": "https://www.theverge.com/tech/712968/7-password-managers-to-help-keep-your-apps-safe",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-10T15:00:00.000Z",
      "image": null,
      "raw": "Passwords still seem to be the most popular method of ensuring that the right person is using the right app or service, despite the slow adoption of passkeys, which are considered more secure. And because we should be using different ones for each device and/or app, the best way to track all of them is to use a password manager.\nSome apps and operating systems come with their own password managers. For example, if you're part of the Apple ecosystem, you can use iCloud Keychain; Google users have Google Password Manager, and Microsoft devices store passwords through its Edge browser and Credential Manager. Some apps that offer their own pass …\nRead the full story at The Verge.",
      "summary_90w": "Passwords still seem to be the most popular method of ensuring that the right person is using the right app or service, despite the slow adoption of passkeys, which are considered more secure. And because we should be using different ones for each device and/or app, the best way to track all of them is to use a password manager.\nSome apps and operating systems come with their own password managers",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "8272fd39e100e68f",
      "title": "We found stuff AI is pretty good at",
      "url": "https://www.theverge.com/podcast/756701/ai-tools-chatgpt-gemini-vergecast",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-10T15:00:00.000Z",
      "image": null,
      "raw": "Tech companies keep telling everyone that this or that AI feature is going to change everything. But when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster. Sometimes AI tools feel so open-ended, it's hard to know where to start or what the best way to use them might be\nWell, here at The Verge, we have to test all these AI tools to better report on the features and the companies building them. And we've found scenarios that were actually useful.\n\nIn this bonus episode of The Vergecast, Senior Reviewer Victoria Song sits down with a bunch of Verge staffers to talk a …\nRead the full story at The Verge.",
      "summary_90w": "Tech companies keep telling everyone that this or that AI feature is going to change everything. But when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster. Sometimes AI tools feel so open-ended, it's hard to know where to start or what the best way to use them might be\nWell, here at The Verge, we have to test all these AI ",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "aba56f978ba59ec9",
      "title": "How big trucks and SUVs gobbled up the entire auto industry",
      "url": "https://www.theverge.com/the-stepback-newsletter/756967/giant-trucks-suvs-car-bloat",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-10T14:15:17.000Z",
      "image": null,
      "raw": "How it started\nWhen I was growing up in the Midwest, everyone I knew drove small cars. My dad had a light pink Volvo 240, my mom drove a Dodge Dart, and my grandmother had a 1988 Honda Accord - which would eventually become my first car. We lived in the suburbs, so almost no one drove a truck, but if they did it was something small like a Ford Ranger or Toyota Hilux. \nOver time, those small cars were replaced by SUVs of increasing size. Today, anyone searching for anything smaller than a compact SUV will probably come up dry. Ford killed its sedan production in North America a number of years ago. GM took a little longer, but eventually, w …\nRead the full story at The Verge.",
      "summary_90w": "How it started\nWhen I was growing up in the Midwest, everyone I knew drove small cars. My dad had a light pink Volvo 240, my mom drove a Dodge Dart, and my grandmother had a 1988 Honda Accord - which would eventually become my first car. We lived in the suburbs, so almost no one drove a truck, but if they did it was something small like a Ford Ranger or Toyota Hilux. \nOver time, those small cars w",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "ad558534fcaf97be",
      "title": "Inside the automated warehouse where robots are packing your groceries",
      "url": "https://www.theverge.com/robot/719880/ocado-online-grocery-automation-krogers-luton-ogrp-robot-grid",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-10T14:00:00.000Z",
      "image": null,
      "raw": "It's the lack of noise you notice first. There's no clatter of equipment, rumble of engines, or chatter of coworkers. Only the low hum of electronics. For an industrial space, this is eerily quiet, but it makes sense in a building where robots might outnumber people.\nI'm at a warehouse - or customer fulfilment center (CFC) - operated by online grocery company Ocado in Luton, just outside London. You might not have heard of Ocado, but it may still have delivered your groceries. Its technology handles online orders for Kroger across 14 US states, Sobeys in Canada, and both Morrisons and its own delivery brand in the UK, with other clients acr …\nRead the full story at The Verge.",
      "summary_90w": "It's the lack of noise you notice first. There's no clatter of equipment, rumble of engines, or chatter of coworkers. Only the low hum of electronics. For an industrial space, this is eerily quiet, but it makes sense in a building where robots might outnumber people.\nI'm at a warehouse - or customer fulfilment center (CFC) - operated by online grocery company Ocado in Luton, just outside London. Y",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    },
    {
      "id": "2c7c5b67b68e2624",
      "title": "Ditching my phone for an LTE smartwatch was a humbling experience",
      "url": "https://www.theverge.com/gadgets/756945/smartwatch-lte-minimalist-phone",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-10T13:00:00.000Z",
      "image": null,
      "raw": "Take a little phone break, as a treat.\t\n\nLeaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens? The possibilities are too overwhelming. But in the face of all this uncertainty, I (mostly) left my phone at home for the past week - on purpose.\nI wanted to see if I could get by with just an LTE-enabled smartwatch, an experiment I've been itching to run for a while. I, like many of my fellow elder millennials, look at my phone entirely too much. It's my job, but sti …\nRead the full story at The Verge.",
      "summary_90w": "Take a little phone break, as a treat.\t\n\nLeaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens? The possibilities are too overwhelming. But in the face of all this uncertainty, ",
      "key_fact": "",
      "topics": [],
      "entities": [],
      "region": "",
      "lang": "en"
    }
  ]
}