{
  "version": "1757047109112",
  "generatedAt": "2025-09-05T04:38:29.112Z",
  "items": [
    {
      "id": "6cc48c7eb011636e7455cf12aed5c68a0ebfe147",
      "title": "Australia news live: Alan Joyce secures final $3.8m bonus; man caught riding motorbike at 218km/hr on Queensland highway",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T04:19:42.000Z",
      "summary_90w": "",
      "raw": "Former chief executive left the airline after a series of corporate decisions sparked a reputational crisis. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nCoalition of the willing meeting a ‘positive sign’ for Ukraine, former ambassador says\nThe former Australian ambassador to Russia, Peter Tesch, has appeared on ABC News Breakfast after Anthony Albanese joined a virtual meeting with world leaders signed up to the coalition of the willing for Ukraine on Thursday night.\nThe issue is that we are still no closer to a credible and durable peace settlement, because Moscow keeps walking both sides of the street, and that is provoking a degree of frustration. But in the absence of serious, additional pressure upon Moscow, it’s difficult to see a near-term solution here - notwithstanding Ukraine’s clear willingness to engage seriously in discussions.\nAnd importantly, although the details are vague … President Trump at least remains engaged in that dialogue and that’s very important.\nOur case for a 35% pay increase over three years will begin in the NSW Industrial Relations Commission later this month. As part of this case, which is one of the biggest industrial cases this state has seen, we will present evidence around the gendered undervaluation of nurses and midwives’ work and the work value changes our professions have seen over the past 16 years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "562dadbda567b47d6aa60e33d3cf59878644f608",
      "title": "Rayner's 'judgement day' and 'Dorries joins Tories'",
      "url": "https://www.bbc.com/news/articles/cn4w9541290o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T04:13:46.000Z",
      "summary_90w": "",
      "raw": "The fallout from Angela Rayner's stamp duty admission continues to dominate Friday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a505f84a2e764acdef73231da781295262dc0609",
      "title": "PBS cuts 15% of jobs in wake of federal funding cut",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5529431/pbs-cuts-15-of-jobs-in-wake-of-federal-funding-cut",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T03:40:27.000Z",
      "summary_90w": "",
      "raw": "After Congress clawed back public media funding PBS cuts 15% of its staff.  More than 100 jobs jobs are being lost.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5634436c0e6044fb18f26a19d5bf450333b577f2",
      "title": "Macron says 26 nations ready to provide postwar military backing to Ukraine",
      "url": "https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T03:36:31.000Z",
      "summary_90w": "",
      "raw": "French president says allies would either deploy ‘reassurance force’ troops to Ukraine, or be present in the area on land, sea or in the air\nTwenty-six nations have pledged to provide postwar security guarantees to Ukraine, including an international force on land and sea and in the air, Emmanuel Macron said after a summit at which European leaders sought to pin down Donald Trump on the level of support he is willing to give Kyiv.\n“The day the conflict stops, the security guarantees will be deployed,” the French president told a press conference at the Élysée Palace in Paris, standing alongside Volodymyr Zelenskyy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f70a23334599664583f44c589d2f962148db15f",
      "title": "Don Dale detainee isolated for 84 hours and denied food as coercion technique, investigation finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/05/don-dale-detention-centre-84-hours-isolation-denied-food-coercion-technique-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T03:19:08.000Z",
      "summary_90w": "",
      "raw": "Children’s commissioner says young Indigenous person kept in isolation for 12 hours longer than permitted under NT youth justice laws because they refused to move cell blocks\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA young Aboriginal person detained at the Don Dale detention centre was kept in isolation for 84 hours, unable to leave their cell or make contact with any support person, and was denied food for some of that time as a coercion tactic by officers, an investigation by the Northern Territory’s Office of the Children’s Commissioner has found.\nThe investigation examined an incident that took place in April 2024 at the notorious youth detention facility in Berrimah in the NT, which saw a young detainee held in a cell after refusing to move from one cell block to another.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a5c5505ffd6c667b37e1ba7684b5bc00eb7f9aa",
      "title": "Neo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community",
      "url": "https://www.theguardian.com/australia-news/2025/sep/05/neo-nazi-thomas-sewell-refused-bail-melbourne-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T02:50:34.000Z",
      "summary_90w": "",
      "raw": "Sewell, who allegedly led an attack on the sacred Indigenous burial site in Melbourne known as Camp Sovereignty, was returned to custody following his court appearance\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-Nazi Thomas Sewell, who allegedly led an attack on a sacred Indigenous burial site in Melbourne, has been refused bail.\nSewell, 32, appeared in the Melbourne magistrates court on Friday morning, with a magistrate saying she was satisfied he would endanger the safety of others if released into the community.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "003feee166d17399ae52925ed11f4f9b5c48677f",
      "title": "Andrew Forrest’s Fortescue rejects ‘credibility’ of business council modelling on 2035 emissions target",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/australia-needs-530bn-capital-to-meet-70-climate-goal-business-council-claims-ahead-of-new-2035-target",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T02:29:42.000Z",
      "summary_90w": "",
      "raw": "BCA member criticises climate modelling commissioned by lobby group that ‘underplays’ economic opportunities and does not factor in cost of inaction \n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA fight over climate policy has broken out within a major Australian business lobby, with mining billionaire Andrew Forrest’s Fortescue sharply criticising the Business Council of Australia over its modelling of the costs of making emissions cuts.\nA report released by the business council on Friday claimed Australia would need up to $530bn in capital investment and to potentially curb coal and gas exports to achieve a 2035 emissions target of 70% or more.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "652e1b9eeae03dbe37140ee25e73110254366b52",
      "title": "Lithgow’s old railway yard is for sale – transport experts say it could have a big and green future",
      "url": "https://www.theguardian.com/australia-news/2025/sep/05/lithgow-nsw-railway-yard-sale",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T02:28:17.000Z",
      "summary_90w": "",
      "raw": "Push for NSW locomotive workshop to be returned to government hands and used to retrofit diesel trains and help meet 50% Australian-made quotas\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nOne of New South Wales’ few remaining large railway yards has been put up for sale, with locals pushing for state and federal government intervention to reinvigorate the rail industry.\nLithgow’s locomotive workshop, owned by Pacific National and reported to have an asking price of $35m, includes maintenance pit bays and outbuildings. It was ceded to the freight operator in 2003 when the state privatised its freight services and has been little-used since.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c17745ec202b686ea8b2d7c70c4828f977649a69",
      "title": "Mark Zuckerberg - no, not that one - sues Facebook for account shutdowns",
      "url": "https://www.bbc.com/news/articles/c5yk810pgkko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T02:22:38.000Z",
      "summary_90w": "",
      "raw": "The Facebook founder's namesake in Indiana says he has lost business because his social accounts keep getting shut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "28b676bab6171636949b4110410fbfe5db674b9d",
      "title": "President Trump plans to rename the Defense Department as the Department of War",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5529420/trump-department-of-war-department-of-defense",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T02:18:13.000Z",
      "summary_90w": "",
      "raw": "The change would return the department to a name that it carried for much of its history, until it became the Department of Defense in the wake of World War II.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87775516465152a0da2adcc6b4102d80c68a47f8",
      "title": "Third quake strikes Afghanistan as deaths rise",
      "url": "https://www.bbc.com/news/articles/cly1wy7v9yyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T02:05:28.000Z",
      "summary_90w": "",
      "raw": "The most recent earthquake on Thursday night sent people rushing out of their homes in panic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b188204caaaeca2dcddb05c2b25f2f4e35951d",
      "title": "Rubio says US will 'blow up' foreign crime groups if needed",
      "url": "https://www.bbc.com/news/articles/cx23nzwjnwwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T01:43:49.000Z",
      "summary_90w": "",
      "raw": "The secretary of state made the comments during a trip to Ecuador, where he announced new measures targeting criminal gangs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b188204caaaeca2dcddb05c2b25f2f4e35951d",
      "title": "US prepared to 'blow up' foreign crime groups if needed, US secretary of state says",
      "url": "https://www.bbc.com/news/articles/cx23nzwjnwwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T01:43:49.000Z",
      "summary_90w": "",
      "raw": "The secretary of state made the comments during a trip to Ecuador, where he announced new measures targeting criminal gangs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4b9d33994ffeb80d7e3fee87995208d21732e91",
      "title": "Trump to rebrand Pentagon as Department of War ",
      "url": "https://www.bbc.com/news/articles/cgr9r4qr0ppo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T00:52:12.000Z",
      "summary_90w": "",
      "raw": "The US president has sought to refocus the department on \"warfighting\" and a \"warrior ethos\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c26b30d509413fcaa64ddd3eb4b12743ef48dad",
      "title": "Watch: UK online speech laws 'not a good thing', says Trump",
      "url": "https://www.bbc.com/news/videos/czjvyrrgrvlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T00:39:40.000Z",
      "summary_90w": "",
      "raw": "The US president made the remarks during a dinner hosting prominent tech leaders at the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf49a3e09441b2f36f62996963ffb613e520e8c5",
      "title": "Russia is leader in prosthetic limbs thanks to Ukraine war, says Kremlin official",
      "url": "https://www.theguardian.com/world/2025/sep/05/russia-prosthetic-limbs-manufacture-ukraine-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T00:24:43.000Z",
      "summary_90w": "",
      "raw": "Deputy defence minister Anna Tsivilyova said those coming back from the battlefield had become a ‘driver’ in pushing Russia’s innovation in prosthetics\n\nA Kremlin official has said that the number of soldiers wounded fighting in Ukraine had helped to make Russia a world leader in the manufacture of prosthetic limbs.\nDeputy defence minister Anna Tsivilyova, reportedly a relative of President Vladimir Putin, told a conference in Vladivostok that those coming back from the battlefield had become a “driver” in pushing Russia’s innovation in prosthetics.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76f6fc0d1ff17b4f1046b2f40bff9d5d5bc04332",
      "title": "'Alligator Alcatraz' immigration centre can stay open, appeals court rules",
      "url": "https://www.bbc.com/news/articles/crl5ry3rgzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T23:34:59.000Z",
      "summary_90w": "",
      "raw": "Florida Governor Ron DeSantis welcomes the ruling and declares the Everglades site \"open for business\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de05b21beb83efc24dd2eba5cd6a151663e1a65e",
      "title": "Bret Taylor’s Sierra raises $350M at a $10B valuation",
      "url": "https://techcrunch.com/2025/09/04/bret-taylors-sierra-raises-350m-at-a-10b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T23:33:40.000Z",
      "summary_90w": "",
      "raw": "Customer service AI agent startup Sierra claims to have hundreds of customers, including SoFi, Ramp, and Brex, among others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d7040d93ced80935ebce1a04b866b9e1d7552bc4",
      "title": "The best iPad deals you can get right now",
      "url": "https://www.theverge.com/21280354/best-ipad-deals-apple",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T23:33:28.000Z",
      "summary_90w": "",
      "raw": "You can currently save up to $200 on Apple’s M4-equipped iPad Pro. | Photo: Amelia Holowaty Krales / The Verge\t\n\nWhile the best iPad deals usually land during major sale events like Black Friday and Amazon Prime Day, many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most affordable iPad. The most recent iPad Pro and iPad Mini are also regularly discounted, as is the latest iPad Air.\n\nThe best iPad (2025) deals\nThe best iPad Mini (2024) deals\nThe best iPad Air (2025) deals\nThe best iPad Pro (2024) deals\n\nIt’s difficult to know where exactly you can find the most notable iPad deals unless you’re scouring the major retailers on a daily basis. But that’s often what our deal hunters at The Verge are doing, so let us help you out. Below, we’ve listed the best deals you can get on each iPad model that is available, from the 11th-gen base iPad to the more powerful models with M3 and M4 chips, all of which are set to receive Apple’s iPadOS 26 update when it arrives in the fall.\nThe best iPad (2025) deals\nApple iPad (11th-gen)\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $349 $299 at Walmart (128GB, Wi-Fi)\n $449 $399 at Amazon (256GB, Wi-Fi)\n\nApple’s 11th-gen iPad landed on the scene in March. The newest base model tablet is a fairly iterative update of the prior model, but with 128GB of base storage (as opposed to 64GB) and the A16 Bionic chip, which is nearly 30 percent faster than the A14 chip used in the 10th-gen iPad. That being said, the newer chip doesn’t support the various Apple Intelligence features introduced in iPadOS 18.1 and subsequent updates. For that, you’ll want to opt for a more recent iPad Air, iPad Mini, or iPad Pro model.\nPricing-wise, the latest iPad starts at $349 with Wi-Fi and 128GB of storage. You can also upgrade to 256GB or 512GB of storage for an additional $100 or $200, respectively, or purchase an LTE model starting at $499. We saw a pretty significant price drop to $279 during Prime Day, though you can still find the entry-level model on sale at Amazon and Walmart starting at $299 ($50 off). Alternatively, you can purchase the 256GB model at Amazon and Walmart starting at $399 ($50 off), or the 512GB variant at Amazon and Walmart for around $600 (about $50 off).\nThe best iPad Mini (2024) deals\niPad Mini (2024)\n\nWhere to Buy:\n\n $499 $474 at Amazon (128GB, Wi-Fi)\n $599 $574.3 at Amazon (256GB, Wi-Fi)\n $799 $749 at Amazon (512GB, Wi-Fi)\n\nThe seventh-gen iPad Mini is similar in several ways to the previous model, but comes with some big internal upgrades. It includes faster Wi-Fi and USB-C speeds, support for the Apple Pencil Pro, and a newer A17 Pro processor with 8GB of RAM to support Apple Intelligence. Otherwise, it boasts nearly identical specs and features as the last-gen model, meaning it has an 8.3-inch Liquid Retina display and options for 5G. It may not be worth upgrading if you already own a sixth-gen Mini, but newcomers to the category will appreciate the upgrades.\nThe 2024 iPad Mini starts at $499 with 128GB of storage, which was the price for the previous generation’s 64GB model. Electing for 256GB of storage brings the price up to $599, and the cellular models start at $649. These are some big numbers for a small iPad, so the larger iPad Air might be worth considering if you prefer your dollar to go further with more screen real estate. But if you want an Apple tablet in the smallest possible form factor, this is where the action is.\nRight now, the 128GB base model with Wi-Fi is on sale at Amazon for $474 ($25 off), which is about $95 short of the all-time low we saw during Prime Day. If you need additional storage, you can also pick up the 256GB variant at Amazon and Walmart starting at $574.30 (about $25 off), or the 512GB model at Amazon for $749 ($50 off).\nThe best iPad Air (2025) deals\n11-inch iPad Air M3\n\nWhere to Buy:\n\n $599 $542.3 at Walmart (128GB, Wi-Fi)\n $699 $629 at Amazon (256GB, Wi-Fi)\n $899 $811.47 at B&H Photo (512GB, Wi-Fi)\n\n\n13-inch iPad Air M3\n\nWhere to Buy:\n\n $799 $733.65 at Amazon (128GB, Wi-Fi)\n $899 $829.56 at Amazon (256GB, Wi-Fi)\n $1099 $999 at Amazon (512GB, Wi-Fi)\n\nThe 2025 iPad Air is little more than a spec bump over the previous model, with a few technical upgrades that should allow it to last longer into the future than either the entry-level iPad or the last-gen Air. It features an M3 chip with support for Apple Intelligence, plus compatibility with Apple’s latest Magic Keyboard that has a larger trackpad and an extra row of function keys. In short, the Air is a credible laptop replacement.\nThe 11-inch model starts at $599 and the 13-inch variant $799 — the same price as prior models — but it’s common to see discounts from third-party retailers. Right now, for instance, the 11-inch Air is on sale at Amazon, Walmart, and B&H Photo in its base configuration with Wi-Fi and 128GB of storage starting at around $542 (about $57 off). You can also grab the 256GB model at Amazon and B&H Photo for $629 ($70 off), or the step-up 512GB model at B&H Photo starting at $811.47 (around $88 off).\nThe larger 13-inch model, meanwhile, is on sale at Amazon and Walmart with 128GB of storage starting at $733.65 (about $66 off). You can also pick up the 256GB model at Amazon and Walmart starting at $829.56 (about $70 off), or the 512GB variant at Amazon for $999 ($100 off).\nThe best iPad Pro (2024) deals\n11-inch iPad Pro (2024)\n\nWhere to Buy:\n\n $999 $899 at Amazon (256GB, Wi-Fi)\n $1199 $1081.43 at Amazon (512GB, Wi-Fi)\n $1599 $1471 at Amazon (1TB, Wi-Fi)\n\n\n13-inch iPad Pro (2024)\n\nWhere to Buy:\n\n $1299 $1192.99 at Amazon (256GB, Wi-Fi)\n $1499 $1382.92 at Amazon (512GB, Wi-Fi)\n $1899 $1699 at Amazon (1TB, Wi-Fi)\n\nThe 2024 iPad Pro is a far more impressive upgrade than the latest iPad Air. The 11- and 13-inch models start at $999 and $1,299, respectively, and they were the first Apple devices to feature the company’s latest M4 chip, which brings moderate performance gains and dedicated hardware for on-device Apple Intelligence processing. The new Pro models can claim other firsts, too, such as being the first iPad models with OLED displays and the lightest Pros yet, which is true of both sizes. They also feature repositioned front-facing cameras that sit along the horizontal edge (also found in the 11th-gen iPad), which prevent you from looking as though you’re staring off into space on a video call.\nAs for deals, the base 11-inch iPad Pro with 256GB of storage is currently on sale at Amazon and B&H Photo for $899 ($100 off), while the model with Wi-Fi and 512GB of storage is $1,081.43 (about $118 off) at Amazon and Walmart. The sleek and super-thin 13-inch model, meanwhile, is on sale in its 256GB base configuration at Amazon and Walmart starting at $1,192.99 ($107 off), or in its 512GB configuration at Amazon and Walmart starting at $1,382.92 (about $117 off). Amazon also has the 1TB model for $1,699 ($200 off) if you’re looking for more storage to hold your apps, photos, and videos.\nWhile there are some enticing deals on the iPad Pro with the M4 chip, it’s worth noting that the current model is more than a year old. That means if you want the most up-to-date tech, you may want to hold off before making your decision. A recent report from Bloomberg suggests that a new iPad Pro with an M5 chip could arrive as early as the fall, which is around when iPadOS 26 is expected to become available.\nUpdate, September 4th: Updated to reflect current pricing and availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a3a5aa109e1013886001d54e97964b4c78d95b7",
      "title": "Sir John Curtice: How Reform's capture of the Brexit vote could be enough to win an election",
      "url": "https://www.bbc.com/news/articles/cwy853rj2kzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T23:31:21.000Z",
      "summary_90w": "",
      "raw": "The party has now been ahead in the polls for five months, but can it keep the momentum?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3093303bed3cba5c0debebac8b29cfe438f9a504",
      "title": "David Bowie’s secret final project discovered locked in his study ",
      "url": "https://www.bbc.com/news/articles/c3dpdpvj083o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T23:27:15.000Z",
      "summary_90w": "",
      "raw": "Shortly before his death, the star wrote dozens of notes for a musical set in 18th Century London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64733e6cf4b4504467f6c24b8d2545b3ef70b563",
      "title": "Lawyer of British teenager held in Georgia jail criticises British embassy",
      "url": "https://www.bbc.com/news/articles/cvg43xxerlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T23:05:29.000Z",
      "summary_90w": "",
      "raw": "Bella Culley is in prison in Georgia waiting to see if enough money can be raised for her release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02f504e5ea738c87577a6a427f99746592866cf3",
      "title": "Rivian makes its second small workforce cut of the year ahead of R2 SUV launch",
      "url": "https://techcrunch.com/2025/09/04/rivian-makes-its-second-small-workforce-cut-of-the-year-ahead-of-r2-suv-launch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T23:03:34.000Z",
      "summary_90w": "",
      "raw": "The company previously laid off around 140 workers in its manufacturing division in June.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5d2a1e2868f6c9d5f4ba9074d325ec1188896e5",
      "title": "Error leaves 55,000 diabetes patients needing new tests",
      "url": "https://www.bbc.com/news/articles/c4g7d3w7gdlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T23:01:22.000Z",
      "summary_90w": "",
      "raw": "Errors by diabetes analysis machines mean at least 55,000 people in England will need further hospital tests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ff2cfd45348d73727073e95ca44b2167af9e3a17",
      "title": "'My mother was my shelter and storm': Arundhati Roy on her fierce new memoir",
      "url": "https://www.bbc.com/news/articles/c4gzdnp43l8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T22:47:37.000Z",
      "summary_90w": "",
      "raw": "Mother Mary comes to me is a raw, bruising, yet life-affirming portrait of Arundhati Roy's mother.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42d66c0a19ec62e3f320957bf4419a9ab7ac6085",
      "title": "RFK Jr defends leadership as lawmakers grill him on vaccines",
      "url": "https://www.bbc.com/news/articles/cn4l7p771m4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T22:10:45.000Z",
      "summary_90w": "",
      "raw": "The health secretary clashed with lawmakers as they accused him of restricting Americans' access to vaccines.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c663f076626c2a351af5f6de812fb91fbc61d02",
      "title": "Melania Trump warns 'robots are here' in rare public outing",
      "url": "https://www.bbc.com/news/articles/cn82lp7y3pro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T22:03:06.000Z",
      "summary_90w": "",
      "raw": "The first lady has taken a different - and selective - approach to her duties in the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "172dd30dae722cb54c530e10c053ded8a0268208",
      "title": "Warner Bros. Discovery sues Midjourney for generating &#8216;countless&#8217; copies of its characters",
      "url": "https://www.theverge.com/news/772101/midjourney-ai-generator-warner-bros-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T21:49:27.000Z",
      "summary_90w": "",
      "raw": "Midjourney allegedly generated these images of Batman and the Joker. | Image: Warner Bros. Discovery via Midjourney\t\n\nWarner Bros. Discovery is suing Midjourney over claims the AI startup “brazenly dispenses its intellectual property as if it were its own,” as reported earlier by The Hollywood Reporter. In the lawsuit, Warner Bros. Discovery alleges that Midjourney generated “countless” infringing images and videos of its copyrighted characters, including Superman, Bugs Bunny, Scooby-Doo, and more.\nWarner Bros. Discovery accuses Midjourney of reproducing, displaying, and distributing “unauthorized derivatives” of its intellectual property through its AI image and video generation tools. Throughout the lawsuit, Warner Bros. Discovery shares several examples of how Midjourney’s AI tools seem to have generated images of copyrighted characters, like Wonder Woman, Tweety, the Power Puff Girls, and even Rick and Morty in response to prompts asking to see the characters in certain situations.\nAdditionally, Warner Bros. Discover claims that Midjourney will generate infringing images even if prompts don’t mention a specific character. For instance, Midjourney allegedly generated downloadable images of Superman, Batman, and Flash after receiving the prompt, “classic comic book superhero battle.” Midjourney is facing a similar copyright lawsuit from Disney and Universal, which called the company’s AI image generator a “virtual vending machine” that generates “endless authorized copies” of their work.\nWarner Bros. Discovery claims Midjourney is aware of the “breathtaking scope of its piracy and copyright infringement” but refuses to protect copyright holders. \n“It is hard to imagine copyright infringement that is any more willful than what Midjourney is doing here,” the lawsuit states. “Midjourney is purposefully exploiting Warner Bros. Discovery’s valuable intellectual property to attract subscribers to Midjourney, and it is profiting by providing subscribers with endless copies and derivatives of Warner Bros. Discovery’s Copyrighted Works.”\nWarner Bros. Discovery is suing Midjourney for damages related to the alleged copyright infringement, and is asking the court to block Midjourney from copying, displaying, or distributing its intellectual property, as well as to stop the company from offering AI tools without copyright protection measures. Midjourney didn’t immediately respond to a request for comment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a3fef5aea4042dc7da688fdd5b05ff2ff8cc54cf",
      "title": "The U.S. government is taking a stake in Intel. It's rare — but not unprecedented",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5520753/the-u-s-government-is-taking-a-stake-in-intel-its-rare-but-not-unprecedented",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T21:44:11.000Z",
      "summary_90w": "",
      "raw": "The Trump administration last month took a 10% stake in chipmaker Intel. It's not the first time the government has taken a stake in a U.S. firm, but the circumstances are unusual and the desired outcome -- renewed American prowess in chipmaking -- is far from guaranteed.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "454d2a32626faced17e80613b1e5084dd98ce897",
      "title": "Teen killed and seven injured in mass stabbing in Canada",
      "url": "https://www.bbc.com/news/articles/cp8jnrrlvqvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T21:37:32.000Z",
      "summary_90w": "",
      "raw": "Investigators said the 18-year-old killed was the sister of the suspect, who was known to police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b853897f31ba5fe4e0af82ca0525e82d24016ec",
      "title": "Facebook is trying to make ‘pokes’ happen again",
      "url": "https://techcrunch.com/2025/09/04/facebook-is-trying-to-make-pokes-happen-again/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T21:32:52.000Z",
      "summary_90w": "",
      "raw": "The poke-tracking feature is largely designed to appeal to younger users who have grown up with gamification elements built into their social apps, like Snapchat and TikTok Streaks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b62e0ae99f4392389aa544d3da745d6e25279d7f",
      "title": "Starmer must not meet Israeli president during UK visit, say Labour MPs",
      "url": "https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T21:32:37.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Isaac Herzog to visit London for expected talks with ministers, with UK on brink of recognising Palestinian statehood\nThe president of Israel will travel to London next week for a controversially timed trip amid outcry from Labour MPs who have urged Keir Starmer not to meet with the visiting delegation.\nThe arrival of Isaac Herzog is fraught with complication for ministers, with the UK government on the brink of recognising the state of Palestine at the UN general assembly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b054d1733fe88f570cbe6ef6e3f62a5210d08a",
      "title": "Tech companies pledge to ready Americans for an AI-dominated world",
      "url": "https://www.theverge.com/policy/772084/amazon-google-microsoft-white-house-ai-education",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T21:28:57.000Z",
      "summary_90w": "",
      "raw": "Amazon, Google, and Microsoft are among the companies committing to help prepare Americans for a world dominated by AI technology at a White House event on AI education Thursday.\nFirst Lady Melania Trump hosted a meeting of the White House’s AI education task force where several CEOs touted their commitments. President Donald Trump is expected to host tech CEOs in the Rose Garden later on Thursday, with an invite list that includes Meta’s Mark Zuckerberg, Apple’s Tim Cook, and OpenAI’s Sam Altman, The Hill reported.\nGoogle said it would allocate $150 million of the $1 billion it already pledged toward education and job training to “grants to support AI education and digital wellbeing.” Microsoft is offering students access to Copilot with a free year of Microsoft 365 Personal if they verify with a school account, and offering free LinkedIn Learning courses on AI to students and teachers. And Amazon says it will help train 4 million people in AI skills and “enable AI curricula” for 10,000 educators in the US by 2028, while offering $30 million in AWS credits for organizations using cloud and AI tech in education.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d7a3e2584327f1df22c6e1ef2ed6915d7b46d228",
      "title": "Sweden accuses Russia of GPS jamming over Baltic Sea ",
      "url": "https://www.bbc.com/news/articles/clyx3ly54veo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T21:28:08.000Z",
      "summary_90w": "",
      "raw": "Interferences to satellite navigational systems occur almost daily, aviation officials say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea144f78d4dc63602b3dd5734594393ab18a39cf",
      "title": "The U.S. is designating Ecuador's largest gangs as terrorists",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5529328/ecuador-rubio-drug-gangs-designated-terrorists",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T21:18:35.000Z",
      "summary_90w": "",
      "raw": "The U.S. is designating Ecuador's two largest gangs — Los Choneros and Los Lobos — as foreign terrorist organizations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cdd00e6d49216477eb35801be6d1c96d79adccb0",
      "title": "Stripe enlists a who’s who, including Anthropic, OpenAI, and Paradigm, to build a new blockchain",
      "url": "https://techcrunch.com/2025/09/04/stripe-enlists-a-whos-who-including-anthropic-openai-and-paradigm-to-build-a-new-blockchain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T21:07:34.000Z",
      "summary_90w": "",
      "raw": "Stripe is funding a new blockchain called Tempo to process stablecoins faster. And many big names are joining the effort.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a6ef6bb6af71d03ede6e8738e172880d4db0e8c2",
      "title": "What will be Levy's legacy as his Spurs era ends?",
      "url": "https://www.bbc.com/sport/football/articles/cn76l4z3m2mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T21:05:39.000Z",
      "summary_90w": "",
      "raw": "Tottenham's success off the field under chairman Daniel Levy will always be overshadowed by failures on it, says chief football writer Phil McNulty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9a51e95cd53257f50b6a5f87cc16b9b87879356",
      "title": "Government can challenge Palestine Action appeal",
      "url": "https://www.bbc.com/news/articles/ckgejwx3grlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T21:04:00.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have been arrested over alleged support for the group, which is banned under terror legislation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "22005cf334469873df510be2ee6d1c2c7753393b",
      "title": "Here are the best Apple Watch deals available right now",
      "url": "https://www.theverge.com/21289209/best-apple-watch-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T21:00:00.000Z",
      "summary_90w": "",
      "raw": "The second-gen Apple Watch SE remains a gateway smartwatch if there ever was one. | Photo: Amelia Holowaty Krales / The Verge\t\n\nAt the end of last year, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now more Apple Watch models on the market than ever before — and a lot more deals to be had.\n \n\nThe best Apple Watch Series 10 deals\nThe best Apple Watch SE deals\nThe best Apple Watch Ultra 2 deals\nA note on the more premium models\n\nBut with all of those options, which one should you pick? Generally speaking, you want to buy the newest watch you can afford so that it continues to receive software updates from Apple. The latest update, watchOS 11, launched in September on the Series 6 and newer models, ultimately leaving those still using an older Series 4 or 5 behind. Fortunately, the next iteration of watchOS will continue to support the same devices when it arrives in the fall, even if Apple is revamping its naming convention in a bid to standardize its operating system names.\nThat said, picking up a watch from the latest (or a recent) generation ensures you’re getting a wearable with an updated design, a robust feature set, and plenty of sensors. Just keep in mind that Apple will likely announce a new flagship model — and perhaps a third-gen Apple Watch Ultra — at its iPhone 17 launch event on September 9th, meaning the price of current-gen models is likely to fall in the near future.\nNow, let’s get to the deals.\nThe best Apple Watch Series 10 deals\nApple Watch Series 10 (42mm, GPS)\n\nWhere to Buy:\n\n $399 $329 at Amazon\n $399 $329 at Walmart\n $399 $385.99 at Best Buy\n\n\nApple Watch Series 10 (46mm, GPS)\n\nWhere to Buy:\n\n $429 $359 at Amazon\n $429 $359 at Walmart\n $429 $372.43 at Best Buy\n\nThe Apple Watch Series 10 represents the latest wearable in Apple’s flagship Series lineup. It features the newer S10 SiP chip, faster charging, and a wide-angle OLED display that’s brighter, larger, and easier to read than that of previous models. It weighs half as much as the Ultra, too, and is about 30 percent thinner despite its 42mm and 46mm sizing. Other upgrades include an added depth and water temperature sensor, as well as a new FDA-cleared sleep apnea detection feature, the latter of which is also available on the last-gen Series 9 and Ultra 2.\nWhile the improvements are welcome, the Series 10 isn’t a vast departure from the prior model, the Series 9. That said, it’s currently on sale at Amazon and Walmart in the 42mm sizing with GPS starting at $329 ($70 off), which is $50 shy of its recent Prime Day low. The 46mm variant, meanwhile, is on sale at Amazon and Walmart for its typical sale price of $359 (also $70 off), while the LTE models can be had at Amazon and Walmart starting at $429 ($100 off).\nRead our Apple Watch Series 10 review.\nThe best Apple Watch SE deals\n2022 Apple Watch SE (40mm, GPS)\n\nWhere to Buy:\n\n $249 $189 at Amazon\n $249 $189 at Walmart\n $249 $229.99 at Best Buy\n\n\n2022 Apple Watch SE (44mm, GPS)\n\nWhere to Buy:\n\n $279 $199 at Amazon\n $279 $219 at Walmart\n $279 $269.99 at Best Buy\n\nThe Apple Watch SE received a refresh in late 2022. It has the same chipset as the Series 8, which is great, but with fewer sensors, no always-on display, and a slightly outdated design compared to the Series 8, 9, and 10. Those omissions might take this out of the running for some people, but it still may be exactly what you’re after. Best of all, it starts at $249 for the 40mm Wi-Fi / GPS model, which is $30 less than the previous generation’s baseline cost. Opting for cellular connectivity increases the starting price to $299 for the 40mm size (the 44mm size adds $20 to each configuration).\nRight now, the best deal on the latest SE can be found at Amazon and Walmart, where you can pick up the 40mm model with GPS starting at $189 ($60 off). The 44mm / GPS configuration, meanwhile, is available at Amazon starting at $199 ($80 off) or Walmart starting at $219 ($60 off), neither of which is a particularly notable discount. If you want the LTE configuration, the 44mm model is on sale at Walmart starting at $269 ($60 off), which is about $20 shy of the best price we’ve seen on the step-up LTE configuration.\nRead our Apple Watch SE (second-gen) review.\nThe best Apple Watch Ultra 2 deals\nApple Watch Ultra 2\n\nWhere to Buy:\n\n $799 $741.89 at Amazon (with Trail Loop)\n $799 $774 at Amazon (with Alpine Loop)\n $799 at Amazon (with Ocean Band)\n\nThe latest Apple Watch Ultra launched at $799 in September with GPS and LTE support, much like the original model. The ultra-capable smartwatch has the most features, sensors, and ruggedness of any Apple Watch model available thus far, along with a display that’s 50 percent brighter than the first Ultra. The 49mm smartwatch also packs Apple’s S9 SiP and second-gen ultra wideband chips, just like the Apple Watch Series 9, while maintaining long-lasting battery life, precise GPS tracking, and a bevy of diving-friendly sensors.\nThanks to Amazon Prime Day, we recently saw the Apple Watch Ultra 2 dip to its lowest price to date in select configurations. Unfortunately, the best deals available right now only extend to the Trail Loop and Alpine Loop variants, which are on sale at Amazon starting at $741.89 (about $57 off) and $774 ($25 off), respectively. You can also pick it up with an Ocean Band at Amazon, Best Buy, and Target, though only for its full retail price of $799.\nRead our Apple Watch Ultra 2 review.\nA note on the more premium models\nWhile all of the Apple Watch models and colorways covered here are encased in aluminum (except the Ultra 2, which has a titanium build), Apple does make a more premium range built out of stainless steel and titanium. These offerings are functionally and aesthetically similar to their aluminum counterparts, with slightly refined colors and finishings — polished for the stainless steel and brushed for the titanium. However, they start at much steeper prices of $699 and above. They, too, can often be found on sale, but they’re never discounted as low as the standard base models, so we don’t include them here.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f7914065cdd26d64f9bbe6a34411f4ee306b0c13",
      "title": "Mark Zuckerberg sues Mark Zuckerberg",
      "url": "https://techcrunch.com/2025/09/04/mark-zuckerberg-sues-mark-zuckerberg/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T20:59:30.000Z",
      "summary_90w": "",
      "raw": "Mark S. Zuckerberg, an attorney, says that he's losing business because his Facebook business profile keeps getting disabled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "09e2d7f98ff361b2162a6f930fe7d670ca3e8b9e",
      "title": "For mixed status families, deportation fears cast shadow over new academic year",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5515662/for-mixed-status-families-deportation-fears-cast-shadow-over-new-academic-year",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T20:43:58.000Z",
      "summary_90w": "",
      "raw": "As the new school year begins, mixed immigration status families face heightened fears about ICE enforcement near schools, creating anxiety that extends far beyond the classroom.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb4a8d2ff0c31ad1488c282f03a8abd30f0927df",
      "title": "TED leader’s $300M ‘valley of death’ fund might be just what later-stage climate tech needs",
      "url": "https://techcrunch.com/2025/09/04/ted-leaders-300m-valley-of-death-fund-might-be-just-what-later-stage-climate-tech-needs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T20:42:26.000Z",
      "summary_90w": "",
      "raw": "The new fund hopes to send a \"Seqouia-like\" signal to other investors that there are promising later-stage climate tech startups waiting to be funded.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "05d5fc75c6515532991512b7bd43705d506ecf2c",
      "title": "Boy, 3, pulled from funicular crash that has shocked Portugal",
      "url": "https://www.bbc.com/news/articles/cgrqj7ydr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T20:33:09.000Z",
      "summary_90w": "",
      "raw": "It is unclear what caused the crash in which 16 people died and more than 20 were injured, including many foreign nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99a094ee9fb50184192b99771e16e19f508d1b2f",
      "title": "The new Street Fighter movie Hadokens into theaters in October 2026",
      "url": "https://www.theverge.com/news/771977/street-fighter-movie-release-date-cast",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T20:04:04.000Z",
      "summary_90w": "",
      "raw": "Ryu in Street Fighter 6.\t\n\nThe new Street Fighter movie, which has been in the works since 2023, now has a cast and a release date. The film hits theaters on October 16th, 2026, and the cast includes some big names like Jason Momoa, 50 Cent, Orville Peck, and Eric André, according to a series of posts from an X account for the movie.\nHere is the cast revealed in those posts:\nAndrew Koji is Ryu\nNoah Centineo is Ken\nCallina Liang is Chun-li\nCody Rhodes is Guile\nOrville Peck is Vega\n50 Cent is Balrog\nJason Momoa is Blanka\nVidyut Jammwal is Dhalsim\nOlivier Richters is Zangief\nNirooki Goto is E. Honda\nDavid Dastmalchian is M. Bison\nRoman Reigns is Akuma\nAndrew Shulz is Dan Hibiki\nEric André is Don Sauvage\nMel Jarnson is Cammy\nRayna Vallandingham is Juli\nAlexander Volkanovski is Joe\nThe Hollywood Reporter also shared the film’s logline:\nSet in 1993, estranged Street Fighters Ryu (Andrew Koji) and Ken Masters (Noah Centineo) are thrown back into combat when the mysterious Chun-Li (Callina Liang) recruits them for the next World Warrior Tournament: a brutal clash of fists, fate, and fury. But behind this battle royale lies a deadly conspiracy that forces them to face off against each other and the demons of their past. And if they don’t, it’s GAME OVER!\nThe film, from Capcom and Legendary Entertainment, will be distributed by Paramount, which announced this week that it’s also working on a live-action Call of Duty movie.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e92944946cc3dc55edbfa2bba247cd9aeeee1281",
      "title": "Samsung’s ultra-thin Galaxy S25 Edge is $400 off right now",
      "url": "https://www.theverge.com/tech/771869/samsung-galaxy-s25-edge-8bitdo-pro-3-controller-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T19:55:19.000Z",
      "summary_90w": "",
      "raw": "Despite its slimmer frame, the Galaxy S25 Edge still offers all-day battery life.\t\n\nIf you’ve ever wished your phone didn’t protrude so much while in your pocket, then the Samsung Galaxy S25 Edge might be made for you. Samsung’s ultra-slim Android phone features the same 6.7-inch OLED display as the Galaxy S25 Plus, but the device’s 5.8mm thick design makes it feel completely different. Right now, you can grab the S25 Edge with 256GB of storage in black, silver, or blue for an all-time low price of $699.99 ($400 off) at Amazon.\nSamsung Galaxy S25 Edge\n\nWhere to Buy:\n\n $1099.99 $699.99 at Amazon (256GB)\n $1099.99 $849.99 at Best Buy (256GB)\n $1099.99 at Samsung (256GB)\n\nThe S25 Edge is a big phone, but its slimmer, more lightweight design means you can actually slide it into your pocket or evening bag without it protruding out. In fact, when The Verge’s Allison Johnson reviewed the device, she encountered multiple instances where she thought she had left the phone behind, despite it sitting in her pocket.\nNow, I know what you’re thinking: Surely the thinner design equals terrible battery life. Thankfully, that’s not the case. The Galaxy S25 Edge’s battery life doesn’t stretch as far as what you’ll get with the S25 Plus or Ultra, especially if you do a lot of mobile gaming, but it’ll still last you a full day of texting, email, web browsing, streaming music, and more.\nThe bigger tradeoff might be in the camera department. The S25 Edge comes with only two rear cameras — a 200-megapixel main camera and a 12-megapixel ultrawide camera. If a telephoto camera is a big deal to you, then you may want to skip this device. Otherwise, the S25 Edge can keep up with the other devices in the S25 lineup, with a Snapdragon 8 Elite chipset, IP68 dust and water resistance, and an OLED display with a 120Hz refresh rate.\nRead our Samsung Galaxy S25 Edge review.\nOther deals to check out\n8BitDo’s Pro 3 wireless controller is currently available in classic Nintendo-inspired colors like purple, gray, and light gray for $62.99 ($7 off) at Amazon after clipping the on-page coupon. The Pro 3 features swappable ABXY face buttons and joystick caps, providing players with a highly customizable experience. It also features new L4 and R4 macro buttons between the triggers and its USB-C charging port, plus more durable and power efficient TMR joysticks. The controller works with a ton of platforms via Bluetooth, including the Steam Deck, Windows PC, Mac OS, Android, Apple TV, and the latest Nintendo Switch 2. Read our review.\nIf you own a MacBook Air or slim Windows laptop, chances are you don’t have enough ports to connect your peripherals. A USB-C hub can help, and the Anker 7-in-1 USB-C Hub is on sale for $19.99 ($6 off) at Amazon, matching its all-time low price. The hub provides you with seven ports, greatly expanding your machine’s capabilities. It features two USB-C ports, two USB-A ports, an HDMI port that supports 4K at 60Hz, a TF card slot, and an SD card slot, which is essential for photographers.\nThe Lego Super Mario World: Mario & Yoshi set is down to an all-time low of $104 ($25 off) at Amazon, Walmart, and Target. The 1,215-piece set offers a pixelated recreation of a yellow-caped Mario riding Yoshi right out of the 16-bit Super Nintendo classic. The set stands at over 15 inches tall when assembled and includes a hand crank and dial that make Yoshi’s legs run and his tongue stick out.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e9d8fabee03d933eb215850655ae02b7b8b3255",
      "title": "Experiencing pain? Sanjay Gupta explains why 'It Doesn't Have to Hurt'",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5527017/sanjay-gupta-pain",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T19:49:06.000Z",
      "summary_90w": "",
      "raw": "Gupta's new book examines the world of pain — why we feel it, and how we can treat it. He says distraction and meditation can be useful tools for managing certain kinds of pain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8c71a94895033461307eb1f09980c5df6da90e1",
      "title": "Ex-Tory minister Nadine Dorries defects to Reform UK",
      "url": "https://www.bbc.com/news/articles/cj9zld87y1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T19:48:08.000Z",
      "summary_90w": "",
      "raw": "The ex-MP told the Daily Mail the Tory Party was dead and its members now \"need to think the unthinkable\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "What we know about Lisbon's deadly funicular crash",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T19:48:00.000Z",
      "summary_90w": "",
      "raw": "At least 16 people died after a carriage on the city's famous Glória hillside railway derailed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49ed059d5bd95c74f4a8af76f83470e4c62b7956",
      "title": "Fashion retailers partner to offer personalized AI styling tool ‘Ella’",
      "url": "https://techcrunch.com/2025/09/04/fashion-retailers-partner-to-offer-personalized-ai-styling-tool-ella/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:45:00.000Z",
      "summary_90w": "",
      "raw": "Ella provides recommendations to customers across the three retailers on what to purchase or rent to make an outfit come to life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc8b9742c873ae7d6d582dad0d977a92892db996",
      "title": "Senators from both parties grilled RFK Jr. on vaccines and more",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/04/nx-s1-5528966/rfk-kennedy-hearing-covid-vaccines-cdc",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T19:38:13.000Z",
      "summary_90w": "",
      "raw": "In a blistering hearing, Senators from both parties challenged the health secretary to defend his actions, including on vaccines access and CDC leadership.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5dd1788a91a3852f47e63a05708077bb02b48625",
      "title": "Why the medical community is thrilled by U.S. support for a 'breakthrough' HIV drug",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/04/nx-s1-5527019/hiv-prevention-drug-breakthrough-aids",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T19:35:12.000Z",
      "summary_90w": "",
      "raw": "Lenacapavir has the potential to end the HIV epidemic, researchers say. The Trump administration says backing this kind of effort will be a model for how it does global health work in the future.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40111d6d8cd7428b30ff467dc1d0a15782ed6d34",
      "title": "X’s encrypted DM feature, XChat, is rolling out more broadly",
      "url": "https://techcrunch.com/2025/09/04/xs-encrypted-dm-feature-xchat-is-rolling-out-more-broadly/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:32:34.000Z",
      "summary_90w": "",
      "raw": "Though the feature shipped in beta in May, XChat is now accessible for more users, including those who do not subscribe to X Premium.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c7335393fae6259fed0bd7277b4842fb4466e45",
      "title": "OpenAI announces AI-powered hiring platform to take on LinkedIn",
      "url": "https://techcrunch.com/2025/09/04/openai-announces-ai-powered-hiring-platform-to-take-on-linkedin/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:19:46.000Z",
      "summary_90w": "",
      "raw": "The OpenAI Jobs Platform is set to launch in mid-2026 and will use AI to match candidates with businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b470a237ca409bf5fcaa9504c826e08dbcc9cbc0",
      "title": "Who are the victims of the Lisbon funicular cable crash?",
      "url": "https://www.bbc.com/news/articles/cnvryg271ymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T19:14:12.000Z",
      "summary_90w": "",
      "raw": "Four employees of a non-profit organisation and a transport worker are among those who died.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e112176cb23e0c1fe8901be822985c8083d4cf24",
      "title": "Nepal blocks Facebook, Instagram, YouTube, X over rule breach, amid censorship concerns",
      "url": "https://techcrunch.com/2025/09/04/nepal-blocks-facebook-instagram-youtube-x-over-rule-breach-amid-censorship-concerns/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:06:54.000Z",
      "summary_90w": "",
      "raw": "Nepal has moved to block 26 social media platforms for failing to comply with its registration requirements.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "08fd8d4e1f16ba30279d8277090cd523389778ea",
      "title": "AI logistics startup Augment, from Deliverr’s founder, raises massive $85M Series A",
      "url": "https://techcrunch.com/2025/09/04/ai-logistics-startup-augment-from-deliverrs-founder-raises-massive-85m-series-a/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:00:00.000Z",
      "summary_90w": "",
      "raw": "The new funding, which was led by Redpoint, comes just five months after the startup launched out of stealth with a $25 million seed round.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb18bc0a7768057d44157826f710c24564473342",
      "title": "Waymo cleared to offer robotaxi rides at San Jose airport",
      "url": "https://techcrunch.com/2025/09/04/waymo-cleared-to-offer-robotaxi-rides-at-san-jose-airport/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T18:56:29.000Z",
      "summary_90w": "",
      "raw": "It's the first airport in California that Waymo will offer rides to and from. The company's been active at the Phoenix airport for nearly two years.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37fc9572af448c05a03a9544fff471b0df0ee41a",
      "title": "Jaguar Land Rover staff to stay at home in cyber attack fallout",
      "url": "https://www.bbc.com/news/articles/c1jzl1lw4y1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T18:45:00.000Z",
      "summary_90w": "",
      "raw": "The company continues the complex work of restoring its systems after the cyber attack on the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "428649f82c24fcb60939bc1264816eab0af367b5",
      "title": "Here are the best robot vacuum deals available right now",
      "url": "https://www.theverge.com/24350561/best-robot-vacuum-mop-irobot-roomba-eufy-roborock-deals-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T18:42:52.000Z",
      "summary_90w": "",
      "raw": "The Roborock Saros Z70 offers a built-in robotic arm and is currently a whopping $1,000 off. | Photo by Jennifer Pattison Tuohy / The Verge\t\n\nWe’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordable way to experience that promised utopia right now.\nToday’s floor cleaners are also more advanced than ever. In addition to vacuuming, many of the best models can now mop, allowing you to tackle both carpet and hardwood flooring. Some can automatically dispense of their trash and dirty water, too, and clean their own components without intervention. We now even have models that can pick up dirty laundry and purify the air in your home, preventing you from having to lift a finger.\n\n\n\n\n\nThe best Roborock deals\nThe best Dreame deals\nThe best SwitchBot deals\nThe best Eufy deals\nThe best Shark deal\nThe best Roomba deals\nOther robot vacuum deals\n\nBut if you need something relatively affordable for daily cleaning, you’d be surprised how little you have to pay for premium features. Below, we’ve listed the best deals currently available on a slate of Verge-approved robot vacuums, whether you prefer a budget entry-level model from Yeedi or a top-of-the-line offering from iRobot, Dreame, and more.\nThe best Roborock deals\nRoborock’s S8 MaxV Ultra, our pick for the best robot vacuum overall, is available at Amazon and Best Buy for $999.99 ($800 off), which is its best price to date. The combination of a 10,000Pa suction power and dual rubber roller brushes makes it a terrific vacuum, one that can easily pick up pet hair and other debris. It can also mop with great efficiency thanks to a sonic mopping system that vibrates the mop pad 4,000 times a minute, allowing it to clean sticky juices, thick condiments, and other common spills. The mop arm can extend to cover corners and baseboard edges, too.\nThe S8 MaxV Ultra’s camera-equipped AI obstacle avoidance makes it the best navigator in Roborock’s lineup and one of the top models overall, though it’s not quite as strong as Roomba’s. The mobile app offers ample options to customize cleaning zones and schedules, and you can use its dedicated voice assistant to start and stop routines. It’s also a Matter-ready robot that’s compatible with Amazon Alexa, Google Home, and Apple Home.\nRoborock S8 MaxV Ultra\nWith top-notch vacuuming performance, an easy-to-use app, and built-in voice control, the S8 MaxV Ultra is a superb vacuum and good mop. It features Roborock’s best obstacle detection, innovative features like dirt detection, and a hands-free dock that makes it an expensive but excellent choice.\n\nWhere to Buy:\n\n $1799.99 $999.99 at Amazon \n $1799.99 $999.99 at Best Buy\n\nThe Roborock Q8 Max Plus is a cheaper alternative you can currently pick up from Walmart for $379.99 ($440 off), which is a new record low price. It isn’t as powerful or feature-packed as the S8 MaxV Ultra, but it still delivers a solid 5,500Pa of suction power, rendering it good enough for most cleaning tasks. It also handles mopping well, with 30 adjustable water flow levels and a sizable 350ml water tank that allows it to cover larger areas without frequent refills. The robovac can map your home efficiently and avoid most obstacles thanks to built-in lidar navigation, though it lacks a built-in camera for advanced object recognition.\nRoborock Q8 Max Plus\nThe Roborock Q8 Max Plus offers strong 5,500Pa suction, solid mopping features, and reliable obstacle avoidance.\n\nWhere to Buy:\n\n $819.99 $379.99 at Walmart\n\nThe new Roborock Saros Z70 is on sale for $1,599 ($1.00 off) directly from Roborock, which is a new low price. What sets it apart from other robot vacuums is its built-in robotic arm, which can pick up items such as socks, tissues, towels, and even small sandals. While the arm isn’t entirely reliable, the Z70 is still a highly capable robovac with 22,000Pa suction power. It features a dual anti-tangle system, along with spinning mop pads that lift to avoid carpets and detach automatically. Roborock’s StarSight navigation system even allows you to teach the robovac to recognize specific objects, while the AdaptLift chassis lets it climb over thick carpets. What’s more, the Matter-compatible vacuum seamlessly integrates with Roborock’s Multifunctional Dock 4.0, which handles auto-emptying, charging, and both the refilling and draining of its water tanks. Read our review.\nRoborock Saros Z70\nThe Roborock Saros Z70 offers built-in robotic arm that can pick up light items like socks. It’s also a powerful robovac / mop hybrid, with with 22,000Pa suction and dual spinning mop pads that lift and detach automatically.\n\nWhere to Buy:\n\n $2599 $1599 at Roborock\n $2599 at Amazon\n\nThe best Dreame deals\nThe Dreame X40 Ultra is a self-extending mopping robot, and while it’s on the more expensive side, you can currently pick it up for $849.99 ($650 off) directly from Dreame, which is one of its better prices to date. You’re paying a premium for 12,000Pa of suction power and a pair of removable, self-retracting mop pads, which it can automatically clean and dry on its own using the included base. It can also empty its own bin and refill its own water tank.\nThe Dreame X40 Ultra features an extendable side brush and mop pads, too, offering better coverage for baseboards, corners, and the underside of your furniture. It uses a combination of AI-powered cameras and “3D-structured light” (presumably based on lidar technology) to map and navigate rooms, with customizable keep-out zones and more functions available in the app. There’s also a dirt detection system that can identify messier spills and adjust its cleaning routine accordingly.\nDreame X40 Ultra\nWith a neat ability to remove and reattach its mop pads, the Dreame X40 solves the problem of vacuuming carpets (with 12,000Pa suction power) while also mopping hard floors. Its mops can also swing out and under low furniture, getting where most bots can’t reach.\n\nWhere to Buy:\n\n $1499.99 $849.99 at Dreame\n $1499.99 $899.99 at Walmart\n $1499.99 $899.99 at Amazon\n\nThe Dreame L20 Ultra is currently available for $449.99 directly from Dreame, down from $999.99 and a new all-time low price.  The L20 Ultra is an excellent alternative to Dreame’s newer flagship robots, including the X40. It lacks a bit of power in comparison, though its 7,000Pa of suction power is still enough for most cleaning jobs. It also doesn’t have the L40’s tri-cut brush, which makes the step-up model more efficient at picking up pet hair. The only other real advantage the X40 holds over the L20 is its self-extending arms for vacuuming (though the dual mop pads can extend a bit for baseboard and corner coverage), nor does it have dirt detection.\nThe L20 Ultra’s base station is rather large, but it can take care of the entire cleaning process, including emptying the dustbin, emptying and refilling the water tanks, and washing and drying the mop pads. It doesn’t have a heated cleaning function for the mop pads, however. It uses a lidar-based AI-powered navigation system, and you can prompt it to start cleaning by voice using Amazon Alexa and Google Assistant voice commands.\nDreame L20 Ultra\nThe L20 Ultra is a great all-around bot that can remove its mop pads to vacuum carpet and do the splits with its mops to better clean your baseboards. It has 7,000Pa suction, a bigger base station, and fewer advanced cleaning features than the newer X30 and X40 Ultra models, but it’s still an excellent robot vacuum.\n\nWhere to Buy:\n\n $999.99 $449.99 at Dreame\n $999.99 $499.99 at Amazon\n $999.99 $499.99 at Walmart\n\nThe best SwitchBot deals\nThe SwitchBot S10 is available directly from SwitchBot for $399.99 ($800 off) when you use coupon code SLDE800, which is a new all-time low. The S10 is one of the most affordable robot vacuum / mop hybrids you can buy, one that can refill its own tank so long as you hook the battery-powered base station into your home’s plumbing. It can also dry its own mop pads and empty its own bin at a separate docking bay, and offers enough capacity to run for up to 90 days without intervention.\nThe S10’s self-cleaning roller mop is more effective than the typical pads we see in most other units, but it’s also limited to a smaller coverage area. It only has a single roller brush for vacuuming, but its respectable 6,500Pa suction can make up for it. And while it has lidar mapping and AI-powered obstacle avoidance, we found it still has a tendency to get stuck on laundry, bath mats, and other obstacles. The S10 is also one of the few robovacs with Matter support, however, which effectively enables native control through Apple Home, Google Home, and Alexa (though said platforms don’t yet fully support robot vacuums).\nRead our SwitchBot S10 review.\nSwitchBot S10\nThe S10 is a great mopping robot with a battery-powered water refill dock that makes it the most hands-free robovac we’ve tested. A separate auto-empty dock takes care of the dust. It’s big and loud and lacks some features found on high-end robots, but it does a great job of keeping your floors clean.\n\nWhere to Buy:\n\n $1199 $399.99 at SwitchBot (with code SLDE800)\n $1199 $474.99 at Amazon \n\nThe SwitchBot K10 Plus is available for $179.99 ($220 off) from SwitchBot (with promo code SLOD55), one of its better prices, through September 16th. At 3.6 inches high and 9.8 inches wide, it’s a more petite option if you want something that can maneuver tighter spaces, which it does to decent success with a lidar-based mapping system that supports digital keep-out zones. It only has 2,500Pa suction, but that should be powerful enough to lift dirt in all but the deepest carpeting. You can also attach disposable mopping pads, though their mopping function doesn’t work well. The K10 Plus comes with a self-emptying dock that can hold a respectable four liters of dirt before it needs emptying.\nSwitchBot K10 Plus\nThe smallest robot vac on the block, the K10 Plus, doesn’t compare to the other bots here in terms of performance, but if you have a small space where other vacs can’t get to, it’s better than nothing. It’s also very quiet, making it ideal for small spaces like home offices and bedrooms or a very small studio apartment.\n\nWhere to Buy:\n\n $399.99 $179.99 at SwitchBot (with code SLOD55)\n $399.99 $239.99 at Amazon\n\nThe best Eufy deals\nThe Eufy X10 Pro Omni — our current pick for the best midrange robot vacuum / mop — is down to $549.99 ($250 off) at Eufy’s online store when you use promo code WS24T2351, with Amazon matching that deal when you clip the on-page coupon.\nThe X10 Pro Omni is a bit of a novelty, at least in comparison to other robovacs in its price range, in that it offers AI-powered obstacle detection, which allows it to deftly navigate cables and other clutter. It also features a slew of functions you’d expect from top-of-the-line models, including 8,000Pa of suction power, speedy lidar-powered mapping, and oscillating dual spinning brushes for mopping.\nMind you, none of these features are as effective as they are on more premium models, though the result is an all-in-one bot that punches above its weight. Plus, it has heated mop drying and onboard water reservoir, the latter of which prevents it from having to return to its multifunction auto-empty / wash / fill dock too frequently.\nEufy X10 Pro Omni\nThe X10 is a great robovac with excellent AI-powered obstacle detection, powerful oscillating mops, a user-friendly app, and good mapping capabilities.\n\nWhere to Buy:\n\n $799.99 $549.99 at Amazon\n $799.99 $549.99 at Eufy (with code WS24T2351)\n $799.99 $699.99 at Best Buy\n\nNow through September 7th, the Omni S1 Pro is on sale for $599.99 ($700 off) when you purchase it from Eufy with offer code WSPDV2RWU4TS. The S1 Pro is an excellent robovac if you have mostly hardwood floors, with a long 11.4-inch roller mop, a square shape, and dual spinning side brushes that leave floors spotless (it can even reach into corners).\nWhat’s more, the S1 Pro is capable of self-washing its own mop with water jets as it cleans, which it can then dry afterward using hot air. It’s also a decent vacuum with 8,000Pa of suction, which is enough power to pick up most debris. Its AI-powered obstacle avoidance system is effective as well, allowing it to navigate around larger objects with relative ease. \nEufy Omni S1 Pro\nThe Eufy Omni S1 Pro’s 11.4-inch roller mop does a great job of cleaning up hardwood floors. It self-washes and dries its mop as it works, while doubling as a decent vacuum with 8,000Pa of suction.\n\nWhere to Buy:\n\n $1299.99 $599.99 at Eufy (with code WSPDV2RWU4TS)\n $1299.99 $999.99 at Amazon\n\nIf you’re looking for a bump-and-roll model that’s relatively budget-friendly, the discontinued Eufy 11S Max is still on sale at Amazon and Walmart for just $159.99 ($120 off). The 11S Max stands out from other robovacs because it doesn’t use Wi-Fi, meaning it doesn’t require you to fiddle with a mobile app on your phone. Instead, you can control it using an on-board button or with the included remote, which also allows you to create cleaning schedules. It’s relatively quiet and reliable, too, with 2,000Pa of suction power and replaceable parts, making it a great long-term investment for those who want something basic.\nEufy 11S Max\nThe Eufy 11S Max is a super slim, repairable bump-and-roll bot with a large 600ml bin and three cleaning levels. Its biggest selling point for some, however, is that it lacks Wi-Fi, meaning you don’t have to fiddle with an app.\n\nWhere to Buy:\n\n $279.99 $149.99 at Amazon\n $279.99 $149.99 at Walmart\n\nThe best Shark deal\nThe Shark Matrix Plus 2-in-1 is a great robot vacuum / mop hybrid that’s now on sale for $399.99 ($300 off) at Amazon, Best Buy, and directly from Shark, which is just $30 shy of its all-time low price. Before the Eufy X10 Pro Omni took its place, the Matrix Plus 2-in-1 was our runner-up pick for those seeking a midrange robot vacuum that mops and automatically empties its own bin. Its vibrating, sonic mopping feature does an excellent job of scrubbing hardwood floors; however, keep in mind that you’ll have to fill and attach the mop reservoir manually.\nShark Matrix Plus 2-in-1 Robot Vacuum and Mop\nThe Shark Matrix Plus 2-in-1 Robot Vacuum and Mop mops very well — doing a swinging, scrubbing movement with its rear end when in “Matrix mode.” However, you have to manually fill and attach the mop reservoir and empty the bin when it mops, as it only self-empties in vacuum mode and can only avoid larger objects.\n\nWhere to Buy:\n\n $699.99 $399.99 at Amazon\n $699.99 $399.99 at Shark\n $699.99 $399.99 at Best Buy\n\nThe best Roomba deals\nYou can get iRobot’s Roomba Combo 10 Max from Amazon and Best Buy for around $599 ($800 off), which is its best price to date. We think it’s the best robot vacuum for pet hair, one that combines high suction power with rotating dual rubber brushes that pick up without getting tangled. What’s even more impressive is that it comes with a new multifunction charging dock that allows it to empty its bin, wash its own mop, and even refill its mopping tank. Add in Matter support, excellent AI-powered obstacle detection, and a retractable mop arm, and you’ve got a robovac that makes cleaning almost entirely hands-free.\nRoomba Combo 10 Max\niRobot’s first mopping bot that can refill its water tank and wash and dry its mop, the Combo 10 Max, features a retractable mop arm and superior suction power. It’s also iRobot’s first robot to support Matter.\n\nWhere to Buy:\n\n $1399.99 $599 at Amazon\n $1399.99 $1199.99 at iRobot\n\nIf you’re working with a tight budget, the Combo i5 is also a good vacuum / mop — one you can pick up on sale directly from iRobot right now for around $199.99, down from $349.99. It’s not as powerful as the aforementioned Combo 10 Max and can’t refill its water tank or wash and dry its own mop; however, it still features Roomba’s wide, dual rubber brushes, which do an excellent job of picking up dirt and debris. It doesn’t support virtual keep-out zones or Matter, either, though you can schedule it to clean specific rooms at set times. It’s also compatible with both Amazon Alexa and Google Assistant, and like all Roombas, it’s relatively easy to repair.\niRobot Roomba Combo i5\nThe Roomba Combo i5 Plus is the company’s budget vacuum and mop robot with room mapping features but no virtual keep-out zones.\n\nWhere to Buy:\n\n $349.99 $199.99 at iRobot\n $549.99 $399.99 at Walmart (with self-emptying dock)\n\nOther robot vacuum deals\nNarwal Freo X Ultra\nA superior mopping bot with a superior price tag, the Narwal is smart enough to know when it needs to go back and mop more. Its vacuuming is good, and its unique onboard compression bin means no loud auto-emptying. \n\nWhere to Buy:\n\n $1399.99 $549.99 at Amazon\n $1399.99 $549.99 at Narwal (with code BTSXU)\n $1399.99 $699.99 at Best Buy\n\n\nDeebot X8 Pro Omni\nThe Deebot X8 Pro Omni remains our favorite robot vacuum / mop. It represents a welcome return to form for Ecovacs’ flagship line, with great obstacle avoidance, a small dock, and a convenient self-cleaning brush system.\n\nWhere to Buy:\n\n $1399.99 $899.99 at Amazon\n $1399.99 $899.99 at Evovacs\n\n\nTapo RV30 Max Plus\nA budget robot vacuum and mop with high-end features, including room-specific cleaning, carpet boost, and smart navigation, it also features an auto-empty dock for just $80 more.\n\nWhere to Buy:\n\n $329.99 $229.99 at TP-Link (with code 70RV30MAX)\n $329.99 $249.99 at Amazon\n\nUpdate, September 4th: Updated to reflect current pricing / availability and added a deal for the Roborock Saros Z70.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6befdfab880fac294aa6d9b0be1b1aa80a8f0b7b",
      "title": "Canada’s Mark Carney signals austerity measures as government shifts focus from Trump to economy",
      "url": "https://www.theguardian.com/world/2025/sep/04/canada-carney-budget-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T18:42:20.000Z",
      "summary_90w": "",
      "raw": "Prime minister cautions Canadians as Ottawa moves to curb spending to balance near-record military expenditures\nMark Carney has told Canadians to prepare for austerity measures and his finance minister warned of “tough choices” in the coming months, as the government attempts to balance near-record defence spending, cuts to government programs and a trade war with the United States.\nCarney, the former central banker and economist turned politician, has been meeting senior ministers before the fall budget, and hinted cuts were coming to the federal bureaucracy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8bc9772ebd965ac7a2363fa840da72859a2e7f2",
      "title": "Canada: one person killed and six injured in stabbing in remote First Nation community",
      "url": "https://www.theguardian.com/world/2025/sep/04/canada-hollow-water-first-nation-stabbing-manitoba",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T18:35:39.000Z",
      "summary_90w": "",
      "raw": "Royal Canadian Mounted Police said the suspect who attacked Hollow Water First Nation has also died \nOne person has been killed and six others injured in a mass stabbing in an Indigenous community in central Canada, according to federal police who said that the the suspect also died in the incident.\nThe violence occurred in Hollow Water First Nation, a remote community with about 1,000 residents, 217km (135 miles) north of Manitoba’s provincial capital, Winnipeg, the Royal Canadian Mounted Police told AFP.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4981f0785b7914bac84e415677f444c6ba3d3ea9",
      "title": "Why it’s so hard to make a ‘safer’ football helmet",
      "url": "https://www.theverge.com/design/771771/design-safer-helmets-nfl",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T18:30:00.000Z",
      "summary_90w": "",
      "raw": "When players take the field at the start of the NFL season, many will be sporting the new, subtly different F7 Pro helmet, which some have speculated might be the safest one football has ever seen. That's significant for a sport that, over the past two decades, has become as well known for concussions as end zone celebrations. Schutt Sports, which makes the F7 Pro, claims that 35 percent of active NFL athletes have already adopted the helmet. \nFootball is a sport with a traditionalist bent, particularly when it comes to this piece of gear. Case in point: one of Schutt's longtime users, Pittsburgh Steelers quarterback Aaron Rodgers. The Schu …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5b9300184c5d14f6baea7ed2b5752ede39788483",
      "title": "I tested a bunch of Switch 2 screen protectors, and these are the best",
      "url": "https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T18:27:50.000Z",
      "summary_90w": "",
      "raw": "This is what a Switch 2 looks like with a glossy glass protector attached to its screen. | Image: Cameron Faulkner/The Verge\t\n\nA glass screen protector is one of a few essential accessories that every Switch 2 owner should make, along with buying a protective case for the console. In fact, it should be a priority to stick one onto the console’s screen as soon as possible to avoid accidental scratches. \nI’ve been installing and removing Switch 2 screen protectors to test others on my console at an alarming rate, more than any sane person should, and here are the most important takeaways:\nDo not buy a flimsy plastic screen protector. They won’t protect your Switch 2 enough.\nIt’s impossible to tell different brands’ protectors apart once they’re on your screen; product packaging and the installation process are the biggest differences (as well as the key factors that increase cost).\nSome protectors are glossy and some are anti-reflective, each with its own tradeoffs. For my money, glossy is the way to go. The matte finish looks good, but it reduces the screen’s vivid quality and its viewing angles.\nOf the options below, it’s easiest to recommend amFilm’s three-pack of glossy screen protectors. Not only is the pack incredibly affordable ($7.19 from Amazon), but the tray also allows for perfect alignment of the glass protector for easy, bubble-free installation. I’ve used this company’s screen protectors on various gadgets for years, and I particularly like its glossy option over the matte finish, since it lets the Switch 2’s screen fully shine through.\namFilm three-pack of glossy screen protectors\nMy go-to screen protector brand for years has been amFilm. Three glossy tempered glass sheets come in the box, and the tools make installation fairly simple. JSAUX’s model is just as good based on my testing, and just as affordable.\n\nWhere to Buy:\n\n $8.65 $7.19 at Amazon\n\namFilm OneTouch two-pack of glossy screen protectors\nIn keeping up with some brands that offer faster installations, amFilm offers a two-pack of glossy protectors that includes a “OneTouch” tray. Remove the protector’s bottom film, attach the tray to your device, and then press gently on the protector until it’s fully applied.\n\nWhere to Buy:\n\n $15.99 $8.99 at Amazon\n\nDbrand Prism 2.0 two-pack of glossy screen protectors\nDbrand’s Prism 2.0 includes two glass protectors for the Switch 2, each nestled into plastic cases that fit perfectly around the edges of the console (with the Joy-Con 2 removed). $34.99 is expensive for two protectors, but if simplicity and elegant packaging trump value, then this is a good option.\n\nWhere to Buy:\n\n $34.95 at Dbrand\n\nGenki Aegis Shield two-pack of glossy screen protectors\nGenki offers a cheaper alternative to Dbrand with the Aegis Shield. It includes two protectors, and the installation process is nearly identical: just align the plastic frame with the console, pull the tab, and run your finger across the exposed section of the frame. Spigen makes a similar product that costs $24.99 for a two-pack.\n\nWhere to Buy:\n\n $19.99 at Amazon\n $19.99 at Genki\n\namFilm two-pack of matte screen protectors\nLet’s start with one of the most affordable options if you want to go the matte-textured route. AmFilm sells a two-pack of protectors at Amazon for $8.99. The set includes a plastic frame that serves as a guide to align the protector just right. JSAUX makes a similar product that’s the same price.\n\nWhere to Buy:\n\n $12.99 $9.99 at Amazon\n\namFilm OneTouch two-pack of matte screen protectors\nAmFilm also sells a two-pack with a OneTouch frame for easier installation. Again, keep in mind that opting for matte over glossy will reduce glare, but at the cost of viewing angles as well as the full vivid quality of the Switch 2’s screen. That’ll be an acceptable tradeoff for some, but not all people.\n\nWhere to Buy:\n\n $15.99 $12.99 at Amazon\n\nUpdate, September 4th: Adjusted prices as needed, and added a link to recent coverage of a pre-production sample of Jsaux’s Obsidian AR screen protector.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c77bac59ca34cd88dd13a7990501eb4f26902d18",
      "title": "Stardew Valley’s creator is in Silksong",
      "url": "https://www.theverge.com/news/771772/hollow-knight-silksong-stardew-valley-eric-barone-concernedape",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T18:11:02.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight: Silksong, the sequel to the indie smash hit Hollow Knight, is finally out, and according to Silksong’s credits, the game features the voice of Eric Barone, the creator of another indie smash hit, Stardew Valley. (You may also know Barone by the name ConcernedApe, which he goes by online.)\nYou can see Barone’s name listed under the “Additional Character Voices” section of Silksong’s credits, which are accessible from the Extras section of the game’s title screen. I’ve also included a screenshot below:\nCole Medeiros, head of operations and biz dev at ConcernedApe LLC, confirmed to The Verge that this is indeed the Eric Barone of Stardew Valley fame. However, Medeiros and Barone won’t reveal who Barone voices in Silksong; Barone would “rather not say which character(s) so as not to spoil any surprises for anyone,” Medeiros says.\nStardew Valley and Silksong share another connection, too. Matthew Griffin, who handles marketing and PR for Silksong, once held a similar role for Stardew Valley, according to Silksong developer Team Cherry’s website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d335af194891244455fd6d2ce4fc198a2c550649",
      "title": "Starmer considering digital ID scheme to tackle illegal migration",
      "url": "https://www.bbc.com/news/articles/c5y5379djl3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T18:07:51.000Z",
      "summary_90w": "",
      "raw": "The prime minister says the proposal could play an important part in tackling illegal working in the UK.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40375c780e803886b45d66a3673f9fdee4626d28",
      "title": "Senators grill Trump's nominee for Fed amid alarms over central bank independence",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526956/senate-federal-reserve-trump-stephen-miran",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T18:03:09.000Z",
      "summary_90w": "",
      "raw": "White House economist Stephen Miran was quizzed by senators about whether he could make decisions independently of President Trump, if he's confirmed to a seat on the Federal Reserve's governing board.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6f4ac2bdbaf2c6ac0b8306ef876270e698fc2905",
      "title": "Watch: Key moments from RFK Jr's heated Senate hearing",
      "url": "https://www.bbc.com/news/videos/ce8604l4vkmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T18:01:30.000Z",
      "summary_90w": "",
      "raw": "The US health secretary faced questions on Covid deaths and vaccines a week after firing the head of the Centers for Disease Control and Prevention.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dcbb4efe5d35c3fda1211fcb5447fd9d369538dc",
      "title": "Weekly quiz: Which name topped the new list of storms?",
      "url": "https://www.bbc.com/news/articles/c1mx0yv8lkmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T17:42:05.000Z",
      "summary_90w": "",
      "raw": "How much attention did you pay to what happened in the world over the past seven days?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0598028281469c398c5565980fa371f78a490da8",
      "title": "A clash of the comebacks: Osaka and Anisimova face off in the U.S. Open semifinals",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5528663/naomi-osaka-amanda-anisimova-us-open-semifinals-mental-health",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T17:38:55.000Z",
      "summary_90w": "",
      "raw": "Naomi Osaka and Amanda Anisimova will face off in the U.S. Open semifinals on Thursday. Both players have been climbing up the rankings after taking mental health breaks from the sport.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a54cf28c19007d0ed34d83ac3c1dc2de1b6fecd4",
      "title": "PM refuses to say if he will sack Rayner if she broke rules",
      "url": "https://www.bbc.com/news/articles/ce321d2n45vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T17:27:47.000Z",
      "summary_90w": "",
      "raw": "The PM's standards adviser is investigating if Rayner breached the ministerial code after underpaying stamp duty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64c354f6d5f6166b3d611e9036962b52950042d4",
      "title": "Sequoia’s Roelof Botha joins TechCrunch Disrupt 2025 for a 20th anniversary conversation on the future of venture",
      "url": "https://techcrunch.com/2025/09/04/roelof-botha-the-head-of-sequoia-capital-is-coming-to-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T17:27:00.000Z",
      "summary_90w": "",
      "raw": "For more than two decades, Botha has helped shape some of the world’s most iconic companies — and his perspective has never been more important.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc4aafcd604b1f392f982da07551a1e248261761",
      "title": "Macron says 26 countries ready to send troops for Ukraine ceasefire ",
      "url": "https://www.bbc.com/news/articles/czxwl15w2qko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T17:26:57.000Z",
      "summary_90w": "",
      "raw": "The French president also says US support for the \"Coalition of the Willing\" would be finalised in the coming days.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24e9d29dfb5fe555cd3a6bc8efae662511c0f3de",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/04/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T17:21:25.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9468dd573828d95e2f01766740a4afd147dba35",
      "title": "Lisbon funicular crash: Portugal’s PM vows swift and thorough investigation",
      "url": "https://www.theguardian.com/world/2025/sep/04/lisbon-funicular-crash-portugal-declares-day-of-mourning-deaths",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T17:20:07.000Z",
      "summary_90w": "",
      "raw": "Luís Montenegro describes incident, in which 16 people died, as ‘one of the biggest tragedies in our recent history’\n\nExplainer: what is Lisbon’s Elevador da Glória and how does it work?\n\nEurope live – latest updates\n\nPortugal’s prime minister, Luís Montenegro, has promised a swift and thorough investigation to determine the causes of the funicular railway crash in Lisbon that killed 16 people and injured 21 others, describing the incident as “one of the biggest tragedies in our recent history”.\nThe authorities are looking into the crash, which happened on the Portuguese capital’s famous Glória funicular just after 6pm on Wednesday. The city’s mayor has also asked Carris, the municipal public transport company that operates the service, to investigate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3236bc954aa2ffcf2bd2a29888e9a7415c6ff01",
      "title": "Denying famine, Israel threatens more curbs on Gaza aid",
      "url": "https://www.npr.org/2025/09/04/g-s1-86841/gaza-aid-famine-hunger-israel",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T17:17:55.000Z",
      "summary_90w": "",
      "raw": "Despite experts saying that famine has begun in Gaza, Israel is threatening more curbs on aid deliveries. Aid groups say extra restrictions will make the starvation crisis worse.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c43beb5a4ee833ab93e6494d1f9728e9a886d78a",
      "title": "Threads challenges X by offering free support for up to 10K characters, plus prominent links",
      "url": "https://techcrunch.com/2025/09/04/threads-challenges-x-by-offering-free-support-for-up-to-10k-characters-plus-prominent-links/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Meta says that the 10,000 characters give people more room to express themselves, but also allows them to promote their work and drive others to \"wherever it lives,\" even if not on Threads itself.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "70ed4fc81834b1ea16f715aa2b0a3c2f9695386c",
      "title": "GE Aerospace to invest $300M in Beta Technologies to pair up on hybrid-electric power",
      "url": "https://techcrunch.com/2025/09/04/ge-aerospace-to-invest-300m-in-beta-technologies-to-pair-up-on-hybrid-electric-power/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T16:51:00.000Z",
      "summary_90w": "",
      "raw": "The new partnership comes as hybrid solutions gain momentum in the advanced air mobility (AAM) space, a catch-all term to describe the next generation of aviation concepts like eVTOL, hydrogen, and so on.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "17129a985f001cee9525be88fe8470c3cb44d00e",
      "title": "Palestine recognition: the principle the EU has been stuck on for decades",
      "url": "https://www.theguardian.com/world/2025/sep/04/palestine-recognition-eu-european-union-stuck-gaza-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T16:25:59.000Z",
      "summary_90w": "",
      "raw": "Europe’s ability to help bring peace to the Middle East has long come under question, with Spain’s PM this week saying it had failed on Gaza\n\nEurope live – latest updates\n\nIn 1980 when Leonid Brezhnev ruled the Soviet Union and Donald Trump was a property developer, the nine leaders of the then European Community made their first major foray into joint diplomacy. The cause: the Middle East, including a Palestinian state.\n“The time has come to promote the recognition and implementation of two principles universally accepted by the international community: the right to existence and to security of all states in the region, including Israel … [and] recognition of the legitimate rights of the Palestinian people,” stated the Venice declaration calling for Palestinian self-determination.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "573d2fc6713be785690ad93716ba2445a0b7fd47",
      "title": "What happened, when? The key dates leading to Angela Rayner's tax admission",
      "url": "https://www.bbc.com/news/articles/cx2jl43400jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T16:18:49.000Z",
      "summary_90w": "",
      "raw": "The deputy prime minister continues to face questions after admitting she underpaid tax on a £800,000 flat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37717927149ef790c7c9fe61b17aa60e2d92c5f1",
      "title": "Ebola outbreak kills 15 in DR Congo",
      "url": "https://www.bbc.com/news/articles/cjed2pg0wy7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T16:18:22.000Z",
      "summary_90w": "",
      "raw": "Health officials urge people to take preventive measures following a new outbreak of the deadly virus.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4417ab23074100b1601a34a26579e5ea7578eb4",
      "title": "Google Photos upgrades its image-to-video feature with Veo 3",
      "url": "https://techcrunch.com/2025/09/04/google-photos-adds-ai-video-generation-with-veo-3/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google Photos already offers video generation through its \"Photo to video\" feature, but the company says the addition of Veo 3 enhances that functionality with higher-quality video.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4238ed4818d35cc3b2edb043c9dd5d0f1c7c2062",
      "title": "Cloud provider Lambda may be gearing up for an IPO",
      "url": "https://techcrunch.com/2025/09/04/cloud-provider-lambda-may-be-gearing-up-for-an-ipo/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T15:43:06.000Z",
      "summary_90w": "",
      "raw": "Lambda, which allows companies to rent GPUs, is reportedly following its rival CoreWeave to the public market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7896771baba030fd9b7e6154ba782ac31ae12691",
      "title": "'Out of control': Witnesses describe fatal Lisbon funicular crash",
      "url": "https://www.bbc.com/news/articles/c20v4g71zrpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T15:40:03.000Z",
      "summary_90w": "",
      "raw": "At least 16 people were killed and 20 more injured, some critically, Portuguese authorities say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d7bd00efcbe2f3d61958533a686ca22150a76442",
      "title": "Captions rebrands as Mirage, expands beyond creator tools to AI video research",
      "url": "https://techcrunch.com/2025/09/04/captions-rebrands-as-mirage-expands-beyond-creator-tools-to-ai-video-research/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T15:39:15.000Z",
      "summary_90w": "",
      "raw": "Captions, the AI-powered video creation and editing app for content creators, is rebranding to Mirage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "32f54c95784ba164002ef372212e16d838b60737",
      "title": "Macron says ‘Coalition of the Willing’ will finalise ‘robust’ Ukrainian security guarantees – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/04/ukraine-russia-security-guarantees-coalition-of-the-willing-paris-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T15:26:26.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\nThe Dutch prime minister Dick Schoof is next.\nBelgium’s Bart de Wever, Finland’s Alexander Stubb, and the EU’s Ursula von der Leyen and António Costa are the first leaders arriving at the Élysée Palace, welcomed by Macron on the doorstep.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e52c97c703676547d87d3fb91af6633c47723b86",
      "title": "Israel dismisses 'spin' after Hamas says it is ready for comprehensive Gaza deal",
      "url": "https://www.bbc.com/news/articles/cz087gpd52ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T15:20:00.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Netanyahu says Hamas \"has nothing new\" and that war can end only on terms that Israel has set.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "30d70bc14ae5260bc81c527436bb534b8248a3c6",
      "title": "Mark Zuckerberg encouraged execs to do MMA training with him",
      "url": "https://techcrunch.com/2025/09/04/mark-zuckerberg-encouraged-execs-to-do-mma-training-with-him/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T15:17:23.000Z",
      "summary_90w": "",
      "raw": "Former Meta exec Nick Clegg recalls an MMA session with Zuckerberg at a management offsite.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9fd3faed848678125ee8181f8b0726718e9f27e2",
      "title": "Film about Gaza child's killing gets record ovation at Venice",
      "url": "https://www.bbc.com/news/articles/c8jmlx1p4mxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:54.000Z",
      "summary_90w": "",
      "raw": "The Voice of Hind Rajab re-enacts the killing of a Palestinian girl whose car was fired on by Israeli forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b0a52a683fa3fea583f1dcbaa992273632531922",
      "title": "Legendary Italian designer Giorgio Armani dies",
      "url": "https://www.bbc.com/news/articles/ceq25w34lv4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T14:44:41.000Z",
      "summary_90w": "",
      "raw": "The fashion designer was the archetype of Italian style and elegance, reimagining men's and women's suits.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75ed96a81e5cc0351814d74dd60cf08e448ac8c2",
      "title": "Fashion designer Giorgio Armani, whose name became synonymous with luxury, dies at 91",
      "url": "https://www.npr.org/2025/09/04/1110320559/giorgio-armani-dead",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T14:38:19.000Z",
      "summary_90w": "",
      "raw": "Armani's clothes highlight the body as an object of art. Celebrities have flaunted his fashion on red carpets for decades. He revolutionized the suit jacket, with casual silhouettes and softer colors.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3f3bb480f302638bde9488590b0c05a2a495ae9a",
      "title": "Jamaican PM Andrew Holness wins rare third term in office ",
      "url": "https://www.bbc.com/news/articles/c80gem7k4p0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T13:34:42.000Z",
      "summary_90w": "",
      "raw": "The incumbent, who has been in office since 2016, campaigned on the strength of his economic record.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d6f91d2da133f679420119a3cbbdd02caf5f5f4",
      "title": "A style guru who revolutionised fashion - Giorgio Armani dies aged 91",
      "url": "https://www.bbc.com/news/articles/c90z02n04nwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T13:34:28.000Z",
      "summary_90w": "",
      "raw": "He worked his way up from a Milan department store to a global empire that changed the way we dress.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd50c7e66a78023f6474d97a769951ed899ec814",
      "title": "'I don't seek attention', says Trump on Nobel Prize speculation",
      "url": "https://www.bbc.com/news/articles/c0r0wjl2gweo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T13:26:19.000Z",
      "summary_90w": "",
      "raw": "After previously suggesting he deserves the prize, the president tells CBS News he is more focused on saving lives.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1256381fdd1333af836314df1d1981a959ad8a70",
      "title": "New ‘golden triangle’ of fentanyl and guns spans US-Mexico border",
      "url": "https://www.theguardian.com/society/2025/sep/04/fentanyl-guns-us-mexico-border-arizona-california",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T13:25:49.000Z",
      "summary_90w": "",
      "raw": "Report links Arizona-Sonora smuggling to rising homicide and overdose deaths in both countries\nA new “golden triangle” of fentanyl and gun trafficking between Mexico and the US ties together the homicide and overdose crises of the two countries, according to a a new study.\nThe triangle spans Baja California, Sinaloa and Sonora – the three states where almost all fentanyl seizures in Mexico take place – and connects to Arizona through a quieter part of the US-Mexico border that has become a hotspot for trafficking in both directions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2c49ae24bac003fd911373213e633d9fd9eb8cf0",
      "title": "Jellyfish disrupt French nuclear power plant for second time in a month",
      "url": "https://www.bbc.com/news/articles/c5ygkxlmg41o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T13:11:35.000Z",
      "summary_90w": "",
      "raw": "One of France's largest nuclear power stations partially shut down after the jellyfish blocked cooling filters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a35b1b0667affa66a6f49fdca0bf48aefdf95ed",
      "title": "Dozens die after boat hits tree stump in Nigerian river",
      "url": "https://www.bbc.com/news/articles/c3dr903xeleo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T11:43:42.000Z",
      "summary_90w": "",
      "raw": "The overloaded boat was carrying passengers including children when it hit a submerged tree stump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "111f1342a3350702f99d79f8527f893bcb24b9b9",
      "title": "Grandfather accidentally takes home wrong child from Sydney daycare",
      "url": "https://www.bbc.com/news/articles/c4g5v4z13l6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T11:19:57.000Z",
      "summary_90w": "",
      "raw": "The man returned with the one-year-old as soon as he realised the mistake, and an investigation into the centre's safety protocols has been opened.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0debc69ddd7f73b424dd0a78535704200eac576e",
      "title": "US flight attendants push to be paid when planes aren’t in the air: ‘Most of our passengers have no idea’",
      "url": "https://www.theguardian.com/us-news/2025/sep/04/air-canada-union-us-flight-attendants",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Cabin crews across North America aren’t paid for work done before takeoff, but new Air Canada deal has raised hope\nAs you board the plane, the flight attendant welcomes you on board. They point you to your seat and help with your luggage, before giving the safety demonstration, and preparing the plane for takeoff. And there’s a good chance they have done it all for free.\nBut a tentative deal between Air Canada and thousands of flight attendants has sparked hope more airlines will end a little-known reality for many North American cabin crews – and pay flight attendants when planes are not moving.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6638864850982cfec3c9b5774280c2b25e122377",
      "title": "Taiwan accuses China of breaching international law over drilling",
      "url": "https://www.theguardian.com/world/2025/sep/04/taiwan-china-oil-gas-drilling-exclusive-economic-zone-pratas-islands",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T10:41:07.000Z",
      "summary_90w": "",
      "raw": "Island’s government demands halt to Chinese oil and gas operations in its exclusive economic zone\nTaiwan’s government has accused China of breaching international law by drilling for oil and gas inside Taiwan’s exclusive economic zone (EEZ) and immediately demanded it halt the activity.\nThe statement from the office of Taiwan’s president, Lai Ching-te, came after revelations first reported by the Guardian that several Chinese oil rigs and associated vessels had been detected inside Taiwan’s EEZ, near the disputed Pratas Islands, which are under Taiwanese control.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "21131966a29eb8b5fae106e97be11cfa4a8b0c6f",
      "title": "Indian doctors remove parasitic foetuses from baby's stomach",
      "url": "https://www.bbc.com/news/articles/cr4q0d4n6dno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T09:51:41.000Z",
      "summary_90w": "",
      "raw": "The 20-day-old baby had two malformed foetuses inside her abdomen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8b995b61d90b1c7350df20aa7d2fed7d2e75644",
      "title": "Fox bosses privately called U.S. Attorney Jeanine Pirro 'reckless maniac' and more",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526879/fox-news-jeanine-pirro-reckless-maniac",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Her colleagues made those remarks after the 2020 presidential election, when Pirro used her platform to amplify baseless claims of election fraud. She is now the U.S. attorney for Washington, D.C.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f472c03bb8c1e51ff0e0294e4fd38ca99f3d416e",
      "title": "Sell it, donate it — recycle it? A beloved old minivan faces a fork in the road",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5492399/old-car-sell-donate-recycle",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "After 20 years of service, an NPR reporter's beloved minivan is on the fritz. But what is its best and highest calling now: Pass it on to another family or recycle it into parts?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3f3f10d3812de2a801ac7fd533797813e87076f8",
      "title": "Guyana President Irfaan Ali claims victory in general election",
      "url": "https://www.bbc.com/news/articles/cevzj1yldl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T07:05:25.000Z",
      "summary_90w": "",
      "raw": "The incumbent president claimed victory in an election dominated by how to manage the country's vast oil reserves.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1e2a126696f02c551928711b4878bdfb76a9a7d",
      "title": "Israeli military database indicates only a quarter of Gaza detainees are fighters",
      "url": "https://www.theguardian.com/world/2025/sep/04/israeli-military-database-indicates-only-a-quarter-of-gaza-detainees-are-fighters",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:00:46.000Z",
      "summary_90w": "",
      "raw": "Elderly woman with Alzheimer’s, medical workers and children among 6,000 Palestinians held\nOnly one in four detainees from Gaza are identified as fighters by Israel’s military intelligence, classified data indicates, with civilians making up the vast majority of Palestinians held without charge or trial in abusive prisons.\nThose jailed for long periods without charge or trial include medical workers, teachers, civil servants, media workers, writers, sick and disabled people and children.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5af2f24b58f60cb124e0287037fd95c6505f148a",
      "title": "Jamaica election results: Andrew Holness leads Labour party to third term",
      "url": "https://www.theguardian.com/world/2025/sep/04/jamaica-election-results-andrew-holness-leads-labour-party-to-third-term",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:42:26.000Z",
      "summary_90w": "",
      "raw": "Incumbent prime minister says country on right trajectory, as opposition leader concedes defeat \nJamaicans have voted to give Andrew Holness and the Jamaica Labour party (JLP) a third consecutive term in government after a nail-biting race with the opposition People’s National party (PNP).\nHolness beat PNP’s Mark Golding after polls in the final days of the intense campaign projected a narrow lead for the PNP. Of the 63 seats being contested, preliminary results showed the JLP winning 34 seats and the PNP 29.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "694b253e92d177568d4c78ce03686c245a440282",
      "title": "Thursday briefing: China flexes its muscle in the tussle for global dominance",
      "url": "https://www.theguardian.com/world/2025/sep/04/thursday-briefing-china-flexes-its-muscle-in-the-tussle-for-global-dominance",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:37:32.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: In hosting anti-western leaders at its largest ever military parade, Beijing sent a defiant message that will be heard loud and clear across the world\n\nGood morning. All eyes have been on China this week as the second biggest global economy flexed its muscles.\nDozens of world leaders, including from the global south, authoritarian pariah states and the EU, attended China’s largest ever military parade on Wednesday to mark the 80th anniversary of the end of the second world war, which China calls the war of resistance against Japanese aggression.\nUK news | Deputy PM Angela Rayner has admitted she underpaid stamp duty on her £800,000 seaside flat, after coming under intense pressure to be more transparent about her property arrangements.\nRussia | Vladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nPolice | The Metropolitan police have declined to drop their investigation into the comedy writer Graham Linehan for tweets about trans issues, and said that the law used by officers to detain him needs reviewing.\nIsrael | Israeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nPortugal | A day of national mourning has been declared in Portugal after at least 15 people were killed when Lisbon’s well-known Gloria funicular railway car derailed and crashed on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d5cb9928ef4e9a1bc53e52bf0a84ff11c7b1230",
      "title": "Artificial Intelligence: An AI Boss Warns About The Risks (Dario Amodei)",
      "url": "https://www.bbc.co.uk/sounds/play/m002ht32?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "The Anthropic CEO calls for more regulation and explains how AI could take your job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T04:59:05.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "959222f718a6eea7540ddf4e098ec2b798de4e32",
      "title": "Trump asks Supreme Court to reverse tariffs ruling finding them illegal",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5528573/trump-supreme-court-tariffs-ruling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T04:32:49.000Z",
      "summary_90w": "",
      "raw": "The government called on the court to reverse an appeals court ruling that found most of President Donald Trump's tariffs are an illegal use of an emergency powers law.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d55798207b8e128a1cebc2b9d9d4c61928310f5d",
      "title": "Record payout for victims of 'illegal and immoral' Australian welfare scheme",
      "url": "https://www.bbc.com/news/articles/clyx3jvk4zeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T04:16:14.000Z",
      "summary_90w": "",
      "raw": "Hundreds of thousands of Australians were forced to repay debts, many of which did not even exist.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ac6cbb192b3f120995526f31174f98d5eeb174c",
      "title": "Epstein accusers say they are compiling list of his associates",
      "url": "https://www.bbc.com/news/articles/c5yvpgyjed8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T02:11:32.000Z",
      "summary_90w": "",
      "raw": "Victims of the disgraced financier give emotional accounts of abuse in a news conference on the steps of the US Capitol.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4647493f99a07420a1ef4cfae23d16464abeb4",
      "title": "Painting looted by Nazis recovered in Argentina",
      "url": "https://www.bbc.com/news/articles/cdx26z142vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:42:37.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady had been missing for 80 years before it was spotted on an estate agent's website.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e0188df51044e2a6afe43803b87b36f9321b3c7",
      "title": "UAE warns Israel that annexing West Bank would cross 'red line'",
      "url": "https://www.bbc.com/news/articles/cx2rgjk87y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:37:50.000Z",
      "summary_90w": "",
      "raw": "The warning came after a far-right Israeli minister unveiled a proposal for the annexation of four-fifths of the occupied territory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98b7072e63f65cb8f8e5db7a287fbfb6be2cb18f",
      "title": "It's 4,000 miles from Ukraine - but even this Asian city is part of Russia's war",
      "url": "https://www.bbc.com/news/articles/cvg0e54z7x8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:18:55.000Z",
      "summary_90w": "",
      "raw": "In Vladivostok, a city on China's and North Korea's border, Russia's war on Ukraine looms large.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b72ad38efe78e755fca9889d2957a89466b9c50c",
      "title": "Israel intensifies Gaza City attacks as UN warns of 'horrific' consequences for displaced families",
      "url": "https://www.bbc.com/news/articles/c740lm33wyeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T22:03:18.000Z",
      "summary_90w": "",
      "raw": "Strikes reportedly kill 31 people in the city, home to a million people and where a famine was declared last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60f63920bc1218b34be171af49182de80b50c614",
      "title": "Angela Rayner Admits Underpaying Tax",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0p6d8?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T19:46:00.000Z",
      "summary_90w": "",
      "raw": "How did the housing secretary pay the wrong amount of stamp duty?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "295d2c34a4380cee11e95a8ab2f5dbc49137757e",
      "title": "How Trump's latest crypto launch enriches his family",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527047/trump-crypto-family-world-liberty-financial",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T19:36:02.000Z",
      "summary_90w": "",
      "raw": "The president and his sons made $5 billion on paper as their cryptocurrency started trading — highlighting the extraordinary degree to which they are personally profiting from Trump's return to the Oval Office.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3802f6fd2bee9d8ee61c711ac7fde5acd34e24f6",
      "title": "Kim Jong-un promises to do ‘everything to assist’ Moscow after Putin meeting",
      "url": "https://www.theguardian.com/world/2025/sep/03/kim-jong-un-promises-to-do-everything-to-assist-moscow-vladimir-putin-russia-north-korea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:19:19.000Z",
      "summary_90w": "",
      "raw": "North Korean leader invited to visit Russia as Zelenskyy says Putin is displaying ‘impunity’ with new Ukraine strikes \n\nEurope live – latest updates\n\nVladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nNorth Korea has supported Russia in its war against Ukraine with weapons and troops, and the Russian president praised North Korean fighters for acting “courageously and heroically”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af68edbf9f6bb8ab4fa969df7a091068a361887a",
      "title": "In a brawl over right-wing TV, Newsmax sues Fox News",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527077/newsmax-sues-fox-news",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T18:14:43.000Z",
      "summary_90w": "",
      "raw": "Right-wing TV news outlet Newsmax sued Fox News on antitrust grounds, alleging the conservative media powerhouse had illegally sought to suppress its smaller rival's growth in cable news.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "fe4623dd6dfdd273b3a458c2fd443e30d7d549fd",
      "title": "Nuclear triad and ‘robot wolves’: parade shows off array of Chinese weapons",
      "url": "https://www.theguardian.com/world/2025/sep/03/nuclear-triad-robot-wolves-china-weapons-parade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T17:38:40.000Z",
      "summary_90w": "",
      "raw": "On display in Beijing were nuclear weapons launched by air, sea and land, laser weapons and four-legged drones\nIt was hardly a subtle attempt to project power. China showed off air-, sea- and land-launched nuclear weapons in its parade on Wednesday, a triad intended to demonstrate that Beijing’s long-term aspiration is to match US military might.\nAlso on display were large underwater torpedo-like drones, intended to threaten western warships, as well as anti-drone lasers and four-legged “robot wolves”, all designed to be noticed, regardless of their actual military effectiveness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "319a7a22278147fae972cf96226ea85b3d806c65",
      "title": "'Ketamine Queen' pleads guilty in Matthew Perry overdose case",
      "url": "https://www.bbc.com/news/articles/c2dng3rrzjdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T17:25:21.000Z",
      "summary_90w": "",
      "raw": "Jasveen Sangha, 42, pleads guilty to five charges relating to the actor's death in Los Angeles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "847cdf520201641f774d1f1a7dc23443011f151a",
      "title": "Democrats blast state department for lack of ‘basic oversight’ of controversial Gaza food organization",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-democrats-gaza-humanitarian-foundation-letter",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:55:29.000Z",
      "summary_90w": "",
      "raw": "Letter by senior Democrats asks state department to reveal details behind financing of Gaza Humanitarian Foundation\nSenior Democratic senators have called on the US secretary of state, Marco Rubio, and the US ambassador to Israel, Mike Huckabee, to reveal details behind the financing and oversight of the Gaza Humanitarian Foundation (GHF) amid concerns over rising death tolls near aid sites, the group’s apparent coordination with the Israeli army and its reported use of private military contractors linked to intelligence operations.\nThe letter, co-signed by senators Elizabeth Warren, Chris Van Hollen and Peter Welch, accuses the state department of an “inability to answer basic questions about GHF in a timely manner” and said that the department’s “overriding of internal protocol and staff warnings is particularly concerning given it is unlikely to be able to conduct basic oversight of the funds it provided to GHF”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "120d64af2dfb7dfb6fb4a3fc8eb9b9309b435b54",
      "title": "Hot mic catches Xi and Putin discussing organ transplants and immortality",
      "url": "https://www.bbc.com/news/articles/cr70rvrd41ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T16:51:50.000Z",
      "summary_90w": "",
      "raw": "The Chinese and Russian leaders have been in power for 13 and 25 years respectively, with neither expressing any intention of stepping down.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb3eb7b94623fc51ae1c08c10752296a5d7e4fc",
      "title": "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade",
      "url": "https://www.theguardian.com/world/2025/sep/03/china-military-parade-xi-jinping-appears-with-vladimir-putin-kim-jong-un",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:30:18.000Z",
      "summary_90w": "",
      "raw": "Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to the west\nXi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance to the west.\nPutin and Kim, the authoritarian leaders of Russia and North Korea, were among dozens of world leaders who attended the parade, a massive display of military hardware and personnel, orchestrated to mark the 80th anniversary of the end of the second world war, which China calls the War of Resistance against Japanese Aggression.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20734de9be72d9662dfcda04a60d7fdca24067c1",
      "title": "Middle East crisis: at least 21,000 children disabled in Gaza during war, says UN committee – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:55:30.000Z",
      "summary_90w": "",
      "raw": "More than 40,000 have suffered ‘new war-related injuries’ with more than half left disabled, says UN Committee on the Rights of Persons with Disabilities\nYemen’s Houthis have claimed responsibility for a missile launched at Israel (see 8.17am BST), saying they fired two ballistic missiles at Tel Aviv in what they said was an initial response to Israeli attacks on Yemen.\nThe Israeli military moved deeper into Gaza City on Wednesday, with soldiers and tanks pushing into Sheikh Radwan, one of the urban centre’s largest and most crowded neighbourhoods, reports Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d644e189ccfca378169b39abe9c5397dc4cdc763",
      "title": "China's Xi steals the limelight in a defiant push against US-led world order",
      "url": "https://www.bbc.com/news/articles/cn0rllxld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:20:11.000Z",
      "summary_90w": "",
      "raw": "President Xi shows off his power and influence in an open challenge to US supremacy and the world order.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba0eaca95165227d0d96eda644426c5cdcaeca1",
      "title": "Israeli drones dropped grenades near peacekeepers in south Lebanon, UN says",
      "url": "https://www.theguardian.com/world/2025/sep/03/israeli-drones-drop-grenades-near-peacekeepers-in-south-lebanon-un-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T12:17:48.000Z",
      "summary_90w": "",
      "raw": "Unifil condemns ‘serious attack’ on Tuesday morning as it was clearing a road and adds that no one was hurt \nIsraeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nThe UN peacekeeping force in Lebanon, Unifil, said the Tuesday morning attack came as it was clearing a road to a UN position close to the Israeli border, adding that no one was hurt.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9122eaec0d3c3caa2eb5e06cd8a21774dc756b3",
      "title": "Hitler's bunker is now just a parking lot. But it's a 'dark tourism' attraction anyway",
      "url": "https://www.npr.org/sections/planet-money/2025/09/03/g-s1-86572/hitlers-bunker-is-now-just-a-parking-lot-but-its-a-dark-tourism-attraction-anyway",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Why evil histories sell. A visit to Hitler's bunker, and a deep dive into the economics and ethical quandaries of \"dark tourism.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on 'drug-carrying vessel from Venezuela'",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:10:59.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded1eba6568cb83acb1b0db7a34aa4a6154c7d25",
      "title": "Food giant Kraft Heinz to split into two companies",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525657/food-giant-kraft-heinz-to-split-into-two-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T09:02:02.000Z",
      "summary_90w": "",
      "raw": "Food giant Kraft Heinz is splitting up into two companies a decade after the merger that was arranged by billionaire investor Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61485d03501a06d5436d598c956543c20d3bf5a2",
      "title": "Uncovering new secrets of the Neanderthals",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002j14k?at_mid=rRH2VlBrjn&at_campaign=The_Lost_Neanderthals&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002j14k&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Lost_Neanderthals&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T05:00:00.000Z",
      "summary_90w": "",
      "raw": "The secrets of the Neanderthal discoveries in the Mandrin Cave in France are revealed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}