{
  "version": "1756186639041",
  "generatedAt": "2025-08-26T05:37:19.041Z",
  "items": [
    {
      "id": "9d45c4440fdc12b54a03d6048653f1e1d126e7d6",
      "title": "Victoria police shooting live updates: two officers dead, one injured after incident at rural Porepunkah property",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/26/porepunkah-shooting-live-updates-victoria-police-active-incident-latest-news-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T05:14:36.000Z",
      "summary_90w": "",
      "raw": "Follow live updates\n\nPorepunkah shooting: two Victoria police officers dead, one injured in attack at rural property\n\nWhat we know so far about the shooting in rural Australia\n\nWangaratta police have confirmed there is still an “active incident” ongoing and are continuing to urge people to avoid the area.\nIn a statement published to its social media page a moment ago, the local police service said Victoria police “continues to respond to an incident at a property in Porepunkah”.\nThis is still an active incident and we will provide more information when it’s operationally safe to do so.\nWe ask people avoid the area.\nTonight’s Ordinary Council Meeting has also been postponed, and will be rescheduled for two weeks’ time. Further details will be provided at a later date.\nWe thank you for your patience and understanding.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a78071dd3df0144725f21c4c2486e62f3c0b92e0",
      "title": "Australia politics live: Iran orchestrated ‘extraordinary’ acts to sow discord in Australia, PM says; Iranian Revolutionary Guard to be listed as terror group",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/26/australia-politics-live-labor-coalition-trades-ndis-environment-epa-anthony-albanese-sussan-ley-question-time-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T05:14:01.000Z",
      "summary_90w": "",
      "raw": "Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nIn the last parliament, the government had just reached a deal with the Greens and members of the crossbench, to get its environmental laws over the line.\nNow that they’ve had to go back to the drawing board, the Coalition and the Greens will be approached for negotiation (as Murray Watt outlined a bit earlier).\nWe need laws that actually act on the climate crisis, protect nature. And of course, we will always stand for making sure everyone’s got a home, a roof over their heads in this wealthy country. So the offer’s there. We’re looking forward to those discussions with government. Or they can choose to do a deal that will just pave the way for more big business profits, trash nature and leave ordinary people behind with the Libs.\nIt’s very clear that targeting or hitting hospitals, health workers and civilians is a breach of international law. We join with the rest of the international community in condemning this action.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "367edb4e19378e8d46a186336de4d9fdd32c74a0",
      "title": "Long-elusive Mexican drug lord Ismael 'El Mayo' Zambada pleads guilty in U.S.",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517800/drug-lord-el-mayo-zambada-plea",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T05:03:22.000Z",
      "summary_90w": "",
      "raw": "Former Mexican cartel kingpin Ismael \"El Mayo\" Zambada will spend the rest of his life in prison after pleading guilty Monday to U.S. drug trafficking charges.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74076ad734e8124bc84fc1c481f9d6bd60938343",
      "title": "Porepunkah shooting: two Victoria police officers dead, one injured in attack at rural property",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T05:03:02.000Z",
      "summary_90w": "",
      "raw": "Police urge people to ‘avoid the area’ amid ‘active incident’ at Porepunkah, 300km north-east of Melbourne\n\nVictoria police shooting live updates: two officers dead, one injured at Porepunkah\n\nWhat we know so far about the shooting in rural Australia\n\nTwo Victorian police officers are dead and another wounded after a shooting at a rural property in the High Country town of Porepunkah.\nVictoria police said on Tuesday afternoon that they were attending an “active” and “ongoing” incident at a Porepunkah address and asked people to “avoid the area”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13ebfac4e15d35bb8de951e0847b8be98f29821e",
      "title": "Minister admits domestic abuse screening tool doesn't work",
      "url": "https://www.bbc.com/news/articles/cr4e7yrxkgvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T05:02:04.000Z",
      "summary_90w": "",
      "raw": "The safeguarding minister says the Dash questionnaire has \"obvious problems\" but is the best authorities have for now.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T04:59:10.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6214e34245147e0ca4a21df80148315e39674f4",
      "title": "Australia blames Iran for antisemitic attacks in Sydney and Melbourne",
      "url": "https://www.bbc.com/news/articles/c9d085n75q3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T04:14:55.000Z",
      "summary_90w": "",
      "raw": "Australia says it will expel Iran's ambassador after accusing its government of \"orchestrating\" two attacks last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9671b2a417a0ff56c8f92c3f123b16d453273ccd",
      "title": "Former NSW police officer Beau Lamarre-Condon to fight charges of murdering two men",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/former-nsw-police-officer-beau-lamarre-condon-to-plead-not-guilty-to-murder-charges-luke-davies-jesse-baird-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T03:33:33.000Z",
      "summary_90w": "",
      "raw": "Lamarre-Condon charged with murders of flight attendant Luke Davies, 29, and TV presenter Jesse Baird, 26, in February 2024\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA former police officer has indicated he will fight accusations he murdered two men with his service weapon.\nBeau Lamarre-Condon on Tuesday faced court for the first time in more than a year to plead not guilty to murdering flight attendant Luke Davies, 29, and TV presenter Jesse Baird, 26, in February 2024.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e18c5a6d2d59cdc65527500158a42f820a4893e",
      "title": "Trump orders removal of Federal Reserve governor Lisa Cook",
      "url": "https://www.bbc.com/news/articles/cx275n8gx0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T03:30:15.000Z",
      "summary_90w": "",
      "raw": "Cook says the US president \"has no authority to do so\" in defiance of Trump's escalatory move against the central bank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db630a71f2a518e300031c6da18872caee590b59",
      "title": "Iranian ambassador expelled over ‘credible intelligence’ Iran directed antisemitic attacks on Australian soil",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/iran-ambassador-expelled-australia-antisemitic-attacks-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T03:18:28.000Z",
      "summary_90w": "",
      "raw": "Australia’s spy agency finds Iran behind incidents including arson attack on Adass Israel Synagogue in Melbourne\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nIran directed at least two attacks against Australia’s Jewish community, the domestic spy agency has determined, prompting the Albanese government to expel Tehran’s ambassador to Canberra from Australia.\nThe prime minister announced on Tuesday that the Australian Security and Intelligence Organisation (Asio) had “credible intelligence” to determine the Iranian government was behind the attacks against the Adass Israel Synagogue in Melbourne and Lewis’ Continental Kitchen in Bondi in Sydney.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49159070f366c4515c975c6cba8fc2f78050be1f",
      "title": "South Korea plays charm offensive with Trump amid trade pressure",
      "url": "https://www.bbc.com/news/articles/cy5pdlgl64zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T02:55:48.000Z",
      "summary_90w": "",
      "raw": "Ahead of Lee's White House visit, anxieties were bubbling in Seoul that the meeting could turn bitter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49159070f366c4515c975c6cba8fc2f78050be1f",
      "title": "South Korea's charm offensive and other takeaways from Trump meeting",
      "url": "https://www.bbc.com/news/articles/cy5pdlgl64zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T02:55:48.000Z",
      "summary_90w": "",
      "raw": "Ahead of Lee's White House visit, anxieties were bubbling in Seoul that the meeting could turn bitter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "946ee68edff0cb4e775b227a9906502f009c7174",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "url": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:28:08.000Z",
      "summary_90w": "",
      "raw": "Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents\nCambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "798961477467e02a8704390f56a6f1492a18e412",
      "title": "Protests erupt in Indonesia over privileges for parliament members and ‘corrupt elites’",
      "url": "https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:26:10.000Z",
      "summary_90w": "",
      "raw": "Controversy over housing allowance, which is almost 10 times minimum wage, comes amid President Prabowo Subianto’s austerity drive\nRiot police have fired water cannon and rounds of teargas at thousands of stone-throwing protesters in Indonesia’s capital as anger over the lavish allowances of parliament members has fuelled public anger.\nThousands of students, workers and activists demonstrated outside the nation’s parliament on Monday against a monthly housing allowance of 50 million rupiah ($US3,075) for MPs, which is almost 10 times the Jakarta minimum wage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd59ac449ad6fc807458275c71f4afb4ec27201a",
      "title": "Nigel Farage says illegal migration is a 'scourge'",
      "url": "https://www.bbc.com/news/articles/c5yk4r5e514o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T01:42:10.000Z",
      "summary_90w": "",
      "raw": "The Reform UK leader will outline his plans to tackle small boat crossing later on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e567e5b338b00b798421b927567bebf43a06113",
      "title": "Attendees could be in for thunderstorms, dust and hail at this year's Burning Man",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5517318/burning-man-2025-weather-storms",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T01:24:38.000Z",
      "summary_90w": "",
      "raw": "These weather patterns are typical for this time of year in Nevada's deserts. Eventgoers should keep an eye on the forecast and prepare for hazardous conditions, the National Weather Service said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c675c10d86b6836f58897097924f60393aac3b50",
      "title": "Trump says he hopes to meet Kim Jong-un and raises prospect of US taking over some South Korean land",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/trump-north-korea-kim-jong-un-lee-jae-myung",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T01:20:11.000Z",
      "summary_90w": "",
      "raw": "South Korean president Lee Jae Myung uses Oval Office meeting to encourage Trump to engage with North Korean leader\nDonald Trump has said he wants to meet North Korean leader Kim Jong-un, possibly this year, in an attempt to revive the failed nuclear diplomacy of his first term as US president.\n“I’d like to have a meeting. I look forward to meeting with Kim Jong-un in the appropriate future,” Trump said during an occasionally awkward meeting at the Oval Office with South Korea’s new president, Lee Jae Myung, in which he raised the prospect of taking ownership of South Korean land that hosts a US military base.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92f40831e0a32882c5b431bebc43f33e69fcbe76",
      "title": "Trump seeks to fire Fed governor Lisa Cook",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5517335/trump-federal-reserve-governor-lisa-cook",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T00:52:50.000Z",
      "summary_90w": "",
      "raw": "President Trump says he's firing Federal Reserve governor Lisa Cook, after a Trump ally accused Cook of making false statements on a mortgage application. The president's authority to remove a Fed governor may be challenged in court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee69ce8bbf71fcb0c6833000fe460e8459bda1bc",
      "title": "YouTube TV could lose Fox channels this week",
      "url": "https://www.theverge.com/news/765663/fox-news-sports-youtube-tv-fox-one-carriage-dispute",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T00:26:22.000Z",
      "summary_90w": "",
      "raw": "With the start of the NFL season looming, it’s also a window where many TV contracts are up for renewal, and on Monday evening, YouTube TV and Fox sent out alerts indicating that their contract could come to an end as soon as August 27th, at 5PM ET. Google-owned YouTube TV says that “Fox is asking for payments that are far higher than what partners with comparable content offerings receive,” while Fox claims that “Google is attempting to use its market power to pressure FOX to agree to unfavorable and one-sided terms, prioritizing their own interests over a fair agreement for its customer.”\nChannels at risk include Fox News, Fox Business, Fox Sports, and the Big Ten Network. But in areas where Fox also owns the local broadcast network, a disruption could also cost viewers access to a chunk of NFL games, which is why the contract is up for renewal now. Awful Announcing points out that the first big game on the slate is a college football matchup, Texas vs. Ohio State on Saturday, before week one of NFL games starts the following weekend. \nOther than navigating the shrinking reach and influence of traditional cable TV, another complication for a new deal could be Fox’s just-launched Fox One direct-to-consumer streaming package, which currently includes access for pay TV subscribers at no additional charge to them over their existing bill. It’s unclear how that might affect the negotiations, or outbursts from Trump and other politicians if Fox News is unavailable to YouTube TV’s subscribers, which analyst MoffettNathanson recently estimated at 9.4 million.\nYouTube TV’s announcement says that if they can’t reach a deal, then Fox One is an option for consumers, and that it will credit members $10 “…if Fox content becomes unavailable for an extended period of time.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5e696e108baf870d089496f5bb24a224c658a073",
      "title": "Pride, passion & heartbreak - but Newcastle need end to Isak saga",
      "url": "https://www.bbc.com/sport/football/articles/c78mgdz88y0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T00:23:11.000Z",
      "summary_90w": "",
      "raw": "Newcastle United managed to score two goals against Liverpool, but the black-and-whites need a resolution to the Alexander Isak saga.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e4e5f049f702a8e2cb30c06aa9113fe143b89a86",
      "title": "Sitting up straight isn't the only secret to good posture - here are three more tips",
      "url": "https://www.bbc.com/news/articles/c890kejpg34o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T00:07:22.000Z",
      "summary_90w": "",
      "raw": "Here are Dr Xand's three suggestions on how to look after your back without turning into a statue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e9c420a3c96a0728d987bfa861831e2818fd2fd",
      "title": "Gazan students granted approval to study in UK",
      "url": "https://www.bbc.com/news/articles/cgqnjqgp719o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T00:00:00.000Z",
      "summary_90w": "",
      "raw": "British government approves arrival of around 40 students with funded scholarships, pending Israeli approval.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b20d060e4bb872d6e7abfe094ac78908983341e7",
      "title": "The Papers:  'In harm's way' and Farage's 'mass deportations' plan",
      "url": "https://www.bbc.com/news/articles/cx2qd8k2g8lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:55:39.000Z",
      "summary_90w": "",
      "raw": "Israel's double strike on a hospital in Gaza and Nigel Farage's plan for mass deportations dominate Tuesday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e75aca4d14df43b7b547dfb6aae2d9ffef22ed3",
      "title": "Man finds wife's lost wedding rings after searching through landfill",
      "url": "https://www.bbc.com/news/articles/cewyr1jl9jko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:55:37.000Z",
      "summary_90w": "",
      "raw": "A Canadian husband crawled on his hands and knees through piles of compost to find the diamond rings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "01a33cb7def2ec94927cf11ccf83ddd4a4952d35",
      "title": "Piracy and armed robbery surge in the straits of Malacca and Singapore – report",
      "url": "https://www.theguardian.com/world/2025/aug/26/piracy-straits-of-malacca-singapore",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T23:46:01.000Z",
      "summary_90w": "",
      "raw": "In the first six months of this year there were 80 incidents of piracy and armed robbery in the strategic waterways\nIncidents of piracy and armed robbery in the straits of Malacca and Singapore have nearly quadrupled in the strategic waterways this year, according to a new report from an anti-piracy monitoring group.\nIn the first six months of this year there were 80 incidents of piracy and armed robbery in the straits, according to ReCAAP’s Information Sharing Centre (ISC). In the same period last year there were 21 incidents.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b13663ded255e05b8a8ad1b98d7cc5d54c26b22f",
      "title": "Mexico cartel leader 'El Mayo' enters guilty plea",
      "url": "https://www.bbc.com/news/articles/c2eny8nz94vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T23:38:56.000Z",
      "summary_90w": "",
      "raw": "Ismael \"El Mayo\" Zambada was arrested in July 2024, and is due to be sentenced in the coming months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9529346bf8412c2e0e209c95369abfaedc3f68e1",
      "title": "Tesla could have avoided that $242.5M Autopilot verdict, filings show",
      "url": "https://techcrunch.com/2025/08/25/tesla-could-have-avoided-that-242-5m-autopilot-verdict-filings-show/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T23:32:47.000Z",
      "summary_90w": "",
      "raw": "Instead, a jury awarded plaintiffs $242.5 million in compensatory and punitive damages.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb64d1f41468a2a5f52768366e367f8177ccd68b",
      "title": "'A rivalry to run and run - a sensational night at Newcastle'",
      "url": "https://www.bbc.com/sport/football/articles/c4gz6ry2lxko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:25:04.000Z",
      "summary_90w": "",
      "raw": "Newcastle United and Liverpool are providing the Premier League's latest big rivalry as a night of drama on Tyneside is settled by a record-breaking teenager, says chief football writer Phil McNulty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d86f777f5ef08ca8f1cd64e3c4a8cb474c1ba861",
      "title": "a16z spends $1.49M in Washington lobbying, while rivals mostly sit out",
      "url": "https://techcrunch.com/2025/08/25/a16z-spends-1-49m-in-washington-lobbying-while-rivals-mostly-sit-out/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T23:17:27.000Z",
      "summary_90w": "",
      "raw": "Venture giant Andreessen Horowitz is burning cash to shape policy on the Hill.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67b4206dd9ae58cfff36327b2b3e59e95d9f07d7",
      "title": "Chocolate and butter prices help drive food inflation to 18-month high",
      "url": "https://www.bbc.com/news/articles/cly4eme0284o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:10:09.000Z",
      "summary_90w": "",
      "raw": "A survey says food inflation is at its highest level for 18 months, as the cost of staples grow.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "017cd6a91f4e47f2e9aa6b6559a288732dad6bba",
      "title": "Lil Nas X pleads not guilty to four felony charges after LA arrest",
      "url": "https://www.bbc.com/news/articles/cly4ey0nm7xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:05:34.000Z",
      "summary_90w": "",
      "raw": "The rapper, whose legal name is Montero Lamar Hill, was detained last week while wandering the streets in his underwear.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879547e52879a91d5eb5422e60573269b842019f",
      "title": "Schools, care homes and sports clubs sold off to pay spiralling council debt",
      "url": "https://www.bbc.com/news/articles/cq87497v8ypo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T23:03:28.000Z",
      "summary_90w": "",
      "raw": "Hundreds of council-owned buildings being sold as local authorities seek to reduce debts of £122bn.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b20610a62beaca2ddafb2afd968c07f586f135f",
      "title": "Road to Battlefield: Central Eurasia’s largest startup competition in history sends four winners to TechCrunch Startup Battlefield",
      "url": "https://techcrunch.com/2025/08/25/road-to-battlefield-central-eurasias-largest-startup-competition-in-history-sends-four-winners-to-techcrunch-startup-battlefield/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T22:27:59.000Z",
      "summary_90w": "",
      "raw": "The startup ecosystem in Central Eurasia is having its moment. What started as 485 applications from across 27 countries has culminated in the largest startup pitch competition in Central Eurasia's history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "18bb19376f98fd57bd9ac08fa806c21ad8ac288d",
      "title": "Ukraine's naval band joins Scots Guards for joint performance",
      "url": "https://www.bbc.com/news/videos/c627qgke3w3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T22:10:55.000Z",
      "summary_90w": "",
      "raw": "The two military bands were playing at Buckingham Palace to mark the the 34th Independence Day of Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f258f4951c54d3bb13e470909a3ddf06838f7e74",
      "title": "How Taiwan is preparing for Chinese attack with acting, fake blood and mock missile strikes",
      "url": "https://www.bbc.com/news/articles/cp94v42gmg9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T22:07:21.000Z",
      "summary_90w": "",
      "raw": "Leaders are strengthening its defence, but most Taiwanese believe it is unlikely China will invade soon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2703b921767bdd548ebbb51fedc749372bfef038",
      "title": "The new entry-level Kindle Colorsoft is $30 off for a limited time",
      "url": "https://www.theverge.com/tech/765254/amazon-kindle-colorsoft-16gb-e-reader-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T22:00:00.000Z",
      "summary_90w": "",
      "raw": "Amazon’s 16GB Kindle Colorsoft is less than a month old, but it’s already on sale for $219.99 ($30 off) at Amazon, Best Buy, and Target. Meanwhile, the new Colorsoft Kids — which includes a 12-month subscription to Amazon Kids Plus, a two-year extended warranty, and a cover-style case — has been discounted to $239.99 ($30 off) at Amazon, Best Buy, and Target. Both ad-free e-readers feature a seven-inch color E Ink display, IPX8 waterproofing, and a battery that can last up to eight weeks on a single charge. \nKindle Colorsoft (16GB)\n\nWhere to Buy:\n\n $249.99 $219.99 at Amazon\n $249.99 $219.99 at Best Buy\n $249.99 $219.99 at Target\n\n\nKindle Colorsoft Kids\n\nWhere to Buy:\n\n $269.99 $239.99 at Amazon\n $269.99 $239.99 at Best Buy\n $269.99 $239.99 at Target\n\nThe 16GB Colorsoft is Amazon’s newest color e-reader, and it has many of the same features found on last year’s Kindle Colorsoft Signature Edition. It offers the same page turn speeds and works well when reading both monochrome and color books; however, like with the step-up model, the resolution drops from 300ppi to 150ppi when reading books in color, which was noticeable but not a dealbreaker in our testing. Viewing PDFs in color on the Signature Edition via the Send to Kindle service worked well enough, too, but transferring them from a computer via USB-C stripped their color. \nOverall, Amazon’s entry-level Colorsoft is the best color e-reader in its price range. If you love reading graphic novels or books with a lot of illustrations, you’ll get a much richer experience compared to reading the same titles on a monochrome Kindle (it also won’t irritate your eyes as much as staring at a phone or tablet screen). That being said, you do lose some features when stepping down from the Signature Edition, including support for wireless charging and an auto-adjusting front light. The Signature Edition also has twice the storage (32GB) and supposedly an extra four weeks of battery life, though we haven’t used the entry-level model long enough to confirm the latter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f4997fc66c36fa7d9c72adcce835f06fa68e6a2",
      "title": "Trump again calls for FCC to revoke ABC and NBC licenses",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515480/fcc-abc-nbc-reviews",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T21:28:48.000Z",
      "summary_90w": "",
      "raw": "President Trump lashed out on social media late Sunday against ABC and NBC, putting the nation's top broadcast regulator once more at the center of his culture wars.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cf8408cc16d866cad1b4fc9343ce5af847d6e9f",
      "title": "Next set of VC judges locked in for Startup Battlefield 200 at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/25/next-batch-of-startup-battlefield-200-judges-revealed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T21:18:48.000Z",
      "summary_90w": "",
      "raw": "The Startup Battlefield 2025 judging panel is getting even stronger. Our first wave of VCs brought serious firepower, and now we’re adding more top investors who will grill founders, unpack the big questions, and help crown this year’s $100,000 champion at TechCrunch Disrupt, October 27–29 in San Francisco’s Moscone West.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "294862dbf06c9961d2f464e5728b1f3e64131420",
      "title": "First human case of flesh-eating screwworm parasite confirmed in US",
      "url": "https://www.bbc.com/news/articles/c4geyg55jvyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T21:10:48.000Z",
      "summary_90w": "",
      "raw": "New World screwworm myiasis was found in a patient who returned to the US from El Salvador, authorities say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d9fa43385b638c3e220298dba8767c395f32739",
      "title": "'How will I pay workers?': Indian factories hit hard by Trump's 50% tariffs ",
      "url": "https://www.bbc.com/news/articles/c98lr56mznjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T21:03:03.000Z",
      "summary_90w": "",
      "raw": "BBC correspondents visit export hubs across India to assess how steep US tariffs are impacting business owners.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41cd7bb048661244c6c910e0fe5682ab69398f64",
      "title": "AI sycophancy isn’t just a quirk, experts consider it a ‘dark pattern’ to turn users into profit",
      "url": "https://techcrunch.com/2025/08/25/ai-sycophancy-isnt-just-a-quirk-experts-consider-it-a-dark-pattern-to-turn-users-into-profit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T20:50:31.000Z",
      "summary_90w": "",
      "raw": "Experts say that many of the AI industry’s design decisions are likely to fuel episodes of AI psychosis. Many raised concerns about several tendencies that are unrelated to underlying capability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c2a9a3145c9de354e8ee10ee94a236ef9186d4ca",
      "title": "Less serious violence at Notting Hill Carnival this year, say police",
      "url": "https://www.bbc.com/news/articles/cpdj7lnx40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T20:47:16.000Z",
      "summary_90w": "",
      "raw": "More than 400 people were arrested at the event, but police say fewer serious incidents took place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02d210b1ee7dca58b0ca08c76710810762f96dc0",
      "title": "Israeli strikes kill 22, including 5 journalists, in a Gaza hospital",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515630/israel-gaza-journalists-killed-hospital",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T20:26:07.000Z",
      "summary_90w": "",
      "raw": "Israeli forces killed 22 people, including five journalists, in two strikes on Gaza's Nasser Hospital, drawing global condemnation and prompting a rare admission of regret from the Israeli government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86caaa6448b8f1ba3b3fab2bb91ae4ecc67f6a83",
      "title": "The 58 best Labor Day deals we’ve found so far",
      "url": "https://www.theverge.com/tech/756227/best-labor-day-sales-deals-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T20:16:01.000Z",
      "summary_90w": "",
      "raw": "The AirPods 4 are $30 off ahead of Labor Day.\t\n\nLabor Day marks the unofficial end of summer, and while the prospect of cooler weather and shorter days can be a tough adjustment, at least there is always a great selection of deals to combat the post-summer blues. You’ll have to wait until September 1st to celebrate the actual holiday, sure, but in the meantime, we’ve gone ahead and rounded up the best discounts you can get so far on a variety of Verge-approved gadgets and goods, from earbuds to the latest e-readers.\nBeing that it’s nearly the end of August, it’s also a good reminder that the holidays will be here before you know it. Thankfully, some gadgets — including Sony’s WH-CH520 headphones, Roborock’s 35A robot vacuum, and TP-Link’s X55 Wi-Fi routers — have fallen to their lowest price to date, making now an excellent time to get a head start on your holiday shopping. After all, there’s no guarantee they’ll drop lower in price, even when Black Friday and Cyber Monday roll around.\n\n\n\n\n\nSpeaker deals\nHeadphone and earbuds deals\nSmart home deals\nTV deals\nTablet and e-reader deals\nSmartwatch and fitness tracker deals\nOutdoor deals\nMiscellaneous deals \n\nSpeaker deals\nSonos Roam 2\nLike its predecessor, the Sonos Roam 2 is a compact and travel-friendly Bluetooth speaker that easily syncs up with Sonos’ home audio ecosystem via Wi-Fi. While it looks much like the original, the Roam 2 has some small quality-of-life improvements, like a separate button for Bluetooth connections. Read our hands-on impressions.\n\nWhere to Buy:\n\n $179 $139 at Amazon\n $179 $139 at B&H Photo\n $179 $139 at Best Buy\n\n\nSonos Era 100\nSonos’ Era 100 smart speaker is a replacement for the older Sonos One, utilizing two tweeters (left and right) and one larger woofer. In addition to Wi-Fi, the Era 100 also supports Bluetooth audio and line-in playback via an optional 3.5mm to USB-C adapter. Read our review.\n\nWhere to Buy:\n\n $199 $179 at Amazon\n $249 $179 at Sonos\n $199 $179 at Best Buy\n\nJBL’s Flip 7 is on sale for around $129.95 ($20 off) at Amazon, Best Buy, Walmart, and B&H Photo, matching its second-best price to date. The Bluetooth speaker is dustproof, waterproof, and comes with an interchangeable clip and loop, so you can attach it to your bag. It’s a mono speaker, but you can pair two together for stereo sound, and it’s rated to last up to 16 hours per charge while in Playtime Boost mode.\nUltimate Ears’ Megaboom 4 is currently available at Amazon for $149.99 ($50 off), which is the lowest price we’ve seen this year. The 360-degree Bluetooth speaker carries an IP67 rating, floats, and can last up to 20 hours on a single charge. The button on the top can even be programmed to start a playlist on Spotify, Amazon Music, or Apple Music.\nBeats Pill (2024)\nThe 2024 Beats Pill offers improved sound, USB-C, and native support for Find My and voice assistants on both iOS and Android. It also bests the previous model with double the battery life (24 hours) and IP67 water resistance. Read our review.\n\nWhere to Buy:\n\n $149.95 $99 at Amazon\n $149.95 $99.95 at Walmart\n $149.99 $99.99 at Target\n\nHeadphone and earbuds deals\nApple AirPods 4\nApple’s AirPods 4 improve on previous models with better sound, clearer voice calls, and an even more comfortable design. For $50 extra, you can purchase a model with active noise cancellation and wireless charging. Read our review.\n\nWhere to Buy:\n\n $129 $89.99 at Amazon\n $129 $89.99 at Walmart\n $129.99 $89.99 at Best Buy\n\n\nBeats Studio Pro\nThe latest Beats Studio Pro feature improved noise cancellation, sound quality, and comfort. They also support lossless audio over USB-C, making them the first Apple headphones to do so. Read our review.\n\nWhere to Buy:\n\n $349.99 $179.95 at Amazon\n $349.99 $179.95 at Walmart\n $349.99 $223.99 at Best Buy\n\nSony’s budget-friendly WH-CH520 are matching their all-time low of around $38 ($31 off) at Amazon, Best Buy, and Walmart. The on-ear headphones can tap into Google’s Find My Device network and support multipoint Bluetooth connectivity, so you can keep them paired to two devices simultaneously. They also support Fast Pair on Android and can last up to 50 hours per charge, which is impressive for a pair of budget-friendly cans.\nYou can now buy the latest AirPods Max with USB-C starting at $479.99 at Amazon, Best Buy, and Walmart. Apple’s over-ear headphones combine excellent sound with powerful noise cancellation and a natural-sounding transparency mode. They also feature deep integration with other Apple products and a premium stainless steel / aluminum build that makes them stand out from plastic rivals, even if they’re somewhat heavy to wear during long listening sessions. Read our review of the original model.\nSonos Ace\nThe Sonos Ace are the company’s first set of wireless headphones. They feature a premium, comfortable build and active noise cancellation, along with compatibility with Sonos Arc and other Sonos soundbars. Read our review. \n\nWhere to Buy:\n\n $399 $299 at Amazon\n $399 $299 at Best Buy\n $399 $299 at Walmart\n\n\nBeats Studio Buds Plus\nThe Beats Studio Buds Plus offer better sound and noise cancellation than the original pair, and they now come in a unique translucent color option. Read our review.\n\nWhere to Buy:\n\n $169.95 $84.95 at Woot\n $169.95 $99.95 at Amazon\n $169.95 $129.95 at Best Buy\n\nBose noise-canceling QuietComfort Earbuds are some of the best mid-tier earbuds we’ve tested, and they’re currently on sale at Amazon, Best Buy, and Walmart for around $149.99 ($30 off), matching their second-best price to date. The wireless earbuds are comfortable to wear, and last around eight hours per charge with ANC enabled. We liked the way they sounded out of the box and appreciated their five-band EQ, which allowed us to tune them to our tastes. Read our hands-on impressions.\nSony WH-1000XM4\nSony’s WH-1000XM4 noise-canceling headphones still offer plenty of bang for your buck with excellent ANC, lively sound, and lengthy battery life. They’re not the company’s latest, but they remain an excellent buy. Read our review.\n\nWhere to Buy:\n\n $348 $198 at Amazon\n $348 $199.99 at Walmart\n $348 $199.99 at Best Buy\n\n\nBose QuietComfort Headphones\nBose’s QuietComfort Headphones, which replace the QuietComfort 45, have adjustable noise cancellation and the ability to set custom modes. However, they lack immersive audio mode and the higher-quality Bluetooth found in the QuietComfort Ultra Headphones.\n\nWhere to Buy:\n\n $359 $229 at Amazon\n $359 $229 at Best Buy\n $359.99 $229.99 at Target\n\nSmart home deals\nTovala Smart Oven Air Fryer\nTovala’s smart oven / air fryer combo is designed to be used in conjunction with its scannable meal kits, which let you make tasty meals in about 20 minutes. Right now, you can get it for free when you buy it from Tovala and order meals six times over six months. Each meal costs around $12.99. Read our review.\n\nWhere to Buy:\n\n $299 at Tovala (with code LABORDAY25)\n\n\nBlink Video Doorbell (second-gen-en) with Sync Module Core\nBlink’s second-gen Video Doorbell records 1080p video in a 1:1 aspect ratio to show their entire body. It comes with a Sync Module that acts as a hub and helps extend its battery life to roughly two years. Clips are stored in the cloud for a subscription fee of $3 per month, or locally using Blink’s Sync Module and a microSD card.\n\nWhere to Buy:\n\n $69.99 $39.99 at Amazon\n $69.99 $39.99 at Best Buy\n $69.99 $39.99 at Target\n\nBlink’s Outdoor 4 cameras can beef up your home’s smart security system, and right now you can get a pair at Amazon for $89.99 ($90 off), which is the best price we’ve seen since Prime Day. The 1080p security cameras are weather-resistant and can last up to two years before their AA batteries need to be replaced. Clips can be stored in the cloud for a subscription fee, or locally using its Sync module (included) and a flash drive. Blink’s five-camera bundle is also on sale for $199.99 ($200 off) at Amazon and Best Buy. \nWhisker’s Litter Robot 4 can automatically clean itself by sifting waste from litter, minimize odors, and keep track of your cat’s weight, which you can check in Whisker’s app. It was designed to accommodate cats of many breeds and sizes, and it works efficiently enough to be used daily by four cats. A bundle that includes the machine and a three-year extended warranty is currently going for $699 ($100 off) at Whisker’s online storefront.\nEcobee Smart Thermostat Premium\nThe Ecobee Smart Thermostat Premium is an excellent option for adding smarts and some style to your HVAC system. As well as being a smart way to control your energy use, the thermostat can also act as a video intercom for Ecobee’s excellent doorbell camera and an indoor air quality monitor.\n\nWhere to Buy:\n\n $249.99 $229.99 at Amazon\n $249.99 $229.99 at Best Buy\n $249.99 $229.99 at Ecobee\n\n\nEcobee Smart Doorbell Camera\nThis is a great wired doorbell camera, and the only one that can use an Ecobee thermostat as a video intercom, making it a no-brainer for Ecobee households, as long as you can hook it to your doorbell wiring.\n\nWhere to Buy:\n\n $159.99 $119.99 at Amazon\n $159.99 $119.99 at Best Buy\n $159.99 $119.99 at Ecobee\n\nMammotion’s Yuka Mini 500H is a robotic lawnmower that looks (and works) like a robot vacuum, and it’s currently on sale at Amazon for an all-time low of $649 ($449 off). It uses AI and sensors to map out your yard, avoid obstacles, and find the most efficient route to mow. The 500H can keep track of up to 15 “work zones” and move between them independently; it can also run for up to 55 minutes per charge.\nYou can buy the GE Profile Smart Indoor Smoker from Williams Sonoma and GE Appliances for around $599 ($100 off). If you don’t have the space for an outdoor grill, the handy gadget is a great way to add a delicious, smoky flavor to meats and vegetables right from your kitchen. It can’t handle classic BBQ cuts as well as a traditional wood-pellet smoker, but the built-in heating element does a nice job cooking your food while the smoke imparts it with additional flavor. The resulting meat might not be as tender as it would be if you were to only use smoke, but hey, at least it doesn’t take up a ridiculous amount of space in your backyard. Read our review.\nRing Battery Doorbell (2024)\nThe 1080p camera on Ring’s latest Battery Doorbell has improved color night vision and a taller, head-to-toe field-of-view for package detection than the previous model. It also features better battery life and push-pin dismounting.\n\nWhere to Buy:\n\n $99.99 $54.99 at Amazon\n $99.99 $54.99 at Best Buy\n $99.99 $54.99 at Target (with Circle)\n\nThe GE Profile Opal 2.0 Ultra is on sale for around $529.95 ($100 off) at Best Buy, Crate & Barrel, and Williams Sonoma. The smart gadget does an excellent job delivering a full batch of fresh, chewable ice in just 10 minutes, and can produce up to 38 pounds of ice a day. The Ultra is also easier to maintain than the base model, as it comes with a built-in filter for handling mineral buildup, a reusable air filter, and sanitization reminders. Read our review.\nIf you want smart lighting without replacing all the light bulbs in your home, Lutron’s Diva is a great smart home addition that’s on sale for $99.95 ($25 off) at Amazon and Best Buy. Once installed, you can dim your lights or turn them on and off using the switch, an included remote, or an app on your phone. It’s also compatible with all the major smart home platforms, including Amazon Alexa, Google Home, and Apple Home.\nRing Alarm 14-Piece Kit\nThe Ring Alarm 14-Piece Kit has all the sensors and accessories you need to protect a two- to four-room house. You can also opt for 24/7 professional monitoring by signing up for a Ring Home subscription, which costs between $10 and $25 a month, depending on which plan you choose.\n\nWhere to Buy:\n\n $329.99 $198.99 at Amazon\n\n\nCurrent Model P Smart Pizza Oven\nCurrent’s Model P Smart Pizza Oven runs on electricity, gets up to 850 degrees Fahrenheit, and can cook a pizza in two minutes. Its companion app lets you customize your cook based on your pizza style and thickness. Read our review.\n\nWhere to Buy:\n\n $699 $489.3 at Amazon\n $699 $559.2 at Current\n\nRoborock’s QV 35A is available for an all-time low of $439.99 ($159 off) from Amazon and Roborock. The robot vacuum mop / combo uses lidar to construct a 360-degree map of your home — allowing it to create a more efficient cleaning route — and works on hardwood, carpets, and rugs. Dust and dirty water are deposited into containers in the included charging base, which Roborock suggests you should empty weekly. You can even set the QV 35A, which offers 8,000Pa of suction power and a pair of self-washing mopping pads, to run on a schedule via its accompanying mobile app.\nEufy’s Robot Vacuum C10 is a slim robovac that’s designed to clean under furniture, and it’s down to a new low of $199.99 ($280 off) at Amazon and Eufy’s online storefront (with code WS7DV21XNS06). The vacuum maps out your room to avoid obstacles, and you can set no-go zones to avoid certain areas entirely. Debris is deposited into a 3L container in its charging base, which Eufy says needs to be replaced every 60 days. You can also schedule a cleaning with Eufy’s app or your voice using Alexa or Google Assistant.\nEcho Show 5 (third-gen)\nThe newest Echo Show 5 is just as small as its predecessor but features updated mics and a speaker system that delivers double the bass and clearer sound quality.\n\nWhere to Buy:\n\n $89.99 $64.99 at Amazon\n $89.99 $64.99 at Best Buy\n $89.99 $64.99 at Target\n\n\nYale Assure Lock 2 Touch\nThis fingerprint lock is fast and reliable, and the keypad is a good backup option for visitors. It works with Apple Home and can be upgraded to support Wi-Fi — which you’ll need for remote unlocking, Android phones, Amazon Alexa, and Google Home support. Auto-unlock can open the door as you approach, and you can also use a key if you just can’t let go.\n\nWhere to Buy:\n\n $189.99 $139.99 at Amazon (Bluetooth)\n $279.99 $246.98 at Amazon (Wi-Fi)\n\nYou can buy Amazon’s ad-free Echo Hub at Amazon, Best Buy, and Target right now for just $129.99 ($50 off), which is $10 shy of its all-time low. The Echo Hub lets you control your smart home via an eight-inch touchscreen, one that even lets you check live feeds from your video doorbell and control your Ring Alarm security system. It’s loaded with a bunch of interactive widgets, too, while built-in support for both Matter and Thread means it’ll work with a whole host of smart home devices, in addition to Amazon Alexa. Read our review.\nTV deals\nSamsung QN80F\nSamsung is offering a free 65-inch U8000F TV when you purchase select 98-inch (or larger) TVs. The QN80F features a 120Hz 4K panel, a custom-designed processor for AI upscaling and color optimization, and built-in Alexa support.\n\nWhere to Buy:\n\n $6499.98 $4999.99 at Samsung (100-inch)\n\n\nSony Bravia 8 II\nThe Bravia 8 II was chosen as the “king of TV” by a panel of judges (including The Verge’s own Nilay Patel) in Value Electronics’ 2025 shootout. The OLED TV has excellent color accuracy, a bright panel, and a 120Hz refresh rate.\n\nWhere to Buy:\n\n $2999.99 $2298 at Amazon (55-inch)\n $2999.99 $2299.99 at Best Buy (55-inch)\n $3499.99 $2998 at Amazon (65-inch)\n\nSamsung’s 98-inch DU9000 is a massive TV that’s back down to its all-time low of around $1,897.99 ($600 off) at Amazon, Best Buy, and Walmart. The set has a 120Hz refresh rate, HDR Plus support, and a direct-lit panel for more even brightness. It also has an AI processor to adjust its picture and brightness settings automatically, and upscale low-resolution video to look nicer on a big 4K screen. If you have a Q-Symphony-compatible soundbar, the DU9000 will even integrate its built-in speakers into the audio system.\nIf you need a 4K TV for a smaller space, Sony’s 43-inch K43S30 is available at Amazon, Best Buy, and Walmart for around $448 ($51 off), an all-time low. It has a 60Hz direct-lit panel that’s great for casual gaming or TV and movie streaming, and includes access to Sony Pictures Core, an exclusive streaming service that lets you watch movies in ultra high quality. You can use Google Assistant to search for content or control compatible smart home accessories with just your voice.\nTCL QM7K\nTCL’s midrange QM7K has a QD-Mini LED TV with a 144Hz refresh rate, hundreds of local dimming zones for more precise brightness controls, and a Bang & Olufsen audio system.\n\nWhere to Buy:\n\n $1299.99 $596.99 at Amazon (55-inch)\n $1299.99 $596.99 at Walmart (55-inch)\n $1299.99 $599.99 at Best Buy (55-inch)\n\nTablet and e-reader deals\niPad (2025)\nApple’s entry-level iPad is an excellent tablet for casual use. Its high resolution screen is great for watching video, and its A16 processor is fast enough to handle light games and productivity apps. Read our review.\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $449 $399 at Amazon (256GB, Wi-Fi)\n $649 $599 at Amazon (512GB, Wi-Fi)\n\n\nKindle (2024)\nAmazon’s new entry-level Kindle retains a six-inch, 300ppi display and USB-C. It’s brighter and slightly faster than its predecessor, though, and features longer battery life.\n\nWhere to Buy:\n\n $109.99 $89.99 at Amazon (with ads)\n $109.99 $89.99 at Best Buy (with ads)\n $129.99 $109.99 at Amazon (without ads)\n\n\nAmazon Fire HD 10 (2023)\nThe 2023 Amazon Fire HD 10 sports a 10.1-inch, 1080p display and 3GB of RAM, which is plenty if you’re streaming or browsing. It’s lighter than the last-gen model, too, and comes with support for both the Made for Amazon Stylus Pen and Amazon’s handwriting recognition technology.\n\nWhere to Buy:\n\n $139.99 $89.99 at Amazon (32GB, with ads)\n $179.99 $99.99 at Amazon (64GB, with ads)\n $154.99 $104.99 at Amazon (32GB, without ads)\n\nThe TCL Nxtpaper 14 is a 14.3-inch tablet designed for drawing and note-taking, and it’s on sale for an all-time low of $369.99 ($70 off) at Amazon. The tablet features a 2.4K matte display and comes with a T-Pen Stylus that features more than 4,000 pressure levels, so you can get precise strokes when sketching. Its Ink Paper and Color Paper modes also adjust the colors to look more like actual sheets of paper, which can help when reading or writing.\nAmazon Fire Max 11 (64GB, with ads)\nAmazon’s highest-end tablet features an 11-inch LCD display with 2000 x 1200 resolution as well as options for an add-on keyboard and stylus. Read our review.\n\nWhere to Buy:\n\n $229.99 $174.99 at Amazon (tablet only)\n $229.99 $174.99 at Best Buy (tablet only)\n $264.99 $211.98 at Amazon (with stylus)\n\nSmartwatch and fitness tracker deals\nGarmin Venu 3S\nThe Venu 3S remains our favorite Garmin smartwatch. It’s a comfortable wearable with up to 10 days of battery life and a vibrant 1.2-inch OLED display, not to mention solid sleep tracking, Atrial Fibrillation detection, and a built-in EKG reader. Read our review.\n\nWhere to Buy:\n\n $449.99 $399.99 at Amazon\n $449.99 $399.99 at Best Buy\n $449.99 $399.99 at REI\n\n\nGoogle Pixel Watch 3\nGoogle’s Pixel Watch 3 is bigger and brighter than its predecessor. It also features more advanced running capabilities, offline Google Maps functionality, and deeper integration with other Google devices. Read our review.\n\nWhere to Buy:\n\n $349.99 $249.99 at Amazon (41mm)\n $349.99 $249.99 at Target (41mm)\n $399.99 $299.99 at Amazon (45mm)\n\nThe stylish Withings ScanWatch Light, our favorite hybrid Android smartwatch, is currently available for $199.95 ($50 off) from Amazon and Withings, which is one of the better prices we’ve seen in recent months. Although the smartwatch stands out largely for its elegant appearance, it can also track your steps, sleep, menstrual cycles, and GPS workouts (when tethered to your phone). Plus, it offers access to all the basics — alarms, push notifications, timers, etc. — and up to 25 days of battery life on a single charge.\nOutdoor deals\nBioLite FirePit Plus\nBioLite’s portable FirePit Plus cuts back on unwanted smoke, functions either as a charcoal or wood-fueled grill, and fans the flames via a large battery pack and built-in fan.\n\nWhere to Buy:\n\n $399.95 $299.94 at Amazon\n $399.95 $299.96 at BioLite\n\nJackery’s Explorer 1000 v2 is a great tool to keep campers on the grid, and it’s currently available from Amazon, Best Buy, and Jackery for around $448.99 ($351 off), its lowest price to date. The portable power station features a 1070Wh battery, along with three AC outlets, a DC output, two USB-C ports, and a USB-A port. It’s powerful enough to run small appliances — or recharge your phone, tablet, or laptop several times over — and can be fully recharged in about an hour and a half (or less with emergency charging enabled).\nGarmin’s inReach Messenger Plus is a satellite communicator that allows you to send text, pictures, or voice messages from remote areas, and it’s going for $449.99 ($50 off) at Amazon, REI, and Best Buy. It has a 1,600-character or 30-second voice clip limit, but that’s enough to get a message through in case of an emergency. The rugged gadget can also last up to 25 days on a single charge, and its IPX7 rating means it’s protected against dust and water. Just note that you’ll need a Garmin subscription, which starts at $7.99 a month, to use it.\nStarlink Standard Kit\nStarlink’s Standard Kit comes with both an antenna and a router, which allows you to easily connect your devices to a satellite-based internet connection. Download speeds up to 280Mbps are possible, but will vary by region, subscription tier, and weather conditions.\n\nWhere to Buy:\n\n $349.99 $174.99 at Best Buy\n $349.99 $174.99 at Walmart\n $349.99 $174.99 at The Home Depot\n\nIf you’re planning a late-summer camping trip, Osprey’s Transporter Roll-Top Pack is down to $82.18 ($82.82 off) at REI when you use the promo code LABORDAY2025. The 20L backpack is made from a PFC-free, water-repellent material, and the top rolls up and stays shut with a buckled strap to prevent water from getting in. It also features a large main compartment, a zippered pocket that can accommodate a 16-inch laptop, and water bottle pockets on both sides.\nBreeo’s X24 Smokeless Fire Pit is down to $509.15 ($81 off) at Amazon and from Breeo, matching its best price to date. The fire pit is made from Corten Steel and features a raised air vent and perforations near its rim to provide continuous airflow, which keeps the fire alive and re-burns the wood to reduce smoke production. Breeo says the fire pit’s material will patina over time, so don’t be alarmed if it changes color after a few uses. If you have additional space, Breeo’s X30, which is designed to accommodate eight chairs around it, is also on sale for an all-time low of $1,189.15 ($210 off) at Amazon and from Breeo.\nMiscellaneous deals \nMill Food Recycler (second-gen)\nMill’s latest Food Recycler works overnight to shrink your food scraps by 80 percent and convert them into compost, which you can then use for gardening or dispose of responsibly. It has a 6.5-liter capacity, which Mill says takes roughly four weeks to fill, and eliminates most odors.\n\nWhere to Buy:\n\n $999 $874 at Mill\n\nYou can buy a four-pack of AirTags at Amazon, Best Buy, and Walmart for just $69.99 ($34 off), which is $5 shy of the bundle’s best price to date. Apple’s ubiquitous Bluetooth trackers feature an ultra-wideband chip and connect to the company’s massive Find My network, which translates to exceptionally precise tracking if you’re an iPhone owner. The waterproof trackers also run on user-replaceable batteries and come with a host of neat software tricks, including one that allows you to share their location with up to five people or with one of several airlines.\nYou can sign up for an annual MasterClass subscription, which provides unlimited access to over 200 courses taught by experts, for $60 ($60 off) via MasterClass right now. Courses can be streamed on the MasterClass website or via an app for your phone, tablet, or streaming device. You can also download video or audio versions of them on mobile devices for offline consumption.\nAnker MagGo Wireless Charging Station (3-in-1, Dock Stand)\nAnker’s MagGo Wireless Charging Station features a MagSafe charging stand, a Qi wireless charging pad, and an Apple Watch charger. It should charge all three devices at their top speed simultaneously, and comes with a 40W USB-C power adapter and cable.\n\nWhere to Buy:\n\n $89.99 $69.99 at Amazon\n $89.99 $69.99 at Anker (with code WS7DV2YB43A0)\n\n\nInsta360 Link 2\nThe Insta360 Link 2 offers the same auto-swiveling design as its predecessor in a smaller form factor. It also offers a slate of new features, including group tracking and no-follow zones.\n\nWhere to Buy:\n\n $199.99 $149.99 at Amazon\n $199.99 $149.99 at Best Buy\n $199.99 $149.99 at B&H Photo\n\nYou can pick up a three-pack of TP-Link’s X55 Wi-Fi 6 routers for an all-time low price of $139.99 at Amazon and B&H Photo. The routers can create a network that covers 6,500 square feet, deliver speeds up to 3,000Mbps, and connect to up to 150 devices. TP-Link routers have been easy to set up and maintain in our experience, which makes them a great “set it and forget it” solution for networking problems.\nIf you have a smaller space, a single Eero 6 Mesh Wi-Fi router may be sufficient, and you can pick one up for $74.99 ($15 off) — which is lower than its Prime Day price — at Amazon, B&H Photo, and Best Buy. The router can create a network covering up to 1,500 square feet, connect to 75 devices at once, and deliver speeds of up to 900Mbps. If you move to a larger place, you can pick up an additional router (or two) to expand your network. A bundle that includes one router and two extenders is currently going for $159.99 ($40 off) at Amazon and B&H Photo, if you need a larger network now.\nUpdate, August 25th: Adjusted pricing / availability and added several new deals, including those for the latest entry-level Kindle, the AirPods 4, and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2efab33baa92a4f311bba03e92f9180da07623a8",
      "title": "Epstein accuser Virginia Giuffre's memoir will be published months after her death",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515627/virginia-giuffre-book-jeffrey-epstein-memoir",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T20:07:11.000Z",
      "summary_90w": "",
      "raw": "Virginia Giuffre was one of convicted sex offender Jeffrey Epstein's most outspoken accusers. Six months after her death, Giuffre's book detailing her life will be published.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "001e09c9387a06556e7b9365ab53aa05d58635b3",
      "title": "Notting Hill Carnival revellers party in the sunny streets",
      "url": "https://www.bbc.com/news/articles/c4gjyyd2320o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T19:52:50.000Z",
      "summary_90w": "",
      "raw": "The celebrations continue with the adult's parade, sound systems and live performances on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ca72b19cbda9c1d78ff4a31db2ace668fb25bfa",
      "title": "Israeli double strike on Gaza hospital - what we know",
      "url": "https://www.bbc.com/news/articles/c80d2zrdj7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T19:52:41.000Z",
      "summary_90w": "",
      "raw": "Netanyahu said it was a \"tragic mishap\" but did little to address the apparent \"double-tap\" nature of the attack.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56c6fe9d63bdc3aeea3c3dad9fffb72e13925c6f",
      "title": "France has ‘no lessons to take’ from US on tackling antisemitism, says minister",
      "url": "https://www.theguardian.com/world/2025/aug/25/france-has-no-lessons-to-take-from-us-on-tackling-antisemitism-say-ministers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T19:25:15.000Z",
      "summary_90w": "",
      "raw": "Comments come after US ambassador accused government of failing to do enough to stem hate crimes against Jews\nCabinet ministers and Jewish groups have said France has “no lessons to take” from the US on tackling antisemitism, as Washington’s ambassador to Paris was summoned after accusing the government of failing to do enough to stem hate crimes against Jews.\nCharles Kushner, who is Jewish, was ordered to report to the foreign ministry on Monday after he wrote a letter to Emmanuel Macron criticising a “lack of sufficient action” by the government to confront the “dramatic rise” in antisemitism in France.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b743b20f9d4ad8bbc8e1ec70d131c3e1324de9ce",
      "title": "Watch: Trump says he wants to meet Kim Jong Un",
      "url": "https://www.bbc.com/news/videos/c4gzy1qjrpxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T19:14:45.000Z",
      "summary_90w": "",
      "raw": "In a meeting with South Korean President Lee Jae Myung, Trump said he will meet with the North Korean leader in the \"appropriate future\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fcc65191f136d81d0bca8d25ac237e3cccf3396",
      "title": "Bounce launches a service for moving accounts between Bluesky and Mastodon",
      "url": "https://techcrunch.com/2025/08/25/bounce-launches-a-service-for-moving-accounts-between-bluesky-and-mastodon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Bounce publicly debuts a tool that will let you move your account between open social networks like Bluesky and Mastodon.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ebe10030a27681253e40bf38cf38163a04fdb3ad",
      "title": "Google Nest Camera and Doorbell leak shows off new colors and 2K video recording",
      "url": "https://www.theverge.com/news/765373/google-home-nest-cam-doorbell-2k-video-leak-gemini",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T18:54:18.000Z",
      "summary_90w": "",
      "raw": "Check out the “berry” red on the indoor Nest Cam.\t\n\nAccording to a new report from Android Headlines, Google’s next-generation Nest Cams might get an upgrade from 1080p to 2K. Along with a series of leaked images that it says show off new colors for Google’s next set of devices, the report indicates the upcoming battery-powered Nest Cam and its indoor-only counterpart may feature new capabilities powered by Gemini, and that the Nest Aware package will get a new name.\nWhile the battery-powered Nest Cam is rumored to launch in white and gray, Android Headlines reports that the wired, indoor version may toss a “berry” red color in the mix. Google is reportedly planning to introduce 2K video to a new Nest Doorbell, along with new AI-powered “Daily Summaries” that offer up daily recaps of recorded events, as well as white, beige, and a gray color options.\nAdditionally, Android Headlines revealed more details about the new Google Home Speaker, which made a brief cameo during the Pixel 10 launch event. The device is rumored to come with 360-degree audio, which Android Headlines previously reported can pair with a Google TV Streamer. The Gemini-powered smart speaker will reportedly come with a “Sound Sensing” feature that can detect and alert you to certain noises, such as glass breaking or your smoke alarm.\nGoogle is also reportedly planning to change the name of its Nest Aware subscription to “Google Home Premium,” as well as add a new “Google Home Premium Advanced” tier, though Android Headlines doesn’t share any details on what they might include.\nFor now, current Nest owners can update the Google Home app to get access to a bunch of new updates geared toward camera management. That includes new preview snapshots in camera tiles, event notification previews that include a static thumbnail, better live camera playback, as well as the ability to quickly jump 10 seconds forward and backward in recordings by double-tapping the left or right side of the video player.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb2ab4a2eeb3f2f056e5ca66b1f6b289de5497e",
      "title": "Five journalists among 20 killed in Israeli double strike on hospital",
      "url": "https://www.bbc.com/news/articles/cp89rp48246o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T18:31:54.000Z",
      "summary_90w": "",
      "raw": "Israeli Prime Minister Benjamin Netanyahu said it was a \"tragic mishap\" and promised a \"thorough investigation\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b058282cd070cdda6182cd6b21499cb3092758b",
      "title": "French prime minister to face potential ousting in high-stakes confidence vote",
      "url": "https://www.theguardian.com/world/2025/aug/25/francois-bayrou-france-prime-minister-confidence-vote",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T18:25:19.000Z",
      "summary_90w": "",
      "raw": "François Bayrou to seek parliamentary backing for his unpopular plans to shore up France’s public finances \nFrance’s embattled prime minister looks likely to be ousted and his government toppled next month in a high-stakes confidence vote that could plunge the EU’s second-biggest economy into even deeper political crisis.\nFrançois Bayrou said on Monday that he would seek parliamentary backing for his unpopular plans to shore up France’s ailing public finances on 8 September, asking deputies to “confirm the scale” of spending cuts he says are needed to save €44bn (£38bn) a year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "552cce672d5c1e483e216c77950d4f6de20e7b30",
      "title": "Google will require developer verification for Android apps outside the Play Store",
      "url": "https://techcrunch.com/2025/08/25/google-will-require-developer-verification-for-android-apps-outside-the-play-store/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T18:23:12.000Z",
      "summary_90w": "",
      "raw": "Google will ask all Android developers to verify their identity starting next year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cdf483c05b4e1395bf5e5d6b75a68993fa6ae866",
      "title": "Kennedy Center names new director of dance programming, days after former staff firings",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515594/kennedy-center-dance-programming",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T18:19:17.000Z",
      "summary_90w": "",
      "raw": "Stephen Nakagawa, a former Washington Ballet dancer, will be the new director of dance programming. The announcement comes five days after the Kennedy Center's previous chief was dismissed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d0df866bd5add0017b8ad9d40775886a0bede1a",
      "title": "NotebookLM’s Video Overviews feature now supports 80 languages",
      "url": "https://techcrunch.com/2025/08/25/notebooklms-video-overview-feature-now-supports-80-languages/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T18:17:57.000Z",
      "summary_90w": "",
      "raw": "NotebookLM’s Video Overviews now supports 80 languages, including French and Spanish.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "088c59dd0dac1e6af0f3e1d7e06a87e86dc6162d",
      "title": "Trump says National Guard is at the ready but hedges on Chicago plans",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515615/trump-national-guard-chicago-executive-order",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T17:48:19.000Z",
      "summary_90w": "",
      "raw": "President Trump signed a series of executive orders doubling down on law enforcement, particularly related to Washington, D.C., but he equivocated on whether he will send troops to Chicago next.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c39cdd06a6f18a8cc8daf774d23c06bbe54ed240",
      "title": "Mexican drug lord ‘El Mayo’ pleads guilty to racketeering in New York",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/ismael-zambada-el-mayo-pleads-guilty",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T17:44:40.000Z",
      "summary_90w": "",
      "raw": "Ismael Zambada was co-founder of Sinaloa cartel led by Joaquín ‘El Chapo’ Guzmán, now imprisoned in US\nThe Mexican drug lord Ismael “El Mayo” Zambada, co-founder of the Sinaloa cartel, pleaded guilty to federal racketeering charges as well as running a criminal enterprise on Monday, more than a year since he was arrested in Texas after what has been described as a kidnapping.\n“I recognize the great harm illegal drugs have done to the people in the United States and Mexico,” the 77-year-old Zambada said in court through a Spanish-language interpreter. “I apologize for all of it, and I take responsibility for my actions.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f01fcaf48b0142cfbdade75c17d49cbfd9ea7a7f",
      "title": "Three dead and one injured as helicopter crashes during flying lesson",
      "url": "https://www.bbc.com/news/articles/c87e22ryerlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T17:41:43.000Z",
      "summary_90w": "",
      "raw": "One person remains in hospital in a serious condition after the incident near Shanklin.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1532fd0e891e7d961fbd9f60ef4aab61af037774",
      "title": "Israel bombed Gaza hospital a second time, killing rescuers, say health officials",
      "url": "https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T17:41:36.000Z",
      "summary_90w": "",
      "raw": "At least 20 people, including five journalists, died as they rushed to help those wounded in the first strike\nIsrael bombed the main hospital in southern Gaza on Monday and then struck the same spot again as rescuers and journalists rushed to help the wounded, killing at least 20 people including five journalists, health officials said.\nThe first strike hit the top floor of a building at the Nasser hospital, killing the Reuters journalist Hussam al-Masri and others. Journalists and rescuers then rushed to the scene to help the wounded, when a second bomb struck the same spot, 15 minutes later.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ec9410741ad6d7b9f6d0b83483acb76b9191bbc",
      "title": "The U.S. confirms its first human case of New World screwworm. What is it?",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515487/new-world-screwworm-us-human-case",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T17:38:54.000Z",
      "summary_90w": "",
      "raw": "U.S. officials confirmed a case of the flesh-eating parasite in a person who traveled from El Salvador. Screwworm typically affects cattle in South America but has spread north in recent years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2971c699415ed15c5cdf7d4505b4ac817df2009",
      "title": "Evergrande's delisting in Hong Kong: key facts to know",
      "url": "https://www.npr.org/2025/08/25/g-s1-85108/evergrandes-delisting-in-hong-kong-key-facts-to-know",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T17:33:16.000Z",
      "summary_90w": "",
      "raw": "At its peak, China Evergrande Group was worth more than $50 billion. But it all came crashing down in 2021. It was massively in debt and unable to complete some existing projects.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1ba20c7aa87b19ceedb06995ad312fd43816aadf",
      "title": "Elon Musk’s xAI sues Apple and OpenAI, alleging anticompetitive collusion",
      "url": "https://techcrunch.com/2025/08/25/elon-musks-xai-sues-apple-and-openai-alleging-anticompetitive-collusion/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T17:30:38.000Z",
      "summary_90w": "",
      "raw": "According to Musk, Apple and OpenAI are colluding to stifle competition from other AI companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3789ea24252d5050f4c05c28808af070d56faedb",
      "title": "A new security flaw in TheTruthSpy phone spyware is putting victims at risk",
      "url": "https://techcrunch.com/2025/08/25/a-new-security-flaw-in-thetruthspy-phone-spyware-is-putting-victims-at-risk/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T17:27:26.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Hackers can take over the accounts of TheTruthSpy spyware customers, putting their victims' private phone data at risk thanks to a new security flaw.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3a22103904e4ab5141476396556042a9ff1ba228",
      "title": "Dr Pepper will unwind its merger with Keurig after buying Peet's for $18 billion",
      "url": "https://www.npr.org/2025/08/25/g-s1-85104/dr-pepper-keurig-peets-purchase-merger-split",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T17:25:05.000Z",
      "summary_90w": "",
      "raw": "Seven years after they merged, the soft drink maker and coffee pod innovator will become separate companies again. CEO Timothy Cofer said separate coffee and beverage businesses would be more nimble.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6774230f7cc828988af719e31df5f37795a8f5ad",
      "title": "Woody Allen rebuts Ukrainian condemnation over Moscow film festival appearance",
      "url": "https://www.theguardian.com/film/2025/aug/25/woody-allen-rebuts-ukrainian-condemnation-over-moscow-film-festival-appearance",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T17:15:08.000Z",
      "summary_90w": "",
      "raw": "The director said he did not ‘feel cutting off artistic conversations is ever a good way to help’ after Ukraine calls the film-maker’s participation a ‘disgrace’\nWoody Allen has denied claims that his participation in a Moscow film festival was “whitewashing” Russian atrocities, after condemnation of his appearance by Ukraine’s ministry of foreign affairs.\nAllen said in a statement to the Guardian: “When it comes to the conflict in Ukraine, I believe strongly that Vladimir Putin is totally in the wrong. The war he has caused is appalling. But, whatever politicians have done, I don’t feel cutting off artistic conversations is ever a good way to help.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ffbc3bb280211153b253b79cb6e4fe66305965d",
      "title": "Poland’s president vetoes legislation to prolong benefits for Ukrainian refugees",
      "url": "https://www.theguardian.com/world/2025/aug/25/polands-president-vetoes-legislation-to-prolong-benefits-for-ukrainian-refugees",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T17:10:11.000Z",
      "summary_90w": "",
      "raw": "Karol Nawrocki says only Ukrainians in work should receive child benefit payments in Poland\nPoland’s president has vetoed legislation to prolong benefits received by Ukrainian refugees in Poland, following up on a campaign promise to tighten welfare payments amid a steady growth in anti-Ukrainian sentiment among Poles.\nKarol Nawrocki, who took office earlier this month after winning an election in spring, said only Ukrainians in work should receive child benefit payments.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc701d33b9af4c894215026515cfe9b282caf283",
      "title": "Tech founder throws hat in California governor’s race",
      "url": "https://techcrunch.com/2025/08/25/tech-founder-throws-hat-in-california-governors-race/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T17:05:22.000Z",
      "summary_90w": "",
      "raw": "Ethan Agarwal, who co-founded fintech startup The Coterie, says he's running for California governor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d43b035188e48294251af91dcc7414515a70cd13",
      "title": "Israel’s attack on hospital in Gaza may constitute a war crime on many fronts",
      "url": "https://www.theguardian.com/world/2025/aug/25/israel-attack-gaza-hospital-may-constitute-war-on-many-fronts",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T16:49:02.000Z",
      "summary_90w": "",
      "raw": "Double-tap strike suggests killing of civilians, rescue workers and journalists deliberate and not a mistake\nIsrael’s twin strike on the Nasser hospital in Gaza, which killed five journalists including staff working for the Associated Press, Reuters, NBC and Al Jazeera, is a potential violation of international law writ large.\nThe attack targeted a civilian building, specifically a hospital, in a reckless double-tap strike that killed civilians, with rescue workers and journalists among them. All categories that should be protected under international law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a67396626937ea3760feecd8f0129569c6d7e8f",
      "title": "Our favorite smart lock is on sale for the first time today",
      "url": "https://www.theverge.com/smart-home/765121/kwikset-halo-select-smart-lock-sonos-era-300-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T16:38:42.000Z",
      "summary_90w": "",
      "raw": "Kwikset’s Halo Select smart lock is $20 off at multiple retailers.\t\n\nSetting up a smart home security system is important, even if you never want to think about having to use it. Thankfully, Kwikset’s Halo Select — the best smart lock we’ve ever tested — is currently down to $259 ($20 off) at Amazon, Lowe’s, and The Home Depot, marking the first time the lock has been on sale since its launch late last year. \nKwikset Halo Select\n\nWhere to Buy:\n\n $279 $259 at Amazon\n $279 $259 at Home Depot\n $279 $259 at Lowes\n\nIn her review, Verge reviewer Jennifer Pattison Tuohy praised the Halo Select for supporting four entry methods: a physical key, Kwikset’s app, a location-based auto-unlock feature, and a pin code. The lock was also easy to install thanks to the detailed instructions Kwikset provided, along with its intuitive mobile app. Out of the box, the Halo Select works with Amazon Alexa, Google Home, and Kwikset’s app via the cloud. If you have a Matter controller and Thread border router — such as a current-gen Apple TV, a recent Echo speaker, or an Eero router — you can connect to those platforms locally, and gain the ability to control the lock using Apple Home or Samsung SmartThings. \nIn our tests, using the Halo Select over Matter significantly improved its battery life. However, using the Halo Select via Matter meant giving up its auto-unlock feature, which worked reliably. Having your door unlock itself as you’re walking up to it is very convenient, but Matter doesn’t currently support auto-unlock, door sensing, fingerprint access, or facial recognition. The auto-unlock feature also requires you to have Kwikset’s app open on your phone in the background. Still, if you want a futureproof smart lock that can do almost everything (even if you have to make a tough choice about which features to prioritize), it’s our top pick.\nThree more great deals\nIf you need a basic tablet for streaming TV shows and reading books, Amazon’s latest Fire HD 10 is a great choice, one you can pick up for $89.99 ($50 off) at Amazon, Best Buy, and Target. It has a 10.1-inch 1080p display, 32GB of storage (which you can expand with a microSD card), and an eight-core processor. The tablet is compatible with the Made for Amazon Stylus Pen and Made for Amazon Bluetooth Keyboard Case, too, if you’d like to use it for sketching or long-form writing projects.  \nUsing the wrong gaming mouse can put you at a disadvantage when playing fast-paced online games where every millisecond counts. Luckily, Razer’s DeathAdder V3 Pro is down to $84.99 ($65 off) at Amazon and Best Buy, matching its Prime Day price. Razer says the optical mouse can be clicked up to 90 million times, lasts up to 90 hours per charge, and has been designed ergonomically to reduce hand fatigue. The wireless mouse features eight programmable buttons and a 30K optical sensor, which allows you to use it on most surfaces — including glass — without a reduction in tracking accuracy. You can also connect the V3 Pro to your PC wirelessly via a 2.4Ghz USB dongle (included) or with a USB-C cable.\nThe Sonos Era 300, my go-to smart speaker, is on sale at Amazon, Best Buy, and Walmart for $359 ($90 off), which matches its all-time low. It’s one of the few that can convincingly play Dolby Atmos surround sound music with perceptible depth (provided it’s mixed properly). The wireless speaker sounds great whether it’s connected to your devices via Bluetooth or Wi-Fi, and you can hook it up to a wired source (including a turntable) using an optional $19 dongle. You can also pair two together for better stereo and Dolby Atmos separation, or use them as rear channels with a Sonos soundbar for a more effective home theater system. Read our review.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcb496dfd72d4d36bf496ffbe41ccb2ba9c967a3",
      "title": "South African women warned about viral Russian job videos",
      "url": "https://www.bbc.com/news/articles/c9qy2r19e75o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T16:36:02.000Z",
      "summary_90w": "",
      "raw": "A large number of young South Africans are jobless and attracted by social media offers of work abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b05952023b1bb6aa3657d60f566ef555e2de1c38",
      "title": "Kneecap cancel all US tour dates over clash with court hearing in London",
      "url": "https://www.theguardian.com/music/2025/aug/25/kneecap-us-tour-cancelled",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T16:29:18.000Z",
      "summary_90w": "",
      "raw": "Band member Liam Óg Ó hAnnaidh faces terrorism charge in UK for alleged display of Hezbollah flag mid-performance\nThe Irish hip-hop trio Kneecap have cancelled their scheduled US tour dates in October, citing the proximity to a court hearing in London involving band member Liam Óg Ó hAnnaidh’s alleged mid-performance display of a Hezbollah flag.\nÓ hAnnaidh, who performs under the stage name Mo Chara, was charged with a terrorism offence in the UK in May after being accused of displaying a flag in support of Hezbollah during a concert in London last November.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2feb109ebab05dc69c12430382294891800312f",
      "title": "Scotland is known for its rain. So why are experts worried about water supplies?",
      "url": "https://www.bbc.com/news/articles/c0qly7g9pepo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T16:20:01.000Z",
      "summary_90w": "",
      "raw": "Restrictions are being introduced on water use by businesses near two rivers where the levels are low.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ea045bcb1ce0673b8aad323bc88c785ee6eca65",
      "title": "Elon Musk&#8217;s xAI is suing OpenAI and Apple",
      "url": "https://www.theverge.com/news/765171/elon-musk-apple-openai-antitrust-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T16:15:50.000Z",
      "summary_90w": "",
      "raw": "Elon Musk is suing Apple and OpenAI over claims that their deal to build ChatGPT into the iPhone is stifling competition in the AI industry. In a lawsuit filed on Monday, the Musk-owned X Corp. and xAI also accuse Apple’s Apple Store of “deprioritizing” rival chatbots and “super” apps, including Grok and X.\nMusk’s companies claim that iPhone users “have no reason” to download third-party AI apps because the company “force[s]” users to use ChatGPT as their default chatbot app when enabling Apple Intelligence. “Apple and OpenAI have locked up markets to maintain their monopolies and prevent innovators like X and xAI from competing,” the companies allege.\nMusk threatened Apple with legal action earlier this month after accusing the company of rigging App Store rankings in favor of OpenAI. “Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation,” Musk said at the time.\nThe lawsuit adds that though the X and Grok apps have received high rankings, neither appears in the App Store’s “Must-Have Apps” section, where ChatGPT was allegedly the “only” AI chatbot in the section on August 24th, 2025.\nX and xAI also accuse Apple’s partnership with OpenAI of creating a “moat” that protects the AI giant due to “Apple’s monopoly in smartphones.” It notes that the iPhone’s ChatGPT integration gives OpenAI access to “potentially billions of user prompts originating from hundreds of millions of iPhones,” allegedly giving it an unfair advantage.\n“This latest filing is consistent with Mr Musk’s ongoing pattern of harassment,” OpenAI spokesperson Kayla Wood said in an emailed statement to The Verge. Apple told Bloomberg earlier this month that its store is “designed to be fair and free of bias” in response to Musk’s claims.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c63eec511161853b6d0e141f14ffa05cfab437b4",
      "title": "Kneecap cancel US tour dates amid court case",
      "url": "https://www.bbc.com/news/articles/c99m2zne0y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T16:12:37.000Z",
      "summary_90w": "",
      "raw": "The trio said they have cancelled all upcoming US tour dates because of the \"proximity of our next court hearing in London\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a3b3e9c2311ccba592539a6706409ed84a49b75c",
      "title": "This new delivery robot will bring the entire grocery store to you",
      "url": "https://www.theverge.com/news/765167/robomart-autonomous-food-delivery-locker-rm5",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T16:04:25.000Z",
      "summary_90w": "",
      "raw": "Robomart’s RM5 is a level-four autonomous delivery vehicle comprised of 10 individual lockers. | Image: Robomart\t\n\nA new company aims to take the idea of sidewalk delivery robots and supersize it. \nLos Angeles-based Robomart unveiled its new delivery robot Monday, with the goal of making “on‑demand delivery work economically.” The level-four autonomous vehicle is the size of a shuttle bus and can carry up to 500 lbs of payload. With no space for a human driver, the company’s RM5 vehicle is comprised of 10 individual lockers for customer orders, allowing it to make multiple deliveries on a single run.\n“Robomart exists to deliver autonomy in a way that finally makes on‑demand delivery work economically,” said Emad Suhail Rahim, co‑founder and chief strategy officer of Robomart, in a press release. “With RM5, retailers get a profitable channel for on-demand delivery and consumers get everyday essentials delivered at affordable prices. That’s the future we’re building—an autonomous Instacart that’s actually profitable.” \nLike Instacart or Uber Eats, the company aims to launch its own app where customers can browse options from a variety of retailers, restaurants, and grocery stores. And Robomarts says customers will only have to pay a flat delivery rate of $3 per order, promising “no markups, no service fees, no tips.”\nThe setup will result in “70 percent lower fulfillment costs than human couriers,” the company claims – thought it doesn’t explain how it arrives at that figure. Most food delivery services are not profitable, though companies like DoorDash and Uber Eats have made significant gains in revenue over the years. Robot delivery, in particular, faces a lot of hurdles, including initial costs in developing robotic hardware and AI software. \n“By carrying 50x more than sidewalk bots or drones, the RM5 platform enables us to serve many more customers per hour without the labor and capacity bottlenecks of legacy approaches,” Tigran Shahverdyan, co-founder and CTO of Robomart, said in the announcement.\nThe RM5 vehicle is relatively unique among autonomous vehicles today. Rather than opt for a small, for-wheeled robot that can carry one order and travel on the sidewalk, Robomart decided to go big. In addition to its multi-locker design, the vehicle is engineered to only travel at low speeds, with a maximum speed of 25 mph. The fully electric vehicle has a range of 112 miles and a curb weight of 2,205 lbs. There are a total of 10 climate-controlled lockers that can hold about 50 lbs each. \nAfter an order is placed, Robomart says it will dispatch its vehicle to the retailer for pickup, after which it can visit a number of other shops before heading out for deliveries. The RM5 vehicles are able to create a dynamic, multi stop route depending on the number of orders. Upon arrival, the customer uses the app to unlock their assigned locker and retrieve their order — much like with a sidewalk delivery robot. \nThe company has been trialing its service for a few years now. A video from four years ago shows them using Mercedes minivans to fulfill customer orders. Robomart says it “has partnered” with a number of retailers, including Ahold Delhaize, Unilever, Mars, Avery Dennison, and Yamaha Motors. The venture-backed company has received a modest amount of funding from Hustle Fund, Wasabi Ventures, W Ventures, Entrepreneur Ventures, Capital Factory, and HAX. According to TechCrunch, the company has raised less than $5 million since its founding in 2018. \nRobomart says it is looking to collaborate with local businesses ahead of its planned launch in Austin, Texas later this year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d34d8891d21cd39f51df77cd30f6929f4e438ac7",
      "title": "Trump told a major offshore wind project to stop construction just before it reached the finish line",
      "url": "https://www.theverge.com/news/765175/trump-offshore-wind-farm-revolution-orsted-halt",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T15:45:45.000Z",
      "summary_90w": "",
      "raw": "Attendees during a media tour of the Revolution Wind construction hub at the Port of Providence in Providence, Rhode Island, on Thursday, June 13th, 2024. | Photo: Getty Images\t\n\nThe Revolution Wind farm was already 80 percent complete before the US Bureau of Ocean Energy Management sent it a letter Friday to “halt all ongoing activities” to address purported national security concerns and “interference” with other potential uses for the area.  \nThe move comes as data centers, domestic manufacturing, and electric vehicles are raising electricity demand, putting more pressure on power grids across the US. Nevertheless, President Donald Trump has waged his war against wind farms, attempting to eliminate competition to the fossil fuel industry that backed Trump’s campaign. \nThe Trump administration similarly paused construction of the Empire Wind farm off the coast of New York state earlier this year, which reportedly cost its developers $50 million a week before it was allowed to start work again. \nRevolution Wind is supposed to provide enough electricity for more than 350,000 homes in Rhode Island and Connecticut after coming online next year. It has already received federal and state permits to operate. Ørsted, one of the project’s developers, says it’s evaluating its legal options.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "406ec736827d333cc9d2d7eb34fa8b18eac8c779",
      "title": "The new Fi Mini pet tracker has GPS, and it&#8217;s barely bigger than an AirTag",
      "url": "https://www.theverge.com/news/765132/fi-mini-gps-pet-lost-dog-cat-location-tracking",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T15:13:14.000Z",
      "summary_90w": "",
      "raw": "Fi, the pet tech company known for its smart dog collar, has launched a clip-on GPS tracker that it says is the perfect size for your feline friend or small dog. The Fi Mini weighs just 0.56 ounces (16 grams), allowing you to keep tabs on your pet with real-time escape alerts and live tracking from the accompanying app.\nAs with its smart collar, the Fi Mini is also available as a subscription, but it’s a bit cheaper at $129 per year. You can attach the Fi Mini to any collar or harness that’s 3/8 to 1 inch wide, and Fi says it’s suitable for “dogs and cats of any size.” At 42mm long and 30mm wide, the Fi Mini is slightly larger than an Apple AirTag. The Fi Mini is still lighter than the Cat Mini tracker offered by Tractive, which recently acquired Whistle and is shutting down its tracking platform.\nOnce you clip the Fi Mini onto your dog’s or cat’s collar, you can expect up to three weeks of battery life (or up to three months with the Fi base, which helps reduce power consumption) and support for USB-C charging. Like the Series 3 Plus smart collar, the Fi Mini has an IP68 rating, making it dust-tight and protected against submersion in water. The compact tracker uses Verizon’s LTE-M cellular network to share your pet’s location and track their walking history.\nThe Fi Mini also offers the same activity and sleep tracking capabilities as the smart collar, with additional features, including AI-powered behavior detection to alert you of barking, scratching, eating, drinking, and licking, this fall. Fi also plans on rolling out an Apple Watch integration, bringing it in line with its Series 3 Plus counterpart. \nThe Fi Mini is available to purchase now and will begin shipping on September 1st.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d5ba2bcbb0981c9f61e5d2acc2becb505f4a1ef",
      "title": "Silicon Valley is pouring millions into pro-AI PACs to sway midterms",
      "url": "https://techcrunch.com/2025/08/25/silicon-valley-is-pouring-millions-into-pro-ai-pacs-to-sway-midterms/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T15:11:43.000Z",
      "summary_90w": "",
      "raw": "The new pro-AI super-PAC network dubbed Leading the Future aims to use campaign donations and digital ads to advocate for favorable AI regulation and oppose candidates that the group thinks will stifle the industry.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c384263408a1adffbc4e7bc18f71c5df4cb6bcb",
      "title": "Robomart unveils new delivery robot with $3 flat fee to challenge DoorDash, Uber Eats",
      "url": "https://techcrunch.com/2025/08/25/robomart-unveils-new-delivery-robot-with-3-flat-fee-to-challenge-doordash-uber-eats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Robomart's RM5 autonomous delivery robot can carry up to 50 pounds and deliver multiple customer orders at once.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "592a3d35178184b020520ce535c24f06d700c967",
      "title": "Volunteer opportunities still open for TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/25/want-to-attend-techcrunch-disrupt-2025-for-free-volunteer-but-the-clocks-ticking/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Whether you want to launch your own startup, build your event chops, or get inspired by real traction stories, volunteering at TechCrunch Disrupt 2025 is your backstage pass to see how a world-class tech conference comes to life. Apply before September 30.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bac805cbe62083c90db2b7c5859b88650b7bd69",
      "title": "First human case of flesh-eating screwworm parasite confirmed in US",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/new-world-screwworm-flesh-eating-parasite-case-us",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T14:32:35.000Z",
      "summary_90w": "",
      "raw": "HHS told Reuters patient had returned from El Salvador but beef industry said person had traveled from Guatemala\nThe US Department of Health and Human Services (HHS) on Sunday reported the first human case in the US of travel-associated New World screwworm, a flesh-eating parasite, from an outbreak-affected country.\nThe case, investigated by the Maryland department of health and the US Centers for Disease Control and Prevention (CDC), was confirmed by the CDC as New World screwworm on 4 August – and involved a patient who returned from travel to El Salvador, an HHS spokesperson, Andrew G Nixon, said in an email to Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eba47cd086459ef674fa3aeb30aec05503c77cf",
      "title": "Here’s where you can buy microSD Express cards for the Switch 2",
      "url": "https://www.theverge.com/tech/676075/switch-2-microsd-express-cards-where-to-buy",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T14:30:02.000Z",
      "summary_90w": "",
      "raw": "Don’t buy one unless you can see the “EX” label on the card and package. | Image: Cameron Faulkner / The Verge\t\n\nThe Nintendo Switch 2 was tough to find in stock during its first two months on shelves, but that’s no longer the case. If you own one, or are considering buying one soon, you understandably may want a microSD card to store more games than the console’s 256GB storage can fit. And, you may already know that only microSD Express cards will work on the Switch 2 for storing and playing games. The card you used in your original Switch or Switch Lite will only offer very limited functionality in a Switch 2, letting you view screenshots or video clips you captured previously — that’s it.\nThe significantly faster microSD Express card boasts an advertised 4.4x improvement in terms of transfer speeds over the microSD cards you might already have lying around. That improvement is signified by a small, easy-to-miss “EX” emblem etched onto the front of the card.\nNot only is the Switch 2 easy to find in stock these days, microSD Express cards are, too. However, Express cards aren’t cheap, with some costing more than $50 for just 256GB of storage. The Switch 2 supports microSD Express cards up to 2TB in size, although 1TB is the largest capacity available, with some cards selling for up to $200 a pop. Walmart’s Onn model is a beacon of light, as its 512GB model costing $65.88 — when it’s in stock.\nIf you’re in the market for one of these storage expansion cards, we’ve listed the available options below.\nSamsung microSD Express Card (256GB)\n\nWhere to Buy:\n\n $59.99 at Amazon (256GB)\n $59.99 at Best Buy (256GB)\n $59 at Walmart (256GB)\n\nPNY microSD Express card\n\nWhere to Buy:\n\n $58.99 $53.45 at Amazon (256GB)\n $58.99 $57.99 at B&H Photo (256GB)\n $58.99 at PNY (256GB)\n\nonn microSD Express card\n\nWhere to Buy:\n\n $35.88 at Walmart (256GB)\n $65.88 at Walmart (512GB)\n\nSandisk microSD Express card\n\nWhere to Buy:\n\n $53.99 at Amazon (128GB)\n $71.99 at Amazon (256GB)\n $119.99 at Amazon (512GB)\n\nGameStop microSD Express card\n\nWhere to Buy:\n\n $54.99 at GameStop (256GB)\n\nLexar microSD Express card\n\nWhere to Buy:\n\n $56 at Amazon (256GB)\n $119.99 at Amazon (512GB)\n $219.99 at Adorama (1TB)\n\nUpdate, August 25th: Updated prices, and tweaked copy to indicate that both the Switch 2 and many microSD Express card models are easier to find in stock.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "264413356188e5262c7ee5b3e225a2e06cf7bb6d",
      "title": "Yottar wants to help energy users find capacity on the electrical grid",
      "url": "https://techcrunch.com/2025/08/25/yottar-wants-to-help-energy-users-find-capacity-on-the-electrical-grid/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T14:27:08.000Z",
      "summary_90w": "",
      "raw": "The startup maps utility assets and collects data on electricity demand, which helps customers find locations ripe for upgrades or new equipment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a80fad7240ad0f5432f9fc0ba0c880943c06e35f",
      "title": "Apple might opt for a curved glass design for 20th anniversary iPhone",
      "url": "https://techcrunch.com/2025/08/25/apple-might-opt-for-a-curved-glassed-design-for-20th-anniversary-iphone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T14:18:39.000Z",
      "summary_90w": "",
      "raw": "Apple is likely to debut a new curved glass design for the 20th anniversary iPhone in 2027.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a54cf198a490aa3d6eb1663a671a41cef7de9a31",
      "title": "South Korean President Lee to meet with Trump in Washington on Monday",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5508133/south-korean-president-lee-to-meet-with-trump-in-washington-on-monday",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T09:00:44.000Z",
      "summary_90w": "",
      "raw": "At a summit meeting in Washington, D.C., on Monday, the U.S. and South Korean presidents will discuss modernizing their 71-year-old alliance and fleshing out a trade deal reached last month.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7047b6c83f93a9458f99065ea6163b881713531f",
      "title": "'Half alive': Toxic mushroom lunch survivor tells court of murders' impact",
      "url": "https://www.bbc.com/news/articles/cp8zr04wzz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T07:21:36.000Z",
      "summary_90w": "",
      "raw": "Family members of the three people Erin Patterson murdered with toxic mushrooms have confronted her in court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33638615ee5a7d640d1b8731c6fb89766c9aa401",
      "title": "Jerry Adler, who starred in The Sopranos, dies aged 96",
      "url": "https://www.bbc.com/news/articles/c36jyp6w32go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T02:46:58.000Z",
      "summary_90w": "",
      "raw": "Adler started acting in his early 60s, after some 30 years working behind the scenes on Broadway.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da15ba58ea49119d72bffaf4e120d89ad747e6fe",
      "title": "Chinese property giant Evergrande delisted after spectacular fall",
      "url": "https://www.bbc.com/news/articles/c14g7r44566o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T01:03:35.000Z",
      "summary_90w": "",
      "raw": "The embattled property giant's shares were taken off the Hong Kong stock market on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a4d86aea6b0adb621b5b2441704f7fa4cbb94f5",
      "title": "France summons US envoy over antisemitism claims ",
      "url": "https://www.bbc.com/news/articles/cq58102wz47o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T00:13:00.000Z",
      "summary_90w": "",
      "raw": "France denies allegations it is failing to tackle a surge in antisemitism since the Gaza war began.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c8f11f200dd9a6776f7bb052cc7a9c1bff36c88",
      "title": "A cut-off finger ended her comfortable family life. Now she's hiding from US officials",
      "url": "https://www.bbc.com/news/articles/cvg4kd385e4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T23:00:35.000Z",
      "summary_90w": "",
      "raw": "Donald Trump declared some cartels to be terrorist organisations. So why are the victims of cartels in hiding?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17c1d0cb397b63a8a58faea6a92907e9bdf892ba",
      "title": "Pintarnya raises $16.7M to power jobs and financial services in Indonesia",
      "url": "https://techcrunch.com/2025/08/24/pintarnya-raises-16-7m-to-power-jobs-and-financial-services-in-indonesia/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T22:00:00.000Z",
      "summary_90w": "",
      "raw": "The Indonesian startup, now backed by $16.7M in Series A funding, helps workers find full-time and side gigs while offering financial solutions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f51708a44d29bd0ba7d00bb5c5c0937611cac5a",
      "title": "Trump threatens to deploy troops to Baltimore to 'clean up' crime",
      "url": "https://www.bbc.com/news/articles/c78mymx7mpko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T21:58:09.000Z",
      "summary_90w": "",
      "raw": "The deployment of military for domestic law enforcement has drawn backlash from Democrats, with one governor calling it an \"abuse of power\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8bd5dece6874316ca38670fb1c3d739c9b851183",
      "title": "Inside Donetsk as residents flee attacks on Ukrainian region Putin wants to control",
      "url": "https://www.bbc.com/news/articles/c209yn1ygz6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T21:04:11.000Z",
      "summary_90w": "",
      "raw": "Quentin Sommerville follows volunteers carrying out evacuations in eastern Ukraine as drone attacks rage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df58e36bbb17334ac3d8e0b65363293e390ac5c4",
      "title": "Bluesky blocks service in Mississippi over age assurance law",
      "url": "https://techcrunch.com/2025/08/24/bluesky-blocks-service-in-mississippi-over-age-assurance-law/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T20:40:32.000Z",
      "summary_90w": "",
      "raw": "In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30cb66f8a022f5217cd90c0abd0f50b5669c52d8",
      "title": "‘No place is safe’: families flee Gaza City as Israel vows to press on with offensive",
      "url": "https://www.theguardian.com/world/2025/aug/24/families-flee-gaza-city-as-israel-vows-to-press-on-with-offensive",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T20:34:21.000Z",
      "summary_90w": "",
      "raw": "Others refuse to leave as aircraft and tanks bomb outskirts of city where about half of Gaza’s 2m people now live\nIsraeli aircraft and tanks have pounded the eastern and northern outskirts of Gaza City, destroying buildings and homes, as Israeli leaders vowed to press on with an expanded large-scale offensive on the city.\nWitnesses reported the sound of continuous explosions overnight from Saturday night into Sunday morning in the areas of Zeitoun and Shejaia. Meanwhile, tanks shelled houses and roads in the nearby Sabra neighbourhood and several buildings were blown up in the northern area of Jabaliya.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d1090963af2e1786e42f7adc3aa5dcf0215da30",
      "title": "Israeli strikes hit Yemen’s capital in retaliation for earlier Houthi attacks",
      "url": "https://www.theguardian.com/world/2025/aug/24/israeli-strikes-hit-yemen-capital-in-retaliation-for-earlier-missile-attacks",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T20:33:51.000Z",
      "summary_90w": "",
      "raw": "Health officials report dozens of casualties in Sana’a, including six deaths\nIsraeli strikes have hit the Yemeni capital, Sana’a, in retaliation for Houthi missiles fired towards Israel, with Houthi health officials saying the attack had killed six people.\nThe strikes on Sunday were the latest in more than a year of direct attacks and counterstrikes between Israel and Houthi militants in Yemen, part of a spillover from the war in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75f29ceb46f81178add54873b91287f1000f7617",
      "title": "Former Meta exec Nick Clegg offers careful criticism of ‘cloyingly conformist’ Silicon Valley",
      "url": "https://techcrunch.com/2025/08/24/former-meta-exec-nick-clegg-offers-careful-criticism-of-cloyingly-conformist-silicon-valley/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T20:32:56.000Z",
      "summary_90w": "",
      "raw": "Meta’s former policy chief Nick Clegg seems to be walking a tightrope as he promotes his upcoming book, “How to Save the Internet.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc0f3de2121be64e6162b8b1456ff89c521803e7",
      "title": "Israel hits Yemen's Houthis after reports group used cluster bomb",
      "url": "https://www.bbc.com/news/articles/c0kzy7r8pl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T20:07:58.000Z",
      "summary_90w": "",
      "raw": "The strikes come after Israel said the Houthis used cluster munitions in a missile fired at Israel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bdf8a958b9e9af38a8b042d4d2740d4074138e76",
      "title": "Netflix’s ‘KPop Demon Hunters’ is probably the biggest movie in theaters",
      "url": "https://techcrunch.com/2025/08/24/netflixs-kpop-demon-hunters-is-probably-the-biggest-movie-in-theaters/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T19:59:29.000Z",
      "summary_90w": "",
      "raw": "This is Netflix's first time winning the domestic box office.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c2c0499d96f79fbac33436146400c56e194d041",
      "title": "Zelensky vows to continue fighting as Ukraine marks independence day",
      "url": "https://www.bbc.com/news/articles/czxy2v9dzgxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T18:42:54.000Z",
      "summary_90w": "",
      "raw": "Russia said power and energy facilities had been targeted by Ukraine, which accused Russia of \"spreading manipulations\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5910a0246075b9f5e5c884cb781d0d0f8a528486",
      "title": "UK's Chagos Islands deal 'significant victory', says Pope",
      "url": "https://www.bbc.com/news/articles/cx2p1k1r2glo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T17:56:10.000Z",
      "summary_90w": "",
      "raw": "Pope Leo XIV said he hoped Mauritian authorities would ensure the refugees are able to return home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a255297527200c2500343b1f49d7ceb503d6bc0",
      "title": "More than 30 jihadists killed in air strikes, Nigerian military says",
      "url": "https://www.bbc.com/news/articles/cq58123z814o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:38:15.000Z",
      "summary_90w": "",
      "raw": "Concern is mounting about \"war-time levels of slaughter\" in Nigeria, including a resurgence of jihadist activity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "915159ad7a01a9d27496a3e64d3ddc11bc2fb0fe",
      "title": "More than 500,000 ordered to evacuate as typhoon heads for Vietnam",
      "url": "https://www.bbc.com/news/articles/cx2pw5ypwqeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:34:38.000Z",
      "summary_90w": "",
      "raw": "Typhoon Kajiki is brushing past Hainan in China before heading for Vietnam, forecasters say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "375e731d410021cae7f576bcb0656c8fab38d147",
      "title": "Three sisters drown in migrant boat in Mediterranean, rescuers say",
      "url": "https://www.bbc.com/news/articles/cp89rqgjq1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:26:21.000Z",
      "summary_90w": "",
      "raw": "There was \"sheer horror\" when survivors realised that the girls aged nine, 11 and 17 had died, a rescuer says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8b96070861800207cfbc7f605b3e993a93b59a2",
      "title": "Canada's retaliatory tariffs have left the U.S. wine industry reeling",
      "url": "https://www.npr.org/2025/08/24/nx-s1-5502688/canadas-retaliatory-tariffs-have-left-the-u-s-wine-industry-reeling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-24T12:51:55.000Z",
      "summary_90w": "",
      "raw": "NPR's Ayesha Rascoe talks to Joan Kautz of Ironstone Vineyards, a winery in California, about the impact of Canadian tariffs on the U.S. alcohol industry.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ccf43e57e6760a9a854e93fad8d0c5364d8d4493",
      "title": "Israel pounds Gaza City in preparation for planned offensive",
      "url": "https://www.bbc.com/news/articles/cvg478y8l09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T12:18:44.000Z",
      "summary_90w": "",
      "raw": "Sixty-four people were killed in Israeli attacks across Gaza in the past 24 hours, the territory's Hamas-run health ministry said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485fe0041f0b8a9016a6932f304d00b93508ea5a",
      "title": "Declaration of famine in Gaza lays bare Israel’s disregard for humanitarian duty",
      "url": "https://www.theguardian.com/world/2025/aug/24/gaza-famine-declaration-israel-humanitarian-duty-analysis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T09:00:27.000Z",
      "summary_90w": "",
      "raw": "The IPC’s findings that a quarter of Palestinians in Gaza are starving should mark an urgent turning point in this war\nThe declaration on Friday of widespread famine in Gaza by the Integrated Food Security Phase Classification (IPC) should mark a turning point in the war. The IPC, which represents a fastidious survey of available data, is regarded as the international gold standard in nutritional crises.\nLong-criticised by humanitarians in other emergencies for its overabundance of caution, the IPC’s declaration of Level 5 – “catastrophic” hunger – in Gaza is a significant moment. Famine, under the IPC’s exacting criteria, requires three critical thresholds to be passed: extreme food deprivation, acute malnutrition and starvation-related deaths, all of which are now visible in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5795c618e230224998fd210f35a94a572ac3085",
      "title": "Taiwan referendum on reopening last nuclear plant fails",
      "url": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T05:17:03.000Z",
      "summary_90w": "",
      "raw": "Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe\nA referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved.\nThe plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ced74bc046c44a55cb8bc5d3898f2cddeb8562ba",
      "title": "North Korean leader oversees new missile test, state media says",
      "url": "https://www.bbc.com/news/articles/cj3lp47nxdjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T23:51:33.000Z",
      "summary_90w": "",
      "raw": "Two new air defence missiles with \"superior combat capability\" have been fired in a test observed by Kim Jong Un.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a06a17b45576aba1d545f922a7ee74b9bc40633",
      "title": "Boxed in by shifting tariff rules, European shippers pause some U.S.-bound parcels",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513936/dhl-parcel-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-23T22:21:20.000Z",
      "summary_90w": "",
      "raw": "New customs regulations take effect August 29, and many European postal agencies and companies say until new systems are set up they can't ship some goods. Gifts worth less than $100 are not affected.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b9920e3d1c6a4ec77905356ceff0d85fb4bdac1",
      "title": "Turkish first lady appeals to Melania Trump over Gaza children",
      "url": "https://www.bbc.com/news/articles/cn47ppy382wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T21:13:56.000Z",
      "summary_90w": "",
      "raw": "In a letter, Turkey's first lady asks Mrs Trump to appeal to Israel to end the war in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efbfe2e90e6af4b69dccfad4a51002d5ac218782",
      "title": "Ghislaine Maxwell denies seeing 'inappropriate' conduct by Trump",
      "url": "https://www.bbc.com/news/articles/cdd3pe6189go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T20:24:11.000Z",
      "summary_90w": "",
      "raw": "Maxwell was interviewed after pressure on Trump to release information about whether prominent figures were involved in Jeffrey Epstein's crimes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8e6575dd0308f9f931cf4375d96a87e4d375f2b",
      "title": "Pentagon fires intelligence agency chief after Iran attack assessment",
      "url": "https://www.bbc.com/news/articles/c2dj217z2w6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T16:24:47.000Z",
      "summary_90w": "",
      "raw": "The firing comes just weeks after a White House rebuke of a leaked intelligence report assessing the impact of US strikes on Iran.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf9b5982589166623a19906f5fb5dd66ad1ac94c",
      "title": "Trump administration halts work on an almost-finished wind farm",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513919/trump-stops-offshore-wind-renewable-energy",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-23T15:38:19.000Z",
      "summary_90w": "",
      "raw": "The Revolution Wind farm was slated to start sending power to homes and businesses in Rhode Island and Connecticut starting next year.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b8b1b4859f7ef18fa8de8df0b2a07aca08701eb0",
      "title": "The EV tax credit ends soon — but there's a little bit of wiggle room for car buyers",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511244/ev-tax-credit-deadline-irs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T19:12:24.000Z",
      "summary_90w": "",
      "raw": "A federal EV tax credit worth up to $7,500 ends Sept. 30. But the IRS has just clarified that shoppers don't need to actually have the keys in hand by the deadline to get the credit.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4e85a38f37708c91cd8de79467d795f433ad1bb1",
      "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump",
      "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:02:17.000Z",
      "summary_90w": "",
      "raw": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain\nCanada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States.\nFrom 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "229e5ba5d2982b5f1832044ba1d34d963fb76fa9",
      "title": "Thousands face deportation to danger as Trump targets temporary protections",
      "url": "https://www.theguardian.com/us-news/2025/aug/22/temporary-protected-status-tps-immigration-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:00:34.000Z",
      "summary_90w": "",
      "raw": "People with temporary protected status face possible deportation even though their home countries – including Afghanistan and Haiti – remain unsafe\nMany thousands of immigrants living in the US who came from certain countries regarded as risky or dangerous are at the mercy of US judges and the Trump administration’s agenda to slash their work authorization and protection from deportation.\nSince taking office, the Trump administration has announced the termination of temporary protected status (TPS) for citizens of seven of the 15 countries previously designated for shelter under this legal umbrella – with the Department of Homeland Security (DHS) controversially citing improved conditions in some of those places.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7571ab87fd83998490d50825567d17e7746dbe56",
      "title": "Bolsonaro given 48 hours to explain alleged plans to flee to Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/21/bolsonaro-given-48-hours-to-explain-alleged-plans-to-flee-to-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T14:16:57.000Z",
      "summary_90w": "",
      "raw": "Brazilian supreme court judge sets ultimatum after police claim far-right populist sought to flee to avoid punishment over failed coup\nA supreme court judge has given Brazil’s ex-president, Jair Bolsonaro, 48 hours to explain police claims he was planning to flee to Argentina to avoid punishment for allegedly masterminding a failed coup after losing the 2022 election.\nBolsonaro’s trial for the alleged attempt to seize power is scheduled to conclude early next month. The far-right populist faces more than four decades in prison if found guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b2c5d6d0908d4a6f91069746af4fa65f34b8ddc",
      "title": "South African minister investigated for historical racial slurs on social media",
      "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:15:35.000Z",
      "summary_90w": "",
      "raw": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts \nSouth Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid.\nMcKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts, which were still online at the time of publication.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca9dc3e79708726084045a1b585cddef480086c2",
      "title": "Uganda denies reports that it has struck deal with Trump to take in US deportees",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/uganda-trump-deal-immigration",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T13:01:24.000Z",
      "summary_90w": "",
      "raw": "Ugandan official said the east African country does not have the capability to take in undocumented immigrants\nUganda said it has not reached any agreement with the US to take in undocumented immigrants, contradicting reports that the east African country had struck a deal with the Trump administration to do so.\nHenry Oryem Okello, Uganda’s state minister for foreign affairs, told Reuters the country does not have the capability to take in immigrants. It comes as the US has deported migrants convicted of crimes in the US to non-native countries including South Sudan and Eswatini.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}