{
  "version": "1754923530829",
  "generatedAt": "2025-08-11T14:45:30.829Z",
  "items": [
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Chip giants Nvidia and AMD to pay 15% of sales revenue in China to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T14:40:53.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T14:40:53.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2b36528f992cc0ea310158a1c5b312be26bf2bef",
      "title": "Ford throws out Henry Ford’s assembly line to make low-cost EVs in America",
      "url": "https://techcrunch.com/2025/08/11/ford-throws-out-henry-fords-assembly-line-to-make-low-cost-evs-in-america/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T14:31:06.000Z",
      "summary_90w": "",
      "raw": "The automaker is investing $2 billion into the Louisville Assembly Plant with a $30,000 EV pickup slated for 2027.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3f310ff72a35523213db7a7d46e69579da1cb17",
      "title": "Ford reveals breakthrough process for lower priced EVs",
      "url": "https://www.theverge.com/ford-motor-company/757243/ford-ev-truck-breakthrough-model-t",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Ford says its finally cracked the code on cheap EVs. \nThe automaker announced plans to build “a family” of low-cost electric vehicles at its Kentucky assembly planrt, starting with a four-door, midsized $30,000 pickup truck in 2027. Ford touted the announcement as its “Model T moment” that will be more streamlined to help bring down costs and put the company on a path to profitability. And it comes at an inflection point for the iconic American automaker, with the company expected to lose over $5 billion on EVs and software this year alone.  \nThe platforms will be scalable and adaptive to a variety of vehicle types, including trucks, vans, and SUVs. The new EVs will be software-defined, meaning they will have operating systems that can improve over time through over-the-air updates. The batteries will have lithium iron phosphate (LFP) chemistries that are more durable, faster charging, and more affordable than its current lineup of EVs. And the manufacturing process will transform from a single assembly line, popularized over 120 years ago with the Model T, into an “assembly tree” with multiple lines starting simultaneously before joining together. \nThe new vehicle platform and manufacturing process are the product of Ford’s three-year-old Silicon Valley-based “skunkworks” project that the company empowered to create throw out all the old processes and create something new from scratch.\n“This is a bold and difficult undertaking to compete with the best in the world,” Doug Field, Ford’s chief EV, digital and design officer, said in a briefing with reporters on Monday. “We started with a blank sheet to fight complexity and do something truly new.”\n‘Universal’ platform\nThe company didn’t reveal a new vehicle today — although a prototype of the next-gen truck exists and was recently shared with a select group of factory workers. In a video, workers described the new vehicle as “revolutionary.”\nBut the company did describe in detail the process that it will use to create the new modular platform. The new “universal” vehicle platform uses 20 percent fewer parts than a typical vehicle, with 25 percent fewer fasteners and 40 percent fewer workstations dock-to-dock in the plant. That results in a fast assembly time of about 15 percent as compared to traditional vehicle manufacturing. And when all’s said and done, Ford estimates that its new low-cost EVs will have a lower cost of ownership over five years as compared to a three-year-old Tesla Model Y. \nThe new platform will also be less complex, Ford says. The new midsized truck, for example, will have a much simpler network of wires, cables, and connectors that distribute electrical power and signals throughout the vehicle, with the company estimating a wiring harness that’s 4,000 feet (1.3 kilometers) shorter and 10 less kilograms lighter than Ford’s first-gen Mustang Mach-E. \nFord also aims to slash its battery costs by adopting cheaper LFP batteries that eschew cobalt and nickel, two minerals that are among the most expensive to acquire. The price of LFP cells is over 20 percent lower than nickel cobalt manganese (NCM) cells, according to S&P Global. The average price of an LFP cell was just under $60-per-kWh in 2024, versus $100-per-kWh for NCM cells.\nThe new cells will be prismatic, packed flat in rigid cases and are generally thought to be less complex to manufacture than cylindrical cells. Ford says the battery will be a “structural sub-assembly” that also serves as the vehicle’s floor, creating a low center of gravity with improved handling and increased interior space. \nHow much more space? Ford says that the new midsized truck will have more passenger room than the new Toyota RAV4 — even before you include the frunk and truck bed. (The 2025 RAV4 has about 98.9 cubic feet of passenger space, enough for five people.) And the bed is large enough to fit a surfboard “and other gear” without the need of a roof rack or a trailer hitch. (That should go a long way toward improving aero and range.) \nBut all that cost saving and space maximizing won’t make for a boring vehicle, Ford promises. The new EVs will be “fun to drive,” with a 0-60 mph acceleration time of approximately 4.5 seconds, comparable to the four-cylinder Mustang EcoBoost. Still, that’s slower than the 3.3 seconds it takes the Mustang Mach-E GT to accelerate from 0-60mph.  \nFord’s executives wouldn’t comment on the estimated range for the midsized truck, nor what other vehicle types would be a good fit. The new platform will have a 400-volt architecture, which is less than what’s currently offered by Hyundai and Kia EVs. \n‘Assembly tree’\nFarley’s reference to a “Model T moment” also applies to the revolutionary way in which that original vehicle was manufactured. Ford says that it has taken the traditional, linear assembly line and transformed it into an “assembly tree.” Instead of one long conveyor, three sub-assemblies run down their own lines simultaneously before joining together at the end, the company says. Using this method, a large single-piece aluminum unicasting can replace dozens of smaller parts, enabling the front and rear of the vehicle to be assembled separately. \nFord says its next-gen vehicles will come in three parts: the front, the rear, and the middle, which is essentially a structural tray for the battery. And while other automakers have been known to use large-scale castings, including Tesla’s gigacasting process, Ford insists that its approach will be unique. \n“So it really goes way beyond a typical modular architecture that existing manufacturers have out there,” Field said. \nFord also aims to improve the ergonomics of its workers, with a process that involves less twisting, reaching and bending. That includes the use of more robots and automation — though Ford declined to compare it to its current manufacturing process. \n“This is a dramatic step function reduction,” said Ford’s chief operating officer Kumar Galhotra. “Now, some of that will be automation, but a lot of it is just built into how the vehicle is designed.”\nFord says it will invest $2 billion in new money in its Louisville, Kentucky assembly plant, where it will assemble the new midsized truck. That’s part of a broader $5 billion investment to create or secure 4,000 jobs, including at its BlueOval Battery Park in Michigan. \nThe process will require fewer workstations — and fewer workers. Ford says that right now it has 2,800 hourly workers in Louisville, along with 200 salaried employees. The universal EV platform project will only require 2,200 hourly workers — or 600 fewer workers than the present levels. Some workers may transfer to other, nearby facilities, while others may accept buyout offers. Ford says it does not anticipate any layoffs as result of this project. \nFord’s skunkworks\nThe next-gen “universal” EV platform is the product of Ford’s Silicon Valley-based skunkworks team helmed by Alan Clarke, executive director of advanced EV production and a 12-year veteran of Tesla. The team is based in Irvine, California, and is comprised of engineers from Auto Motive Power, or AMP, an energy management startup acquired by Ford last year. AMP founder Anil Paryani holds the title of executive director of engineering at Ford and overlapped with Clarke at Tesla for several years.\nClarke said that the new manufacturing process will give factory workers everything they need in the form of a “kit” that arrives to their workstations. He predicted that this will be “profound” change in the line-side storage and production layout behind each worker that will result in 84 percent less reaching over the fender and 63 percent less sitting in the vehicle installing parts. \n“Ultimately, this is a revolution in how we build our products, driven by and for our incredible team,” Clarke added.\nThe concept of a cheaper EV is crucial to Ford’s future. The company is expected to lose up to $5.5 billion on its electric vehicle and software operations this year, similar to last year and a sign of the severe difficulties in cutting costs on battery-powered models. \nFord has scaled back some of its EV plans as demand for the company’s plug-in vehicles has slowed and some dealers have balked at the costly infrastructure improvements necessary to sell them. The company said in 2023 that it would delay $12 billion in investments. And earlier this month, Automotive News reported that Ford has again delayed its plans for a full-sized, electric truck, that is meant to be a follow-up to the F-150 Lighting, until 2028. It also pushed back its plan for a next-gen electric van. Ford needs to start making money on its models if it wants to compete, not only with Tesla and GM, but also Chinese automakers like BYD. \nPresident Donald Trump’s recent actions haven’t helped the EV industry, either, as the administration plans to roll back EV tax credits this September. Trump’s tariffs have also hit automakers hard, with Ford saying it expects the duties to shave $2 billion off its annual earnings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a163d62f4f5569e816eafae2f6f906bdd7b014a",
      "title": "Russia cannot challenge borders ‘with impunity’, warns Tusk ahead of Trump-Putin summit - Europe live",
      "url": "https://www.theguardian.com/world/live/2025/aug/11/ukraine-russia-trump-putin-summit-zelenskyy-europe-live-news-update",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:24:59.000Z",
      "summary_90w": "",
      "raw": "Concerns are growing over Ukraine being shut out of Friday’s Alaska meeting\nOn France, AP noted that the red alert has been issued only eight times since it was created in 2004 after a deadly summer the year before.\nIt is reserved for extreme, prolonged heat with major health risks and the potential to disrupt daily life.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6851b8fb0ebe0663ab3c156875f072b49783a527",
      "title": "Mourners gather amid outrage over Israeli troops’ killing of journalists in Gaza – live updates",
      "url": "https://www.theguardian.com/world/live/2025/aug/11/israel-gaza-war-anas-al-sharif-al-jazeera-benjamin-netanyahu-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:21:12.000Z",
      "summary_90w": "",
      "raw": "UN condemns killing of Anas al-Sharif and colleagues, calling it a ‘grave breach of international humanitarian law’\nAnas al-Sharif among five journalists killed in Israeli airstrike\nReporters Without Borders has condemned the “acknowledged murder by the Israeli army” of Al Jazeera correspondent Anas al-Sharif in Gaza, who the armed forces admitted they had targeted, along with several of his colleagues.\nThe press freedom campaign group told news agency AFP it “strongly and angrily condemns the acknowledged murder by the Israeli army” of al-Sharif and other journalists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "586d51d067e1af362dd6f81931a2c63aa2298b89",
      "title": "UK's biggest toy shop chain The Entertainer handed to staff",
      "url": "https://www.bbc.com/news/articles/cgm2jjwmw9jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T14:14:42.000Z",
      "summary_90w": "",
      "raw": "The toy retailer's 1,900 workers will get a share of profits and a say in how the business is run.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "357ebb3f8dfe5c9740ae02965f6190f7bfbf432b",
      "title": "This collaborative doodling website is like Google Maps plus MS Paint",
      "url": "https://www.theverge.com/news/757364/wplace-pixel-art-website-r-place-inspired",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T14:14:40.000Z",
      "summary_90w": "",
      "raw": "The screenshot shows the pixel art painted over Maceió, Brazil.\t\n\nA new website that lets you paint over a world map with other users in real-time has taken the digital illustration community by storm. \nWplace is a collaborative pixel art platform that serves as a spiritual successor to Reddit’s r/Place April Fools’ Day experiments, placing time restrictions on drawing tools that motivate users to team up to complete large or complex paintings. While r/Place provided its users with a blank white pixel grid, Wplace is layered over an interactive canvas of a world map made up of four trillion pixels, according to the website’s launch trailer, making it feel like a mashup between Microsoft Paint and Google Maps. \nWplace also appears to be a permanent experience, unlike r/Place, which Reddit has only made available for a few days every time it revives the experiment. That said, it appears to be straining under the weight of its explosive popularity, limiting its availability.\nThe painting aspect of Wplace is made intentionally challenging — new users have a limited pool of 30 pixels that they can place, and regain one spent pixel every 30 seconds. Though the maximum pool size expands the more you draw, the recharge time remains the same. Those limitations mean that Wplace users either have to work extremely slowly and hope that nobody paints over their progress, or collaborate on large projects with help from other users.\n\n\n  \n \n  \n \n\n\n \n\n View this post on Instagram\n\n \n \n \n \n\n \n \n\n \n \n \n\n \n \n \n\nA post shared by Wplace (@wplace.live)\n\n\n\nThat makes some of the expansive paintings that have been shared across social media all the more impressive. Gaming and fandom-related content seem especially popular: fans of the NBC TV series Hannibal have littered images and quotes all over Florence, Italy, which is the setting for some of season 3, while Las Vegas, USA, is covered in homages to the Fallout games. Wplace itself has some gamified aspects too, such as leaderboards that track which countries are painted with the most pixels and which country has the most users who are contributing to the global canvas.\nThe website has attracted more than a million users since Friday. Some functions are currently offline at the time of reporting; however, with Wplace saying that it’s “experiencing technical problems.” Existing users can add to the canvas, but new users are unable to create accounts, and the leaderboards feature isn’t displaying any information. It’s unclear when regular service will be restored, but for now you can still visit the website to scroll through all of the artwork that was placed over the weekend.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "51c058eb5ac3857218a9f0bd5b1021d2406190b0",
      "title": "Three children arrested on suspicion of murder of man in Kent",
      "url": "https://www.bbc.com/news/articles/cn855zj319yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T14:02:19.000Z",
      "summary_90w": "",
      "raw": "A 16-year-old girl and two boys, aged 14 and 15, are in police custody after an incident on Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9f71f139474b37a51e68ad686ccd921c78a89c62",
      "title": "WA’s ‘longest and most intense’ marine heatwave killed coral across 1,500km stretch",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/was-longest-and-most-intense-marine-heatwave-killed-coral-across-1500km-stretch",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:01:06.000Z",
      "summary_90w": "",
      "raw": "Scientists shocked by bleaching event that hit reefs from the World Heritage-listed Ningaloo to the remote Ashmore Reef\n\nGet our breaking news email, free app or daily news podcast\n\nThe “longest, largest and most intense” marine heatwave ever recorded in Western Australia has killed coral throughout an area that stretches 1,500km, according to state and federal scientists. \n\r\n More than 100 scientists and marine managers will gather in Perth on Tuesday for a special meeting to discuss the devastating event that bleached and killed corals on remote reefs earlier this year.\nThe marine heatwave that hit reefs from the World Heritage-listed Ningaloo to the remote Ashmore Reef left many scientists shocked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adeb9cae10fe04a08672042c582a203cb8d39aeb",
      "title": "Notion CEO Ivan Zhao wants you to demand better from your tools",
      "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/756736/notion-ceo-ivan-zhao-productivity-software-design-ai-interview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Hello, and welcome to Decoder! This is Casey Newton, founder and editor of Platformer and cohost of the Hard Fork podcast. This is the second episode of my productivity-focused Decoder series that I’m doing while Nilay is out on parental leave.\nToday, I’m talking with Notion cofounder and CEO Ivan Zhao. I’ve followed Notion for quite some time now — I’m a big fan, and a major part of my workflow for Platformer is actually built on top of Notion’s database feature. So I was very excited to get Ivan on the show to discuss his philosophy on productivity, how he’s grown his company over the last decade, and where he sees the space going in the future. \nIf you’ve never used Notion, you can think of it as an all-in-one productivity suite comparable to a lot of the collaboration and so-called “second brain” apps on the market — from the more business-y project management tools like Asana and AirTable to the more DIY note-taking variants like Anytype and Obsidian. \n\n\n\nListen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems. Subscribe here!\nNotion sits pretty comfortably in the middle here, since it can do what a lot of these kinds of apps do very well, and all in one package. At the same time, it allows for a pretty substantial amount of customization, which has made it popular both for individual productivity power users and for companies large and small. \nBut Notion started as a very different piece of software, and its evolution over the last 12 years or so has involved a fair amount of trial and error, one major reboot, and a lot of big decisions. In my opinion, what really sets Notion apart from so many of its peers is Ivan’s deep passion for design and an almost relentless drive to make products that he sees as useful and aesthetic in equal measure. \nYou’ll hear Ivan early on in this conversation reference LEGO: the toy bricks are the central inspiration for Notion, which employs “blocks” as a metaphor for configurable templates that allow you to use Notion in a pretty diverse set of ways. Think everything from simple notes and lists to complex databases and workflows. \nBut Notion, like so much software these days, is evolving. Now, the company calls itself the “AI workspace that works for you,” and you’ll hear Ivan recount in detail how the launch of OpenAI’s GPT-4 proved to be a big turning point for him and for Notion. The company launched an OpenAI-powered AI product much sooner than the competition, even before the launch of ChatGPT, and it’s added a host of new AI-powered features in the past few years. \nIvan himself is also pretty excited about the capabilities of AI; he said he uses it in his free time to learn about new subjects, and you’ll hear talk in depth here about his vision for AI agents that increasingly do more and more work for you inside of apps like Notion. \nBut a common theme with the AI industry right now is the very large gap between what AI can actually do today, and what so many people hope it can do down the road. So I really wanted to ask Ivan how we might get to this future he predicts, how long that will really take, and what productivity and knowledge work look like if AI delivers on some of these lofty promises. \nOkay: Notion CEO Ivan Zhao. Here we go.\n\n\nThis interview has been lightly edited for length and clarity. \nIvan Zhao, you are the co-founder and CEO of Notion. Welcome to Decoder.\nThanks for having me.\nSo at a high level, describe Notion for us. If listeners haven’t used it yet, what is it? What does it do?\nWell, we make all-in-one productivity software. People use Notion for all kinds of things, from taking notes, collaborating on projects, managing documents, managing their knowledge base, and, most recently, we launched a calendar product and mail product. You use Notion, so you should describe what Notion is.\nI think you just did a really good job describing it. I do use Notion, which is one of the reasons I wanted to talk to you, because every time I talk to a CEO whose products I use, I get to give them product feedback, which is exciting for me.\nPerfect.\nSo do you see Notion today as more for teams than individuals? Is that the direction it has found?\nWe designed Notion for teams. So another way to describe Notion is that we call it LEGO for software. Maybe it’s worth explaining the intent a little bit. If you’re a company, for your team, you have to use a dozen different tools to get your work done, and our goal is to consolidate those tools into one box and give you the LEGO blocks that power all those use cases. Not only can you do all your work in one place, but you can also use those LEGO blocks to create and customize your own workflows.\nYou and I have talked a fair amount about LEGO over the years. What appeals to you about that design? Why is it such a good metaphor for what you’re trying to do with Notion?\nWell, because it didn’t quite exist with software. If you think about the last 15 years of [software-as-a-service], it’s largely people building vertical point solutions. For each buyer, for each point, that solution sort of makes sense. The way we describe it is that it’s like a hard plastic solution for your problem, but once you have 20 different hard plastic solutions, they sort of don’t fit well together. You cannot tinker with them. As an end user, you have to jump between half a dozen of them each day. \nThat’s not quite right, and we’re also inspired by the early computing pioneers who in the ’60s and ’70s thought that computing should be more LEGO-like rather than like hard plastic. That’s what got me started working on Notion a long time ago, when I was reading a computer science paper back in college.\nYou wanted to make tools that would snap together the way that LEGO blocks do.\nWe want to make tools that amplify human creativity. LEGO are creative. LEGO are beautiful, and most software probably is not as much.\nSay a little bit more about how you were drawn into this world. Were you always somebody who was interested in productivity tools? Or did that come to you later in life?\nNo. I think it’s a misunderstanding about Notion. Notion is productivity software, that’s what we do as a business, as a product. But the ethos of this is what I just described; it’s the LEGO ethos. It’s maybe worth describing the history of the computing industry a little bit, because that inspired Notion. \nYeah. \nIn the ’60s and ’70s, ’60s, the hippie generation who took acid in San Francisco thought, “Well holy shit, this room-sized calculator, if you put a monitor in front of it, it can be an interactive thing, it can be a new type of medium that helps you think better, helps you solve problems more collaboratively.” That’s why the first generation of personal computing started in the Bay Area.\nThat generation of thinkers and pioneers thought about computing kind of like reading and writing. Like we went to school for multiple years, but not everybody can read and write English or German or whatever language you speak. Writing is a tool. Yes, you can be a poet, you can be writing essays, but it’s a very malleable medium.\nSo, they set out to make computing malleable and tinkerable, and everybody could their own software. Then, in the ’80s, the Bill Gates and Steve Jobs generation took computers to the mass market and put a computer in every home, on every desk. They sort of froze computing into this application format. If you think about applications, each application is kind of like a mini-prison of computing. You cannot change it that much. There are application makers who are engineer programmers, and then there are application users who are like the rest of us, the people who use productivity tools every day.\nSo when I was reading those papers about those ’60s and ’70s people, I thought, “Holy shit, the world that we’re living in is like a prison-like world.” If anything, the SaaS of the past 15 years has been for even smaller prison cells, as each application can only do a tiny slice of things. So, that doesn’t make it right for me, and the customer feels the same way. It doesn’t make sense that for your daily job, you have to jump between 20 different tools to get some work done. The average company or average business uses 100-plus different SaaS tools. The fragmentation is obvious, even for the IT department. \nSo, there’s another saying in business: you either bundle or unbundle. So, Notion’s squarely in the bundling business. Our job is to bundle SaaS into a one-ish productivity tool for your core daily needs, so we can unleash LEGO-like creativity for you.\nIt’s an interesting conversation. It makes me think of kitchen gadgets, because you see the same tension there, where there are some kitchen tools, like I don’t know, a stand mixer, or an immersion blender, that you can use to make many, many different kinds of recipes. And then there’s the garlic press, which is good for mincing garlic and nothing else. \nIt sounds like what you’re saying is by the time we got into the 2010s, productivity was just a bunch of garlic presses, and you sort of wanted to come along and say, “What if we just had a stand mixer and you could make a lot of recipes with one thing?”\nA friend of mine used this metaphor, similar to what you said. Have you seen avocado cutters?\nYes.\nAn avocado cutter is made just for freaking avocados. You cannot do anything else. In comparison, a kitchen knife is a tool that you can use hundreds or thousands of different ways. You, as a human, amplify it because you have a technique. So, to create software that’s more like a kitchen knife, or LEGO, that’s what interests me, and interests us as a company.\nBut you can’t blame the industry, because if you think about it — if you rewind back before SaaS — the world was running on Microsoft Office for a good solid 10 to 20 years. SaaS, with the internet as its distribution, allows new businesses to be created. The natural way to go about distribution and new businesses is to find a really precise solution, creating those avocado cutters and garlic presses, and you can find buyers on the other side.\nSo, as we move into today, do you think of yourself as competing directly against Microsoft Office or Google Workplace? Is the vision that big, or is it something different?\nWe coexist with them, as most of our customers are still using Google Workplace or Microsoft Office. They use their identity service, they use their mail and calendar apps. We have a mail and calendar product currently as a client. A startup can fully run on Notion. You don’t need to use Microsoft 360 or Google Docs, but it’s not as mutually exclusive.\nOur sweet spot is more on the things that you need to put in a database. Another way to think about it is like, what is Microsoft Access but for the 2020s, and AI native? Most SaaS is kind of like a relational database, storing some kind of system record of your company, and one workflow on top of that. That’s the part that neither Microsoft nor Google touches today. \nThere are spreadsheets, but there are not many database use cases. We want to consolidate and commoditize that, and give people the LEGO of those database use cases, such as project management and ticket tracking. Some companies use them for CRM, or managing application trackers. For reporters, you can manage all your leads and the stories. Those are database use cases.\nRight, and I do do some of that in Notion. Let me ask you about the flip side of building a product that has so much utility baked into it, which is that sometimes when I’ve talked to people who have tried Notion, they say, “I didn’t know where to begin. I felt intimidated by the blank page.” It seemed like there was a learning curve.\nHow do you think about that challenge, and try to bring people along into understanding what Notion is meant to do?\nYeah, like early LEGO, you get bricks. Then later on, LEGO created systems and boxes, and now LEGO works with Marvel and F1 to create really specialized boxes. In some sense, Notion as a company, we’re in the middle of adding more boxes, so people don’t have to start from an empty set of bricks, with no instruction manual. \nYou can imagine, like, “Hey, I want a Formula One race car. I like that LEGO box.” When you open it, you have your car ready-made for you, so you can start driving it. You play with that LEGO toy right away. But if you don’t like certain parts of the cars, because they’re made from LEGOs, you can change them. That has always been our philosophy, and we’re doubling down on this approach because it works.\nInteresting. I feel like a key challenge that some of the other big productivity tools like Microsoft Office have had over the years is bloat, right? The app has a million features, and each individual one is very important to like 0.5 percent of the user base, so you can’t remove it. \nBut also, the app just gets harder and harder to use over time because it’s so stuffed with buttons, menus, and widgets. Can Notion avoid that? And have there been times when you’ve worried you might be there already?\nIt’s definitely tricky. If you want to support more power, you need to have more things. There are two ways to approach it. The classic way is just adding that feature, in the hard plastic way. We’re taking a more LEGO approach, so adding the brick, and the brick can be used for different things. In some sense, this is a much better approach.\nGot it. So, trying to offer fewer discreet, very narrow features, and more abstract features that can be extended in various different ways.\nLike LEGO systems, on one end can be toy cars, and on the other could be Barbie dolls, more or less using the same bricks. If you look at the most common productivity tool, if you just put your designer mind on that, there are 20 or 30 pieces there. There’s some kind of table, some kind of relational database feature, some charts, some commenting, page editing, and collaboration. \nThose 20 things are core to all collaboration and knowledge work. So, we try to do our best job to make them friendly, approachable, and break them into pieces, and give them to you, either as a piece or as a part of a package.\nWhat bricks inside of Notion are most popular today?\nWe start with bricks around documents and knowledge bases. We’re famous for our block-based editors, and that’s from the early days. That’s like 2019 into 2020. And then databases are our most important brick today, because, like I mentioned, most knowledge work is just fancy file cabinets in the cloud. Knowledge work runs on file cabinets, and databases are the heart of that.\nYeah, the database is my number one Notion brick that I use. So that makes sense to me.\nPeople don’t discover that [easily]. We need to do a better job of getting people to understand its power. It’s essentially what an engineer does every day is wire together a relational database with views on top of that. How do we democratize that? That’s our purpose.\nWell, it’s interesting, because if I had never heard of Notion, and you came to me and you said, “Casey, you should build a database to solve this problem,” that’s like telling me that I should add another room to my house. I don’t know where to begin. I feel like I need to call somebody and ask for help. \nBut in practice, you click a couple of buttons, and in my case, install the Notion Web Clipper, and I’m well on my way to having a database. So, I don’t actually think the learning curve is that steep, but I could understand why somebody might be intimidated by it if they had never tried to do that sort of thing.\nYeah, not every kid grew up liking LEGO as their number one toy. I think Notion resonates the best with people who like to build, and they tend to be entrepreneurs, tech people, and the spreadsheet gurus in each team. They like Notion, and they set it up for the rest of their teammates.\nThat’s always helpful when you can get people inside the company doing the sales part for you.\nYou know what? AI can do this quite well now, because what AI is good at is gluing together LEGO bricks. AI can write code. Writing code is just another way of gluing together your process and workflows, and our latest product essentially gets AI to be this successful person to help set up your Notion workspace for you, and that’s another way to onboard customers. That’s a brand new way to unlock that we’ve added in the past year to two years.\nI will say that it has been very powerful for me in a lot of different products. Being able to use the in-app AI to say, “How do I do this?” And actually getting an answer. As somebody who has spent a lot of time in help menus over the years, digging around and not finding what I was looking for, that has been super useful.\nAnd it’s not just helping by teaching the human to do it. More and more, AI can just do it, right?\nRight.\nThat’s the biggest difference, actually. If you think about what’s happening in software right now, software is largely people providing the tools for humans to use, and more and more companies are realizing, “Wait a second, we have this new thing called a language model. It’s like a human mini-intern in a box, and we should design our software to teach AI how to use it so humans can ask AI to do the work and use the tools, and humans can do way more things with it.”\nI want to ask you some of the Decoder questions that Nilay would ask if he were here. Notion was last valued at $10 billion nearly four years ago, when you raised your last round of funding. What has allowed you to keep growing without raising more funding? Are you profitable?\nWe’re profitable. So, profitable, growing fast; the business is doing well.\nNice. How does that feel?\nIt feels good. I would say the larger driver of our everyday activity is the fact that the software industry is completely changing with AI. It feels like the AI era of the past two years just makes the SaaS era feel like sleeping days. It’s a bigger driver of our execution strategy than just running a profitable business.\nI’d like to hear more about how that is working. Is it the case that executives see AI changing various workplaces, and they think, “We need to figure out our version of this,” and so they come to Notion to help them figure it out? \nOr is it that your product teams are so excited about the possibilities that you’re just now seeing them build features, which are then drawing in new customers?\nI would say customers are lagging behind at the moment. Most people don’t know. It happens with every new technology. You don’t know what to do with it. The customer is not going to tell you. It’s the people who play with this, build things, and maybe have an imagination a few years into the future, or even a few months in the future, at this point. AI is changing so fast. So a lot is from ourselves, just playing with AI and realizing, “Holy moly, this is a very different thing. You can solve problems that you couldn’t solve before with classic software.” Now, what are you going to do with it?\nThere’s actually an interesting story. My co-founder, Simon Last, and I received early access to GPT-4. So this is like late 2022, a little bit before everybody else. We thought everybody else would get early access to this. We thought, “Holy shit,” because compared to GPT-3, GPT-4 is a brand-new thing. It’s like it has real intelligent reasoning in it. So we locked ourselves in a hotel room for about a week, and just tried to rush out the first Notion AI product. We actually launched a month before ChatGPT happened. We were excited about what you can do with this new type of material. That’s for Notion, that energy comes from there.\nHow many employees do you have over there? How big is Notion today?\nHigh three digits. So, 900, maybe approaching 1,000. \nHow do you think about company size? Do you see a world where there are five times that many employees? Or do you want to keep it somewhere around where it is right now?\nI think there’s no right answer for the absolute number, but there’s an answer for the density of the talent. The denser the better.\nYou like having fewer, but more talented people as opposed to more people?\nI like to have fewer, if we can do the work with fewer people, and there’s less communication overhead. People have more ownership, and people can work things across boundaries. That’s just better overall. The company moves faster. The small car can turn corners much better than a big car, and we always call Notion a small bus. We try to keep the bus as tight as possible.\nWhat’s your org chart? How is Notion organized?\nFairly classic. It’s me and my co-founders, Simon Last and Akshay Kothari. Simon is still coding every day. Akshay runs our product and design org and research. Our chief technology officer, Fuzzy Khosrowshahi, runs all of the engineering. Our chief revenue officer, Erica Anderson, is responsible for sales, marketing, and consumer experience. And we have our chief finance officer, Rama Katkar, and general counsel, Hasani Caraway. That’s our classic org chart.\nSo you didn’t feel the need to reinvent the wheel there or do any innovating, just sort of create classic company divisions and let people go do their thing.\nClassic company divisions and high-quality people keep the bus tight. So that allows you to be profitable. \nHow do you make big decisions? Do you have a framework you use? Or is every decision different?\nWell, there are the typical one-way doors and two-way doors. With a one-way door, you try to move fast, and with a two-way door, you think a little bit more carefully and sleep on it. Those are thinking fast and slow types of things. I’m pretty detailed. I like to work on the notes, so there’s a certain problem I’m good at. Personally, it gives me energy, and I’m interested in working on the ground in the trenches with everybody. \nThere are certain parts, though, like I cannot run our finance team. Our CFO, Rama Katkar, is really amazing. She takes care of that. But for certain things — like design and product, engineering, marketing, and branding — I like to get involved.\nYou’ve always struck me as a product CEO. I think from the first time I met you, it seemed to me what was most interesting to you about your company was the tool itself that you were building, as opposed to the market opportunity, or something like that.\nI built Notion because I wanted to build Notion, not because I wanted to start a company or business. I wanted this thing to exist.\nLet me ask you one more decision question, about one of the bigger decisions you had to make. So in 2015, you decided to shut down the 1.0 version of Notion, relocate to Japan, and eventually relaunch Notion 2.0, which is kind of the Notion that we think of when we use it today. How did you make that decision?\nWell, you have to, otherwise you die, right? At that point, it was like, “We’re building on the wrong thing, the wrong foundation,” and you know what the right thing is, but it’s just going to take you maybe a year to a year and a half to build the right thing. We were a company of about five people, and we were going to run out of money. \nThe only way to do it was to shrink it back to just me and my co-founder, Simon. So, we started over. Japan is a good place because it is inexpensive, and we have never been there. It was interesting, and we could just focus on building.\nI know other founders who have been in that situation, and that’s the moment where they gave up, because they thought, “You know what? Maybe I could think of another thing to build here, but it seems exhausting. It’s going to take a year. I’ve already put a year and a half or so into this app. I gave it everything I had. It didn’t work.” \nWhat was it that made you say, “No, we’re going to keep going on this. We think that there is a vision here that we can actually achieve”? \nThe goal was never to start a business, like I mentioned. The goal was to build this thing, and the thing didn’t quite exist. Notion is one of the few bundling, consolidating software productivity tools out there, and it didn’t quite exist at the time. Software for LEGO doesn’t exist. So if I started a company, I wanted to do the same thing. Why don’t I just reset and go back to Simon and me so we can stretch the money a bit longer?\nActually, I just got back from Kyoto last week, where there was a tech event, and the Kyoto mayor and I did a fireside chat and talked about this story. They wanted to talk about using Notion as an example of how we can blend tech and Kyoto’s craft tradition. Because we’re also inspired a lot by the craft people in Kyoto, how they dedicate their time to building something, and not just for money or fame.\nThat is so crazy. I was actually in Kyoto last week, too. I was on vacation and went there for the first time, and I had an incredible time. Kyoto’s amazing. \nYou get the sense that it’s a little bit slower pace. People care about what [they’re making], right? People truly care. That’s the thing. It’s the main thing. It’s not the business, it’s not their other surroundings.\nOh absolutely. I mean, you go to these temples that are 1,000-plus years old, and the care and the craftsmanship that they put into them is truly inspiring. It’s deeply beautiful. It’s very connected to their spirituality, and their religion, culture, and history. So I could understand why a founder would go there and take a lot of inspiration.\nYeah, because it’s a bit slower too, you can focus on virtual spaces, on computers.\nYeah, it’s not like San Francisco, with our go-go nightlife, our Waymos, the party scene, all of that.\nOr New York, even, even more of that.\nOne more of these. This isn’t strictly a Decoder question, but it spiritually feels like a Decoder question that I wanted to ask you. What is the best productivity tool that you use that is not made by Notion?\nI like those chatbot products: ChatGPT, Anthropic’s Claude. It’s quite amazing, especially when talking about features, like the conversation mode. I love those. I like to learn from them.\nYou like voice mode?\nThe voice mode, yeah. It helps me learn a lot of different things. When I’m making coffee and waiting for the water to boil, I can just talk with this thing for a little bit, like for two minutes. It’s perfect.\nWhat do you ask it about? What do you like to learn about?\nOh, all kinds. What’s most recent? In Japan, I was reading a book about Marshall McLuhan. \nThe media theorist?\nYeah, media theorist and theologian. Many of his concepts are hard to interpret, so it’s better to just work through them with a language model that will help guide you. It’s the best tutor, truly. Education should be very different. Hopefully, it will be very different a few years from now.\nI think so. This isn’t quite a tutoring use case, but I just have to say, when I was in Kyoto last week, we were in the neighborhood and had some time to kill, so I just opened Google Maps, and it sort of opens to where we are, and I took a screenshot. I just sent it to ChatGPT, and I said, “Tell us a bit about this neighborhood.”\nIt gave me a history of the neighborhood. It told me about the cool restaurants, cool coffee shops, a museum, and places that we could walk to. I mean, it truly was as good as I can imagine getting from any guide, and it was as simple as uploading a screenshot. The whole thing took 15 seconds. It was wild to me.\nYeah. One use case I have, if I go to a famous architectural building, is that I say, “Hey, I’m at this place, tell me about it. I’m looking at this part, a corner of this building. Tell me more about why that is the case,” right? Because if it’s famous enough, it’s probably part of the corpus of training. So, the language model knows about it.\nYeah.\nYou can just take a truly guided tour, and you don’t need another person; you’re just talking with your machine.\nWell, that seems like a good segue into Notion and AI. We’ve talked about what Notion is, how it’s changed. Notion now bills itself as the “AI workspace that works for you.” So, what does an AI workspace mean to you? What do you want it to be for us?\nIf you think about our strategy during the SaaS era, it’s bundling and consolidating a bunch of different tools for knowledge work into one place. What’s changed in the past couple of years is that it now has all that soft knowledge of LEGO in Notion; you can not only provide the tools, but you can also assemble them as your AI teammates. They can do the work for you. \nWe are fortunate to have that knowledge work LEGO in one place so you can piece it together in a very interesting way. Because one end can take notes for you, the other end can help you manage, triage projects, and write documents. Those are basic things, but more and more, with more LEGO and smarter models, you essentially hire Notion as your AI teammate. That’s the future that we’ve been building, or building more toward. \nI remember one time I was meeting with you, and you just launched some of these AI tools, and you were showing me that Notion AI was taking notes about various meetings. So you were able to dip into meetings at the company that you did not personally attend, and just kind of quickly catch up on what your coworkers were talking about.\n I thought, “That’s super interesting.” That’s the kind of feature that I can imagine a lot of CEOs wanting, but before this point, they haven’t had that level of visibility into their own company.\nWe just launched three separate products a couple of months ago, like Notion AI for Work, including the next version of this enterprise search product you’re talking about. So, along with that was the launch of our AI Meeting Notes product, so all your meetings can be recorded and transcribed. \nSo essentially, your company has a collective brain of what’s going on, and you have all the AI knowledge workers on top of Notion to help you transcribe the meeting notes and answer whatever questions you may have. It’s quite interesting what you can do with the technology now.\nOf all the AI features that you’ve added so far, which ones do you personally find the most useful?\nI use AI meeting notes. Almost every meeting, except this one, I record, and I use that for meetings so I can share notes with other people. I use it for myself, as a starting position to dump my thoughts. And so I can later remember to ask AI to turn the transcription into writing. English is my second language, so I’m not the fastest writer, but AI can do better writing than I can if I just dump out what’s on the top of my mind through the AI transcription feature.\nThat’s really interesting. There’s a lot of talk right now about AI, and whether it might replace workers, or entire workflows, or functions within an organization. You’ve talked today about AI being able to serve as a kind of teammate. \nDo you think that AI and Notion will get to a point where executives will hire fewer people, because Notion will do it for them? Or are you more focused on just helping people do their existing jobs?\nWe’re actually putting out a campaign about this, in the coming weeks or months. We want to push out a more amplifying, positive message about what Notion can do for you. So, imagine the billboard we’re putting out. It’s you in the center. Then, with a tool like Notion or other AI tools, you can have AI teammates. Imagine that you and I start a company. We’re two co-founders, we sign up for Notion, and all of a sudden, we’re supplemented by other AI teammates, some taking notes for us, some triaging, some doing research while we’re sleeping. \nSo, all of a sudden, we’re a team or a company of 10 people. Then the startup can run much faster. That’s the vision we want to push more towards the world. So, more of an amplifying force, rather than a zero-sum force.\nWhat timeframe do you think that arrives? Does that feel like it’s almost within reach? Or do you think we’re going to need to see several more research breakthroughs before that sort of thing becomes possible?\nFrom someone who’s building with this every day, I think the capability is pretty much there. There are different spectrum complexities of knowledge work. The model is quite smart. I would say what’s lacking is the plumbing, the toolings that unlock the capability of the model. That’s essentially what Notion is doing, with the LEGO blocks being the plumbing and tooling. So, that’s one constraint. \nThe other constraint is just how people use it, and how people plug it into their workforce. Bureaucracy is sometimes a good thing, and sometimes it’s a bad thing. In this case, I think it’s actually a good thing, because it slows things down a little bit. It gives people the time to adapt and to learn with this new tool. I think it’s good. So, the capability is more or less there, and if not, every three months you get a new one. The trends just keep coming, right?\nAt the same time, I think the biggest flaw in the AI models that we have today is that they’re not reliable. They don’t answer the same question the same way 100 percent of the time. So, if I’m relying on it for mission-critical stuff, if it’s one of the 10 “people” at my company, and I tell it to go grab some facts and figures, and it just kind of hallucinates the wrong one, that’s really bad. \nIf that were a real worker, I would, I don’t know, put them on a performance improvement plan or something. So how do you think about reliability as a challenge to what kinds of services you want to offer people?\nYeah, it’s definitely an issue, and I would say it’s getting better in general. I would say the best, closest mental model is treating the language model just like a human, just like an intern. Humans make mistakes. Your trust level, when you tell another human something, is that there’s no guarantee that this human cannot mess it up or tell another person, even though you don’t want them to, right?\nSo, we’re finally building trust this way. People’s expectations for software are higher because software, for the longest time, was always exact — there are no bugs. It always does exactly what it’s told. AI is a new type of software. Our expectation hasn’t been set on how to deal with this yet. I think as more people get used to it, as we change our habits around it and companies change their workflows around it, I think we’ll find an equilibrium that’s amplifying the better part of this technology and dealing with its shortcomings. \nYeah, I think the podcaster, Dwarkesh Patel, said something like, “An AI today is better than an intern on day one, but worse than an intern on day five.” Because on day one, they have all the knowledge of human history, and they can sort of dazzle you with their capabilities. \nBut also, they have trouble learning, and it’s hard to show them how to do something once and then have them do it reliably every single time. Whereas a human being could do that. So, I’m personally very curious, when is the point when an AI is better than that day-five intern?\nI think all companies, including Notion, are trying to figure out techniques to inject memory and learning into this “intern.” In the coming quarters, you will see products with this baked in.\nOkay, now my ears are perking up, because it sounds like we’re getting a little bit of a preview. Do you want to tell us what you’re working on over there?\nSimilar to the campaign I just talked about. A couple of months ago, we launched Notion AI for Work. It has AI meeting notes and deep research to help you draft documents. For the upcoming product, you can actually now imagine each one is an AI intern and can do a specialized thing, right? With the upcoming product, you can actually create different flavors of AI interns, AI teammates, that live with you in your workspace. That’s as far as I want to share. Well, you’ll see more soon. And Notion AI can do everything you can do, everything a human can do.\nI like the sound of that. Let me ask you about my product request, and you know this request, because I’ve had it for a while now. Basically, when you first started adding AI features into Notion a few years ago, I put in this request, because every link that has ever been in my newsletter, Platformer, is stored in a Notion database. In many cases, that includes the full article text, and what I want is to be able to have a conversation with that particular database. It would be so useful for research and brainstorming columns. \nAt the same time, it’s hundreds of thousands, maybe millions, of words. It’s not the sort of thing that you could easily throw into a context window and just let me have that conversation. So, my question, Ivan, is where are we on this dream of mine?\nTo be able to have a conversation with all your thousands of articles in Notion?\nYes.\nIt is probably already there, because the techniques have been invented. You’re correct that you don’t have to fit everything into a context window. You can index everything, embed everything, and piece information out as you need it. There’s another technique that’s been popular in the past year or so, called tool use. It essentially teaches the language model, your agent, to know how to use search. \nSo, if you have a question that’s not in the context window initially, the agent can go there, just like a human can, to find more information about it. It will take a little bit more time round-trip, but eventually, it will give you what you want. So, new techniques will make the use cases you’re describing better.\nI like the sound of that. And you do have an Ask Notion feature already that I imagine can access some element of what I’m talking about, and a lot of this stuff is just sort of on the web, so there are other ways of accessing it. But I just always think, “Man, if I could have a lightning fast way of just chatting with this database the way I would chat with a coworker, that’d be super cool.”\nOh, it should already be in your Notion workspace. Happy to walk you through the new enterprise search we just launched. It’s perfect for that.\nOkay, great. All right, we’ll troubleshoot that offline. OpenAI has come up a couple of times today. You work closely with the company. Recently, it announced that you can use ChatGPT to create presentations and slide decks. All of the big labs are working on these full-stack virtual assistants that they say might someday be able to do anything a remote worker might be able to do. \nDo you think that they’ll get there in the next, let’s say, five years? And what role do you see Notion playing in a world where AI’s capabilities are rapidly expanding that way?\nYeah, one way to think about it is on the spectrum, whether it’s more personal, business-to-consumer flavored. Or it’s like business-to-business, team-first flavored.\nI would say most AI labs’ products are currently more personal assistant-flavored. It can help you do work or help you cheat on your homework. Usually, B2C tends to be winner-takes-all, or there are few winners, and I think it makes sense for labs like OpenAI to go really hard in that direction. Notion squarely is a B2B company. Our product, our business model, is for other businesses, and inside B2B, you’re required to make different tradeoffs. \nThere are so many different subcategories, and it has to be team-first to start. That’s why our AI teammates, our AI agent and AI system, fundamentally live in a team space that you or the rest of your company’s employees live in. That’s the angle we’re taking. In my opinion, there will be many different winners in B2B AI, because B2B usually is not winner-takes-all, and you need to make very different tradeoffs.\nThat’s interesting. I’m still not sure I totally understand. Say a bit more about what this business-to-business AI world looks like, and why it is that it will have many winners, whereas business-to-consumer maybe doesn’t?\nWell, you can think about it in the professional setting. So if you think about all knowledge work, it is lawyers, accountants, programmers, and customer support, and they’re all different. They require you to make a little bit of a different trade-off; that’s a different type of AI agent. You can already see this in the first-generation AI agent. They need to be specialized and need to plug into different contexts.\nOn the consumer side, you just want to chat with your AI chatbot. It’s very universal. That’s why on the B2C side, in the previous generation, there were iPhone and Android. There are two things, largely, and in the  B2B SaaS world, there are thousands of different companies and hundreds of different categories. So, whether it’s a software or AI product, you have to make very different trade-offs. You cannot be an airplane and a submarine at the same time, right? That’s why in the professional setting, you see a lawyer agent and a financial agent, and they behave very differently. They need to behave very differently, compared to your personal assistant that you wake up to every day and can chat with.\nRight now, you sell AI tools as an add-on in your business and enterprise plans. I’m curious if this hurts your margin at all? We hear a lot about how expensive and compute-intensive, resource-intensive AI systems can be to operate. Is it a challenge to integrate those resource-hungry tools into your existing subscription?\nWe actually recently merged AI into our main plan, because more than half of our sales are now from customers who want to buy our AI product. So, it makes sense to just simplify the pricing buckets, to just include AI into everything. It does make the margin not as good as pure SaaS, but no. It’s so powerful, and people appreciate it. And still, the company is cash flow positive, so our CFO loves that, despite it being a different margin profile.\nWe’ve already seen some companies move toward usage-based pricing for AI, which, as a consumer, I hate. I don’t want to make micropayments to ask ChatGPT a question, but it does seem like that is maybe a better business model. What do you think about the tradeoffs there?\nI don’t think people have figured it out, especially in the business setting. The first generation is kind of like customer support. With customer support, you can try to map what they call outcome resolution-based pricing. That makes sense. Then there’s sort of the second generation, which is out right now, and that’s coding. With coding, there’s a seat base, but if you use a lot, you have to go to usage-based pricing. That sort of makes sense, because through exchange, it is a piece of work. You get your file, you get your software at the end of the day. So people appreciate that, and it saves programmers so much more time than actually writing the piece of software themselves.\nKnowledge work is nebulous. With knowledge work, you can’t put a price on it. It’s this chunk of a doc, but how much is it worth? You can’t really quantify that. And how good is a piece of knowledge work? How good is your product spec? You can’t put a dollar sign on it. So, it’s much harder for a general-purpose knowledge work product like Notion. That’s the thing, the whole industry needs to figure it out.\nThat’s really interesting. What do you wish that AI would make possible in Notion that isn’t quite possible yet?\nYou can always get cheaper, faster, and smarter, but you know the train is coming in that direction, so it does require you to build a company in a different way. I think this is what the software industry is realizing right now.\nSay more about that.\nI never worked during the dot com era. That was a little bit before me. People say that during that era, the web standard changed all the time, every couple of months, or every three months it’s different. And there was Intel and the Moore’s Law era, where you could just expect that 18 months later, the next CPU would drive whatever software you wanted. \nAI feels like that, but on steroids. Like every three months, the next model can do what you couldn’t do before. So it does require you to really change how you build software and build products, and how you build a company. A couple of things: One is because it’s constantly changing, and the model itself doesn’t like too many restrictions; you need to build a harness just around the right places. It’s almost like if you build too much around the train track, the next train comes, and you just made what you just built obsolete, right? You should build parallel to the train track. That’s number one.\nNumber two is that the language model is not deterministic. It’s different from classic software engineering. The metaphor I like to use is that classic software engineering is like building train tracks or building bridges. It’s Newtonian physics. Everything’s predictable, and if you can imagine it, you can build it. Sometimes it takes three months, sometimes six months, but eventually you can build it, right?\nWith this language model thing, it’s squishy and it’s organic. The analogy I love to use is like brewing beer, right? You cannot tell the yeast, “Hey, my beer is gonna taste like this. Please ferment yourself. Become like that.” You have to channel what’s in the model. The best you can do is create an environment, massage the data, massage the context, and then hope for the best. \nSo, this requires a much more iterative approach. You cannot come from your vision or customer needs first. You have to come from what the technology gives you — what the yeast, what the beer, gives you. So, really allow your team to be more empirical, more experimental, less of this kind of waterfall, classic way of specing to code. It should be more like incremental, iterative. All those add together and force you to design, engineer, and develop products differently. \nDoes it change the way that you hire? Does it change the way that you structure teams? How does that strangeness that you describe translate into a different company?\nPeople need to be more okay with ambiguity. People need to love ambiguity. People need to be more experimental. The boundary between roles is going to be even greater. Like at Notion, we’d hire a designer who can code, because if you’re an engineer and designer in one, you can think a lot more ambiguously, more fluidly, right? \nAI time pushed that even further, because the design and product sit side by side with engineers. Oftentimes, what you want cannot be built, so you have to really try a bunch of different things. That’s why you see a lot of product demos get to like 60 to 70 percent, but never become a real product. That’s because it’s good for making demos, but to get to production B2B software, you need to be really good. You need to be reliable. Oftentimes, you never get there.\nI think about this a lot in the context of these voice-based assistants. What I mostly use them for is setting a timer or asking what the weather is, these very deterministic things. And the companies that are building [voice-based assistants] are trying to integrate these new AI-based backends. But it’s incredibly hard, because if the user is still using the product, they’re still going to want to set the timer, and if it goes from doing it correctly 100 percent of the time to like 93 percent of the time, that’s a much worse product.\nBut I think as humans, we all learn what this type of technology is best at. It’s when you’re having a conversation, like when using the voice mode, that you want it to be ambiguous. You want it to go to different places. That’s a feature, not a bug. I think we — as a whole industry making software with AI, and we as an audience who use it — haven’t figured out the stance yet. It will take some time to figure this out, like the best material to use.\nWell, I want to end just by asking what you think Notion looks like a little bit into the future. I will not ask you about five years from now, because I don’t think anybody has five years’ worth of visibility into anything.\nNobody knows. \nBut if I could maybe ask for like two years from now, what do you hope Notion is doing that it’s maybe not doing today?\nI think, to go back to what we just talked about, that the nature of software is changing. It’s changing and evolving from just a set of tools to this organic matter, to a tool that can do some work for you, right? The heart of this company is in SaaS software. The classic software era allows people to build tools, to allow people to use LEGO to create whatever tools they want. \nBecause the nature of that software is changing, what we care about allows you to create AI teammates to help you take some of the most repetitive knowledge work you don’t like to do. If we can realize that, there are a lot of implications. The next generation of builders is going to run a company very differently — and I care about solving that problem.\nAll right, well, Ivan, thanks so much for joining me today.\nThank you for having me.\nQuestions or comments about this episode? Hit us up at decoder@theverge.com. We really do read every email!",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "77a282777b6452f619ee5cac92da4a4155e3ba8c",
      "title": "EU citizens awaiting UK residency status have right to travel, Home Office told",
      "url": "https://www.theguardian.com/uk-news/2025/aug/11/eu-citizens-awaiting-uk-residency-status-have-right-to-travel-home-office-told",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:56:02.000Z",
      "summary_90w": "",
      "raw": "Statutory body expresses ‘serious concerns’ over difficulties faced by some applicants taking short trips abroad\nEU citizens waiting for the Home Office to decide their pre-Brexit residency status should not be removed from the UK if they make a short return visit abroad for business, leisure or family matters, the statutory body for EU citizens’ rights has said.\nThe Independent Monitoring Authority for Citizens’ Rights Agreements (IMA) has written to the Home Office to express “serious concerns” about the difficulties applicants on the waiting list face if they leave the country.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d0ea03aa591ea6a2fa4bfacdff41d84d1bf535d",
      "title": "Judge denies release of Ghislaine Maxwell grand jury transcripts",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5492207/epstein-maxwell-grand-jury-transcripts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T13:52:38.000Z",
      "summary_90w": "",
      "raw": "President Trump called for the release of the grand jury transcripts after growing pressure to divulge more information about Jeffrey Epstein's case, but the judge on the case said there is nothing new to release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a0e51a27b7c6e83dad2500c47a37e5b0999bd4de",
      "title": "Rapists 'probably' forfeit right to choose gender, says Nicola Sturgeon",
      "url": "https://www.bbc.com/news/articles/c05eedgp804o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T13:52:12.000Z",
      "summary_90w": "",
      "raw": "The former first minister also says she was partly to blame for a loss of \"rationality\" in the gender debate.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2023205649b06d46cc4d5b72a72579a6451e124e",
      "title": "Over-70s face driving ban for failing eye tests",
      "url": "https://www.bbc.com/news/articles/c5yllgezjk3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T13:50:14.000Z",
      "summary_90w": "",
      "raw": "The proposed changes in England and Wales come after a coroner calls the UK's licensing system the \"laxest in Europe\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "046d9d0b4cc5ea07bcbd9ed063aa20ccc6897a9a",
      "title": "Everton agree loan deal for Grealish - why Man City dream turned sour",
      "url": "https://www.bbc.com/sport/football/articles/cp8zjrnw6yro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T13:41:10.000Z",
      "summary_90w": "",
      "raw": "Everton agree a season-long loan deal to sign winger Jack Grealish from Manchester City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1982ba33fe6d1ac6d4f280fb356d608c6e699d29",
      "title": "Finland charges tanker crew members with sabotage of undersea cables",
      "url": "https://www.theguardian.com/world/2025/aug/11/finland-accuses-tanker-crew-sabotage-undersea-cables-anchor",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:33:33.000Z",
      "summary_90w": "",
      "raw": "Captain and first and second officers of Eagle S, understood to be part of Russia’s ‘shadow fleet’, charged over incident\nFinnish authorities have filed charges against members of the crew of an oil tanker suspected of damaging five undersea cables by dragging its anchor between Finland and Estonia.\nFinland’s deputy prosecutor general’s office said on Monday it had filed charges of aggravated sabotage and aggravated interference with telecommunications against the captain and first and second officers of the Eagle S. The Cook Islands-registered tanker is understood to be part of Russia’s “shadow fleet” – comprising vessels that sail under foreign flags to evade sanctions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed200b3f3c222ffca2a8710b602f4ff2adf7d4e9",
      "title": "Colombian senator Miguel Uribe dies after June campaign shooting",
      "url": "https://www.theguardian.com/world/2025/aug/11/colombian-senator-miguel-uribe-dies-after-june-campaign-shooting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:27:04.000Z",
      "summary_90w": "",
      "raw": "Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39\nThe Colombian senator and presidential hopeful Miguel Uribe, who was shot in the head at a campaign event two months ago, has died, the hospital treating him has said.\nUribe, a member of a prominent political family and a lawmaker for the rightwing opposition, was shot on 7 June in Bogotá, where he was speaking to try to secure his party’s nomination for 2026 elections.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66db2f710278fec589a05ac0d76920d7f45fa942",
      "title": "Palestinian activist killed by settler filmed his shooting, footage shows",
      "url": "https://www.theguardian.com/world/2025/aug/11/awdah-hathaleen-shooting-video-west-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:26:14.000Z",
      "summary_90w": "",
      "raw": "B’Tselem publishes film showing killing of Awdah Hathaleen after suspect released by court over ‘weakened’ evidence\n\nMiddle East crisis – latest updates\n\nAwdah Hathaleen, the prominent Palestinian activist who was killed late last month by an extremist Jewish settler in the West Bank, filmed the moment he was shot, newly released video footage reveals.\nHathaleen, who worked on the filming of the Oscar-winning documentary No Other Land, which examined settler violence against the Palestinian community of Masafer Yatta, was killed by Yinon Levi, a settler who was already under sanctions in the UK and EU for violent acts against Palestinians.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6887582a0496695ab2e4bf8a66ba3748f43a492",
      "title": "Paramount Plus will soon become the exclusive home to the UFC",
      "url": "https://www.theverge.com/news/757341/paramount-plus-ufc-deal-sports-streaming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T13:25:54.000Z",
      "summary_90w": "",
      "raw": "Paramount has just snapped up the rights to the UFC, joining an industry-wide race to buy up remaining sports streaming rights. The $7.7 billion deal will bring 30 of the UFC’s “Fight Nights” and 13 marquee events to Paramount Plus subscribers for seven years starting in 2026 — no pay-per-view required.\nParamount, which merged with Skydance just days ago, won’t charge subscribers more for access to UFC fights. But it’s still not clear whether UFC fights will be exclusive to Paramount Plus’s pricier $12.99 per month Premium plan, or if $7.99 per month Essential subscribers will gain access, too. Paramount will also simulcast some of the events on CBS.\nThe Disney-owned ESPN currently holds the rights to the UFC, with its ESPN Plus streaming service airing events on a pay-per-view basis. As noted by CNBC, ESPN paid an average of $500 million annually for five years of UFC rights, while Paramount will pay around $1.1 billion every year.\nESPN’s full-featured live streaming service makes its debut later this month and will include exclusive access to WWE events, such as WrestleMania.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Dame Stephanie 'Steve' Shirley, technology pioneer, dies aged 91",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T13:20:17.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7803b8adfa69e076a7f399f79931cdd7d9b8e2a5",
      "title": "Fairphone’s new cables and chargers are both faster and tougher",
      "url": "https://www.theverge.com/news/757304/fairphone-usb-c-cables-30w-charger-durable-sustainable",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T13:17:06.000Z",
      "summary_90w": "",
      "raw": "This 30W charger is available now, but only in Europe.\t\n\nRepairable phone manufacturer Fairphone has announced a new range of USB cables and chargers. While they’re not user-repairable, the company says that they’re more durable and sustainably manufactured than its previous peripherals. And even for people without a Fairphone device, they should make for a more affordable entry point to its more ethical take on tech.\nThe new USB cables are all C-to-C, but include a removable USB-A adapter too. They all support 240W power output, are built to withstand at least 70,000 bends (I’ve seen up to 30,000 from brands like Belkin and Ugreen, though Anker’s top Prime cable claims to have been tested for 300,000 bends), and use entirely recycled copper wires and recycled plastic braiding and cable jackets. For the first time the gold and silver are bought using Fairmined credits, which doesn’t guarantee that the metals were responsibly mined, but does see a portion of the funds directed to small-scale, responsible mines.\nThere are three cables in the range: 1m (3.3ft) and 2.5m (8.2ft) versions using the USB 2.0 spec from €19.95 (around $23), and a 1m (3.3ft) version using USB 3.2 for €34.95 (around $40). This has had some upgrades from Fairphone’s previous USB 3.2 cable, now supporting up to 20 Gbps transfer speeds along with video output of 4K at 120Hz and 8K at 30Hz.\nFairphone is also launching two new chargers using 100 percent recycled plastic in the casing and recycled copper-zinc alloy plug pins. A 30W version is available now for €24.95 (around $29), with a single USB-C port and support for common charging standards including PD, PPS, and Samsung and Apple’s charging specs. A three-port 65W version is set to launch before the end of September. Both chargers come in UK and EU versions.\nAll of the new products have been assembled using exclusively green energy, and include a three-year warranty as standard. They’re available through Fairphone and its partner retailers in Europe, but Fairphone’s public relations manager Alon Brandt told me that they’re still waiting on certification for a US release.\nI’m currently reviewing the Fairphone 6, the company’s most recent phone, so keep an eye out for my verdict on that this week. Like that phone, these peripherals are more expensive than comparable models on the market, but paying extra gets you the ethical boost of fairer production plus the practical benefit of an extended warranty. And if dropping $899 on a more sustainable phone feels out of reach, perhaps spending $20-40 on more ethical accessories is a little more achievable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0c5e8b48c75f7698d45e136df1318a2eda99c25",
      "title": "A modder created the iPadBook that Apple won&#8217;t",
      "url": "https://www.theverge.com/news/757340/custom-mod-apple-macbook-air-ipad-m4-ipad-pro",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T13:14:17.000Z",
      "summary_90w": "",
      "raw": "The iPadBook doubles as a MacBook Air and an iPad Pro. | Screenshot: YouTube\t\n\nApple has little interest in merging iPadOS and macOS, or bringing its desktop operating system to its touchscreen tablet. So a Chinese modder took it upon themselves to create a hybrid laptop they’re calling the iPadBook featuring both operating systems in a single device that lets you switch from macOS to iPadOS by simply detaching its screen.\nModder Shu Chan started by removing the display from an M1 MacBook Air and installing a custom-designed, 3D-printed magnetic hinge they’ve dubbed MagBaka that uses 12 magnets to hold an iPad Pro in place as its replacement screen. The dock works alongside a custom case for the iPad Pro, and although the tablet isn’t quite as wide as the MacBook Air when connected, there’s a high level of polish to this mod that almost makes it look like something Apple would make.\nWhen attached, the iPad Pro serves as an external (and primary) display for the MacBook Air complete with touch and Apple Pencil support, and when removed it becomes a standard M4-powered iPad Pro.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82108e688a77979c9ae409e6241be06eb8c5afb2",
      "title": "Nvidia, AMD may sell high-end AI chips to China if they pay US a cut",
      "url": "https://techcrunch.com/2025/08/11/nvidia-amd-may-sell-high-end-ai-chips-to-china-if-they-pay-us-a-cut/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T13:09:13.000Z",
      "summary_90w": "",
      "raw": "The global AI chip race narrative used to be about U.S. national security, but apparently now it's about tariffs: Nvidia and AMD have agreed to pay the U.S. government 15% of the revenue they make from sales of high-end AI chips to China in exchange for licenses to sell to those chips in the country, the Financial Times reported, citing anonymous sources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3b9fda6697918f425a61cf7e371951b90aa4377a",
      "title": "The US is taking a cut from chip sales to China - what does it mean?",
      "url": "https://www.bbc.com/news/articles/cx2ppgg0zvlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T13:02:53.000Z",
      "summary_90w": "",
      "raw": "Two top firms will give the US government 15% of profits from the sale of some advanced semiconductors in China, the BBC has been told.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a691470abc6f7adf58d4178f1636c062bd040ea0",
      "title": "UN condemns targeted Israeli attack that killed five Al Jazeera journalists",
      "url": "https://www.bbc.com/news/articles/cq688qz3rlro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T12:50:42.000Z",
      "summary_90w": "",
      "raw": "Israel says it targeted correspondent Anas al-Sharif, accusing him of leading a Hamas cell, which Al Jazeera denies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a7f384a1ff0033f185297270e9f51ece2163cfc",
      "title": "EU leaders push to consult with Trump ahead of Putin meeting on Ukraine",
      "url": "https://www.theguardian.com/world/2025/aug/11/eu-trump-putin-meeting-ukraine-diplomacy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T12:44:19.000Z",
      "summary_90w": "",
      "raw": "Foreign ministers expected to demand Russia agree to ceasefire and include Zelenskyy during emergency meeting\n\nEurope live – latest updates\n\nEuropean leaders claiming Russia represents an existential threat to their continent are pushing for consultations with Donald Trump to spell out Europe’s red lines before his meeting with Vladimir Putin to discuss the Ukraine war on Friday in Alaska.\nThe Polish prime minister, Donald Tusk, said he was optimistic the US president would formally consult with European leaders before his meeting, adding that the summit between Trump and Putin filled him with hope and fear.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8baae8c7c6612484634589ea2422301df3e910f8",
      "title": "Councillor was rabble rousing crowd, court hears",
      "url": "https://www.bbc.com/news/articles/cj6yyw13w4jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T12:31:18.000Z",
      "summary_90w": "",
      "raw": "Ricky Jones denies encouraging violent disorder after comments at a counter-protest last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7369236ecc2f0aa73b316e4fb9aac9a4b3c4215c",
      "title": "Helping Australian teachers share lesson plans could improve stagnating student results, Productivity Commission says",
      "url": "https://www.theguardian.com/australia-news/2025/aug/11/helping-australian-teachers-share-lesson-plans-could-improve-stagnating-student-results-productivity-commission-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T12:30:04.000Z",
      "summary_90w": "",
      "raw": "A national database of lesson plans was one of the recommendations of the fourth interim report into how to lift Australia’s flagging productivity\n\nGet our breaking news email, free app or daily news podcast\n\nA national online database of lesson plans would help teachers cut hours from their weekly workloads and help reverse years of stagnating student results, the Productivity Commission says.\nThe commission’s fourth interim report on how to lift Australia’s flagging productivity focused on building a skilled and adaptable workforce.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee5a561373fd7f7bb950be3d915b8243bafd3178",
      "title": "Bournemouth defender sales to reach £147m as Zabarnyi nears PSG move",
      "url": "https://www.bbc.com/sport/football/articles/c1leezv2r0zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T12:22:47.000Z",
      "summary_90w": "",
      "raw": "Illia Zabarnyi is expected to seal a move to Paris St-Germain for a fee more than double what Bournemouth initially paid to sign the defender in 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "917aa8a634ac8bdfe0daa479a7a26baedbbad9bb",
      "title": "EasyJet pilot suspended after being seen 'drunk and naked'",
      "url": "https://www.bbc.com/news/articles/c80dd15378eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T12:03:48.000Z",
      "summary_90w": "",
      "raw": "The budget airline grounded the unnamed pilot after hotel guests reportedly complained after the incident in Cape Verde.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65a1bbd96147712f8054043c86a69548c06a8819",
      "title": "Surprise Matter update focuses on reliability and stability",
      "url": "https://www.theverge.com/matter/757179/matter-1-4-2-spec-release-pushes-platforms-to-play-nicely",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T12:00:00.000Z",
      "summary_90w": "",
      "raw": "For Matter, this year was never going to be about flashy new features. Other than support for security cameras, which I hear should finally arrive this fall, 2025 is all about fixing problems. And with Matter 1.4.2, announced today, the smart home standard is taking an encouraging step forward.\nBack in January, Tobin Richardson, president and CEO of the Connectivity Standards Alliance (the organization that runs Matter), told me this year would be all about \"focusing on fixing these reliability and performance issues.\" Now, over halfway through 2025, the CSA is finally looking to make good on that promise, and showing signs that it's prepar …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "17bbd3a796959a6da4a55012f7334e6dd6197477",
      "title": "Hyundai wants Ioniq 5 owners to pay to fix a keyless entry security hole",
      "url": "https://www.theverge.com/news/757205/hyundai-ioniq-5-security-upgrade-fix-game-boy-device-attacks",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T11:52:30.000Z",
      "summary_90w": "",
      "raw": "Hyundai’s latest Ioniq 5 model.\t\n\nHyundai is now offering an “optional” security upgrade for the Ioniq 5 in the UK that prevents the car being stolen with a Game Boy-like device. Hyundai wants some Ioniq 5 owners to pay £49 ($65) to upgrade hardware and software components to prevent thieves using handheld devices to unlock and start cars without needing a key.\nKia, Hyundai, and Genesis EVs have been under attack in the UK and elsewhere in recent years thanks to a sophisticated Game Boy-like handheld device that cracks the wireless protocols used by Hyundai Motor Group on vehicles like the Ioniq 5, original Kia EV6, and Genesis GV60.\nHyundai is now offering a paid upgrade for Ioniq 5 owners in the UK, which it promises will address “evolving security threats” with improved software and hardware components for a “customer contribution of £49.” You can check to see if your Ioniq 5 needs this upgrade here, but there hasn’t been a similar bulletin for US vehicles yet.\nIt’s not clear why Hyundai is asking customers to pay for the luxury of having their cars protected against a flaw in Hyundai’s own security mechanisms, particularly as the car maker offers a five-year warranty on its vehicles. We’ve reached out to Hyundai to comment on this security upgrade.\nHyundai’s upgrades are designed to protect against a rise in thieves using a handheld device, which was reportedly designed by hackers in Europe to resemble a Game Boy. It’s been used for at least five years, and works on a variety of cars that use keyless entry systems.\nThe Drive reported in 2020 that the device can intercept the signal emitted when you touch a car’s door handle, allowing it to crack the algorithm and send back a signal so the car thinks a legitimate key is present and unlocks the doors. The same manipulation technique then works to start the car and steal it, and it’s as easy as hitting a button instead of performing a relay attack to amplify the signal of the legitimate key.\n\nWhile these Game Boy-like devices cost around €20,000 in Europe, they’ve been widely used to steal a variety of Kia, Hyundai, Nissan, Gensis, and Mitsubishi cars in recent years. Hyundai’s Ioniq and Kia’s EV6 models were even among the most stolen cars in the UK in 2024, demonstrating just how vulnerable these cars are to this type of attack.\nSecurity researchers also found a flaw in Kia’s web portal last year that allowed attackers to unlock and start cars. It was part of a series of security flaws that have been reported to Hyundai Motor Group, the owners of Hyundai, Kia, and Genesis brands. Hyundai and Kia also agreed to a $200 million settlement in 2023 over the “Kia Boyz” attacks that allowed thieves to bypass a vehicle’s security system using a USB cable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0de68df1ae086453e8ec50d733a08bcf911a1",
      "title": "Wind generator Ørsted’s shares sink as it makes $9bn cash call",
      "url": "https://www.theguardian.com/environment/2025/aug/11/orsted-wind-generator-shares-sink-9bn-cash-call",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:46:24.000Z",
      "summary_90w": "",
      "raw": "Danish company blames Donald Trump for derailing its business model after market value drops by a third\n\nEurope’s largest wind power company has blamed Donald Trump for derailing its business model, after it announced a $9bn (£6.7bn) fundraising and its market value plunged by almost a third.\nThe share price for Denmark’s Ørsted tumbled to an all-time low after it told investors on Monday that the “extraordinary situation” facing the industry meant it would need to tap shareholders to cover the costs of its plans.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68f358f6bc037412af4a5d3379d94d256bec4a0e",
      "title": "Colombian Senator Miguel Uribe dies two months after being shot",
      "url": "https://www.bbc.com/news/articles/c78mmj97ygmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T11:43:27.000Z",
      "summary_90w": "",
      "raw": "Miguel Uribe has died of injuries he sustained in a targeted attack on his life at a rally in June.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "833766a03493ffbc27cca3e79446e7f7b2cb1139",
      "title": "More foreign criminals to be deported before appeals heard",
      "url": "https://www.bbc.com/news/articles/cyvnnj301l3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T11:39:39.000Z",
      "summary_90w": "",
      "raw": "Home Office adds 15 more countries to \"deport now, appeal later\" policy to remove offenders before their appeals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86408e6b3c506881f90c2d8d0e2761be6c8b0d4b",
      "title": "Global outrage mounts as funeral held for five journalists killed by Israel",
      "url": "https://www.theguardian.com/world/2025/aug/11/funeral-held-for-anas-al-sharif-and-other-journalists-killed-in-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:39:01.000Z",
      "summary_90w": "",
      "raw": "Last post from Al Jazeera’s Anas al-Sharif, one of ‘Gaza’s bravest journalists’, decries failure to stop ‘massacre’\n\nMiddle East crisis – live updates\n\nHundreds of mourners carried the body of the prominent Al Jazeera journalist Anas al-Sharif through the streets of Gaza City on Monday, a day after he and four colleagues were killed in an Israeli airstrike, prompting condemnation from across the world.\nSharif, one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. Seven people in total were killed in the attack, including the Al Jazeera correspondent Mohammed Qreiqeh and the camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa, according to the Qatar-based broadcaster.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de1f677a27bc1bbfc959ada3cba628638197ab71",
      "title": "Trump vows to crack down on D.C. crime. And, Putin-Trump meeting to discuss end of war",
      "url": "https://www.npr.org/2025/08/11/g-s1-81981/up-first-newsletter-washington-dc-federal-agents-putin-trump-summit-israel-gaza",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T11:33:15.000Z",
      "summary_90w": "",
      "raw": "President Trump has deployed federal agents in the nation's capital to crack down on crime and homelessness. And, Trump and Russian President Vladimir Putin are expected to meet Friday in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a5e41cf743125102a17b92b669f591cbfda8315",
      "title": "Apple’s new Siri may allow users to operate apps just using voice",
      "url": "https://techcrunch.com/2025/08/11/apples-new-siri-may-allow-users-to-operate-apps-just-using-voice/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T11:23:38.000Z",
      "summary_90w": "",
      "raw": "Apple is testing a version of Siri that will be able to take actions on your behalf across various apps by following voice commands. The company plans to release a new version of App Intents, its framework gives developers the ability to allow users access to parts of their app via different systems, like search and Shortcuts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5edf8e28079d3903fd510d1b509d43ff753814b4",
      "title": "Helicopter pilot in crash that killed Outback Wrangler star was a ‘party animal’, court told",
      "url": "https://www.theguardian.com/australia-news/2025/aug/11/outback-wrangler-court-helicopter-pilot-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:16:45.000Z",
      "summary_90w": "",
      "raw": "Jock Purcell tells court Sebastian Robinson was ‘hopeless with paperwork’ and says Matt Wright – who has pleaded not guilty to attempting to pervert the course of justice – was ‘lenient’ with record keeping \n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA pilot whose helicopter crashed, killing Outback Wrangler co-star Chris “Willow” Wilson, was a “party animal” and cocaine user who was “hopeless” at keeping flight records, a court has been told.\nPilot Sebastian Robinson was left a paraplegic after the February 2022 crash during a crocodile-egg collecting mission in remote swampland in the Northern Territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5ce4c611917b27e7936b3bb24264e2163839e0f",
      "title": "Judge ruled Erin Patterson would have to face separate trial for attempting to kill estranged husband to avoid prejudice",
      "url": "https://www.theguardian.com/australia-news/2025/aug/11/judge-ruled-erin-patterson-would-have-to-face-separate-trial-for-attempting-to-kill-estranged-husband-to-avoid-prejudice-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:15:05.000Z",
      "summary_90w": "",
      "raw": "Prosecutors ultimately dropped charges relating to Simon Patterson before triple murder trial over mushroom lunch started\n\nGet our breaking news email, free app or daily news podcast\n\nTriple murderer Erin Patterson would have been unfairly prejudiced if a jury heard allegations she tried to kill her estranged husband in the years before the fatal poison mushroom lunch.\nVictorian supreme court justice Christopher Beale made the decision on 14 March, ruling Patterson would have to face a separate trial for the three alleged attempted murder charges.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b6003219965f1b2897cd364ed9369c51167aabc",
      "title": "Farmers displaced by $1.5bn Trump golf course reportedly being offered rice and cash",
      "url": "https://www.theguardian.com/world/2025/aug/11/farmers-displaced-trump-golf-course",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:07:50.000Z",
      "summary_90w": "",
      "raw": "White House denies suggestions resort in Vietnam presents conflict of interest amid row over compensation rates\nVillagers whose farms in Vietnam will be bulldozed to make way for a $1.5bn golf resort backed by the Trump family have reportedly been offered rice provisions and cash compensation of as little as $12 for a square metre of land by state authorities.\nThousands of villagers will be offered compensation based on land size and location, according to a report by Reuters. The agency spoke to elderly farmers who said they feared they would struggle to find a stable livelihood.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25a6bf028ec68c59674bf84a858b87c3338ea89d",
      "title": "Man jumps on to moving high-speed train",
      "url": "https://www.bbc.com/news/articles/c05eevjl06jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:51:50.000Z",
      "summary_90w": "",
      "raw": "The man was left behind after apparently taking advantage of a scheduled stop to have a cigarette.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f606e727abaf23dd9d358808a09e513c80654a94",
      "title": "Dozens of Malian soldiers arrested over alleged coup plot against junta, sources say",
      "url": "https://www.bbc.com/news/articles/c79llr41y3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:48:54.000Z",
      "summary_90w": "",
      "raw": "The wave of arrests reflect increased tensions within the military government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df2c314f7e9f33abc8d050357b7394409e99d467",
      "title": "China rams own warship while chasing Philippine vessel",
      "url": "https://www.bbc.com/news/articles/cev22n0lm1xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:34:44.000Z",
      "summary_90w": "",
      "raw": "The crash in the disputed Scarborough Shoal rendered a Chinese warship \"unseaworthy\", Manila said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8384da29fd1f7c684210f2320a2e03c6084666f",
      "title": "FA Cup winners Crystal Palace lose appeal against demotion from Europa League",
      "url": "https://www.bbc.com/sport/football/articles/c1kzzpp04kgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T10:28:48.000Z",
      "summary_90w": "",
      "raw": "Crystal Palace are unsuccessful in their appeal against being demoted from the Europa League and will play in the Conference League this season.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8384da29fd1f7c684210f2320a2e03c6084666f",
      "title": "Palace lose appeal against demotion from Europa League",
      "url": "https://www.bbc.com/sport/football/articles/c1kzzpp04kgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T10:28:48.000Z",
      "summary_90w": "",
      "raw": "Crystal Palace are unsuccessful in their appeal against being demoted from the Europa League and will play in the Conference League this season.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "441807ddb64b0246b9323978db7b23b42d256aff",
      "title": "Weather tracker: Europe braces for another heatwave with highs of 44C",
      "url": "https://www.theguardian.com/environment/2025/aug/11/weather-tracker-europe-heatwave-spain-portugal-north-america",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T10:26:47.000Z",
      "summary_90w": "",
      "raw": "Parts of Spain and Portugal likely to bear brunt of heat, while drought conditions sweep North America\n\nEurope live – latest updates\n\nAfter a period of cooler weather, swaths of central and eastern Europe face another heatwave as hot air over south-western Europe pushes north-west.\nSince late July, large parts of the Iberian peninsula have endured persistent heat, with temperatures frequently climbing to the high 30s to low 40s celsius.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ce7f0de56478b344de0d016c1792b75486304d",
      "title": "Delhi given eight weeks to round up hundreds of thousands of stray dogs ",
      "url": "https://www.bbc.com/news/articles/cly665zjg2eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:22:02.000Z",
      "summary_90w": "",
      "raw": "Activists say it will be difficult to move over a million stray dogs to shelters within eight weeks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d07fbb8e1bc2cf2966631ae1e638aa6702088891",
      "title": "Watch: Chinese ships collide while pursuing Philippine boat",
      "url": "https://www.bbc.com/news/videos/c1jnne45dj3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T10:05:24.000Z",
      "summary_90w": "",
      "raw": "Watch: Chinese ships collide while pursuing Philippine boat",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d83cad531dde5ba3c18a37c3be8d683de6db748",
      "title": "Amber health alerts as heatwave temperatures set to hit 34C",
      "url": "https://www.bbc.com/weather/articles/cz60081dpyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T10:02:31.000Z",
      "summary_90w": "",
      "raw": "Temperatures are expected to peak on Tuesday as heat health alerts are issued for the whole of England.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb5298654dc0029b0cf8b561581c4efa1d9c0da5",
      "title": "Albanese’s Palestinian statehood decision won’t please everyone – but it’s better than the horrifying status quo",
      "url": "https://www.theguardian.com/australia-news/2025/aug/11/albaneses-palestinian-statehood-decision-wont-please-everyone-but-its-better-than-the-horrifying-status-quo-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T09:41:44.000Z",
      "summary_90w": "",
      "raw": "Opposition says recognition rewards Hamas for its terror and murder but prime minister asserts it is a step towards peace\n\nGet our breaking news email, free app or daily news podcast\n\nAs Anthony Albanese and Penny Wong prepared to announce Australia’s recognition of the state of Palestine on Monday, nervous anticipation rippled around Parliament House.\nStaffers gathered in windows above the prime minister’s courtyard, ready to take photos of the announcement unfolding below. Anne Aly, the first Muslim woman to sit in cabinet, watched from one floor up as Albanese and Wong fronted the media, while the country’s most senior bureaucrat, Steven Kennedy, paced nervously nearby.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25742798eabc0b4500f34e5aa0a0d550083ea62f",
      "title": "Arthur's Seat blaze likely caused by human activity, says fire service",
      "url": "https://www.bbc.com/news/articles/cjr11z2yx0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T09:24:31.000Z",
      "summary_90w": "",
      "raw": "The Edinburgh landmark was evacuated as the flames spread up the hill, with no reported casualties.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f86f2b14d072b4d96758ad8c0d7172778b83d9e5",
      "title": "British man who perished in Antarctic glacier found 65 years later",
      "url": "https://www.bbc.com/news/articles/c4g034yx4gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T09:05:51.000Z",
      "summary_90w": "",
      "raw": "His brother tells BBC News that he had lost hope he would ever be found.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d369b043fb360561f4eacbf65523dbf297880eb4",
      "title": "Factories are losing immigrant workers, stressing those who remain",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496335/trump-immigration-workers-parole-tps",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump campaigned on helping American workers through his immigration policies. Now that he's revoked work authorization for thousands of immigrants, those left behind are feeling taxed by their absence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88f224a667546254d25af6df313cfb4eded31142",
      "title": "Trump's tariff revenue has skyrocketed. But how big is it, really?",
      "url": "https://www.npr.org/2025/08/11/g-s1-81934/trump-tariffs-record-revenue",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump's new tariffs are pouring in. But it's still only a fraction of overall government revenues — and falls short of new spending in the recent Republican megabill.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4da50f5b04db72769ec29b4cd6a30e0192b5ac8b",
      "title": "What's the deal with claims that birth control is dangerous?",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5494736/hormonal-birth-control-side-effects",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Social media is full of videos saying hormonal contraception can hurt you and promoting natural alternatives. How did the treatments get such a bad reputation and do alternatives work?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8217b43c81a671ad83da0f024859474b248d85c",
      "title": "Trump demands homeless people 'immediately' move out of Washington DC",
      "url": "https://www.bbc.com/news/articles/c1kzz4m3ll1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T08:56:40.000Z",
      "summary_90w": "",
      "raw": "Trump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee42afb4e24777f0cd07eaab1c53786286588576",
      "title": "Israeli strike kills journalists in Gaza City, worsening the death toll for the media",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498400/gaza-israel-journalists-killed",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T08:55:11.000Z",
      "summary_90w": "",
      "raw": "Israel's military targeted an Al Jazeera correspondent with an airstrike Sunday, killing him, another network journalist and other people, all of whom were sheltering outside the Gaza City Hospital complex.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d95727c5df11b7a0f589a1545c316121886d6b44",
      "title": "What does recognising a Palestinian state mean?",
      "url": "https://www.bbc.com/news/articles/cvgp5z1vvj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T08:16:46.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Sir Keir Starmer has announced that the UK will recognise a Palestinian state in September unless Israel meets certain conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a4ef5a98d8548bda7ca953cd2908640cd434122",
      "title": "Spurs open talks to sign Man City's Savinho - but how would he fit?",
      "url": "https://www.bbc.com/sport/football/articles/clyddxxgx9wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T08:16:13.000Z",
      "summary_90w": "",
      "raw": "Tottenham express interest in signing Brazil winger Savinho during talks with Manchester City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69570abf19130ee0ae82f3ed6fce689924e636e5",
      "title": "Anas al-Sharif, prominent Al Jazeera correspondent, among five journalists killed in Israeli airstrike on Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/10/prominent-al-jazeera-journalist-killed-in-israeli-airstrike-on-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T08:10:08.000Z",
      "summary_90w": "",
      "raw": "Israel admits deliberate attack on the journalist, known for frontline coverage, in a strike on a tent outside al-Shifa hospital\nA prominent Al Jazeera journalist who had previously been threatened by Israel has been killed along with four colleagues in an Israeli airstrike.\nAnas al-Sharif, who was one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. His funeral was held on Monday morning.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97dc2402b0e733212fd3e55bc181dc20ae4e2eef",
      "title": "AOL is finally shutting down dial-up",
      "url": "https://www.theverge.com/news/757194/aol-dial-up-is-dead",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T07:32:48.000Z",
      "summary_90w": "",
      "raw": "AOL dial-up is ending on September 30th according to a statement posted on the company’s website. It marks the end of the service that was synonymous with the internet for many since its launch in 1991. \n“AOL routinely evaluates its products and services and has decided to discontinue Dial-up Internet,” reads the statement by the Yahoo-owned company. “This service will no longer be available in AOL plans. As a result, on September 30, 2025 this service and the associated software, the AOL Dialer software and AOL Shield browser, which are optimized for older operating systems and dial-up internet connections, will be discontinued.”\nYou might be surprised that the service was still operating. I’m not. At last count, a 2019 US census estimated that 265,000 people in the United States were still using dial-up internet, just a few years after I wrote this:\nAs a septuagenarian, my father’s story was typical of long-time AOL dial-up subscribers. His subscription was a security blanket. He was sure he didn’t need the dial-up component, but he didn’t want to risk losing access to his stock portfolio, investor forums, and email. His setup worked, and he could afford to keep paying the subscription he had dutifully paid for over a decade. \nWith my help, we were able to migrate everything he used on AOL to the ad-supported and open internet that was already being delivered into his house via the broadband component of his cable package. Even after things were fully mirrored, he still felt trepidation when the time came to pick up the phone and terminate his dial-up account (despite AOL’s best attempt to obscure and complicate the procedure). Months later he told me he felt silly for letting the ruse go on for so long.\nReading that now and I’m struck to think that the end of AOL dial-up arrives at the same time as Google Zero and the end of the ad-supported internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "022d6c9011ee1101105ea6d644b311ccd9b3d3d8",
      "title": "Growing pains: can rice production in Africa keep up with demand?",
      "url": "https://www.theguardian.com/world/2025/aug/11/can-rice-production-in-africa-keep-up-with-demand",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T07:21:32.000Z",
      "summary_90w": "",
      "raw": "Africa Rice initiative aims to give farmers more control over their land in order to reduce flooding and increase yields\nSalmata Ouattara remembers 2023 as the turning point for her rice farm.\nJune is usually the peak of the rainy season in Ivory Coast, but in the preceding years she and other farmers in M’Be on the outskirts of Bouaké, the country’s second biggest city, would wait weeks for rainfall. Then in September, they would watch helplessly as their farmlands were flooded. Some abandoned their farms, frustrated by fluctuating crop yields.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "faf1b03d39c539838f0e31c4d98651b701ca52d8",
      "title": "Nigerian profitable food delivery Chowdeck lands $9M from Novastar, Y Combinator",
      "url": "https://techcrunch.com/2025/08/11/nigeria-profitable-food-delivery-chowdeck-lands-9m-from-novastar-y-combinator/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T07:11:55.000Z",
      "summary_90w": "",
      "raw": "Chowdeck, a Lagos-based food delivery startup that has stayed profitable in a notoriously tough and low-margin market, has raised $9 million in Series A funding to launch a quick commerce strategy and expand into more cities in Nigeria and Ghana. The equity round was led by Novastar Ventures, with participation from Y Combinator, AAIC Investment, […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3f0cba1ce4f971e6dfe974a4aa734e9b97063a8b",
      "title": "What we're reading on the beach this summer",
      "url": "https://www.npr.org/2025/08/11/1257106922/what-were-reading-on-the-beach-this-summer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T07:00:59.000Z",
      "summary_90w": "",
      "raw": "It's time for our annual beach reading recs. Today we bring you three books, with a little economic learning to boot. Our recs: \nWho is Government? The Untold Story of Public Service by Michael Lewis \nEl Dorado Drive by Megan Abbott \nAlgospeak: How Social Media is Transforming the Future of Language by Adam Aleksic \nRelated episodes: \nBeach reading with a side of economics How to beach on a budget \nHow to beach on a budget \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2edf23cfe949437d51f6ed0459235cf941596b24",
      "title": "Did life start on the ocean floor — and what does that mean for alien life?",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5495449/life-space-moon-ocean-hydrothermal-vents",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T07:00:00.000Z",
      "summary_90w": "",
      "raw": "How did life start on Earth? The answer is a big scientific mystery scientists are actively investigating. After talking with many scientists, host Regina G. Barber found that an abundance of water on Earth is most likely key, in some way, to the origin of life — specifically, in either deep sea hydrothermal vents or in tide pools. It's for this reason some scientists are also exploring the potential for life in so-called \"water worlds\" elsewhere in the solar system, like some of the moons of Jupiter and Saturn. This episode, Regina digs into two water-related hypotheses for the origin on life on Earth — and what that might mean for possible alien life.\nHave another scientific mystery you want us to cover on a future episode? Email us at shortwave@npr.org.\nListen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b1d1932e297fa63e0f11ca88305ba7844a25d58",
      "title": "Will Jubilee host the next Presidential debate?",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496680/will-jubilee-host-the-next-presidential-debate",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Jubilee has become one of the go-to open forums for debate in the digital age. Videos like: \"Flat Earthers vs Scientists,\" \"1 Conservative vs. 20 Feminists,\" and, \"What Makes a Real Man?\" are just some of the few topics they cover.   \nIt's what caused The Atlantic staff writer Spencer Kornhaber to write his article, \"Jubilee is Like Gen-Z's 'Jerry Springer Show'\".  \nBut their most recent video, \"1 Progressive vs 20 Far-Right Conservatives,\" has gone viral for what some feel is a dangerous platforming of fascist ideals.   Brittany is joined by The Atlantic staff writer Spencer Kornhaber to get into the state of public discourse, and how traditional media may led us to this moment.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9f7910646582932516b5a776241699945134b18",
      "title": "British backpacker pleads guilty to killing man while drunk on e-scooter",
      "url": "https://www.bbc.com/news/articles/c0e999y7vq2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T05:59:30.000Z",
      "summary_90w": "",
      "raw": "Alicia Kemp, 25, from Redditch, was on a working holiday in Western Australia when she hit the father-of-two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f75c790ca9a4afe2a44cc7fe43fd64e71957d8a6",
      "title": "UK police say more than 500 people arrested in pro-Palestinian events over weekend",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498378/uk-police-say-more-than-500-people-arrested-in-pro-palestinian-events-over-weekend",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T05:54:48.000Z",
      "summary_90w": "",
      "raw": "Most of those detained were arrested for carrying signs supporting a pro-Palestinian group recently banned as a terrorist organization in the UK.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90b38888fd5b0d2cb48eb999f7133cb393d86ad9",
      "title": "Monday briefing: ​What a new investigation tells us about the shooting of Palestinians at Gaza aid sites",
      "url": "https://www.theguardian.com/world/2025/aug/11/first-edition-ghf-food-site-investigation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T05:43:24.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: A Guardian investigation uncovers chilling evidence that civilians in Gaza appear to have been targeted by coordinated ​gunfire during food distributions\nGood morning. In May 2025, Israel dismantled the United Nations-led humanitarian aid distribution system in Gaza. In its place came a distribution scheme run by the secretive Gaza Humanitarian Foundation (GHF) that came under immediate scrutiny for its “militarised model” and close ties to Israeli authorities, which rights groups warned “undermines the core humanitarian principles of humanity, neutrality, impartiality, and independence”.\nIn the months since, humanitarians’ worst fears about the aid sites have been realised. International observers have expressed concern as daily reports emerged of civilians being shot, shelled or crushed while attempting to access aid. Almost 1,400 Palestinians have reportedly been killed while seeking food, primarily near GHF distribution sites.\nIsrael-Gaza war | Benjamin Netanyahu has defended his plan to take control of Gaza City, even as senior UN officials warned the move risked unleashing “another calamity” on the territory. On Sunday, Anas al-Sharif, a prominent Al Jazeera journalist, was killed in an Israeli airstrike. Israel admitted a deliberate attack on the journalist.\nUkraine | Europe’s leaders have raised the pressure on Donald Trump to involve Ukraine in a planned summit with Vladimir Putin, as Germany warned the White House against any deal hatched “over the heads of Europeans and Ukrainians”.\nHousing | Lower-income householders, minority ethnic people and those with young children are more likely to live in homes at risk from dangerous overheating, research has found.\nUK news | Half of the people arrested during the protest in relation to Palestine Action in London on Saturday were aged 60 or above, according to police figures. A total of 532 people were arrested at the largest demonstration relating to the group – all but 10 under section 13 of the Terrorism Act for displaying supportive placards or signs.\nCrime | Foreign criminals from 15 more countries face deportation before they have a chance to appeal, in an expansion of the UK government’s “deport first, appeal later” scheme.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14a5b8f3d8c6fefe9ec0e08b34b3ffab6df36e81",
      "title": "Eight killed in Ecuador nightclub shooting",
      "url": "https://www.bbc.com/news/articles/czr66pj1k72o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T05:41:13.000Z",
      "summary_90w": "",
      "raw": "The nightclub was in Guayas, one of four Ecuadorian provinces currently in a state of emergency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9871ffc0e6ae8094e87f08ad6b8e0041e07b81d",
      "title": "Will the newly-promoted Premier League clubs buck the trend and avoid relegation?",
      "url": "https://www.bbc.com/sport/football/articles/cx29dq4xnljo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T05:39:27.000Z",
      "summary_90w": "",
      "raw": "BBC Sport looks at the stats surrounding relegation, asks why promoted clubs are struggling and rates each of the new boys' chances.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6b8598517d86cf5d598034ed450cc5b6a1450b7",
      "title": "Japan rocked by bullying scandal after team withdraws from high school baseball tournament",
      "url": "https://www.theguardian.com/world/2025/aug/11/japan-baseball-bullying-koryo-high-school-tournament-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T05:22:57.000Z",
      "summary_90w": "",
      "raw": "Koryo high pulled out of the popular competition after an outcry over reports that some of its members had bullied a junior player\nOne of Japan’s most popular sports tournaments is reeling after the sudden withdrawal of a team whose teenage players have been accused of abusing a younger teammate.\nKoryo high school, which had been representing Hiroshima prefecture in the summer high school baseball championships, announced on Sunday it would no longer take part.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "52cde7c14df7bf82fb8bc1e1745f56104759de32",
      "title": "Lucy Letby's new expert supporters claim no babies were deliberately harmed. Who should we believe?",
      "url": "https://www.bbc.com/news/articles/cj0y9673rjno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T05:00:52.000Z",
      "summary_90w": "",
      "raw": "Barrister Mark McDonald claims he has the backing of a panel of world class experts who say there is no evidence any babies were deliberately harmed. Who should we believe?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffdd7e22e2c335548d32088764e5a89c66532b41",
      "title": "Their loved ones are missing at war. So these Ukrainian children spend summer together",
      "url": "https://www.bbc.com/news/articles/cdx0ex5v437o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T04:35:55.000Z",
      "summary_90w": "",
      "raw": "Will Vernon gets exclusive access to a pioneering summer camp for Ukrainian children with missing parents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cbbae2d9d1fb73abe4f1d7cb63ee90e872bd59b1",
      "title": "Australia to recognise Palestinian state in September",
      "url": "https://www.bbc.com/news/articles/cvg33351n61o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T04:16:09.000Z",
      "summary_90w": "",
      "raw": "It follows similar moves by the UK, France and Canada.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc0e84373504817010918a2e7510c8757f9d683e",
      "title": "China diplomat tipped as next foreign minister detained by authorities – report",
      "url": "https://www.theguardian.com/world/2025/aug/11/liu-jianchao-china-diplomat-detained-beijing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T03:02:20.000Z",
      "summary_90w": "",
      "raw": "Liu Jianchao, the envoy in charge of managing ties with foreign political parties, was reportedly detained in late July\nLiu Jianchao, a senior Chinese diplomat widely seen as a potential future foreign minister, has been detained by authorities for questioning, the Wall Street Journal has reported.\nLiu was taken away after returning to Beijing in late July from an overseas work trip, it reported on Sunday, citing people familiar with the matter.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b42380276c70efff19a30ad3f6d96d87b8f9266",
      "title": "China's unemployed young adults who are pretending to have jobs",
      "url": "https://www.bbc.com/news/articles/cdd3ep76g3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T01:50:13.000Z",
      "summary_90w": "",
      "raw": "With Chinese youth unemployment high, individuals are paying to go into offices and pretend to work.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ba207a600a517403a0ffd0e2f3e65c12fc63a1b",
      "title": "Record warm seas help to bring extraordinary new species to UK waters",
      "url": "https://www.bbc.com/news/articles/c05enyryqvmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T00:36:06.000Z",
      "summary_90w": "",
      "raw": "The UK's seas have had their warmest first seven months of the year on average since records began.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b452372fb87b55b0353d738a8a0da81a7058a0fc",
      "title": "Turkey earthquake flattens buildings in north-east Balikesir province",
      "url": "https://www.bbc.com/news/articles/cwy557j3y5lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T00:13:55.000Z",
      "summary_90w": "",
      "raw": "The magnitude 6.1 quake left one person dead and caused 16 buildings to collapse in the north-west Balikesir province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a0d0f46f8b9804b5cd23bce9b73ae9f1b583e0c0",
      "title": "Security flaws in a carmaker’s web portal let one hacker remotely unlock cars from anywhere",
      "url": "https://techcrunch.com/2025/08/10/security-flaws-in-a-carmakers-web-portal-let-one-hacker-remotely-unlock-cars-from-anywhere/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T00:00:00.000Z",
      "summary_90w": "",
      "raw": "Security researcher Eaton Zveare told TechCrunch that the flaws he discovered in the carmaker's centralized dealer portal exposed vast access to customer and vehicle data. With this access, Zveare said he could remotely take over a customer's account and unlock their cars, and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6eb73ee5cd5905432120550cdd33029217a251f3",
      "title": "Why investors just bet $85M on this Indian company’s generic drug strategy",
      "url": "https://techcrunch.com/2025/08/10/truemeds-challenged-how-indians-buy-medicine-and-saw-a-3-6x-jump-in-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-10T23:30:00.000Z",
      "summary_90w": "",
      "raw": "Truemeds has taken a different route from other Indian online pharmacies — and it has helped the startup double its revenue.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ea131997d68ef45d7a7fd94d748204d2ff4544ef",
      "title": "New voters list in Indian state includes wrong photos and dead people",
      "url": "https://www.bbc.com/news/articles/c3wnx7689l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T23:22:21.000Z",
      "summary_90w": "",
      "raw": "A political row has broken out over India's Election Commission's decision to update the rolls in Bihar.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82be48808290f612f64dc026bffb8a40dffd0c9d",
      "title": "Adidas designer sorry for shoes 'appropriated' from Mexico",
      "url": "https://www.bbc.com/news/articles/c1mpzm4p7edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T21:32:07.000Z",
      "summary_90w": "",
      "raw": "He has apologised over the Oaxaca Slip-on, inspired by sandals made by Indigenous artisans, after criticism from Mexico.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f04c0c49c83d6f52b14b0d4a2d606dc24c973cb0",
      "title": "Bowen: Israeli settlers intensify campaign to drive out West Bank Palestinians",
      "url": "https://www.bbc.com/news/articles/cj4wwxz12jko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-10T21:03:27.000Z",
      "summary_90w": "",
      "raw": "In the shadow of the Gaza war, violence is rising in the occupied territories as radical settlers seize land with the backing of the government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54595bad76a8cfb5c68dc450b5f92cc871c5f72a",
      "title": "Ahmed contributes with bat & ball as Rockets beat Superchargers",
      "url": "https://www.bbc.com/sport/cricket/videos/cjeyyww435yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-10T20:40:08.000Z",
      "summary_90w": "",
      "raw": "Rehan Ahmed takes two wickets before scoring 31 runs off 26 balls to help Trent Rockets beat Northern Superchargers by five wickets in the Men's Hundred at Trent Bridge.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e86b0cd9d99576125d7343c14dd4dace944fbdc",
      "title": "The hidden cost of living in Mark Zuckerberg’s $110M compound",
      "url": "https://techcrunch.com/2025/08/10/the-hidden-cost-of-living-amid-mark-zuckerbergs-110m-compound/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-10T19:59:20.000Z",
      "summary_90w": "",
      "raw": "Mark Zuckerberg has spent 14 years gobbling up his leafy Palo Alto neighborhood, according to a New York Times report that details how the Meta CEO has purchased 11 properties for over $110 million to create his own personal fiefdom in Crescent Park. The piecemeal compound features a main residence, guest homes, manicured gardens, and […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8e96ca2423d3213e2918358f45a573314b77a1c",
      "title": "The computer science dream has become a nightmare",
      "url": "https://techcrunch.com/2025/08/10/the-computer-science-dream-has-become-a-nightmare/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-10T18:59:42.000Z",
      "summary_90w": "",
      "raw": "The coding-equals-prosperity promise has officially collapsed. Fresh computer science graduates are facing unemployment rates of 6.1% to 7.5% — more than double what biology and art history majors are experiencing, according to a recent Federal Reserve Bank of New York study. A crushing New York Times piece highlights what’s happening on the ground. The individual […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3701fabc6ee355102da47927fc04888656c871d4",
      "title": "Netanyahu defends Gaza plans as Israel heavily criticised at UN Security Council",
      "url": "https://www.bbc.com/news/articles/c5yll33v9gwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T18:52:12.000Z",
      "summary_90w": "",
      "raw": "Israel's Prime Minister also claimed Israeli hostages held in Gaza were \"the only ones being deliberately starved\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6ed82490a397a97d5f033ddf6c314773e16d736",
      "title": "Stanford sticks with legacy admissions",
      "url": "https://techcrunch.com/2025/08/10/stanford-sticks-with-legacy-admissions/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-10T18:18:08.000Z",
      "summary_90w": "",
      "raw": "Stanford University has confirmed its admissions policies for fall 2026 will continue considering legacy status, a decision that could influence access to one of Silicon Valley’s most important talent pipelines. Stanford is also ending its test-optional policy, requiring SAT or ACT scores for the first time since 2021. According to the Stanford Daily, the university […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "615e95778343b72986b3a8815215add49b70ffbd",
      "title": "Three swimmers killed by sea mines in Odesa, Ukrainian media report",
      "url": "https://www.bbc.com/news/articles/c1mpp9127dro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T16:38:06.000Z",
      "summary_90w": "",
      "raw": "A local official confirmed the three had been killed by \"explosive devices\", at beaches where recreational swimming is banned.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe6c7ce90325a67bd27a5e6670771b6f6f05f0f0",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "summary_90w": "",
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb5f9ddfbfacf0f77e814e546b42a2017edd83cc",
      "title": "7 password managers to help keep your apps safe",
      "url": "https://www.theverge.com/tech/712968/7-password-managers-to-help-keep-your-apps-safe",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-10T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Passwords still seem to be the most popular method of ensuring that the right person is using the right app or service, despite the slow adoption of passkeys, which are considered more secure. And because we should be using different ones for each device and/or app, the best way to track all of them is to use a password manager.\nSome apps and operating systems come with their own password managers. For example, if you're part of the Apple ecosystem, you can use iCloud Keychain; Google users have Google Password Manager, and Microsoft devices store passwords through its Edge browser and Credential Manager. Some apps that offer their own pass …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35f5b7f5a08af746467e75b951d1769e913f63c0",
      "title": "Businesses can use your online data to overcharge you. What can customers do?",
      "url": "https://www.npr.org/2025/08/10/nx-s1-5494712/businesses-can-use-your-online-data-to-overcharge-you-what-can-customers-do",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-10T12:41:15.000Z",
      "summary_90w": "",
      "raw": "NPR's Adrian Ma speaks to Sam Levine, former director of the FTC's Bureau of Consumer Protection, now at UC Berkeley, about the use online data to charge some customers more for products and services.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "37229106b35fb26472f7634d97da9519799a05e2",
      "title": "After researchers unmasked a prolific SMS scammer, a new operation has emerged in its wake",
      "url": "https://techcrunch.com/2025/08/10/after-researchers-unmasked-a-prolific-sms-scammer-a-new-operation-has-emerged-in-its-wake/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-10T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Security researchers are now sounding the alarm on a new SMS text message fraud operation, which is surging in popularity — and its ability to steal people's credit cards — since the demise of its predecessor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "34270487e80eb609a59f83d75f10736f6de2c8e7",
      "title": "Israel protesters intensify pressure against plan to expand Gaza war",
      "url": "https://www.bbc.com/news/articles/c4ged13jjglo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T11:53:29.000Z",
      "summary_90w": "",
      "raw": "Meanwhile in Gaza, five people, including two children, died in the past 24 hours from malnutrition, the Hamas-run health ministry said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d33561c04a8a5a6dc79d30eafe31de3ea6baf4a2",
      "title": "Meteorite that hit home is older than Earth, scientists say ",
      "url": "https://www.bbc.com/news/articles/cwy003l0pw0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T11:28:54.000Z",
      "summary_90w": "",
      "raw": "Scientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74b35f94c13ce0e17916bd355794db3c2940082a",
      "title": "South Korea’s military shrinks by 20% as low birthrate hits recruitment",
      "url": "https://www.theguardian.com/world/2025/aug/10/south-korea-military-shrinks-by-20-per-cent-as-low-birthrate-hits-recruitment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T10:15:05.000Z",
      "summary_90w": "",
      "raw": "World’s lowest fertility rate leaves Seoul 50,000 troops short of maintaining defence readiness, report warns\nSouth Korea’s military has shrunk by 20% in the past six years, largely due to a sharp decrease in the population of men of enlistment age for mandatory service in the country with the world’s lowest birthrate, according to a report.\nThe sharp decline in the pool of men available for military service is also causing a shortfall in the number of officers and could result in operational difficulties, the defence ministry said in the report.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a40d925f087052e60ed2bef9ece495c7224e00e7",
      "title": "Ukraine's European allies say peace talks must include Kyiv",
      "url": "https://www.bbc.com/news/articles/c0e9py7e28xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T07:27:28.000Z",
      "summary_90w": "",
      "raw": "The White House says Trump is open to Ukraine joining talks with Putin on Friday, as Zelensky insists any deal without Kyiv is a “dead decision”.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c20c640234f7a0d262a467163917a00ff47c502e",
      "title": "North Korea removing propaganda loudspeakers in border areas amid efforts to ease tensions",
      "url": "https://www.theguardian.com/world/2025/aug/10/north-korea-removing-propaganda-loudspeakers-in-border-areas-amid-efforts-to-ease-tensions",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T03:38:12.000Z",
      "summary_90w": "",
      "raw": "Seoul dismantled its loudspeakers a week ago, and Pyongyang appears to be following suit as President Lee Jae Myung seeks to improve ties with North\nSouth Korea’s military has said North Korea has started dismantling some propaganda loudspeakers aimed at the South in parts of the border area, following similar moves by Seoul made in a bid to ease tensions.\nSouth Korea’s Joint Chiefs of Staff didn’t disclose the sites where the North Koreans were removing speakers and said further confirmation was needed as to whether the dismantling was taking place across all areas, adding it would continue monitoring related activities.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1435e42676c32f05642dc3db3fe3fecbfd52183c",
      "title": "Standing ovation as first female umpire for Major League Baseball takes to the pitch",
      "url": "https://www.bbc.com/news/articles/c62wg6djz35o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T00:04:33.000Z",
      "summary_90w": "",
      "raw": "Jen Pawol donated her hat to a baseball museum after her history-making game on Saturday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9ea741cd2d40531263faa6c451ba841f69a90de",
      "title": "France's last newspaper hawker gets Order of Merit from his old customer - President Macron",
      "url": "https://www.bbc.com/news/articles/cdx0vvpeq9wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T23:28:53.000Z",
      "summary_90w": "",
      "raw": "Ali Akbar has sold papers in Paris since 1973 and once counted President Macron among his customers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "424baed4d74787067b5fa955bd4e435e60e631ed",
      "title": "Mars rock found in Niger sells for millions in New York - now the country wants answers",
      "url": "https://www.bbc.com/news/articles/cly3q635n4no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T23:07:33.000Z",
      "summary_90w": "",
      "raw": "The West African country investigates how a space rock found there was put up for sale in New York.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "921a181cef5e79e6a31da788cef108f4b3788e27",
      "title": "Trump nominates ex-Fox News host Tammy Bruce as deputy UN ambassador",
      "url": "https://www.bbc.com/news/articles/cj9wv49xr0xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T21:07:54.000Z",
      "summary_90w": "",
      "raw": "Bruce, who is currently spokeswoman for the state department, has done \"brilliantly\" according to Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24a0933c7fe0d0ad55950247c065b72c8734a2c0",
      "title": "Atlanta police officer dies after shooting near health agency HQ",
      "url": "https://www.bbc.com/news/articles/cp3ekez0k2xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T20:17:00.000Z",
      "summary_90w": "",
      "raw": "Officials say the 30-year-old suspect may have been ill, or thought he was ill from a Covid vaccine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "018f3d29f9ef659dddf70d54b5c0a1a88ea232e9",
      "title": "Putin gives Trump envoy award for CIA official's son killed fighting in Ukraine",
      "url": "https://www.bbc.com/news/articles/c04rd19e5epo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T16:14:54.000Z",
      "summary_90w": "",
      "raw": "Michael Gloss, 21, who was killed in Ukraine last year, was the son of Juliane Gallina, a CIA deputy director,",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a71e48b0b412344057ba2bedb920a0931bd1470c",
      "title": "North Korea dismantles propaganda speakers at border",
      "url": "https://www.bbc.com/news/articles/cm2klzxldl6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T12:34:26.000Z",
      "summary_90w": "",
      "raw": "The move appears to be a positive reaction to overtures from the South's newly elected president.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b738ea59ed9d06875f61ea110fc61fe764a33fe",
      "title": "Bolsonaro supporters pray for Trump rescue as coup plot trial verdict nears",
      "url": "https://www.theguardian.com/world/2025/aug/09/bolsonaro-supporters-pray-for-trump-rescue-coup-plot-trial-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-09T09:00:02.000Z",
      "summary_90w": "",
      "raw": "Far-right ex-president’s devotees pin hopes on pressure campaign but tariffs and sanctions appear likely to fail\nEach morning, Edite Costa steps out of her bungalow on Brasília’s sun-baked savannah, stands beneath a mango tree and lifts her hands to the sky in prayer. “I ask God to work so that not just Trump but all Americans come to help us rip out the evil that has taken hold of the country I love,” said the 66-year-old Baptist, who is a fervent supporter of Brazil’s far-right former president Jair Bolsonaro.\nBolsonaro could face decades in jail for allegedly leading a murderous conspiracy to seize power after his leftwing rival Luiz Inácio Lula da Silva beat him in the 2022 presidential election. But Costa believes her populist leader can still be saved – if her prayers are answered and Donald Trump intervenes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6118adfb29d3a3ccc1cde04666492186d44a4219",
      "title": "We get asked about tariffs all the time. Here's what we say",
      "url": "https://www.npr.org/2025/08/09/nx-s1-5496262/trump-tariffs-economy-inflation",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "From inflation to recession, we who cover the economy and business at NPR get asked about tariffs all the time. Here are some of the most frequent questions — and what we answer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "89a4a2cd0034683e9fe7b507ccf8e6a1310a091c",
      "title": "Nagasaki mayor warns of nuclear war 80 years after atomic bomb attack",
      "url": "https://www.bbc.com/news/articles/ckgej5vw0w7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T05:02:32.000Z",
      "summary_90w": "",
      "raw": "Shiro Suzuki calls for a halt to armed conflicts on the anniversary of the atom bomb attack.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c82ceffe97ce62f532a3ba539f6fbd8feec581fa",
      "title": "Sheinbaum rejects US ‘invasion’ after Trump orders military to target Mexico cartels",
      "url": "https://www.theguardian.com/world/2025/aug/08/mexico-us-military-invasion-sheinbaum-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-09T04:40:17.000Z",
      "summary_90w": "",
      "raw": "Mexico’s president says ‘there will be no invasion … it’s absolutely off the table’ after news reports of order\nMexico’s president, Claudia Sheinbaum, has rejected the idea that the US might invade Mexico after news reports suggested Donald Trump had authorized the use of military force targeting drug cartels deemed terrorist organizations in Latin American countries.\n“The United States is not going to come to Mexico with their military,” she said during a daily news conference on Friday. “We cooperate, we collaborate, but there will be no invasion. It’s off the table, absolutely off the table.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c59ae5cdcee706c5c15bee697b5db5933d0e412",
      "title": "What happens when governments cook the books",
      "url": "https://www.npr.org/2025/08/08/1256971798/bls-bureau-labor-statistics-greece-argentina",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-09T02:48:51.000Z",
      "summary_90w": "",
      "raw": "After President Trump fired the head of the Bureau of Labor Statistics, economists and statisticians across the board were horrified. Because the firing raises the spectre of potential manipulation – and it raises the worry that, in the future, the numbers won't be as trustworthy.\nSo: we looked at two countries that have some experience with data manipulation. To ask what happens when governments get tempted to cook the books. And...once they cook the books... how hard is it to UN-cook them?\nIt's two statistical historical cautionary tales. First, we learn how Argentina tried to mask its true inflation rate, and how that effort backfired. Then, we hear about the difficult process of cleaning up the post-cooked-book mess, in Greece. \nFor more: \n - Can we just change how we measure GDP?\n - The price of lettuce in Brooklyn\n - What really goes on at the Bureau of Labor Statistics (Update)\n - Can we still trust the monthly jobs report? (Update)\n - How office politics could take down Europe\n - The amazing shrinking economy might stop shrinking\n\nListen free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.\nSupport Planet Money, get bonus episodes and sponsor-free listening and now Summer School episodes one week early by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "02e80473726c7dd983899e37717027b46faac4d6",
      "title": "Impersonators are targeting companies with fake TechCrunch outreach",
      "url": "https://techcrunch.com/2025/08/08/impersonators-are-targeting-companies-with-fake-techcrunch-outreach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-09T00:36:41.000Z",
      "summary_90w": "",
      "raw": "Fraudsters are impersonating TechCrunch reporters and event leads, and reaching out to companies. Here's what we're doing about it, and what you can look out for.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "87e0cb3806c43dd5fbc2c815f724788e794b20aa",
      "title": "Elon Musk's AI accused of making explicit AI Taylor Swift videos",
      "url": "https://www.bbc.com/news/articles/cwye62e1ndjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T23:06:01.000Z",
      "summary_90w": "",
      "raw": "Grok Imagine's \"spicy\" mode made explicit videos of Taylor Swift, according to The Verge and Gizmodo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "24d78adc945b45821504ccd5b38d16c9015c6e0d",
      "title": "Sam Altman addresses ‘bumpy’ GPT-5 rollout, bringing 4o back, and the ‘chart crime’",
      "url": "https://techcrunch.com/2025/08/08/sam-altman-addresses-bumpy-gpt-5-rollout-bringing-4o-back-and-the-chart-crime/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T21:06:30.000Z",
      "summary_90w": "",
      "raw": "The Reddit AMA got spicy as users peppered OpenAI with questions, and some asked the company to bring back its previous model.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cbe7856e19b5b650b0cba2aea05137b4b05be374",
      "title": "IRS Commissioner Billy Long replaced after less than two months",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5496549/irs-billy-long-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-08T20:18:04.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has replaced former Missouri Congressman Billy Long as IRS Commissioner, after less than two months on the job.  It's the latest in a string of management shakeups at the tax collection agency.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f15d46072d76650f324bbc501ec86b4112d6eee9",
      "title": "We've all gotten those hiring scam texts. Instead of deleting, this writer played along",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5494743/weve-all-gotten-those-hiring-scam-texts-instead-of-deleting-this-writer-played-along",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-08T20:17:22.000Z",
      "summary_90w": "",
      "raw": "Alexander Sammon received a suspicious job recruitment text from someone who claimed to be a hiring manager. He decided to play along to see how far the scam would go, and wrote about it for Slate.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed88e2512ba88fe1e9f84f263e99c9526ec46ac0",
      "title": "Top US diplomat in Brazil summoned to foreign ministry over Bolsonaro trial comments",
      "url": "https://www.theguardian.com/world/2025/aug/08/brazil-us-diplomat-summoned-social-media-post-jair-bolsonaro",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-08T20:07:12.000Z",
      "summary_90w": "",
      "raw": "US embassy accused supreme court judge of persecuting ex-president, currently on trial for alleged coup attempt\nBrazil’s foreign ministry has summoned the US chargé d’affaires after the embassy posted comments about the trial of former president Jair Bolsonaro, as relations between the two countries continue to deteriorate.\nOn Thursday, the embassy published a social media post in Portuguese criticising the supreme court justice Alexandre de Moraes, who is overseeing the cases against Bolsonaro, who is on trial over an alleged coup attempt.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0fb22e54a18f24dd540d8fc2bff6d1ed02ad1869",
      "title": "RIP, Microsoft Lens, a simple little app that’s getting replaced by AI",
      "url": "https://techcrunch.com/2025/08/08/rip-microsoft-lens-a-simple-little-app-thats-getting-replaced-by-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T19:41:19.000Z",
      "summary_90w": "",
      "raw": "Microsoft is killing Lens, a handy mobile scanning app with over 90 million downloads.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef8519d42dd623f5cd2fac9bf2553a14802ec08d",
      "title": "Former Googlers’ AI startup OpenArt now creates ‘brain rot’ videos in just one click",
      "url": "https://techcrunch.com/2025/08/08/former-googlers-ai-startup-openart-now-creates-brainrot-videos-in-just-one-click/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T19:01:21.000Z",
      "summary_90w": "",
      "raw": "OpenArt launched a new feature to help creators make AI-generated brain rot videos.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "36c22f38e17c779181cbd88e053db7f9b4c5ea18",
      "title": "Don’t let your competitor steal the brand spotlight — secure your exhibit table at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/08/dont-let-your-competitor-steal-the-brand-spotlight-secure-your-exhibit-table-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T17:45:00.000Z",
      "summary_90w": "",
      "raw": "For 20 years, startups have come to TechCrunch Disrupt to meet their first investors, land their biggest partnerships, and spark the idea that takes them to the next level.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7fb4b14d654156b2218aafbf0eb7e65d715306f3",
      "title": "Live at Edinburgh Fringe: Israel’s Gaza City Plan, JD Vance's Fishing Trip & Kemi's Cheating Confession",
      "url": "https://www.bbc.co.uk/sounds/play/p0lvyzrx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-08T17:29:00.000Z",
      "summary_90w": "",
      "raw": "Adam is joined by James Cook, Des Clarke and Ailbhe Rea live at Edinburgh Fringe!",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1ff5e3cbe13034c6eb1c8635d55ce58d3c3b309",
      "title": "NASA and Google are building an AI medical assistant to keep Mars-bound astronauts healthy",
      "url": "https://techcrunch.com/2025/08/08/nasa-and-google-are-building-an-ai-medical-assistant-to-keep-mars-bound-astronauts-healthy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T17:17:35.000Z",
      "summary_90w": "",
      "raw": "The multimodal tool, which includes speech, text, and images, runs inside Google Cloud’s Vertex AI environment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b31ffa9458da8e283f24f7a8ff59811aa6cbe22d",
      "title": "How to use Instagram Map and protect your privacy",
      "url": "https://techcrunch.com/2025/08/08/how-to-use-instagram-map-and-protect-your-privacy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T16:53:44.000Z",
      "summary_90w": "",
      "raw": "Following concerns about safety, Instagram head Adam Mosseri reassured users that the feature is opt-in, and noted that some people are “confused” about how the feature works.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "09db49576b6bc95ecf674b612004c5ae8fbea7c1",
      "title": "Trump calls for Intel boss to resign immediately, alleging China ties",
      "url": "https://www.bbc.com/news/articles/c70x6602pdyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T16:43:07.000Z",
      "summary_90w": "",
      "raw": "The unusual demand adds to challenges facing the firm, which has been seen as falling behind in the chip race.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "674c899a811b1ff322db1de57c2bd389964c97e5",
      "title": "Pinterest CEO says agentic shopping is still a long way out",
      "url": "https://techcrunch.com/2025/08/08/pinterest-ceo-says-agentic-shopping-is-still-a-long-way-out/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T16:33:18.000Z",
      "summary_90w": "",
      "raw": "Pinterest CEO Bill Ready talks about the agentic web and where the social network will fit in the AI era.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de6e17b3a9993694bd68883f5f64bec19e81a462",
      "title": "OpenAI priced GPT-5 so low, it may spark a price war",
      "url": "https://techcrunch.com/2025/08/08/openai-priced-gpt-5-so-low-it-may-spark-a-price-war/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T16:10:04.000Z",
      "summary_90w": "",
      "raw": "Developers who have had early access are touting GPT-5's pricing as much better than competing models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a3a741ef8b1375f1a9b01e3b742a0a82caabeb0",
      "title": "SoftBank reportedly bought Foxconn’s Ohio factory for the Stargate AI project",
      "url": "https://techcrunch.com/2025/08/08/softbank-reportedly-bought-foxconns-ohio-factory-for-the-stargate-ai-project/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-08T16:00:51.000Z",
      "summary_90w": "",
      "raw": "Foxconn spent years promising electric vehicles would be built at the former Chevy Cruze factory. Now it will make AI servers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a0cffe0b1719cb447d49291529b1e9b8f862e00",
      "title": "OpenAI beats Elon Musk's Grok in AI chess tournament",
      "url": "https://www.bbc.com/news/articles/ce830l92p68o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T11:37:19.000Z",
      "summary_90w": "",
      "raw": "The tournament saw models from Anthropic, Google, xAI and DeepSeek compete against each other to be crowned the top AI chess player.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8218ca6773bdba8b96d5ad6149c78567dd9be9d",
      "title": "Las Vegas sees drop in tourism, hinting at broader economic woes facing the U.S.",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492413/las-vegas-trump-summer-travel-decline",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-08T09:00:29.000Z",
      "summary_90w": "",
      "raw": "Economists say that what happens in Vegas matters nationally because it often reflects broader trends on consumer confidence and the overall health of the U.S. economy.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ffdfc5ab53f802deaebaeb7b58a9bd09e9f1e83",
      "title": "Trump opens the door for private equity in retirement plans",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5490047/trump-opens-the-door-for-private-equity-in-retirement-plans",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-08T08:13:31.000Z",
      "summary_90w": "",
      "raw": "An executive order from President Trump would extend the opportunity for 401k fund managers to include private equity in retirement portfolios. What are the risks and benefits?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "527f8f76888890f9006a32ef3b3f42d67e941604",
      "title": "How to get out of a love-hate relationship with your phone",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492392/phone-addiction",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Finding it hard to concentrate? Are you glued to social media for longer than you’d like? Well, maybe it’s not you… maybe it’s the phones.\n\nBrittany is joined by Magdalene Taylor, writer, cultural critic and senior editor at Playboy, and Fio Geiran, producer at TED Radio Hour and a writer of their Body Electric newsletter, to discuss this phrase: “it’s the phones.” They get into the effects that smartphones have on our brains and our culture, why some people are returning to “dumbphones,” and why it might take more than willpower to manage our relationships with our phones.\nClick here to check out the Body Electric newsletter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d0c82a425304e6c7b4051d62dd1a775edb573f3",
      "title": "Why are Texan Democrats on the run?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5r?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-08T06:00:00.000Z",
      "summary_90w": "",
      "raw": "Texas Republicans have voted for the arrest of dozens of Democratic legislators",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ecb6c69e01d0fc9179554bc4a3d17f24198c3777",
      "title": "Life-like robots for sale to the public as China opens new store",
      "url": "https://www.bbc.com/news/articles/cgm2jed7xvyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T04:58:20.000Z",
      "summary_90w": "",
      "raw": "Robots on sale at the store include humanoid butlers, chess partners and dogs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1f9673f0113254421ab14083f82fb80ecce702c",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "summary_90w": "",
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3a116098e95d5d8b862a9758d74ef9afaec1ce",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "summary_90w": "",
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10b63c981e5dcb79a30e0f479f1d96c7c3b1d3d7",
      "title": "US hunter reportedly killed by buffalo during expedition in South Africa",
      "url": "https://www.theguardian.com/world/2025/aug/06/hunter-killed-by-buffalo-south-africa",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T14:04:02.000Z",
      "summary_90w": "",
      "raw": "Asher Watkins, 52, of Texas died while tracking 1.3-ton Cape buffalo on a hunting trip in the country’s Limpopo province\nAn American game hunter was killed by a buffalo he was stalking during a hunting expedition in South Africa over the weekend, according to multiple reports.\nAsher Watkins, 52, of Texas, died on 3 August while tracking a 1.3-ton Cape buffalo in South Africa’s Limpopo province, according to a statement from Coenraad Vermaak Safaris (CV Safaris), the company that organized the hunting trip.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "690acb123904939b5719f42c39d3568c6f9c677f",
      "title": "It's 2025, the year we decided we need a widespread slur for robots",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5493360/clanker-robot-slur-star-wars",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People all over TikTok and Instagram are using the word \"clanker\" as a catch-all for robots and AI. Here's a deep dive into the origins of the pejorative and an explanation of why it's spreading.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb5fed10d4a083eb417cdeb5c2a39344a4c35a78",
      "title": "Nihilistic online networks groom minors to commit harm. Her son was one of them",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5479882/teen-forums-violent-extremist-grooming",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Dana's son was hospitalized last year, it led her to a path of discovery about predatory online networks that groom children into harming themselves and others. Their reach is global and growing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66ced3c97746b3b0d64269796bb661b6d428ffdd",
      "title": "So long, study guides? The AI industry is going after students",
      "url": "https://www.npr.org/2025/08/06/g-s1-81012/chatgpt-ai-college-students-chegg-study",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Students are increasingly using AI tools to help with — and do — their homework. Here's how older online study services, students and professors are adapting.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8945631f18016d4fdf50ff4c1677d71cb800d86",
      "title": "Drones delivering coffee? Trump administration wants more companies using UAVs",
      "url": "https://www.npr.org/2025/08/05/g-s1-81121/drones-uavs-trump-administration-faa-duffy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-05T21:36:55.000Z",
      "summary_90w": "",
      "raw": "The Trump administration wants to make it easier for companies to use drones for business — from delivering coffee to inspecting power lines to working on farms.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa9029f9ca90c7d2a4146d96935b09bd63c377ba",
      "title": "He said, she said, it said: I used ChatGPT as a couple's counselor. How did we fare?",
      "url": "https://www.npr.org/2025/08/05/nx-s1-5490447/ai-chatgpt-couples-therapy-advice",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-05T09:02:57.000Z",
      "summary_90w": "",
      "raw": "Looking for backup, I turned to an AI chatbot for relationship wisdom. It took my side. It was only when I challenged the bot's biases — and my own — that we had a communication breakthrough.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8c99c5c638c53b30027e9a9648b98e72b5ba5c9",
      "title": "The history behind the QR code",
      "url": "https://www.bbc.com/news/videos/c1jnpkdjjryo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:24:56.000Z",
      "summary_90w": "",
      "raw": "It's used by millions of us every day, but why was the Quick Response code invented?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f6f085dc83f2706ce197b2bf50c0458e326908b0",
      "title": "AI could widen the wealth gap and wipe out entry-level jobs, expert says",
      "url": "https://www.npr.org/2025/08/05/nx-s1-5485286/ai-jobs-economy-wealth-gap",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-05T08:08:27.000Z",
      "summary_90w": "",
      "raw": "A tech expert says AI is adapting faster than the economy can adapt, potentially eliminating entry-level jobs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b247f10f2df4bdf9312924806cdc968fb5a578c0",
      "title": "The Gulf bets big on AI as it seeks the 'new oil'",
      "url": "https://www.bbc.com/news/articles/cvg8z2mx508o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T23:14:44.000Z",
      "summary_90w": "",
      "raw": "The UAE and Saudi Arabia are partnering with the US to position themselves as AI hubs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d4dc5d0e31d716c7a5c39a97704e011c3dd830c",
      "title": "A legendary automotive dream, stalled by scandal and greed",
      "url": "https://www.bbc.co.uk/iplayer/episode/m000rqw8?at_mid=vO2HrMRESU&at_campaign=DeLorean_Back_from_the_Future&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m000vrth&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=DeLorean_Back_from_the_Future&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-07-29T22:41:04.000Z",
      "summary_90w": "",
      "raw": "John DeLorean's compelling story of corporate waste, fraud and an FBI sting",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d20c2ce25c13cec7ba044f41abd29d0618288f2e",
      "title": "Minister must apologise over Savile claim, says Farage",
      "url": "https://www.bbc.com/news/articles/cgery3eeqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T11:28:07.000Z",
      "summary_90w": "",
      "raw": "Minister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cc9359fecc24e9e22f350119da85d0276d2276e",
      "title": "Google launches new AI search feature in UK",
      "url": "https://www.bbc.com/news/articles/clyj4zky4zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T08:43:59.000Z",
      "summary_90w": "",
      "raw": "The new tool marks a significant change for the search giant but raises questions for advertisers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eae996235826ed15dcacb92d3f91925214082d88",
      "title": "Google failed to warn 10 million of Turkey earthquake severity",
      "url": "https://www.bbc.com/news/articles/c77v2kx304go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-27T23:16:50.000Z",
      "summary_90w": "",
      "raw": "The tech giant said only 469 serious warnings were sent out ahead of the 7.8 magnitude quake.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2918baae45081502be80f527615258dfc1e9622",
      "title": "EE says latest outage fixed after 'technical fault'",
      "url": "https://www.bbc.com/news/articles/cx2q8qw0q0go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-26T19:02:36.000Z",
      "summary_90w": "",
      "raw": "The mobile phone service provider says it carried out work overnight after customers reported problems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "278fde701c73890c407618dce62be561820d7e8a",
      "title": "Around 6,000 porn sites start checking ages in UK",
      "url": "https://www.bbc.com/news/articles/c24v4dl5r16o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-25T11:30:21.000Z",
      "summary_90w": "",
      "raw": "Despite the law some remain sceptical about the effectiveness of porn age checks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}