{
  "version": "1756234699058",
  "generatedAt": "2025-08-26T18:58:19.058Z",
  "items": [
    {
      "id": "60e8dae738be7c30f2c632445d7fe9643178a9f7",
      "title": "Framework is working on a giant haptic touchpad, Trackpoint nub, and eGPU for its laptops",
      "url": "https://www.theverge.com/news/766161/framework-egpu-haptic-touchpad-trackpoint-nub",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T18:46:19.000Z",
      "summary_90w": "",
      "raw": "Today, Framework announced the second-gen Framework Laptop 16 with two industry firsts: the first Nvidia graphics card upgrade you can perform at home in just a couple minutes, and the first complete 240W laptop charging solution over a USB-C cable.\nBut the company’s also revealing some intriguing upgrades that didn’t quite make the cut — including an extra-large haptic touchpad a la Apple’s MacBooks, and the company’s first external graphics module (eGPU). \nNot everything in the video below is actually coming to market, and some of it won’t be aimed at everyday consumers. Framework CEO Nirav Patel says he’s working to bring the fan-favorite ThinkPad Trackpoint nub to its keyboards, but keeps failing because the team can’t find a short enough nub that it doesn’t poke into the Laptop 16’s screen. \n\nBut he says a wide haptic touchpad is genuinely in development, one that won’t need the Framework Laptop 16’s modular spacers to give you a full-width palmrest. And if your main concern is just removing those spacers (I occasionally found the uneven surface annoying in my review), Framework says it’ll release 3D files so you can print your own full-width palmrest for the existing touchpad, in any color you like.\nHere’s a look at that 3D-printed one:\nFramework also says an eGPU is actually in development that uses the Framework Laptop 16’s GPU modules, but not as a consumer product. Patel says that would make it too expensive to fulfill the team’s main goal: “We want to make sure there is a pathway to reuse graphics modules coming out of the Framework Laptop 16, so they’re not sitting in a drawer or worse going out into a landfill somewhere.”\nSo it won’t look like the prototype you see below, but rather something targeted at makers, he says — perhaps we’ll have to 3D print the case for that one ourselves as well.\nPatel also says Framework’s One Key Modules for building your own custom keyboards are still in development — “we’re working hard to bring up the manufacturing yield so we can make it available at a reasonable price” — and expects he’ll be able to offer 64GB RAM modules before long. A transparent bezel for the Framework Laptop 16 didn’t make the cut because it turned out too brittle, though the team’s still looking for polycarbonate or resin blends that’d work better.\nAs for why it’s shipping a new Nvidia RTX 5070 graphics module with just 8GB of RAM, Patel says in a Q&A that’s how much is available with a mobile 5070, and that’s how much could fit into the current design, which only has space for four memory packages on the front.\nWhile they could have gone with a more powerful GPU, “we’d have to grow the thickness of the graphics module by putting them on both sides of the board,” which would increase the thickness of the graphics bay, which would increase the thickness of the laptop, among other adjustments. \n“For this generation, 5070 8GB is it,” says Patel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e13bec19b238ef4f1aa479d6abeacda6f9a07d9f",
      "title": "Anthropic settles AI book-training lawsuit with authors",
      "url": "https://techcrunch.com/2025/08/26/anthropic-settles-ai-book-training-lawsuit-with-authors/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T18:40:46.000Z",
      "summary_90w": "",
      "raw": "Called Bartz v. Anthropic, the case deals with Anthropic's use of books as training material for its large language models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d71b04b3771ea3d757906c617f767f0f66ad9a1c",
      "title": "Why the US government is not the savior Intel needs",
      "url": "https://techcrunch.com/2025/08/26/why-the-u-s-government-is-not-the-savior-intel-needs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T18:29:01.000Z",
      "summary_90w": "",
      "raw": "Intel doesn't need cash. Instead, the struggling semiconductor giant needs to figure out how to drum up interest for its foundry business.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "97ea99b384ebc7fa108ff055f087b3659350f8f7",
      "title": "Tributes paid to three helicopter crash victims",
      "url": "https://www.bbc.com/news/articles/cdd3jzl31j8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T18:25:50.000Z",
      "summary_90w": "",
      "raw": "Justyna Czoska, Wojtek Kowalkowski and Simon Hewitt died in the crash on the Isle of Wight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9c0401dff0a24496592e6599a9441bec7b2a27f",
      "title": "Libby’s library app adds an AI discovery feature, and not everyone is thrilled",
      "url": "https://techcrunch.com/2025/08/26/libbys-library-app-adds-an-ai-discovery-feature-and-not-everyone-is-thrilled/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T18:15:26.000Z",
      "summary_90w": "",
      "raw": "Libby launches \"Inspire Me,\" a genAI feature that helps its users find books to borrow from local libraries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c1df3d8fdb2df8b13c70114ca398f489c56ee8b",
      "title": "Teenager convicted over IS-inspired plot to attack Taylor Swift concert",
      "url": "https://www.theguardian.com/music/2025/aug/26/teenager-took-part-in-terror-plot-to-attack-taylor-swift-concert-court-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T18:15:20.000Z",
      "summary_90w": "",
      "raw": "Mohammad A, 16, given 18-month suspended sentence for helping plan foiled attack in Vienna\nA Berlin court has convicted a Syrian teenager of contributing to an Islamic State-inspired plot to attack a Taylor Swift concert in Vienna.\nThree dates in the US pop star’s record-breaking Eras tour were cancelled last summer after authorities learned of the plot.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f0d960759255126c9d9601b7af9f190b2e5c4a",
      "title": "Artwork looted by Nazis 80 years ago spotted in estate agent ad",
      "url": "https://www.bbc.com/news/articles/cq68dze2l71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T18:10:16.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady seen in house near Buenos Aires, more than 80 years after it was looted from a Jewish art dealer in Amsterdam.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0008ce6ff997920e58caaa0edbd3ca3eb34659b1",
      "title": "Ukraine admits Russia has entered key region of Dnipropetrovsk",
      "url": "https://www.bbc.com/news/articles/c17n1p24yv9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T18:08:25.000Z",
      "summary_90w": "",
      "raw": "Military says Russian advance \"is the first attack of such a large scale\" in industrial province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "238a72cc01adaa2fb37edb301bb6aece0d085cc4",
      "title": "France faces new political crisis as PM expected to lose confidence vote",
      "url": "https://www.theguardian.com/world/2025/aug/26/france-political-crisis-francois-bayrou-prime-minister",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T18:04:12.000Z",
      "summary_90w": "",
      "raw": "François Bayrou says he will ‘fight like a dog’ to stay in power but he appears almost certain to be toppled\nFrance is braced for another political crisis as the minority government of François Bayrou appears almost certain to be toppled in a confidence vote next month, amid deep political divisions over an unpopular austerity budget and debt-reduction plan.\n“I will fight like a dog,” the centrist prime minister told L’Express on Tuesday after his surprise decision to call a vote of confidence from parliamentarians.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says that the personal data of over 300 million Americans was copied to a private cloud account to allow access by members of the Department of Government Efficiency team.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74076ad734e8124bc84fc1c481f9d6bd60938343",
      "title": "Porepunkah shooting: police hunt ‘dangerous’ suspect who fled into bush after allegedly killing two officers ‘in cold blood’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T18:02:02.000Z",
      "summary_90w": "",
      "raw": "Victoria police believe alleged offender is heavily armed and urge local residents to stay indoors\n\nVictoria police shooting live updates\n\nWhat we know so far about the shooting in rural Australia\n\nA manhunt is under way after two Victorian police officers were “murdered in cold blood” and another wounded in a shooting at a rural property in the high country town of Porepunkah.\nThe Victorian police commissioner, Mike Bush, said the suspect – believed to be “heavily armed” – was still at large. Bush urged the wider community to stay indoors and said a “full deployment” was under way on Tuesday evening to find the suspect, who he described as “obviously a very dangerous person”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a98a8afd0638af06d93bc2ba57f93416fc1c13fb",
      "title": "Meta to spend tens of millions on pro-AI super PAC",
      "url": "https://techcrunch.com/2025/08/26/meta-to-spend-tens-of-millions-on-pro-ai-super-pac/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T17:59:39.000Z",
      "summary_90w": "",
      "raw": "Meta's new PAC signals an intent to influence statewide elections, including the next governor’s race in 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c430890616fdf6131b7dbb5e3bfc3a91da5d2cfd",
      "title": "US envoy sparks uproar after telling Lebanese journalists to ‘act civilised’",
      "url": "https://www.theguardian.com/world/2025/aug/26/syria-tom-barrack-lebanon-beirut-journalists",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T17:46:21.000Z",
      "summary_90w": "",
      "raw": "Reporters demand apology from Tom Barrack, US special envoy to Syria, after his remarks at Beirut press conference \nJournalists in Lebanon have demanded an apology from a senior US envoy after he told them to “act civilized” and not be “animalistic”.\nAs reporters shouted questions after the US delegation’s meeting with the Lebanese president, Joseph Aoun, on Tuesday, Tom Barrack, the US ambassador to Turkey and special envoy to Syria, stepped up to the podium in the packed room and said: “We’re going to have a different set of rules ... please be quiet for a moment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2c24327d656b0a0b2afa2be35c687783b4196912",
      "title": "Britain's Kartal & Boulter lose in testing US Open conditions",
      "url": "https://www.bbc.com/sport/tennis/articles/cy4d57v855wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T17:41:48.000Z",
      "summary_90w": "",
      "raw": "British pair Sonay Kartal and Katie Boulter are knocked out in the US Open first round as conditions heat up in New York.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19952da788fc24c89b1b6ca281a23bc24d739d3e",
      "title": "Teen avoids jail over plot to attack Taylor Swift Vienna concert",
      "url": "https://www.bbc.com/news/articles/crlz72l66pro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T17:39:09.000Z",
      "summary_90w": "",
      "raw": "Mohamed A will serve an 18-month suspended sentence after sending bomb-making instructions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61b4fe7ebbddc6e5b8a7271a021b79538043c615",
      "title": "How Liverpool wrestled Ngumoha away from Chelsea",
      "url": "https://www.bbc.com/sport/football/articles/cgjye1144l2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T17:35:05.000Z",
      "summary_90w": "",
      "raw": "Sixteen-year-old sensation Rio Ngumoha is the talk of English football after his last-minute winner for Liverpool, but why did he leave Chelsea?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "720b30119636aeb7de612a01b4938195bd33d442",
      "title": "DOGE uploaded live copy of Social Security database to ‘vulnerable’ cloud server, says whistleblower",
      "url": "https://techcrunch.com/2025/08/26/doge-uploaded-live-copy-of-social-security-database-to-vulnerable-cloud-server-says-whistleblower/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T17:30:30.000Z",
      "summary_90w": "",
      "raw": "The Social Security Administration's chief data officer has publicly blown the whistle, alleging DOGE put hundreds of millions of Social Security records at risk of compromise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0165db784506b5beff13eb4289676758fcfbc48f",
      "title": "Bruce Willis' wife Emma says he is in great health but brain is failing",
      "url": "https://www.bbc.com/news/articles/c4gzkp8nzy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T17:30:06.000Z",
      "summary_90w": "",
      "raw": "The Die Hard star's partner also says she hopes to advocate for fellow carers in her new book.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9d14d975f7c260ae2cde892e76e72c7d4dad576a",
      "title": "Russia could back delay to ‘snapback’ of nuclear sanctions against Iran",
      "url": "https://www.theguardian.com/world/2025/aug/26/iran-nuclear-sanctions-delay-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T17:16:38.000Z",
      "summary_90w": "",
      "raw": "Moscow willing to support six-month extension of deadline before punishments are reimposed, reports suggest\nRussia could back an extended six-month deadline for its ally Iran before European powers reimpose sweeping United Nations sanctions over Tehran’s refusal to allow UN inspectors back into nuclear sites after the Israeli-US assault in June.\nFrance, Britain and Germany – known as the E3 – have long threatened to trigger a “snapback” of sanctions at the UN security council before 18 October, when a largely defunct nuclear deal struck 10 years ago between Tehran and major powers expires.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e18c5a6d2d59cdc65527500158a42f820a4893e",
      "title": "Cook to sue Trump over order to fire her from Federal Reserve",
      "url": "https://www.bbc.com/news/articles/cx275n8gx0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T17:16:24.000Z",
      "summary_90w": "",
      "raw": "The central bank governor says the US president \"has no authority to do so\" in defiance of Trump's escalatory move against the Fed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "243d81deafd15068f55360a16e89e65b9d267eb9",
      "title": "CRKD’s $99 Peak Design clone is great for handhelds",
      "url": "https://www.theverge.com/reviews/765340/crkd-vortex-backpack-peak-design-handheld-gaming-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T17:10:33.000Z",
      "summary_90w": "",
      "raw": "Each handheld pocket features adequate room on the sides, and a layer of padding covering the screen area.\t\n\nEmbracer Group-owned CRKD recently launched a backpack, the $99.99 Vortex 1.0. During a recent vacation, I swapped it in place of my go-to for the past eight or so years, the 20-liter Peak Design Everyday backpack, which CRKD has thoroughly cribbed the look of. However, the Vortex has handheld gaming pockets, which helps it stand out, especially at this price.\nI generally like using the Peak Design backpack, except that bringing it on vacations means that I have to leave my handheld(s) at home. It's not wide enough to accommodate even the original Switch once things are stuffed into its side pockets. The Vortex 1.0, on the other hand, let m …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "51a47e7d2dae314e0942ece0a08503866d05459f",
      "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T17:00:03.000Z",
      "summary_90w": "",
      "raw": "Open letter has been signed by 209 former EU ambassadors, senior diplomatic staff and ambassadors from EU nation states\nThe UN says that Israel must not only investigate alleged unlawful killings in Gaza like the hospital strike that killed 20 people, including journalists, the previous day, but also ensure those probes yield results.\n“There needs to be justice,” United Nations rights office spokesman Thameen Al-Kheetan told AFP in Geneva, adding that the large number of media workers killed in the Gaza war “raises many, many questions about the targeting of journalists”.\nThe Israeli authorities have, in the past, announced investigations in such killings.\nIt’s of course the responsibility of Israel, as the occupying power, to investigate - but these investigations need to yield results.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adba6dd4ca8ba873356fd2414cb7895695d1a95e",
      "title": "Trump vs the Fed: Why this row could rattle the US economy",
      "url": "https://www.bbc.com/news/articles/clydvlx504eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T16:53:48.000Z",
      "summary_90w": "",
      "raw": "Trump says he will sack a US central bank governor. Why does the independence of the Fed matter?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "241dbdd67d476cbda040c0623106e2b953f867ed",
      "title": "Iran vows ‘reciprocal action’ against Australia after expulsion of ambassador",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/iran-vows-reciprocal-action-against-australia-after-expulsion-of-ambassador",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T16:37:31.000Z",
      "summary_90w": "",
      "raw": "Tehran rejects the accusation of orchestrating antisemitic attacks in Australia and says Anthony Albanese is ‘weak’\n\nGet our breaking news email, free app or daily news podcast\n\nIran has vowed to take “reciprocal action” after Australia expelled its ambassador over accusations that Tehran was behind antisemitic arson attacks in Sydney and Melbourne.\nAnthony Albanese said on Tuesday that the Australian Security and Intelligence Organisation (Asio) had “credible intelligence” to believe that the Iranian government was behind the attacks against the Adass Israel synagogue in Melbourne and Lewis’s Continental Kitchen in Bondi in Sydney last year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ca72b19cbda9c1d78ff4a31db2ace668fb25bfa",
      "title": "Israeli double strike on Gaza hospital - what we know",
      "url": "https://www.bbc.com/news/articles/c80d2zrdj7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T16:36:08.000Z",
      "summary_90w": "",
      "raw": "Netanyahu said it was a \"tragic mishap\" but did little to address the apparent \"double-tap\" nature of the attack, which killed 20 people including journalists and health workers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ca72b19cbda9c1d78ff4a31db2ace668fb25bfa",
      "title": "What we know after Israeli double strike on Gaza hospital",
      "url": "https://www.bbc.com/news/articles/c80d2zrdj7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T16:36:08.000Z",
      "summary_90w": "",
      "raw": "Netanyahu said it was a \"tragic mishap\" but did little to address the apparent \"double-tap\" nature of the attack, which killed 20 people including journalists and health workers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8526f5da1a3335cea98eec8bc641492e17d8550a",
      "title": "Not so fast: German court says Apple can’t call Watch carbon neutral",
      "url": "https://techcrunch.com/2025/08/26/not-so-fast-german-court-says-apple-cant-call-watch-carbon-neutral/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:35:27.000Z",
      "summary_90w": "",
      "raw": "Apple's carbon neutral claims are undermined by the short-term nature of carbon credits used to support them, the court said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b46d23784e045dd51db36dcbba31b85e1c664498",
      "title": "How Reform has changed the debate on migration",
      "url": "https://www.bbc.com/news/articles/c707g9rj9wqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T16:34:23.000Z",
      "summary_90w": "",
      "raw": "Labour's ideal way of combating Nigel Farage is by fixing the asylum system and stopping small boats - but the party's strategy is also changing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07bb09edba92472276cdec2e4ebcf6d69e4860cf",
      "title": "The wait is almost over: The 2025 Startup Battlefield 200 list drops tomorrow",
      "url": "https://techcrunch.com/2025/08/26/the-wait-is-almost-over-the-2025-startup-battlefield-200-list-drops-tomorrow/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:30:40.000Z",
      "summary_90w": "",
      "raw": "After reviewing thousands of groundbreaking applications from around the globe, we're just one day away from announcing the 2025 Startup Battlefield 200.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd59ac449ad6fc807458275c71f4afb4ec27201a",
      "title": "Reform prepared to deport 600,000 under migration plans",
      "url": "https://www.bbc.com/news/articles/c5yk4r5e514o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T16:25:51.000Z",
      "summary_90w": "",
      "raw": "The party outlines its plans to detain and deport all migrants who arrive in the UK on small boats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70c777a6eceabe96cd5b7767e123880374058fe4",
      "title": "Dish gives up on becoming the fourth major wireless carrier",
      "url": "https://www.theverge.com/report/766038/dish-echostar-spectrum-att-sale-fourth-carrier",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T16:14:42.000Z",
      "summary_90w": "",
      "raw": "Dish's parent company, EchoStar, is selling a broad swath of its 5G spectrum licenses to AT&T for $23 billion. Under the deal, the Dish-owned Boost Mobile will primarily operate using AT&T's growing network - a move that marks \"the end of the road for the fourth carrier,\" says Roger Entner, founder and lead analyst at Recon Analytics.\nAs part of T-Mobile's deal to acquire Sprint in 2019, the Department of Justice stipulated that another company must replace it as the fourth major wireless carrier. Dish came forward to acquire Boost Mobile from Sprint, paying $1.4 billion to purchase the budget carrier and other prepaid assets. Since then, D …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b017d5d2c44211870de5b5892b5ceffd39bfd7",
      "title": "Apple’s iPhone 17 launch event is set for September 9th",
      "url": "https://www.theverge.com/apple/766062/apple-iphone-17-launch-event-awe-dropping",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T16:12:16.000Z",
      "summary_90w": "",
      "raw": "Apple has announced the date of its next big event: September 9th, 2024, at 1PM ET / 10AM PT. The event, which has the tagline “Awe dropping,” will take place at the Steve Jobs Theater in Apple Park.\nThis is where we expect to hear more about the iPhone 17 lineup, which rumors (and at least one supposed public sighting) indicate will add a Google Pixel-like camera bar on the rear. It’s also another opportunity for Apple to talk about its Liquid Glass software revamp that’s part of iOS 26 and its other software updates, and the future of Apple Intelligence features like AI upgrades for Siri.\nThe star of the show could be a slim new 6.6-inch “iPhone 17 Air” model, which would have fewer camera lenses, but shave some thickness as part of a years-long approach by Apple to revamp the look and feel of its iPhones before it eventually adds a foldable version to the mix, and in 2027, a rumored 20th Anniversary iPhone with curved glass edges and slimmer bezels.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f889797d2d90133d024787285174c184cd5d343",
      "title": "Apple is holding its iPhone 17 event on September 9",
      "url": "https://techcrunch.com/2025/08/26/apple-is-holding-its-iphone-17-event-on-september-9/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:05:00.000Z",
      "summary_90w": "",
      "raw": "Along with the iPhones, Apple will likely have updated the Apple Watch Series 11, Ultra 3, and SE 3. The Apple Watch Ultra 3 would be a notable update amid the trio, with a bigger screen and faster charging support.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d72af010bf7be00a8a447229a6c87ab6abc4ba86",
      "title": "After falling behind in generative AI, IBM and AMD look to quantum for an edge",
      "url": "https://techcrunch.com/2025/08/26/after-falling-behind-in-generative-ai-ibm-and-amd-look-to-quantum-for-an-edge/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:04:02.000Z",
      "summary_90w": "",
      "raw": "As IBM and AMD look to regain ground after falling behind on the generative AI boom, the move could position them as key infrastructure players in a future where quantum and AI converge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b7f92d9f1caf3dad86569ffc1c0faa35baf15ae",
      "title": "EA&#8217;s free-to-play Skate revival hits early access in September",
      "url": "https://www.theverge.com/news/761186/ea-skate-free-to-play-early-access-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T16:00:00.000Z",
      "summary_90w": "",
      "raw": "More than three years after revealing “pre-pre-pre-alpha” footage of its new Skate title, EA has finally announced that the free-to-play live service game will be launching for everyone in early access on September 16th. \nThe game takes place in the city of “San Vansterdam,” where you can cruise around to find places to pull off tricks, take on challenges, or just hang out with your friends. Skate uses a rebuilt version of the “Flick-It” control system from the original Skate games, so if you’re familiar with the older titles, you should be able to jump right into the new version. And EA has built in a lot of social features into the new Skate, including the ability to drop things like ramps and rails right into the world that you and the other skaters nearby can use. Up to 150 skaters can be in a server at a time.\nYou’ll be able to buy in-game cosmetics for your custom skater from the in-game shop, though they’re optional and don’t provide any gameplay benefit. Like other free-to-play live service games, Skate will have seasonal content and its version of a battle pass with free and paid rewards. \nThe new Skate will be available on PS5, PS4, Xbox Series X / S, Xbox One, and PC, and it will support crossplay and cross-progression. A mobile version for iOS and Android is in development as well.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "edb4fdc4a5d6728183511835a5356b283a15d898",
      "title": "Google is building a Duolingo rival into the Translate app",
      "url": "https://www.theverge.com/news/765872/google-translate-ai-language-learning-duolingo",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google is putting AI-powered language learning tools into its Translate app. The new feature, rolling out now in beta, can create customized language lessons based on your skill level and your purpose for picking up a new language, such as vacationing in another country.\nFor now, Google Translate can only help English speakers practice Spanish and French, as well as help Spanish, French, and Portuguese speakers practice English. When you tap the new Practice button in the Google Translate app, you can select your skill level and describe your goal. You can also choose from preset scenarios, such as using the language for professional conversations, everyday interactions, talking with friends and family, and more.\n\nGoogle will then use its Gemini AI models to generate a lesson based on your response. If you tell Google that you have intermediate Spanish skills and want to communicate with your host family while studying abroad, Translate might create a recommended scenario to help you learn about meal times. From there, you can either practice speaking about the topic with Translate or listen to conversations and tap the words you recognize.\n“These exercises track your daily progress and help you build the skills you need to communicate in another language with confidence,” Matt Sheets, a product manager at Google, said during a press briefing. The setup sounds a bit similar to Duolingo, which also tailors lesson plans based on your skill level and goals.\nAdditionally, Google has launched a live translation feature in the Translate app, allowing you to have back-and-forth conversations with someone even if you don’t speak the same language. The feature translates your speech into your speaker’s preferred language by creating an AI-generated transcription and audio translation, and vice versa. Unlike live translation on the Google Pixel 10, the Google Translate app doesn’t try to make the AI-generated audio sound like your voice, but Sheets told reporters that the company is “experimenting with different options there.”\n\nLive translation is currently available to users in the US, India, and Mexico, and works in more than 70 languages, including Arabic, French, Hindi, Korean, Spanish, and Tamil.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e7c7996ca0d87e5387018742d880ca448a087988",
      "title": "Google Translate takes on Duolingo with new language learning tools",
      "url": "https://techcrunch.com/2025/08/26/google-translate-takes-on-duolingo-with-new-language-learning-tools/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Translate is also getting new live capabilities to make it easier to communicate in real time with a person speaking a different language.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "29c48700734afcd2750c5376198dfe5b0bd968f1",
      "title": "Botswana’s president declares health emergency over supply shortages",
      "url": "https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:57:33.000Z",
      "summary_90w": "",
      "raw": "Duma Boko announces urgent funding package for medicines to be distributed with military oversight\nBotswana’s president has declared a public health emergency due to shortages of essential medicines and equipment, as a downturn in the global diamond market and US aid cuts take a toll on the country’s finances.\nThe announcement came after the Ministry of Health suspended non-urgent surgeries on 4 August, stating that the country was short of medicines to treat hypertension, diabetes, cancer, asthma and eye conditions, as well as supplies including bandages and sutures and those for sexual and reproductive health.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "280a36919fc6cece180247b42d548ff763780a0d",
      "title": "DNC chair says he's tired of Democrats bringing 'pencil to a knife fight'",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5515631/dnc-democrats-ken-martin-trump-facism",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T15:43:53.000Z",
      "summary_90w": "",
      "raw": "Day 1 of the Democratic National Committee's summer meeting saw party chair Ken Martin detail how the party is pushing back on Trump administration policies and trying to win back voters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b9f14e3d531c2253001637b37288968183401de",
      "title": "YouTube’s ‘Hype’ feature that boosts smaller creators launches globally",
      "url": "https://techcrunch.com/2025/08/26/youtubes-hype-feature-that-boosts-smaller-creators-launches-globally/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T15:33:49.000Z",
      "summary_90w": "",
      "raw": "Viewers have the opportunity to hype up to three videos per week for a favorite creator. This gives the video points, which helps it gain traction on a new, ranked leaderboard.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d684f1c11632c9a322343361abe4657536a6b07",
      "title": "How one AI startup is helping rice farmers battle climate change",
      "url": "https://techcrunch.com/2025/08/26/how-one-ai-startup-is-helping-rice-farmers-battle-climate-change/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T15:21:19.000Z",
      "summary_90w": "",
      "raw": "Mitti Labs is working with The Nature Conservancy to expand the use of climate-friendly rice farming practices in India. The startup uses its AI to verify reductions in methane emissions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "798d73e0073ca196689bd18b7c78bd4ff4871766",
      "title": "Man told girls in Epping he wanted to 'have a baby', court hears",
      "url": "https://www.bbc.com/news/articles/ckgy00rdzk7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T15:18:01.000Z",
      "summary_90w": "",
      "raw": "Hadush Kebatu, an asylum seeker staying at The Bell Hotel in Epping, denies five charges against him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a841b5f6333bff6b8ef300a243268ada3465d5ca",
      "title": "Dyson’s 360 Vis Nav, our favorite robot vacuum for carpets, is half off",
      "url": "https://www.theverge.com/tech/765920/dyson-360-vis-nav-google-tv-streamer-4k-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T15:17:18.000Z",
      "summary_90w": "",
      "raw": "Dyson’s 360 Vis Nav is $500 off.﻿\t\n\nThe Dyson 360 Vis Nav is one of the most powerful robot vacuums out there. In fact, its 65 air watts of suction makes it the best option for carpets (even high pile) that we’ve tested yet. And, right now it’s half off at $499 at Amazon, Target, and directly from Dyson.\nDyson 360 Vis Nav robot vacuum\n\nWhere to Buy:\n\n $999.99 $499.99 at Amazon\n $999.99 $499.99 at Target\n $999.99 $499.99 at Dyson\n\nThe robovac’s long, fluffy roller brush looks identical to what comes with Dyson’s stick vacuums, and features three surfaces designed to pick up everything from large debris to fine dust while digging deep into carpet fibers. Combined with its square body, it’s capable of reaching into corners and edges far more easily than rounder rivals. It’s 3.9 inches tall, which is small enough to let it clean under most beds and sofas.\nUnlike most robot vacuum models at this price, the 360 Vis Nav lacks bells and whistles you might be looking for, like AI-powered obstacle avoidance and a self-emptying dock. Still, this is a robovac we’d recommend for homes with simpler floor plans. Its large 500ml dustbin means you shouldn’t need to empty it often, and its built-in handle makes it easy to do when you have to. We wish its battery lasted longer than just 65 minutes per charge, but if raw suction power is your number one priority for dealing with dirty, dusty carpets, what it lacks might become easier to overlook at this price.\nRead more in our hands-on impressions.\nA few more Verge-approved deals\nYou can buy the latest, ad-supported Kindle for $89.99 ($20 off) at Amazon, Best Buy, and Target, which is $5 shy of its all-time low price. The entry-level e-reader is a good, budget-friendly alternative to the pricier Kindle Paperwhite, offering the same sharp and bright 300ppi display (albeit a more pocket-friendly six inches compared to seven). It also offers USB-C support, long battery life, and good overall performance, though it doesn’t feature waterproofing and a display with an adjustable color temperature. \nThe Google TV Streamer 4K is on sale for around $84.99 ($15 off) at Amazon, Best Buy, and Walmart, which is also $5 off its best price to date. The set-top box is Google’s most complete streaming device yet, offering double the RAM and four times the storage of its predecessor. What really sets it apart is that it also works as a smart home hub with support for Matter and Thread, plus a built-in ethernet port for more reliable connectivity versus Wi-Fi. Read our review.\nYou can pick up the Anker 25W USB-C Wall Charger with a cable included for just $9.99 ($6 off) at Amazon and Anker (with code WSPDV272D1ST), which matches its best price to date. It’s nothing fancy, but the single-port charger delivers 25 watts, which is just enough power to quickly charge smartphones, tablets, earbuds —even the Nintendo Switch 2 — while being small enough not to block the neighboring outlet. It includes a cable, too.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e03f173ef3f11c9febe637a75a9d66e264331674",
      "title": "Iran has a long history of clandestine attacks abroad to further its ends",
      "url": "https://www.theguardian.com/world/2025/aug/26/iran-has-a-long-history-clandestine-attacks-abroad-to-further-its-ends",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:12:51.000Z",
      "summary_90w": "",
      "raw": "If Tehran was behind antisemitic attacks in Australia, experts say it is a sign of weakness rather than strength\nIran’s involvement in clandestine violence and espionage overseas takes many forms, but all have a single aim – to win advantage for Tehran by striking unexpectedly at the “soft underbelly” of enemies.\nIt’s a strategy that dates back to the 1979 revolution, and is rooted in a pragmatic if regretful assessment of Iran’s continuing weakness on the conventional battlefield.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6f344b7020b0dfa4aee775b2cf2c98c61b01ef07",
      "title": "Tesla rejected $60 million settlement in Autopilot case that ultimately cost it 4 times that amount",
      "url": "https://www.theverge.com/tesla/765907/tesla-rejected-60-settlement-in-autopilot-case-that-ultimately-cost-it-4-times-that-amount",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T15:05:22.000Z",
      "summary_90w": "",
      "raw": "Tesla rejected a $60 million settlement in the wrongful death case that ended up costing the company $243 million in punitive and compensatory damages, Reuters reported today, citing newly filed legal documents. \nThe proposal stemmed from a lawsuit filed by the families of the victims in a 2019 crash in which a Tesla Model S driver using Autopilot crashed into a parked vehicle, killing a woman and seriously injuring her boyfriend. The lawyers representing the families revealed the settlement offer as part of a request to the court to force Tesla to pay the families' legal fees. \nTesla rejected the settlement offer from the plaintiffs' lawy …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e2c54d679c96dda5d7ef7806bbf9c064db80928",
      "title": "Bye-bye barrel jack: Framework brings 240W USB-C charging to laptops",
      "url": "https://www.theverge.com/news/765542/framework-240w-usb-c-pd-charger-first-framework-16",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T15:05:00.000Z",
      "summary_90w": "",
      "raw": "Four and a quarter years ago, I told you how a USB-C cable could someday power all but the beefiest gaming laptops. Now, Framework is finally fulfilling the promise of 240 watts through a USB plug. Today, it’s opening preorders for the first standards-compliant 240W USB-C PD power adapter ever sold by a computer company. \nSince Framework also has the first laptop that can support 240W USB-C PD, it’s the latest way that Framework, a startup company, is leading the PC industry. It’s the only company that’s ever delivered on the promise of modular, upgradable laptops. Today, it also appears it’ll be the first to deliver “the holy grail” of upgradable laptop graphics cards, letting you swap its existing AMD Radeon RX 7700S for an Nvidia GeForce RTX 5070 — which also goes on preorder today.\nWhile Framework might have the first complete 240W USB-C power solution, it’s not technically the first 240W USB-C charger. We wrote about Delta’s beefy DP-240KB last November, and Ugreen put its multi-port Nexode 500W on sale this summer with a single 240W port in addition to four 100W ones (it tops out at 240W+100W+100W+60W = 500W, in case you’re curious).\nBut those three chargers are the only brand-name 240W USB-C PD power supplies I’m aware of, and I’ve only spotted a single no-name charger past that. Many companies advertising “240W” chargers are simply referring to a charger that can output 140W over one cable, plus 100W over another; true 48V@5A chargers are brand-new.\nFramework will be selling its charger for less than Delta and Ugreen. While the others cost $200 each, Framework CEO Nirav Patel tells us this one will be sold separately for $109, the same price as the 180W USB-C PD charger it originally shipped alongside the Framework Laptop 16. It only offers the one USB-C port, but both the power cable and the USB-C cable are still detachable, and the brick is quite compact — it isn’t that much bigger than the existing 180W charger, just a bit longer.\nFramework was actually the first company to ship a 180W PD charger, too, but it wasn’t quite enough to power and charge a fully kitted out Framework Laptop 16 at the same time while playing intensive games. The battery could sometimes drain while you play, and he says that won’t happen if you swap this charger in. \nDon’t expect it to give you more performance in games, though, at least not this year: The Framework Laptop 16’s new RTX 5070 graphics card is still rated for only 100W of power, like the AMD Radeon 7700S before it. That’s as much cooling and power as Framework was able to share with the GPU. \nYou will get an extra 240W capable charge port if you opt for the RTX 5070, though: the video card’s dedicated USB-C port now supports 240W of power and basic USB 2.0 functionality in addition to DisplayPort output, so you could maybe hack together a single-cable docking solution that way.\nRead more about the new laptop here; below, you’ll find my old video showing just how fast it truly is to swap a discrete GPU into the Framework Laptop 16.\n\n \n @verge \nEver seen a GPU upgrade in less than 2 minutes? We tried on prototype Framework Laptop 16. #gadgets #laptops #framework #gpu #tech #techtok \n ♬ original sound – The Verge",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37c82b18b5124167f471ee3a817462385e3e02e8",
      "title": "Framework is now selling the first gaming laptop that lets you easily upgrade its GPU — with Nvidia’s blessing",
      "url": "https://www.theverge.com/laptops/765528/framework-is-now-selling-the-first-gaming-laptop-that-lets-you-easily-upgrade-its-gpu-with-nvidias-blessing",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-26T15:05:00.000Z",
      "summary_90w": "",
      "raw": "Framework CEO Nirav Patel said he would deliver \"the holy grail for gamers\" with the Framework Laptop 16. In 2023, he suggested it'd be the first consumer notebook to fulfil the promise of modular, upgradable graphics cards like a desktop PC. We at The Verge were skeptical, because the last time we heard someone tell that story, it ended in lawsuits and forced arbitration. \nBut today, some eighteen months after shipping the Framework Laptop 16, the company has done what no laptop maker has done in modern memory, if ever: it's created a newer, faster discrete graphics card you can easily swap into its existing laptop.\nIn 2024, that laptop o …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "742641a2bec62b2996140d37bca13b21632d7bfb",
      "title": "The DOJ sued the federal district bench in Maryland. A judge just dismissed the case",
      "url": "https://www.npr.org/2025/08/26/g-s1-84215/doj-federal-district-judges-maryland",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T15:00:38.000Z",
      "summary_90w": "",
      "raw": "A district judge in Virginia was specially tapped to oversee the unusual case after DOJ named all 15 federal district court judges in Maryland as defendants in a lawsuit related to deportations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13bb056cc84f30e17e0a4e640d9fcb94eab26274",
      "title": "Guardian Essential poll: Australians split on recognising Palestine, many believe it would be purely symbolic",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/guardian-essential-poll-australians-split-on-recognising-palestine-many-believe-it-would-be-purely-symbolic",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:00:10.000Z",
      "summary_90w": "",
      "raw": "Poll also finds majority of Australians support a four-day work week and want more regulation of AI\n\nGet our breaking news email, free app or daily news podcast\n\nMore Australians back recognising a Palestinian state than oppose the move, but nearly half of voters think it will be purely a symbolic move that neither helps nor harms the prospect of a two-state solution.\nBut voters say they want more regulation on AI and are urging the Labor government to be ambitious in its reform agenda after the economic roundtable.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62d78b4e71277c6991dffc0b56589e8ab3354661",
      "title": "‘It’s a scary situation’: Australia’s Iranian diaspora fear reprisals against families",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/its-a-scary-situation-australias-iranian-diaspora-fear-reprisals-against-families",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:00:09.000Z",
      "summary_90w": "",
      "raw": "Although Iranian Australians welcome action against Tehran, many worry loved ones will pay a price back home\n\nGet our breaking news email, free app or daily news podcast\n\nIranian Australians have welcomed the expulsion of Iran’s ambassador to Australia even as some raised concerns that the move could leave family members stranded in Iran.\nThe prime minister Anthony Albanese announced the expulsion on Tuesday, saying the Australian Security and Intelligence Organisation (Asio) had “credible intelligence” to determine the Iranian government was behind the attacks against the Adass Israel synagogue in Melbourne and Lewis’s Continental Kitchen in Bondi in Sydney.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41ba35fa0abba3ef11a3662c8ea69bb1afd9be4c",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/26/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T14:40:40.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "48ca92576712a54b9a2c272601092402d4ced3c7",
      "title": "Poundland avoids administration as restructure approved",
      "url": "https://www.bbc.com/news/articles/cdd3j3g0e5no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T14:35:32.000Z",
      "summary_90w": "",
      "raw": "The struggling budget chain was sold to a private equity firm for £1 earlier this year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e17320fad430abdae30548694a4db83336bf3bdc",
      "title": "Parents sue OpenAI over ChatGPT’s role in son’s suicide",
      "url": "https://techcrunch.com/2025/08/26/parents-sue-openai-over-chatgpts-role-in-sons-suicide/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T14:27:34.000Z",
      "summary_90w": "",
      "raw": "Before sixteen-year-old Adam Raine died by suicide, he had spent months telling ChatGPT about his plans to end his life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "43a3ef9af2a8bbecbe56d7cbe23403421a47f319",
      "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
      "url": "https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T14:27:13.000Z",
      "summary_90w": "",
      "raw": "Dutch newspaper AD says it has traced Giuseppe Ghislandi’s Portrait of a Lady to house near Buenos Aires\nMore than 80 years after it was looted by the Nazis from a Jewish art dealer in Amsterdam, a portrait by an Italian master has been spotted on the website of an estate agent advertising a house for sale in Argentina.\nA photo shows the painting, Portrait of a Lady (Contessa Colleoni) by the late-baroque portraitist Giuseppe Ghislandi, also known as Fra’ Galgario, hanging above a sofa in the living room of the property, in a seaside town near Buenos Aires.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69d3e5599a33d5f60727ce2ffe85ee374576e816",
      "title": "US groups demand release of American-Palestinian teen imprisoned by Israel",
      "url": "https://www.theguardian.com/us-news/2025/aug/26/american-palestinian-teenager-israeli-prison",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T14:24:23.000Z",
      "summary_90w": "",
      "raw": "More than 100 organizations advocate for freedom of 16-year-old dual citizen detained for more than six months\nMore than 100 US human rights, faith-based and civil rights groups have demanded that the secretary of state, Marco Rubio, immediately secure the release of a 16-year-old dual American-Palestinian citizen who has been in an Israeli prison for six months over allegations of rock throwing.\nThe coalition, which includes the American-Arab Anti-Discrimination Committee (ADC), the Center for Constitutional Rights and Pax Christi USA, warned that Mohammed Zaher Ibrahim’s deteriorating health puts “his life on the line” and demanded urgent US intervention in the most significant organized pressure campaign on the imprisoned teenager’s case yet.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "099b269aa2b8be0b9a48c22c25641eb17ff2df60",
      "title": "Security researcher maps hundreds of TeslaMate servers spilling Tesla vehicle data",
      "url": "https://techcrunch.com/2025/08/26/security-researcher-maps-hundreds-of-teslamate-servers-spilling-tesla-vehicle-data/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T14:23:00.000Z",
      "summary_90w": "",
      "raw": "A security researcher mapped TeslaMate servers that are publicly exposed to the internet, including sensitive Tesla vehicle data, such as their locations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c16f63b475dbcb9d6c2b036eec3396264ffe1ef9",
      "title": "Skylight’s TikTok alternative adds community curators to the mix",
      "url": "https://techcrunch.com/2025/08/26/skylights-tiktok-alternative-adds-community-curators-to-the-mix/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T14:21:22.000Z",
      "summary_90w": "",
      "raw": "Skylight's TikTok alternative adds community curators, custom feeds, and live content.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55e74b1e297891b1f5f8da1fc1bffc31b8c2025b",
      "title": "Summer 2025 'almost certainly' UK's hottest on record",
      "url": "https://www.bbc.com/weather/articles/c1kz18d3wjro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T14:21:10.000Z",
      "summary_90w": "",
      "raw": "Provisional figures from the Met Office show that the UK is on course for its hottest summer on record with just a few days of the season remaining.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9e90d89d22f4e81b7728184fcae8d49a83aa16d",
      "title": "Work with partners on security guarantees ‘must be accelerated,’ Zelenskyy says - as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/26/donald-trump-putin-zelenskyy-france-meeting-europe-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T14:19:42.000Z",
      "summary_90w": "",
      "raw": "Specifics on Ukraine’s defence should be detailed ‘in near future’ as Finnish president says Russia deploying a ‘typical’ delaying tactic\nA combat drone, presumed to be Ukrainian, went off course and exploded over Estonia without causing any casualties, the Baltic state and close Ukraine ally said on Tuesday, AFP reported.\nPieces of the drone, which left a crater on crashing, were discovered by an agricultural worker near the south-eastern town of Tartu, 75 kilometres (45 miles) from the border with Russia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3790ad3ba214f31ba2405f6a0e4012c2c030dcb9",
      "title": "Meghan on who said 'I love you' first, and what she misses about UK",
      "url": "https://www.bbc.com/news/articles/cp94ly9x9y4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T14:06:17.000Z",
      "summary_90w": "",
      "raw": "The Royal Family don't get a mention in part two of Meghan's TV show, nor does the rift within it.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef86e0a11d89b3533e3bd94d6823919fc01afe54",
      "title": "Google Gemini’s AI image model gets a ‘bananas’ upgrade",
      "url": "https://techcrunch.com/2025/08/26/google-geminis-ai-image-model-gets-a-bananas-upgrade/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Google says that it's behind the anonymous AI image editor \"nano-banana\" that's been making waves on social media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b0d62128e36fc2fd737109c6e8807750b6e50df0",
      "title": "Instagram’s new feature helps college students connect with others on campus",
      "url": "https://techcrunch.com/2025/08/26/instagrams-new-feature-helps-college-students-connect-with-others-on-campus/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The launch comes a week after TikTok rolled out a nearly identical feature.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "69ff9af70c28943a65d1b88a1930e3cee27d1f1c",
      "title": "‘There needs to be justice,’ UN tells Israel after Gaza hospital bombing",
      "url": "https://www.theguardian.com/world/2025/aug/26/un-demands-investigations-into-gaza-hospital-killings",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T13:37:05.000Z",
      "summary_90w": "",
      "raw": "Human rights office demands that Israeli investigation into ‘double-tap’ attack that killed 20 people yields results\nThe UN has demanded that Israel’s investigations into unlawful killings in Gaza, including its “double-tap” bombing of Nasser hospital which killed 20 people, among them five journalists, yield results and ensure accountability.\n“There needs to be justice,” Thameen Al-Kheetan, the spokesperson for the UN’s human rights office, told reporters on Tuesday in Geneva. He added that the number of journalists killed in Gaza raised many questions about the targeting of media workers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b0341dfada64707b55d027510963ee56add8c26",
      "title": "France returns slain king's skull to Madagascar",
      "url": "https://www.bbc.com/news/articles/cwy0qejppp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T13:17:17.000Z",
      "summary_90w": "",
      "raw": "King Toera was killed by French troops 128 years ago and his head kept in a Paris museum's archive.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8db85fa1d772a918b83edbd72e0fee519d15eb03",
      "title": "US House committee requests Epstein 'birthday book' from his estate",
      "url": "https://www.bbc.com/news/articles/cd6n9g8x212o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T13:09:16.000Z",
      "summary_90w": "",
      "raw": "A panel investigating the disgraced late financier's crimes has subpoenaed an alleged file with notes from associates.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0493a52169925d8338098cb60c6303d79e7145e0",
      "title": "Eyebot gets $20M Series A to expand eye care access",
      "url": "https://techcrunch.com/2025/08/26/eyebot-gets-20m-series-a-to-boost-to-expand-eye-care-access/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T13:00:00.000Z",
      "summary_90w": "",
      "raw": "This vision care startup secures $20M Series A for 90-second prescription kiosk.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f7badb9d64a8ad4ae059b87ad5c730f20db991c2",
      "title": "Whatever happened to ... the optimist who thinks games and music can change the world",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/26/g-s1-84381/optimist-games-music-dance-hugs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T12:09:06.000Z",
      "summary_90w": "",
      "raw": "On a planet that can feel increasingly challenged, we asked activist Edgard Gouveia Jr. about his latest efforts to improve life on Earth, what \"artivism\" is — and what he dreams of.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd1d2edcba57030a4b539f643085242ec532591f",
      "title": "The French film star, the fake Irish aristocrat and the missing €7m",
      "url": "https://www.theguardian.com/world/2025/aug/26/dany-boon-french-film-star-the-fake-irish-aristocrat-thierry-fialek-birles-and-the-missing-euros",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T12:07:39.000Z",
      "summary_90w": "",
      "raw": "Trial to open in Nice of Thierry Fialek-Birles, accused of an ‘elaborate fraud’ against the actor and director Dany Boon\nOne of France’s most popular actors will have a starring role in court when a fake Irish aristocrat goes on trial accused of cheating him out of millions of euros.\nDany Boon, director and star of Bienvenue chez les Ch’tis (Welcome to the Sticks), France’s biggest box office hit, says an alleged conman, who claimed to be an Oxford-educated maritime lawyer, stole nearly €7m (£6m) from him as part of an elaborate scam.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d9b1750cb79f6d979bf54c46184d4acca50281c",
      "title": "Frontier buys $31M worth of antacids for the ocean",
      "url": "https://techcrunch.com/2025/08/26/frontier-buys-31m-worth-of-antacids-for-the-ocean/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The deal will require Planetary to remove 115,000 metric tons of carbon by increasing the alkalinity of water flowing into the sea.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e875477eb0d2cca77c60a736d3dd9f438d12e647",
      "title": "French PM fights for survival after calling for confidence vote. What happens now?",
      "url": "https://www.bbc.com/news/articles/c1le1m48mr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T11:48:22.000Z",
      "summary_90w": "",
      "raw": "Opposition parties say they will not back Prime Minister François Bayrou after a he called the vote over deep budget cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e875477eb0d2cca77c60a736d3dd9f438d12e647",
      "title": "French PM fights for survival as rivals refuse to support confidence vote",
      "url": "https://www.bbc.com/news/articles/c1le1m48mr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T11:48:22.000Z",
      "summary_90w": "",
      "raw": "Opposition parties say they will not back Prime Minister François Bayrou after a he called the vote over deep budget cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6981f93e672bc80da377487129f2e15f1fb0e1a7",
      "title": "Strictly star arrested on suspicion of rape",
      "url": "https://www.bbc.com/news/articles/cly3p58rm8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T11:35:20.000Z",
      "summary_90w": "",
      "raw": "The man was arrested on Friday and released on bail on Saturday, the Metropolitan Police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c91c2a2280d7f03e752d0f3d85b058a43b780e17",
      "title": "ICE detains Kilmar Abrego Garcia again. And, Trump seeks to fire Fed governor",
      "url": "https://www.npr.org/2025/08/26/g-s1-85284/up-first-newsletter-kilmar-abrego-garcia-fed-governor-lisa-cook-national-guard-dc",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T11:14:35.000Z",
      "summary_90w": "",
      "raw": "Kilmar Abrego Garcia has been taken into custody and faces deportation again, this time to Uganda. And, Trump seeks to fire a member of the Board of Governors of the Federal Reserve.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ba52451fd3389a1da2e1b5d8b98cbc4e94025bf",
      "title": "How plants and fungi trade resources without a brain",
      "url": "https://www.npr.org/sections/planet-money/2025/08/26/g-s1-85185/plants-fungi-resources-trade-cooperation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Fungi and plants have something to teach humans about global trade and cooperation",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ec9e2052892c42003b7f6a7dda8e55056a5cab5",
      "title": "Norway wealth fund sells Caterpillar stake over Israel allegations",
      "url": "https://www.theguardian.com/world/2025/aug/26/norway-wealth-fund-excludes-caterpillar-over-israel-allegations",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T10:26:53.000Z",
      "summary_90w": "",
      "raw": "World’s largest wealth fund says it has excluded bulldozer maker and five Israeli banking groups on ethics grounds\n\nBusiness live – latest updates\n\nThe world’s largest wealth fund has excluded Caterpillar, the construction equipment manufacturer, over Israel’s use of its bulldozers to destroy Palestinian property in Gaza and the West Bank.\nNorway’s $2tn (£1.5tn) fund said on Monday it had excluded Caterpillar and five Israeli banking groups on ethics grounds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e6f3ec10bb216c8fe217fffb84a782593083c85",
      "title": "Does the US president have the power to sack a Federal Reserve governor? ",
      "url": "https://www.bbc.com/news/articles/cedvj2d5538o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T10:01:15.000Z",
      "summary_90w": "",
      "raw": "President Trump takes aim at Lisa Cook, a central bank official - we unpack what it all means.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db9a7ef71959ca40d2a330f55f9fe5460a97272d",
      "title": "A lesson learned after pets were left behind in Hurricane Katrina: Save the animals",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5467727/hurricane-katrina-pets-animal-rescue-disaster",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T10:00:00.000Z",
      "summary_90w": "",
      "raw": "People were forced to leave their pets behind during Hurricane Katrina, creating an unprecedented animal welfare crisis that has shaped the country's disaster response ever since.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97841845a460ae5b1dfaa30a06db6ddec6087a45",
      "title": "'I was born to stand out': Ex-rugby star Heather Fisher on coping with sudden hair loss",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cvgnzkr40x5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T09:04:41.000Z",
      "summary_90w": "",
      "raw": "In a candid interview, World Cup winner Heather Fisher discusses losing her hair and the struggle she had with her identity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e92421f8c74690dc80117086a3ca329b013ee54",
      "title": "20 years after Hurricane Katrina, St. Bernard Parish is still recovering",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5480181/energy-star-trump-cost-climate-change",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T09:02:40.000Z",
      "summary_90w": "",
      "raw": "Hurricane Katrina flooded nearly every building in St. Bernard Parish near New Orleans in 2005. Twenty years later, the community is still rebuilding and flood protections encouraged some to return.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60f68c227a6b8e04082363ecb9bd7272182bc1af",
      "title": "20 years after Hurricane Katrina, the Lower Ninth Ward in New Orleans still lags behind",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5469875/hurricane-katrina-lower-ninth-ward-20-years",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T09:00:00.000Z",
      "summary_90w": "",
      "raw": "No neighborhood was hit worse in Katrina than New Orleans' Lower Ninth Ward and it's been one of the slowest areas to rebound. There's still an effort to attract new residents and businesses there.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e77b9142c6dd815ffa9d84da62d2a5df508e540",
      "title": "Judge orders Kari Lake to answer questions about Voice of America under oath",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5506283/judge-order-kari-lake-sworn-deposition-voice-of-america-oath-usagm",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T09:00:00.000Z",
      "summary_90w": "",
      "raw": "U.S. Judge Royce Lamberth ordered Trump administration official Kari Lake to be deposed about her plans for Voice of America, saying she was \"verging on contempt.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8b3b827741659ac860e1afe6a72b76000ff6ff8c",
      "title": "When hospitals and insurers fight, patients get caught in the middle",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/26/nx-s1-5515408/health-insurance-network-contract-price-legal-patients",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-26T09:00:00.000Z",
      "summary_90w": "",
      "raw": "About 90,000 people spent months in limbo as central Missouri's major medical provider fought over insurance contracts. These disputes between insurers and hospitals are a recurring problem.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09bcddb179507e57aece7ce434d18243f36e9d63",
      "title": "Manhunt under way after two police shot dead in rural Australian town",
      "url": "https://www.bbc.com/news/articles/ckge4555vpxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T08:54:58.000Z",
      "summary_90w": "",
      "raw": "Australian police say \"heavily armed\" man escaped into the bush after the shooting in Victoria state.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67b4206dd9ae58cfff36327b2b3e59e95d9f07d7",
      "title": "Rising egg prices push food inflation to 18-month high",
      "url": "https://www.bbc.com/news/articles/cly4eme0284o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T08:37:29.000Z",
      "summary_90w": "",
      "raw": "A survey says food inflation is at its highest level for 18 months, as the cost of staples grow.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6214e34245147e0ca4a21df80148315e39674f4",
      "title": "Australia accuses Iran of directing antisemitic attacks on cafe and synagogue",
      "url": "https://www.bbc.com/news/articles/c9d085n75q3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T08:12:42.000Z",
      "summary_90w": "",
      "raw": "Australia orders Iran's ambassador to leave the country following intelligence services' allegations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb390e11a421f2171036843f24ab880c40f5c6ae",
      "title": "What next for NFL's most controversial draft pick?",
      "url": "https://www.bbc.com/sport/american-football/articles/c1wd2qvw978o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T08:10:32.000Z",
      "summary_90w": "",
      "raw": "After a dramatic draft slide and a summer in the spotlight, rookie quarterback Shedeur Sanders now has the chance to prove his doubters wrong having survived the NFL’s cut-down day.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92522c09f27afa2b69aed492dc7d64474c6a2400",
      "title": "How to stop AI agents going rogue",
      "url": "https://www.bbc.com/news/articles/cq87e0dwj25o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T06:59:49.000Z",
      "summary_90w": "",
      "raw": "Agentic AI is taking decisions and acting on behalf of users, but how to stop that going wrong?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "52888fe257537e407cac231334f26df4916dcd6d",
      "title": "'When do we stop being immigrants?': Northern Ireland families ask after riots",
      "url": "https://www.bbc.com/news/articles/c9qydg327n2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T05:11:34.000Z",
      "summary_90w": "",
      "raw": "Some people who have moved to Northern Ireland say they struggle with people seeing them as outsiders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T04:59:10.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49159070f366c4515c975c6cba8fc2f78050be1f",
      "title": "South Korea's charm offensive and other takeaways from Trump meeting",
      "url": "https://www.bbc.com/news/articles/cy5pdlgl64zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T02:55:48.000Z",
      "summary_90w": "",
      "raw": "Ahead of Lee's White House visit, anxieties were bubbling in Seoul that the meeting could turn bitter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "946ee68edff0cb4e775b227a9906502f009c7174",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "url": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:28:08.000Z",
      "summary_90w": "",
      "raw": "Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents\nCambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "798961477467e02a8704390f56a6f1492a18e412",
      "title": "Protests erupt in Indonesia over privileges for parliament members and ‘corrupt elites’",
      "url": "https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:26:10.000Z",
      "summary_90w": "",
      "raw": "Controversy over housing allowance, which is almost 10 times minimum wage, comes amid President Prabowo Subianto’s austerity drive\nRiot police have fired water cannon and rounds of teargas at thousands of stone-throwing protesters in Indonesia’s capital as anger over the lavish allowances of parliament members has fuelled public anger.\nThousands of students, workers and activists demonstrated outside the nation’s parliament on Monday against a monthly housing allowance of 50 million rupiah ($US3,075) for MPs, which is almost 10 times the Jakarta minimum wage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c675c10d86b6836f58897097924f60393aac3b50",
      "title": "Trump says he hopes to meet Kim Jong-un and raises prospect of US taking over some South Korean land",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/trump-north-korea-kim-jong-un-lee-jae-myung",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T01:20:11.000Z",
      "summary_90w": "",
      "raw": "South Korean president Lee Jae Myung uses Oval Office meeting to encourage Trump to engage with North Korean leader\nDonald Trump has said he wants to meet North Korean leader Kim Jong-un, possibly this year, in an attempt to revive the failed nuclear diplomacy of his first term as US president.\n“I’d like to have a meeting. I look forward to meeting with Kim Jong-un in the appropriate future,” Trump said during an occasionally awkward meeting at the Oval Office with South Korea’s new president, Lee Jae Myung, in which he raised the prospect of taking ownership of South Korean land that hosts a US military base.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92f40831e0a32882c5b431bebc43f33e69fcbe76",
      "title": "Trump seeks to fire Fed governor Lisa Cook -- but a legal fight looms",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5517335/trump-federal-reserve-governor-lisa-cook",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T00:52:50.000Z",
      "summary_90w": "",
      "raw": "Trump says he's firing Cook after one of his allies accused her of making false statements on a mortgage application. Cook said the president has no authority to fire her and vowed to stay.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e4e5f049f702a8e2cb30c06aa9113fe143b89a86",
      "title": "Sitting up straight isn't the only secret to good posture - here are three more tips",
      "url": "https://www.bbc.com/news/articles/c890kejpg34o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T00:07:22.000Z",
      "summary_90w": "",
      "raw": "Here are Dr Xand's three suggestions on how to look after your back without turning into a statue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "01a33cb7def2ec94927cf11ccf83ddd4a4952d35",
      "title": "Piracy and armed robbery surge in the straits of Malacca and Singapore – report",
      "url": "https://www.theguardian.com/world/2025/aug/26/piracy-straits-of-malacca-singapore",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T23:46:01.000Z",
      "summary_90w": "",
      "raw": "In the first six months of this year there were 80 incidents of piracy and armed robbery in the strategic waterways\nIncidents of piracy and armed robbery in the straits of Malacca and Singapore have nearly quadrupled in the strategic waterways this year, according to a new report from an anti-piracy monitoring group.\nIn the first six months of this year there were 80 incidents of piracy and armed robbery in the straits, according to ReCAAP’s Information Sharing Centre (ISC). In the same period last year there were 21 incidents.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b13663ded255e05b8a8ad1b98d7cc5d54c26b22f",
      "title": "Founder of Mexico's Sinaloa cartel 'El Mayo' enters guilty plea",
      "url": "https://www.bbc.com/news/articles/c2eny8nz94vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T23:38:56.000Z",
      "summary_90w": "",
      "raw": "Ismael \"El Mayo\" Zambada was arrested in July 2024, and is due to be sentenced in the coming months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "017cd6a91f4e47f2e9aa6b6559a288732dad6bba",
      "title": "Lil Nas X pleads not guilty to four felony charges after LA arrest",
      "url": "https://www.bbc.com/news/articles/cly4ey0nm7xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T23:05:34.000Z",
      "summary_90w": "",
      "raw": "The rapper, whose legal name is Montero Lamar Hill, was detained last week while wandering the streets in his underwear.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f258f4951c54d3bb13e470909a3ddf06838f7e74",
      "title": "Taiwan is preparing for a Chinese attack but its people don't think war is coming soon",
      "url": "https://www.bbc.com/news/articles/cp94v42gmg9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T22:07:21.000Z",
      "summary_90w": "",
      "raw": "Leaders are strengthening its defence, but most Taiwanese believe it is unlikely China will invade soon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f4997fc66c36fa7d9c72adcce835f06fa68e6a2",
      "title": "Trump again calls for FCC to revoke ABC and NBC licenses",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515480/fcc-abc-nbc-reviews",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T21:28:48.000Z",
      "summary_90w": "",
      "raw": "President Trump lashed out on social media late Sunday against ABC and NBC, putting the nation's top broadcast regulator once more at the center of his culture wars.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "294862dbf06c9961d2f464e5728b1f3e64131420",
      "title": "First human case of flesh-eating screwworm parasite confirmed in US",
      "url": "https://www.bbc.com/news/articles/c4geyg55jvyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T21:10:48.000Z",
      "summary_90w": "",
      "raw": "New World screwworm myiasis was found in a patient who returned to the US from El Salvador, authorities say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d9fa43385b638c3e220298dba8767c395f32739",
      "title": "'How will I pay workers?': Indian factories hit hard by Trump's 50% tariffs ",
      "url": "https://www.bbc.com/news/articles/c98lr56mznjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T21:03:03.000Z",
      "summary_90w": "",
      "raw": "BBC correspondents visit export hubs across India to assess how steep US tariffs are impacting business owners.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adb2ab4a2eeb3f2f056e5ca66b1f6b289de5497e",
      "title": "Five journalists among 20 killed in Israeli double strike on hospital",
      "url": "https://www.bbc.com/news/articles/cp89rp48246o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T18:31:54.000Z",
      "summary_90w": "",
      "raw": "Israeli Prime Minister Benjamin Netanyahu said it was a \"tragic mishap\" and promised a \"thorough investigation\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c39cdd06a6f18a8cc8daf774d23c06bbe54ed240",
      "title": "Mexican drug lord ‘El Mayo’ pleads guilty to racketeering in New York",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/ismael-zambada-el-mayo-pleads-guilty",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T17:44:40.000Z",
      "summary_90w": "",
      "raw": "Ismael Zambada was co-founder of Sinaloa cartel led by Joaquín ‘El Chapo’ Guzmán, now imprisoned in US\nThe Mexican drug lord Ismael “El Mayo” Zambada, co-founder of the Sinaloa cartel, pleaded guilty to federal racketeering charges as well as running a criminal enterprise on Monday, more than a year since he was arrested in Texas after what has been described as a kidnapping.\n“I recognize the great harm illegal drugs have done to the people in the United States and Mexico,” the 77-year-old Zambada said in court through a Spanish-language interpreter. “I apologize for all of it, and I take responsibility for my actions.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2971c699415ed15c5cdf7d4505b4ac817df2009",
      "title": "Evergrande's delisting in Hong Kong: key facts to know",
      "url": "https://www.npr.org/2025/08/25/g-s1-85108/evergrandes-delisting-in-hong-kong-key-facts-to-know",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T17:33:16.000Z",
      "summary_90w": "",
      "raw": "At its peak, China Evergrande Group was worth more than $50 billion. But it all came crashing down in 2021. It was massively in debt and unable to complete some existing projects.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3a22103904e4ab5141476396556042a9ff1ba228",
      "title": "Dr Pepper will unwind its merger with Keurig after buying Peet's for $18 billion",
      "url": "https://www.npr.org/2025/08/25/g-s1-85104/dr-pepper-keurig-peets-purchase-merger-split",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T17:25:05.000Z",
      "summary_90w": "",
      "raw": "Seven years after they merged, the soft drink maker and coffee pod innovator will become separate companies again. CEO Timothy Cofer said separate coffee and beverage businesses would be more nimble.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bac805cbe62083c90db2b7c5859b88650b7bd69",
      "title": "First human case of flesh-eating screwworm parasite confirmed in US",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/new-world-screwworm-flesh-eating-parasite-case-us",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T14:32:35.000Z",
      "summary_90w": "",
      "raw": "HHS told Reuters patient had returned from El Salvador but beef industry said person had traveled from Guatemala\nThe US Department of Health and Human Services (HHS) on Sunday reported the first human case in the US of travel-associated New World screwworm, a flesh-eating parasite, from an outbreak-affected country.\nThe case, investigated by the Maryland department of health and the US Centers for Disease Control and Prevention (CDC), was confirmed by the CDC as New World screwworm on 4 August – and involved a patient who returned from travel to El Salvador, an HHS spokesperson, Andrew G Nixon, said in an email to Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a54cf198a490aa3d6eb1663a671a41cef7de9a31",
      "title": "South Korean President Lee to meet with Trump in Washington on Monday",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5508133/south-korean-president-lee-to-meet-with-trump-in-washington-on-monday",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T09:00:44.000Z",
      "summary_90w": "",
      "raw": "At a summit meeting in Washington, D.C., on Monday, the U.S. and South Korean presidents will discuss modernizing their 71-year-old alliance and fleshing out a trade deal reached last month.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "33638615ee5a7d640d1b8731c6fb89766c9aa401",
      "title": "Jerry Adler, who starred in The Sopranos, dies aged 96",
      "url": "https://www.bbc.com/news/articles/c36jyp6w32go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T02:46:58.000Z",
      "summary_90w": "",
      "raw": "Adler started acting in his early 60s, after some 30 years working behind the scenes on Broadway.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da15ba58ea49119d72bffaf4e120d89ad747e6fe",
      "title": "Chinese property giant Evergrande delisted after spectacular fall",
      "url": "https://www.bbc.com/news/articles/c14g7r44566o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T01:03:35.000Z",
      "summary_90w": "",
      "raw": "The embattled property giant's shares were taken off the Hong Kong stock market on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a4d86aea6b0adb621b5b2441704f7fa4cbb94f5",
      "title": "France summons US envoy over antisemitism claims ",
      "url": "https://www.bbc.com/news/articles/cq58102wz47o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T00:13:00.000Z",
      "summary_90w": "",
      "raw": "France denies allegations it is failing to tackle a surge in antisemitism since the Gaza war began.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f51708a44d29bd0ba7d00bb5c5c0937611cac5a",
      "title": "Trump threatens to deploy troops to Baltimore to 'clean up' crime",
      "url": "https://www.bbc.com/news/articles/c78mymx7mpko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T21:58:09.000Z",
      "summary_90w": "",
      "raw": "The deployment of military for domestic law enforcement has drawn backlash from Democrats, with one governor calling it an \"abuse of power\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8bd5dece6874316ca38670fb1c3d739c9b851183",
      "title": "Inside Donetsk as residents flee attacks on Ukrainian region Putin wants to control",
      "url": "https://www.bbc.com/news/articles/c209yn1ygz6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T21:04:11.000Z",
      "summary_90w": "",
      "raw": "Quentin Sommerville follows volunteers carrying out evacuations in eastern Ukraine as drone attacks rage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc0f3de2121be64e6162b8b1456ff89c521803e7",
      "title": "Israel hits Yemen's Houthis after reports group used cluster bomb",
      "url": "https://www.bbc.com/news/articles/c0kzy7r8pl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T20:07:58.000Z",
      "summary_90w": "",
      "raw": "The strikes come after Israel said the Houthis used cluster munitions in a missile fired at Israel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "915159ad7a01a9d27496a3e64d3ddc11bc2fb0fe",
      "title": "More than 500,000 ordered to evacuate as typhoon heads for Vietnam",
      "url": "https://www.bbc.com/news/articles/cx2pw5ypwqeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:34:38.000Z",
      "summary_90w": "",
      "raw": "Typhoon Kajiki is brushing past Hainan in China before heading for Vietnam, forecasters say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "375e731d410021cae7f576bcb0656c8fab38d147",
      "title": "Three sisters drown in migrant boat in Mediterranean, rescuers say",
      "url": "https://www.bbc.com/news/articles/cp89rqgjq1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:26:21.000Z",
      "summary_90w": "",
      "raw": "There was \"sheer horror\" when survivors realised that the girls aged nine, 11 and 17 had died, a rescuer says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8b96070861800207cfbc7f605b3e993a93b59a2",
      "title": "Canada's retaliatory tariffs have left the U.S. wine industry reeling",
      "url": "https://www.npr.org/2025/08/24/nx-s1-5502688/canadas-retaliatory-tariffs-have-left-the-u-s-wine-industry-reeling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-24T12:51:55.000Z",
      "summary_90w": "",
      "raw": "NPR's Ayesha Rascoe talks to Joan Kautz of Ironstone Vineyards, a winery in California, about the impact of Canadian tariffs on the U.S. alcohol industry.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ccf43e57e6760a9a854e93fad8d0c5364d8d4493",
      "title": "Israel pounds Gaza City in preparation for planned offensive",
      "url": "https://www.bbc.com/news/articles/cvg478y8l09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T12:18:44.000Z",
      "summary_90w": "",
      "raw": "Sixty-four people were killed in Israeli attacks across Gaza in the past 24 hours, the territory's Hamas-run health ministry said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5795c618e230224998fd210f35a94a572ac3085",
      "title": "Taiwan referendum on reopening last nuclear plant fails",
      "url": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T05:17:03.000Z",
      "summary_90w": "",
      "raw": "Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe\nA referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved.\nThe plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a06a17b45576aba1d545f922a7ee74b9bc40633",
      "title": "Boxed in by shifting tariff rules, European shippers pause some U.S.-bound parcels",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513936/dhl-parcel-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-23T22:21:20.000Z",
      "summary_90w": "",
      "raw": "New customs regulations take effect August 29, and many European postal agencies and companies say until new systems are set up they can't ship some goods. Gifts worth less than $100 are not affected.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8e6575dd0308f9f931cf4375d96a87e4d375f2b",
      "title": "Pentagon fires intelligence agency chief after Iran attack assessment",
      "url": "https://www.bbc.com/news/articles/c2dj217z2w6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T16:24:47.000Z",
      "summary_90w": "",
      "raw": "The firing comes just weeks after a White House rebuke of a leaked intelligence report assessing the impact of US strikes on Iran.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf9b5982589166623a19906f5fb5dd66ad1ac94c",
      "title": "Trump administration halts work on an almost-finished wind farm",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513919/trump-stops-offshore-wind-renewable-energy",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-23T15:38:19.000Z",
      "summary_90w": "",
      "raw": "The Revolution Wind farm was slated to start sending power to homes and businesses in Rhode Island and Connecticut starting next year.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e85a38f37708c91cd8de79467d795f433ad1bb1",
      "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump",
      "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:02:17.000Z",
      "summary_90w": "",
      "raw": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain\nCanada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States.\nFrom 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "229e5ba5d2982b5f1832044ba1d34d963fb76fa9",
      "title": "Thousands face deportation to danger as Trump targets temporary protections",
      "url": "https://www.theguardian.com/us-news/2025/aug/22/temporary-protected-status-tps-immigration-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:00:34.000Z",
      "summary_90w": "",
      "raw": "People with temporary protected status face possible deportation even though their home countries – including Afghanistan and Haiti – remain unsafe\nMany thousands of immigrants living in the US who came from certain countries regarded as risky or dangerous are at the mercy of US judges and the Trump administration’s agenda to slash their work authorization and protection from deportation.\nSince taking office, the Trump administration has announced the termination of temporary protected status (TPS) for citizens of seven of the 15 countries previously designated for shelter under this legal umbrella – with the Department of Homeland Security (DHS) controversially citing improved conditions in some of those places.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b2c5d6d0908d4a6f91069746af4fa65f34b8ddc",
      "title": "South African minister investigated for historical racial slurs on social media",
      "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:15:35.000Z",
      "summary_90w": "",
      "raw": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts \nSouth Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid.\nMcKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts, which were still online at the time of publication.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b38db653133c2cddb3c03eed60e6986a6ed3df51",
      "title": "Brain surgeon Henry Marsh shares the truth about his job",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002hfbw/confessions-of-a-brain-surgeon?at_mid=dF7bqxPiBd&at_campaign=Confessions_of_a_Brain_Surgeon&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002hfbw&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Confessions_of_a_Brain_Surgeon&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-18T20:59:55.000Z",
      "summary_90w": "",
      "raw": "Brain surgeon Henry Marsh reveals the truth about this high-risk job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}