{
  "version": "1757351675936",
  "generatedAt": "2025-09-08T17:14:35.936Z",
  "items": [
    {
      "id": "ea9edcf3fd1240b099a937327867b08963a62991",
      "title": "How to watch Apple announce the iPhone 17",
      "url": "https://techcrunch.com/2025/09/08/how-to-watch-apple-announce-the-iphone-17/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:05:42.000Z",
      "summary_90w": "",
      "raw": "Apple is debuting the iPhone 17 at its annual hardware event on September 9.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8bb8fd1141433834a06e4b7ebe5fbdc644cbacd3",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/08/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:00:47.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7834a30d0ed275f815ce16127360611953385b5c",
      "title": "Google admits the open web is in ‘rapid decline’",
      "url": "https://www.theverge.com/news/773928/google-open-web-rapid-decline",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T16:50:20.000Z",
      "summary_90w": "",
      "raw": "For months, Google has maintained that the web is “thriving,” AI isn’t tanking traffic, and its search engine is sending people to a wider variety of websites than ever. But in a court filing from last week, Google admitted that “the open web is already in rapid decline,” as spotted earlier by Jason Kint and reported on by Search Engine Roundtable.\nGoogle submitted the filing ahead of another trial that will determine how it will address its monopoly in the advertising technology business. The US Department of Justice recommends that Google break up its advertising business, but the company argues in the filing that this isn’t ideal because it would “only accelerate” the decline of the open web, “harming publishers who currently rely on open-web display advertising revenue.”\nThe statement sharply contrasts Google’s recent narrative about the health of search on the web. Google has a clear incentive to make itself appear weaker or less monopolistic in the courtroom, but its admission reflects a reality many publishers are going through. Several digital publishers and independent website owners have reported experiencing a decline in traffic following changes to Google Search’s algorithm and the rise of AI chatbots. \nWhen asked about these concerns during an episode of Decoder in May, Google CEO Sundar Pichai said the company is “definitely sending traffic to a wider range of sources and publishers” following the rollout of AI search tools. \nNick Fox, Google’s senior vice president of knowledge, similarly defended Google against claims that changes to search are impacting web traffic. “From our point of view, the web is thriving,” Fox said on an episode of the AI Inside podcast. In the wake of a report from Pew Research, which said people are “less likely” to click on links when presented with Google’s AI Overview, Google Search head Liz Reid claimed that click volume has remained “relatively stable” when compared to the same time last year, adding that Google continues to “send billions of clicks to websites every day.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ceb13d3ec698d1c186dbc9585532a30614ae9a4",
      "title": "New Banksy mural appears at Royal Courts of Justice",
      "url": "https://www.bbc.com/news/articles/cgrq0r0y878o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T16:50:08.000Z",
      "summary_90w": "",
      "raw": "The artwork, which shows a judge hitting a protester with a gavel, was confirmed by the elusive street artist.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd7e90fb966332f5f805b60b07148863dc561793",
      "title": "Europe live: Macron labelled ‘a defeated president’ as his PM faces no-confidence vote",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:46:23.000Z",
      "summary_90w": "",
      "raw": "Socialist Boris Vallaud launched blistering attack on Macron and says Bayrou’s decision to call a no-confidence vote is ‘a cop-out’\nAnd over in Brussels, EU diplomats have been briefing journalists that the European Commission is expected to propose a 19th package of sanctions against Russia by Friday, Reuters said.\nThe EU has stepped up its listings and is no longer shying away from larger entities in third countries, and it could list banks in two central Asian countries too, they said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a9f0d6bdc396603d6d7290b6a9cfa4832fc35e9",
      "title": "‘Leave now,’ Netanyahu tells Gaza City residents as he says Israeli forces readying for ground ‘manoeuvre’ – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:44:19.000Z",
      "summary_90w": "",
      "raw": "Israeli PM says to people in devastated city ‘you have been warned’\n\nSam Jones is Madrid correspondent for the Guardian\nSpain’s prime minister, Pedro Sánchez, has stepped up his scathing criticism of Israel’s actions in Gaza, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8ffabc41a1ce9e91f468dc28e2cd39800eb6703",
      "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
      "url": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:44:16.000Z",
      "summary_90w": "",
      "raw": "President touted contest in Buenos Aires province – 40% of electorate – as ‘life or death battle’ but won only 34% of vote\nArgentina’s president, Javier Milei, has suffered his worst electoral defeat since taking office, as he faces his administration’s most serious corruption scandal and signs that the economy is slowing.\nIn local legislative elections on Sunday for Buenos Aires province – home to almost 40% of the country’s electorate – the coalition led by the self-styled anarcho-capitalist was beaten by the opposition by 47% to 34%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "affc98b04ef13304a45dfc6cb339d302c5694541",
      "title": "Great North Run medals show wrong city and river",
      "url": "https://www.bbc.com/news/articles/c4gq2gdlnygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T16:38:43.000Z",
      "summary_90w": "",
      "raw": "Medals given to participants use an image of Sunderland, which has no connection to the event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "What's behind France's political crisis and what could happen next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T16:18:44.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has called a confidence vote on himself, and is expected to lose.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b5c740ab8e89c7f89c1e9b61b95f5339f9e2ce0",
      "title": "Trump asks Supreme Court to allow billions in foreign aid cuts",
      "url": "https://www.bbc.com/news/articles/c237vkk10l0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T16:11:13.000Z",
      "summary_90w": "",
      "raw": "The administration is seeking an emergency order as it tries to claw back funds allocated by Congress.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e4f6d6c8659c767f9f06bc708b545cbf9b513d7",
      "title": "Labour's new deputy leader must be a woman, says Harriet Harman",
      "url": "https://www.bbc.com/news/articles/c059z4g836eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T16:09:34.000Z",
      "summary_90w": "",
      "raw": "Labour's ruling National Executive Committee (NEC) is setting the rules for choosing the new deputy leader.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35ebe445720894a3b41a9da3414ff23263602ff3",
      "title": "Meta curbed research about VR safety risks to kids, whistleblowers say",
      "url": "https://www.theverge.com/policy/773821/meta-virtual-reality-horizon-worlds-youth-safety-research-whistleblower",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T16:08:23.000Z",
      "summary_90w": "",
      "raw": "A new group of whistleblowers are coming forward to allege that Meta is restricting research into how its virtual reality offerings could negatively impact kids and teens, The Washington Post reports.\nFour current and former Meta staffers allege that after an earlier whistleblower, Frances Haugen, leaked internal research to Congress, the company called on its lawyers to screen and sometimes veto research on VR and youth safety, The Post reports. The new whistleblowers are being represented by legal nonprofit Whistleblower Aid, which also worked with Haugen. \nIn a statement, Meta spokesperson Dani Lever said the allegation its legal team sidelined research is based on a few examples “stitched together to fit a predetermined and false narrative; in reality since the start of 2022, Meta has approved nearly 180 Reality Labs-related studies on social issues, including youth safety and well-being.” Lever said Meta research has led to “significant product updates” including parent supervision tools, and that its VR devices are made for people over 13.\nThe allegations are expected to take center stage at a Senate Judiciary Committee hearing on Tuesday called “Hidden Harms: Examining Whistleblower Allegations that Meta Buried Child Safety Research.” Three Republicans on that committee have already asked Meta for more information on its protections for kids and teens on its Horizon Worlds virtual platform.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e90f8658e5b0d0c881287926cb87708bd20c2a6",
      "title": "New MasterChef hosts revealed after Wallace and Torode axed",
      "url": "https://www.bbc.com/news/articles/ckgy2e73j4ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T15:59:57.000Z",
      "summary_90w": "",
      "raw": "Gregg Wallace and John Torode were sacked after an inquiry into conduct on the BBC show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d4125cf24056cf91415eb0217094f6177b3f565",
      "title": "Anthropic endorses California’s AI safety bill, SB 53",
      "url": "https://techcrunch.com/2025/09/08/anthropic-endorses-californias-ai-safety-bill-sb-53/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T15:51:33.000Z",
      "summary_90w": "",
      "raw": "As Anthropic endorses SB 53, much of Silicon Valley and the federal government are pushing back on AI safety efforts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b4de7e96b8212775627d1565e6cc0d31d423ec90",
      "title": "Databricks confirms new $100B valuation on $4B ARR",
      "url": "https://techcrunch.com/2025/09/08/databricks-confirms-new-100b-valuation-on-4b-arr/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T15:33:26.000Z",
      "summary_90w": "",
      "raw": "Just months after raising a whopping $10 billion, Databricks has confirmed another $1 billion raise at a $100 billion valuation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5505014f937ecac34a65207ed72cdbb1244f49d",
      "title": "The best doorbell cameras",
      "url": "https://www.theverge.com/22954554/best-video-doorbell-camera",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T15:30:00.000Z",
      "summary_90w": "",
      "raw": "With a smart video doorbell, your front door’s communication skills go from 1980s landline to a modern smartphone. Combining a motion-activated camera with a microphone, speaker, and buzzer, a doorbell camera sends alerts to your phone, allowing you to see who’s at the door without needing to open it or even be at home. Whether you’re curled up on the couch, hard at work in your office, or sunning on a beach in the Bahamas, a video doorbell keeps you in touch with what’s happening on your doorstep.\nI’ve tested more than 35 video doorbells, and while there’s no one-size-fits-all, like a smartphone, it’s a personal choice, I have thoughts on which are the best of the best and which work well for specific use cases.\nMy top advice is to use the existing doorbell wires if you have them. Wired doorbells are generally cheaper, work better, and are more compact, so they tend to look nicer.\nIf you don’t have wires and don’t want to pay for an electrician to run them, try using an AC power adapter (Ring and Google Nest sell their own; you can also find generic ones). But if all else fails, I’ve got recommendations for good battery-powered buzzers. Just plan to pick up an extra battery when you purchase, or factor in removing it from your door every few months to charge it for a few hours.\n\n\n\n\n\nBest doorbell camera\nBest battery-powered doorbell camera\nBest budget doorbell camera\nBest doorbell camera without a subscription\nBest wired video doorbell that works with Amazon Alexa and Ring\nA great wired doorbell camera for Ecobee users\nBest video doorbell camera for Apple HomeKit Secure Video\nBest video doorbell door lock\nOther doorbell cameras I tested\nDoorbell cameras I plan to test\nWhat’s coming next?\n\nBest doorbell camera\nNest Doorbell (wired)\nWith 24/7 recording, facial recognition, reliable smart alerts, and some free video recording, Google’s wired doorbell is the best option for most people. \n\nWhere to Buy:\n\n $179.99 at Google\n $179.99 at Best Buy\n $179.99 at Lowe’s\n\nVideo quality: 960 x 1280p, 6x zoom, HDR / Smart alerts: Person, package, animal, vehicle, and facial recognition ($) Aspect ratio: 3:4 / Field of view: 145 degrees diagonal / Power options: Wired / Wi-Fi: 2.4GHz and 5GHz / Storage: Cloud and local / Subscription fee: $10 a month / Works with: Alexa, Google, SmartThings\nThe Nest Doorbell Wired (2nd-gen) is one of only two video doorbells in this list that can record 24/7. Scrolling through a continuous timeline view of everything that’s happened at your front door is super helpful and means you won’t miss anything. This, along with a good price, great video quality, the ability to tell you what and who is at your door, and some free recorded video, make it the best doorbell for most people.\nThe Nest Wired is also the best video doorbell that works with Google Home, and the best for protecting your packages. Its proactive package watch feature tells you when a package arrives and sends another alert when it’s gone. In my testing, it worked very well.\nUnlike many competitors — such as Ring and Arlo — Google doesn’t charge for smart notifications. The Nest Wired will tell you if it’s a person, package, animal, or vehicle at your door for free. You also get free activity zones to cut down on unwanted notifications, and three free hours of event-based recordings, thanks to local storage and local processing.\n\nYou can, in theory, use this doorbell without paying a subscription\n\n\nBut three hours isn’t enough to be particularly useful, and to get recorded video, you need a Nest Aware plan (starting at $10 per month, $100 per year). This does cover all your Google Nest cameras, though, and it adds Nest’s excellent Familiar Faces feature, which tells you who is at your door.\nIf you want 24/7 recording, you need Nest Aware Plus ($20 per month, $200 a year), but again, this subscription applies to all Google Nest cameras you have.\nOn paper, the Nest doesn’t have the best specs; the Ring Wired Pro is technically better. But it does deliver a 960 x 1280 pixel resolution with a 6x digital zoom, and video quality is very good, thanks to some digital trickery. Its 3:4 portrait aspect ratio and 145-degree field of view are very good, and I could see my porch from top to bottom and a fair amount from side to side.\nOn-device AI makes the Nest speedy with notifications, and it delivers rich alerts to both your phone and watch. These are interactive, allowing you to press and hold the video to see a clip and activate one of the three preset quick responses. It’s also quick to call up live video.\nNest’s doorbells and cameras work with Nest and Amazon Alexa smart displays for viewing a live feed. Google also now lets you have a live stream pull up automatically on your Google TV when someone rings the doorbell — a super handy feature.\nThere are a few quirks. There’s no reliable way to snooze notifications from the doorbell, and if you use multiple Nest speakers or displays, they’ll all announce your visitors. Not great if you have a Nest Mini in your kid’s nursery.\nGoogle is gradually rolling out a search and description feature to its cameras, including video doorbells that will send an alert describing exactly what’s happening in a clip, giving you more context before opening the app. You’ll also be able to search through footage for specific events — like kids on bikes. The search and description feature will require a subscription.\nRead my full Nest Doorbell wired review.\nBest battery-powered doorbell camera\nRing Battery Doorbell Plus\nThis is a great battery-powered buzzer with excellent video quality, a good head-to-toe view, and very speedy response times for a battery doorbell. It integrates well with Amazon Alexa and can record locally to a Ring Alarm Pro, but the battery only lasts about two months unless you turn on battery-saving features.\n\nWhere to Buy:\n\n $149.99 at Target\n $149.99 at Amazon\n $149.99 at The Home Depot\n\nVideo quality: 1536 x 1536p, HDR, color night vision / Smart Alerts: Person, package ($) Aspect ratio: 1:1 / Field of view: 150 degrees horizontal, 150 degrees vertical / Power options: Battery, wired trickle charge, solar / Wi-Fi: 2.4GHz / Storage: Cloud and local (with Ring Alarm Pro) / Subscription fee: $4.99 a month / Works with: Amazon Alexa, Samsung SmartThings\nIf you really want a battery-powered buzzer, the Ring Battery Doorbell Plus is the way to go. At $149.99, it’s cheaper than the Ring Battery Pro, while still offering a head-to-toe view and high-quality video resolution to provide a clear picture of what’s happening at your door.\nUnlike the $100 Ring Battery Doorbell, the Plus uses removable, rechargeable batteries, making it easier to keep your doorbell charged. Just have a second on hand charged and ready to swap in when you get low. Most other doorbells require you to take them down to recharge.\nThe Plus also has color night vision and was more responsive than any other non-Ring battery doorbell I’ve tested. It pulled up a live view in under four seconds, compared with upwards of 10 seconds for most others.\nAs with other battery-powered doorbells, there’s no preroll. If catching people as they approach your door — not just at your door — is crucial, consider the Battery Doorbell Pro ($229.99). That model adds preroll and improved motion detection using radar, which significantly cuts down on nuisance alerts.\nIt’s only really worth spending the extra $80 if you have lots of trees or passing cars in front of your door and/or you want to make sure you see the whole event when someone approaches your door. The Pro is also compatible with 5GHz Wi-Fi, which could mean faster responses if your front door is close enough to your router. The Plus is 2.4GHz only.\nBattery life isn’t great on either doorbell. They last around two months with all the features turned on except for extra-long recordings (the default is 30 seconds, but it can go up to 120). You can tweak settings to reduce power consumption, but then you have to give up features like HDR (which makes it easier to see faces) and snapshot capture, which takes a picture every five minutes to give you a better idea of what’s been happening at your door.\nAs with all Ring doorbells, there are no animal or vehicle alerts, only people and packages. These require a Ring Home plan starting at $4.99 a month, or $49.99 per year, which also includes 180 days of recorded video.\nAn AI-powered search feature introduced in 2024 lets you search recorded footage for things like animals, vehicles, and even the color of the coat you wore when you left the house. It’s handy for understanding what’s been going on around your home, but you still can’t get an alert when your cat is sitting on your porch.\nOther free features include pre-recorded quick replies, the option to set a motion alert schedule, live view, and two-way audio. The Plus can announce visitors on Echo speakers and automatically initiate a two-way audio/video call on an Echo Show. It won’t work with your existing chime unless you wire it (which also trickle-charges the battery), but Ring sells a plug-in chime.\nThe Plus also works with Ring Edge, a local storage and processing option that requires a Ring Alarm Pro smart hub and a Ring Home Premium subscription ($20 a month, $200 per year). This adds cellular backup through its built-in Eero Wifi system, so it can keep your doorbell online if both the power and internet go out.\nBest budget doorbell camera\nBlink Video Doorbell\nBlink’s buzzer is the best if you’re looking for a budget-friendly option with motion-activated recording and alerts, night vision, two-way audio, and up to two years of battery life. \n\nWhere to Buy:\n\n $59.99 at Lowe’s\n $59.99 at The Home Depot\n\nVideo quality: 1080p / Smart alerts: None / Aspect ratio: 16:9 / Field of view: 135 degrees horizontal, 80 degrees vertical / Power options: Wired or battery / Wi-Fi: 2.4GHz / Storage: Cloud or local with a Sync Module / Subscription fee: $3 a month / Works with: Amazon Alexa\nThe Blink Video Doorbell is the best cheap doorbell with a no-subscription option. And while it works as a wired doorbell, it’s also a good option for a battery-powered buzzer, as it can go up to two years on two AAs. I don’t love this doorbell, as video and audio quality are not great, but it’s cheap, it gets the job done, and that battery life is phenomenal.\nThe Blink doesn’t have smart alerts or quick replies, and it only records 1080p video at a standard 16:9 aspect ratio). But the basics are here: motion-activated recording (with a max of 30 seconds), alerts, live view (with caveats), night vision, motion zones, and two-way audio.\nIf you want to pay $50 (often less) to have a camera at your door and be done with it, get the Blink. Cloud storage is also a bargain at $3 a month ($30 a year), or you can do local storage with the Sync Module 2 and a USB stick. You need the Sync Module to initiate a live view through the camera in the app (or you have to pay for the subscription). Without it, you can only see video if there’s a motion event or someone rings the doorbell.\nThe Sync Module is sold with the doorbell as a “doorbell system” for $70, and should pay for itself compared to a monthly subscription.\n\nUniquely for a battery-powered doorbell, the Blink can also be a true hardwired doorbell\n\n\nThe biggest selling point for Blink is the feature that makes its similarly inexpensive security cameras so attractive: up to two years of battery life on two AA lithium batteries. The company has developed a super energy-efficient chip that will power its cameras longer than any other doorbell I’ve tested. (I managed almost a year with very heavy use). \nUniquely for a battery-powered doorbell, the Blink can also be a true hardwired doorbell. When wired, it will activate an existing chime (something neither the sub-$100 Ring nor Wyze doorbells can do) and provide constant power — not just trickle charge. This means it can wake up faster than a battery-powered buzzer and catch your visitor as they arrive. Wiring also adds on-demand two-way audio and live view (otherwise, you can only see the stream if there’s a motion event at the doorbell or someone presses the buzzer.)\nThe Blink comes in white or black and, because it uses just two AA batteries, isn’t as huge as most battery-powered doorbells, making it a more discreet option. However, it is a giant pain in the neck to install; make sure to follow the video instructions Blink provides closely to save a lot of frustration.\nThe biggest drawbacks are lower video quality and poor audio quality (it can be staticky, and it’s push-to-talk — not full duplex), short recording length, and no smart alerts. The app is also a bit tricky to navigate. It doesn’t work with Google Home, but it works great with Alexa, and you can see a live view on Echo Show devices and use any Echo speaker as an indoor chime.\nNote: Blink recently launched a second-generation video doorbell with higher image resolution, a head-to-toe view, and person detection for the same price. I plan to test this soon. You can read more details here.\nBest doorbell camera without a subscription\nTP-Link Tapo D225 Video Doorbell Camera\nAt under $100, this feature-packed, subscription-free doorbell offers a lot of value, including free local recording, 24/7 recording, and smart alerts, plus a robust smart home ecosystem. It’s big, you need a microSD card for recording, and there’s no HDR, but it’s a solid choice.\n\nWhere to Buy:\n\n $99.99 $88.99 at Amazon\n $99.99 $89.99 at Tapo\n\nVideo quality: 2K HD (no HDR) / Smart alerts: People, packages, pets, vehicles (free) Aspect ratio: 4:3 / Field of view: 180 degrees horizontal / Power options: Battery, wired trickle charge / Wi-Fi: 2.4GHz / Storage: microSD card or cloud / Subscription fee: $2.79 a month / Works with: Amazon Alexa, Google Home\nYou can use any doorbell on this list without a subscription, but you may sacrifice features like smart alerts, recorded video, and 24/7 continuous recording. If you want these but don’t want to pay a monthly fee, TP-Link’s Tapo D225 is an excellent choice.\nA wired and battery-powered doorbell, the D225 offers free smart alerts for people, packages, pets, and vehicles and can record locally to a microSD card (purchased separately) without paying a subscription. There is an optional cloud service if you want to store your video offsite that also adds rich notifications (where a clip or image shows in the notification), but no other features are locked behind a paywall.\n\nIt is a chunky doorbell and may not meet the spousal approval factor\n\n\nTo get the free recording of motion-activated events, you just need to insert a microSD card (up to 512GB) into the doorbell. While it can run on its built-in 10,000mAh battery, you will need to wire it up for continuous 24/7 recording. This will also trickle charge the battery, and the doorbell will still work and record video, even if your power and Wi-Fi go out.\nThere are a few hoops to jump through to get 24/7 recording working, which can be a bit confusing in the slightly cluttered Tapo app. However, once set up, it will capture everything that happens. This is a great option, considering Nest charges $15 a month for 24/7 recording.\nThe D225 also provides good video quality, a decent zoom, and a nice 4:3 aspect ratio that clearly shows your entire porch from top to bottom and a good view from side to side. There is no HDR imaging, though, so if your porch is covered, it can be hard to make out faces in some lights.\nThe doorbell can work with your existing chime (although, oddly, not if you enable 24/7 recording) but also comes with a plug-in chime. If you don’t wire it, you’ll have to remove it to charge, but the large battery can last up to eight months. The downside is that it is a huge, chunky doorbell, which may not meet the spousal approval factor for a good-looking doorbell.\nAnother neat feature of the Tapo is doorbell calling. When someone rings your doorbell, the alert comes in like a phone call, making it less likely that you’ll miss it. This is something first offered on Arlo buzzers, and Ring says it’s bringing it to its line.\nAs Tapo also offers a wide range of smart home products — including security cameras, smart lights, and robot vacuum cleaners — you can tie your doorbell into smart home routines.\nIf you have lots of devices, the Tapo app can get a bit cluttered. But it’s easy enough to use and packed with features, including quick replies, a privacy mode that turns the camera off, and the ability to schedule notifications, set detection zones, and specify the type of alert you want to get from each one (e.g., only notify me if you see people in this zone and packages in this zone).\nRead my full Tapo D225 review.\nMore expensive, but more flexible\nReolink Battery Doorbell\nThe Reolink is sleeker than the Tapo, with very good video quality and HDR support but no 24/7 recording. It can record local video on a microSD card, Reolink Hub, or FTP server and connect to a platform like Home Assistant. But its battery doesn’t last as long as Tapo’s, the app can be confusing, and the smart alerts are spotty. It works with Amazon Alexa and Google Home.\n\nWhere to Buy:\n\n $119.99 at Amazon\n $119.99 at Reolink\n\nBest wired video doorbell that works with Amazon Alexa and Ring\nRing Wired Doorbell Pro\nThe flagship Ring doorbell has the best video quality, good connectivity, and excellent motion detection. It works smoothly with Amazon Alexa but is expensive, requires a subscription for most features, and doesn’t offer 24/7 recording.\n\nWhere to Buy:\n\n $229.99 at Amazon\n $229.99 at Best Buy\n $229.99 at Ring\n\nVideo quality: 1536 x 1536p, HDR / Smart alerts: Person, package ($) Aspect ratio: 1:1 / Field of view: 150 degrees horizontal, 150 degrees vertical / Power options: Wired / Wi-Fi: 2.4GHz and 5GHz / Storage: Cloud and local (with Ring Alarm Pro) / Subscription fee: $4.99 a month / Works with: Amazon Alexa, Samsung SmartThings\nThe Ring Wired Doorbell Pro (formerly Ring Doorbell Pro 2) — previously my top pick — is the best wired doorbell camera that works with Amazon Alexa and integrates with Ring Alarm and other Ring cameras. It’s more expensive than the Nest Wired — which also works with Alexa — but its video is higher quality and much brighter.\nIt has an ideal square aspect ratio for a full front porch view, speedy notifications, and impressively accurate motion detection using three separate sensors — radar, video analysis, and passive infrared. It also has a nice slim design and multiple faceplate options to fit your decor.\nBut there’s no free video recording, no option for 24/7 recording (yet), and the smart alerts are limited to people and packages. However, you can now search for things like vehicles and animals after the fact with Ring’s Smart Video Search feature. This makes tracking down my cat or checking which delivery driver came by a little easier.\nThe Ring Pro also works with Samsung SmartThings, and while it doesn’t support Apple Home, it can be integrated with extra hardware. There’s no support for Google Home.\nA true wired doorbell, the Ring Pro is one of the most responsive doorbells I’ve tested, delivering notifications immediately. It also has the best range and connectivity, and built-in, full-color preroll helps ensure you don’t miss any crucial action.\nThe Pro has good color night vision, dual-band Wi-Fi, and smart responses (which let your doorbell talk to your visitor for you). The Ring app is best in class, and there are pages of settings you can tinker with. Plus, the timeline view for scrolling through your recordings is very good.\nThe Pro will work with your existing doorbell chime, plus Ring sells a plug-in Chime and Chime Wi-Fi extender that can help boost connectivity while providing a selection of fun doorbell tones.\nAs with most doorbell cameras, the Pro can use Echo smart speakers to announce when someone is at the door. As a Ring doorbell, it can also automatically pull up a live feed of your front door on an Echo Show or Fire TV-enabled television when someone presses the doorbell.\nThe downside is that the Pro is expensive. Its subscription fee starts at $4.99 a month (or $49.99 a year). This adds recorded footage, smart alerts, and an extra six seconds of preroll video, which, in lieu of 24/7 recording, provides plenty of time around motion events to catch all the action.\nThe Pro works with Ring Edge for local storage and video processing, plus the option of cellular backup. But you need a Ring Alarm Pro and Ring Home Premium subscription for this, which costs $20 a month and no longer includes professional monitoring of your alarm (that’s now a $10 add-on).\nRing added 24/7 recording to some wired cameras, a feature that’s included in the $20-a-month Ring Home Premium plan. While this isn’t coming to the wired doorbells at launch, Ring has said the feature will expand to more devices soon.\nRead our Ring Wired Doorbell Pro review.\nA battery-powered alternative\nRing Battery Doorbell Pro\nIf you like the sound of the Wired Pro but don’t have wires, the Ring Battery Doorbell Pro has almost all of the same features —  including head-to-toe view, excellent video, dual-band Wi-Fi, color preroll, color night vision, and noise-canceling audio — in a battery package. It also features radar motion detection, which cuts down on nuisance notifications, and is a great alternative to the Pro 2.\n\nWhere to Buy:\n\n $229.99 at Amazon\n $229.99 at Best Buy\n $229.99 at The Home Depot\n\nA great wired doorbell camera for Ecobee users\nEcobee Smart Doorbell Camera\nThis is the only video doorbell that can use an Ecobee thermostat as a video intercom, making it a no-brainer for Ecobee households, as long as you can hook it to your doorbell wiring. \n\nWhere to Buy:\n\n $159.99 $119.99 at The Home Depot\n $159.99 $119.99 at Best Buy\n $159.99 $119.99 at Ecobee\n\nVideo quality: 1080p, 8x zoom, color and IR night vision / Smart Alerts: Person, package Aspect ratio: 3:4 portrait / Field of view: 187 degrees diagonal / Power options: Wired / Wi-Fi: 2.4GHz, 5GHz / Storage: Cloud / Subscription fee: $5 a month or $50 a year  / Works with: Amazon Alexa, Apple Home, Google Home\nThe Ecobee Smart Doorbell Camera is a great wired doorbell camera and the only one that can use an Ecobee thermostat as a video intercom — a neat feature. It sends fast, accurate alerts for people and packages, and thanks to radar detection and computer vision motion detection, it never once sent me a false alert.\nThe Ecobee has a comprehensive 187-degree diagonal field of view that lets you see top to bottom and side to side and offers decent 1080p HD video. A subscription is required for viewing recorded video, $5 a month / $50 a year, but alerts for people and packages are free. In 2024, Ecobee introduced the ability to control your Yale or August Wi-Fi-enabled door lock directly from its app, so you can more easily unlock the door for someone from afar.\nOne quirk is that while the Ecobee records all motion (if you subscribe), it only alerts you if it sees people or packages. This does cut down on the number of alerts you get, but I’d like the option to turn motion alerts on, mainly so I can know when my dog has gotten out and is sitting at my front door (especially because there are no animal or vehicle alerts). The doorbell does record all motion events for up to two minutes, so you can go back and view them, but you won’t get notified.\nThe Ecobee works with Apple Home and can ring a HomePod as a chime (as well as your existing chime), plus pull up a live view on your Apple TV. But it doesn’t support HomeKit Secure Video, so you have to pay Ecobee’s subscription fee if you want recorded videos. It also works with Amazon Alexa and recently added support for Google Home. If you have an Ecobee thermostat in a convenient location, this is an excellent option.\nRead my full Ecobee Smart Doorbell Camera review.\nBest video doorbell camera for Apple HomeKit Secure Video\nAqara G4 Video Doorbell\nThe Aqara G4 is an inexpensive HomeKit Secure Video doorbell that also works with Alexa and Google Home. It’s powered by batteries, wires or both, and offers 24/7 local recording. But a 16:9 aspect ratio and poorer video quality let it down. \n\nWhere to Buy:\n\n $119.99 $89.99 at Amazon\n $119.99 $89.99 at Best Buy\n $119.99 $104.6 at The Home Depot\n\nVideo quality: 1080p / Smart Alerts: Person, facial recognition and person, facial recognition, packages with HSV, / Aspect ratio: 16:9 / Field of view: 162 degrees horizontal / Power options: Wired or battery / Wi-Fi: 2.4GHz / Storage: Cloud and local / Subscription fee: Seven days of free cloud storage or 99 cents a month with iCloud / Works with: Apple Home, Amazon Alexa, Google Home\nAqara’s G4 is currently the best video doorbell for Apple Home users, especially if you want 24/7 video recording. It’s also the only battery-powered doorbell that’s compatible with Apple Home, and it works with HomeKit Secure Video.\nIt runs on six standard AA batteries and can be hardwired to support 24/7 video recording (through Aqara’s app, though, not in Apple Home). It’s jam-packed with features, but it’s probably best suited for those who live in apartments as its landscape aspect ratio means it can’t really see packages at the doorstep, and it’s not very weather-resistant.\nAt $120, it’s the least expensive HomeKit option and pairs with the Aqara U100 smart lock (which also works with Apple Home and Home Key) for a nice, fully Apple Home-compatible setup on your front door. As a bonus, you can easily unlock the door from the same screen as viewing your doorbell footage.\nDownsides include a 16:9 aspect ratio (a problem if you want to see packages on your porch), no HDR imaging, which delivers pretty bad video quality, and a finicky chime box that has to be plugged in inside and near the doorbell. That chime also houses a microSD card, which is required for 24/7 recording. Unfortunately, the G4 can’t ring an existing electronic chime, but the chime box is plenty loud, and you can customize the heck out of the sounds.\nThe G4 has smart alerts for people, packages, animals, and vehicles, facial recognition, and the option to announce who is at the door on a connected HomePod or HomePod Mini (you need an Apple Home hub to use this in HomeKit).\nIt responded quickly to doorbell rings and motion alerts, but I had some connectivity issues. Plus, occasionally, I got an overheating warning while testing in May 2024 — and that was before the heatwave we experienced in South Carolina this summer.\nAqara has its own app, which has a ton of innovative features, including custom ringtones for different people, a voice changer, and the option to have your smart home devices react depending on who is at the front door.\nThe Aqara app adds access to 24/7 video, a nice feature to have, especially for free. The implementation is spotty, and video quality is not great, but it will do in a pinch. In addition to Apple Home, the Aqara doorbell works with Google Home and Amazon Alexa.\nNote: Aqara announced the Aqara Doorbell Camera Hub G410 earlier this year, which adds 2K video quality, a 4:3 aspect ratio, and end-to-end encryption of video. You can read more details here. I’ll be testing it soon.\nRead my full Aqara Video Doorbell G4 review.\nBest video doorbell door lock\nEufy FamiLock S3 Max\nEufy FamiLock S3 Max Palm Vein Recognition Wi-Fi Smart Lock\n\nWhere to Buy:\n\n $399.99 $339.99 at Amazon\n $399.99 $339.99 at Eufy\n $399.99 $339.99 at The Home Depot\n\nVideo quality: 2K HD / Smart Alerts: Person, motion, / Aspect ratio: 16:9 / Field of view: 150 degrees horizontal / Power options: Battery / Wi-Fi: 2.4GHz, 5GHz / Storage: Local / Subscription fee: N/A / Works with: Apple Home, Amazon Alexa, Google Home\nEufy’s FamiLock S3 Max is a two-in-one video doorbell and smart lock that manages to handle both functions pretty well. Its $399 price tag may cause sticker shock at first but is easier to accept when you consider the price of a smart door lock and video doorbell together. \nThe FamiLock S3 Max has a 4-inch screen that shows a live video feed of what’s captured by the front camera, so you can check it at a glance without opening your phone. The screen also allows other people in your household to check who’s at the door without having Eufy’s app installed, which is especially helpful for kids and guests. \nYou can unlock the FamiLock S3 Max using an app, PIN code, key, or palm recognition, which works by using infrared light to scan the vascular patterns beneath the palm of your hand. Using palm recognition doesn’t require you to physically touch the door lock and can be more reliable than a fingerprint reader for older folks whose fingerprints have degraded over time. It took a little time to get used to unlocking my door this way, but it worked reliably once I did. To lock the door, you’ll need to push a button on the lock, or enable auto-lock within Eufy’s app.\nRunning both a video doorbell and smart lock takes a lot of power, and in our tests, the FamiLock S3 Max’s battery was down to 41 percent after one month. It does have four AAA batteries to keep basic functions operational while you charge the lock’s main battery. You can also pick up a spare battery from Eufy for $37 if you want to have a fully charged backup at all times. \nIn our tests, the FamiLock S3 Max recorded clear video both day and night, though a protruding door frame blocked part of the camera. You can save video footage for free within Eufy’s app because it’s stored locally rather than in the cloud. You’ll receive an alert when people or motion are detected, but the video doorbell can’t recognized specific events, like package recognition. Hooking it up to Eufy’s HomeBase 3 enables some smart alerts, including pet and vehicle detection and facial recognition, but will set you back $150. \nYou can view a live feed from the camera on an Amazon Alexa or Google Home smart speaker with a screen, but I found it easier to just check the display built into the smart lock. Apple Home support is available on the smart lock portion of the FamiLock S3 Max, but not the video doorbell. Still, if you want both a smart lock and video doorbell without having to install and manage two separate devices, Eufy’s FamiLock S3 Max is a compelling choice.\nRead my full Eufy FamiLock S3 Max review.\nOther doorbell cameras I tested\nThe Reolink Video Doorbell (starting at $119) is a wired version of Reolink’s battery model mentioned above. It’s worth considering if you can use Power over Ethernet (there’s also a Wi-Fi version). There’s also the option of dual-band Wi-Fi, local storage to a microSD card or FTP server, and 24/7 recording with compatible hardware. I tested the black Wi-Fi version ($119.99), which streams good 2K video but only supports person detection (which is fairly inaccurate) and has a more horizontal field of view. The white model has package detection and a more vertical field of view. The battery Reolink adds animal and vehicle alerts and has a better field of view, so it’s the better choice unless you want PoE.\nThe Tapo D210 ($59.99) is a battery-powered doorbell with a similar design to the D225, but there’s no wiring option, so it can’t record 24/7. It does have free local recording with a microSD card and free alerts for people, pets, and vehicles, but there’s no package detection. Its rectangular 16:9 aspect ratio shows less of my porch, and it’s only available in white. While it has a few more features than the similarly priced Blink, it is very big and bulky, has a shorter battery life, and can’t be wired to trickle-charge or ring your existing chime (it does come with a plug-in chime). \nThe Ring Battery Doorbell ($99.99) suffers badly from the back-of-the-head problem common with battery-powered buzzers. Other than that, it’s a fine basic buzzer, but it doesn’t have removable batteries. While the redesigned quick-release system makes it easier to remove the doorbell to charge, the Plus is worth the extra money for the added convenience and better video resolution. The one thing this Ring has going for it is its slim profile, which makes it a good option if you want something more discreet.\nThe Google Nest Doorbell (battery) is worth considering if you are in a Google household and can’t wire your doorbell, but it is big and bulky. Plus, you have to remove it to charge. Specs and price-wise, it’s the same as my top pick, the Nest Doorbell (wired), but it can’t record 24/7, which the wired Nest can. It’s also twice the size of the wired model. \nThe Eufy Video Doorbell Dual is a previous pick that doesn’t require any monthly fees and records footage locally. But at $250, it’s very expensive, and there are now better, cheaper options. It’s still great thanks to its dual camera feature that lets you see your porch and your visitor with a wide view, plus free smart alerts, including facial recognition and a neat uncollected package alert. It’s worth considering if you already have a Eufy HomeBase. You can read my full review here.\nThe Wyze Video Doorbell Pro is a battery buzzer with impressive features for its price, and if you hardwire it, you get preroll video. However, a five-minute cooldown period between recordings, unless you pay for a subscription, is an inexcusable amount of time that negates its offer of “free recording.” Plus, Wyze has had some major security issues in the past.\nThe Ring Video Doorbell Wired is a budget buzzer at just $60, but it won’t work with your existing chime and doesn’t draw the same amount of power from those wires as the Ring Pro 2, making it generally less reliable. Without HDR, its video quality is spotty.\nThe Logitech Circle View Wired is another Apple HomeKit Secure video option I tested, which, while fast, is expensive, only works with Apple Home, and frequently dropped off my Wi-Fi network. \nIn addition to Eufy’s FamiLock S3 Max, I’ve also tested the Lockly Vision Elite and the Eufy Security S330 Video Smart Lock. Both are very expensive and work better as door locks than doorbells. But if you have a specific need for this device (e.g., you have nowhere else to put a doorbell camera), then they are useful for at least seeing up the nose of whoever is at your door, if not much beyond that.\nDoorbell cameras I plan to test\nBlink launched an upgraded version of its doorbell in May. The Blink Video Doorbell (newest model) is the same price as the current model ($69.99) but adds a head-to-toe view of your porch, 1440p x 1440p image resolution, and person detection. It requires a Sync Module to work, which the current version doesn’t.\nThe Aqara Doorbell Camera Hub G410 is an upgrade to the G4. It offers 2K video quality, a 4:3 aspect ratio, and end-to-end encryption, along with a mmWave sensor for more accurate person detection. Uniquely, it uses dual-band Wi-Fi and is a Zigbee, Thread, and Matter smart home hub for Aqara’s wide smart home system.\nThe Arlo Video Doorbell (wired / wireless) is the second generation of the excellent Arlo Essential wired, which was a former pick in this guide. It doesn’t have the option of wiring only; instead, it’s a battery doorbell you can wire to trickle-charge. There’s a choice between 1080p ($79.99) and 2K ($129.99) resolutions, and it features a 180-degree field of view and an integrated siren. Recording and smart alerts require a $10 per month subscription ($8 if paying annually), and there’s no local storage or 24/7 recording, but there are AI-powered features (including facial recognition).\nSwitchbot’s first video doorbell comes with an in-home display/chime to give you a quick way of seeing who  is at the door. No price, release date, or further details are known yet.\nThe $50 Kasa Smart Doorbell (KD110) from TP-Link comes with a plug-in chime, 2K video quality, free person detection, and the option of local storage to a microSD card. It’s a wired doorbell with a 160-degree viewing angle and works with Amazon Alexa and Google Home.\nI plan to test several subscription-free doorbells from Eufy, including the Eufy Doorbell E3340, C210, and S220.\nWhat’s coming next?\nSignify announced the Hue Secure video doorbell at IFA 2025. It launches in October for $169. It features a 2K image sensor, has a built-in Zigbee radio to communicate with Hue lights and other home automation devices, and can record videos in a square aspect ratio. Its built-in chime can be integrated into a Hue security system and used as a siren when it’s triggered. Signify’s CEO George Yianni confirmed to The Verge that the video doorbell lets you view video clips captured by the video doorbell over the previous 24 hours without paying a subscription fee. The Hue Secure video doorbell won’t support Matter at launch, but is slated to arrive this fall when Matter 1.5 is released. Similarly, Apple Home support will be added after it ships. \nAndroid Authority spotted the third-generation Nest Video Doorbell within the Google Home app’s new device setup screen. It’s no longer visible from this menu — Google likely fixed the secret-spoiling error — but it suggests an announcement for the updated video doorbell could happen soon. Relatedly, a photo posted on the Nest subreddit shows an unannounced third-generation Nest Video Doorbell behind a locked case at a Home Depot store, along with other Nest hardware.\nPhotos by Jennifer Pattison Tuohy / The Verge\nUpdate, September 8th: Adjusted pricing and availability throughout and included information about the upcoming Hue Secure video doorbell and leaks surrounding the third-generation Nest Video Doorbell. Brandt Ranj also contributed to this article.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "75abc954ffdf561780cd867ade9a59754f8886a0",
      "title": "UK could suspend visas for countries with no migrant return deals, new home secretary says",
      "url": "https://www.bbc.com/news/articles/c4g7xyn03yno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T15:27:45.000Z",
      "summary_90w": "",
      "raw": "Shabana Mahmood, who was appointed in last week's reshuffle, says her top priority is to 'secure' the UK's borders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8adb413ca275230864b5cfcd04b29556b680128",
      "title": "YouTube’s first exclusive NFL broadcast attracts over 17M viewers",
      "url": "https://techcrunch.com/2025/09/08/youtubes-first-exclusive-nfl-broadcast-attracts-over-17m-viewers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T15:24:23.000Z",
      "summary_90w": "",
      "raw": "Over 17.3 million viewers tuned in for YouTube's first-ever exclusive global broadcast of an NFL game with the Chiefs and Chargers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c0a9e015ed19cb89202decdc9f0ba220e6c18f7b",
      "title": "'Playing perfectly' - how does Alcaraz rank v men's tennis legends at 22?",
      "url": "https://www.bbc.com/sport/tennis/articles/czew374r499o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T15:16:05.000Z",
      "summary_90w": "",
      "raw": "BBC Sport explores Carlos Alcaraz's stunning record compared to tennis' biggest legends in the men's game after his sixth Grand Slam triumph.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0a9e015ed19cb89202decdc9f0ba220e6c18f7b",
      "title": "How does Carlos Alcaraz rank against other tennis legends?",
      "url": "https://www.bbc.com/sport/tennis/articles/czew374r499o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T15:16:05.000Z",
      "summary_90w": "",
      "raw": "After his sixth Grand Slam triumph, BBC Sport compares his stunning record with the biggest legends in the men's game.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5dff85ab0d413a35ecc20f6a3c4cf060d6830e03",
      "title": "Big tech not stopping online sharing of child abuse images, eSafety commissioner says, amid new online codes",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/big-tech-not-stopping-online-sharing-of-child-abuse-images-esafety-commissioner-says-amid-new-online-codes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T15:04:38.000Z",
      "summary_90w": "",
      "raw": "Measures to protect children from harmful content such as AI chatbots to be implemented at the same time as the under-16s social media ban\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s eSafety commissioner says none of the big technology companies are doing enough to stop images of “the most heinous abuse to children” from being shared online.\nThe criticism comes as the commission registers six new industry codes designed to better protect children from “lawful but awful” age-inappropriate content, including the “clear and present” danger posed by AI driven companion chatbots.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9201e42c4b1f995de17c19b40f4dfb443e82d67a",
      "title": "College Football 26 is $20 off in time for the 2025 season",
      "url": "https://www.theverge.com/tech/773698/college-football-26-ea-sports-ps5-xbox-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T15:02:16.000Z",
      "summary_90w": "",
      "raw": "The 2025-2026 college football season kicked off last week. If you want something to do while you wait for your favorite team to hit the field every week through the fall, I encourage you to check out EA Sports’ College Football 26, which is $49.99 ($20 off) at Best Buy, Walmart, and Amazon on PS5 (disc) and Xbox Series X (disc or digital). This game builds on the stellar College Football 25, EA’s first college football game in over a decade.\nIn case you missed its big relaunch last year, EA’s back to making annual college football games now that it has a way to pay players who opt in to have their name, image, and likeness included. Athletes were paid $1,500 each to be in this year’s title, and were given a free copy.\nEA Sports College Football 26\n\nWhere to Buy:\n\n $69.99 $49.99 at Amazon\n $69.99 $49.99 at Walmart\n $69.99 $49.99 at Best Buy\n\nSome more Verge-approved deals\nAnker’s compact Nano Travel Adapter in white or black is down to $19.99 at Amazon. It’s just small $5 discount, but this is something that’s worth jumping on if you’re planning international travel any time soon. Its slim design aside, I like that it has four ports (two USB-C, two USB-A), and support for Type A, I, G, and C plugs, which allows it to work in over 200 countries and regions, according to Anker. In terms of USB power, it’s on the slow side — best for when you want to charge gadgets overnight. For instance, one of the USB-C ports can deliver 20W to a device, or you’ll get 15W total when you’ve got two USB-C devices plugged in. Using all four ports will split 15W across devices.\nAnother inexpensive accessory that’d be great for travel, or even just for your daily commute, is Anker’s Soundcore Space A40 wireless earbuds that have active noise cancellation. They’re typically priced at around $79.99 at Amazon, but they recently dropped down to $44.99 in the white, blue, or black. This model can last 10 hours on a charge, and its wireless charging-supported case can fully recharge them five times, totaling 50 hours of playback. These also support multipoint, letting you connect to two devices at once via Bluetooth.\nLastly, there’s a solid deal happening Logitech’s G203 wired gaming mouse at Amazon, where the black version with RGB LED detailing costs $18.99. This half-price discount is great for PC gamers on a budget, as well as for others who want a comfortable mouse with some customizable buttons and lighting. In addition to its two main buttons, the G203 has two thumb buttons, a tactile scroll wheel, and a DPI switcher on its top to change pointer sensitivity. It’s nothing fancy, but you may find this sub-$20 mouse meets all (or at least most) of your criteria.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc6164b3c48735cd8864f95b894dd5a56b2ec2bf",
      "title": "Jacinta Nampijinpa Price has shown how damaging she can be for the Liberals – and left Sussan Ley holding the bag",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/jacinta-nampijinpa-price-has-shown-how-damaging-she-can-be-for-the-liberals-and-left-sussan-ley-holding-the-bag",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T15:00:49.000Z",
      "summary_90w": "",
      "raw": "Price has walked back her comments about migration but not explicitly apologised. Ley faces the difficult task of rebuilding trust with the Indian community\n\nGet our breaking news email, free app or daily news podcast\n\nSussan Ley had three options to deal with Jacinta Nampijinpa Price when the Liberal leader was putting together her first frontbench in late May.\nAll carried risks.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4aeb1cbbb0790e8d82a2bd5a3c4d465cbcf43024",
      "title": "Y Combinator-backed Motion raises fresh $38M to build the Microsoft Office of AI agents ",
      "url": "https://techcrunch.com/2025/09/08/y-combinator-backed-motion-raises-fresh-38m-to-build-the-microsoft-office-of-ai-agents/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T15:00:00.000Z",
      "summary_90w": "",
      "raw": "In his early 20s, Harry Qi left a million-dollar-per-year hedge fund job to join Y Combinator. His SMB AI agent startup is now growing fast.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a46e8f9cd4714ea6b2f2c81cff14f69fb6b718ab",
      "title": "Spotify’s new ‘smart filters’ let you screen library content by activity, genre or mood",
      "url": "https://techcrunch.com/2025/09/08/spotifys-new-smart-filters-let-you-screen-library-content-by-activity-genre-or-mood/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T14:50:40.000Z",
      "summary_90w": "",
      "raw": "Spotify is launching a new feature that allows users to filter their library by specific activities, moods, or genres. These filters can also be used to find playlists, or, to some extent, audiobooks and podcasts, and can even kick off a new session on Spotify's AI DJ.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4cc9906e4f35ed8065bb0ef66557c6e612bbb3",
      "title": "Man City & Premier League end sponsor rules dispute",
      "url": "https://www.bbc.com/sport/football/articles/cy7pk8xyy7go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T14:43:37.000Z",
      "summary_90w": "",
      "raw": "Manchester City and the Premier League reach a settlement in their dispute over the rules that govern commercial deals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13bc6a386f4f1aa3b39c3490503ef6dd10805ca5",
      "title": "Adtech company PubMatic sues Google over monopoly violations",
      "url": "https://techcrunch.com/2025/09/08/adtech-company-pubmatic-sues-google-over-monopoly-violations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T14:41:49.000Z",
      "summary_90w": "",
      "raw": "The lawsuit marks the second time that an advertising exchange has sued Google since a federal judge ruled in April that the search giant had illegally monopolized ad exchanges and ad servers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6f9104b326b7f9bbf50029f3d73e35f2879ba90",
      "title": "EchoStar offloads satellite spectrum to SpaceX for $17 billion",
      "url": "https://www.theverge.com/news/773645/echostar-dish-spacex-starlink-direct-to-cell-fcc-investigation",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T14:36:17.000Z",
      "summary_90w": "",
      "raw": "Dish parent company EchoStar is selling wireless spectrum licenses to SpaceX for around $17 billion, the companies announced on Monday. SpaceX says it will use the spectrum to create the “next generation” of Starlink’s cellular satellite service, which customers of the EchoStar-owned Boost Mobile will gain access to as part of the deal.\nAccording to EchoStar, this deal, along with the previously announced $23 billion sale of 5G spectrum to AT&T, is expected to resolve an investigation by the Federal Communications Commission.\nIn May, FCC Chair Brendan Carr opened a probe into EchoStar’s 5G expansion after receiving a complaint from SpaceX, which claimed the company “barely uses” its spectrum for satellite connectivity. EchoStar had originally planned to use its AWS-4 (2GHz) spectrum band to enable direct-to-device satellite cell service, but this sale puts an end to that goal.\nIn the press release, EchoStar CEO Hamid Akhavan said the deal will allow SpaceX “to realize the direct-to-cell vision in a more innovative, economical and faster way for consumers worldwide.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c502c1dc2a567ac551fdf8439085f46f8210b6ca",
      "title": "Southport survivor says scars a 'daily reminder'",
      "url": "https://www.bbc.com/news/articles/ckg3dg7k9qzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T14:34:55.000Z",
      "summary_90w": "",
      "raw": "The public inquiry into the Southport attacks resumes with more evidence heard from the survivors.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0692102e7c9db29a2df1059d7714d3a9b967cf2c",
      "title": "Get behind the scenes at TechCrunch Disrupt 2025 by volunteering",
      "url": "https://techcrunch.com/2025/09/08/get-behind-the-scenes-at-techcrunch-disrupt-2025-by-volunteering/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Volunteering at TechCrunch Disrupt 2025 is one of the best ways to see how the magic happens — and learn what it takes to pull off a world-class event. Apply before applications close on September 30.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c33d0e85d60e8690bf1b53044d0b88d9360ab833",
      "title": "How a shoot-out ended a four-year search for a NZ bushman and his three children",
      "url": "https://www.bbc.com/news/articles/cly0279yervo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T14:19:33.000Z",
      "summary_90w": "",
      "raw": "After a handful of chance encounters and brief sightings, the fugitive was shot dead on Monday morning.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27e06763f559cd99d32f31c076e8befda993e822",
      "title": "At least 19 dead in Nepal after Gen Z protests at corruption and social media ban",
      "url": "https://www.bbc.com/news/articles/c78nd2zy9jgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T14:18:24.000Z",
      "summary_90w": "",
      "raw": "Young protesters are demanding the government lift its social media ban and tackle corruption.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3eb51549c4fd9ed75b52cccb16274116166adabf",
      "title": "This is what could happen to a child who doesn't get vaccinated",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/08/g-s1-87121/vaccines-measles-diarrhea-pneumonia-sudan",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T14:16:13.000Z",
      "summary_90w": "",
      "raw": "An estimated 14 million kids don't get any vaccines. They face serious threats from measles, diarrhea, pneumonia and more.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eeeb28dac3cbd5537c3daa6a0004dc6222764ebc",
      "title": "Arco is stunning sci-fi with shades of Moebius and Miyazaki",
      "url": "https://www.theverge.com/toronto-international-film-festival/773517/tiff-2025-reviews-arco-good-fortune-sacrifice",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The best part of going to a film festival is finding something new. Sure, it's great to find out that movies you're excited about are in fact good - I've had luck so far with Exit 8, No Other Choice, and Wake Up Dead Man - but it's so much more exciting to be surprised by something when you had no expectations going in.\nThat's what happened to me when I walked into a theater to watch Arco, an absolutely gorgeous animated film from director Ugo Bienvenu, on day 4 of the Toronto International Film Festival. For the animation nerds out there, it's sort of like a cross between Scavengers Reign and Time Masters, with a hint of Castle in the Sky. …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fcec7830bed618f50fb97d6ecde79335beab56c0",
      "title": "Sal Khan is hopeful that AI won’t destroy education",
      "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/766082/khan-academy-ceo-sal-khan-ai-education-schoolhouse-hank-green-interview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Hello, and welcome to Decoder! This is Hank Green, cofounder of Complexly, where we make SciShow, Crash Course, and a bunch of other educational YouTube channels. I’m also an author, a TikToker, and what you might call a poster — you might have seen my face on the internet over the years.\nYou might also remember last year when I turned the tables on Nilay and interviewed him on his own show, because what better Decoder guest than Nilay Patel? That was a ton of fun, and it was so much fun that they’ve brought me back again. This time, I’m stepping in for Nilay to host a few Decoder episodes while he’s out on parental leave. And because I cannot interview Nilay — that would defeat the whole purpose — I instead found some really great people to bring on the show to have conversations with.\n\n\n\nListen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems. Subscribe here!\nToday, I’m talking with a very special guest — someone who I’ve known for quite a while as what you might call a colleague in the online education community: Sal Khan, the founder and CEO of Khan Academy. Sal was actually Nilay’s second guest on Decoder, back in 2020. And, well… a whole lot has changed since then. \nYou’ve probably heard the name Khan Academy by now. The company was officially founded in 2008, but Sal actually posted his first educational videos on his YouTube account in 2006, just a year after YouTube was created. He even beat my brother John and I by about a year to his very first YouTube upload — so that’s impressive.\nSal has been around for a long time. He’s seen the growth of the online video ecosystem, alongside the online education industry, up close for nearly two decades. That’s precisely why I wanted to have him back on the show: I wanted to ask Sal not just what it’s like running Khan Academy, one of the biggest and most well-funded educational nonprofits in the world, in the aftermath of the covid-19 pandemic, but also how it’s about to change due to artificial intelligence. \nI’ve been thinking about the intersection of AI and education pretty deeply for a few years now. And as we’re coming up on the three-year anniversary of ChatGPT’s launch, it’s something that has me equal parts fascinated and terrified, especially because it seems like it’s moving awfully quickly, and we’re only just starting to really grapple with the effects of this technology on the classroom. \nI think you’ll find some really surprising answers from Sal on these very hard questions, and I hope you’ll learn a lot, too. I know I did. \nOkay: Khan Academy CEO Sal Khan. Here we go.\n\n\nThis interview has been lightly edited for length and clarity. \nSal Khan, you are the founder and CEO of Khan Academy. Welcome back to Decoder. I am so happy that I get to talk to you, and the only thing that I’m not happy about is that I don’t get to do it for three hours because I feel like there’s so much I want to ask. \nI think that people probably have heard of Khan Academy because now it has been around for a very long time at different moments of its history, or they’ve interacted with it in different moments of its history. Can you just give us a look at what Khan Academy is in 2025, which might be somewhat different from a video that someone watched at some point? I think people don’t know how big you are, basically.\nOh, yeah. In some ways, the true north of Khan Academy has been surprisingly consistent. But yes, the way people might perceive it has maybe changed. If you were to go back 15 to 20 years, people might associate it with math videos that some guy made for his cousin. And today, I mean, we still have videos and things like that, but our true north has always been how we can leverage technology to scale up what we think world-class education could look like. \nOur mission statement as a nonprofit is to provide free world-class education for anyone, anywhere, and these are ideas like personalization or mastery learning. People should be able to practice and get feedback as much as possible. So over the years, most of our resources have actually been on our software platform, which is free, available for everyone, and philanthropically supported. Today, just to give you a snapshot, we’re in 50-plus languages.\nI think the latest number is 180-something million registered users. I think the big push that’s very different from where we were 15 years ago is that we do a lot of formal partnerships with school districts. We started off as a very direct-to-consumer thing, which we still do, but we realized if we really want to move the dial for real students everywhere, we have to work with their school districts. We have all these efficacy studies showing how it can improve their outcomes, but it really needs to be in a classroom setting for most students for it to work.\nThis is wild because I chose the exact opposite. I was like, “Okay, we make YouTube videos for people that help them learn, and if people want to use them, they can use them. But man, do I not want to get involved with the process of selling something to a school board or dealing with administrators.”\nHow did you start to take that on? I mean, trust me as a person who’s dabbled in it a little bit, it’s a different business than building a tech product or making a YouTube video to actually get in there and interface with the bureaucracy a little bit. That is, I mean, I agree with you. I think that Complexly would be a more impactful organization if we did that, but we have chosen the path of personal joy to not have to do it.\nYes. And I had some similar feelings, and I had other thoughtful people give me even more of those feelings. It’s like, “Are you sure you want to do this?” But the reality is, and this is what I found very promising about our structure, that our philanthropists who were donating to Khan Academy, and our board, really were nudging us in this direction. They were saying, “Look,” and the first nudge was, “Okay, you’re popular. A lot of people are using you, but how do we know it’s working?” And so we started running all these efficacy studies.\nWell, look, it works, and  it works more than the videos. The videos are part of it, but when students practice at their own pace, and in the studies, we see if they’re even able to put in 18 hours over a whole year, which is not that much over a year, these kids are accelerating by 30 to 50 percent. There have been 50 or more studies like that.\nBut then our board and the philanthropists said, “Okay, well, that’s nice. It works and you have a way to get to scale, and you have a lot of teachers already using you, but how do you make sure all students are able to use you?” That’s when the answer became school districts. So, we went to school districts and they said, “Well, to use systemically, you’ve got to give us support, training, integration with our rostering systems, and district-level dashboards. You have to meet all the accessibility guidelines.” That’s when we said, “Okay, if we’re serious about moving the dial at a state, national, or global level, we have to build this ground game.” So we’ve been doing it for about seven years. But, in my mind, it’s gone better than I expected.\nReally? I mean, it’s gone very well, but I guess that’s true of me as well. It does feel that there was a gap waiting to be filled, a little bit. What kind of organization do you think you are? You’re not really a content company. Do you think you’re a tech company? Are you an education tech company? How do you think of Khan Academy?\nSo, the way I’ve always aspired to think of Khan Academy — I’ve always daydreamed this way, and hopefully I’m convincing other people — is to view us as a global learning institution. The same part of your brain that might think of an Oxford or a Harvard, it’s like, “Wow, those are storied institutions.” But then part of your brain says, “Yeah, but they don’t really scale. Their research scales, but their education side doesn’t really scale.” If Khan Academy could say, “Wow, it’s like that.” Hopefully, in a hundred years, people will say, “Yes, this is one of the major institutions of our world, but it scales. It’s high quality, it’s very affordable, arguably free or very close to free.” So that’s what I’ve always aspired to be. \nI think in real implementation, 15 years ago, we were known most for our content. Maybe we are still most known for our content, and then we actually have a pretty large software engineering team to build everything around the content, the practice, the data dashboards. \nNow, as AI might be able to create content in the not-too-far-off future, I think we are turning… well, we’ve always been, but I would say there’s even more weight being pulled onto how we create systems that can help raise the ceiling inside of a school, but also raise the floor outside of a school. Those systems can be software systems, AI systems, but there could also be credentials, ways to connect students with each other. We have a sister nonprofit called Schoolhouse, where there’s peer-to-peer support. So how can we build these systems so we can do high-scale, high-quality education?\nSo I do want to talk about Schoolhouse, and I want to talk about AI. I still want to talk a little bit about the moment when you were starting to do this thing. Was there a thought in your head of, “This could be a company, or it could be a nonprofit, this could be for-profit or nonprofit”? \nOh, yeah.\nDid you make that choice?\nYeah, it was a pretty explicit choice. In the early days, I was living out here in Silicon Valley. There are some VCs who took notice back in 2007 or 2008. The first conversation was fun. They said, “Hey, I’ll write a $100,000 check right now. You quit your job. We’ll start Khan Academy as a for-profit.” But then meeting two was always like, “Okay, let’s talk about monetization, and maybe we’ll do some freemium content, or we’ll do test prep. We’ll charge for that.” And there’s nothing wrong with that. I don’t want to get too all high and mighty for anyone who does have a model like that. But I just thought about how much psychological reward I was getting from people all over the world. \nYou get this, too, like, “Hey, thank you. That really inspired me. That really helped me.” And yeah, I did have a bit of a grandiose dream that maybe this could be — I always cite the Foundation series by Isaac Asimov — that maybe I could be something like a Hari Seldon creating the new Foundation that will keep us from entering a dark age, or maybe it’ll make today look like a dark age because everyone’s going to get educated. So I didn’t want to give up on that dream. \nThat very chill, not at all grandiose dream of being Hari Seldon. \n[Laughs] Not megalomaniacal at all. Very grounded. But, you know, why not? From my point of view, the good reasons why people will often say go for-profit are access to capital, and maybe access to people because you can pay them with equity, or maybe you could, at least in theory, pay them a little bit more, even cash-wise. There’s sometimes a stereotype that has some truth in it that nonprofits may not quite be as nimble or as vast. \nI had never started a nonprofit before, but I always had a little bit of a chip on my shoulder, and still do. Like hey, I think we can get the best of both worlds. We can be a nonprofit, we can have this mission. We can try to build this institution, but we can also attract the best talent. Yes, we can’t give them stock because there is no stock in Khan Academy. No one owns Khan Academy; I don’t. But we can pay them well, and you can run an organization like this as nimbly as any organization anywhere, but because we’re a nonprofit, we have some advantages. \nWe have 50 languages. We didn’t pay to translate many of those languages. People came out of the woodwork. People, especially in this time of AI, have a bias toward a little bit more trust. Some of the best people in the world don’t want to become billionaires. They’re happy if they can have an upper-middle-class lifestyle and get to work on a fun mission with other cool people.\nSomething that matters. \nSo we’ve been able to attract some really amazing people.\nDo you ever have a moment of regret that you didn’t do a for-profit and that you get to be Hari Seldon, but you don’t get to have a billion dollars?\nOn this journey, I’ve had to raise a lot of money, where our budget now is pushing-\n[Laughs] Yeah, that’s because you never get any of it. \nWell, I’ve raised and I’ve met many billionaires, wonderful billionaires. Khan Academy would not exist without these billionaires’ significant donations. And there’s been a couple of moments where, I won’t name names, but a couple of these folks who you and I grew up reading about, and we probably fantasized in our middle-class houses or me in my lower middle-class apartment, saying, “Oh, imagine if I had that much money, I would do this and this and this.” And they’ve told me, “Hey, Sal, I envy you.” And I’m like, “You don’t really envy me. I’ve seen how you travel. You should see how… I just got upgraded to economy premium.“\nBut they were very genuine. I’ve heard this from at least three or four folks now. They’re like, “You’ve really found your passion and it’s really making a huge difference. I feel lucky just to be part of this journey.” That counts for a lot. And God bless them and what they do, and God bless them for donating to Khan Academy and making it possible. But I honestly wouldn’t trade places at this point. Now, could I figure out a way to spend a few more million dollars? Yeah, probably. \nDo you think that it could have increased your impact if you were pushing for market share, pushing for all of that stuff with an investor breathing down your neck kind of incentive?\nTo some degree, the experiment has been run. There were several organizations that were, let’s call it, the same vintage as Khan Academy, plus or minus a few years. I would say most notably the MOOCs, the Massively Open Online Courses. I know many of the people who started them; they’re very good people. They weren’t in it for the money. They were in it for the mission, but they were convinced by people. I was trying to convince them to go nonprofit, but “No, you’re not going to get the capital. You need that for profit.”\nIf you look at the MOOCs now, the ones that exist, they have fallen, and I don’t want to denigrate them. I think they’re still doing things of impact, but they were about “let’s democratize college education, let’s do something that’s world-changing.” Now, the ones that still exist have become “let’s do some certification post-graduate that might help some people transition into a data science type of thing,” and it’s just a smaller vision. I mean, I’m sure they’re still helping those people, but they haven’t democratized higher education, I think, the way that they could. So when I look at that, I think, “No, I think it’s priceless to still have the dream alive.”\nThe experiment has been run, and Khan Academy is very big, hitting a lot of eyeballs, and helping a lot of people. But there’s this sort of trope that a nonprofit is going to be less nimble. It’s going to be harder to run. There’s going to be more stakeholders, more consensus building. \nHow do you organize yourself? How is Khan Academy organized? Do you keep that as a priority, and how is that built into the structure of it?\nYeah, I mean, look. When I was in business school, I had a classmate, and it was really funny because we had this case discussion, and he was talking about how narcissistic it is for people to name organizations after themselves. And his dad, I won’t name names, had named an organization after himself, a very large financial company. Everyone was laughing about it, but I remember that I was like, “Yeah, it’s super narcissistic to do that.”\nBut then, when Khan Academy started to grow, it wasn’t called Khan Academy, and I said, “Well, maybe this could be something, but I wanted to make it a nonprofit.” I said, “Well, how do I make sure that, with my insecure side, how do I make sure that it’s hard to fire me?” They have to have a good cause, and how do I make sure that there are no shares here? I’m not like Mark Zuckerberg, who controls the voting interests of Meta. I have a vision, or I think I do. And well, my name on the door and becoming a certain quasi-mascot of the organization have helped. One, keep it focused on the vision. And frankly-\nAnd having a source of the vision, where if there’s disagreement, people know where to go to get that disagreement settled.\nExactly.\nThat’s probably not always the funnest job to have, but it’s a thing that exists.\nYeah, and any executive manager or CEO has to have some of that in their job. But especially when an organization needs to make big pivots. I know we might talk about AI, and Khan Academy’s been doing a lot of pivoting there; it would’ve been very hard for someone who didn’t start the organization whose name’s not on the door to be able to make that type of a pivot. The lucky thing is, we have a great board. Many of them are major philanthropists, but some of them are people who just know a lot about education, and they push me in all the right ways. They’re always pushing, “Are we reaching the kids who need impact?” The trade-offs between investment and overstretching our budget, we think about that very seriously all the time.\nBut they also see that not just me, but a lot of the people that we’ve brought into the organization are, I’d like to believe, pretty disciplined managers, engineers, designers, project managers, and content creators. A lot of our funders are people who are successful tech entrepreneurs. I say, pound for pound, put our large team of 350 people against any 350-person team in Silicon Valley or anywhere else, and I think you’re going to find as good or better talent and nimbler systems. And they see that. So that’s what keeps us focused that way.\nSo 350 people. How is that organized from the board on down?\nThere’s the board. I’m on it, but obviously, I report to the board too, and then I have more than your average direct reports. I have 14 direct reports.\nMan, you work hard.\nWell, this is the thing I learned, though. If you have the right people in the seats, the people who report to me, they’re fairly senior in their careers. So I don’t have to spend a lot of time with angst, or the “what am I going to do with my life?” type of conversation. Kristen DiCerbo is our Chief Academic Officer. She also runs the product management, design, and content teams. We have a great CTO. Our engineering team is the largest. We have what we call the external relations team, which is our philanthropy, but also all of this work. We’re partnering with school districts, and that’s a revenue source for us too, an earned revenue source.\nWe have Khan Academy Kids, we have an internal council, we have our CFO, and all the internal functions. Then we have Schoolhouse.world, which I’m nominally the CEO of. I’m more of an executive chairman there. But the COO there nominally reports to me. So that’s kind of how we’re generally organized. \nBut there’s really good leadership across the board here. So I get to jump around and say, “Hey, have you thought about this?” Every now and then, because people have their heads down and they’re in the forest, I can kind of surface and say, “Hey, but look,” or they’re in the trees and I’m like, “Look at the forest here. We’ve got to pivot a little bit harder.”\nSo 14 direct reports, and that’s 14 different departments, kind of, and then Schoolhouse is a different thing?\nYeah, I threw Schoolhouse in. That’s all just my universe of people that I’m talking to on a regular basis. But yeah, it’s different departments plus finance, legal, a lot of the internal stuff that you have to do in running an organization.\nSo let’s talk a little bit about Schoolhouse. I think that people might not know that this is a part of Khan Academy, or that this is a thing that you do. I find it extremely impressive and so cool and so smart, and you’re the only one who could have pulled it off. Tell me about Schoolhouse.\nI’m happy to hear that. It’s funny, there’s been a little bit of controversy about Schoolhouse last week. I can tell you about that.\nOh, wow.\nWhich I think is a good controversy.\nIt’s going to be published like five weeks from now, so it’ll be six weeks old by then.\nOkay. In the recent past, there’s been controversy. We should talk about that. But the idea was, I’ve always thought, “Hey, it’s great if people can learn from Khan Academy, but what about learning from each other?” And the best implementations in classrooms have always been some kids using Khan Academy, but the teacher pairing kids up, and they’re also learning from each other. When the pandemic hit, I said, “Well, now is the moment to try to do something like this at scale.” \nSo we ran a little pilot and we said, “What if we created a website where young people” — actually, people who are learning, they don’t have to be young — “could say what they need help with, and then we could find other volunteers who can validate that they know the material?” So we needed a vetting process, but then they would tutor these people for free just out of the goodness of their hearts.” Zoom donated a bunch of licenses, and we tried it out. \nIt’s a very utopian idea, but it worked at the scale of a few hundred people. So then we got some philanthropic funding, and we set up Schoolhouse as a separate nonprofit from Khan Academy. Honestly, the only reason to do that is just to keep the two focused on what they each needed to do. There was a little bit of fear of liability with people having real conversations on Zoom, and what might happen to Khan Academy’s liability. So we kept them separate. The name was somewhat inspired. I wrote a book back in 2011, The One World Schoolhouse, so we called it Schoolhouse.world, although we might change it in some ways in the next couple of years to bring it closer to Khan Academy.\nBut we started doing it, and one of the immediate things we noticed was how to certify someone. How do we know that they know calculus, for example?” So we created a mechanism. Khan Academy already has assessments that are different every time, but we don’t prove that it’s you who did it. We said, “What if you take the Khan Academy assessment while it records your face, records the screen, you explain your reasoning out loud, and then Khan Academy will say whether you hit 90 percent?” You’re following a protocol, and you can’t be looking around and doing shady things. Then that video gets peer reviewed by people you don’t know to just make sure you’re not doing shady things.\nAnd then if you’ve got 90 percent on that unit, we say, “You know unit one of calculus, you can now begin your tutoring journey. And there’s some training for you there.” When we were doing that, the University of Chicago reached out and said, “Hey, everything’s up in the air with the pandemic. Could we use your certification for college admissions?” We said, “Yes, you can.” And then it was MIT, Columbia, Caltech, and now there’s a list on the website of 40-plus universities, including Yale and Brown. I mean, you can name them. They all said, “Hey, you could use Schoolhouse certifications as a way to prove your mastery.”\nPeople are like, “How are we going to do assessments in the future with AI and everything?” And Sal Khan’s already figured it out.\nWell, AI is going to add a whole other layer. I mean, I think we’re going to be able to do some nice simulation-based assessments and things like that. A fun example: I just met this young woman from Afghanistan three weeks ago, and obviously, she could not go to school growing up in Afghanistan. Khan Academy was her school. The Taliban take over Kabul, and her family becomes refugees in Pakistan. She’s still not in school, but she’s been learning all this time. She wants to go to MIT. She applies, and MIT is really impressed with her application, but she has no diploma, no formal transcript, no SAT scores, no AP scores, nothing. MIT asks, “Can you go on Schoolhouse and validate yourself?” And she did. \nShe got in based on that, and I just met her. She was at this Y Combinator event for the top AI engineers in the country, out here in Silicon Valley. My wife and I took her out to a little meal, and I was like, “Yes, this is the certification vision of Schoolhouse.” It’s pretty powerful to hear stories like that. This is where some of the controversy started coming from, but I think it’s a good controversy. The same college admissions folks, they weren’t just interested in the certification, they were also interested in the kids who tutored, because you could imagine if you certified yourself in calculus and then tutored calculus and had a high rating-\nWho incentivizes people to actually do the tutoring, because it isn’t paid? But I can say, as a person who tutored kids when I was a kid, that’s so powerful in just knowing the material better, if not also putting that on your little kiddo resume, or whatever they make them do these days.\n[Laughs] Exactly. Well, if you’re one of these colleges and there’s a lot of cynicism around people gaming and et cetera, but if young Hank ran 100 sessions tutoring chemistry, and he has a 4.8 out of 5.0 rating, and there are these quotes saying, “I learned more from Hank than I did at my school,” or, “He makes me excited about chemistry.” If I were one of these universities, I’d be like, “I want Hank on my campus. That’s the kid I want.” \nBut we went to these universities, said, “What else could be of value?” They said, “Well, this is probably too hard, but what if we could give students practice in having dialogue about hard subjects? We don’t want them to water down their passions, but we want them to be able to have constructive dialogue because everyone’s in their bubble now.” Geographic bubbles, socioeconomic bubbles, social media bubbles.\nSo, that’s when we launched this Dialogues platform, only a couple of months ago. Most people would get anxiety, just as I’m about to describe this, but we make young people fill out surveys on tough issues — immigration, Israel-Palestine, affirmative action, and gun control. I could go down the list, the stuff that we are afraid to talk about at dinner parties, and kids fill out a survey. We pair them with kids with the opposite viewpoint, and they have a conversation. After that conversation, which usually goes about 50 minutes, they fill out a questionnaire: You don’t have to have convinced them, but we ask, “Do you feel like the other person heard you?” And “do you think they can represent your point of view? Can you represent their point of view? Is there any feedback you want to give to that other person?”\nIt could be constructive or it can be positive feedback. You do as many sessions as you want. And then on your transcript, it just says how many sessions you participated in. It doesn’t say what your point of view was. You can highlight anything. You choose to highlight. “Hey, Hank said that Sal really opened your mind to a different viewpoint that you never took seriously before.” Whatever it is. I could put that on my transcript. And if I want to, I could share that with many of these same universities.\nThe controversy is that there’s a New York Times op-ed that argued, “Oh, this is just another thing to fake in college admissions.” And Nate Silver tweeted, “This is affirmative action for boring kids.” All of a sudden I’m like, “No. How can it be boring? How can it be?” It’s not boring to be willing to have an open conversation about these topics, and be able to do it constructively.” And with what we’ve seen, these kids aren’t holding back. They’re holding their positions, but they’re doing it in respectful ways.\nAll I have to say about “this is affirmative action for boring kids” is that’s a tweet. That’s such a tweet. And I’m so tired of tweets. I mean, I’m a tweeter, don’t get me wrong. I post.\n[Laughs] I’m not.\nRight here. I post. I post way too much. I want to live that Sal Khan life, get off of these postings, but I post. But man, is that a post. That’s pure “I’m going to have the take that everybody’s going to feel good about, even if it makes no goddamn sense.”\nOh, man.\nWell, that’s fascinating and does make me sweaty. That’s not a choice that I think I would’ve made. That seems bold. \nIt’s brave.\nYeah… did you just call yourself brave?\nNo, I’m saying the students are brave. I actually haven’t… I’ve observed some of these… Well, it’s a little brave of me, on my part too.\n[Laughs] It is. I think it’s brave on your part.\nI’m saying it’s the opposite of boring. These students are brave enough to do that. I haven’t been able to do it because if I were to get on Dialogues, the kids will say, “Oh, that’s Sal Khan, and did you know that Sal Khan has this view about the Middle East? Did you know that Sal Khan has this view on immigration?” I’m like, “Nope, not going to be constructive.” So I can’t participate in it.\nThat’s probably ideal. I probably won’t be on there either, but I think it’s a brave decision for an organization to make. Which leads me to a Decoder question. How do you make decisions? How does Sal Khan make decisions?\nHow does Sal Khan make decisions? I always try to remind myself and the other people who are involved in decisions what we’re trying to solve for to begin with. There’s a friend who’s a very successful venture capitalist, and I’ve made fun of him in the past, but he has this hack that always makes him look brilliant. You go about half an hour into any meeting, and he will say, “Hey, hold on a second, everyone. Let’s take a step back. What are we solving for?” And he looks brilliant, and everyone’s like, “Oh, yeah, we lost track of what we’re solving for.”\nIt’s true. Thirty minutes into a meeting, most people are getting into the weeds, and you’re like, “No, what we’re solving for is how we get more students to participate in society.” So it’s important to have those true norths. And then yes, I try to listen to people who ideally are as close to the ground as possible on what they have to say, and then try to make a call that both makes sense intellectually and hopefully takes the path of less cynicism and more like “maybe the world can work this way; why don’t we just try?” People say gut sometimes it’s like that’s a lazy way of doing things, but your gut has a ton of neurons. Our gut, as you know, would be a fairly smart animal if it were just on its own.\nI don’t think the gut’s actually making the call here, but yeah.\nBut the gut is really… We have these neural nets. We have these hundreds of billions of neurons that are doing things subconsciously all the time. \nYeah, there’s a lot that we don’t know about.\nAt some point, they’re just giving your conscious mind a memo saying, “Yeah, I think this is the right decision.” So, at the end of the day, if you have a good true north, if your gut has paid off in the past, and you’re surrounded by people who are advising you for the right reasons, and you make a call…It is also important to have folks around you who are willing to disagree and commit. Like, “Hey, once we make this call, let’s try our best. Let’s not grumble and be passive-aggressive after that.”\nSo maybe you can walk me through that process a little bit, because I want to talk about Khan Academy starting to use AI tools. \nI got a call from you a couple of years ago, and I remember pacing around my basement during this phone call when you told me about you going into AI tools. I thought, “Man, I would not make this call right now. I do not know where this is going. I don’t know what the public opinion around it is going to be. I know it’s going to be complicated and weird. I don’t know where it’s headed. I don’t know how powerful these tools are.” \nBut I also thought, “More power to him for heading straight headfirst into it.” This was very early. This was right after GPT-4 launched. How did you make that particular decision?\nYeah, and I mean, I remember our call. I don’t remember exactly when that call was in the whole timeline, but we actually made the decision well before GPT-4 launched.\nYeah, but this was after. \nYeah, so I probably couldn’t talk to you about it then. It was probably as soon as we were out of our NDA with OpenAI, and I probably called you and said, “Hey, maybe there’s something here.” But it was the summer of 2022, so roughly three years ago. I received a call from Sam Altman and [OpenAI cofounder] Greg Brockman. They said they’re working on their new model. They wanted to show it to us because they thought maybe there’s something interesting about Khan Academy, showing positive social uses of it. I was curious. \nWhat they showed us was GPT-4, and this was well before ChatGPT. This was about six months before ChatGPT existed. ChatGPT, for those who remember, wasn’t even launched on GPT-4. It launched on GPT-3.5. It blew my mind, and honestly, even when they showed it to us, they hadn’t fully appreciated it. \nThey ran a demo with us, and they said, “Do you want access?” I remember it was a Friday, and they gave us access, me and our chief academic officer. I was messaging with Greg, and I said, “Hey, does this work in other languages?” And he wrote, “I don’t think so.” I barely speak Bengali. I tried to speak, and it spoke back, not only to speak back to me in Bengali, but it also wrote in Bengali, which I can’t read. But then I said, “Can you translate that into English text?” I was like, “Wow, it could speak Bengali.” I took a screenshot and I sent it to the OpenAI folks, and they’re like, “Yeah, after you asked, we checked. It looks like it can speak every language.”\nSee, this is why I would’ve said no. I’d be like, “You guys don’t even know what languages it speaks?!” \nThere are all these emergent qualities. It’s fascinating. I have this other friend who’s a professor at Stanford, and he’s trying to understand how, apparently, you could go from one language to another as a rigid transformation in a multidimensional space. That’s why it can talk about things in Bengali that it never got trained on in Bengali. Anyway, there’s some deep linear algebra there. \nBut this was very early on, and this was another thing I didn’t realize that we were doing. A year after that, after we had launched… well, immediately, like, that weekend, I couldn’t tell anyone about it. We had signed an NDA, but I was up all night. I asked [GPT-4], “Write the Declaration of Independence in the tone of Donald Trump, and it did it: “George III’s a loser, we’re going to have the best country.” It was actually a pretty good one.. But then, when I said, “Hey, you are an empathetic tutor” — I think the exact prompt I said is, “You are Robin Williams in Dead Poets Society, and you are going to Socratically tutor me,” because I knew this could be used for cheating, too.\nBut it was able to do that. Even though it made errors and experienced hallucinations, there’s something real here. So, we started. Well, we got most of the Khan Academy team under the non-disclosure agreement so that we could see it. About a month into that — and this is still months before the rest of the world even knew that this was coming — our team was surfacing all the fears: the cheating, the safety, the privacy, the hallucinations, the math errors. \nBut I was pretty convinced. I said, “Look, yes, those are real fears and errors. We need to turn those into features, but this is going to be so powerful, and it’s getting better so quickly that if we don’t really lean into this with our mindset and our mission-focused mindset, other people are going to use it. And those people are not going to care about whether it’s cheating. They’re not going to care about whether it’s good for kids. And honestly, this stuff’s going to be so scary for people that they’re going to need, hopefully, someone that they can trust. Someone who’s built up trust over time.”\nSo that’s when we leaned in. It’s interesting that ChatGPT has emergent phenomena. The day that product came out, on November 30th, 2022, I messaged the OpenAI team. I said, “Wait, we’re under a non-disclosure agreement. We’re not supposed to announce any of this stuff until March. What did you guys just release?” And they said, “We didn’t release anything. We just put a chat interface on an old model that’s been out for like seven months, and the world exploded.” \nIt’s interesting. Some kids in a garage or at a college campus could have done that and now have ChatGPT. No one did it. But even that was a shock, that you just put a chat interface on these existing models and it makes people think about it differently.\nWild. How do you actually turn ChatGPT or any LLM or GPT model into something that is useful for a student? So you have to work in math that works. You have to try to obviate hallucinations. You have to put walls around it so that it doesn’t do things you don’t want to do or be too sort of friendly with students in whatever way. It has to look and feel like a tool. How do you actually functionally do that? What do you do to it?\nIt’s evolving, because the models are changing, and just people’s expectations around these things are changing so fast. But some of our original thoughts, I think, are still true. There are some just basic prompts you can do. I say basic prompts, but when you want something that can robustly work for millions of folks, the prompt has to be quite careful, and you have to create all sorts of systems to test. But to say, “Look, this is going to be Socratic, use these techniques. You’re not going to give answers, but nudge students forward.” There’s a lot more to it. But that’s the gist of it. \nYou’re going to want to have some level of transparency and oversight, especially if you’re talking about under-18 students. And transparency buys you a lot. It doesn’t just buy you safety. If a student is saying, “Hey, I want to learn how to build a bomb,” or “I want to hurt myself,” it’s important to not only have teachers or parents be able to see it, but also to have another agent that can see that and actively flag it. We avoid hallucinations from the get-go. The models themselves have gotten a lot better over the last two to three years, but you anchor it on content that you know is good, and we have a lot of content.\nDo you have a big context window that has a bunch of true facts in it or something?\nNo. There are two ways that you can do it. One is, if you’re using our tutor — which we’re calling Khanmigo in Khan Academy content, like on a Khan Academy article or Khan Academy video — it has that content context built into it. Or if you’re getting help on an exercise, it knows we’ve passed it the solution to the exercise, so it won’t hallucinate, make math errors, or very infrequently make math errors in those cases. So that’s one: anchor it on things it knows.\nThere are also these things called vector databases. You could put a lot of content in these databases, where, based on the conversation that you’re having with the AI, it can find which pieces of content are closest to this conversation and then throw those things into the context window. You don’t have to throw everything in the context window yourself. Google now has some models where you can have like a million tokens, or roughly a million characters, in the context window. So you can actually throw a lot in there. Your average book is like 40,000 words. Well, actually, it’s not even characters. A token is like two-thirds of a word.\nSo, you can now throw a lot into context windows too, but that also has cost issues. The other guardrails, like transparency, there’s a lot that we do around the math to just double and triple check the math — just hacks like the AI calls another AI to go through reasoning that can come up with every possible way that the student might approach it, then compare the student’s answer to that. So there are things that we’ve been playing with that have improved the AI’s ability to do that. \nSo if I’m using Khanmigo and I get the question wrong, it might’ve already predicted that wrong answer and know that I got it wrong, like how I got it wrong.\nAnd what you’ve touched on is actually one of the hardest things. The AI models are actually pretty good at math now. They weren’t good at math two and a half years ago. \nRight. But now they call math out? \nThat’s actually what they do. They’re making Python calls behind the scenes to actually do the computation. The places where you still see the most errors are when the AI is evaluating the student. So let’s say the correct answer is one-third, and the student has put in 0.33, that’s not quite right. It should be 0.3 repeating. A good tutor would say, “Okay, are you sure that’s the full answer? Are you sure it’s just 0.33? How would you express that as a fraction?” \nSo yes, now what we have going on behind the scenes is the AI, even before looking at the student’s response, is saying, “What are reasonable responses here?” and then it compares. Or when the student gets an answer, it asks, “What are ways that the student might’ve gotten that answer?” and then it compares it. This is constantly evolving as the models get better, and we’re having to do less of that. But there is still a lot of that going on behind the scenes.\nOne thing I’ve noticed is that people always say, “Hey, you’ve helped me. You’re the reason I got a 5 on my AP exam or whatever.” And, “I think probably you had something to do with it,” is what I say to them.\nBut what I have learned is that there’s a big component of teaching that isn’t teaching. It’s motivational. It’s like the coach in the room who you have an obligation to and who will be disappointed if you don’t do the thing that they asked you to do. It’s a human being, and it’s easier to feel an obligation to human beings. Do you think that LLMs can play a motivational role? Is that part of this?\nYeah, I think over time. And they’re already playing [that role] a little. We’ve even implemented a little bit of that, just even for myself, I had to give some commencement addresses. I took my first draft, and I got an AI to give me feedback, and it made me feel good. I’m more confident now.\nIt sure does do that. If nothing else, it will make you feel good about your writing.\nI could have written a pretty trashy, bad speech, and it still probably would’ve given me positive feedback. But what you’re touching on is absolutely right. A lot of folks know Khan Academy started with me tutoring family members 20 years ago. When I really think about it, yes, I was explaining certain concepts to them, but a lot of what I was doing is exactly what you’re describing. I’d be like, “Hey, where are you? How come you didn’t do the thing I told you? Hey, look, you got to be a little more confident with how you answer these questions. Let’s lean into the problem,” or whatever it might be.\nSo, our realization with the first version of Khanmigo was that it just kind of sat there and waited to be asked, and then it would help you as you needed it. I say that’s analogous to a tutor walking into a classroom and saying, “Hey, kids, I’m here in the back. If you need me, come get me. But I’m here. I’m going to be reading a novel.” That’s not good enough. You want something that holds them accountable. \nThis new version we’re launching, which we’re piloting in the fall, is with the AI front and center. You come, and it’ll say, “Welcome back, Hank. It’s been a couple of days. We’re falling a little bit behind our goals. Are you ready to get started on this next task? This is what your teacher wants you to work on, and once you’re done with that, I have some ideas for you to work on.” Once you go into it, it’s constantly like, “Hey, look, you got that wrong. Not a big deal. I think it’s a good idea for a review of why you got that wrong.”\nThere might be some game mechanics. “Hey, if you review it, I’ll give you some points,” and things like that. But that’s the future. And yes, if we fast-forward a few years, we can all imagine having AI. A real human being is always going to be better, but a real human being is not always available. That can be an even better accountability holder for us.\nYou use a phrase for this: “It’s not the best tool, but the best available tool,” or something like that, right?\nYeah.\nDid I make up that you coined that phrase?\nThat’s not a me phrase.\nOh, okay.\nI mean, I’ve said stuff like if I had to pick between an amazing teacher and amazing technology, I’d pick an amazing teacher. But hopefully you can have both.\nI’ve also heard you say that replacing humans in education would be a disaster. I think that a lot of teachers, parents, and students would agree with you. How do you think we can avoid that fate? People are complicated and they’re expensive, and so it feels like lots of people would like for all the work to be done by things that are simpler and don’t complain. How do we avoid this fate?\nWell, one, I always like to point out to people the economics of our education system. Most people would argue that the teacher role has the most direct impact on the student of everything that you’re spending money on. But if you look at a lot of places, like California, which spends around $25,000 per student per year, it has about 25 to 30 students per teacher. A lot of East Coast school districts spend $30,000 to $35,000 per student. \nSo, depending on how you account for it, there’s as much as $800,000 per class of 25 to 30 kids. They’re not paying the teacher that. The fully loaded cost of a teacher with benefits, even a senior teacher with a pension and everything, may be $200,000, if you put all of that in there. It’s usually a lot less. So a lot of the costs of education are going into layers of other stuff. Some of that stuff is needed-\nYeah, buildings are part of it.\nBut if you had to cut costs, that’s not the way to do it. Now, I think AI might help in some of the back-office stuff. You might be able to automate the registrar’s office. You might be able to automate other functions in the office of a school, and that might save money. But I think we’ve always said, even before AI, that our goal is to raise the ceiling. Hopefully, you already have access to a reasonably good classroom and a great teacher, but it’s still hard for that teacher to personalize for 25, 30, or 35 kids. We’ll give them the tools to do it, but we also want to raise the floor. \nI’ve talked about this young woman in Afghanistan. She did not have access to a teacher, but she was unusually motivated, and it would’ve been sad if she didn’t have something. So, that’s where we raised the floor for her. We hear other stories. There’s a young girl in a Mongolian orphanage who used Khan Academy. There are kids in rural America who don’t have a physics or a calculus class within hundreds of miles of where they live. Kids in inner cities who don’t have calculus, physics, or chemistry classes at their school or an advanced one. That’s where we raised the floor. \nBut the ideal… I always point out that about 150, 200 years ago, when textbooks started to become a thing, a lot of teachers were afraid that those were going to replace them because teachers thought that, “Oh, I’m the source of the knowledge. Why would anyone come to me when they can read the whole textbook?”\nRight. There’s a book here.\nThere’s a whole book here with exercises and everything. But now teachers can’t imagine teaching without a textbook because they’re like, “Of course they need me still, but they need their practice. It’s good to have another resource.” I think that’s going to be the same thing with AI. \nA teacher who refused to use a textbook 50 years ago is going to have trouble. But a teacher 50 years from now who’s refusing to use AI might not be able to be all they can be. If they’re using the technology thoughtfully — and the AI is helping them form better human connections with the students, make more engaging interactive lessons, more personalized lessons, support certain students, while they can support other students, and they can tag team, and it can act as their teaching assistant —  it’s going to become invaluable for them.\nI’ve heard you say that the incentives of this sector, the education sector, which is the second-biggest industry in America, are strange. I think you used the word “strange,” and then the person you were talking to did not ask a deeper, further question. I was like, “Oh my God. Do I want to know all the ways that Sal Khan thinks the incentive structure of education is strange?” So, tell me, what are some of the strange incentives?\nYeah, and look, this goes back to the nonprofit question. I don’t think you need to make everything in the world a nonprofit. There are certain things that the private sector does very well. I am, at my heart, a capitalist. I believe the capitalist system generally works. There are certain things you want the government to do that the private sector wouldn’t naturally do or wouldn’t have the ability to coordinate. But there are certain areas where markets aren’t working; they aren’t doing what’s efficient or what’s aligned with our values. And maybe, for political reasons, or just because the government is too slow or bureaucratic to take advantage, that’s where the nonprofit sector matters.\nEducation — and I would say another major sector here is healthcare — is one of the areas where the beneficiary is the student, but the decision maker is typically the school district, and sometimes it’s the teacher. And the payer, in education, is the taxpayer. They’re three different entities, three different groups. You actually see a very similar thing in healthcare. Even if it was rational, we still also have this value that just as someone is bleeding and they’re dropped at the emergency room, you don’t want to say, “Hey, let’s see your insurance.” You want to treat them. Unfortunately, I think that might’ve happened sometimes, but you want to treat them first. \nSimilarly, if a young person in our society wants to learn, I think most of us feel that it should not be based on how much money their family has when deciding whether they should get a high-quality education. So, that value system, and the fact that these three agents all have different incentives, I think, is what has led to education not always having the most engaging, the most effective outcomes. A lot of the people in the district office are very well-meaning people, but there are certain guidelines and regulations they have to follow. A salesperson from a big publisher comes and tells them a good story. They adopt it. The kids hate it, but too bad.\nBefore we built our district offering, I couldn’t tell you how many times we would talk to a chief academic officer or superintendent of a district, and I would say, “Hey, why don’t you all use Khan Academy? Look at our efficacy studies.” And they’re like, “Oh, we believe you. My daughter swears by Khan Academy; it got my nephew through calculus, and even got me through statistics in grad school. But we have this vendor we adopted last year, and they’re on some state list that you’re not on, and we already wrote them a $5 million check, so I think we have to use them.” I’m like, “This makes no sense. Would you use those with your own child? Would you use them yourself?” And they say, “No, not really.”\nOh my god, yeah. That is what I’ve identified. My solution to that problem was simply to not engage with it. But what we have both done, I think, and to our credit, is that our first customer was the student, and that’s how we got into these places. We didn’t get in from the top down; we got in from the bottom up. \nI’ve seen several organizations, like for-profit companies, too, get into this business that way. That’s the way to do it if you actually want to help, whereas if your customer is the superintendent, then you’re going to have a pretty different set of structures.\nCan I ask you a question that is a real Hank Green question here? So once upon a time, I came across this large database of videos that had been scraped to use in a sort of database that anybody could have access to for training AI. And the only YouTube channel that I found that had more videos in it than the ones that my company, Complexly, had was Khan Academy, which indicated to me that they weren’t just grabbing every video. It was videos that had good information that we can trust, and that is more valuable. Does that make sense to you that that is why we got grabbed more than the average video?\nI think so, yeah. I don’t know about this database and all that. But even in the early stages of Khan Academy, even as a nonprofit, there’s definitely a bias, especially in Silicon Valley, to be more of a platform than to be focused on, say, the artisanal quality of whatever you’re trying to create. I would always point out that you don’t need a thousand explanations of L’Hopital’s rule. One good one might go a long way, but maybe four or five max [explanations], with different takes on it. \nIt’s actually sometimes been hard for me to make people believe that because it goes against this idea that “Well, that won’t scale.” I said, “No, it kind of does scale because L’Hopital’s rule isn’t going away any,” it’s not like we’re creating some news site or something. \nIt scales the same way a textbook does, except a lot easier because making another copy is basically instantaneous.\nExactly. And then we have interchangeable parts. If L’Hopital’s rule does get updated, we can just update that part.\nYeah, exactly. So given that, my question is: how do you feel as a creator of content about LLMs training on the stuff that we make? Do you think that they can learn the way anybody else can learn, or is there a difference in value offered by different content that should be compensated differently?\nIf I thought Khan Academy could get a meaningful check for this, I would love to take it. But generally speaking, in a world where let’s say I don’t have a choice — I mean, maybe I do — but let’s say there’s a world where I would rather our content be used for training. If a model in two or three years can create a stock tile video and draw diagrams that are helping people, that’s going to be net good for society, I think. So yeah, I’m generally supportive of it on the intellectual debate around whether we just view an AI as just a super smart savant that sees a lot of material and now can paint in someone’s style or write in someone’s style, or create a video in someone’s style. Or should we view it as, “No, it’s IP theft.” The courts are going to decide this.\nBut I’ve been kind of a little bit more on the savant side because, as we know, our videos aren’t directly encoded anywhere in these models. These models, literally, are learning to create and create associations of something similar. And there have been people who could paint in the style of Leonardo da Vinci or whatever. This is a similar thing, although on steroids, but that’s my current view. What about you? Are you like, “I don’t know”?\nI don’t know. Well, what I’m like is, “I’d like these things to make their way through the court so that we can all know, so that we can know what the legal situation is, regardless of how I feel,” because there is sort of a law intellectual property question here. \nSo, I want to kind of finish with this. You talked earlier in our conversation about content creation for artificial intelligence. Of course, already these things are creating content — what an LLM exports is content in a way. Maybe it’s just for you, but it’s still stuff. \nBut are you thinking that someday there will be an ability for me to say, “I need to know about Lagrangians,” and Sal Khan just sort of pops up and starts tutoring me on Lagrangians with a piece of content that had not previously existed, and you’re doing the thing, the digital chalkboard is happening, and I’m hearing your voice. Is that the future? Are you going to never die is kind of what I’m asking?\nThat’s my “you know, we’ll see.”\n[Laughs] Mr. Seldon.\nI mean, when you hear someone like Demis Hassabis talk about how all diseases will be cured in the next 10 years, it gives those of us who are about to be 50 a little bit of hope. But yeah, look, I think it’s only prudent that I, other content creators, and Khan Academy prepare for that reality. As best as we can guess. It’s likely to happen. It’s probably going to happen, I would guess, with really robust quality in probably three to five years. My vanity likes to think it’ll take longer. It might. We’ll see. \nOr it might be next month. And then our content can still be in some vault somewhere, like this is what people did before AI took over, or this was the source. It’ll hopefully still have an almost primary document value to it. Like, “Oh, Hank was like a real person and he talked about having an upset stomach that day,” and AI won’t do that kind of thing. Who knows?\nI think we’re going to give the AI some pretty upset stomachs. They won’t have stomachs, but something inside of them will feel-\nIt’ll talk about its stomach, it’ll talk about what it just ate, or what Hank just ate.\n[Laughs] Yeah.\nBut yeah, it’s coming, and I think we have to prepare for it, and we are building tools like the new version of Khanmigo and the teacher tools. We are having it so teachers can co-create content with the AI, including practice and administer it through the Khan Academy platform, like Khan Academy content, and then get insights back. So we’re trying to prepare for that reality.\nThis is wild. I don’t know. My take on what I make and the way I make it is that I think it would be hard. I also think that people connect to people. I think that if people don’t know that it’s not a real person, there will be a betrayal when they find out that it isn’t. If they do know that it’s not a real person, they won’t feel the same way about it. That’s not to say it couldn’t be a useful tool, of course, but one of the hardest things to make into an AI will be a pop idol. People want a real thing, not that that’s us, but there’s an element of it.\n[Laughs] We’re onto certain niche audiences. \nEvery once in a while, somebody will be like, “I just really like a smart man who teaches me things.” \nAll right, weird way to end it, Sal. I remain very impressed by you, and I’m glad that you got to spend a little time chatting with me today about all of the crazy ways that you are having a big impact on the world. So thank you so much for taking the time.\nThanks for having me, Hank.\nQuestions or comments about this episode? Hit us up at decoder@theverge.com. We really do read every email!",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c0a8a43f6982ac9996835f8bf57bdeab919615fa",
      "title": "SpaceX strikes $17B deal to buy EchoStar’s spectrum for Starlink’s direct-to-phone service",
      "url": "https://techcrunch.com/2025/09/08/spacex-strikes-17b-deal-to-buy-echostars-spectrum-for-starlinks-direct-to-phone-service/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T13:26:57.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's SpaceX has agreed to acquire 50MHz of wireless spectrum and Mobile Satellite Service spectrum licenses from EchoStar for about $17 billion in cash and stock for its Starlink satellite network.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30f43bd2efd4ec1a266c401aefdcc2723bcd4a9c",
      "title": "Harry returns to UK and lays wreath as William remembers late Queen",
      "url": "https://www.bbc.com/news/articles/c2378j5154jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T13:14:37.000Z",
      "summary_90w": "",
      "raw": "Prince Harry marked the anniversary of the death of the late Queen privately in Windsor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba48e6dc59930f9881314a54d41cea23e61d57a1",
      "title": "EU and US officials meet as Trump says he is ready to impose further sanctions on Russia",
      "url": "https://www.theguardian.com/world/2025/sep/08/eu-and-us-officials-meet-as-trump-says-he-is-ready-to-impose-further-sanctions-on-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T13:11:22.000Z",
      "summary_90w": "",
      "raw": "Europe and US consider further actions to weaken Russia after largest-ever air attack on Ukraine over the weekend\nThe EU’s most senior sanctions envoy is holding talks in Washington with US officials after Donald Trump said he was ready to take further action against Russia over the war in Ukraine.\nDavid O’Sullivan, the EU sanctions envoy, is meeting US counterparts on Monday, as Europe and the US look for tougher measures to weaken Vladimir Putin’s war machine after Russia launched its largest-ever air attack on Ukraine over the weekend.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf8c157d26916af75c042b4ff5a1bc9aefc11af3",
      "title": "Six killed by Palestinian gunmen at Jerusalem bus stop",
      "url": "https://www.bbc.com/news/articles/cr70ny0l7vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T13:09:39.000Z",
      "summary_90w": "",
      "raw": "Israeli police say two gunmen were killed after the attack, which was one of the deadliest in the city in years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2bfa8a49cb354c3797aa48d4697c88c17ce4eb85",
      "title": "Lisbon funicular crash victim was 'transport enthusiast'",
      "url": "https://www.bbc.com/news/articles/cq8ev844egpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:08:20.000Z",
      "summary_90w": "",
      "raw": "Sixteen people died when the funicular crashed into a building in the Portuguese capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4d67879db1febfadc7a890a9bb45333a33bc716",
      "title": "Amazon Music’s new AI feature generates personalized playlists every Monday",
      "url": "https://techcrunch.com/2025/09/08/amazon-musics-new-ai-feature-generates-personalized-playlists-every-monday/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Amazon Music's new feature “Weekly Vibe,” generates personalized playlists every Monday that are tailored to each listener's evolving music tastes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "45736c728a97db57d52046692c272de5b791a74a",
      "title": "The iPhone 17’s potential makeover might be just enough",
      "url": "https://www.theverge.com/tech/773538/iphone-17-event-awe-dropping-upgrade-apple-intelligence",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Out with the old iPhone, in with the new.\t\n\nThere's probably a lot of market research out there by fancy people who analyze consumer data trying to answer one question: Why do people choose an iPhone? Is it a reputation for better privacy? Long-term reliability? Targeted ad campaigns? I think it's a lot simpler than anyone wants to acknowledge: Their previous iPhone no longer works.\nThey're fed up with an aging battery, or they're tired of a dated processor chugging through app screens. Maybe their previous iPhone ate it altogether. They'll pick up whatever-number-we're-on-now (soon to be 17, with a supposedly \"awe dropping\" reveal tomorrow) because they like their old phone well eno …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4030728952f48c8d6e3cd380be34100e3e187bfc",
      "title": "Doorbell prankster that tormented residents of German apartments turns out to be a slug",
      "url": "https://www.theguardian.com/world/2025/sep/08/doorbell-prankster-that-tormented-residents-of-german-apartments-turns-out-to-be-a-slug",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T12:19:51.000Z",
      "summary_90w": "",
      "raw": "People suspected teenagers playing ding dong ditch and called police, who found animal crawling on the door panel\nInhabitants of an apartment block in Bavaria, southern Germany, who called police to investigate the relentless buzzing of their doorbells late at night were surprised to find the culprit was not a teenage prankster as they had suspected, but a slug.\nThe slug had been sliding up and down the bell plate, creating havoc in the building and tearing angry residents out of their beds long after midnight when they could not sleep for the noise.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac80bff6ea922455776c4e7a955e3e1fad7529fd",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "url": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T12:01:20.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Hundreds of film workers sign pledge they say draws inspiration from South African boycott over apartheid\nHundreds of actors, directors and other film industry professionals have signed a new pledge vowing not to work with Israeli film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.\n“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” the pledge reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93140a48511aa438b2be67847e8790d2265676cb",
      "title": "EU states still fighting over crucial targets in run-up to Cop30, leaked draft shows",
      "url": "https://www.theguardian.com/environment/2025/sep/08/eu-states-still-fighting-over-crucial-targets-in-run-up-to-cop30-leaked-draft-shows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T12:00:44.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Experts decry lack of nationally determined contributions in negotiating document with weeks to go before UN-set deadline\nEU member states are still wrangling over crucial commitments on the climate crisis with no sign of agreement, according to a leaked draft text seen by the Guardian.\nWith just weeks to go before a UN-set deadline, the European Commission and key member states remain at loggerheads over targets on greenhouse gas emissions, with the prospect of a strong outcome looking increasingly imperilled.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "354e963cf8bb8116917d0a9ef09baa2936b57556",
      "title": "The US factory spending $100,000 a month more due to tariffs",
      "url": "https://www.bbc.com/news/articles/c3rvdxz9589o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:57:20.000Z",
      "summary_90w": "",
      "raw": "The gulf between Trump's rhetoric and the reality on the ground is starting to show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f95f42bb5126b0ab4e7fff7e4997ed215b6361e0",
      "title": "Attempted Trump assassination trial begins. And, South Korea to fly 300 workers home",
      "url": "https://www.npr.org/2025/09/08/g-s1-87578/attempted-trump-assassination-trial-begins-and-south-korea-to-fly-300-workers-home",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T11:56:15.000Z",
      "summary_90w": "",
      "raw": "Jury selection begins today in the trial of the man charged with attempting to assassinate Trump last year. And, South Korea plans to bring home more than 300 workers who were detained by ICE agents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ce7469d02a8eb2e489bcb1f7992c02741f44380",
      "title": "Spanish PM Pedro Sánchez says Israel is ‘exterminating a defenceless people’",
      "url": "https://www.theguardian.com/world/2025/sep/08/spanish-pm-pedro-sanchez-israel-exterminating-defenceless-people-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T11:47:45.000Z",
      "summary_90w": "",
      "raw": "Spain announces raft of measures designed to increase pressure on Benjamin Netanyahu to end Gaza war\n\nMiddle East crisis – live updates\n\nSpain’s prime minister, Pedro Sánchez, has stepped up his scathing criticism of Israel’s actions in Gaza, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.\nSpeaking on Monday morning to announce a raft of measures designed to increase the pressure on Netanyahu to stop the military campaign, Sánchez said that while the Spanish government would always support Israel’s right to exist and to defend itself, it felt compelled to try to “stop a massacre”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7339a0ac39631015d9c662c10d9a50cdb1b205e",
      "title": "'Partisan Irish fans provide timely Ryder Cup reminder'",
      "url": "https://www.bbc.com/sport/golf/articles/cg7dg7848r5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:38:24.000Z",
      "summary_90w": "",
      "raw": "Irish Open fans willing Joakim Lagergren's ball into water to help Rory McIlroy win hint at what may unfold at this month's Ryder Cup, writes Iain Carter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d84dd37c4b6fefee6de15c9ad321c9fc8f27f5c5",
      "title": "Henry Zeffman: Why Shabana Mahmood's appointment could mean harder line on immigration",
      "url": "https://www.bbc.com/news/articles/ce9rg9jj5kro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:35:57.000Z",
      "summary_90w": "",
      "raw": "Shabana Mahmood's move to the Home Office is the most significant change from last week's reshuffle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "798a6d3cfd4b57d6e8616cbded6ab74fb9e6dded",
      "title": "Palestinian gunmen kill six people at Jerusalem bus stop",
      "url": "https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T11:19:26.000Z",
      "summary_90w": "",
      "raw": "At least 12 others injured in attack at Ramot intersection during morning rush hour\n\nMiddle East crisis – live updates\n\nPalestinian attackers opened fire at a crowded bus stop in the northern outskirts of Jerusalem, killing six people and injuring 12 others, Israeli officials have said.\nPolice said two gunmen targeted people waiting for a bus at a busy intersection during the morning rush hour on Monday before being shot dead by an off-duty soldier and a civilian who were at the scene.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62ac98efb11351751752e1c7bd3ed059cc97c277",
      "title": "French doctor goes on trial for poisoning 30 patients, 12 fatally",
      "url": "https://www.bbc.com/news/articles/crl5ngj9zwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:00:18.000Z",
      "summary_90w": "",
      "raw": "Frédéric Péchier, considered by colleagues to be a highly-talented practitioner, maintains there is no proof of any poisoning.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1beb6b2a89ca3033710cf559394c22fc31a9c5e",
      "title": "OpenAI comes for Hollywood with Critterz, an AI-powered animated film ",
      "url": "https://www.theverge.com/news/773584/openai-animated-feature-film-critterz",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T10:56:43.000Z",
      "summary_90w": "",
      "raw": "Two AI-generated  figures from the production of Critterz.\t\n\nOpenAI is on a mission to show Hollywood that generative artificial intelligence can deliver results and is throwing its weight behind an animated feature film it hopes will stand toe-to-toe with much costlier productions, according to the Wall Street Journal.\nThe film, called Critterz, is expected to hit theaters worldwide in 2026 after a planned debut at the Cannes Film Festival, the Journal reported. It will be made primarily with the company’s AI tools, including GPT-5, its flagship model that landed with a thud last month. \nCritterz is reportedly being made on a budget of less than $30 million in just nine months, fractions of what is normally required for animated features. OpenAI, alongside LA- and London-based partners Native Foreign and Vertigo Films, will be hoping the flick can convince wary Hollywood executives to bet big on AI, a tall order as the industry wrestles with slow uptake, resistance from talent and audiences and concerns over intellectual property and creative agency.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8911715708d1a1b12ffbfba40f4b24e350536d0e",
      "title": "More than 10 European startups became unicorns this year",
      "url": "https://techcrunch.com/2025/09/08/more-than-10-european-startups-became-unicorns-this-year/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T10:55:11.000Z",
      "summary_90w": "",
      "raw": "This is a good indication of the sectors that are hot among investors, from biotech and defense tech to AI, AI, and AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10b43e0cf94f37714ff23c0fd66a6d821839d540",
      "title": "The influencer in this Vodafone ad isn’t real",
      "url": "https://www.theverge.com/news/773567/vodafone-generative-ai-ad-presenter-tiktok",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T10:18:45.000Z",
      "summary_90w": "",
      "raw": "Anyone familiar with the AI slop on Pinterest should recognize how unnatural that hair is.\t\n\nI opened TikTok while visiting Germany last week and stumbled across a Vodafone ad being presented by a woman who probably doesn’t exist. The ad includes several “tells” that suggest the presenter was artificially created using generative AI — the unnatural style and movement of her hair, the way her moles disappear, and the uncanny valley vibe of her facial expressions — and Vodafone confirmed my suspicions in its video comments.\nIn response to a commenter asking why Vodafone couldn’t put “a real person in front of the camera,” the company said it was “testing different styles of advertising — this time with AI,” according to machine translation of the German text. In another comment, Vodafone said that “AI is so much a part of everyday life these days that we also try it out in advertising.” \nAs an ad, it certainly captured my attention, but only because my brain registered that there was something “off.”\n\n \n @vodafonedeutschland \nJetzt Internet mit bis zu 1000 Mbit/s im Download für Dein Zuhause.\n ♬ Originalton – vodafone_de – vodafone_de \n  \n\n\nThis isn’t the first time that Vodafone has embraced generative AI in its ads, having released a commercial last year in which every shot was AI-generated. Fake influencers created using artificial intelligence are also rising in popularity, according to a New York Times report, with notable examples like Lil’ Miquela — a creation of tech company Dapper Labs — having already appeared in campaigns for Calvin Klein, Prada, and BMW.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4fb4628903a01aad2fe1a4edef8f7fcd5174c7d3",
      "title": "Leni Riefenstahl made movies for Hitler. A new documentary digs through her archives",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5526066/leni-riefenstahl-nazi-filmmaker-new-documentary",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Adolf Hitler commissioned filmmaker Leni Riefenstahl to make propaganda about Nazi Germany. She lived to be 101 years old and denied knowing about the Holocaust.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7202cbb672f9ee714aa94cdc2020ca938b0d8865",
      "title": "New Zealand dad shot dead by police after years on the run with children",
      "url": "https://www.bbc.com/news/articles/c75qlerp2e5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:35:32.000Z",
      "summary_90w": "",
      "raw": "Tom Phillips disappeared with his three children in 2021 after losing a custody battle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "374b353a09326b2ad904df2dbb5884500f2b6edf",
      "title": "Five key moments from MTV VMAs as Lady Gaga and Ariana Grande win big",
      "url": "https://www.bbc.com/news/articles/c5yk5jw6w5ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T09:33:30.000Z",
      "summary_90w": "",
      "raw": "Sabrina Carpener was also among the award winners and performers on the night in New York.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61bb447e933f7e2c697b747844cdb487f5703d14",
      "title": "Trump threatens tougher sanctions after Russia's heaviest strikes on Ukraine",
      "url": "https://www.bbc.com/news/articles/cwyrx205dj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T09:29:55.000Z",
      "summary_90w": "",
      "raw": "Trump's threat of sanctions comes after Russia's heaviest attack of the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2588595e65e6743b714fb35dc33cce3f3f33e581",
      "title": "Shooting attack at Jerusalem bus stop kills at least 5",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533923/israel-jerusalem-shooting",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:27:11.000Z",
      "summary_90w": "",
      "raw": "Paramedics said at least five people were killed in a shooting attack in Jerusalem after two attackers opened fire at a bus stop at a busy intersection in north Jerusalem.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef6b423971661a246c2d2ba884445141733100a1",
      "title": "Minns backtracks on right to hunt over fears it could lead to US-style gun future",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/chris-minns-backtracks-nsw-right-to-hunt-shooters-and-fishers-bill",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:16:41.000Z",
      "summary_90w": "",
      "raw": "NSW premier initially supported the controversial bill which would have allowed recreational hunters to shoot feral animals on public lands\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe New South Wales premier has backtracked on a central element of a Shooters and Fishers’ private member’s bill – enshrining a right to hunt – saying it could undermine gun control and send the state down the US path of a right to bear arms.\n“We won’t be supporting any provision in [the bill] that will water down gun laws in NSW. They’ve been important pieces of keeping the community safe for a long period of time,” Chris Minns said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e5269d60359f3774ff4dee79a2271d22a6a46b4",
      "title": "Hawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:13:18.000Z",
      "summary_90w": "",
      "raw": "Sussan Ley under pressure to repair ties with diaspora group after NT senator claimed without evidence Labor was bringing in migrants to win votes\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nLiberal MP Alex Hawke has called on Jacinta Nampijinpa Price to apologise for the “real damage” her comments have caused the Indian community as the fallout continues internally and externally for the party.\nThe opposition has scrambled to repair ties with Indian Australians after Price’s remarks. On Monday, the Liberal leader, Sussan Ley, convened a roundtable with community leaders the day before she toured Sydney’s Harris Park – known as “Little India”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f3061f6ff9b741bc2349c9e983d099848e42888",
      "title": "Chinese state media accuses Wong and Marles of ‘stirring up tensions’ – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:04:11.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nHawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians\n\nGet our breaking news email, free app or daily news podcast\n\nVictoria’s supreme court will hand down the triple-murderer Erin Patterson’s sentence shortly. The state’s supreme court will allow a television camera inside the courtroom to broadcast the sentencing hearing – with a 10 second delay – for the first time.\nPatterson, 50, faces the prospect of spending the rest of her life in prison. Justice Christopher Beale will deliver her sentence from 9.30am in a hearing expected to last about 30 minutes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a17d725e28af25ca18a225e04e46ddd1a9a797a8",
      "title": "Watch: Glitz, glamour and emotional speeches at VMAs 2025",
      "url": "https://www.bbc.com/news/videos/crl5ngr2069o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:04:06.000Z",
      "summary_90w": "",
      "raw": "The MTV Video Music Awards (VMAs) have taken place in New York, with high profile figures in the music industry taking to the red carpet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5def065df31f3d820e9de7e841b016354e669d2d",
      "title": "20 years ago, New Orleans fired its teachers. It's been rebuilding ever since",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529311/schools-education-new-orleans-teachers-hurricane-katrina",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When New Orleans schools reopened after Katrina, most of the city's educators didn't get their jobs back. Instead, they were often replaced with young people who were new to town — and new to teaching.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93441c221cf21eea5a9e319a2ded131b33db8d3b",
      "title": "Alone in a foreign country, a young woman is saved by two strangers",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529374/alone-in-a-foreign-country-a-young-woman-is-saved-by-two-strangers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In 1980, Elaine Batchelor was attacked on a night train while backpacking alone in Europe. Two strangers stepped in and stayed by her side for the rest of the 12-hour ride.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8090bee0b7bbd41ad9c10cbe8d3aa6af2166b744",
      "title": "World Cup ticket sales are about to begin. Scoring them may not be easy — or cheap",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529273/fifa-world-cup-2026-ticket-sales",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "FIFA is set to launch the first window of regular ticket sales for the 2026 World Cup on Wednesday. Brace yourself: because they may not be easy to get — or cheap.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1507df7b933fc946887d2e37a5d8a575aec1951c",
      "title": "Lone survivor of mushroom murders pleads to grieve in private as killer jailed for life",
      "url": "https://www.bbc.com/news/articles/cly1v06xz7qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T08:52:36.000Z",
      "summary_90w": "",
      "raw": "As Erin Patterson was sentenced, her sole surviving victim Ian Wilkinson called for privacy and kindness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd5758c6a4fc2bc52a9aedb02f73f54cef7493aa",
      "title": "'A heavy shirt to wear' - being Man Utd number one",
      "url": "https://www.bbc.com/sport/football/articles/c3drem05ekmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T08:05:33.000Z",
      "summary_90w": "",
      "raw": "An in-depth look at Manchester United's goalkeeping situation as Andre Onana prepares to leave on loan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89207c51076ab42d256d9b0ca5a8b5a755c753e4",
      "title": "InDrive has big plans to become a global ‘super app’ where others have failed",
      "url": "https://techcrunch.com/2025/09/08/indrive-has-big-plans-to-become-a-global-super-app-where-others-have-failed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T08:00:00.000Z",
      "summary_90w": "",
      "raw": "InDrive plans to expand into multiple verticals over the next 12 months across its top markets, starting with grocery deliveries in Kazakhstan.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0fe7aba841b3f4f53700bbbf1c7a2b05d7cb187b",
      "title": "Ex-sergeant major admits sexually assaulting soldier who took her own life",
      "url": "https://www.bbc.com/news/articles/ckgqzxq0z55o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T07:41:25.000Z",
      "summary_90w": "",
      "raw": "Michael Webber pleaded guilty to sexual assault against teenage soldier Jaysley Beck, who was left traumatised by the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92c6e3934c891244053cede02b47ac3dd9bb0119",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:01:03.000Z",
      "summary_90w": "",
      "raw": "Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said\nA fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.\nThe whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2c05487bf4009e970ec540a06f48f1e758431b5",
      "title": "Fugitive father shot dead by police – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T06:17:21.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. Our full report is here: Tom Phillips shot dead after attempted burglary, NZ police confirm\nThe mayor of Waitomo, John Robertson, told the Guardian this morning’s events were the worst possible outcome for the community.\n“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.\nSo it’s just devastating news. Really the worst outcome we could have expected.\nNo day that goes by that I don’t think about all four of them.\nIt hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "176442bb10b8a44dd6d927000c62741e2845183e",
      "title": "Uber and Momenta to test autonomous vehicles in Germany in 2026",
      "url": "https://techcrunch.com/2025/09/07/uber-and-momenta-to-test-autonomous-vehicles-in-germany-in-2026/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T06:00:00.000Z",
      "summary_90w": "",
      "raw": "Momenta is one of 20 global AV partners that Uber has scooped up across its ridehail, delivery, and freight businesses. Uber says those partnerships have already generated an annualized rate of 1.5 million mobility and delivery.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "422b4c7ebd2e44953a9f297257daac3e5d3300ee",
      "title": "Japan’s next PM will face a problem that won’t go away with Shigeru Ishiba’s resignation",
      "url": "https://www.theguardian.com/world/2025/sep/08/japan-shigeru-ishiba-resignation-next-pm-will-face-problem-that-wont-go-away",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T05:25:34.000Z",
      "summary_90w": "",
      "raw": "The ruling Liberal Democratic party is still grappling with the fallout from a years-old funding scandal that may see it go into opposition for just the third time in its history\nThe precise timing of Japanese prime minister Shigeru Ishiba’s resignation announcement – on a Sunday evening – took many by surprise; but the countdown to his departure arguably began just weeks after he took office.\nHaving won the presidency of the Liberal Democratic party (LDP) – a formidable political force that has governed Japan for much of the past seven decades – Ishiba called a snap election in search of a public mandate after a major funding scandal, and to silence his opponents on the right of the party.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a0ea8bcfd8e548e3b062ceb470fb9545d728839",
      "title": "'Suitcase murder' trial begins in New Zealand",
      "url": "https://www.bbc.com/news/articles/cn83jjx9pjvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T05:12:14.000Z",
      "summary_90w": "",
      "raw": "Hakyung Lee is accused of killing her two young children, whose bodies were found stuffed in suitcases.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ddfbb3dc5f62c8ce222017e5bcb40503f190088",
      "title": "Huge drugs bust reveals battles on cocaine 'superhighway'",
      "url": "https://www.bbc.com/news/articles/c5yvplyrrwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T05:02:40.000Z",
      "summary_90w": "",
      "raw": "An audacious attempt to smuggle tonnes of cocaine was stopped, but pressure from drug cartels remains.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b6e425f4fb66291d81b91b419409a607f33f73c",
      "title": "'He put his hand down my tights': Sexual harassment widespread among barristers, review finds",
      "url": "https://www.bbc.com/news/articles/c8xrejzk0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T04:46:41.000Z",
      "summary_90w": "",
      "raw": "Widespread problems with sexual harassment and bullying within the Bar are detailed in a report.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T04:28:34.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df935d39b3fdd17370840418ecd274c98faa1ded",
      "title": "Protests expected as 51 Israeli arms makers among exhibitors at London trade fair",
      "url": "https://www.theguardian.com/world/2025/sep/08/protests-expected-as-51-israeli-arms-makers-among-exhibitors-at-london-trade-fair",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T04:00:40.000Z",
      "summary_90w": "",
      "raw": "Campaign Against Arms Trade says UK government has hit ‘peak complicity in genocide’ in allowing the firms to exhibit\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\nTheir presence will be the focus for hundreds planning to demonstrate outside the four-day arms fair, at which the defence secretary, John Healey, is expected to speak alongside senior British military officials.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d98772a77dc18103b9621c4858b7c273dfdb6c6b",
      "title": "What it was like inside court as mushroom murderer was jailed for life",
      "url": "https://www.bbc.com/news/videos/c15k4y5nwz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T03:32:23.000Z",
      "summary_90w": "",
      "raw": "The BBC's Katy Watson was in the courtroom as Erin Patterson was sentenced to life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "169b304d9ac7730c59b76c700858afeb431517b9",
      "title": "Palestinian prisoners not being given adequate food, Israel top court says",
      "url": "https://www.bbc.com/news/articles/c1mxlk518vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T02:53:54.000Z",
      "summary_90w": "",
      "raw": "The court said the state is legally obligated to provide enough food to ensure \"a basic level of existence.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82eb201f0fb6c960f6bd056609aa7f6a5000188d",
      "title": "Duped of millions in 'digital arrest', Indian woman seeks answers from banks",
      "url": "https://www.bbc.com/news/articles/clydllln9lgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T00:45:32.000Z",
      "summary_90w": "",
      "raw": "Anjali asks why such huge sums leaving her account didn’t trigger red flags and automatic alerts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "560ce79c5ad9c75d0a13333406a1f6952e60334e",
      "title": "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533207/carlos-alcaraz-trump-us-open-tennis-rolex",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T00:37:01.000Z",
      "summary_90w": "",
      "raw": "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "28bfa7a0e3281e7c4957e936fd730e89f2e185da",
      "title": "Ryan Routh to stand trial for alleged Trump assassination attempt",
      "url": "https://www.bbc.com/news/articles/c8xre584drdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T00:35:02.000Z",
      "summary_90w": "",
      "raw": "A court case for Mr Routh, who has pleaded not guilty, begins on Monday - with the defendant representing himself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61029694d6d164b5d0539aaa3c298cb2e6a4737f",
      "title": "Trump issues ‘last warning’ to Hamas to accept Gaza ceasefire deal",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/trump-gaza-israeli-hostages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T00:01:42.000Z",
      "summary_90w": "",
      "raw": "President says ‘the Israelis have accepted my terms’ and urges release of hostages to secure peace agreement\nDonald Trump on Sunday issued what he called his “last warning” to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.\n“The Israelis have accepted my Terms. It is time for Hamas to accept as well,” Trump said in a post on his Truth Social platform. “I have warned Hamas about the consequences of not accepting. This is my last warning, there will not be another one!”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea44d836cdfeed434a38342d87e7dd5e49cfca2d",
      "title": "I haven't lived with my husband for 15 years - we're still happily married",
      "url": "https://www.bbc.com/news/articles/c5y21nvd56ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T23:35:35.000Z",
      "summary_90w": "",
      "raw": "Margaret says it can be lonely for both her and her husband, but talking regularly makes it work.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb321a5ec31ad66b516c657d96408e9d9bbd9c25",
      "title": "More than 90,000 Jeep Grand Cherokees recalled over potential loss of drive power",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533180/jeep-grand-cherokee-recall-plug-in-hybrid",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T23:24:34.000Z",
      "summary_90w": "",
      "raw": "Vehicles impacted by the recall include 2022 to 2026 plug-in hybrid electric models of the Jeep Grand Cherokee.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dbad04708a3dc7972c447fc4ea8545ac9955e61d",
      "title": "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "url": "https://www.bbc.com/news/articles/c5yqg0rln74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T23:14:55.000Z",
      "summary_90w": "",
      "raw": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67443c3bc8ea74ec08ff53c2960049d49b2088ad",
      "title": "'I don't dare go back': BBC visits Cambodian villages caught in Thai border conflict ",
      "url": "https://www.bbc.com/news/articles/c059j8759rlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T22:04:15.000Z",
      "summary_90w": "",
      "raw": "Tension along disputed parts of the border with Thailand erupted into conflict in July, leaving dozens dead.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "749489d4676afbc12e157f6c04f0cfb493b498bf",
      "title": "New business secretary Peter Kyle going to China for trade talks this week",
      "url": "https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T21:31:50.000Z",
      "summary_90w": "",
      "raw": "Former science secretary promoted in reshuffle to continue UK efforts to revitalise trade relationship with Beijing \nThe UK’s new business secretary, Peter Kyle, will fly to Beijing this week as part of Keir Starmer’s continuing efforts to revitalise the UK’s trade relationship with China and provide growth to the British economy.\nThe former science and technology secretary, who was promoted in Friday’s government reshuffle, is expected to land in China on Wednesday, picking up the schedule of his predecessor, Jonathan Reynolds, who is now the chief whip.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a49bd55cf23e32751be3a871080cfa8d0a938c2",
      "title": "Microsoft says Azure affected after cables cut in the Red Sea",
      "url": "https://techcrunch.com/2025/09/07/microsoft-says-azure-affected-after-cables-cut-in-the-red-sea/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T21:31:17.000Z",
      "summary_90w": "",
      "raw": "It's not clear who cut the cables or why.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "500ac78a34cdd747c9051fb4564774f8628b268c",
      "title": "Are bad incentives to blame for AI hallucinations?",
      "url": "https://techcrunch.com/2025/09/07/are-bad-incentives-to-blame-for-ai-hallucinations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T21:23:23.000Z",
      "summary_90w": "",
      "raw": "How can a chatbot be so wrong — and sound so confident in its wrongness?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ce1f11abc06037f96091936f74176bcd11cd3e44",
      "title": "Greta Thunberg's Gaza flotilla arrives in Tunisia",
      "url": "https://www.bbc.com/news/articles/c4gjz0d366eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T20:53:14.000Z",
      "summary_90w": "",
      "raw": "The boats, carrying 350 pro-Palestinian activists and stocked with medical and food supplies, are en route to Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3423a752f7abd52fb923966ef2e52970c39ebdcd",
      "title": "Koah raises $5M to bring ads into AI apps",
      "url": "https://techcrunch.com/2025/09/07/koah-raises-5m-to-bring-ads-into-ai-apps/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T20:48:42.000Z",
      "summary_90w": "",
      "raw": "One investor says Koah is \"building the essential monetization layer for consumer AI.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8dc51936161f06ac040b39290844fdee168850c9",
      "title": "Hyundai’s eVTOL startup Supernal pauses work following CEO and CTO departures",
      "url": "https://techcrunch.com/2025/09/07/hyundais-evtol-startup-supernal-pauses-work-following-ceo-and-cto-departures/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The shakeup comes as the startup was still struggling to get its test vehicle off the ground -- literally. The first flight was only in March.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d625229d1d985684c5f55631964a7ff359406eb",
      "title": "Timelapse shows Blood Moon rising around the world",
      "url": "https://www.bbc.com/news/videos/c93071yz5zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T19:00:54.000Z",
      "summary_90w": "",
      "raw": "As the Moon passes through the Earth's shadow, it takes on a deep red hue, creating a striking \"Blood Moon\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "778cfd5c32802766c7012c868c59bd67c4bf4e1e",
      "title": "300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T18:08:24.000Z",
      "summary_90w": "",
      "raw": "Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles\nSouth Korea announced on Sunday that the roughly 300 of its nationals detained during an immigration raid in Georgia would be released and flown home, as the sudden detention of workers appeared to strain the longstanding diplomatic and economic relationship between the two countries.\nNearly 500 workers, among them at least 300 South Koreans and at least 23 Mexicans, were arrested at the Hyundai-LG battery plant in the city of Ellabell on Thursday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fb66623af50785279079c5a85f4b29f2fddd222",
      "title": "Postal traffic to U.S. drops over 80% after trade exemption rule ends, U.N. agency says",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533121/postal-traffic-to-us-drops-more-than-80-after-trade-exemption-rule-ends-un-agency-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T17:54:41.000Z",
      "summary_90w": "",
      "raw": "The de minimis rule that allowed small packages worth less than $800 to be exempt from tariffs ended on Aug. 29.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7d3b2c06d8f9af601040873109a002d23088b591",
      "title": "Thousands flock to Vatican as teenager made first millennial saint ",
      "url": "https://www.bbc.com/news/videos/cy9njpyp09do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T16:32:36.000Z",
      "summary_90w": "",
      "raw": "Pope Leo canonises the London-born Italian boy nicknamed \"God's influencer\" for his online skills.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "922661201adabb2ad3a56d0e6c944b1f248a80d3",
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:56:23.000Z",
      "summary_90w": "",
      "raw": "Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers\nThe Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.\n“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military strike against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5248451b73a3a4c0b98cc328861f130c8f0ed986",
      "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
      "url": "https://techcrunch.com/2025/09/07/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T14:54:03.000Z",
      "summary_90w": "",
      "raw": "Mistral AI, the French company behind AI assistant Le Chat and several foundational models, is officially regarded as one of France’s most promising tech startups and is arguably the only European company that could compete with OpenAI. It is reportedly in the process of raising another round that would value it at $14 billion, up […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0821bfdb2476b823c1947bf67d7f1ab6c7c26f63",
      "title": "Has Labour Just Moved Towards the Right?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1cyhy?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:54:00.000Z",
      "summary_90w": "",
      "raw": "With Angela Rayner out, is Keir Starmer’s government more right wing?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69ee372a67aefdd9ae7a23bc1be9ab19f8761145",
      "title": "LGBTQ+ Americans consider move to Canada to escape Trump: ‘I’m afraid of living here’",
      "url": "https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T10:00:17.000Z",
      "summary_90w": "",
      "raw": "LGBTQ+ people in the US contemplate heading north as they wrestle with the president’s assault on the community\nThe number of LGBTQ+ Americans inquiring about moving to Canada has soared since Donald Trump’s re-election, campaigners have said, as people across the US wrestle with the fallout of rising anti-gay rhetoric, anti-trans executive orders, and the more than 600 bills targeting LGBTQ+ rights.\n“So much is happening in the US right now and a lot of it is terrifying,” said Latoya Nugent of Rainbow Railroad, a North American charity that helps LGBTQI+ individuals escape violence and persecution in their home countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "baf3d47203d4aa69d8a84aa0162af5b7c5f9509c",
      "title": "Why is an Amazon-backed AI startup making Orson Welles fan fiction?",
      "url": "https://techcrunch.com/2025/09/06/why-is-an-amazon-backed-ai-startup-making-orson-welles-fan-fiction/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T21:30:22.000Z",
      "summary_90w": "",
      "raw": "This is a bad idea.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "febb535b7ba16857aa2cf831ebebac7cc2367a85",
      "title": "South Korea charters plane to fly home over 300 workers detained by ICE at Georgia Hyundai plant",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532604/hyundai-immigration-raid-georgia-south-korea",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T19:38:32.000Z",
      "summary_90w": "",
      "raw": "On Sunday, South Korean officials said they would send a plane to bring the detained workers home. Earlier, South Korea's Foreign Minister said his nation was \"deeply concerned\" by the arrests.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ff5bffa30fc613afcdb7a34b907996e064561552",
      "title": "Opinion: Susan Stamberg, trailblazer and NPR Founding Mother, retires",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5522120/opinion-susan-stamberg-trailblazer-and-npr-founding-mother-retires",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T12:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR Founding Mother Susan Stamberg is retiring. She became the first woman to anchor a nightly national news program in 1972, and helped loosen up the serious, stodgy sound of radio hosts.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04f64312059b1aa29a182530f112c797830ea1b3",
      "title": "How an 18th-century portrait stolen by the Nazis was recovered 80 years later in Argentina",
      "url": "https://www.theguardian.com/world/2025/sep/06/18th-century-portrait-stolen-by-nazis-recovered-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Painting was spotted online by Dutch journalists when the daughter of a former Nazi official put her house up for sale in Mar del Plata\nThere was nothing very remarkable about the middle-aged couple who lived in the low, stone-clad villa on calle Padre Cardiel, a quiet residential street in the leafy Parque Luro district of Argentina’s best-known seaside town, Mar del Plata.\nPatricia Kadgien, 59, was born in Buenos Aires, five hours to the north. Her social media described her as a yoga teacher and practitioner of biodecoding, an obscure alternative therapy that claims to cure illness by resolving past traumas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76d81638d9b80d90fd38c1e1e8fc79e09b51402a",
      "title": "Under Trump, the Federal Trade Commission is abandoning its ban on noncompetes",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528937/ftc-noncompete-ban-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T21:46:33.000Z",
      "summary_90w": "",
      "raw": "Federal Trade Commission Chair Andrew Ferguson has called his agency's rule banning noncompetes unconstitutional. Still, he says protecting workers against noncompetes remains a priority.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e0a2945e4f3d3901564e99ea2e0388645285dae0",
      "title": "Judge blocks ending of legal protections for 1m Venezuelans and Haitians in US",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/ruling-end-protections-haitian-venezuelan-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T20:50:00.000Z",
      "summary_90w": "",
      "raw": "Homeland security had tried to end temporary protected status granted by the Biden administration\nA federal judge on Friday ruled against the Trump administration from ending temporary legal protections that have granted more than 1 million people from Haiti and Venezuela the right to live and work in the United States.\nThe ruling by US district judge Edward Chen of San Francisco for the plaintiffs means that 600,000 Venezuelans whose temporary protections expired in April or whose protections were about to expire on 10 September have status to stay and work in the United States.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5dbb34225979e86522cc6f2fb9796eb6e48b92aa",
      "title": "The Global Story: The deal that broke Ukraine's trust",
      "url": "https://www.bbc.co.uk/programmes/w3ct714l?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "An exploration of the 1994 Budapest Memorandum, intended to enshrine Ukraine's security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}