{
  "version": "1757261690936",
  "generatedAt": "2025-09-07T16:14:50.936Z",
  "items": [
    {
      "id": "060d8f02f8f1f5b2583edfe218d2b0ab4d5cd599",
      "title": "Healey says more military sites could house asylum seekers",
      "url": "https://www.bbc.com/news/articles/c5yvxergw4xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T16:09:53.000Z",
      "summary_90w": "",
      "raw": "The defence secretary says officials are looking at possible locations to help end the use of hotels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "29080118226e17e9f06c482fa14a81f392d47e4f",
      "title": "Tour de France legend Geraint Thomas bids emotional farewell in final race",
      "url": "https://www.bbc.com/news/articles/crrj920q8dzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T16:07:50.000Z",
      "summary_90w": "",
      "raw": "Wales' former Tour de France winner bid an emotional farewell in the city where it all began.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "922661201adabb2ad3a56d0e6c944b1f248a80d3",
      "title": "Republican slams Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:56:23.000Z",
      "summary_90w": "",
      "raw": "Rand Paul blasts ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers\nThe Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.\n“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military strike against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d0f6930ef5fc36e87c5fe92ee2dbe6b2bbffd14",
      "title": "US pilot and influencer released from Chilean air base in Antarctica",
      "url": "https://www.bbc.com/news/articles/cn4l2ld4j9do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T15:54:53.000Z",
      "summary_90w": "",
      "raw": "Ethan Guo, 20, had been detained since June after being accused of landing his Cessna illegally in Chilean territory in the Antarctic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f42ecc14b3d35619175986a747e142542e38eae0",
      "title": "Piastri told to let Norris past as Verstappen wins",
      "url": "https://www.bbc.com/sport/formula1/articles/cx2rn7y5r36o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T15:50:57.000Z",
      "summary_90w": "",
      "raw": "McLaren's approach to racing in the title fight between their drivers sparked controversy as Red Bull's Max Verstappen won the Italian Grand Prix.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3536a0859aad274f0d7c824ab257955ec45e7a8d",
      "title": "South Africa fall to 24-6 as Archer dominates",
      "url": "https://www.bbc.com/sport/cricket/videos/cvg4xkvel2jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T15:47:41.000Z",
      "summary_90w": "",
      "raw": "England make a sensational start with the ball as South Africa fall to 24-6 in their chase of 415 runs in the third One Day International in Southampton.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cab0a89bd2701246a22a5220f8cc3865a014edc6",
      "title": "Ruthless New Zealand top Pool C with Ireland win",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cdx2y2ne7qxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T15:46:36.000Z",
      "summary_90w": "",
      "raw": "Teenage wing Braxton Sorensen-McGee scores a hat-trick of tries as reigning world champions New Zealand showed their class to beat Ireland 40-0 and secure top spot in Pool C.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6a4fc76b906b872c01910921a15ed8c737287d1",
      "title": "Iran will exchange nuclear monitoring for lifted sanctions, says its foreign minister",
      "url": "https://www.theguardian.com/world/2025/sep/07/iran-will-exchange-nuclear-monitoring-for-lifted-sanctions-says-its-foreign-minister",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:45:57.000Z",
      "summary_90w": "",
      "raw": "Seyyed Abbas Araghchi says European nations should engage constructively and not facilitate ‘America’s excesses’\n\nA message from Tehran to Britain, France and Germany\n\nIran is ready to form a real and lasting agreement that includes strict monitoring and limits on its domestic uranium enrichment in exchange for the lifting of sanctions, its foreign minister, Seyyed Abbas Araghchi, has said.\nBut, writing for the Guardian, he urges the European nations to change course and abandon their plan to snapback a wide array of UN sanctions at the end of the month.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ea3b664ecec490dcdab455653c42752ddb6278a",
      "title": "TIFF 2025: Frankenstein, Knives Out 3, and all the biggest movies from Toronto",
      "url": "https://www.theverge.com/film/773480/tiff-2025-frankenstein-wake-up-dead-man-movie-reviews",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T15:30:00.000Z",
      "summary_90w": "",
      "raw": "The Toronto International Film Festival is almost like a preview of the movie slate for the next few months — and this year I’m watching as much as possible to give you all the scoop on what’s ahead. To do that, I’ll be writing a dispatch covering every movie I’ve seen that day, which will run daily throughout most of the festival. That includes bigger movies you probably already know about, like Netflix’s Wake Up Dead Man and Frankenstein, along with hopefully some great new films you maybe weren’t aware of, like the creepy adaptation of the horror game The Exit 8.\nI won’t be able to see everything, of course, but I’ll do my best to bring you the most interesting stuff — and you can keep up with everything right here.\nWake Up Dead Man adds a delightfully dark twist to Knives Out\n\t\t\t\nPark Chan-wook’s No Other Choice is as bleak as it is hilarious\n\t\t\t\nThe Exit 8 movie is even scarier than the game",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d61403a96be0f271555e4a55ecf6da6abe072a1b",
      "title": "Sirens blare from millions of phones in national test of emergency alerts",
      "url": "https://www.bbc.com/news/articles/c2lx9x251xgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T15:25:36.000Z",
      "summary_90w": "",
      "raw": "PM Keir Starmer said the test was \"an important step in keeping people safe during national emergencies\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a49bd55cf23e32751be3a871080cfa8d0a938c2",
      "title": "Microsoft says Azure affected after cables cut in the Red Sea",
      "url": "https://techcrunch.com/2025/09/07/microsoft-says-azure-affected-after-cables-cut-in-the-red-sea/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T15:22:42.000Z",
      "summary_90w": "",
      "raw": "It's not clear who cut the cables or why.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5823c60d96e5ad385c07580405a4826e5a76d67c",
      "title": "Carlo Acutis, ‘God’s influencer’ who died age 15, declared a saint by Pope Leo",
      "url": "https://www.theguardian.com/world/2025/sep/07/pope-leo-xiv-declares-15-year-old-computer-whiz-carlo-acutis-gods-influencer-saint",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:03:06.000Z",
      "summary_90w": "",
      "raw": "London-born Italian, who died in 2006, built websites to spread Catholic teaching and is credited with two miracles\nA London-born Italian teenage computer whiz who died in 2006 age 15, has been declared the Catholic church’s first millennial saint during an open-air mass in a packed St Peter’s Square.\nCarlo Acutis, who died of leukaemia, built multilingual websites to spread Catholic teaching, later earning him the nickname “God’s influencer”. He was canonised by Pope Leo XIV alongside Pier Giorgio Frassati, another young Catholic activist, who died a century ago.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b906dfeece01fe1689476cf5980a98328b9ae581",
      "title": "Minns’s $140m great koala national park will ‘obliterate’ regional towns, Coalition claims",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/minns-140m-great-koala-national-park-regional-towns-coalition-nsw",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:00:24.000Z",
      "summary_90w": "",
      "raw": "Labor’s koala strategy doesn’t go far enough, Coalition says, but environmentalists hail park a ‘once-in-a-lifetime’ decision\n\nGet our breaking news email, free app or daily news podcast\n\nThe long-awaited great koala national park in the north of New South Wales, celebrated by wildlife groups, has drawn a mixed reaction from the state’s Coalition.\nThe opposition leader, Mark Speakman has hedged his party’s support, saying while he “supports the ambition of protecting koalas”, he was concerned about job losses and the cost of the park.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac5870aa9e20ea12372856e9ecceb8dd127912c8",
      "title": "Mushroom murderer Erin Patterson to learn fate at sentence hearing in Victorian supreme court",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/erin-patterson-mushroom-murders-live-stream-tv-coverage-sentencing-hearing-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:00:23.000Z",
      "summary_90w": "",
      "raw": "Justice Christopher Beale will sentence the triple murderer on Monday, with the hearing to be broadcast live in a state first \n\nGet our breaking news email, free app or daily news podcast\n\nVictoria’s supreme court will hand down the triple-murderer Erin Patterson’s sentence on Monday morning, with the hearing to be broadcast live in a historic first for the state.\nThe state’s supreme court will allow a television camera inside the courtroom to broadcast the sentencing hearing – with a 10 second delay – for the first time.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5248451b73a3a4c0b98cc328861f130c8f0ed986",
      "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
      "url": "https://techcrunch.com/2025/09/07/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T14:54:03.000Z",
      "summary_90w": "",
      "raw": "Mistral AI, the French company behind AI assistant Le Chat and several foundational models, is officially regarded as one of France’s most promising tech startups and is arguably the only European company that could compete with OpenAI. It is reportedly in the process of raising another round that would value it at $14 billion, up […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8b8e22d61d73b52a2a6d2f2d595d8034e43e363",
      "title": "Czech police finally catch up with 'phantom racing car driver'",
      "url": "https://www.bbc.com/news/articles/c4g7xl4p53ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T14:51:04.000Z",
      "summary_90w": "",
      "raw": "A red racing car has been sighted on motorways in the Czech Republic since 2019 but until now has evaded police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b12d460a595afe54a03df7010e2551417a756996",
      "title": "Volkswagen rounds out new lineup of affordable EVs with ID. Cross concept",
      "url": "https://www.theverge.com/news/773435/volkswagen-rounds-out-new-lineup-of-affordable-evs-with-id-cross-concept",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T14:46:06.000Z",
      "summary_90w": "",
      "raw": "Everyone basically agrees: if you want people to transition from polluting gas guzzlers to electric cars, you have to make them more affordable. The luxury EVs, with their big battery packs and fine leather interiors, are all well and good, but if you really want to move the needle on EV adoption, we need more entry-level options. And so far, we’re lacking. \nVolkswagen hears this, and is responding with a new lineup of small and mid-sized electric vehicles aimed squarely at the low end of the market. We’ve already seen the ID.2all  — recently renamed ID. Polo and ID. Polo GTI — and ID.EVERY1 concepts. Now we’re getting a fourth concept, the ID. Cross, which VW says will get a proper reveal next year. The concept’s name invokes the ID.4’s predecessor, the ID.Crozz, from 2017. \nThe ID. Cross introduces a new design language that VW says it “friendlier” and more approachable than its current lineup of EVs. For evidence of this, look no further than the front fascia with its narrow headlights and a slightly curved lightbar that looks like its smiling at you. \n\nThe ID. Cross introduces a new design language that VW says it “friendlier”\n\n\nAn electric counterpart to the popular VW T-Cross, the ID. Cross will be built on the automaker’s MEB Plus platform, which is an improvement over the current MEB that powers the ID.4 crossover SUV, the ID Buzz minivan, and a dozen other vehicles from Audi, Skoda, and others. This next-gen platform will have better batteries, engines, and software, VW promises — which, if you’ve ever encountered a current MEB vehicle’s software, will come as welcome news. \nThe concept’s front-wheel drive motor spits out 155kW of power, which is the equivalent of around 208 horsepower. It has a range of 420km (260 miles) based on the more generous WLTP cycle. And it can hit a top speed of 175 km/h (108 mph). And with a ball coupling, the ID. Cross can haul up to 75 kg (165 lbs), which VW says is enough to transport two e-bikes. \nThis new drive system will be built in Europe; if fact, VW makes no mention at all of the US market. Not surprising, considering the uneven success the automaker’s EVs have had in America. But still disappointing, considering how starved we are for fun, affordable EVs. \nThe ID. Cross will be similar in size to the T-Cross, which is smaller than the already fairly compact ID.4 SUV. The Cross will be 4,161 mm (164 in) long, 1,839 mm (72 in) wide, and 1,588 mm (63 in) tall — with a wheelbase of 2,601 mm (102 in). The concept is perched on 21-inch alloy wheels designed specifically for the ID. Cross. \nThat said, VW is trying to use the smallish size to its best advantage. With five people inside, the ID. Cross will have a storage capacity of 450 liters, plus 25 more liters in the frunk. The addition of a front truck is a nice surprise, considering all of VW’s current EVs have been sorely lacking in extra storage space. \nThe interior includes fabric-covered surfaces on the dash that matches the materials used on the seats. The steering wheel features — gasp! — real buttons to control driver assist functions and more, which is notable because VW got a lot of blowback for its lack of physical controls in its current crop of EVs. The front seats can be folded flat, flush with the rear seats when stowed, to create a completely flat surface that can be used for car camping. \nVW says the production version of the ID. Cross will get a proper reveal next summer, after the launch of the ID. Polo and ID. Polo GTI, based on the ID.2all concept. The ID.EVERY1 — which has yet to get its production rebranded name — will be out in 2027.\nVW is betting that its newly “likeable” and affordable EVs will help lift its fortunes in the face of fierce competition from China, especially at the low end of the market. The German automaker, which also owns Audi, Porsche, Lamborghini, Skoda, Seat, and others, hasn’t had the same kind of EV success as its crosstown rival BMW, or even South Korean competitors like Hyundai and Kia. Its European sales have been a bright spot in an otherwise uneven portfolio, which may explain why the company isn’t making any commitments beyond the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "749489d4676afbc12e157f6c04f0cfb493b498bf",
      "title": "UK’s new business secretary Peter Kyle expected to visit Beijing in first week",
      "url": "https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T14:13:39.000Z",
      "summary_90w": "",
      "raw": "Former science secretary promoted in reshuffle to continue UK efforts to revitalise trade relationship with China\nThe UK’s new business secretary, Peter Kyle, is expected to fly to Beijing this week as part of Keir Starmer’s continuing efforts to revitalise the UK’s trade relationship with China and provide growth to the British economy.\nThe former science and technology secretary, who was promoted in Friday’s government reshuffle, is expected to land in China on Wednesday, picking up the schedule of his predecessor, Jonathan Reynolds, who is now the chief whip.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93957b08a74557d35a1dca83c175f29ba094f99c",
      "title": "Couple tell of ordeal when kittens went missing after being left in plane hold",
      "url": "https://www.theguardian.com/lifeandstyle/2025/sep/07/airline-loses-kittens-rescued-newlyweds-crete-greece",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T14:06:30.000Z",
      "summary_90w": "",
      "raw": "British newlyweds feared worst when transportation of rescue cats from Greece to Paris went awry\nA newlywed couple who married in Greece have said they feared the worst when three kittens they rescued from Crete went missing after being left in the hold of an aeroplane.\nThey first travelled to the island in September 2023 and found the mother cat, who “had a very distinctive bulging eye that needed to be removed”, Bethany Mulcahy-Stephenson, a veterinary nurse, said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "96c69e8075695a490f98baa18a4af0526f454515",
      "title": "Arrests at rally against Palestine Action ban rise to 890",
      "url": "https://www.bbc.com/news/articles/c8rvly00440o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T13:58:58.000Z",
      "summary_90w": "",
      "raw": "The majority of the arrests were for supporting a proscribed group, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40dec6e2cfbf22b50cfd2f250c3eb5f9f9928a20",
      "title": "McColgan third in Great North Run as Chepkirui wins",
      "url": "https://www.bbc.com/sport/athletics/articles/c20e7r4jg35o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T13:56:17.000Z",
      "summary_90w": "",
      "raw": "Kenya's Sheila Chepkirui claims victory in the Great North Run women's race as Eilish McColgan finished third.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c32faa500204162592d2bc016e246ad713f45fe",
      "title": "Largest Russian air attack of war sets fire to Ukrainian cabinet building",
      "url": "https://www.theguardian.com/world/2025/sep/07/child-among-three-people-killed-in-russian-attack-on-kyiv-that-also-sparked-fire-at-government-building",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T13:39:26.000Z",
      "summary_90w": "",
      "raw": "Officials say three people including mother and baby killed in strikes that also hit key government building for first time\nRussia has launched its largest ever air attack on Ukraine, hitting a key government building in Kyiv for the first time and killing at least three people, including a mother and her baby, Ukrainian officials said.\nThe bombardment of the capital with a large number of drones and missiles injured at least 18 people and set scores of buildings on fire.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60dfe40c778cdbbcfce3d08b65d7c393321b3a9e",
      "title": "Colombia's lone Amazon port faces drying river and rising tensions with Peru",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5525686/colombia-peru-amazon",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T13:30:00.000Z",
      "summary_90w": "",
      "raw": "Colombia's only Amazon port town could soon be cut off from the river that keeps it alive. As drought and a shifting river spark a tense border dispute with Peru, locals are scrambling to adapt—and politicians are raising flags, literally.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49beb9bb6ac7a34046b2f1c1fcad63163b090eab",
      "title": "Wake Up Dead Man adds a delightfully dark twist to Knives Out",
      "url": "https://www.theverge.com/movie-reviews/773429/tiff-2025-wake-up-dead-man-bad-apples-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T13:00:00.000Z",
      "summary_90w": "",
      "raw": "When director Rian Johnson introduced the new Knives Out film on the third day of TIFF 2025, he exclaimed: \"we're going back to church.\"\nBy that he meant that Wake Up Dead Man, the latest Benoit Blanc mystery, would harken back to the origins of the whodunit, and in particular the gothic vibes of Edgar Allan Poe. And now that I've seen it, I have to say that Johnson pulled it off: the new movie has a darker and more spiritual feel than its predecessors, and yet it's still distinctly Knives Out, which is to say twisting and hilarious. I gasped a few times, as did the rest of audience, at the many reveals. I'll have a full review in the comin …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2dfa1d18ea49b0d38e18eb5bd5522e5b8bc570f",
      "title": "Thousands throng Jerusalem to press Netanyahu to make hostage release deal",
      "url": "https://www.bbc.com/news/articles/cn95x2vlv8ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T12:34:12.000Z",
      "summary_90w": "",
      "raw": "Saturday's protests in Israel were some of the largest so far, but PM Netanyahu says defeating Hamas is the way to secure the hostages' release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26c3119323bee0a94e941ad1ba270ab2f7d13b65",
      "title": "Five-day London Underground strike under way",
      "url": "https://www.bbc.com/news/articles/cx2rg128l68o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T12:32:13.000Z",
      "summary_90w": "",
      "raw": "London Underground staff start a five-day walkout over pay and conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8403a41886613448842c9a0d1a7857c6128e38b",
      "title": "My clothes wouldn't fit in my new flat - so I invented Vinted",
      "url": "https://www.bbc.co.uk/bitesize/articles/zttrp9q?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T12:00:46.000Z",
      "summary_90w": "",
      "raw": "Milda Mitkutė tells the BBC how a simple idea to sell her unwanted clothes became a billion dollar business.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f03045b5b9983f4c9a24989c1dcc6b8a4bd31b",
      "title": "Blackwater founder and Maga disciple Erik Prince pitching services in Ukraine",
      "url": "https://www.theguardian.com/world/2025/sep/07/erik-prince-blackwater-ukraine",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T12:00:20.000Z",
      "summary_90w": "",
      "raw": "Sources say Prince, whose firm’s contractors committed 2007 Iraq massacre, eager to get into valuable drone sector\nAmid reports that Donald Trump’s administration is considering using US private military contractors in a postwar Ukraine, multiple sources tell the Guardian one high-profile and controversial American from the “war on terror” era is already circling for business.\nIn the streets of Kyiv, military hawks and defense privateers have described how Erik Prince, Maga disciple and founder of the now-defunct mercenary company Blackwater, has been aggressively pitching his services and looking to buy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "50bf37a6714f66be72e9c3a77e437a8b87f7eb17",
      "title": "A really cheap way to get really smart lights",
      "url": "https://www.theverge.com/installer-newsletter/773123/philips-hue-essentials-silksong-instagram-ipad-the-paper-installer",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Hi, friends! Welcome to Installer No. 96, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, has your inbox been as busy as mine the past few days?, and also you can read all the old editions at the Installer homepage.) \nOver the past two weeks, I've been testing this wildly customizable keyboard with an attachable trackball, reading the first Dungeon Crawler Carl and the second Dark Tower books, finally finishing Sekiro: Shadows Die Twice (with the help of an easy mode mod), marveling at the GeoGuessr World Championship grand final, and listening to Wombo's new album.\nThis week, I also have for you Hol …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0fe570bcd6e2a3b58109dd5c2f1291d3dbf2ebcf",
      "title": "Computer chips, with a side of forever chemicals",
      "url": "https://www.theverge.com/the-stepback-newsletter/772845/computer-chips-forever-chemicals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T12:00:00.000Z",
      "summary_90w": "",
      "raw": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on all things at the intersection of environment and technology, follow Justine Calma. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started\nSome stories that I've worked on as an environmental journalist still haunt me. One of the first to get under my skin happened to be about forever chemicals. \nSince the 1940s, forever chemicals have been commonly used by manufacturers as a way to make things resistant to water, stains, and heat. Think food packaging, nonstick pans, water-repellan …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0821bfdb2476b823c1947bf67d7f1ab6c7c26f63",
      "title": "Has Labour Just Moved Towards the Right?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1cyhy?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:54:00.000Z",
      "summary_90w": "",
      "raw": "With Angela Rayner out, is Keir Starmer’s government more right wing?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed81481a4f559196ef75013c309ccd45cd47f240",
      "title": "Zelensky condemns 'ruthless attack' after Russia hits main government building in Kyiv",
      "url": "https://www.bbc.com/news/articles/cpq5dl5y4nlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:39:13.000Z",
      "summary_90w": "",
      "raw": "It is the first time a Kyiv government building - in the heavily protected city centre - has been hit since Russia launched its full-scale invasion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a829b13f0f57864ea481543c275124184df61cc5",
      "title": "Burnham concerned about balance of cabinet after Rayner exit",
      "url": "https://www.bbc.com/news/articles/crkj46z4v84o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:32:17.000Z",
      "summary_90w": "",
      "raw": "The Greater Manchester mayor says he would like to see a northerner as deputy leader of the Labour Party.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bd4bf897227b7c79ec7b92c627623697985c255",
      "title": "South Korea says it has reached a deal with the US for the release of workers in a Georgia plant",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533069/south-korea-deal-with-us-for-release-workers-in-georgia-plant",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T11:13:08.000Z",
      "summary_90w": "",
      "raw": "More than 300 South Korean workers were detained in an immigration raid on Thursday. Presidential chief of staff Kang Hoon-sik said South Korea plans to send a charter plane to bring the workers home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "776f407451f3f69bfb3af9007cf503d7a3b44a38",
      "title": "The silent killer increases your risk of stroke and dementia. Here's how to control it",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/07/nx-s1-5532108/the-silent-killer-increases-your-risk-of-stroke-and-dementia-heres-how-to-control-it",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T11:00:00.000Z",
      "summary_90w": "",
      "raw": "New recommendations for early treatment for hypertension to prevent strokes, heart attacks and dementia come as an experimental medication is shown to lower blood pressure in hard to treat patients.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c71c9082ffeaece5b361fe0c8f17997eb6e0c9b",
      "title": "Are you a grandparent-to-be? Here's some advice from those who came before you",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5525823/national-grandparent-day-advice",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Sept. 7 is National Grandparents Day. NPR readers shared the joys of becoming grandparents and offered some sage advice.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eee8bfb48f4a975f188b62b21ed480f115919ab5",
      "title": "Japan's Prime Minister Shigeru Ishiba resigns after election defeats",
      "url": "https://www.bbc.com/news/articles/c98edpz2yn9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T10:21:00.000Z",
      "summary_90w": "",
      "raw": "The prime minister had struggled to inspire confidence as Japan faced economic headwinds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60f2e4af99c19df362c8243cd2ce61c917510aa8",
      "title": "'Our rivalry started here' - Alcaraz and Sinner set for Grand Slam trilogy in New York",
      "url": "https://www.bbc.com/sport/tennis/articles/cy9n479xz2ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T10:00:24.000Z",
      "summary_90w": "",
      "raw": "Spain's Carlos Alcaraz and Italy's Jannik Sinner continue their dominance at the top of the men's game when they meet in Sunday's US Open final.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69ee372a67aefdd9ae7a23bc1be9ab19f8761145",
      "title": "LGBTQ+ Americans consider move to Canada to escape Trump: ‘I’m afraid of living here’",
      "url": "https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T10:00:17.000Z",
      "summary_90w": "",
      "raw": "LGBTQ+ people in the US contemplate heading north as they wrestle with the president’s assault on the community\nThe number of LGBTQ+ Americans inquiring about moving to Canada has soared since Donald Trump’s re-election, campaigners have said, as people across the US wrestle with the fallout of rising anti-gay rhetoric, anti-trans executive orders, and the more than 600 bills targeting LGBTQ+ rights.\n“So much is happening in the US right now and a lot of it is terrifying,” said Latoya Nugent of Rainbow Railroad, a North American charity that helps LGBTQI+ individuals escape violence and persecution in their home countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "778cfd5c32802766c7012c868c59bd67c4bf4e1e",
      "title": "300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T09:45:51.000Z",
      "summary_90w": "",
      "raw": "Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles\nSouth Korea has said negotiations with the US to secure the release of its nationals detained in a raid by US immigration officials on a Hyundai plant in the state of Georgia have been “concluded” and that they would soon be freed and flown home.\nIt follows the arrest of more than 300 South Korean workers at a Hyundai-LG battery site being built in the southern US on Thursday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc4853f9f2de52d1b6346daf2247eaf985eb3ae0",
      "title": "Japan PM Shigeru Ishiba to resign amid fallout from disastrous elections",
      "url": "https://www.theguardian.com/world/2025/sep/07/japan-pm-shigeru-ishiba-resign",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T09:37:47.000Z",
      "summary_90w": "",
      "raw": "Public broadcaster says prime minister has made decision to avoid divide within his Liberal Democratic party\nJapan’s prime minister, Shigeru Ishiba, is to resign less than a year after taking office, throwing the country’s politics into turmoil and setting in motion a potentially messy contest to replace him as leader of the ruling Liberal Democratic party (LDP).\nThe softly spoken centrist has presided over two disastrous elections since being elected to lead the LDP last autumn. In October, the party and its junior coalition partner Komeito lost their majority in the lower house and met the same fate in upper house elections this July.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36ff0d2c045f2aadec1331adb9541a63350e68f4",
      "title": "Warsaw opens metro station ‘express’ library to get commuters off their phones",
      "url": "https://www.theguardian.com/world/2025/sep/07/warsaw-opens-metro-station-express-library-smartphones",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T09:36:58.000Z",
      "summary_90w": "",
      "raw": "Metroteka aims to encourage people to read more in country that lost majority of libraries in second world war\nAn “express” library has opened in a new metro station in Warsaw, aiming to provide an appealing cultural space to encourage residents and commuters to forgo smartphones in favour of books and, thanks to fresh herbs growing in a vertical garden, a dash of subterranean greenery too.\nThe stylish Metroteka, which opened this week in the Kondratowicza M2 line metro station in the Polish capital’s Targówek district, offers two reading areas for adults and children, as well as a space for public readings and events.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c5ad72f4242c53618a7947581195294d16d4b39",
      "title": "Japan's Prime Minister Shigeru Ishiba to resign",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533048/japan-prime-minister-ishiba-resign",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T09:13:46.000Z",
      "summary_90w": "",
      "raw": "Japan's Prime Minister Shigeru Ishiba has expressed his intention on Sunday to step down following growing calls from his party to take responsibility for a historic defeat in July's parliamentary election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d9393d26aa52a2732741e99eb310c88af3160d5b",
      "title": "Teen gamer who 'performed miracles' becomes  first millennial saint",
      "url": "https://www.bbc.com/news/articles/c5yg5me8dvlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T08:38:20.000Z",
      "summary_90w": "",
      "raw": "Before his death at 15, Carlo Acutis was known for his love of technology and had created a website to document miracles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "daaf8e1d85e6cda2b80c0a9bebebd2dc0a37d931",
      "title": "South Korea reaches deal to release nationals detained in Hyundai raid in US",
      "url": "https://www.bbc.com/news/articles/cj07jzgve45o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T08:24:34.000Z",
      "summary_90w": "",
      "raw": "US officials say the workers - including more than 300 South Koreans - were working illegally.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fa1d463e2c0f42b7f18a2cdaad6d2b412e3e72a3",
      "title": "Brainless bodies and pig organs: does science back up Putin and Xi’s longevity claims?",
      "url": "https://www.theguardian.com/science/2025/sep/07/science-putin-xi-longevity-immortality-get-younger-organ-claims",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T08:00:14.000Z",
      "summary_90w": "",
      "raw": "Russian leader’s claim that people can ‘get younger’ through repeated organ transplants has raised eyebrows\nPerhaps it was the extravagant display of deadly weaponry that prompted Xi Jinping and Vladimir Putin to mull on mortality at this week’s military parade in Beijing.\nIt was more banter than serious discussion, but with both aged 72, the Chinese president and his Russian counterpart may feel the cold hand on the shoulder more than Kim Jong-un, the 41-year-old North Korean leader who strolled beside them.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7da1fce3c91616c0ed8dcd5251e96c32e75d5bc",
      "title": "A teen nicknamed 'God's influencer' has become the first millennial saint",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5528970/millennial-saint-carlo-acutis-canonization-catholic-church",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T08:00:00.000Z",
      "summary_90w": "",
      "raw": "Carlo Acutis, who died of leukemia at 15 in 2006, is known in the Catholic Church as \"God's influencer\" for harnessing technology to spread the word about miracles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63da027c86ffa11c900108ba37e968da61242d0e",
      "title": "Keir Starmer has ‘legal duty to stop Gaza genocide’, says Greta Thunberg",
      "url": "https://www.theguardian.com/world/2025/sep/07/keir-starmer-has-legal-duty-to-stop-gaza-genocide-says-greta-thunberg",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T07:48:28.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Activist spoke while onboard aid flotilla aiming to deliver food, baby formula and medical supplies to territory\nKeir Starmer must obey his “legal duty to act to prevent a genocide”, Greta Thunberg has told the Guardian while travelling onboard an aid flotilla heading for Gaza.\nThe Swedish activist said there was a “huge absence of those whose legal responsibility it is to step up” under international law, and called out the UK prime minister before a potential meeting this week with Israel’s president, Isaac Herzog.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3541e2dedc6b129cb3a888ba05f73a31ff23dbc6",
      "title": "Watch: BBC at the scene of Ukrainian government building strike",
      "url": "https://www.bbc.com/news/videos/cy04lx67e1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T07:41:25.000Z",
      "summary_90w": "",
      "raw": "One of Kyiv's main government buildings was hit in overnight missile and drone strikes by Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cfb64bdeaf285478dbe05a4cb563ca61130bb12c",
      "title": "Russia assaults Ukraine with over 800 drones and decoys, the largest such attack in the war",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533036/russia-assaults-ukraine-800-drones-largest-attack-war",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T07:07:28.000Z",
      "summary_90w": "",
      "raw": "Russia hit Ukraine's capital with drone and missiles Sunday in the largest aerial attack on the country since the war began.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bf820fb269cc7702dd059f41a5ae3c9c47215a6",
      "title": "Recognition of Palestinian state is 'disastrous', US ambassador says",
      "url": "https://www.bbc.com/news/videos/cvgqkpvq7vno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T06:58:05.000Z",
      "summary_90w": "",
      "raw": "Mike Huckabee, the United States Ambassador to Israel, has said that plans to recognise a Palestinian state have had \"disastrous consequences\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac7e4c854c01c8c7c0d8c2ee4b9a8458d50ad359",
      "title": "One of America's most wanted evaded the FBI for 21 years - only to be found in Wales",
      "url": "https://www.bbc.com/news/articles/ckgjpn8gl97o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T06:08:20.000Z",
      "summary_90w": "",
      "raw": "The prime suspect for two bombings in California in 2003 was found in a Welsh cottage last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T04:53:25.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d1354f08674e8d7bac279929db07ade6f0f85be",
      "title": "Two boys, 12 and 15, killed in Melbourne attacked by eight knife and machete wielding suspects",
      "url": "https://www.theguardian.com/australia-news/2025/sep/07/two-boys-fatally-stabbed-melbourne-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T03:39:20.000Z",
      "summary_90w": "",
      "raw": "Fatal stabbing attack on two boys in Cobblebank had ‘the hallmarks of a youth gang crime’, Victoria police say\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA fatal stabbing attack on two boys in Melbourne by eight masked attackers armed with machetes and long edged weapons had “the hallmarks of a youth gang crime”, Victoria police say.\nA 12-year-old and 15-year-old Dau Akueng were found fatally stabbed on separate streets in Cobblebank, in the city’s west, on Saturday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e8bc821de82dbdfdd078f6f512f4437d185f7d0",
      "title": "China’s military follows Australian and Canadian warships in Taiwan Strait accusing them of ‘provocation’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/07/chinas-military-follows-australian-and-canadian-warships-in-taiwan-strait-accusing-them-of-provocation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T01:42:27.000Z",
      "summary_90w": "",
      "raw": "Strait is considered an international waterway by countries including the US, Canada, Britain and Taiwan\nAustralian and Canadian warships sailing through the sensitive Taiwan Strait have been followed and warned by China’s military, with Beijing describing the incident as a provocation.\nThe People’s Liberation Army’s Eastern Theatre Command said the Australian guided-missile destroyer Brisbane and the Canadian frigate Ville de Quebec were engaged in “trouble-making and provocation”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1637afc387ba39bb113f080f51bb94340f8ca323",
      "title": "India's iconic Parsi magazine to shut after 60 years",
      "url": "https://www.bbc.com/news/articles/c20zpplevn3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T00:52:30.000Z",
      "summary_90w": "",
      "raw": "Parsiana - a fortnightly journal that chronicles the Parsi community - was started in 1964 by a Parsi doctor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95339b0ff9571f07bcc58d5d0f75a382a07684bf",
      "title": "Young Phillies fan is gifted swag after adult fan takes his home run ball",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532632/phillies-marlins-young-fan-home-run-ball-woman",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-07T00:37:16.000Z",
      "summary_90w": "",
      "raw": "A boy in the stands of a Philadelphia Phillies game thought he'd scored a baseball hit by Phillies outfielder Harrison Bader, until another fan insisted the ball was hers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18f0a29b6143bfb94f21a7346dee0dcec59de55e",
      "title": "Ethiopia outfoxes Egypt over the Nile's waters with its mighty dam",
      "url": "https://www.bbc.com/news/articles/cz71zndj001o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T00:05:30.000Z",
      "summary_90w": "",
      "raw": "Ethiopia is set to inaugurate a mega dam that has stoked tensions with Egypt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f1944d2f1bf44eb75407385530104eb206c798b",
      "title": "One of the world's most sacred places is being turned into a luxury mega-resort",
      "url": "https://www.bbc.com/news/articles/c707kx2nk7go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T23:59:26.000Z",
      "summary_90w": "",
      "raw": "The biblical site of Mount Sinai in Egypt is at the heart of an unholy row over plans to build a huge new tourism project.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f846af29cf72e7d4c03e61fbf9e6a8fa4bfd217",
      "title": "Tight vote in Norway to decide whether to stick with Labour or turn right",
      "url": "https://www.bbc.com/news/articles/c701382e994o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T23:54:57.000Z",
      "summary_90w": "",
      "raw": "Norwegians go to the polls on Sunday and Monday, with domestic issues expected to be at the forefront of voters' minds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b541a10c4f98787750f740bcd0919a143e78400",
      "title": "Inflatable tanks and flat-pack guns - inside Ukraine's decoy war",
      "url": "https://www.bbc.com/news/articles/cr4e435x4kqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T23:52:52.000Z",
      "summary_90w": "",
      "raw": "Both Russia and Ukraine are using blow up dolls and plastic decoys as tricks on the battlefield.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "866e13c36837a971ebce78acfd3ab6e1180af1de",
      "title": "Historic pilgrimage for LGBTQ+ Catholics at Vatican",
      "url": "https://www.bbc.com/news/articles/cge2jy27xgjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T23:45:07.000Z",
      "summary_90w": "",
      "raw": "Some 1,400 LGBTQ+ people are taking part for the first time in a pilgrimage to mark the Vatican's Jubilee Year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c406b88b6f327cf677c39a4a32b199b43e60cca",
      "title": "Anna Wintour was Vogue. Now she's stepped back, can the magazine stay relevant?",
      "url": "https://www.bbc.com/news/articles/c04q91q3zvpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T23:32:14.000Z",
      "summary_90w": "",
      "raw": "She made a name for herself as someone who understood the zeitgeist. But her successor Chloe Malle faces an uphill battle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "896a1aa9e26f1b3dadd7150501cfa70fe4e47e84",
      "title": "Prince Harry to visit UK for first time since security court hearing",
      "url": "https://www.bbc.com/news/articles/cz9jpdq1k04o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T23:25:15.000Z",
      "summary_90w": "",
      "raw": "It is one of several engagements for the Duke of Sussex during his visit to the UK this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5b639c66f494e2f3a3111286bc8b89396219620",
      "title": "How will the EU's new border system work? ",
      "url": "https://www.bbc.com/news/articles/c39rkpe8mj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T23:03:13.000Z",
      "summary_90w": "",
      "raw": "The EU's much-delayed Entry/Exit System will change the way UK passengers travel to 29 countries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "baf3d47203d4aa69d8a84aa0162af5b7c5f9509c",
      "title": "Why is an Amazon-backed AI startup making Orson Welles fan fiction?",
      "url": "https://techcrunch.com/2025/09/06/why-is-an-amazon-backed-ai-startup-making-orson-welles-fan-fiction/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T21:30:22.000Z",
      "summary_90w": "",
      "raw": "This is a bad idea.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "800476d28d8bc2fd419cd50b70ddf310d11e99a3",
      "title": "They called him 'God's influencer,' the Catholic Church canonizes the first millennial saint",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5369434/catholic-church-canonizes-first-millennial-saint",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T21:14:40.000Z",
      "summary_90w": "",
      "raw": "The Catholic Church is about to canonize its first saint of the millennial generation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9d431899e156687a4a75a9be5bc0605c8a6add82",
      "title": "Boko Haram kills at least 60 in overnight attack on Nigerian village",
      "url": "https://www.bbc.com/news/articles/c3rvxdw52vdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T20:57:46.000Z",
      "summary_90w": "",
      "raw": "Many of those killed had recently returned to the village in Borno State, following years of displacement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75fa15bda648297449b28e4089dc5932df15d6fb",
      "title": "WA museum tells staff ‘almost all of us are guilty’ of burning fossil fuels in email defending Woodside partnership",
      "url": "https://www.theguardian.com/australia-news/2025/sep/07/western-australia-museum-woodside-partnership-staff-email-almost-all-of-us-guilty-burning-fossil-fuels-email-defending",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T20:54:57.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Climate advocates reject CEO’s claim he is ‘not qualified’ to comment on risks of gas firm’s plan to extend production to 2070\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe head of the Western Australian Museum has told staff that burning fossil fuels is something “almost all of us are guilty of in one way or another” in an email defending the institution’s renewed research partnership with Woodside.\nThe museum’s chief executive, Alec Coles, sent the email to staff before a Woodside-sponsored August open day at the Maritime Museum – one of WA Museum’s seven locations. It came amid public criticism of the extension of the “longstanding collaboration”, in which the gas company supports the museum’s biodiversity research along the WA coastline.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "681c5df26744781b048a9e19a736ebc81637cec0",
      "title": "'We are the troops': Inside Chicago's split communities as Trump vows to deploy National Guard",
      "url": "https://www.bbc.com/news/articles/c4gj489q6e0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T20:54:22.000Z",
      "summary_90w": "",
      "raw": "Some locals are working to prevent youngsters from sliding into gangs, but others ask the troops to come sooner.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62bd834724d8dec44271c34775d5cacebd5d914f",
      "title": "NSW locks in great koala national park and brings in immediate ban on logging",
      "url": "https://www.theguardian.com/australia-news/2025/sep/07/nsw-locks-in-great-koala-national-park-and-brings-in-immediate-ban-on-logging",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T20:00:03.000Z",
      "summary_90w": "",
      "raw": "Minns government to create one of the largest national parks in the state as forest advocates welcome ‘historic’ victory\n\nLoss of koala habitat shows ‘total failure’ of nature laws, conservationists say\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Minns government has confirmed its long-awaited great koala national park, announcing it will add 176,000 hectares of forest to existing reserves in mid-north New South Wales to create one of the largest national parks in the state and protect more than 12,000 koalas.\nThe premier, Chris Minns, and environment minister, Penny Sharpe, said the government would put an immediate moratorium on logging within the park’s boundaries and roll out a jobkeeper style support package for workers at affected timber mills in the region.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26ad80f86f8a5aaba01fdf94185de2098d37e890",
      "title": "Cable snapped before Lisbon funicular crash, investigators say",
      "url": "https://www.bbc.com/news/articles/c2dnp9pre2lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T19:44:26.000Z",
      "summary_90w": "",
      "raw": "The rest of the mechanism worked properly, says a preliminary statement into the crash which killed 16 people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "febb535b7ba16857aa2cf831ebebac7cc2367a85",
      "title": "South Korea charters plane to fly home over 300 workers detained by ICE at Georgia Hyundai plant",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532604/hyundai-immigration-raid-georgia-south-korea",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T19:38:32.000Z",
      "summary_90w": "",
      "raw": "On Sunday, South Korean officials said they would send a plane to bring the detained workers home. Earlier, South Korea's Foreign Minister said his nation was \"deeply concerned\" by the arrests.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9bdd7af42286df4d4aea34d2feaad02caa59470e",
      "title": "Pilot who tried to cut off engine midair after taking mushrooms pleads guilty",
      "url": "https://www.bbc.com/news/articles/c4gq9n6kwxeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T18:06:05.000Z",
      "summary_90w": "",
      "raw": "The off-duty pilot was sitting in the cockpit of the Alaska Airlines flight when he tried to crash the jet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd839d4165acca927488f6bf22dcb78d98310891",
      "title": "Mourners pay tribute at public viewing of Giorgio Armani's coffin",
      "url": "https://www.bbc.com/news/videos/cnvrd46e4q1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T17:24:45.000Z",
      "summary_90w": "",
      "raw": "Mourners queue in Milan to say goodbye to the Italian designer who died on Thursday, aged 91.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126cb85fc3f66a189bc693da8a17c18c1b6fcafa",
      "title": "EU fines Google $3.5B over adtech ‘abuse’",
      "url": "https://techcrunch.com/2025/09/06/eu-fines-google-3-5b-over-adtech-abuse/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T17:06:03.000Z",
      "summary_90w": "",
      "raw": "This is the EU's largest antitrust penalty ever — and Trump has already threatened to \"nullify\" it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f91331ab9ced0122cb114baaed64ae8c1db40d1a",
      "title": "Pocket Scion is a synth you play with plants",
      "url": "https://www.theverge.com/news/773352/pocket-scion-synth-mushroom-music",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T16:00:00.000Z",
      "summary_90w": "",
      "raw": "A few years ago, artist Modern Biology became a viral sensation when he posted videos of himself controlling a modular synth with mushrooms on TikTok. Pocket Scion gives anyone similar capabilities, but without having to spend thousands of dollars on a Eurorack rig – and in a much more portable package. \nA core part of Modern Biology’s setup is a module called Scion from Glasgow-based Instruo. Scion turns biofeedback, whether that’s from houseplants or your own skin, into CV (control voltage) for controlling other synth modules in a larger setup. Touching two sensors to your hand or a mushroom completes a circuit, and then electrical fluctuations in that circuit can be used to trigger different notes, or change the cutoff on a filter, for instance.\nA little over a year ago, he approached Instruo about building something new. The fruit of that collaboration is the Pocket Scion, an affordable self-contained instrument that can turn small electrical changes from living organisms into MIDI data and create soundscapes using one of the four built-in sound engines. \nThe Pocket Scion has a number of advanced capabilities too, including MIDI out for controlling external instruments. There’s also a companion app for Windows, macOS, and Linux that exposes sound design tools for creating your own synth patches, and can send data over Open Sound Control (OSC), which gives it control over a ton of audio and video programs like Max/MSP, Pure Data, and Unreal Engine for creating visualization or complex reactive art installations. It’s more powerful than you’d expect given its $149 price.\nThe initial run of Pocket Scions sold out almost immediately. But you can place a preorder for when the next batch ships “early next week,” according to retailer Control Voltage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8975cb71bfcd445535ac0c1981eb7726a728226b",
      "title": "The growing debate over expanding age verification laws",
      "url": "https://techcrunch.com/2025/09/06/the-growing-debate-over-expanding-age-verification-laws/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T16:00:00.000Z",
      "summary_90w": "",
      "raw": "As age and identity verification laws become more mainstream, this legislation could have a dire impact on privacy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dfcb4330b4745abcca9cf2647266451d1ad91978",
      "title": "Park Chan-wook&#8217;s No Other Choice is as bleak as it is hilarious",
      "url": "https://www.theverge.com/movie-reviews/773376/tiff-2025-no-other-choice-man-in-my-basement-reviews",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T15:00:00.000Z",
      "summary_90w": "",
      "raw": "No Other Choice.\t\n\nAt my second day at TIFF 2025, the longest line I saw wasn't for a movie: it was for the Criterion Closet. The space is housed in a van so that it could make it up to Toronto, and honestly, it felt a little wrong to see the outside of it after watching everyone from Michael Cera to Hideo Kojima spend time in its cramped interior digging through Blu-Rays.\nThe line was long enough that I didn't even bother trying to get inside, which is probably a good thing since I'd just be overwhelmed anyways. Besides, standing in that line would cut into my movie time, which is already a precious resource given there are so many things to check out.\nIf t …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a924b908341c1c86f307db4c6c9498dfecd63811",
      "title": "Musk’s $1T pay package is full of watered-down versions of his own broken promises",
      "url": "https://techcrunch.com/2025/09/06/musks-1t-pay-package-is-full-of-watered-down-versions-of-his-own-broken-promises/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T14:02:36.000Z",
      "summary_90w": "",
      "raw": "Musk used to say Tesla would make 20 million cars and one million humanoid robots per year. The company's board wants far less than that in exchange for $1 trillion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2c52936332fe58f8ab1d2f87fe5462a66eaa0889",
      "title": "More than 7,000 under-fives in Gaza put in malnutrition recovery in two-week period",
      "url": "https://www.theguardian.com/world/2025/sep/06/unicef-under-5s-recovery-programmes-acute-malnutrition-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T14:00:53.000Z",
      "summary_90w": "",
      "raw": "Total for August may exceed 15,000 new patients, more than seven times February figure\nMore than 7,000 children under the age of five were put on recovery programmes for acute malnutrition at clinics run by Unicef in Gaza in just two weeks last month, figures reveal.\nThe overall total for August is being compiled by Unicef but is expected to exceed 15,000 new patients, more than seven times the total in February.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4dcc62e89993455bb84006b36921d413fa61a27d",
      "title": "Bluetti says it can reduce vanlife power installations to ‘30 minutes’",
      "url": "https://www.theverge.com/news/767283/all-in-one-vanlife-power-system-rvsolar-bluetti",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The RVSolar System living its best vanlife. | Image: Bluetti\t\n\nIt only took three years, but Bluetti is following EcoFlow’s lead with a fully integrated power system of its own to make vanlifers, off-grid cabins, and boats energy independent. The RVSolar System’s main advantage over bespoke systems is a relatively quick and easy installation, requiring just “30 minutes,” according to Bluetti’s announcement at IFA 2025. \nWhile it’s undoubtedly faster than installing a fully bespoke solution from Victron Energy, for example, the last time I installed EcoFlow’s comparable system, it took closer to five hours — and that was after several hours of planning, measuring, and double-checking. Thirty minutes is just the time needed to screw everything together, so there’s still a hint of truth here.\nBluetti’s 48V RVSolar System is capable of 5,000W of max AC output or 1,360W DC. That’s plenty of power for everything from a roof-mounted air conditioner and induction cooktop to a 12V water pump and lighting system. It can be configured with a whopping 122kWh of Bluetti’s self-heated LFP batteries — enough for me to live and work off the grid for as long as 76 days, based upon the 1.6kWh average that I consume daily in my own van. As a bonus, Bluetti’s system also supports compatible third-party batteries, which is something EcoFlow can’t claim with its proprietary connectors.\nMaxing out a system with batteries will be overkill for most since these systems are designed to be easily rechargeable when out in the sticks. Batteries connected to the system can be recharged from a number of sources, including solar panels (up to 3600W), shore-power hookup (up to 5000W), a diesel generator (up to 5000W), and your vehicle’s own alternator (up to 1200W).\n\n\n\n\nThe system is built around an RV5 Power Hub unit that houses all the devices, which typically have to be wired together separately in a bespoke installation. These include the DC-to-AC inverter to convert DC energy to AC power for the microwave or coffee machine, an MPPT solar charger to regulate solar panel input, a DC-DC charger to top up the batteries when the vehicle’s motor is running, and a DC converter to step down the voltage for 12V / 24V devices like lights, USB sockets, pumps, and modern A/C units. \nThe kit also comes with a smart distribution panel for 8 AC and 20 DC circuits, with remote control over four of those AC circuits and six DC. You also get a wired 10.1-inch control screen that can be installed at a central location in the vehicle for remote monitoring and circuit-level control — functionality that’s replicated in the Bluetti app.\nThe RVSolar System will be available globally on September 30th. Pricing information wasn’t available at the time of publication, but I’d expect it to be on par with Victron components, especially if it’s using third-party batteries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6314ee64a0542ed1054ece76a3133c1c5daca5f6",
      "title": "Super Robot Wars Y plays just like a kid’s giant robo fanfiction",
      "url": "https://www.theverge.com/games/773191/super-robot-wars-y-impressions-demo-nintendo-switch-2",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T14:00:00.000Z",
      "summary_90w": "",
      "raw": "When I was 16 years old, I wrote my first fanfiction. It was a crossover fic where the cast from Queer Eye for the Straight Guy gave the anime dog demon Inuyasha a makeover. It was stupid and poorly written, and yet, to this very day, I remember it fondly. This is exactly what it's like playing Super Robot Wars Y - an exceedingly silly, nonsensical plot featuring characters that have no business speaking to each other all, stitched together by tactical robot action. It rules.\nSuper Robot Wars Y was released on Nintendo Switch 2 and Steam on August 29th. For this blog, I played the demo that covers the game's first chapter with progress carr …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54253b5d158f615c3d943c7173f4638cddeca3bb",
      "title": "US tells Kilmar Ábrego García he faces deportation to Eswatini",
      "url": "https://www.bbc.com/news/articles/cn0r3nx4rd7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T13:22:47.000Z",
      "summary_90w": "",
      "raw": "The Salvadoran has been at the heart of an immigration row since he was mistakenly deported in March.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbe3fce1b8aace9ac4026fff3ce7f0979b42c134",
      "title": "Herdling is a serene and adorable way to unwind",
      "url": "https://www.theverge.com/games-review/764810/herdling-panic-review-pc-switch-playstation-xbox",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T13:00:00.000Z",
      "summary_90w": "",
      "raw": "A screenshot from Panic’s Herdling game. | Image: Panic / Okomotive\t\n\nHerdling is a slow game about herding fuzzy animals through a vibrant natural world. That may not sound particularly exciting, but I found it to be a perfect game to unwind with after a stressful day.\nIn Herdling, you play as a kid who makes friends with and shepherds large fluffy creatures called Calicorns, which kind of look like a mix of a sheep and a woolly mammoth. The Calicorns are adorable, with cute snorts and head shakes that make them feel like real animals. You'll even get opportunities to play fetch, and yes, you can pet the Calicorns. You can also name your furry friends, and the game even suggests ideas, which is why my flock  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ff5bffa30fc613afcdb7a34b907996e064561552",
      "title": "Opinion: Susan Stamberg, trailblazer and NPR Founding Mother, retires",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5522120/opinion-susan-stamberg-trailblazer-and-npr-founding-mother-retires",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T12:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR Founding Mother Susan Stamberg is retiring. She became the first woman to anchor a nightly national news program in 1972, and helped loosen up the serious, stodgy sound of radio hosts.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04f64312059b1aa29a182530f112c797830ea1b3",
      "title": "How an 18th-century portrait stolen by the Nazis was recovered 80 years later in Argentina",
      "url": "https://www.theguardian.com/world/2025/sep/06/18th-century-portrait-stolen-by-nazis-recovered-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Painting was spotted online by Dutch journalists when the daughter of a former Nazi official put her house up for sale in Mar del Plata\nThere was nothing very remarkable about the middle-aged couple who lived in the low, stone-clad villa on calle Padre Cardiel, a quiet residential street in the leafy Parque Luro district of Argentina’s best-known seaside town, Mar del Plata.\nPatricia Kadgien, 59, was born in Buenos Aires, five hours to the north. Her social media described her as a yoga teacher and practitioner of biodecoding, an obscure alternative therapy that claims to cure illness by resolving past traumas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c46d49637a5337b41fa747390d93df195717d5eb",
      "title": "The sunscreen scandal shocking Australia - the world's skin cancer hotspot",
      "url": "https://www.bbc.com/news/articles/c4gzl41rpdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T05:41:05.000Z",
      "summary_90w": "",
      "raw": "It has shaken consumer trust and raised questions about global sunscreen regulation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37947137d683cb3f96ed50b0219340f8dbf557a4",
      "title": "New Bollywood romcom sparks debate over stereotyping south India",
      "url": "https://www.bbc.com/news/articles/c4gveer8wgro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T00:46:16.000Z",
      "summary_90w": "",
      "raw": "Param Sundari has reignited conversation on how India's most influential film industry represents non-Hindi speaking states.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8862e1f71f4ac521fc8da9d3072a40ee372795bc",
      "title": "Rosenberg: What's behind Putin's uncompromising stance on Ukraine?",
      "url": "https://www.bbc.com/news/articles/c0m40pv44kgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T00:42:54.000Z",
      "summary_90w": "",
      "raw": "Moscow's diplomatic success in China, and Trump's lack of action, have emboldened Putin, reports Steve Rosenberg.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac6c240cc7301e15e50964e552d7a24af51494db",
      "title": "Why the world is watching RFK's fight with US health agency",
      "url": "https://www.bbc.com/news/articles/c62ngkpxk9lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T00:24:45.000Z",
      "summary_90w": "",
      "raw": "The US health secretary's plans could have a huge impact on health policy not just in the US, but across the globe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1731bbfe2d88f2f34ec7d43bcd198b36ff02523f",
      "title": "OpenAI reorganizes research team behind ChatGPT’s personality",
      "url": "https://techcrunch.com/2025/09/05/openai-reorganizes-research-team-behind-chatgpts-personality/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T23:19:12.000Z",
      "summary_90w": "",
      "raw": "OpenAI is shuffling the team that shapes its AI models' behavior, and its leader is moving on to another project within the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1467baf17cd5bb21a1897e198cc9e445a76fdb2a",
      "title": "Watch: What's in the 'missing minute' of Epstein's jail video?",
      "url": "https://www.bbc.com/news/videos/c98eyn3xey2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T23:01:23.000Z",
      "summary_90w": "",
      "raw": "The US House Oversight Committee has released new surveillance footage recorded hours before the convicted paedophile's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76d81638d9b80d90fd38c1e1e8fc79e09b51402a",
      "title": "Under Trump, the Federal Trade Commission is abandoning its ban on noncompetes",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528937/ftc-noncompete-ban-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T21:46:33.000Z",
      "summary_90w": "",
      "raw": "Federal Trade Commission Chair Andrew Ferguson has called his agency's rule banning noncompetes unconstitutional. Still, he says protecting workers against noncompetes remains a priority.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8a756f86af8b9e727568afbc53119ada7d8084da",
      "title": "Screw the money — Anthropic’s $1.5B copyright settlement sucks for writers",
      "url": "https://techcrunch.com/2025/09/05/screw-the-money-anthropics-1-5b-copyright-settlement-sucks-for-writers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T20:59:21.000Z",
      "summary_90w": "",
      "raw": "Writers aren't getting this settlement because their work was fed to an AI -- this is just a costly slap on the wrist for Anthropic because it illegally downloaded books instead of buying them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0a2945e4f3d3901564e99ea2e0388645285dae0",
      "title": "Judge blocks ending of legal protections for 1m Venezuelans and Haitians in US",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/ruling-end-protections-haitian-venezuelan-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T20:50:00.000Z",
      "summary_90w": "",
      "raw": "Homeland security had tried to end temporary protected status granted by the Biden administration\nA federal judge on Friday ruled against the Trump administration from ending temporary legal protections that have granted more than 1 million people from Haiti and Venezuela the right to live and work in the United States.\nThe ruling by US district judge Edward Chen of San Francisco for the plaintiffs means that 600,000 Venezuelans whose temporary protections expired in April or whose protections were about to expire on 10 September have status to stay and work in the United States.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef61311d9b24d0c6e8188fcb56ba70dc157195e3",
      "title": "You can trust the jobs report, Labor Department workers urge public",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5530733/bls-jobs-report-labor-statistics-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T19:43:42.000Z",
      "summary_90w": "",
      "raw": "A strongly-worded statement from Bureau of Labor Statistics workers comes a month after President Trump attacked the integrity of the jobs numbers they release monthly.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a15f675293d87d02b0d0eafad506e9a423a5df44",
      "title": "Personalized AI companion app Dot is shutting down",
      "url": "https://techcrunch.com/2025/09/05/personalized-ai-companion-app-dot-is-shutting-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:27:47.000Z",
      "summary_90w": "",
      "raw": "Dot, a personalized AI companion, is shutting down.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d43e495d89e6265b7aa597cb08a59ddbe134fac7",
      "title": "Attorneys general warn OpenAI ‘harm to children will not be tolerated’",
      "url": "https://techcrunch.com/2025/09/05/attorneys-general-warn-openai-harm-to-children-will-not-be-tolerated/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:21:45.000Z",
      "summary_90w": "",
      "raw": "California Attorney General Rob Bonta and Delaware Attorney General Kathy Jennings met with and sent an open letter to OpenAI to express their concerns over the safety of ChatGPT, particularly for children and teens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab43f2749f854c9cb6147eb9e5e83bac30a01186",
      "title": "Google Gemini dubbed ‘high risk’ for kids and teens in new safety assessment",
      "url": "https://techcrunch.com/2025/09/05/google-gemini-dubbed-high-risk-for-kids-and-teens-in-new-safety-assessment/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:09:12.000Z",
      "summary_90w": "",
      "raw": "Google's Gemini comes up short on kids' safety, says Common Sense Media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1dd6e09a0de87a396a8f5161015879791f359f50",
      "title": "Cutting through the equity noise: Don’t miss this powerhouse panel at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/startup-hiring-isnt-just-about-the-pitch-its-about-the-package-pulley-645-ventures-and-epigram-legal-break-it-down-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T18:30:00.000Z",
      "summary_90w": "",
      "raw": "Leaders from Pulley, 645 Ventures, and Epigram Legal join the Builders Stage at TechCrunch Disrupt 2025, happening October 27-29 in San Francisco. Register to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8698efee7b6366b4354843f2b1d30953244ef13",
      "title": "A timeline of the US semiconductor market in 2025",
      "url": "https://techcrunch.com/2025/09/05/a-timeline-of-the-u-s-semiconductor-market-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T18:26:00.000Z",
      "summary_90w": "",
      "raw": "From leadership changes at legacy semiconductor companies to wishy washy policy around chip exports, a lot has happened already.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca83770bea7db1cd518f0fdcda7fd87da8429d57",
      "title": "UK ignored obligation to prevent genocide, witnesses tell Gaza tribunal",
      "url": "https://www.theguardian.com/world/2025/sep/05/uk-ignored-obligation-to-prevent-genocide-witnesses-tell-gaza-tribunal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T18:07:48.000Z",
      "summary_90w": "",
      "raw": "Independent tribunal told government did little to hold Israel to account and aimed to shield itself from scrutiny\nBritain is not just complicit in Israel’s breaches of humanitarian law in Gaza but a participant that has repeatedly ignored its legal obligation to prevent a genocide, witnesses have told the independent Gaza tribunal.\nThe two-day tribunal in London, which is independent of government and parliament, is seeking to amass evidence of Britain’s failure to distance itself from what the tribunal organisers regard as Israeli war crimes amounting to genocide.\nRAF pilots flying from the UK Akrotiri airbase in Cyprus systematically shared intelligence in real time with the Israel Defense Forces (IDF), but not with the international criminal court.\nNo 10 failed to provide the support requested by lawyers acting for James Henderson, the British World Central Kitchen aid worker killed by the IDF on 1 April 2024, leaving them reliant on an IDF internal investigation, with a coroners’ inquiry still as long as two years away.\nBritain provided no support to the chief prosecutor at the international criminal court, Karim Khan, after the US government imposed sanctions that led a British bank to close his account, “so emboldening those who seek to dismantle international accountability”.\nThe UK trade department continued to allow the import of products from Israel-occupied territories after the international court of justice in July 2024 ruled in an advisory opinion that the occupation was unlawful.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b163cba03be477c514c241d0963303189072c087",
      "title": "Roblox announces short-form video feed for gameplay clips, new AI tools for creators, and more",
      "url": "https://techcrunch.com/2025/09/05/roblox-announces-short-form-video-feed-for-gameplay-clips-new-ai-tools-for-creators-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:30:00.000Z",
      "summary_90w": "",
      "raw": "Users can scroll through a feed of gameplay moments shared by the Roblox community and react to the clips using emojis, and they can jump into an experience right from a video.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fafe67d1c238559a3f28c0320cf48f7c80c577b8",
      "title": "Three ways Epstein scandal could go for Trump",
      "url": "https://www.bbc.com/news/articles/c059gmypj4jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T17:27:51.000Z",
      "summary_90w": "",
      "raw": "This week the victims of Epstein's crimes came forward to demand more information, piling pressure on the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2141ca0516074b1169f7531b3a03deabdd76ee76",
      "title": "Trump sends 10 stealth fighter planes to Puerto Rico amid war on Caribbean drug cartels",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/trump-fighter-planes-puerto-rico-venezuela-drug-cartel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T17:11:58.000Z",
      "summary_90w": "",
      "raw": "Move comes after US accuses Venezuela of buzzing warship and a deadly US missile strike in Caribbean Sea\nDonald Trump is sending 10 F-35 fighter jets to Puerto Rico to bolster US military operations against drug cartels in the Caribbean region, it was reported on Friday.\nIf follows a deadly US missile strike on Tuesday on a boat in the Caribbean Sea that the Trump administration insisted was carrying 11 Venezuelan drug traffickers, and comments by the secretary of state, Marco Rubio, on Wednesday that such attacks “will happen again”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "494ed2a119c67ec6821db377e6d05760cc0a7976",
      "title": "Tesla’s ad spend on X has shrunk to almost nothing",
      "url": "https://techcrunch.com/2025/09/05/teslas-ad-spend-on-x-has-shrunk-to-almost-nothing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:00:46.000Z",
      "summary_90w": "",
      "raw": "Tesla spent a fraction on X in early 2025 compared to 2024. It also paid $300,000 to Kimbal Musk's drone company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f700046314679d7e8d3d08b68565cd1e2551341c",
      "title": "Warner Bros. sues Midjourney for AI images of Superman, Batman, and other characters",
      "url": "https://techcrunch.com/2025/09/05/warner-bros-sues-midjourney-for-ai-images-of-superman-batman-and-other-characters/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:56:38.000Z",
      "summary_90w": "",
      "raw": "Warner Bros. says that Midjourney knowingly engaged in wrongful conduct, noting that the company previously restricted subscribers from generating content based on infringing images but recently lifted those protections.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f47cf51ec49080f15aaf9f3e920a4ee733deec97",
      "title": "Natron’s liquidation shows why the US isn’t ready to make its own batteries",
      "url": "https://techcrunch.com/2025/09/05/natrons-liquidation-shows-why-the-us-isnt-ready-to-make-its-own-batteries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:37:48.000Z",
      "summary_90w": "",
      "raw": "The sodium-ion battery startup went from announcing a $1.4 billion factory to filing for liquidation in just over a year. Natron's troubled journey illustrates the challenges in making batteries in the U.S.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6589b86f63f97d2296cea28ce113319a02fee6f0",
      "title": "US imposes sanctions on Palestinians for requesting war crimes inquiry",
      "url": "https://www.theguardian.com/world/2025/sep/04/us-sanctions-palestinian-human-rights",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T16:15:14.000Z",
      "summary_90w": "",
      "raw": "Rights groups in Gaza and Ramallah had asked international criminal court to investigate Israel over genocide claims\nThe US has imposed sanctions against three Palestinian human rights groups that asked the international criminal court (ICC) to investigate Israel over allegations of genocide in Gaza, according to a notice posted to the US treasury department’s website.\nThe three groups – the Gaza-based Palestinian Centre for Human Rights and Al Mezan Center for Human Rights, and the Ramallah-based Al-Haq – were listed under what the treasury department said were ICC-related designations.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77712dc1834f78041cf8c012fe49d03465a117ee",
      "title": "X is now offering me end-to-end encrypted chat — you probably shouldn’t trust it yet",
      "url": "https://techcrunch.com/2025/09/05/x-is-now-offering-me-end-to-end-encrypted-chat-you-probably-shouldnt-trust-it-yet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:04:03.000Z",
      "summary_90w": "",
      "raw": "X's new encrypted messaging feature, XChat, has some red flags.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f275cd7994e3f995e147aadc7fe3d572b839cb61",
      "title": "Scale AI’s former CTO launches AI agent that could solve big data’s biggest problem",
      "url": "https://techcrunch.com/2025/09/05/scale-ais-former-cto-launches-ai-agent-that-could-solve-big-datas-biggest-problem/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Isotopes, co-founded by Arun Murthy, launched a sophisticated analytics agent. Arun was one of the creators of Hadoop who later joined Scale AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35bf2b855838e48b64ea6075760c9c0d0a0ce811",
      "title": "Hundreds of South Koreans are among 475 detained in a Georgia immigration raid",
      "url": "https://www.npr.org/2025/09/05/g-s1-87208/georgia-hyundai-immigration-raid-bryan-county-south-korea-response",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T14:58:37.000Z",
      "summary_90w": "",
      "raw": "\"The business activities of our investors and the rights of our nationals must not be unjustly infringed,\" a foreign ministry spokesman said after about 300 South Koreans were detained.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ad49db7f8332d8ca744433b7d55edfb5a9e2b198",
      "title": "OpenAI hires the team behind Xcode coding assistant Alex",
      "url": "https://techcrunch.com/2025/09/05/openai-hires-the-team-behind-xcode-coding-assistant-alex-codes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:58:32.000Z",
      "summary_90w": "",
      "raw": "The team behind Alex, which built a popular tool that let devs use AI models within Apple's development suite Xcode, is joining OpenAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a30b994ca2023fccde9d0e9102f549054ea40358",
      "title": "Cracks in the U.S. economy: Job growth slows 75% from a year ago",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529937/economy-jobs-trump-bls",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T12:51:43.000Z",
      "summary_90w": "",
      "raw": "The U.S. job market showed more signs of weakness Friday, as the Labor Department reported just 22,000 jobs added in August. Revised figures show the economy lost jobs in June, for the first time since the pandemic winter of 2020.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3c1a1cadea41b9ddfdb82ff53732f95f732f2418",
      "title": "Why the end of the de minimus tariff exemption is causing shipping chaos worldwide",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5518283/why-the-end-of-the-de-minimus-tariff-exemption-is-causing-shipping-chaos-worldwide",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:11:05.000Z",
      "summary_90w": "",
      "raw": "Planet Money looks at what the de minimis tariff exemption is, who wins and loses with the end of this policy and why ending it has resulting in shipping chaos worldwide.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "453a8bf46ea2f979e193f4ef69370999876a955f",
      "title": "Nike's nearly 40-year-old slogan gets an update",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528897/nikes-nearly-40-year-old-slogan-gets-an-update",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:07:52.000Z",
      "summary_90w": "",
      "raw": "NPR's A Martinez speaks with AdWeek's Brittaney Kiefer about Nike's update to their iconic \"Just Do It\" slogan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e0afda5ab1eb8a4cc8fc1993d245bec0de9dc5d8",
      "title": "Have questions about homeownership or renting? NPR wants to know",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529253/homeownership-renting-questions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Your input will help shape a new NPR series on renting, homeownership and everything that comes with it.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}