{
  "version": "1757414340928",
  "generatedAt": "2025-09-09T10:39:00.928Z",
  "items": [
    {
      "id": "1d49310a4774dd07c695df72f51a58c62721c752",
      "title": "Herald Sun failed to seek response from Victorian MP Sam Groth and wife before article that invaded privacy, court documents claim",
      "url": "https://www.theguardian.com/law/2025/sep/09/herald-sun-failed-to-seek-response-from-victorian-mp-sam-groth-and-wife-before-article-that-invaded-privacy-court-documents-claim",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:18:04.000Z",
      "summary_90w": "",
      "raw": "Groth and wife Brittany are suing a News Corp paper for defamation and breach of privacy over incorrect claims of inappropriate relationship\n\nGet our breaking news email, free app or daily news podcast\n\nThe Herald Sun failed to seek a response from Brittany Groth, the wife of Sam Groth, the Victorian Liberals deputy leader and former tennis star, before wrongly outing her as a victim of child sexual assault who was preyed upon by her now-husband when he was her coach, the couple allege in federal court documents.\nThe Herald and Weekly Times, along with reporter Stephen Drill, who wrote the articles, and his editor Sam Weir, are being sued in the federal court by Brittany Groth, in the first test of a new statutory tort for serious invasions of privacy, and by Sam Groth for defamation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37bd6f92fab605d46fd7df9bbc18cce632af8f00",
      "title": "'No one is irreplaceable', says BBC chief after scandals",
      "url": "https://www.bbc.com/news/articles/cj07r78gg32o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:15:37.000Z",
      "summary_90w": "",
      "raw": "Tim Davie tells MPs he is \"not letting anything lie\" when it comes to rooting out abuses of power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c611799b1dd712668936d7ffc4e6d15546ad851e",
      "title": "Postecoglou in line to replace Nuno as Forest boss",
      "url": "https://www.bbc.com/sport/football/articles/cvgq6495gd6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:14:02.000Z",
      "summary_90w": "",
      "raw": "Ange Postecoglou is set to return to the Premier League three months after being sacked by Tottenham Hotspur.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0c422100f50c5b7296cd3a56b2078cb7846e313",
      "title": "Israel’s expanded assault on Gaza City will endanger lives of ‘countless civilians’, charity warns – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:11:51.000Z",
      "summary_90w": "",
      "raw": "Warning from ActionAid comes after Benjamin Netanyahu and the Israeli army told residents of Gaza City to leave \nDan Sabbagh is the Guardian’s defence and security editor\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dcd51a78081f3c802dc52c5154e4807664ccecc3",
      "title": "Bridget Phillipson enters Labour deputy leader contest",
      "url": "https://www.bbc.com/news/articles/c3rvqv9yg4eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:09:04.000Z",
      "summary_90w": "",
      "raw": "The education secretary is the most senior figure to enter the race to replace Angela Rayner so far.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drone, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:08:50.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says a fire was started but Tunisian authorities deny that a drone was involved.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2cbc52a60c278440b9feaacfd22134c511670f48",
      "title": "More than 20 dead in Russian attack on Ukrainian village, Zelensky says",
      "url": "https://www.bbc.com/news/articles/c1jz08j8313o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:05:14.000Z",
      "summary_90w": "",
      "raw": "A Russian air strike on a village in eastern Ukraine's Donetsk region has killed multiple civilians, President Zelensky has said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2373c06639e0b03599f38b0bb9ac165656e75f15",
      "title": "University of Melbourne law professor’s allegedly racist emails were protected ‘political opinion’, court hears",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/university-of-melbourne-law-professor-eric-descheemaeker-emails-were-protected-political-opinion-court-hears-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:02:24.000Z",
      "summary_90w": "",
      "raw": "Lawyer argues university’s move to fire Dr Eric Descheemaeker breached Fair Work Act and freedom of academic expression policy\n\nGet our breaking news email, free app or daily news podcast\n\nA law professor at the centre of a leaked email controversy says the University of Melbourne attempted to expel him over his political expression after it unearthed allegedly racist emails which included references to First Nations people.\nDr Eric Descheemaeker launched legal action against Australia’s top-ranked university over his proposed dismissal earlier this year, alleging he was suspended over his political opinion.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f0fef5926ad08fac48daea9ee918216942349fa",
      "title": "Murdochs reach deal in succession battle over media empire",
      "url": "https://www.bbc.com/news/articles/cn825x71g4do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:01:36.000Z",
      "summary_90w": "",
      "raw": "Lachlan Murdoch will retain control of the conservative Fox and News Corp empire under the deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3dae5db8ecaa3c4d1cf2664358ae0f482b04fc10",
      "title": "Who could replace Angela Rayner as Labour deputy leader?",
      "url": "https://www.bbc.com/news/articles/c8jm9lk19v3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:58:13.000Z",
      "summary_90w": "",
      "raw": "The winning candidate - voted for by Labour members - will be announced on 25 October.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11a159ea9a960c4ea6fc5d367f97b7a4773cc061",
      "title": "Right-leaning MPs rally around Nampijinpa Price as she resists calls to apologise to Indian Australians",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/jacinta-nampijinpa-price-immigration-comments-calls-for-apology-coalition-liberals-nations-reactions",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T09:54:06.000Z",
      "summary_90w": "",
      "raw": "But Liberals say party has ‘degenerated into open warfare’ over the issue and accuse NT senator of pushing her own agenda\n\nGet our breaking news email, free app or daily news podcast\n\nProminent conservatives are rallying around Jacinta Nampijinpa Price as she faces mounting internal and external pressure to apologise for comments about Indian migrants.\nThe Victorian Liberal senator Sarah Henderson, the Nationals senator Matt Canavan and Victorian state Liberal MP Moira Deeming have all issued public statements of support for Price, further exposing divisions inside the Coalition as the saga continues.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32db2407a94e414f83c0b83b96fc7c1cdc34389d",
      "title": "US lawmakers release Epstein 'birthday book' with alleged Trump note ",
      "url": "https://www.bbc.com/news/articles/cvgqnn4ngvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:51:45.000Z",
      "summary_90w": "",
      "raw": "The White House says the president did not draw the picture or sign the note, after it was published on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a886c17daaacd2076b3d1bab252074e492fd5504",
      "title": "Genki will pay Nintendo damages over 3D-printed Switch 2",
      "url": "https://www.theverge.com/news/774236/nintendo-switch-2-genki-lawsuit-settlement",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T09:50:10.000Z",
      "summary_90w": "",
      "raw": "The 3D-printed Switch 2 mockup that started Nintendo’s dispute with Genki.\t\n\nNintendo has settled the lawsuit it filed against accessory maker Genki over the Switch 2 mockup it showcased at CES before the console was officially revealed, and accessories it promoted using the Switch 2 name. Genki’s parent company, Human Things, will pay Nintendo an undisclosed amount of money in damages to close the case, according to a legal filing submitted on Monday, and has agreed to stop giving its products names that are “confusingly similar” to official Nintendo intellectual property.\nThe dispute began in January after Genki showed off an accurate 3D-printed Switch 2 mockup at CES, even including the console’s logo, days before it was officially launched by Nintendo. The company also began to promote its range of Switch 2 accessories before the console was announced. \nNintendo later filed a complaint against the accessory maker in May over alleged “trademark infringement, unfair competition, and false advertising.” Nintendo said it didn’t provide Genki with technical Switch 2 specifications, and alleged that Genki either “unlawfully or illicitly obtained an authentic Nintendo Switch 2” prior to the console’s public release, or “cannot claim compatibility with enough certainty to make its advertising claims in good faith.”\nThe financial terms of the settlement haven’t been disclosed. According to the settlement filing, Genki attests that it “did not obtain access to” a Switch 2 before the console’s launch announcement, and the origins of the 3D-printed dummy unit remain unclear.\nIn the original lawsuit filing, Nintendo said that Genki had also infringed its trademark by marketing third-party accessories and services using language that alluded to Nintendo’s IP, such as “Genki Direct,” and “Genki Glitch 2.” Nintendo accused Genki of “taking advantage of the trust and loyalty that Nintendo fans have for the Nintendo brand and mark and causing actionable harm.”\nGenki is still permitted to reference Nintendo branding in its own products in a “nominative fair use manner” under the new settlement agreement, but only when the company is making verified compatibility claims or to clarify its affiliation with Nintendo products as a third-party accessory producer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9378e09d87d3a68b88f425c5d0382e5eee98f44a",
      "title": "At least 10 dead after train crashes into bus in Mexico",
      "url": "https://www.bbc.com/news/articles/c98elewrepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T09:40:09.000Z",
      "summary_90w": "",
      "raw": "An investigation is under way after a freight train hit a bus as it tried to cross railway tracks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31bd01bf9c60501d44aa088c1b19295afecb7b55",
      "title": "François Bayrou to resign as French PM as government collapses to spark crisis – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T09:33:46.000Z",
      "summary_90w": "",
      "raw": "Government collapses after Emmanuel Macron’s ally wins support of just 194 MPs with 364 against \nMore than 20 people were killed in an overnight Russian attack on Yarova in the Donetsk region, Ukrainian president Volodymyr Zelenskyy has just said in a social media post.\nHe called it “a brutally savage Russian airstrike,” stressing it hit “directly on people, ordinary civilians” when they were handed out pension payments.\nThere are no words. Such Russian strikes must not be left without an appropriate response from the world.\n“The world must not remain silent. The world must not remain idle. A response is needed from the United States. A response is needed from Europe. A response is needed from the G20. \nStrong actions are needed to make Russia stop bringing death.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80cacd185f401482f16a89cf540cc816cf4c055e",
      "title": "Best and worst-performing NHS hospital trusts in England named",
      "url": "https://www.bbc.com/news/articles/cq8eqxlypv7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:31:06.000Z",
      "summary_90w": "",
      "raw": "The new league tables score trusts on measures including finances and patient access to care.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af81d44c95ff1475f15e18a972de2243acb7b6ad",
      "title": "How did Verstappen know about  Norris' slow stop in Italy? - F1 Q&A",
      "url": "https://www.bbc.com/sport/formula1/articles/cm2dz8pdpmjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:13:19.000Z",
      "summary_90w": "",
      "raw": "BBC Sport F1 correspondent Andrew Benson answers your latest questions after the Italian Grand Prix at Monza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:06:36.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e00c3ad0cd32fdd94a1bab9b57be77b81c34ad5",
      "title": "Flotilla boat carrying aid to Gaza struck by flaming object, video shows",
      "url": "https://www.theguardian.com/world/2025/sep/09/flotilla-carrying-aid-to-gaza-struck-by-flaming-object-video-shows-sidi-bou-said-port-tunisia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T09:05:54.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says one of its vessels was hit by drone at Sidi Bou Said port in Tunisia, sustaining fire damage\n\nIsrael issues large-scale evacuation order for Gaza City ahead of expanded offensive – Middle East crisis live\n\nA flotilla carrying aid for Gaza and pro-Palestinian activists has published a video showing one of its boats being struck by a flaming object at Sidi Bou Said port in Tunisia.\nThe Global Sumud Flotilla (GSF) said the boat had been hit by a drone and that it sustained fire damage to its main deck and below-deck storage, though all six passengers and crew were safe.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "883f4a246f561302b52cd8c0affb12da42603567",
      "title": "A new Nation's Report Card shows drops in science, math and reading scores",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5526918/nations-report-card-scores-reading-math-science-education-cuts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "It's the first Nation's Report Card since the Trump administration began making cuts to the U.S. Education Department. The scores reflect the state of student achievement in early 2024.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "162eb2b9071ee33cfd104f166bed1ac3bfedcc19",
      "title": "Here they are: The best student podcasts in America",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527245/npr-best-student-podcast-finalists-announced",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For the 2025 NPR Student Podcast Challenge, we've listened to nearly 2,000 entries from around the U.S., and narrowed them down to 11 middle school and 10 high school finalists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4b6d0cfc3efd3305fc212dd0f8fd6bb97946c69",
      "title": "The 2025 Student Podcast Challenge Honorable Mentions",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5530068/npr-student-podcast-honorable-mentions",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Here are the honorable mentions from this year's Student Podcast Challenge, chosen from nearly 2,000 entries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd7c758a34583ff078b17c7753f87703239c97ee",
      "title": "Trump's Medicaid cuts will hurt children's hospitals",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/09/nx-s1-5532133/medicaid-children-hospital-closure",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The GOP said its overhaul of Medicaid was aimed at reducing fraud and getting more adult beneficiaries to work. Among the likely side effects: fewer services and doctors for treating sick children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5f97dd2e487c016eef9e865492ffb4c3218e659",
      "title": "Xbox is coming to cars thanks to an LG and Microsoft partnership",
      "url": "https://www.theverge.com/news/774177/microsoft-xbox-car-lg-partnership-cloud-streaming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Microsoft and LG are partnering up to bring Xbox Cloud Gaming to internet-connected vehicles. A new Xbox app will soon be available on cars that use LG’s Automotive Content Platform (ACP), allowing Xbox Game Pass Ultimate subscribers to access cloud versions of Xbox titles directly on in-car screens.\nThe Xbox app will be able to stream games when you’re charging an EV or trying to entertain passengers on a road trip. LG’s ACP is already available on Kia’s EV3 in Europe, and is also coming to the EV4, EV5, and new Sportage. ACP runs LG’s webOS platform, the same software that powers its smart TVs, and provides access to a variety of content like Netflix, Disney Plus, YouTube, and more.\nMicrosoft already partnered with LG to bring its Xbox app to smart TVs earlier this year, and the extension to compatible cars comes as the software maker gets ready to expand Xbox Cloud Gaming to Game Pass Core and Standard subscribers. “Our work with LG is the latest example of Xbox expanding to new places, building on partnerships that already bring Xbox Cloud Gaming to mobile devices, PCs, and TVs,” says Christopher Lee, vice president of Xbox marketing. “By adding vehicles to the mix, we’re giving players more choice than ever in how they enjoy their games.”\nSpeaking of cars, Microsoft also announced overnight that it’s returning to the Tokyo Game Show later this month. An Xbox stream will be held on September 25th at 3AM PT / 6AM ET / 11AM UK, where Forza Horizon 6 is widely expected to be announced. The Xbox teaser for the Tokyo Game Show includes an urban neon aesthetic street scene that looks like it would be ideal for a new Forza game set in Japan.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89fc1f60cd9aa607aa391d407e572b9d8ee0e149",
      "title": "Australian ‘terrified for my life’ after apparent drone strike on vessel – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T08:59:24.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nBrittany Higgins ordered to pay 80% of Linda Reynolds’ legal costs after defamation ruling\n\nGet our breaking news email, free app or daily news podcast\n\nInman Grant said big tech is not stopping online sharing of child abuse images\nInman Grant said last night none of the big technology companies are doing enough to stop images of “the most heinous abuse to children” from being shared online.\nThey use anthropomorphism to mimic real human conversation, and they also use a bit of sycophancy to reinforce all your beliefs and to keep you chatting. And the problem with children who don’t have the cognitive ability to really ascertain what is real and what is not, in terms of a relationship with a human versus a computer program, this has led to some tragic outcomes.\nWe need guardrails and we don’t need a body count or ruined or lost lives like we’ve seen in the US here in Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a29f9f0508c07958be555bbf91fd9ef2f54ef96c",
      "title": "France to get third PM in a year as Bayrou to resign after confidence vote",
      "url": "https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T08:50:57.000Z",
      "summary_90w": "",
      "raw": "Prime minister to hand in resignation after thousands of protesters gather to celebrate ousting and plan day of action\n\nBayrou to resign – latest updates\n\nThe French prime minister, François Bayrou, will hand in his resignation on Tuesday after losing a confidence vote that has plunged France into government collapse and political crisis.\nEmmanuel Macron has said he will appoint a new prime minister in the coming days, who would then have to form a new government. This will be the third French prime minister in a year, whose first task will be the major challenge of agreeing a budget among a divided parliament.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7bf31c7ec6f7d3a6c606878a6c354828ed5298d3",
      "title": "Windows 11 SSD issues blamed on reviewers using &#8216;early versions of firmware&#8217;",
      "url": "https://www.theverge.com/report/774201/phison-windows-11-ssd-issues-early-firmware",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T08:27:59.000Z",
      "summary_90w": "",
      "raw": "Reports have been circulating for the past few weeks that recent Windows 11 updates (KB5063878 and KB5062660) were causing some SSDs using Phison controllers to fail. While plenty of YouTube and TikTok videos have blamed Microsoft for the issues, Phison has identified “early versions of firmware and BIOS” as the problem instead.\n“Many of the reports originate from media testing conducted on hardware running early versions of firmware and BIOS,” says Michael Wu, GM and President of Phison US, in a statement to The Verge. “These versions are performance preview drives and are not identical to those provided to end users through official distribution channels. We have observed that outdated firmware is still being used on some SSDs and we encourage any reviewers facing this to leverage updated channel firmware readily available through manufacturer-provided update utilities.”\nYouTuber JayzTwoCents claimed last week that the “Windows update and SSD problem is WAY worse than we thought!” JayzTwoCents showed a Crucial T500 drive (with a Phison E25 controller) failing after Microsoft’s latest Windows 11 security updates, and needing a power cycle to come back to life. It’s not clear whether JayzTwoCents was using pre-release SSD firmware, or even an early motherboard BIOS.\nPhison was able to replicate issues reported by the PCDIY! community though, and found that these were down to engineering preview firmware. “Phison examined the exact SSDs used in the PCDIY! testing and determined PCDIY! was utilizing an engineering preview firmware, which is not the final firmware used in the Corsair Force Series MP600 SSD 2TB and other drives with the E16 controller available for sale to consumers on the market,” explains Wu. Phison also performed the same tests on consumer SSDs and found no crashes or failures.\nMicrosoft said late last month that it had “found no connection” between its security updates and the drive failures reported on social media and elsewhere. That didn’t stop many people, including prominent YouTubers, from blaming Microsoft for the SSD issues. That’s hardly surprising though, given Microsoft’s history of chaotic Windows updates.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae8f1f3e1ad55d0ccc804156b3d7bee3b224f66a",
      "title": "Minns may have ‘misspoken’ when stating Labor voted to send Shooters’ ‘right to hunt’ bill to parliamentary inquiry",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/chris-minns-voted-against-committee-examining-nsw-shooters-fishers-right-hunt-bill-opposition-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T08:08:40.000Z",
      "summary_90w": "",
      "raw": "Premier claims Labor supported referral of conservation hunting bill to committee but Hansard shows NSW government opposed move\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe New South Wales premier, Chris Minns, has continued to walk away from a controversial bill from the Shooters and Fishers party establishing a right to hunt on public lands, while also claiming that Labor backed it being sent to a parliamentary committee.\nOn Tuesday, Minns claimed Labor had supported the referral of the conservation hunting bill for an inquiry and indicated he would look at the committee’s report, but Hansard showed Labor opposed the referral.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4752403567d76fb63ddb3f4f659a5fb16e8aa3b9",
      "title": "It’s time to change your Plex password again",
      "url": "https://www.theverge.com/news/774188/plex-breach-change-password-email",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T07:44:04.000Z",
      "summary_90w": "",
      "raw": "The Plex media streaming platform has been breached in what looks to be a repeat of a 2022 incident that saw authentication data and encrypted passwords compromised. The company is urging users to change their password, enable two-factor authentication, and sign out of any connected devices that might already be logged in.\nIn an email sent to users titled “Action required: Notice of a potential security incident,” Plex says a database was accessed by “an unauthorized third party” exposing emails, usernames, and hashed passwords for a “limited subset” of customers. Because the passwords were securely hashed, they can’t be easily read by the attacker, but Plex urges users to change them anyway. Plex says credit card data wasn’t exposed because it’s not stored on its servers.\nHere’s the full email sent to Plex users this morning:\n\nDear Plex User,\nWe have recently experienced a security incident that may potentially involve your Plex account information. We believe the actual impact of this incident is limited; however, action is required from you to ensure your account remains secure. \nWhat happened \nAn unauthorized third party accessed a limited subset of customer data from one of our databases. While we quickly contained the incident, information that was accessed included emails, usernames, and securely hashed passwords. \nAny account passwords that may have been accessed were securely hashed, in accordance with best practices, meaning they cannot be read by a third party. Out of an abundance of caution, we recommend you immediately reset your password by visiting https://plex.tv/reset. Rest assured that we do not store credit card data on our servers, so this information was not compromised in this incident. \nWhat we’re doing \nWe’ve already addressed the method that this third party used to gain access to the system, and we’re undergoing additional reviews to ensure that the security of all of our systems is further hardened to prevent future attacks. \nWhat you must do \nWe kindly request that you reset your Plex account password immediately by visiting https://plex.tv/reset. When doing so, there’s a checkbox to “Sign out connected devices after password change,” which we recommend you enable. This will sign you out of all your devices (including any Plex Media Server you own) for your security, and you will then need to sign back in with your new password. We understand that this means a little more work for you, but it will provide additional security to your account. \nAdditional Security Measures You Can Take \nWe remind you that no one at Plex will ever reach out to you over email to ask for a password or credit card number for payments. For further account protection, we also recommend enabling two-factor authentication on your Plex account if you haven’t already done so. \nLastly, we sincerely apologize for any inconvenience this situation may cause you. We take pride in our security systems, which helped us quickly detect this incident, and we want to assure you that we are working swiftly to prevent potential future incidents from occurring. \nFor step-by-step instructions on how to reset your password, visit:https://support.plex.tv/articles/account-requires-password-reset \nThank you, \nThe Plex Team",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4908a9e47356afa8eac588b20a065e2900a7b343",
      "title": "Norway's left clinches vote win as populist right surges into second place",
      "url": "https://www.bbc.com/news/articles/cq65255l27qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T07:38:58.000Z",
      "summary_90w": "",
      "raw": "Labour has a chance of forming a narrow majority if it secures the support of four smaller parties on the centre left.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b6c653830a09a7b83e60d235b433366ef9d4cb9",
      "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
      "url": "https://www.bbc.com/news/articles/cr4qx6377qgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T07:29:19.000Z",
      "summary_90w": "",
      "raw": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8d88eadd40bf7553df55ac7237b44d4b8733ff7",
      "title": "Thai court rules ex-PM Thaksin must serve one year in jail",
      "url": "https://www.bbc.com/news/articles/cly7k2g37g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:41:09.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court ruling is yet another blow to the influential Shinawatra political dynasty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2670574a8272c6c3c057ad7a3550b5a737ca7ad2",
      "title": "Mystery donor offers £100k to find student who went missing after house party",
      "url": "https://www.bbc.com/news/articles/c04qpd7y9k0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T06:26:49.000Z",
      "summary_90w": "",
      "raw": "Mother of Jack O’Sullivan, who disappeared in Bristol in March 2024, says she is \"overcome\" by the offer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "138bbea6584119294ae82cd03d321ce40baab925",
      "title": "Drama to come but Scotland World Cup tale has momentum",
      "url": "https://www.bbc.com/sport/football/articles/cn83g9pv3l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T06:26:32.000Z",
      "summary_90w": "",
      "raw": "BBC Scotland's chief sportswriter Tom English sets the scene for a colossal October for the Scotland national team.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9448aa73221d75321a7cae4cc340fbb464b4943",
      "title": "NZ 'suitcase murder': Anti-depressants found in children's bodies",
      "url": "https://www.bbc.com/news/articles/c1wgqpx3q1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:07:00.000Z",
      "summary_90w": "",
      "raw": "A jury heard Hakyung Lee killed her children in an attempted mass suicide after her husband's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a91ffb88860b2e5501809d16529913f88990ffa",
      "title": "OpenAI denies that it’s weighing a ‘last-ditch’ California exit amid regulatory pressure over its restructuring",
      "url": "https://techcrunch.com/2025/09/08/openai-denies-that-its-weighing-a-last-ditch-california-exit-amid-regulatory-pressure-over-its-restructuring/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T06:00:44.000Z",
      "summary_90w": "",
      "raw": "OpenAI executives are discussing a potential relocation out of California as increasing political resistance threatens the company's efforts to convert from nonprofit to for-profit status, according to The WSJ, but the company says it has no plans to leave.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5d4822128c386a9f0c7261f8ddcc47754d22fe9",
      "title": "'Tuchel's blueprint faces sternest test in Serbia'",
      "url": "https://www.bbc.com/sport/football/articles/c864wqezwgeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T05:17:26.000Z",
      "summary_90w": "",
      "raw": "Thomas Tuchel will face his toughest test as England coach against Serbia in the intimidating surroundings of Belgrade, says chief football writer Phil McNulty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "395a71d5756b62daffaf2437379978028d58fa54",
      "title": "Nepal's prime minister resigns following violent protests against social media ban",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5534953/nepal-social-media-ban-protests",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T05:15:16.000Z",
      "summary_90w": "",
      "raw": "Nepal's prime minister resigned Tuesday following violent protests against a ban on social media platforms and government corruption.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8b037c914d28c3309adcc2e0ab496280dae9501",
      "title": "Thailand's former PM Thaksin Shinawatra to serve one-year prison term",
      "url": "https://www.npr.org/2025/09/09/g-s1-87726/thailands-former-pm-to-serve-one-year-prison-term",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T05:11:37.000Z",
      "summary_90w": "",
      "raw": "Thailand's Supreme Court said former Prime Minister Thaksin Shinawatra must serve a one-year prison term for previous convictions on graft and abuse of power charges.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53f7cf59560f7117b1eaaa939e955ca17f5be1ee",
      "title": "'I'm angry. It's not right' - locals want asylum hotels shut, but are shared houses the answer?",
      "url": "https://www.bbc.com/news/articles/c07vn1y2jz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T05:05:09.000Z",
      "summary_90w": "",
      "raw": "The BBC's UK editor, Ed Thomas, meets local people and asylum seekers in two towns in north-west England.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3ad59564cda6227ea2788286b393cbd8eb1579d",
      "title": "Mandelson called Epstein 'best pal' in birthday message",
      "url": "https://www.bbc.com/news/articles/cwy9dwe50leo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:51:24.000Z",
      "summary_90w": "",
      "raw": "The description is contained an alleged 50th \"birthday book\" given to the disgraced financier that has been released by US lawmakers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2490d90ed4ec14bc10563301cb4cba1d28932c4",
      "title": "First photos of site where New Zealand bushman hid children released",
      "url": "https://www.bbc.com/news/articles/cj4y9ev2rw4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:32:15.000Z",
      "summary_90w": "",
      "raw": "Police also found a stash of firearms and ammunition at the campsite surrounded by dense vegetation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2490d90ed4ec14bc10563301cb4cba1d28932c4",
      "title": "First photos of site where NZ bushman hid children released",
      "url": "https://www.bbc.com/news/articles/cj4y9ev2rw4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T04:32:15.000Z",
      "summary_90w": "",
      "raw": "Police also found a stash of firearms and ammunition at the campsite surrounded by dense vegetation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:30:18.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56bb7bae5d6fad8a89cc779a183e2d37e0cfa7c1",
      "title": "Images of Tom Phillips’ remote campsite revealed a day after fugitive father shot dead by New Zealand police",
      "url": "https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:06:31.000Z",
      "summary_90w": "",
      "raw": "After four years on the run with their father, Phillips’ three children have all been located and are ‘doing well under the circumstances’, say authorities\nPolice in New Zealand have released images and given details of the campsite where two of fugitive Tom Phillips’ children were found, after their father was shot and killed by police on Monday.\nPhillips had spent nearly four years hiding in the wilderness with his children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio. A police officer is recovering in hospital after being shot in the head by Phillips with a high-powered rifle in the standoff. About 11 hours after Phillips was killed, two of his children were found safe and well at the campsite in Waitomo. It is understood the third child was with Phillips at the time of the shooting.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "New Epstein files and 'birthday book': What we know",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T04:05:46.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What we know about new Epstein files and 'birthday book'",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:05:46.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23e35f7db1c283818bc5dea8bc387c31b4b3f939",
      "title": "Majority in EU’s biggest states believes bloc ‘sold out’ in US tariff deal, poll finds",
      "url": "https://www.theguardian.com/world/2025/sep/09/majority-in-eu-biggest-states-believes-bloc-sold-out-in-us-tariff-deal-poll-donald-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:00:04.000Z",
      "summary_90w": "",
      "raw": "Average of 77% of respondents across five countries thought agreement would benefit US economy above all\n\nWhere there’s a will there’s a whey: cheese producers lean into their craft as Trump tariffs bite\n\nA majority of people across the EU’s five biggest member states believe the European Commission sold citizens out when negotiating a “humiliating” tariff deal with Donald Trump that “benefits the US” far more than Europe, a survey has shown.\nThe poll, by Cluster17 for the European affairs debate platform Le Grand Continent, found 77% of respondents – ranging from 89% in France to 50% in Poland – thought the deal would benefit above all the US economy, with only 2% believing it would benefit Europe’s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b703755c4b7eabbcee3cd4468ade009c75fa330",
      "title": "ReOrbit lands record funding to take on Musk’s Starlink from Europe",
      "url": "https://techcrunch.com/2025/09/08/reorbit-lands-record-funding-to-take-on-musks-starlink-from-europe/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T04:00:00.000Z",
      "summary_90w": "",
      "raw": "Finnish startup ReOrbit, has raised a record €45 million Series A for the country to offer \"sovereign\" satellites.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e885b26374e2e1a7c2df2a7662a3102da62977e",
      "title": "Children's TV favourite Bagpuss to reawaken for new film",
      "url": "https://www.bbc.com/news/articles/crrjwlvxknko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T03:49:19.000Z",
      "summary_90w": "",
      "raw": "It will be the first new official Bagpuss production since the original beloved 1974 series.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9c3a0236f927641e6db05e0406c38080ddf720b",
      "title": "Nepal reverses social media ban as protests turn deadly",
      "url": "https://techcrunch.com/2025/09/08/nepal-reverses-social-media-ban-as-protests-turn-deadly/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T02:46:32.000Z",
      "summary_90w": "",
      "raw": "Nepal has reversed its social media ban following nationwide “Gen Z” protests and public backlash.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "147c78ae34acd5af2cea59dec8203925f78475c2",
      "title": "Snap breaks into ‘startup squads’ as ad revenue stalls",
      "url": "https://techcrunch.com/2025/09/08/snap-breaks-into-startup-squads-as-ad-revenue-stalls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T01:41:29.000Z",
      "summary_90w": "",
      "raw": "CEO Evan Spiegel just announced the company is restructuring around small \"startup squads\" of 10 to 15 people to regain agility against larger competitors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e419c27835ff71dba478ad124f9f55059b51218",
      "title": "Anastacia: Arnold Schwarzenegger made me sing Whatta Man 12 times",
      "url": "https://www.bbc.com/news/articles/cm2zmd2rmnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T00:34:21.000Z",
      "summary_90w": "",
      "raw": "As she celebrates 25 years in music, Anastacia reflects on the gigs she played on her way to the top.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0dffce270dbc86a66c22968bc705c0d208fbfc4a",
      "title": "Ofsted to bring in 'report card' school inspections despite criticism",
      "url": "https://www.bbc.com/news/articles/cx2jnlj3e0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T00:30:04.000Z",
      "summary_90w": "",
      "raw": "A new monitoring system will also be introduced, so schools can improve negative grades more quickly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "155df79d28b8da08f017e8949ccab6e6f964e23a",
      "title": "Intel’s chief executive of products departs among other leadership changes",
      "url": "https://techcrunch.com/2025/09/08/intels-chief-executive-of-products-departs-among-other-leadership-changes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T23:22:13.000Z",
      "summary_90w": "",
      "raw": "Intel also announced the creation of a central engineering group that will build custom chips for outside customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dad9f01618b92a57c52e7f941196857ab1b7f5f4",
      "title": "Vapes causing chaos for recycling industry despite ban, warns waste firm boss",
      "url": "https://www.bbc.com/news/articles/c5y8563rjkdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T23:06:13.000Z",
      "summary_90w": "",
      "raw": "Millions of vapes are being thrown away incorrectly despite the ban, causing chaos, says Biffa manager.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "799f90d88d736597fd15a6f56375e5f9adac8607",
      "title": "Why monsoon rains have been so deadly in India this year",
      "url": "https://www.bbc.com/news/articles/c9wdr08wq2zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T23:02:59.000Z",
      "summary_90w": "",
      "raw": "Rains have caused landslides and severe floods in parts of the country and killed hundreds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b45f71bd0d4434e329f1a7582f49345f5ea27376",
      "title": "Netskope follows Rubrik as a rare cybersecurity IPO, both backed by Lightspeed",
      "url": "https://techcrunch.com/2025/09/08/netskope-follows-rubrik-as-a-rare-cybersecurity-ipo-both-backed-lightspeed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T22:35:58.000Z",
      "summary_90w": "",
      "raw": "The 13-year-old company could be valued up to $6.5, with Lightspeed's stake worth $1.1 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e7bdd6eaed851d83fad68838ffde10c22f82194",
      "title": "Sam Altman says that bots are making social media feel ‘fake’ ",
      "url": "https://techcrunch.com/2025/09/08/sam-altman-says-that-bots-are-making-social-media-feel-fake/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T22:24:42.000Z",
      "summary_90w": "",
      "raw": "After watching Reddit's OpenAI and Anthropic communities, Sam Altman thinks social media cannot be trusted. And bots are to blame.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "768a99f32c2e96d24ab1cbd17c348c89f1f24e96",
      "title": "He's accused of trying to assassinate Trump. At trial, he's going it alone",
      "url": "https://www.bbc.com/news/articles/ckgz1m43rrko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T22:20:42.000Z",
      "summary_90w": "",
      "raw": "The 59-year-old, charged with attempting to assassinate President Trump last September, is representing himself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe8f38ed000fed07ff97f4ba658e760d4ff83e71",
      "title": "AMD&#8217;s AI-powered FSR 4 upscaling is now available in most FSR 3.1 games",
      "url": "https://www.theverge.com/news/774142/amd-fsr-4-3-1-games-support-upscaling",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T22:10:10.000Z",
      "summary_90w": "",
      "raw": "AMD’s FSR 4 AI upscaling and frame-generation technology can now be enabled for “most games that support FSR 3.1 with DirectX 12,” the company says in the patch notes for its newest 25.9.1 driver.  This support has been a big promise from AMD, but it’s taken awhile to come to fruition; FSR 4 first launched alongside the company’s RX 9000-series graphics cards back in March.\nAMD touts FSR 4, its competitor to Nvidia’s DLSS 4, as a “significant leap forward” over FSR 3. “By utilizing ML algorithms, FSR 4 can intelligently predict and compensate for lost pixels during low-resolution rendering, thereby providing gamers with high performance and crisp, high-definition visuals that are just as good as native,” AMD says.\nThe new driver brings official FSR 4 support to cover more than 85 titles. But for FSR 3.1 games, you can force FSR 4 by flipping a toggle in the AMD Software: Adrenalin Edition app. “This last step allows the driver to override the FSR 3.1 game implementation with the latest version of FSR 4,” according to AMD. \nFSR 4 support has slowly been trickling out to games since its release, including being added to titles like Cyberpunk 2077, Ghost of Tsushima, and F1 25.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "09724871117da7d410f0dcdf709e3e32ed2b89fa",
      "title": "Japan is set to choose its fourth PM in five years - who could be next?",
      "url": "https://www.bbc.com/news/articles/c62l9488ljlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T22:00:24.000Z",
      "summary_90w": "",
      "raw": "Japan's next leader will face the challenge of steering a much weakened government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ff7d0ae6b0ad92379a6a92fb68a56e144619179",
      "title": "Graham Linehan: I don't regret my online posts",
      "url": "https://www.bbc.com/news/articles/c7v13v3z6lgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T21:50:24.000Z",
      "summary_90w": "",
      "raw": "The Father Ted writer tells the BBC he stands by his online posts which led to his arrest last week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9026360bcc7e6ed920a98c5f98da5555c22cc956",
      "title": "Norway’s Labour party wins election after seeing off populist surge",
      "url": "https://www.theguardian.com/world/2025/sep/08/norways-labour-party-holds-narrow-lead-in-early-election-results",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T21:48:16.000Z",
      "summary_90w": "",
      "raw": "Success for party of the prime minister, Jonas Gahr Støre, despite increased support for rightwing Progress party\nThe Norwegian Labour party has secured four more years in government after seeing off a surge of support for the populist right in a polarised election.\nSoon after the polls closed, the centre left was projected to win with 89 seats with the centre right taking 80 seats. A minimum of 85 seats are needed for a majority.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6dade64ae52995623a9e2f23eec4082f04e47baa",
      "title": "Supreme Court lifts limits on  LA immigration raids",
      "url": "https://www.bbc.com/news/articles/c784697j2v8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T21:41:45.000Z",
      "summary_90w": "",
      "raw": "US top court says that immigration agents can stop people based solely on their race, language or job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95a50153abf8b0ac3df293af86ce89ad59087ab5",
      "title": "Palestinian gunmen kill 6 in Jerusalem as U.S. offers new Gaza ceasefire proposal",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534144/israel-steps-up-attack-on-gaza-as-u-s-offers-new-ceasefire-proposal",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T21:34:41.000Z",
      "summary_90w": "",
      "raw": "Hamas praised a Palestinian shooting attack that killed six Israelis at a bus stop in Jerusalem. The U.S. presented a new truce proposal and Israel stepped up Gaza City attacks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "037cd0660deb40cdd9bb97578e015deb4e94f2f0",
      "title": "Estate of Jeffrey Epstein gives Congress 'birthday book' allegedly signed by Trump",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534397/trump-epstein-birthday-book",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T21:14:23.000Z",
      "summary_90w": "",
      "raw": "Democrats on the House Oversight Committee said the book included a tawdry drawing and note that appeared to include President Trump's signature. Trump had previously denied its existence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd7e90fb966332f5f805b60b07148863dc561793",
      "title": "As it happened: result of Norwegian election ‘very close’ but centre-left in lead – expert",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T21:00:40.000Z",
      "summary_90w": "",
      "raw": "Latest projection gives leftwing bloc 91 seats in the next parliament, with the rightwing bloc at 78 \nAnd over in Brussels, EU diplomats have been briefing journalists that the European Commission is expected to propose a 19th package of sanctions against Russia by Friday, Reuters said.\nThe EU has stepped up its listings and is no longer shying away from larger entities in third countries, and it could list banks in two central Asian countries too, they said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ceff3cc8f6360b776653f0f450689d927e46999",
      "title": "DHS launches immigration crackdowns in Chicago, Boston",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534338/ice-chicago-boston-immigration-raids",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T20:57:39.000Z",
      "summary_90w": "",
      "raw": "These announcements by DHS are just the latest escalation of federal action in U.S. cities including Los Angeles and Washington, D.C. — all led by Democrats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92de93c0f4ad99d988b8d3127539d3c4aabf23fd",
      "title": "Nintendo Switch modder ordered to pay $2 million in piracy lawsuit",
      "url": "https://www.theverge.com/news/774077/nintendo-switch-modder-ryan-daley-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T20:40:51.000Z",
      "summary_90w": "",
      "raw": "Nintendo has notched another victory in its crusade against piracy. Last week, a Washington District Court judge ordered Ryan Daley to pay Nintendo $2 million and stop selling modded Switch consoles online, as reported earlier by Engadget.\nIn a copyright lawsuit filed last year, Nintendo accused Daley of operating the website Modded Hardware, which sold modded Switch consoles, modchips used to hack into Switch devices, and Mig flash cartridges that allow people to play pirated copies of games.\nNintendo claimed Daley caused the company “significant and irreparable harm” — and the judge agreed. “The MIG Devices, Mod Chips, Hacked Consoles, and Circumvention Services allow members of the public to create, distribute, and play pirated Nintendo games on a massive scale,” the ruling states. Daley denied any wrongdoing.\nPiracy lawsuits from Nintendo have become increasingly common, with the company winning its case against a file-sharing site accused of hosting pirated games earlier this year. Nintendo’s legal actions have led to the shutdown of Switch emulators, including Yuzu and Ryujinx. The company has also made it clear that it may brick Switch 2 consoles if players try to mod the device.\nDaley, who chose to fight Nintendo without a lawyer, is now banned from modding Switch consoles, as well as from using devices designed to circumvent the console’s security measures. The judge also ordered the seizure, impoundment, or destruction of all devices owned by Daley that may contain copyright-infringing material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "183b8505fd7b8d0ed2a61c100453fb49e988cfde",
      "title": "Nuclear startup Deep Fission goes public in a curious SPAC",
      "url": "https://techcrunch.com/2025/09/08/nuclear-startup-deep-fission-goes-public-in-a-curious-spac/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T20:08:40.000Z",
      "summary_90w": "",
      "raw": "Deep Fission had been seeking to raise $15 million in a seed round as recently as April. The reverse merger will raise twice that amount.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a9f0d6bdc396603d6d7290b6a9cfa4832fc35e9",
      "title": "‘Leave now,’ Netanyahu tells Gaza City residents as he says Israeli forces readying for ground ‘manoeuvre’ – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T19:59:57.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. You can read our latest reporting here:\n\nPalestinian gunmen kill six people at Jerusalem bus stop\n\n\nSam Jones is Madrid correspondent for the Guardian\nSpain’s prime minister, Pedro Sánchez, has stepped up his scathing criticism of Israel’s actions in Gaza, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4e59ecbb09ee262d68d28ba9381e230caf448a2",
      "title": "Bluesky adds private bookmarks",
      "url": "https://techcrunch.com/2025/09/08/bluesky-adds-private-bookmarks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:40:51.000Z",
      "summary_90w": "",
      "raw": "Bluesky adds bookmarks so users can privately save posts they want to reference later.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c951d36c90f21bec8a85f29b15bac07635d569cc",
      "title": "The best budget smartphone you can buy",
      "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T19:20:11.000Z",
      "summary_90w": "",
      "raw": "You can get a great budget device these days if you know how to pick your priorities. | Image: The Verge\t\n\nSome of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in. If that’s you — and there’s no judgment here from a certifiable gadget nerd — then you can probably think of more worthwhile ways to spend $1,000 than on a phone.\nBudget phones to the rescue. These devices are roughly $500 or under, though not all of them, and they’re more capable than ever. You won’t get all the bells and whistles, but you will save a little money to spend on, I don’t know, actual bells and whistles. It’s your world.\nWhat compromises can you expect from a budget phone? Some combination of the following: slower processors, less storage, and worse cameras than flagship phones, almost across the board. Many have lower-resolution screens, and water resistance is often less robust than on a pricier phone.\n\nThe best cheap iPhone\nThe best Android phone under $500\nThe budget phone with a big, beautiful screen\nOther budget phones to consider\n\nThe best cheap iPhone\niPhone 16E\nThe iPhone 16E is the spiritual successor to the iPhone SE, bringing flagship-level performance for less than the standard 16. We really wish it included MagSafe for $599, but those upgrading from older iPhones will probably be satisfied with what’s included.\n\n\nScore: 7\n\nProsCons\n\n\nReliable performance\nGood, if limited, camera system\nIt’s the cheapest new iPhone you can buy\n\nNo MagSafe\n$599 feels like $100 too much\nNo ultrawide\n\n\n\nWhere to Buy:\n\n $599 at Apple\n $599.99 at Best Buy\n $599.99 at Verizon\n\nScreen: 6.1-inch, 1170p OLED / Processor: A18 Cameras: 48-megapixel f/1.6 with OIS, 12-megapixel selfie / Charging: 20W wired, 7.5W wireless / Weather-resistance rating: IP68\nIf I were making this recommendation to you face-to-face, you’d hear a heavy sigh. Yes, this is the cheapest new iPhone Apple makes. Yes, it comes with most of the things that make an iPhone an iPhone. But it comes with some significant tradeoffs — some of which make more sense than others — and it’s not exactly cheap. If you’re amenable to last year’s model or a refurbished iPhone 14, one of those might actually be a better option. But for an unfussy person who just wants a new iPhone for the least amount of money, the 16E will do the trick.\nThere’s a single 48-megapixel rear camera on the back, meaning there’s no ultrawide like on the regular 16. That’s an understandable tradeoff — so is the use of the older “notch” design rather than the Dynamic Island. But it’s harder to understand why Apple left out MagSafe here — that’s the ring of magnets built into the back of virtually every other iPhone since 2020. The 16E still supports wireless charging, but it can’t take advantage of the ecosystem of magnetic chargers and accessories on its own; you’ll need to add a magnetic case. This is a silly omission, and Apple should feel bad about it.\nAnother heavy sigh: the 16E supports Apple Intelligence, which you won’t get if you opt for an iPhone 15 or 14. Should you care? It’s really hard to say. What exists of Apple Intelligence so far is underwhelming and the most interesting bits won’t arrive anytime soon. If you want to future-proof your purchase as much as possible, the 16E will be ready for Apple’s AI. But don’t buy one expecting a life-changing experience now. It’s just an iPhone after all, for better and worse, and right now it’s the best price you’ll find on a brand-new one.\nRead my full iPhone 16E review.\nThe best Android phone under $500\nGoogle Pixel 9A\nThe Pixel 9A adds more robust water resistance and a brighter, bigger screen to what was already a winning formula for a good midrange phone.\n\n\nScore: 8\n\nProsCons\n\n\nRobust IP68 rating\nSeven years of software updates\nBrighter, bigger screen\n\nMissing a couple of AI features\nAI is occasionally handy, usually weird\n\n\n\nWhere to Buy:\n\n $499 at Amazon\n $499 at Best Buy\n $499.99 at Google\n\nScreen: 6.3-inch, 1080p OLED, 120Hz / Processor: Tensor G4 Cameras: 48-megapixel f/1.7 with OIS, 13-megapixel ultrawide, 13-megapixel selfie / Battery: 5,100mAh / Charging: 23W wired, 7.5W wireless / Weather-resistance rating: IP68\nGoogle’s Pixel A-series phones have been my go-to recommendation for a cheap Android phone for years, but there was still room for improvement. With the 9A, Google made some modest tweaks that make it even easier to recommend — and at $499, the price is right. \nThe phone uses a Tensor G4 chipset that doesn’t run as hot as some of its predecessors, and performance is reliable. The 6.3-inch OLED screen is a little bigger and a bit brighter than last year’s, which makes a noticeable difference when you use the phone outside. Durability also received a slight boost to IP68, which means it can withstand a drop in deeper water than the IP67-rated Pixel 8A.\nThe 9A’s camera is fine, though it comes up short against the rest of the Pixel 9 series in low light. Portrait mode could be better, too, and if you care a lot about image quality, then that might be a good reason to consider stepping up to a Pixel 9. But it does the trick for everyday snaps, and for the price, the 9A’s better qualities outweigh its shortcomings by a wide margin.\nRead my full Google Pixel 9A review.\nThe budget phone with a big, beautiful screen\nOnePlus 13R\nThe OnePlus 13R is a pared-down version of the company’s flagship phone, and it offers excellent battery life and a great screen for the price.\n\n\nScore: 6\n\nProsCons\n\n\nExcellent battery life\nGreat screen for the price\nSix years of security updates\n\nNo wireless charging\nOnly splash-resistant\nFewer OS updates than Google and Samsung\n\n\n\nWhere to Buy:\n\n $599.99 $555.99 at Amazon\n $599.99 at Best Buy\n $599.99 at OnePlus\n\nScreen: 6.78-inch, 1264 x 2780 120Hz OLED / Processor: Snapdragon 8 Gen 3 Cameras: 50-megapixel f/1.8 with OIS, 50-megapixel 2x telephoto, 8-megapixel ultrawide, 16-megapixel selfie / Battery: 6,000mAh / Charging: 80W wired / Weather-resistance rating: IP65\nThe OnePlus 13R isn’t quite as well-rounded as my pick for the best overall budget Android phone, the Pixel 9A. It’s also a little pricier at $599 — although we’ve seen it on sale for $499 for extended periods of time — but for some people, the 13R’s upgrades will make it a better choice. It comes with one of the best big screens in its class, and many people love a big screen. The 13R also offers very strong battery performance; unless you’re a power user, you can probably manage two full days on a single charge.\nThere’s also very fast charging with the included charger, though you won’t find wireless charging at any speed. The 13R also lacks full water resistance; it should hold up fine against sprays and rain showers, but it isn’t rated to withstand full immersion. Plenty of people won’t find those omissions bothersome, but they make it harder to recommend to a general audience, especially at a higher price than the Pixel 9A.\nRead my full OnePlus 13R review.\nOther budget phones to consider\nThe 2025 Motorola Moto G Power offers a lot despite its starting price of $299.99. It features a 6.8-inch LCD display, a 5,000mAh battery, wireless charging support, and a 3.5mm headphone jack, which is increasingly rare in 2025. Additionally, the device combines both IP68 and IP69 ratings, meaning it’s rated for both submersion in water and exposure to high-pressure water jets and steam, in addition to full protection from dust.\nThe Samsung Galaxy S24 FE is another perfectly capable phone that doesn’t quite earn a recommendation here. It’s a little outside the scope of this guide at $649 anyway, but you do get a telephoto lens and a nice, big screen for that price. Still, you’re better off saving a bunch and picking up the Pixel 9A or trying to score a trade-in promo for the newer Galaxy S25. Read our review.\nThe Samsung Galaxy A56 recently launched in the US with a starting price of $499. The device has all the makings of a solid midrange phone, including a 6.7-inch OLED display, a 50-megapixel main camera, an Exynos 1580 chip, and a 5,000mAh battery with 45W wired charging. Although we haven’t tested it yet, it has some pretty stiff competition in the form of the Pixel 9A, which also has a starting price of $499.\nWe got our first glimpse of the TCL 60 XE Nxtpaper 5G back at CES 2025. The device features an Nxtpaper matte LCD screen that’s supposed to be easier on your eyes than a traditional LCD, as it reduces your exposure to blue light. It also features a “Max Ink Mode,” which turns the screen monochrome and silences notifications. This, in turn, can help extend the phone’s battery life to multiple days. Read our initial impressions.\nThe Samsung Galaxy A36 5G is another great choice that recently launched in the US for $399.99. The device sports a big OLED display, a decent midrange Snapdragon 6 Gen 3 processor, and an IP67 rating for water and dust resistance. Samsung is promising six years of OS and security updates, which is a lot in this price range. Compared to the Galaxy A35 5G, which we previously included in this guide but is no longer available, the A36 5G drops the microSD slot for a second SIM card slot. While we haven’t tested the A36 5G, its predecessor offered a good balance of hardware and price, and the latest release sounds just as compelling.\nUpdate, September 8th: Updated pricing / availability. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25f982df2e2580e919595928cf39a91343c5bbe1",
      "title": "Pinecone founder Edo Liberty discusses why the next big AI breakthrough starts with search, at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/08/pinecone-founder-edo-liberty-explores-the-real-missing-link-in-enterprise-ai-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:14:54.000Z",
      "summary_90w": "",
      "raw": "At TechCrunch Disrupt 2025, Pinecone founder and CEO Edo Liberty will explain why the next wave of AI-native apps won’t be driven by bigger models, but by smarter search.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "23139c0ae6ecfde4eaedb3435e80dd1a7a8fb6c1",
      "title": "Gemini app finally expands to audio files",
      "url": "https://www.theverge.com/ai-artificial-intelligence/774008/gemini-audio-new-languages-notebooklm-reports",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T19:14:28.000Z",
      "summary_90w": "",
      "raw": "Google made three major updates to its Gemini-powered products on Monday: The Gemini app now accepts audio files; Search can handle five new languages; and NotebookLM creates reports in the form of blog posts, study guides, quizzes, and more. \nAccording to a Monday post on X by Josh Woodward, vice president of Google Labs and Gemini, audio file compatibility was the “#1 request” to the Gemini app. \nFree Gemini users max out at 10 minutes of audio, and five free prompts each day. AI Pro or AI Ultra users, meanwhile, can upload audio up to three hours in length. All Gemini prompts accommodate up to 10 files across various file formats, including within ZIP files. \nAdditionally, Google Search’s AI Mode has rolled out five new language options: Hindi, Indonesian, Japanese, Korean, and Brazilian Portuguese, thanks to the integration of Gemini 2.5 with Search, according to a company blog: “With this expansion, more people can now use AI Mode to ask complex questions in their preferred language, while exploring the web more deeply.” \nThe Gemini-powered NotebookLM software is also getting an update in the form of new report styles in over 80 languages based on a user’s uploaded documents, files, and other media. \n(While the Gemini app is just now getting audio, NotebookLM already had that capability, positioning itself as a research tool that helps find patterns in files of different formats.)\nThe standard report formats include study guides, briefing docs, and blog posts. Flashcards and quizzes are also included in the latest NotebookLM update. Users can choose the self-created format and adjust the structure, tone, and style of the report. The feature “should be 100%” available by the end of this week, according to a company comment to a post on X.\nGoogle has been on a dizzying spree of AI-related features in the past month. Gemini began automatically recalling user details and preferences from past conversations in August, the same month that free users gained access to Workspace’s video generation software Vids. In September, Photos upgraded to the latest video generation software Veo 3 and gave free users the ability to create silent 4-second long videos from their own personal, still pictures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "59a49d8e2b5989e05aa1d3f5009fdb9f04fb052b",
      "title": "France in fresh political crisis after MPs oust prime minister",
      "url": "https://www.bbc.com/news/articles/c2dnxxekyezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T19:11:14.000Z",
      "summary_90w": "",
      "raw": "The French government loses a vote of confidence and PM François Bayrou will resign on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0234c13e045c72b51441218866187c608f46afa",
      "title": "Flexport’s Ryan Petersen on building through chaos at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/08/find-out-how-flexports-ceo-ryan-petersen-builds-when-the-rules-keep-changing-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Ryan Petersen, CEO of Flexport, joins the Builders Stage at TechCrunch Disrupt 2025, happening October 27–29 at Moscone West in San Francisco. Register to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "840fe00600871b36a43d4bf94b047982c8ad2543",
      "title": "Space DOTS raises $1.5M seed round to provide insights on orbital threats",
      "url": "https://techcrunch.com/2025/09/08/space-dots-raises-1-5m-seed-round-to-provide-insights-on-orbital-threats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Cefalo is the founder of Space DOTs, which launched in 2022 to detect space threats. She and her team have created a software platform for space tech manufacturers and operators to help them capture various data points, like radiation interference, as well as track any in-orbit anomalies, to help make space travel safer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "612caf1d2a2475f39fd16aa27dcd463858c71ddb",
      "title": "Signal&#8217;s first paid feature adds encrypted media and message backups",
      "url": "https://www.theverge.com/news/774018/signal-encrypted-secure-backups-paid-feature-beta",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T18:59:40.000Z",
      "summary_90w": "",
      "raw": "Signal is launching its first paid feature: the ability to make secure, end-to-end encrypted backups of your media history older than 45 days and of your text message history for $1.99 per month.\n“Media requires a lot of storage, and storing and transferring large amounts of data is expensive,” Signal’s VP of engineering, Jim O’Leary, says in a blog post. “As a nonprofit that refuses to collect or sell your data, Signal needs to cover those costs differently than other tech organizations that offer similar products but support themselves by selling ads and monetizing data.”\nSignal is also launching free secure backups that save your media from just the last 45 days. On that free tier, you’ll also be able to save your text messages past then, and while you’ll be limited to saving 100MB of messages, Signal expects that will still “be large enough for even heavy Signal users to back up the text of all of their messages,” according to O’Leary.\nThe backup archives are “stored without a direct link to a specific backup payment or Signal user account,” O’Leary says. You’ll use a recovery key to unlock your backups, but if you lose that key, the company “cannot help you recover it.” If you turn on secure backups, your device will make a new backup every day.\nThe feature is available on Android’s beta app, and a public launch and iOS and desktop support are “coming soon.” Down the line, Signal plans to let users save a secure backup archive to “the location of your choosing.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a912e32943d6d8acd400c127c35db03a6fe6ed61",
      "title": "VC giant Insight Partners notifies staff and limited partners after data breach",
      "url": "https://techcrunch.com/2025/09/08/vc-giant-insight-partners-notifies-staff-and-limited-partners-after-data-breach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T18:56:04.000Z",
      "summary_90w": "",
      "raw": "The venture capital giant, behind cyber giants Wiz and Databricks, said it has notified current and former employees and the firm's limited partners of its January breach.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ac80bff6ea922455776c4e7a955e3e1fad7529fd",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "url": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:54:27.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Hundreds of film workers join new boycott initiative criticized by Israeli producers’ group as ‘misguided’\nHundreds of actors, directors and other film industry professionals have signed a new pledge vowing not to work with Israeli film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.\n“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” the pledge reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e638cc06c9c11ca28a9c3d84978e1179a7a84aa",
      "title": "Cognition AI defies turbulence with a $400M raise at $10.2B valuation",
      "url": "https://techcrunch.com/2025/09/08/cognition-ai-defies-turbulence-with-a-400m-raise-at-10-2b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T18:49:04.000Z",
      "summary_90w": "",
      "raw": "Founders Fund, the Peter Thiel-backed VC, led Cognition’s latest round, with participation from existing investors like Lux Capital, Joe Lonsdale’s 8VC, Elad Gil, Definition Capital and Swish Ventures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dab73e39c5bb303e1b75e9c36bb838ce1c73e023",
      "title": "Google’s AI Mode adds 5 new languages including Hindi, Japanese, and Korean",
      "url": "https://techcrunch.com/2025/09/08/googles-ai-mode-adds-5-new-languages-including-hindi-japanese-and-korean/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T18:46:10.000Z",
      "summary_90w": "",
      "raw": "Google's AI Mode is rolling out in Hindi, Indonesian, Japanese, Korean, and Brazilian Portuguese.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "798a6d3cfd4b57d6e8616cbded6ab74fb9e6dded",
      "title": "Palestinian gunmen kill six people at Jerusalem bus stop",
      "url": "https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:24:22.000Z",
      "summary_90w": "",
      "raw": "At least 12 others injured in attack at Ramot intersection during morning rush hour\nPalestinian gunmen opened fire at a crowded bus stop in the northern outskirts of Jerusalem on Monday, killing six people and injuring 12 others before being shot dead by an off-duty soldier and a civilian at the scene.\nThe victims included a 79-year-old former cardiologist, a 43-year-old rabbi and a 25-year-old who had recently emigrated from Spain. Twenty-six others suffered injuries, including six who were left in a serious condition with gunshot wounds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e04a43f51845386c2aa2ce3b2add249a232808b5",
      "title": "Boris Johnson was paid £240,000 after Maduro meeting, invoice shows",
      "url": "https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:12:48.000Z",
      "summary_90w": "",
      "raw": "Johnson’s office sent invoice to hedge fund manager, which was paid, weeks after meeting Venezuelan leader last year\n\nRevealed: how Boris Johnson traded PM contacts for global business deals\n\nFrom a private jet somewhere over the Caribbean Sea in February last year, Boris Johnson called his old political adversary David Cameron, then the foreign secretary, to notify him of a visit.\nJohnson had taken a day out from a family holiday in the Dominican Republic for an unlikely meeting with the leftwing president of Venezuela, Nicolás Maduro, a man whom Johnson, when in office, had likened to a “dictator of an evil regime”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6704df640f109d4d73f3b7ac2af32314dac23f3f",
      "title": "When was the last enjoyable England World Cup qualifier?",
      "url": "https://www.bbc.com/sport/football/articles/ckgqzkx4x9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T18:10:13.000Z",
      "summary_90w": "",
      "raw": "As England prepare to face Serbia on Tuesday, BBC Sport's Phil McNulty looks at why there is often a lack of entertainment in World Cup qualifiers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cd7c4e39cfd0f683f4b2cf54a484029416907d1",
      "title": "Hamas discussing US 'ideas' for Gaza ceasefire after Trump's 'last warning'",
      "url": "https://www.bbc.com/news/articles/cn0rxl7jwwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T18:08:14.000Z",
      "summary_90w": "",
      "raw": "Hamas says it received \"some ideas\" from the US through mediators on how to reach a Gaza ceasefire deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4dfcf871a6964425da81a8da98bdf2f53ffe5c5f",
      "title": "The Polestar 5 is an 884hp fastback sedan that should make Porsche nervous",
      "url": "https://www.theverge.com/electric-cars/773730/polestar-5-ev-horsepower-range-speed-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T18:00:00.000Z",
      "summary_90w": "",
      "raw": "It’s been five years since Polestar first introduced the Precept, a concept car that the electric automaker described as “a manifesto of things to come; a declaration.” Well, come they have, because today Polestar finally revealed the production car that’s based on this manifesto: the Polestar 5.\nAnd wow, these specs: up to 460 miles of range, 800-volt architecture for ultra-fast charging, 884 horsepower, 0–60mph in an oomph-inducing 3.1 seconds for the Performance trim. It certainly makes those five years feel like worth the wait.\nIn final form, the Polestar 5 is an absolutely stunning fastback sedan with dramatic proportions that are sized similarly to the Porsche Panamera. The 5 will be built on a bespoke supercar-like bonded aluminum platform that’s was developed at Polestar’s own facility in England. And like the Polestar 4, it lacks a rear window, relying instead on a high-definition rearview camera.\nThere’s a lot more, so let’s dig into it. \nPower\nAt launch, there will be two versions of the Polestar 5: a Dual Motor trim with 748hp (550kW), 599lb-ft of torque (812 Newton-meters), and a 0–60mph time of 3.8 seconds; and a Performance package with 884hp (650kW), 749lb-ft (1,015Nm) of torque, and 0–60mph acceleration in 3.1 seconds. Both versions are speed-limited to a maximum of 155mph — seemingly in the spirit of former parent company Volvo’s safety maxim of limiting vehicle max speed to 112mph.\nThe 800-volt architecture is new to Polestar, and should enable 350kW charging when plugged into a suitable charger. That means 10–80 percent charging in “as little” as 22 minutes, the company says. Owners can expect a WLTP estimated range of 670km (416 miles) for the Dual Motor trim and 565km (351 miles) for the Performance one.\nThe Polestar 5’s battery contains 112kWh of energy, 106kWh of which is usable. The SK One-supplied NMC (nickel cobalt manganese) pack consists of eight modules with 192 cells. And its design forms part of the 5’s steel structure, which Polestar says brings safety benefits.\nDesign\nThe Polestar 5 is built on the company’s Polestar Performance Architecture (PPA), which uses a bespoke, hot-cured aluminum structure for improved weight and rigidity. That frame consists of 13 percent recycled aluminum and 83 percent aluminum from smelters (no word on the remaining 4 percent), which helps lower the 5’s carbon footprint when compared to standard sourcing.\n(Keep in mind that Polestar has positioned itself as one of the few automotive startups that still gives a shit about climate change. The company’s CEO recently used his keynote at the IAA Mobility conference in Munich, where the Polestar 5 will make its debut, to urge EU leaders to stick to their strict zero-emission goals.)\nThe Performance variant is slated to have a sport-tuned suspension with semi-active dampers. There are also bespoke Michelin tires, designed specifically for the Polestar 5, ranging from 20 to 22 inches depending on the trim level.\nInside, you’ll find a 14.5-inch portrait display alongside a 9-inch instrument cluster behind the steering wheel. To cut down on distractions, there will be a 9.5-inch heads-up display projected on the windshield. And a driver-monitoring camera makes sure the driver keeps their eyes on the road while the driver assist system is engaged.\n\nThe Performance variant is slated to have a sport-tuned suspension with semi-active dampers.\n\n\nThe front fascia features Polestar’s SmartZone, which consists of many of the vehicles’ sensors, like radar and the front parking camera. In total, the Polestar 5 has 11 vision cameras, one driver monitoring camera, one mid-range radar, and 12 ultrasonic sensors. (Unlike the Polestar 3 and 4, the 5 won’t feature a lidar sensor.) The vehicle also uses interior radars to detect the number, position, and type of occupants to “deploy the correct safety measures in the event of an accident.”\nThere’s a lot of high-end brand names scattered throughout this announcement: Brembo for braking, Bowers & Wilkins for a premium audio system, and Bridge of Weir nappa leather as an optional interior. The driver-assist system is powered by Mobileye, while the infotainment system runs on Google’s embedded Android software.\nWhile designed as a four-seater, the rear arm rest can be lifted to accommodate a fifth passenger. Polestar cut out a space in the battery, known as the foot garage, behind the front seats to give occupants an extra foot of space for a more natural seating position.\nAvailability\nPolestar didn’t reveal an exact launch date — customer deliveries are planned for the first half of 2026 — or starting price for the 5, only to say they are coming soon. Suffice it to say it won’t be cheap. The Performance version of the grand tourer is expected to start somewhere north of $100,000 in North America.\nThe company has had a strong sales year so far, thanks to some deep discounts, including one geared toward converting former Tesla owners. The company makes the Polestar 2 electric fastback, the Polestar 3 electric SUV, and the Polestar 4 electric SUV coupe. \nTariffs are sure to take a toll on the Geely-owned, Swedish-designed company’s future. Polestar manufactures in the US and China, and plans to make the Polestar 4 in South Korea in the second half of 2025. It hasn’t said where the 5 will be built, so that will be one to watch. \nBut despite these challenges, Polestar is charging ahead. First shown last spring as the O2 concept, the Polestar 6 will be the brand’s next flagship model, taking the form of a two-door sports car with a convertible roof. And when the 6 goes on sale (presumably in 2026), it will use the same architecture and powertrains as the Polestar 5.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5f18e3350d369b3ab29d27af5cf4e53a7fb78db",
      "title": "Signal introduces free and paid backup plans for your chats",
      "url": "https://techcrunch.com/2025/09/08/signal-introduces-free-and-paid-backup-plans-for-your-chats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:44:27.000Z",
      "summary_90w": "",
      "raw": "Privacy-focused messaging app Signal announced on Monday that it's introducing a feature that allows users to back up their text conversations for free, along with the last 45 days of media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eeef52e24fc174f582679072d45f54729156a4ca",
      "title": "Salesloft says Drift customer data thefts linked to March GitHub account hack",
      "url": "https://techcrunch.com/2025/09/08/salesloft-says-drift-customer-data-thefts-linked-to-march-github-account-hack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:35:06.000Z",
      "summary_90w": "",
      "raw": "The breach, now known to have begun in March, raises questions about why it took six months for Salesloft to detect the breach.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c56cc1cf05c33e56aa9b0f5a8ce0f25f8912a20",
      "title": "Meta suppressed children’s safety research, 4 whistleblowers claim",
      "url": "https://techcrunch.com/2025/09/08/meta-suppressed-childrens-safety-research-four-whistleblowers-claim/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:29:08.000Z",
      "summary_90w": "",
      "raw": "Four whistleblowers share documents with Congress alleging that the company may have suppressed research on children's safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "Why has the French PM had to go and what happens next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T17:18:52.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has lost a confidence vote, sending parliament into another period of chaos and uncertainty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea9edcf3fd1240b099a937327867b08963a62991",
      "title": "How to watch Apple announce the iPhone 17",
      "url": "https://techcrunch.com/2025/09/08/how-to-watch-apple-announce-the-iphone-17/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:05:42.000Z",
      "summary_90w": "",
      "raw": "Apple is debuting the iPhone 17 at its annual hardware event on September 9.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8bb8fd1141433834a06e4b7ebe5fbdc644cbacd3",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/08/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T17:00:47.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8ffabc41a1ce9e91f468dc28e2cd39800eb6703",
      "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
      "url": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:44:16.000Z",
      "summary_90w": "",
      "raw": "President touted contest in Buenos Aires province – 40% of electorate – as ‘life or death battle’ but won only 34% of vote\nArgentina’s president, Javier Milei, has suffered his worst electoral defeat since taking office, as he faces his administration’s most serious corruption scandal and signs that the economy is slowing.\nIn local legislative elections on Sunday for Buenos Aires province – home to almost 40% of the country’s electorate – the coalition led by the self-styled anarcho-capitalist was beaten by the opposition by 47% to 34%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0a9e015ed19cb89202decdc9f0ba220e6c18f7b",
      "title": "'Playing perfectly' - how does Alcaraz rank v men's tennis legends at 22?",
      "url": "https://www.bbc.com/sport/tennis/articles/czew374r499o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T15:16:05.000Z",
      "summary_90w": "",
      "raw": "BBC Sport explores Carlos Alcaraz's stunning record compared to tennis' biggest legends in the men's game after his sixth Grand Slam triumph.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf8c157d26916af75c042b4ff5a1bc9aefc11af3",
      "title": "Six Israelis killed by Palestinian gunmen at Jerusalem bus stop",
      "url": "https://www.bbc.com/news/articles/cr70ny0l7vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:09:39.000Z",
      "summary_90w": "",
      "raw": "Israeli police say two gunmen were killed after the attack, which was one of the deadliest in the city in years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2bfa8a49cb354c3797aa48d4697c88c17ce4eb85",
      "title": "Lisbon funicular crash victim was 'transport enthusiast'",
      "url": "https://www.bbc.com/news/articles/cq8ev844egpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:08:20.000Z",
      "summary_90w": "",
      "raw": "Sixteen people died when the funicular crashed into a building in the Portuguese capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62ac98efb11351751752e1c7bd3ed059cc97c277",
      "title": "French doctor goes on trial for poisoning 30 patients, 12 fatally",
      "url": "https://www.bbc.com/news/articles/crl5ngj9zwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T11:00:18.000Z",
      "summary_90w": "",
      "raw": "Frédéric Péchier, considered by colleagues to be a highly-talented practitioner, maintains there is no proof of any poisoning.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a17d725e28af25ca18a225e04e46ddd1a9a797a8",
      "title": "Watch: Glitz, glamour and emotional speeches at VMAs 2025",
      "url": "https://www.bbc.com/news/videos/crl5ngr2069o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:04:06.000Z",
      "summary_90w": "",
      "raw": "The MTV Video Music Awards (VMAs) have taken place in New York, with high profile figures in the music industry taking to the red carpet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8090bee0b7bbd41ad9c10cbe8d3aa6af2166b744",
      "title": "World Cup ticket sales are about to begin. Scoring them may not be easy — or cheap",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529273/fifa-world-cup-2026-ticket-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "FIFA is set to launch the first window of regular ticket sales for the 2026 World Cup on Wednesday. Brace yourself: because they may not be easy to get — or cheap.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "92c6e3934c891244053cede02b47ac3dd9bb0119",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:01:03.000Z",
      "summary_90w": "",
      "raw": "Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said\nA fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.\nThe whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2c05487bf4009e970ec540a06f48f1e758431b5",
      "title": "Fugitive father shot dead by police – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T06:17:21.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. Our full report is here: Tom Phillips shot dead after attempted burglary, NZ police confirm\nThe mayor of Waitomo, John Robertson, told the Guardian this morning’s events were the worst possible outcome for the community.\n“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.\nSo it’s just devastating news. Really the worst outcome we could have expected.\nNo day that goes by that I don’t think about all four of them.\nIt hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a0ea8bcfd8e548e3b062ceb470fb9545d728839",
      "title": "'Suitcase murder' trial begins in New Zealand",
      "url": "https://www.bbc.com/news/articles/cn83jjx9pjvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T05:12:14.000Z",
      "summary_90w": "",
      "raw": "Hakyung Lee is accused of killing her two young children, whose bodies were found stuffed in suitcases.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ddfbb3dc5f62c8ce222017e5bcb40503f190088",
      "title": "Huge drugs bust reveals battles on cocaine 'superhighway'",
      "url": "https://www.bbc.com/news/articles/c5yvplyrrwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T05:02:40.000Z",
      "summary_90w": "",
      "raw": "An audacious attempt to smuggle tonnes of cocaine was stopped, but pressure from drug cartels remains.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d98772a77dc18103b9621c4858b7c273dfdb6c6b",
      "title": "What it was like inside court as mushroom murderer was jailed for life",
      "url": "https://www.bbc.com/news/videos/c15k4y5nwz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T03:32:23.000Z",
      "summary_90w": "",
      "raw": "The BBC's Katy Watson was in the courtroom as Erin Patterson was sentenced to life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "169b304d9ac7730c59b76c700858afeb431517b9",
      "title": "Palestinian prisoners not being given adequate food, Israel top court says",
      "url": "https://www.bbc.com/news/articles/c1mxlk518vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T02:53:54.000Z",
      "summary_90w": "",
      "raw": "The court said the state is legally obligated to provide enough food to ensure \"a basic level of existence.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "560ce79c5ad9c75d0a13333406a1f6952e60334e",
      "title": "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533207/carlos-alcaraz-trump-us-open-tennis-rolex",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T00:37:01.000Z",
      "summary_90w": "",
      "raw": "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "eb321a5ec31ad66b516c657d96408e9d9bbd9c25",
      "title": "More than 90,000 Jeep Grand Cherokees recalled over potential loss of drive power",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533180/jeep-grand-cherokee-recall-plug-in-hybrid",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T23:24:34.000Z",
      "summary_90w": "",
      "raw": "Vehicles impacted by the recall include 2022 to 2026 plug-in hybrid electric models of the Jeep Grand Cherokee.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dbad04708a3dc7972c447fc4ea8545ac9955e61d",
      "title": "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "url": "https://www.bbc.com/news/articles/c5yqg0rln74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T23:14:55.000Z",
      "summary_90w": "",
      "raw": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d625229d1d985684c5f55631964a7ff359406eb",
      "title": "Timelapse shows Blood Moon rising around the world",
      "url": "https://www.bbc.com/news/videos/c93071yz5zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T19:00:54.000Z",
      "summary_90w": "",
      "raw": "As the Moon passes through the Earth's shadow, it takes on a deep red hue, creating a striking \"Blood Moon\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fb66623af50785279079c5a85f4b29f2fddd222",
      "title": "Postal traffic to U.S. drops over 80% after trade exemption rule ends, U.N. agency says",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533121/postal-traffic-to-us-drops-more-than-80-after-trade-exemption-rule-ends-un-agency-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T17:54:41.000Z",
      "summary_90w": "",
      "raw": "The de minimis rule that allowed small packages worth less than $800 to be exempt from tariffs ended on Aug. 29.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7d3b2c06d8f9af601040873109a002d23088b591",
      "title": "Thousands flock to Vatican as teenager made first millennial saint ",
      "url": "https://www.bbc.com/news/videos/cy9njpyp09do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T16:32:36.000Z",
      "summary_90w": "",
      "raw": "Pope Leo canonises the London-born Italian boy nicknamed \"God's influencer\" for his online skills.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "922661201adabb2ad3a56d0e6c944b1f248a80d3",
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:56:23.000Z",
      "summary_90w": "",
      "raw": "Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers\nThe Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.\n“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military strike against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0821bfdb2476b823c1947bf67d7f1ab6c7c26f63",
      "title": "Has Labour Just Moved Towards the Right?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1cyhy?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:54:00.000Z",
      "summary_90w": "",
      "raw": "With Angela Rayner out, is Keir Starmer’s government more right wing?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69ee372a67aefdd9ae7a23bc1be9ab19f8761145",
      "title": "LGBTQ+ Americans consider move to Canada to escape Trump: ‘I’m afraid of living here’",
      "url": "https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T10:00:17.000Z",
      "summary_90w": "",
      "raw": "LGBTQ+ people in the US contemplate heading north as they wrestle with the president’s assault on the community\nThe number of LGBTQ+ Americans inquiring about moving to Canada has soared since Donald Trump’s re-election, campaigners have said, as people across the US wrestle with the fallout of rising anti-gay rhetoric, anti-trans executive orders, and the more than 600 bills targeting LGBTQ+ rights.\n“So much is happening in the US right now and a lot of it is terrifying,” said Latoya Nugent of Rainbow Railroad, a North American charity that helps LGBTQI+ individuals escape violence and persecution in their home countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "febb535b7ba16857aa2cf831ebebac7cc2367a85",
      "title": "South Korea charters plane to fly home over 300 workers detained by ICE at Georgia Hyundai plant",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532604/hyundai-immigration-raid-georgia-south-korea",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T19:38:32.000Z",
      "summary_90w": "",
      "raw": "On Sunday, South Korean officials said they would send a plane to bring the detained workers home. Earlier, South Korea's Foreign Minister said his nation was \"deeply concerned\" by the arrests.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ff5bffa30fc613afcdb7a34b907996e064561552",
      "title": "Opinion: Susan Stamberg, trailblazer and NPR Founding Mother, retires",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5522120/opinion-susan-stamberg-trailblazer-and-npr-founding-mother-retires",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T12:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR Founding Mother Susan Stamberg is retiring. She became the first woman to anchor a nightly national news program in 1972, and helped loosen up the serious, stodgy sound of radio hosts.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04f64312059b1aa29a182530f112c797830ea1b3",
      "title": "How an 18th-century portrait stolen by the Nazis was recovered 80 years later in Argentina",
      "url": "https://www.theguardian.com/world/2025/sep/06/18th-century-portrait-stolen-by-nazis-recovered-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Painting was spotted online by Dutch journalists when the daughter of a former Nazi official put her house up for sale in Mar del Plata\nThere was nothing very remarkable about the middle-aged couple who lived in the low, stone-clad villa on calle Padre Cardiel, a quiet residential street in the leafy Parque Luro district of Argentina’s best-known seaside town, Mar del Plata.\nPatricia Kadgien, 59, was born in Buenos Aires, five hours to the north. Her social media described her as a yoga teacher and practitioner of biodecoding, an obscure alternative therapy that claims to cure illness by resolving past traumas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5dbb34225979e86522cc6f2fb9796eb6e48b92aa",
      "title": "The Global Story: The deal that broke Ukraine's trust",
      "url": "https://www.bbc.co.uk/programmes/w3ct714l?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "An exploration of the 1994 Budapest Memorandum, intended to enshrine Ukraine's security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}