{
  "version": "1755890003344",
  "generatedAt": "2025-08-22T19:13:23.344Z",
  "items": [
    {
      "id": "6cc2aa6cf1d7512c8b0e6a59c2b65459e3642982",
      "title": "Workers need better protections from the heat ",
      "url": "https://www.theverge.com/news/764463/heat-stress-health-work-protections",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T19:03:12.000Z",
      "summary_90w": "",
      "raw": "Expect record-breaking temperatures to change the workplace, the World Health Organization (WHO) and World Meteorological Organization (WMO) warned today in a new report. When workers don’t have adequate protections from heat stress, their health and productivity suffer.    \nIt’s a risk employers and lawmakers have to take more seriously if they want to keep workers safe and businesses prosperous, the agencies say. That means finding ways to adapt in a warming world, and paying close attention to groups that might be more vulnerable than others. \n“Without bold coordinated action, heat stress will become one of the most devastating occupational hazards of our time,” Joaquim Pintado Nunes, chief of the branch responsible for occupational safety and health at the International Labour Organization (ILO), said during a press briefing. \n\n“One of the most devastating occupational hazards of our time”\n\n\nMore than 2.4 billion people around the world — 71 percent of the working population — experience workplace heat stress, according to estimates from the ILO. Each year, 22.85 million occupational injuries and 18,970 fatalities are linked to excessive heat at work. The report also says that worker productivity falls 2–3 percent with every degree increase above 20 degrees Celsius in wet-bulb globe temperature, a measure that takes humidity and other environmental factors into account.\nRecord-shattering temperatures are already setting new norms for people in the workplace. Last year was the hottest year on record yet, but perhaps not for long, as planet-heating pollution continues to rise. The past decade, from 2015 to 2024, also marked the warmest on the books. \nA healthy person at rest can regulate core body temperature to between 36.5C and 37.5C (97.7–99.5 Fahrenheit). That gets harder to do the hotter their environment is, or if they’re engaged in physical work or wearing gear that limits the body’s ability to cool itself down when sweat evaporates from skin. A person’s core body temperature shouldn’t rise above 38C (100.4F) for prolonged periods during work shifts, the WHO/WMO report says. \nThe effects of heat stress can start off mild, leading to heat rash, cramps, or fatigue that a person can recover from if they have enough time to cool off, rest, and rehydrate. But prolonged or extreme exposure might escalate things, and can result in heat stroke and even neurological dysfunction that could impair a person’s ability to seek help. \nHeat happens to be the leading weather-related killer across the globe. People with certain chronic conditions, children, and older adults who can’t regulate their core body temperature as efficiently as others are more vulnerable. First responders and folks who work outdoors or indoors with equipment that releases heat (stoves or furnaces, for example) also face heightened risks. \nThere needs to be more education and awareness around heat stress in the workplace, the WMO and WHO urge. Preventative measures include boosting warning systems for heat waves, similar to warnings people might receive ahead of other environmental disasters. Employers should plan for longer or more frequent breaks, and can redesign uniforms and workplaces to keep workers cooler. They should also have plans for what to do in case of heat-related emergencies. \nLawmakers can get the ball rolling on this work by introducing policies that standardize these kinds of solutions. In the US, the Biden administration proposed new protections for workers last year in an effort to prevent heat-related illnesses and deaths on the job. A heat index of 90F or higher would trigger 15-minute breaks every couple of hours for certain jobs, for instance. But we’ll have to see whether those proposed measures will survive the Trump administration’s deregulatory agenda.\nThe biggest step that businesses and policymakers can take, of course, is to slash fossil fuel emissions causing global warming. Otherwise, all we can do is keep playing catch-up as the mercury rises. \n“Climate change is reshaping the world of work,” Pintado Nunes said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fefdadbe773a1f59dde02631474ccef8a321961d",
      "title": "TikTok denies India comeback after reports of website going live",
      "url": "https://techcrunch.com/2025/08/22/tiktok-denies-india-comeback-after-reports-of-website-going-live/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T18:59:43.000Z",
      "summary_90w": "",
      "raw": "TikTok isn’t making a comeback in India.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9d48a84e55973baee890828d2eecd332f325ec2",
      "title": "Sri Lanka's former president Ranil Wickremesinghe arrested",
      "url": "https://www.bbc.com/news/articles/cwye3y3dyn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T18:44:26.000Z",
      "summary_90w": "",
      "raw": "Ranil Wickremesinghe has been arrested in connection with the alleged misuse of funds, officials said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8efc5c20337cdf8339c588298161678402806c7c",
      "title": "‘We didn’t understand the goals of the war’: Israel’s inflated Hamas death toll shows lack of strategy in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/22/israel-defence-forces-war-strategy-hamas-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:42:21.000Z",
      "summary_90w": "",
      "raw": "‘War dashboard’ showing number of militants killed was objective in itself with no plan for how Gaza could be governed afterwards, say sources in elite Unit 8200\nAs Israel gears up for a new offensive in Gaza, figures from a classified database suggest the country’s political and military leadership has for two years misled their country and the world about a war that has overwhelmingly killed civilians.\nIn May this year, Israel’s military intelligence database of Hamas and Palestinian Islamic Jihad fighters had 47,653 names. Of them, 8,900 were marked as killed, or probably killed, a joint investigation by the Guardian, the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call has found.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d8ae4bcdd6af1a14ceec035d68061ac4692d833",
      "title": "Trump says the US is taking a 10 percent stake in Intel",
      "url": "https://www.theverge.com/news/764480/intel-donald-trump-lip-bu-tan-deal",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T18:39:55.000Z",
      "summary_90w": "",
      "raw": "Trump made the announcement during a briefing about the World Cup. | Photographer: Annabelle Gordon/UPI/Bloomberg via Getty Image\t\n\nPresident Donald Trump has confirmed that the US will take a 10 percent stake in Intel. During a press conference on Friday, Trump said Intel CEO Lip-Bu Tan agreed to give the government the stake, which is valued at around $10 billion. Earlier this month, Trump called on Tan to resign over his ties to China, and today he positioned the deal as a way for the executive to “keep his job.”\nTrump told reporters that he floated the offer during negotiations with Tan. “I said, ‘I think it would be good having the United States as your partner,’” Trump said. “They’ve agreed to do it, and I think it’s a great deal for them.”\nThe confirmation of the deal comes just days after SoftBank announced plans to invest $2 billion into Intel to “further expand” chipmaking in the US. Trump is expected to formally announce the agreement with Intel later today. \nIntel declined to comment.\nThe federal government’s stake in the embattled chipmaker marks yet another move that blurs the line between government and business, as reports suggest that the Trump administration has demanded that Nvidia and AMD give the government a 15 percent cut of chip sales to China.\nTreasury Secretary Scott Bessent hinted at the government’s potential investment this week, saying during an interview with CNBC that it “would be a conversion of grants” meant to “stabilize the company for chip production here in the US.”\nIt doesn’t seem like this is the end for Trump’s approach to deal-making, as he said during the briefing that “he’ll do more of them” in the future.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d0889901a72bd8c4502541711a1b894e4c8f7b3",
      "title": "Axbylute will actually sell Intel and Tencent’s gigantic glasses-free 3D handheld",
      "url": "https://www.theverge.com/report/763957/axbylute-will-actually-sell-intel-and-tencents-gigantic-glasses-free-3d-handheld",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T18:24:20.000Z",
      "summary_90w": "",
      "raw": "The Abxylute 3D One.\t\n\nIn January, one of the wildest Intel prototypes I witnessed at CES was a giant handheld gaming PC with an 11-inch autostereoscopic (read: glasses-free) 3D screen, detachable controllers, an Intel Lunar Lake chip, and a dedicated toggle to switch between 2D and 3D modes.\nCo-developed by Intel and Tencent Games, it was called the Sunday Dragon 3D One and dubbed an experimental product. But now, Abxylute, the company best known for kickstarting a $199 cloud gaming handheld, tells The Verge that it will actually sell this massive Windows handheld as the Abxylute 3D One. \nIt should go on sale in late September or early October for a price under …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e4c8af303bc468d5bf1ac90f4f15290d84dc0674",
      "title": "Home Office seeks to appeal against court ruling on Epping asylum hotel",
      "url": "https://www.bbc.com/news/articles/cy5p2ye95z9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T18:15:24.000Z",
      "summary_90w": "",
      "raw": "The High Court refused a last-minute request by the Home Office to intervene in the Epping asylum hotel case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8ccae1d84520c93440e8146778fb4a91e944f75",
      "title": "Apple is in talks to use Google’s Gemini for Siri revamp, report says",
      "url": "https://techcrunch.com/2025/08/22/apple-is-in-talks-to-use-googles-gemini-for-siri-revamp-report-says/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T18:15:08.000Z",
      "summary_90w": "",
      "raw": "Apple promised a major revamp to Siri, but the company's AI capabilities have lagged behind competitors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c010a41fea4a754a2146b241cc5f4484d1a674c1",
      "title": "The next Starship flight will test much more than hardware",
      "url": "https://techcrunch.com/2025/08/22/the-next-starship-flight-will-test-much-more-than-hardware/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T18:11:17.000Z",
      "summary_90w": "",
      "raw": "The 10th Starship flight test will be a referendum on the company's build-fly-fix approach.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a86ffdef8bae8ad779193531ec43c0c9de80780",
      "title": "Microsoft tests letting you resume Android apps on Windows 11",
      "url": "https://www.theverge.com/news/764484/microsoft-tests-letting-you-resume-android-apps-on-windows-11",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T18:09:23.000Z",
      "summary_90w": "",
      "raw": "Microsoft is testing a new Windows 11 feature that will let you resume using your Android apps right on your PC. The capability is gradually rolling out to Windows Insiders in the Dev and Beta Channels, and only supports the Spotify app for now.\nIf you’re in the test, you can try out the feature by linking your Android phone to your PC, and then opening up a song on Spotify’s mobile app. From there, Windows 11 will display a “Resume from your phone” notification alongside the Spotify icon and a prompt to “Continue on this PC.”\nOnce you select the notification, your PC will open Spotify’s desktop app — or prompt you to install it if you haven’t yet — and continue to play the same song from your computer. Microsoft first showcased this feature during a (now-deleted) Build 2025 demo. It sounds pretty similar to Handoff on macOS, which lets you resume your activity on a Mac, iPhone, iPad, or Apple Watch on another device.\nMicrosoft doesn’t say how it plans to expand this Handoff-like feature in the future, but I could see it becoming helpful if you want to continue an activity that you started on your phone, like reading an article or writing an email, on your computer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41871fdc131ac2dcc651ea909ada9228a26bcafb",
      "title": "Canada removes some of its retaliatory tariffs on the U.S.",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511357/canada-carney-tariffs-us",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T18:08:47.000Z",
      "summary_90w": "",
      "raw": "Canada is dropping retaliatory tariffs to match U.S. tariff exemptions for goods covered under the United States-Mexico-Canada trade pact, Prime Minister Mark Carney announced Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e85a38f37708c91cd8de79467d795f433ad1bb1",
      "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump",
      "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:02:17.000Z",
      "summary_90w": "",
      "raw": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain\nCanada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States.\nFrom 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0da99e5d329181dbf4f947f4234b43f08bb00789",
      "title": "Canada to drop many of its retaliatory tariffs on the US",
      "url": "https://www.bbc.com/news/articles/c5yk9dqlvygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T17:52:04.000Z",
      "summary_90w": "",
      "raw": "The move comes after the two countries blew past a self-imposed deadline to reach a trade agreement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1550c44a473728c1b2cf5a22f62c535746ede50e",
      "title": "UK agrees to pay Kenyans affected by military fire",
      "url": "https://www.bbc.com/news/articles/c9vd3k1dpymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T17:38:08.000Z",
      "summary_90w": "",
      "raw": "Thousands says they have suffered health problems or lost property after fire caused by British military.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb9fbb65e5a1db19944b0e5718bc38acea3aef23",
      "title": "'The biggest event in sport' - Trump announces 2026 World Cup draw",
      "url": "https://www.bbc.com/sport/football/articles/cly4pk542d1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T17:33:20.000Z",
      "summary_90w": "",
      "raw": "The draw for the 2026 men's World Cup will take place in Washington this December, US President Donald Trump has announced.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dba081b7056673834e5f13327d8d32641308bc79",
      "title": "Travellers warned of bank holiday disruption ",
      "url": "https://www.bbc.com/news/articles/c1kzrxwjnryo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T17:32:43.000Z",
      "summary_90w": "",
      "raw": "A rail strike and works are expected this weekend as millions begin their bank holiday getaways.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "85026dbe2fa185cd1f543aad20be3a208efcc585",
      "title": "See how new voting maps in Texas and California would shift the political landscape",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511300/california-texas-redistricting-shifts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T17:08:00.000Z",
      "summary_90w": "",
      "raw": "The major parties' redistricting battle escalated this week, with lawmakers in the country's two most populous states each taking a notable step toward a new congressional map.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a6890ee9ac73b03729bbd87e23ff5bfb6874022",
      "title": "Y Combinator says Apple’s App Store has hindered startup growth",
      "url": "https://techcrunch.com/2025/08/22/y-combinator-says-apples-app-store-has-hindered-startup-growth/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Y Combinator is asking the court to deny Apple’s appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de467a2e5bca399f506ee786629ab0535af80da5",
      "title": "Famine confirmed in Gaza City is 'failure of humanity', UN chief says",
      "url": "https://www.bbc.com/news/articles/c05ed5rgld3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T16:56:49.000Z",
      "summary_90w": "",
      "raw": "A UN-backed body confirms famine in Gaza Strip and surrounding areas, and says half a million are facing \"catastrophic\" conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d02312a95901a3b4206e07164f8a37558f3709cc",
      "title": "Nvidia reportedly halts production on its H20 AI chips",
      "url": "https://techcrunch.com/2025/08/22/nvidia-reportedly-halts-production-on-its-h20-ai-chips/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T16:53:47.000Z",
      "summary_90w": "",
      "raw": "Beijing is reportedly urging Chinese companies to turn to domestic chips just weeks after Nvidia got the green light to sell in China again.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b808b1e8cb27548218420a455dc3ef3b726d9c28",
      "title": "Joe Gruters, a Trump ally, elected new head of Republican National Committee",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511334/joe-gruters-elected-new-rnc-chairman-michael-whatley",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T16:51:38.000Z",
      "summary_90w": "",
      "raw": "Joe Gruters, a Trump-backed Florida state senator, was elected on Friday to serve as the Republican Party's new chairman. Former chair Michael Whatley is running for U.S. Senate in North Carolina.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a10c75632c95aa833e2405a19ccc24d9ed689561",
      "title": "Aspiration co-founder to plead guilty to $248M fraud scheme",
      "url": "https://techcrunch.com/2025/08/22/aspiration-co-founder-to-plead-guilty-to-248m-fraud-scheme/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T16:42:30.000Z",
      "summary_90w": "",
      "raw": "Joseph Sanberg is accused of falsely inflating revenue and fabricating a letter from Aspiration's audit committee to obtain loans, which the startup ultimately defaulted on.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2382178d70e52e98b8a9cf8c22870f36290eb6af",
      "title": "Transfer tension as Nuno faces uncertain Forest future",
      "url": "https://www.bbc.com/sport/football/articles/c0l62pnejyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T16:33:13.000Z",
      "summary_90w": "",
      "raw": "Nuno Espirito Santo's future as Nottingham Forest manager is uncertain after a breakdown in his relationship with owner Evangelos Marinakis.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42839a4c2b9fd36ea19798a06df1f631aad03a85",
      "title": "Six more people in court over alleged Palestine Action break-in at Israeli defence firm",
      "url": "https://www.bbc.com/news/articles/c3dp29705v4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T16:31:31.000Z",
      "summary_90w": "",
      "raw": "The group appear at the Old Bailey following a break-in at the defence firm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "622fbf7c1d39f8752afd168dbeb416f91d57bfd7",
      "title": "Nothing lasts forever, except maybe the Goo Goo Dolls",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5492107/goo-goo-dolls-summer-anthem-album",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T16:25:00.000Z",
      "summary_90w": "",
      "raw": "The band's frontman John Rzeznik talks about their new EP Summer Anthem and how, as he approaches 60, he might consider taking guitar lessons.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0170f4de3bba1153ca0256627c7b03786a3c46d",
      "title": "The translucent Beats Studio Buds Plus are half off",
      "url": "https://www.theverge.com/tech/764316/beats-studio-buds-plus-hoto-flashlight-lite-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T16:05:41.000Z",
      "summary_90w": "",
      "raw": "Noise-canceling earbuds are great productivity tools, blocking out noisy roommates and busy coffee shops so you can focus on studying or work. While there are a number of great options these days, few are as eye-catching like the translucent Beats Studio Buds Plus. And right now, you can buy the stylish wireless earbuds for just $84.99 from Woot — a 50 percent discount and the best price we’ve seen outside of a brief drop to $63 earlier in June.\nThe wireless earbuds are some of our favorites, and not just because they look cool. Despite the fact Apple owns Beats, they play well with both iOS and Android devices. They don’t support every software feature — like Apple’s automatic device switching — but they still offer perks like one-tap pairing and integration with each platform’s respective Find My networks. Their sound quality also comes close to matching the latest AirPods Pro, and their active noise-cancellation does a good job of tuning out distractions — even if it’s not as powerful as Apple’s premium earbuds.\nThe Beats Studio Buds Plus are also comfortable, arriving with four swappable silicone ear tips. You also get IPX4 water resistance, as well as up to six hours of battery life on a single charge with ANC enabled. While we wish they also offered wireless charging and multipoint Bluetooth connectivity, all in all they’re a well-rounded option that can help you focus while looking good — especially if you own both iOS and Android devices.\nRead our Beats Studio Buds Plus review.\nBeats Studio Buds Plus\nThe Beats Studio Buds Plus offer better sound and noise cancellation than the original pair, and they now come in a unique translucent color option. Read our review.\n\nWhere to Buy:\n\n $169.95 $84.95 at Woot\n $169.95 $99.95 at Amazon\n $169.95 $99.99 at Best Buy\n\n\n\nSome more ways to save\nYou can buy the Hoto Flashlight Lite for $31.99 ($8 off) at Amazon, which matches its best price to date. The portable flashlight offers multiple adjustable brightness settings that reach up to 1,000-lumens. It also supports USB-C recharges and sports a useful zooming feature that lets you switch between a floodlight and a spotlight mode, which reaches up to 200 meters when focused.\nThe latest Blink Video Doorbell is on sale for $39.99 ($30 off) at Amazon, Best Buy, and Target, which is its second-best price to date and $10 shy of its all-time low. The basic video doorbell is a solid upgrade over the original, adding a wide 150-degree field of view, a better 1440p image resolution, and a 1:1 aspect ratio so you get a head-to-toe view of whoever is on your porch. The doorbell also comes with a Sync Module so you can store clips locally and, if you pay for $3 monthly subscription, adds person detection.\nAs a part of its new Labor Day sale, MasterClass is offering new and returning subscribers up to 50 percent off one year of its annual membership through September 1st. The membership typically starts at $120, so that means you’ll be paying as low as $60 instead. The deal also applies to higher tiers, which grant access to offline mode and streaming on multiple devices. The platform offers over 200 classes taught by world leaders, celebrities, and various experts across tech, sports, business, entertainment, health, games, food, and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abba3e8df4d89d1a4f89f8e5d34dd56135785fbc",
      "title": "Fed Chair Jerome Powell signals possible rate cut, sending stocks sharply higher",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509941/jerome-powell-federal-reserve-interest-rates-jackson-hole",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T16:05:33.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve chairman Jerome Powell signaled a possible interest rate cut in the months to come, sending stocks sharply higher.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "443480c0b26f17441f254ce95e728df86cb5dab5",
      "title": "She travelled eight hours by bus for violin lessons. Now she's playing Wembley with Coldplay",
      "url": "https://www.bbc.com/news/articles/c93de1y9nl5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T15:59:13.000Z",
      "summary_90w": "",
      "raw": "Musician Pathrycia Mendonça will play with the band as part of Venezuela's Simón Bolívar Symphony Orchestra.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "066d763e643f414d172ecd52de08eef7bce90001",
      "title": "Are girls being left behind in school? Experts are sounding the alarm",
      "url": "https://www.bbc.com/news/articles/cx2q189kv7yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T15:57:56.000Z",
      "summary_90w": "",
      "raw": "Girls are still more likely to pass GCSEs, but why is the gender gap now the lowest on record?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "39e1f8fa1f2f81ae66443cb0fcbdb02c23cdb86c",
      "title": "YC-backed Oway raises $4M to build a decentralized ‘Uber for freight’",
      "url": "https://techcrunch.com/2025/08/22/yc-backed-oway-raises-4m-to-build-a-decentralized-uber-for-freight/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T15:53:52.000Z",
      "summary_90w": "",
      "raw": "The thousands of trucks zipping along U.S. highways are often only about half full -- something Oway wants to change with its \"ride-share for freight\" software.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d979af9abb216f1c1c1d7ba81c7a9f3fd4837834",
      "title": "Silksong is out soon, and indie games are getting out of the way",
      "url": "https://www.theverge.com/news/764346/hollow-knight-silksong-indie-game-delays-cloverpit-faeland-aeterna-lucis",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T15:53:34.000Z",
      "summary_90w": "",
      "raw": "Yesterday, Hollow Knight: Silksong developers Team Cherry announced a September 4th release date for the long-awaited game, and indie developers are announcing delays to get out of the way of the launch. Silksong is a full sequel to the excellent Hollow Knight and is currently the most wishlisted game on Steam, so it’s likely going to be very popular when it’s finally available.\nPanik Arcade, which was set to release its “hellish gambling roguelike” CloverPit on September 3rd, has pushed the game’s launch to September 26th. “We poured our hearts into our little game so of course we want to give it the best possible shot,” Panik Arcade says. “We hope you can understand — we’ll use the extra time of course to polish the game even further and we hope for your support at launch either way.”\n\n\n🚨GAME DELAY 🚨\ndue to Silksong (can’t wait to play) launching just a day after CloverPit, we decided to delay our release\nour new release date is 26th Sept\nwe poured our hearts into our little game, so we want to give it the best possible shot. thanks for understanding!! pic.twitter.com/QwKwBrBuFJ\n— Panik Arcade 🕹️ making CloverPit 🍒🎰 (@PanikArcade) August 22, 2025\n\n\nTalegames, which was planning to launch the adventure RPG Faeland out of early access on September 9th, is postponing the release and plans to share a new date soon. “This wasn’t an easy decision,” Talegames says. “We’ve poured years of work and love into Faeland, and we want to make sure it arrives at a time when it can receive the attention and care it deserves.” \n\n\nOur v1.0 launch was set for Sept 9, but with today’s Silksong news we’ve made the tough call to postpone. A new date is coming soon, thank you all for the love and support ❤️ pic.twitter.com/Lh07iGLHHn\n— TALEGAMES (@Talegamesnews) August 21, 2025\n\n\nAeternum Game Studios, which is developing a 2D sidescrolling game focused on combat and exploration called Aeterna Lucis, is postponing a planned September release to sometime in 2026 because the game “wouldn’t have the visibility it deserves.” Aeternum also says that it still doesn’t have the development kits to “ensure a simultaneous release on all next-generation platforms,” so the delay means it can “bring you Aeterna Lucis at the right time.”\n\n\npic.twitter.com/CUomiRcsZU\n— Aeternum Game Studios (@aeternathegame) August 22, 2025\n\n\nFrogteam Games, which is working on the 2D exploration game Stomp and the Sword of Miracles, is delaying a planned August 29th demo launch, as spotted by Aftermath. “Trying to market an indie game is already really, really hard,” Frogteam Games says. It’s the task of trying to get attention in a deep sea of other amazing games. In the case of Silksong, however, I feel like a little krill trying to not get eaten by a blue whale. Tiny devs like me rely on word of mouth and streamers to bring in visibility, and everyone’s gonna be busy with Silksong for quite a while!\n\n\nHead's up – the Stomp demo has had to be suddenly delayed. I'll keep you all updated when I know what the plan is.\n— Stomp and the Sword of Miracles (@frogteam.games) 2025-08-21T16:29:41.176Z\n\n\nEven with these delays, early September is still packed with notable game releases, including Necrosoft Games’s Demonschool (September 3rd), Rogue Factor’s Hell is Us (September 4th), and Bloober Team’s Cronos: The New Dawn (September 5th). We’ve reached out to the developers of those games to ask if they are changing their release plans because of Silksong.\nUpdate, August 22nd: Added the delay for the demo of Stomp and the Sword of Miracles.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "553c54c9a95bf6b2f53d07fe9eac88648f9b5bef",
      "title": "Russia trying to stop meeting on peace and prolong war, says Zelensky",
      "url": "https://www.bbc.com/news/articles/ckgjpmg4r23o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T15:46:22.000Z",
      "summary_90w": "",
      "raw": "Volodymyr Zelensky urges Western allies to impose fresh sanctions on Moscow if it shows no interest in peace.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c143503a12578cf6e33314dbfbb862387d36bc10",
      "title": "Gaza mother blames famine for halving daughter's weight",
      "url": "https://www.bbc.com/news/videos/ce87px1yd23o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T15:39:49.000Z",
      "summary_90w": "",
      "raw": "Rida Hijjeh says her daughter has lost 9.5kg, as famine is confirmed in Gaza City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25fb4cf4bf112c6dfdb1626749959064ee4b0b1a",
      "title": "Royal Mail and DHL halt some deliveries to US over tariffs",
      "url": "https://www.bbc.com/news/articles/cx2p17xypgko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T15:38:48.000Z",
      "summary_90w": "",
      "raw": "Services including Royal Mail and  DHL say they are suspending deliveries until they have proper systems in place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18a61be248e0107061cb76ddc0c09751d591778c",
      "title": "Google makes it easier to edit Drive videos with a new Vids shortcut button",
      "url": "https://techcrunch.com/2025/08/22/google-makes-it-easier-to-edit-drive-videos-with-a-new-vids-shortcut-button/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T15:33:29.000Z",
      "summary_90w": "",
      "raw": "Now Workspace users can initiate a video edit using the Vids app directly from the Google Drive interface.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5b29dbd58d34fa5b21551ca33ea37862c4331754",
      "title": "UN agency says Gaza famine is direct result of Israel’s actions and may amount to war crime – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/22/famine-benjamin-netanyahu-palestine-gaza-israel-war-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:33:27.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed, you can read more on this story here\nMothers in Gaza have resorted to using legume water and herbs as alternative to infant milk amid Famine, charity warns\nDr. Ra’ed Al-Baba, who works at Al Awda Hospital run by ActionAid’s partner Al-Awda, said usage of alternatives to infant milk had “catastrophic” consequences.\nThere are mothers who resort to using legume water, herbs, and other alternatives to infant milk because of the severe shortage. These methods carry catastrophic risks, causing gastroenteritis, food poisoning, delayed growth, severe anaemia, and even the inability to move. We have seen cases of extreme dehydration from polluted water mixed with these substitutes. This is not survival, this is slow death.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ac8d83a42f82db803f1b6d815b87f854bea023a",
      "title": "GYG shares: Guzman y Gomez plummets on ASX but expansion still on the menu as increased US losses rattle investors",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/guzman-y-gomez-keeps-expansion-on-the-menu-despite-increased-us-losses-rattling-investors",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:33:25.000Z",
      "summary_90w": "",
      "raw": "GYG shares plummet by more than 20% on ASX despite global sales in the Sydney-based restaurant chain passing $1bn, as co-CEOs say ‘we are seeing momentum’ in American market\n\nGet our breaking news email, free app or daily news podcast\n\nMexican-themed chain Guzman y Gomez plans to open at least 15 restaurants in the US despite doubling its losses on its “relentless” bid to expand into the competitive American market.\nDespite its struggles in the US, GYG recorded more than $1bn in sales across its network for the first time and more than doubled its net profit to $14.5m in the 12 months to July – its first year on the Australian Stock Exchange (ASX).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e50554c43723503bc33250f59a68a90e885544e9",
      "title": "She's bracing and saving to pay $2,800 a month for ACA health insurance next year",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/22/nx-s1-5511182/aca-tax-credits-health-insurance-open-enrollment",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T15:06:50.000Z",
      "summary_90w": "",
      "raw": "Raiding retirement savings. Pondering job changes or even marriage. People who buy their own health insurance are strategizing ahead of major price hikes in 2026. Open enrollment starts Nov. 1.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d92dfb78a8b777acd6e4d119dafee3e02fdd7c91",
      "title": "‘I’m not against development, but …’: Sydney’s plans for greater density face a morass of confusion and hostility",
      "url": "https://www.theguardian.com/australia-news/2025/aug/23/sydney-development-plans-increase-nsw-housing-density-opposition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:00:37.000Z",
      "summary_90w": "",
      "raw": "NSW has big plans to encourage more properties to be built, but it’s far from easy to satisfy councils, planning experts, residents and would-be residents\n\nGet our breaking news email, free app or daily news podcast\n\nAlmost everyone agrees that Australia needs more housing, and nowhere more so than in Sydney, which has struggled to escape its reputation as one of the most expensive cities in the world to find somewhere to live.\nThe New South Wales planning minister, Paul Scully, says the problem of housing supply has been ignored for far too long.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a46c2168acd19a904d6a32b56d8347f51884e181",
      "title": "X pulls the ability to like and follow from its developer API’s free tier",
      "url": "https://techcrunch.com/2025/08/22/x-pulls-the-ability-to-like-and-follow-from-its-developer-apis-free-tier/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T14:57:03.000Z",
      "summary_90w": "",
      "raw": "X is making it harder for spammers with these API changes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65191e8d4a794120955e083139e06ff901c20457",
      "title": "UN-backed experts declare famine in and around Gaza City",
      "url": "https://www.theguardian.com/world/2025/aug/22/ipc-declares-famine-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:34:29.000Z",
      "summary_90w": "",
      "raw": "IPC says famine is ‘entirely man-made’ and immediate response is needed or avoidable deaths will soar\n\nIsrael-Gaza war – latest updates\n\nAn “entirely man-made” famine is taking place in Gaza’s largest city and its surrounding area amid deteriorating conditions that threaten an exponential increase in deaths across the devastated territory, UN-backed experts have declared.\nThe Integrated Food Security Phase Classification (IPC), a globally recognised organisation that classifies the severity of food insecurity and malnutrition, found that three key thresholds for famine had been met, signalling a major escalation of the humanitarian crisis in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "16446152f8b78654e58d5fbc07e188e1c57c68fc",
      "title": "Developer gets prison time for sabotaging former employer’s network with a ‘kill switch’",
      "url": "https://techcrunch.com/2025/08/22/developer-gets-prison-time-for-sabotaging-former-employers-network-with-a-kill-switch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T14:26:34.000Z",
      "summary_90w": "",
      "raw": "The ex-developer was convicted of planting malicious code designed to crash its servers in the event that he was fired.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "15cffeb1fbb1437d2c2611f264b00a29e1b77c48",
      "title": "No Putin-Zelenskyy meeting planned until agenda is agreed, Russia’s foreign minister says – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/22/ukraine-war-latest-updates-zelenskyy-putin-trump-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:20:47.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\nSpeaking alongside Zelenskyy, Nato’s Rutte said the alliance’s support for Ukraine remained “unwavering” and “continues to grow,” with more plans to provide Nato funding to ensure “a crucial flow of lethal US weapons to Ukraine.”\nHe lauded the outcome of Monday’s talks at the White House, saying that Trump made it clear “the United States will indeed be involved in providing security guarantees for Ukraine.”\n“Robust security guarantees will be essential, and this is what we are now working to define, so that when the time comes you for you to enter that bilateral meeting, you have the unmistakable force of Ukraine’s friends behind you, ensuring that Russia will uphold any deal, and will never ever again, attempt to take one square kilometre of Ukraine.”\n“The Budapest Memorandum and Minsk did not provide those security guarantees. So we clearly know what it should not be, and we are now working together – Ukraine, the Europeans, the United States – to make sure that the security guarantees are of such a level that Vladimir Vladimirovich Putin, sitting in Moscow, will never, ever try to attack Ukraine again.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57bdf1024ec5ca7bf752cb2db5731b3761d9f31c",
      "title": "New bodies found near site of Kenya's starvation cult burials",
      "url": "https://www.bbc.com/news/articles/cdrkpjk0346o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T14:19:26.000Z",
      "summary_90w": "",
      "raw": "Nine bodies have been found in fresh graves near the site of the \"Shakahola Forest Massacre\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "925fc70e2f1ddfb4d52caebc245e8c4a95843fb0",
      "title": "Waymo approved to start autonomous vehicle testing in New York City",
      "url": "https://techcrunch.com/2025/08/22/waymo-approved-to-start-autonomous-vehicle-testing-in-new-york-city/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T14:19:05.000Z",
      "summary_90w": "",
      "raw": "It's the first permit of its kind, and a crucial step along the path toward launching a true robotaxi service in the Big Apple.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0503db1b7d744a70709e2965769ac91e2d2b6d0c",
      "title": "Prigozhin knew he was ‘doomed’ after failed rebellion, says mother",
      "url": "https://www.theguardian.com/world/2025/aug/22/prigozhin-knew-he-was-doomed-after-failed-rebellion-says-mother",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:12:23.000Z",
      "summary_90w": "",
      "raw": "Violetta Prigozhina, 85, says she warned her son not to defy Putin’s authority before he was killed in a plane crash\nThe Russian warlord and businessman Yevgeny Prigozhin looked “doomed” after his failed mutiny and told his mother he expected to die in the days before his private plane crash.\nPrigozhin, the founder of the notorious Wagner mercenary group, died when his business jet went down in the summer of 2023, two months after his fighters briefly seized control of the southern city of Rostov-on-Don and advanced towards Moscow in a short-lived rebellion against Russia’s military leadership.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "666a5bb9def055631917536bc63ca6369e33b62d",
      "title": "Prison conduct and contraband: Four things we learned from Erik Menendez's parole hearing ",
      "url": "https://www.bbc.com/news/articles/c3ez2j3jzgjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T14:11:41.000Z",
      "summary_90w": "",
      "raw": "A phone, candles and behaviour by the long-term US inmate factored into the refusal of his release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "229e5ba5d2982b5f1832044ba1d34d963fb76fa9",
      "title": "Thousands face deportation to danger as Trump targets temporary protections",
      "url": "https://www.theguardian.com/us-news/2025/aug/22/temporary-protected-status-tps-immigration-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:00:34.000Z",
      "summary_90w": "",
      "raw": "People with temporary protected status face possible deportation even though their home countries – including Afghanistan and Haiti – remain unsafe\nMany thousands of immigrants living in the US who came from certain countries regarded as risky or dangerous are at the mercy of US judges and the Trump administration’s agenda to slash their work authorization and protection from deportation.\nSince taking office, the Trump administration has announced the termination of temporary protected status (TPS) for citizens of seven of the 15 countries previously designated for shelter under this legal umbrella – with the Department of Homeland Security (DHS) controversially citing improved conditions in some of those places.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb225b4296115aeadcd9e886c214751ceeca6a5b",
      "title": "'My youngest child doesn't know what fruit tastes like': Gaza residents on famine",
      "url": "https://www.bbc.com/news/articles/cz602wvjv7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T14:00:26.000Z",
      "summary_90w": "",
      "raw": "A UN-backed body says more than half a million people across Gaza are facing \"starvation, destitution and death\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08fc8fc7d684e579bd0e97d815c90b37eee7033e",
      "title": "Noel Clarke loses libel case against the Guardian over sexual misconduct allegations",
      "url": "https://www.bbc.com/news/articles/cwy33g0lelno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T13:53:42.000Z",
      "summary_90w": "",
      "raw": "The award-winning actor sued the newspaper's publisher for printing allegations of sexual misconduct.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d712edeb854ece1c3babe1616de01df8221ceab",
      "title": "Nigeria deports Chinese scammers in crackdown on 'foreign-led' cyber crime",
      "url": "https://www.bbc.com/news/articles/c89059k37ezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T13:31:29.000Z",
      "summary_90w": "",
      "raw": "A total of 102 deported foreigners have been convicted of \"cyber-terrorism and internet fraud\" this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af1699a6d49f58abedeaceec64425b382eb22c78",
      "title": "FBI searches the home of former Trump adviser John Bolton",
      "url": "https://www.npr.org/2025/08/22/g-s1-84546/fbi-home-john-bolton",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T13:22:26.000Z",
      "summary_90w": "",
      "raw": "The FBI says its searches of Bolton's home and office was authorized by a court but declined to provide further details. Bolton is a frequent critic of the president.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b5cac868b1cb2985b40aa6e5956431092314002",
      "title": "Ukraine attacks pipeline that sends Russian oil to Hungary and Slovakia",
      "url": "https://www.theguardian.com/world/2025/aug/22/ukraine-attacks-pipeline-that-sends-russian-oil-to-hungary-and-slovakia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T13:11:03.000Z",
      "summary_90w": "",
      "raw": "Hungary’s foreign minister claims missile strike on energy infrastructure is ‘another attempt to drag us into war’\nUkraine has hit a key pumping station on the Druzhba oil pipeline bringing fuel to Europe from Russia, knocking out supplies to Hungary and Slovakia, the only remaining EU member states still receiving Russian oil.\nAs Ukraine targets infrastructure crucial to Moscow’s war effort in response to the Russian onslaught, the commander of Ukraine’s Unmanned Systems Forces, Robert Brovdi, announced the attack on the Unecha pumping station in the Bryansk region.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9e03a8ea15b69640e44d8d87f2582cdca770c1a",
      "title": "Belkin’s first 25W Qi2 chargers power up multiple devices",
      "url": "https://www.theverge.com/news/763659/belkin-qi2-2-25w-wireless-charging-ultracharge-pro",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Belkin’s new wireless chargers will power up compatible phones much faster. | Image: Belkin\t\n\nAfter announcing certification from the Wireless Power Consortium (WPC) a month ago, Belkin is now debuting its first three devices that support the Qi2.2 standard and faster 25W wireless charging speeds.\nThe most expensive and elaborate of the new accessories is the $129.99 Belkin UltraCharge Pro 3-in-1 Magnetic Charging Dock, which is a multi-device wireless charger designed to find a permanent spot on desks and bedside tables.\nIt features an AirPods charger on its weighted base, an Apple Watch charger sticking out the back, and an adjustable magnetic smartphone charger in the front – although that’s the only one that offers 25W charging speeds for supported devices. Wireless charging speeds will drop to 15W for devices that aren’t Qi2.2 compatible. A 45W USB-C power adapter is included so all three wireless charging pads can be used at the same time.\nSlightly cheaper is the $99.99 Belkin UltraCharge 3-in-1 Foldable Magnetic Charger, which offers similar functionality to the Pro but in a design that completely folds flat for travel. Unfolding its magnetic 25W smartphone charger reveals a spot to charge AirPods on its base, while a compact Apple Watch charger folds out from behind its Qi2.2 pad.\nIt also comes with a 45W USB-C power adapter, and will be available in two versions: one with a squared-off design and an alternate with more rounded corners.\nThe $59.99 Belkin UltraCharge 2-in-1 Foldable Magnetic Charger is nearly identical to the 3-in-1 travel model but skips the pop-up Apple Watch charger. In its place is a 5W USB-C port on the base for plugging in the charging cable for other smartwatch models. It will also be available in two different designs and include a 45W power adapter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f2d98bfe538a59f3c5891d37d92715382eca472d",
      "title": "Google made it easier to edit your Drive videos",
      "url": "https://www.theverge.com/news/764221/google-drive-video-editing-vids-shortcut",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T12:48:14.000Z",
      "summary_90w": "",
      "raw": "Google has added a Drive shortcut for Workspace users that provides a quicker way to edit videos without having to manually open them in Google Vids. When previewing a video saved in their Drive, users will now see an “Open” button at the top right corner that automatically opens the file in Google Vids, where users can then make simple edits like trimming clips, adding text or music, and more.\nThe Vids shortcut will be enabled by default and can be disabled by Workspace organization admins. It started rolling out on August 21st, but could take more than two weeks to appear for everyone. This is the latest of several  Drive improvements that Google has added for videos, having introduced a new video player in October last year, and a Gemini AI feature that summarizes Drive videos in May.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ff9346b17e7586127ea1d2f14ccc31b563e84e3",
      "title": "Google’s AI-stuffed Pixel 10 event",
      "url": "https://www.theverge.com/the-vergecast/764217/vergecast-google-pixel-10-event",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T12:45:00.000Z",
      "summary_90w": "",
      "raw": "The Pixel line has often been on the cutting edge of mobile photography. This year, that means baking AI straight into the camera app and making us grapple with all of the very messy things that means. I've been scouring the internet for sample images of the Pixel 10 Pro's AI-enhanced 100x zoom feature - Pro Res Zoom - and the early results have been all over the place. There are early samples that look great and others that make me very worried about what Google has unleashed.\nThis week on The Vergecast, we're talking all things Pixel. Victoria Song and Allison Johnson join me to discuss the launch in detail, starting with the strange, key …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6aca05fda0f07ba2ee67b96f9f1ab45fbec43193",
      "title": "Hundreds of TikTok UK moderator jobs at risk despite new online safety rules",
      "url": "https://www.theguardian.com/technology/2025/aug/22/tiktok-uk-moderator-jobs-at-risk-despite-new-online-safety-rules",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T12:40:01.000Z",
      "summary_90w": "",
      "raw": "Cuts in trust and safety team part of switch towards artificial intelligence by social media app firm\nTikTok has put hundreds of UK content moderators’ jobs at risk, even as tighter rules come into effect to stop the spread of harmful material online.\nThe viral video app said several hundred jobs in its trust and safety team could be affected in the UK, as well as south and south-east Asia, as part of a global reorganisation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok to lay off hundreds of UK content moderators ",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18ccf007cccde075d4e35fbf0ff7dc750eefbba7",
      "title": "Netflix’s Long Story Short is a more human successor to BoJack Horseman",
      "url": "https://www.theverge.com/tv-reviews/763955/long-story-short-review-netflix-bojack-horseman",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T12:30:00.000Z",
      "summary_90w": "",
      "raw": "A big reason that BoJack Horseman worked so well was contrast. It took place in a silly world of talking animals, and used that to explore deep human drama in relatable ways. It's part of what made its oddball jokes work so well, as they helped balance out the darker moments that explored topics like mental health and addiction. The same could be said for its spiritual offshoot Tuca & Bertie, which ramped up the wackiness - sexy plant ladies, ghost cakes - but didn't shy away from getting real.\nNow we have Long Story Short, which comes from much of the same creative team; it's led by BoJack creator Raphael Bob-Waksberg, while Tuca showrunne …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7bfdf1bae8e1a0caf237354fd00ad29806dc94d9",
      "title": "Italian pizzeria owner praised for tracking down ‘dine and dash’ tourists",
      "url": "https://www.theguardian.com/world/2025/aug/22/italian-restaurateur-praised-for-tracking-down-dine-and-dash-tourists",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T12:28:26.000Z",
      "summary_90w": "",
      "raw": "Michela Malatini used social media to trace two French women and presented them with their €44 bill\nAn Italian pizzeria owner has been praised for her bravery after managing to track down a pair of “dine and dash” tourists and handing them the bill.\nThe French women had enjoyed pizza and a few glasses of Aperol spritz at Ai Due Re pizzeria in Civitanova Marche, a town on the Adriatic coast, racking up a €44 bill. But they left without paying.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c3bc1705918558263346b937e104f5b8a575d93",
      "title": "US to review all 55 million visas to check if holders broke rules",
      "url": "https://www.bbc.com/news/articles/cvg04gm92d3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T11:56:02.000Z",
      "summary_90w": "",
      "raw": "A US state department official says US visa holders will face \"continuous vetting\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63510641f5fcf5e3ad1ff5a3c230f580cef0371e",
      "title": "British Airways attendant found naked and on drugs in onboard toilet",
      "url": "https://www.bbc.com/news/articles/c0l62wgpwkzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T11:54:21.000Z",
      "summary_90w": "",
      "raw": "A blood test revealed Haden Pentecost, 41, had methamphetamine and amphetamines in his system.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a063cef97ef570be04c1125a74fa0c852b8d85aa",
      "title": "New dinosaur species unearthed on Isle of Wight named after world record sailor",
      "url": "https://www.bbc.com/news/articles/c87ew7qq4wwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T10:45:09.000Z",
      "summary_90w": "",
      "raw": "The medium-sized herbivore once roamed the floodplains of what is now the Island's south-west coast.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "390fd51e1d57489470eeb13aab6d089d12a63f15",
      "title": "U.N.-backed panel confirms famine in Gaza. And, DOJ to send Congress some Epstein docs",
      "url": "https://www.npr.org/2025/08/22/g-s1-84522/up-first-newsletter-famine-gaza-israel-jeffrey-epstein-jan-6-riot-doj",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T10:32:18.000Z",
      "summary_90w": "",
      "raw": "A U.N.-backed panel of experts has declared that northern Gaza is suffering from famine. And, the DOJ is expected to release to Congress the first wave of documents related to its Jeffrey Epstein probe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5406781b9527067de09868d27810418aa12bc49",
      "title": "Karen Gillan joins the cast of Highlander reboot",
      "url": "https://www.bbc.com/news/articles/cq87gn3q0yvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T09:45:41.000Z",
      "summary_90w": "",
      "raw": "The Scottish actress will star alongside former Superman actor Henry Cavill in a reboot of the classic 80s movie.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a774f22b8b7aa83c9a0f3da158c48466f8db6bc3",
      "title": "Famine confirmed in northern Gaza, says U.N.-backed agency",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509964/famine-gaza-israel-middle-east-un",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T09:35:23.000Z",
      "summary_90w": "",
      "raw": "Famine has been officially declared in northern Gaza, a U.N.-backed group warns — marking the first such confirmation in the Middle East.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3523f320a472329119561d4de15f587b7665f38e",
      "title": "Thai court acquits ex-Prime Minister Thaksin Shinawatra of royal defamation charge",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511111/thailand-thaksin-court-acquits-royal-defamation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T09:27:23.000Z",
      "summary_90w": "",
      "raw": "Thailand's former Prime Minister Thaksin Shinawatra was acquitted of a royal defamation charge by a court on Friday, in a case that could have sent him to prison for up to 15 years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d2e50777871c1c54187d67c71ed62e025909adf",
      "title": "After a few chilly years, the real estate market is looking a little warmer",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5510058/housing-market-mortgage-rates-homebuilding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T09:00:00.000Z",
      "summary_90w": "",
      "raw": "High mortgage rates cooled home sales over the last few years. But data released this week shows signs that things may be thawing a bit.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3d1e7b78075c22105d4b0bf1e730c6af6090527e",
      "title": "She's cared for America's elderly for decades. Trump wants her gone by Sept. 8",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5502439/trump-immigration-tps-health-care",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has moved to end temporary protected status for immigrants from Honduras and other countries. Among them are health care workers tending to older and disabled people.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b2515d6d73547dd2a2f97e1974d1f98e219ed2ca",
      "title": "What happens when people stop trusting their government's economic data?",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5499343/what-happens-when-people-stop-trusting-their-governments-economic-data",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T08:46:55.000Z",
      "summary_90w": "",
      "raw": "What happens when people stop trusting their government's economic data? Planet Money reports on what happened in Greece.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "0e68f2be1fb5d9239c71d200b1d3bc0d4812313f",
      "title": "Largest retailers in the U.S. have raised prices on some items",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509940/largest-retailers-in-the-u-s-have-raised-prices-on-some-items",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T08:45:57.000Z",
      "summary_90w": "",
      "raw": "Some of the largest retailers in the U.S., including Walmart, Home Depot and Target, have had to raise prices on some items due to tariffs. They've kept prices down on other items.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bb332494d436697134b56bf651045308769565eb",
      "title": "Flower girls and bridesmaids – the dogs playing a starring role in weddings",
      "url": "https://www.bbc.com/news/articles/cj3ly6e5xe8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T08:02:03.000Z",
      "summary_90w": "",
      "raw": "Many couples are including their pet in their big day, we talk to some whose dogs have played a key role.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d3ce06ad68f6c1d31ad5029e7c2414ab6b64aec",
      "title": "Peter Dutton rules out return to politics in rare public appearance – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/22/australia-news-live-penny-wong-gaza-israel-netanyahu-anthony-albanese-childcare-safety-education-database-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T07:16:38.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed.\nCoalition says if Labor tries to raise taxes after roundtable it would be ‘major breach of faith’ with Australian people\nJames Paterson, the shadow minister for finance, says if the government moves to increase taxes it would be a “major breach of faith with the Australian people”. Paterson spoke to RN Breakfast after the conclusion of yesterday’s roundtable, where Chalmers said there was a longer-term process to consider major reform on the matter.\nNo Australian voted for higher taxes at the election, and so it seems that Jim Chalmers isn’t on the same page as the prime minister because he was unwilling to repeat that commitment at his press conference yesterday. And he is leaving open the door to higher taxes, and particularly on people’s retirement savings, on family trusts, on a whole range of other things.\nWhen those questions were raised during the election campaign, Jim Chalmers and the Labor party said that was a Liberal Party scare campaign. So, if they go ahead and try and increase taxes, that’ll be a major breach of faith with the Australian people.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a7b58641192775bf0db50cb18ac0446cc4dd8e55",
      "title": "Woman charged with concealing birth of deceased child after infant’s body found in WA drain",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/woman-charged-with-concealing-birth-of-deceased-child-after-infants-body-found-in-wa-drain-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T06:28:51.000Z",
      "summary_90w": "",
      "raw": "The infant’s mother, in her 30s, had been assisting police with enquiries since Wednesday\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA woman has been charged with concealing the birth of a deceased child after the body of a baby boy was found in a storm water drain in Perth.\nThe woman, in her 30s, had been assisting police with enquiries since Wednesday following the discovery of the infant on Monday afternoon.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63357e748ff7f5b919bc2312ae945ead920a3471",
      "title": "WHO warns of risks of extreme heat in the workplace",
      "url": "https://www.bbc.com/news/articles/c5ylwxl5n01o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T06:08:54.000Z",
      "summary_90w": "",
      "raw": "Workers, employers and governments need to adapt to a more extreme climate, the organisation says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c149f74cfe1f889734c9026275128145e9f32df9",
      "title": "OpenAI announces New Delhi office as it expands footprint in India",
      "url": "https://techcrunch.com/2025/08/21/openai-announces-new-delhi-office-as-it-expands-footprint-in-india/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T06:06:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has started hiring in India as it looks to expand its presence in the fast-growing South Asian tech market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1881ae6e8a3d3dd75d4ce60defa5838ffd46ee29",
      "title": "Outback Wrangler star agreed helicopter pilot had ‘thrown everyone under the bus’ in covert recording played in court",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/matt-wright-outback-wrangler-bugged-home-recordings-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T05:52:55.000Z",
      "summary_90w": "",
      "raw": "Matt Wright has pleaded not guilty to three counts of attempting to pervert the course of justice\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe reality TV star Matt Wright’s home was bugged with listening devices and phone taps for three months as police sought evidence of a cover-up following a fatal helicopter crash, a jury has heard.\nCovert recordings of Wright’s conversations have played a key part in his trial at the Northern Territory supreme court in Darwin.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bcd2af7ceb9cfebc90f202fafbc195d5ca897f7",
      "title": "Friday briefing: Is Israel’s plan for Gaza City a full-scale assault – or political theatre?",
      "url": "https://www.theguardian.com/world/2025/aug/22/first-edition-gaza-city-israel-attack",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T05:43:33.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: After Israeli officials announced a stepped-up military operation in the city, Palestinians and the world wait to see what happens next\n\nGood morning. Israel claims to have launched the first stages of a sweeping military operation to conquer Gaza City – the administrative heart of the strip – warning that a million people could be forced from their homes, sparking a wave of fear among residents.\nIn the past few nights Palestinians have described relentless bombardments, with thousands already scrambling to escape, while others are too starved or frail to evacuate.\nUK news | Protesters at the next mass demonstration against the ban on Palestine Action will withhold their details from officers to force en-masse processing at police stations in an effort to make it “practically impossible” to arrest everyone.\nUkraine | Moscow threw Donald Trump’s Ukraine peace initiative into disarray on Thursday, insisting it must have a veto over any postwar support for the country as its forces carried out a large-scale overnight missile barrage.\nImmigration | Refugee support organisations have been forced to install safe rooms in their premises, relocate to less visible sites and in some cases close their offices in response to the threat of far-right violence, the Guardian can reveal.\nUS news | A federal judge in Miami late on Thursday ordered the closure of the Trump administration’s notorious “Alligator Alcatraz” immigration jail within 60 days and ruled that no more detainees were to be brought to the facility while it was being wound down.\nHealth | Baby food manufacturers have been given 18 months to improve the quality of their products in England amid mounting concerns that leading brands are nutritionally poor.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9feaa13a2ff51e16da76cba1672c3b3940f306fd",
      "title": "Billy Connolly reveals inspirations behind new art collection - including Elton John's leg",
      "url": "https://www.bbc.com/news/articles/c7vlq1v2v9ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T05:17:29.000Z",
      "summary_90w": "",
      "raw": "Sir Billy has released four new artworks recalling some of the fondest memories from his life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "633a1250dc7aa01e1bb4e94d30f97a1ba4ba6994",
      "title": "Our brother was killed in the Shoreham air crash. I will never unhear Mum's wail",
      "url": "https://www.bbc.com/news/articles/cd0dyx2pld8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T05:05:39.000Z",
      "summary_90w": "",
      "raw": "Ten years after the Shoreham Airshow crash bereaved families describe how their lives changed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d76c8a461c767f2c70115cb5ebf61937466b39e4",
      "title": "Proposed Ukraine land concessions are Putin's trap, EU's top diplomat tells BBC",
      "url": "https://www.bbc.com/news/articles/cp8zdezm507o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T05:00:15.000Z",
      "summary_90w": "",
      "raw": "Kaja Kallas' warning comes as Donald Trump sets a two-week period to assess peace talks between Moscow and Kyiv.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T04:56:01.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df32adc48d8de520c7f8e3beb96fc3a33dc37bf4",
      "title": "Thailand former PM cleared of royal insult charge but Shinawatra dynasty’s fate still hangs in balance",
      "url": "https://www.theguardian.com/world/2025/aug/22/thailand-former-pm-thaksin-shinawatra-royal-insult-lese-majesty-court-case",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T04:38:30.000Z",
      "summary_90w": "",
      "raw": "Lese-majesty case against Thaksin Shinawatra is dismissed, but his daughter Paetongtarn will hear next week if she will be removed as prime minster\nA criminal court in Thailand has dismissed a case accusing former prime minister Thaksin Shinawatra of defaming the monarchy, the first of three court cases that could decide the fate of one of the country’s prominent political families.\nThaksin was accused of insulting the monarchy during an interview with South Korean newspaper Chosun Ilbo in 2015.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b163c9a8093e4c1f4948977e309e2e1d8ae19193",
      "title": "At least 18 killed and dozens injured in separate Colombia attacks",
      "url": "https://www.bbc.com/news/articles/cwypw0xvdk5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T03:52:25.000Z",
      "summary_90w": "",
      "raw": "A car bomb killed six people in Cali while a downed police helicopter left 12 officers dead.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e7b9d354350303b743edc7e9ec3cd2d754f96ce0",
      "title": "Indonesia working on details of plan to treat 2,000 people from Gaza amid concerns about right to return",
      "url": "https://www.theguardian.com/world/2025/aug/22/indonesia-plans-details-treat-2000-injured-palestinians-galang-island",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:17:11.000Z",
      "summary_90w": "",
      "raw": "Security ministry and the ministries of health and foreign affairs have met to discuss how the controversial proposal to treat Palestinians would work\nThe Indonesian government is working on plans to treat 2,000 people from war-ravaged Gaza, holding a series of inter-ministerial discussions to discuss logistics, legality and foreign policy implications relating to the highly sensitive proposal, according to a senior government official.\nIndonesia announced earlier this month that it would provide temporary medical assistance to 2,000 Palestinians from Gaza, with the uninhabited island of Galang identified as one possible site. Located just south of Singapore, the island was once home to a former camp for Vietnamese refugees and most recently the site of a pandemic hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "695df91694c9a4635aaad2a15bb33841d2e09a25",
      "title": "Anger in Italy over non-consensual photos of women shared online",
      "url": "https://www.bbc.com/news/articles/ce874j4ye3no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T01:59:57.000Z",
      "summary_90w": "",
      "raw": "The My Wife Facebook group had 32,000 members before it was shut down for violating adult sexual exploitation policies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da18fa84cafeeab92f9444caff810ebc751fabcb",
      "title": "OpenAI lawyers question Meta’s role in Elon Musk’s $97B takeover bid ",
      "url": "https://techcrunch.com/2025/08/21/openai-lawyers-question-metas-role-in-elon-musks-97b-takeover-bid/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T00:31:38.000Z",
      "summary_90w": "",
      "raw": "OpenAI says that Elon Musk met with Meta CEO Mark Zuckerberg to discuss a $97 billion takeover bid of the ChatGPT-maker.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "efd5ea471818c6de6eb1ab6e3285104b0b7edf80",
      "title": "Meet the England players chasing glory at Women's Rugby World Cup",
      "url": "https://www.bbc.co.uk/sport/extra/cg0xeaglwz/the-red-roses?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T00:00:00.000Z",
      "summary_90w": "",
      "raw": "England's 32-player squad for a home Women's Rugby World Cup contains experience and star quality.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a19bd4c11aee79f28f9817b4d4acae3485832c57",
      "title": "The race for the two miles-a-second super weapons that Putin says turn targets to dust",
      "url": "https://www.bbc.com/news/articles/cgeqj1q8gj4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T23:24:37.000Z",
      "summary_90w": "",
      "raw": "Russia and China are leading the global race in hypersonic missiles - how worried should we be that the US is playing catch up and the UK has none?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90c01b64500f2a39e171e36fc3f33564e75c3508",
      "title": "Anduril, Blue Origin to study how to transport cargo from orbit to Earth for the Pentagon",
      "url": "https://techcrunch.com/2025/08/21/anduril-blue-origin-to-study-how-to-transport-cargo-from-orbit-to-earth-for-the-pentagon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T22:11:37.000Z",
      "summary_90w": "",
      "raw": "Blue Origin and Anduril notched small contracts that could revolutionize how the Pentagon transports cargo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d419fd4a38f9a4a92cf3111c0038586a0487cee4",
      "title": "The 95-year-old POW who wants to return to North Korea to die",
      "url": "https://www.bbc.com/news/articles/c1jnk1dr5pgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T22:04:55.000Z",
      "summary_90w": "",
      "raw": "Ahn Hak-sop failed in his attempt to cross the border, after spending most of his life in South Korea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "162b0de56c793447c543bb3275849e41ae063c29",
      "title": "As India bans real-money games, Dream Sports, MPL start pulling the plug",
      "url": "https://techcrunch.com/2025/08/21/as-india-bans-real-money-games-dream-sports-mpl-start-pulling-the-plug/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T20:56:57.000Z",
      "summary_90w": "",
      "raw": "Several Indian startups, including Dream Sports, MPL, and Zupee, are shutting down their real-money games after parliament passed a bill banning such games.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d35176ac7be0a3646a78528f461db5cea32a0413",
      "title": "Ecosia has offered to take ‘stewardship’ of Chrome. And it’s not a bad idea.",
      "url": "https://techcrunch.com/2025/08/21/ecosia-has-offered-to-take-stewardship-of-chrome-and-its-not-a-bad-idea/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T20:02:47.000Z",
      "summary_90w": "",
      "raw": "Berlin-based nonprofit search engine Ecosia has asked a U.S. judge to turn Chrome into a foundation it controls, funding billions in climate projects.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b3b5397a92eb6b3a6eeb9c089d4b275d72eef3cb",
      "title": "Gas power plants approved for Meta’s $10B data center, and not everyone is happy",
      "url": "https://techcrunch.com/2025/08/21/gas-power-plants-approved-for-metas-10b-data-center-and-not-everyone-is-happy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T19:52:20.000Z",
      "summary_90w": "",
      "raw": "Meta's massive data center will draw power from three gas-fired power plants producing 2.25 gigawatts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d05a651266e1de84da405c6574632a3cf020af4",
      "title": "Elon Musk’s X may finally settle $500M severance lawsuit",
      "url": "https://techcrunch.com/2025/08/21/elon-musks-x-may-finally-settle-500m-severance-lawsuit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T19:25:22.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's X is settling a severance lawsuit with former Twitter employees.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b336670a975129ffd56fe66f37d227b67af45476",
      "title": "StrictlyVC at TechCrunch Disrupt 2025: Inside the LP Track",
      "url": "https://techcrunch.com/2025/08/21/strictlyvc-at-techcrunch-disrupt-2025-inside-the-lp-track/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T18:33:39.000Z",
      "summary_90w": "",
      "raw": "In an era of extended exit timelines, slowed distributions, and increasingly selective LPs, the conversations behind closed doors matter more than ever.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b656f6b075e83af7feb2ce5978ba62a5ad897cc4",
      "title": "Struggling fusion power company General Fusion gets $22M lifeline from investors",
      "url": "https://techcrunch.com/2025/08/21/struggling-fusion-power-company-general-fusion-gets-22m-lifeline-from-investors/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T18:12:29.000Z",
      "summary_90w": "",
      "raw": "General Fusion pleaded for new funding in May after it laid off 25% of its staff. The new round buys it precious months to pursue its scientific milestones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a34303f579ebe6a6d5961f3a399a7f06fc17c0e2",
      "title": "UN and Red Cross warn of catastrophe if Israel launches Gaza City offensive",
      "url": "https://www.theguardian.com/world/2025/aug/21/gaza-city-offensive-would-be-death-sentence-for-israeli-hostages-say-relatives",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T18:10:39.000Z",
      "summary_90w": "",
      "raw": "Netanyahu tells soldiers he has approved takeover plan as aid groups advised to prepare for forced displacement\nThe International Red Cross and UN have warned of an impending catastrophe in the Gaza Strip if Israel launches an offensive to take over Gaza City, as the Israeli military told medical and aid groups in the Palestinian territory to prepare for imminent forced displacement.\nAt the same time a concerted campaign of international opposition to Israel’s defiance of ceasefire calls and its approval of a huge new illegal settlement construction in the occupied West Bank gathered pace, with the UK summoning Israel’s ambassador and joining 20 other countries in condemning the settlement plan as a “violation of international law”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f1cf0da37a9c029d0490cf7a278153a72c2ebb56",
      "title": "Weekly quiz: Why was a Swedish church moved on giant trailers?",
      "url": "https://www.bbc.com/news/articles/cly4092yzymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:53:36.000Z",
      "summary_90w": "",
      "raw": "How much attention did you pay to what happened in the world over the past seven days?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e36eaa894d587d79f948705831112c742adba1a",
      "title": "With Fed under pressure, Jerome Powell prepares for a high-stakes speech",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509586/federal-reserve-jerome-powell-jackson-hole-speech",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T17:27:32.000Z",
      "summary_90w": "",
      "raw": "The Fed chair will speak Friday at an annual economic symposium in Jackson Hole, Wyo.  The speech comes as the central bank is under mounting pressure from the White House to lower interest rates.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7039e9228cf5bee0b2309fd7135f9a0da82a37cd",
      "title": "If a Putin-Zelensky summit takes place, where could it be?",
      "url": "https://www.bbc.com/news/articles/cedvexq7z8zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T16:45:29.000Z",
      "summary_90w": "",
      "raw": "Geneva, Istanbul and Budapest have been put forward as potential locations - but bilateral talks still remain a long way off.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23b8d5e13b3f37f333521af3e6e3f49c2ba6f4aa",
      "title": "Walmart says tariff costs are rising 'each week' and will continue",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509592/walmart-tariff-costs-rising-earnings",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T15:55:32.000Z",
      "summary_90w": "",
      "raw": "The world's largest retailer — like many others — has been absorbing most of the increased costs, but raising prices of some goods.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "79dea3c70366ff8875f506ec6888ff06fe40f31a",
      "title": "'I regret that I didn't fight harder,' former labor secretary Robert Reich says",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5507068/i-regret-that-i-didnt-fight-harder-former-labor-secretary-robert-reich-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T15:30:39.000Z",
      "summary_90w": "",
      "raw": "Reich served under President Clinton from 1993 to 1997. He opens his new memoir, Coming Up Short, with an apology on behalf of the Baby Boom generation for failing to build a more just society.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7571ab87fd83998490d50825567d17e7746dbe56",
      "title": "Bolsonaro given 48 hours to explain alleged plans to flee to Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/21/bolsonaro-given-48-hours-to-explain-alleged-plans-to-flee-to-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T14:16:57.000Z",
      "summary_90w": "",
      "raw": "Brazilian supreme court judge sets ultimatum after police claim far-right populist sought to flee to avoid punishment over failed coup\nA supreme court judge has given Brazil’s ex-president, Jair Bolsonaro, 48 hours to explain police claims he was planning to flee to Argentina to avoid punishment for allegedly masterminding a failed coup after losing the 2022 election.\nBolsonaro’s trial for the alleged attempt to seize power is scheduled to conclude early next month. The far-right populist faces more than four decades in prison if found guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5348838958b63f7ff489cac1639e7b9602dd81dd",
      "title": "There are three more species of giraffe than previously thought - but can you spot the difference?",
      "url": "https://www.bbc.com/news/articles/c2l7wxpxn0eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T13:29:07.000Z",
      "summary_90w": "",
      "raw": "Giraffes have always been thought to be one species, but scientists now say there are four.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee2bdf53de52a89aa4268fa884abea9c6054098e",
      "title": "Rescued baby gorilla recovers from smuggling ordeal",
      "url": "https://www.bbc.com/news/videos/c93dex5643po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T13:21:38.000Z",
      "summary_90w": "",
      "raw": "Turkish authorities hope the youngster, named Zeytin, can soon be returned to his native Nigeria.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fa9e8750644016331894e5881bd1a92a6967c26e",
      "title": "Far fewer Canadians are visiting the U.S. this year, new numbers show",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5508461/fewer-canadians-visiting-us",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Canadian residents made just 1.7 million return trips by motor vehicle back into their country from the U.S. in July, a nearly 37% decline over the same month in 2024, according to Statistics Canada.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11e67f16b6483a2a58e306c44d5eb711909cb5c7",
      "title": "New Zealand to spend $3bn upgrading helicopters and ‘embarrassing’ defence planes",
      "url": "https://www.theguardian.com/world/2025/aug/21/new-zealand-seahawk-helicopters-defence-spending-planes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T03:06:28.000Z",
      "summary_90w": "",
      "raw": "Government says country will buy five Seahawk helicopters and two Airbus A321XLR aircraft\nNew Zealand will spend nearly NZ$3bn ($1.7bn) upgrading its ageing defence fleet, including replacing its “embarrassing” planes that have left multiple prime ministers grounded during international travel, the government has announced.\nThe defence minister, Judith Collins, said NZ$2bn would be spent buying five MH-60R Seahawk helicopters and another NZ$700m to buy two Airbus A321XLR aircraft.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1631129ec82de30e58c1bb8da79989ecae1ad5a0",
      "title": "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum",
      "url": "https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T01:56:35.000Z",
      "summary_90w": "",
      "raw": "Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges\nBrazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead of his judgment for allegedly plotting a military coup.\nThe far-right populist is facing a jail term of over 40 years when Brazil’s supreme court convenes next month to decide whether he is guilty of conspiring to overturn the result of the 2022 presidential election, which Bolsonaro lost to his leftwing opponent Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cfb04dfc85f883713024974762fb812fc3034d7a",
      "title": "Watch: Moments from the Menendez brothers trial in 1993",
      "url": "https://www.bbc.com/news/videos/cdxydv1rrn9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T00:31:41.000Z",
      "summary_90w": "",
      "raw": "Erik and Lyle, who are serving prison sentences for the murders of their parents, are making their case for parole this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9a0017d08b1ba5c2f4096f70fd1412d58279d5f",
      "title": "Watch: Are museums in DC too 'woke'? We ask visitors what they think",
      "url": "https://www.bbc.com/news/videos/c8ry171gvmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T21:53:59.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump has called for a review of Smithsonian museums, saying they focus too much on \"how bad Slavery was\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70614f519d0aa81fe1318fa871dba0c17e4fba94",
      "title": "US court allows Trump officials to end protected status for 60,000 migrants",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/appeals-court-trump-temporary-protected-status",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T21:48:05.000Z",
      "summary_90w": "",
      "raw": "Administration officials given legal right to move towards deportation of people from Nepal, Honduras and Nicaragua\nA federal appeals court on Wednesday sided with the Trump administration and halted for now a lower court’s order that had kept in place temporary protections for 60,000 migrants from Central America and Nepal.\nThis means that the Republican administration can move toward removing an estimated 7,000 people from Nepal whose temporary protected status designations expired on 5 August. The TPS designations and legal status of 51,000 Hondurans and 3,000 Nicaraguans are set to expire 8 September, at which point they will become eligible for removal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a9347d28be98f5a69604b97d249f804980f1f92",
      "title": "India ‘successfully tests’ nuclear-capable missile able to reach deep into China",
      "url": "https://www.theguardian.com/world/2025/aug/20/india-successfully-tests-nuclear-capable-missile-able-to-reach-deep-into-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T20:26:06.000Z",
      "summary_90w": "",
      "raw": "Agni-5 intermediate-range ballistic missile also part of Narendra Modi’s defence strategy against Pakistan\nIndia has said it successfully test-fired an intermediate-range ballistic missile that, when operational, should be capable of carrying a nuclear warhead to any part of China.\nThe Agni-5 missile was successfully launched in India’s eastern Odisha state on Wednesday, and authorities said it “validated all operational and technical parameters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed07203107a892f0cf3b4ba7318eba2658de4371",
      "title": "Watch: JD Vance heckled as he meets National Guard in Washington DC",
      "url": "https://www.bbc.com/news/videos/c8e1jrnry5ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T18:26:28.000Z",
      "summary_90w": "",
      "raw": "Protesters shouted at Vance, Pete Hegseth and Stephen Miller as they entered DC's largest rail hub.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f14cb00a74122ba106ef86ff987d9e8bc7c48b83",
      "title": "Watch: Fire rages at Milan airport check-in desk ",
      "url": "https://www.bbc.com/news/videos/cj4wz44kqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T16:18:45.000Z",
      "summary_90w": "",
      "raw": "Footage shared on social media shows a man knocked to ground after smashing an advertisement screen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34813e0f1f26d76786862ca068e099b13644362d",
      "title": "Human rights regulator criticises Met's use of facial recognition cameras",
      "url": "https://www.bbc.com/news/articles/c1kzgx4v2pko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:18:42.000Z",
      "summary_90w": "",
      "raw": "The Equality and Human Rights Commission says it believes the Met's use of the tech is unlawful.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b2c5d6d0908d4a6f91069746af4fa65f34b8ddc",
      "title": "South African minister investigated for historical racial slurs on social media",
      "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:15:35.000Z",
      "summary_90w": "",
      "raw": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts \nSouth Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid.\nMcKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts, which were still online at the time of publication.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09b5e26022a84d312516c81e1a87b0dcb2955319",
      "title": "Supporting freedom of expression is not wrong, Jimmy Lai’s lawyer tells court",
      "url": "https://www.theguardian.com/world/2025/aug/20/jimmy-lai-unwavering-intent-to-solicit-foreign-sanctions-hong-kong-court-told",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T15:23:24.000Z",
      "summary_90w": "",
      "raw": "Closing arguments made in Hong Kong media mogul’s national security trial, which has lasted more than 140 days\nA lawyer for Jimmy Lai has argued that it is not wrong to support freedom of expression, as he began his final argument in the prominent Hong Kong democracy activist and newspaper founder’s landmark national security trial.\nThe barrister Robert Pang is representing Lai in his fight against charges of colluding with foreign forces to endanger national security and conspiring with others to issue seditious publications. Lai, 77, faces up to life in prison if convicted under a national security law imposed by Beijing after anti-government protests in 2019.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca9dc3e79708726084045a1b585cddef480086c2",
      "title": "Uganda denies reports that it has struck deal with Trump to take in US deportees",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/uganda-trump-deal-immigration",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T13:01:24.000Z",
      "summary_90w": "",
      "raw": "Ugandan official said the east African country does not have the capability to take in undocumented immigrants\nUganda said it has not reached any agreement with the US to take in undocumented immigrants, contradicting reports that the east African country had struck a deal with the Trump administration to do so.\nHenry Oryem Okello, Uganda’s state minister for foreign affairs, told Reuters the country does not have the capability to take in immigrants. It comes as the US has deported migrants convicted of crimes in the US to non-native countries including South Sudan and Eswatini.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb14f806fc0e9cddfe22f88dbb7364666c65fc4d",
      "title": "Watch final trip for church on wheels as it moves to new home ",
      "url": "https://www.bbc.com/news/videos/c4g0e1nj2pqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T12:31:30.000Z",
      "summary_90w": "",
      "raw": "It took two days to move the church in Sweden's Kiruna, which was at risk at risk from ground subsidence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d878abc47011950c1db1e8d6d11ffdf056ecf28c",
      "title": "US in talks over 10% Intel stake, White House confirms",
      "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T06:37:52.000Z",
      "summary_90w": "",
      "raw": "The potential deal could involve swapping government grants for shares in the chip making giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}