{
  "version": "1756834348706",
  "generatedAt": "2025-09-02T17:32:28.706Z",
  "items": [
    {
      "id": "bdd52b1720cf8f7b1156fda93a00dbd27bfe7f43",
      "title": "Trump's use of National Guard in Los Angeles was illegal, judge rules",
      "url": "https://www.bbc.com/news/articles/c5ylyd9lkkqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T17:22:43.000Z",
      "summary_90w": "",
      "raw": "The ruling comes as Trump seeks to use National Guard troops in order to crack down on crime in other US cities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0664bc6126c556c0dc8fbecbcd2a48c56f5dccf7",
      "title": "Tesla’s fourth ‘Master Plan’ reads like LLM-generated nonsense",
      "url": "https://techcrunch.com/2025/09/02/teslas-fourth-master-plan-reads-like-llm-generated-nonsense/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T17:18:12.000Z",
      "summary_90w": "",
      "raw": "Even Elon Musk agrees it was too generic.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a4ec58825c978539b587cd58ff45fbee71600d5",
      "title": "Tesla’s new ‘Master Plan’ sounds like AI slop",
      "url": "https://www.theverge.com/tesla/769009/tesla-master-plan-4-ai-robotics-abundance",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T17:12:59.000Z",
      "summary_90w": "",
      "raw": "Tesla’s Optimus robots briefly served popcorn at the company’s diner — before going offline.\t\n\nTesla's latest \"Master Plan\" makes a few things clear right out of the gate: the company that was once known for accelerating the push toward a brighter future by popularizing electric vehicles and renewable energy is no longer interested in that quotidian stuff. Now, it's all about artificial intelligence, humanoid robots, self-driving cars, and the new buzzy catchphrase that is currently lighting up the tech world: \"sustainable abundance.\"\nAt a breezy 983 words, Master Plan 4 is the shortest entry in the company's ongoing series of mission statements. It's the first one to be posted on X, Elon Musk's social media platform, rather than on  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcf4dbd954a035980cfa5cbf263e9a5ee454ed61",
      "title": "How rural hospitals are banding together to survive",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/02/nx-s1-5519257/rural-hospitals-independent-health-networks",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T17:11:16.000Z",
      "summary_90w": "",
      "raw": "Independent and rural hospitals are collaborating with their neighbors to shore up their finances instead of joining larger health systems to stay afloat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "45b7d543b72c63eec04ab278e56b5d85ecbd9fcf",
      "title": "Putin hails ties with China as Kim Jong-un arrives in Beijing on eve of parade",
      "url": "https://www.theguardian.com/world/2025/sep/02/vladimir-putin-xi-jinping-russia-china-ties-kim-jong-un-beijing-parade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:10:54.000Z",
      "summary_90w": "",
      "raw": "Russian president says relations at ‘unprecedentedly high level’ as dozens of leaders gather for Victory Day events\nVladimir Putin has hailed Russia’s “unprecedentedly” high level of ties with China, as dozens of leaders including the North Korean dictator, Kim Jong-un, arrived in Beijing on the eve of a massive military parade intended to showcase a Chinese-led global order.\nPutin called China’s leader, Xi Jinping, a “dear friend” after the two held talks at the Great Hall of the People and then at Xi’s personal residence. “Our close communication reflects the strategic nature of Russia-China relations, which are at an unprecedentedly high level,” Putin told Xi, according to a video on the Kremlin’s Telegram channel. “We were always together then, and we remain together now.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d45e58c568bf439536406a5510255c55b204d2e",
      "title": "Father Ted co-creator Graham Linehan arrested at Heathrow over his X posts",
      "url": "https://www.bbc.com/news/articles/c07p7v2nn8mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T17:05:30.000Z",
      "summary_90w": "",
      "raw": "Graham Linehan was arrested on suspicion of inciting violence and bailed pending further investigation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a86fb99c1aff90636771d8c9a474fa379798525",
      "title": "Killer jailed for 45 years for prison officer 'execution' over seized phone",
      "url": "https://www.bbc.com/news/articles/c9d0d63pnw2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:56:16.000Z",
      "summary_90w": "",
      "raw": "Armed robber Elias Morgan waited four years to take revenge on father-of-three Lenny Scott.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cfb50ee759eb74b0c05650fe76f204f1c92bc7d6",
      "title": "Adults with learning disabilities die 20 years early, report finds",
      "url": "https://www.bbc.com/news/articles/c939311dpn1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:55:49.000Z",
      "summary_90w": "",
      "raw": "People with learning disabilities and autism die almost 20 years younger than the rest of the population.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fce0b53c8dcb92cac540487c4a8dc1a3969a1b37",
      "title": "Uber Eats partners with Best Buy to deliver your tech",
      "url": "https://www.theverge.com/news/769183/uber-eats-best-buy-partnership-deliveries",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T16:50:47.000Z",
      "summary_90w": "",
      "raw": "Uber Eats is teaming up with Best Buy to offer deliveries of the store’s selection of tech products, like headphones, chargers, laptops, gaming gear and small appliances. Starting today, you can order a product at Best Buy through the Uber Eats app and have it delivered to your doorstep the same day, adding to store’s existing partnerships with Instacart and DoorDash.\nUber Eats will house products from more than 800 Best Buy stores, a little less than the over 1,000 locations the retail chain says it operates in North America. The announcement doesn’t state whether pricing between the Uber Eats app and inside Best Buy stores will differ to make up for the delivery platform’s fees, but we’ve reached out to Best Buy with a request for more information.\nYou can find Best Buy in the Uber Eats app by going to the “Retail” or “Electronics” category, searching for Best Buy, and then browsing your local store’s selection.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55dbacbc65114ab6617267060d0ec213c017d361",
      "title": "North Korea's Kim arrives in Beijing with daughter to attend massive military parade",
      "url": "https://www.bbc.com/news/articles/c78z2p6gg1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:48:26.000Z",
      "summary_90w": "",
      "raw": "The \"Victory Day\" parade on Wednesday will see Kim rub shoulders with China's Xi Jinping, Russia's Vladimir Putin and others.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb27c87d839b9bc086f7c64c0448f9f3698f0186",
      "title": "Abject England given brutal reality check by South Africa",
      "url": "https://www.bbc.com/sport/cricket/articles/ceqyq1v5n18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:47:35.000Z",
      "summary_90w": "",
      "raw": "England are bundled out for just 131 as South Africa hand out bruising reality check to new captain Harry Brook.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14d85b4c6cecd8e73155181bb2e6476a879d675f",
      "title": "UK borrowing costs hit 27-year high adding to pressure on Reeves",
      "url": "https://www.bbc.com/news/articles/cy989njnq2wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:46:17.000Z",
      "summary_90w": "",
      "raw": "The interest rate on UK 30-year bonds hits the highest since 1998 as concerns over the economic outlook continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ccee5dd1b0e243054368010ece26c049d5a13e6",
      "title": "Outcry as Swedish ‘cultural canon’ snubs Abba and anything since 1975",
      "url": "https://www.theguardian.com/world/2025/sep/02/outcry-as-swedish-cultural-canon-snubs-abba-and-anything-since-1975",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:45:54.000Z",
      "summary_90w": "",
      "raw": "Critics argue ‘shared map’ of Swedish culture is ‘very exclusionary’ and a ‘nationalist education project’\nThe Gustav Vasa 1541 bible, Pippi Longstocking, Ikea, the right to roam, paternity leave, Sámi joiks, the Nobel prize and works by Ingmar Bergman and August Strindberg all made it into Sweden’s long-awaited, much-criticised proposal for a “cultural canon”.\nHowever, notable omissions from the list of 100 works and references that have formed Sweden’s culture and history – intended, its creators said in Uppsala on Tuesday, to establish a “shared map and compass” for Swedish citizens and new arrivals to Sweden – included Abba and anything from after 1975, a period that has seen Sweden transform into an international, multicultural society.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07715646549620450e4b081adaa0d3b069b4a69",
      "title": "Margaret Atwood releases short story critiquing book bans in Canada",
      "url": "https://www.theguardian.com/world/2025/sep/02/margaret-atwood-alberta-canada-book-ban",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:44:53.000Z",
      "summary_90w": "",
      "raw": "Author quipped she wrote ‘suitable’ piece after Alberta school ban included her novel The Handmaid’s Tale\nMargaret Atwood has released a new short story critiquing elected officials for a wide-ranging book ban in the Canadian province of Alberta. The controversial decision to remove books purportedly containing “explicit sexual content” has seen numerous works of literature swept up in the dragnet, including Atwood’s, dystopian work The Handmaid‘s Tale.\nIn a social media post, Atwood wrote that since her famed work was no longer permissible in Alberta schools, she had written a “suitable” short work for teens, adding the work was necessary because the province’s minister of education thought students were “stupid babies”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3261c1ce6e289d0c2c892a031887da26050e4df9",
      "title": "Tesla’s Dojo, a timeline",
      "url": "https://techcrunch.com/2025/09/02/teslas-dojo-a-timeline/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:39:01.000Z",
      "summary_90w": "",
      "raw": "Elon Musk doesn’t want Tesla to be just an automaker. He wants Tesla to be an AI company, one that’s figured out how to make cars drive themselves.  Crucial to that mission was Dojo, a custom-built supercomputer designed by Tesla to train its Full Self-Driving (FSD) neural networks. FSD isn’t actually fully self-driving; it can […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2ea109f825065079513d3bc6892866ac98ffb56",
      "title": "Vogue promotes Chloe Malle to top editor spot",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525663/vogue-chloe-malle-anna-wintour",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T16:38:09.000Z",
      "summary_90w": "",
      "raw": "Malle takes over as the leader of American Vogue immediately. Malle, who has been with the publication since 2011, will still report to Anna Wintour who remains Condé Nast's chief content officer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19d472e6b6f9866bc55467838678a9da55e96db0",
      "title": "Anthropic raises $13B Series F at $183B valuation",
      "url": "https://techcrunch.com/2025/09/02/anthropic-raises-13b-series-f-at-183b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:34:16.000Z",
      "summary_90w": "",
      "raw": "AI firm Anthropic's $13 billion Series F round  will be use to grow its enterprise adoption, deepen safety research, and support international expansion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "536056a5a01ce9345cf4eb255ee4637a7797b3b2",
      "title": "Anthropic is now valued at $183 billion",
      "url": "https://www.theverge.com/anthropic/769179/anthropic-is-now-valued-at-183-billion",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T16:32:12.000Z",
      "summary_90w": "",
      "raw": "Anthropic, the AI startup behind Claude and one of OpenAI’s chief competitors, emerged from the holiday weekend with big news: A completed funding round of $13 billion, awarding the company a $183 billion post-money valuation. \nThe company said in a press release that between the start of 2025 and August — less than nine months — its run-rate revenue had grown from about $1 billion to more than $5 billion. It also said it now has more than 300,000 business customers and that in the past year, its list of “large accounts,” or “customers that each represent over $100,000 in run-rate revenue,” increased sevenfold.\nAs for Claude Code, one of the chief moneymakers Anthropic has been banking on, the product has already generated more than $500 million in run-rate revenue, according to the press release — and Anthropic said usage grew by more than tenfold in the three months since its “full launch.”\nThe Series F round was led by ICONIQ, Fidelity Management & Research Company, and Lightspeed Venture Partners. Investors included the Qatar Investment Authority, TPG, Altimeter, Blackstone, Coatue, General Catalyst, and others. Anthropic said it would use the money in part to “meet growing enterprise demand, deepen our safety research, and support international expansion.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f142f2f1ec1e1b3ad2c32f4683177278c1e67425",
      "title": "WordPress shows off Telex, its experimental AI development tool",
      "url": "https://techcrunch.com/2025/09/02/wordpress-shows-off-telex-its-experimental-ai-development-tool/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:26:48.000Z",
      "summary_90w": "",
      "raw": "WordPress CEO Matt Mullenweg introduced the new WordPress AI tool, called Telex, at the company's WordCamp US 2025 conference in Portland last week, alongside other AI experiments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e97c95b340cc7d9d0ebced2db4b426d303c1ad7b",
      "title": "Tesla Dojo: the rise and fall of Elon Musk’s AI supercomputer",
      "url": "https://techcrunch.com/2025/09/02/tesla-dojo-the-rise-and-fall-of-elon-musks-ai-supercomputer/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:18:46.000Z",
      "summary_90w": "",
      "raw": "Dojo was going to be Tesla’s custom-built supercomputer. Here's what Elon Musk had in mind, what happened, and what's coming next.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:14:10.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d46869ae69d440200183c86e14c507c85ddb92b2",
      "title": "ICE reactivates contract with spyware maker Paragon",
      "url": "https://techcrunch.com/2025/09/02/ice-reactivates-contract-with-spyware-maker-paragon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:11:25.000Z",
      "summary_90w": "",
      "raw": "The Israeli spyware maker now faces the dilemma of whether to continue its relationship with U.S. Immigration and Customs Enforcement and help fuel its mass deportations program.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf1e1af10a193104faba1b24b371529db2a86de8",
      "title": "Sting sued by ex-Police bandmates over royalties",
      "url": "https://www.bbc.com/news/articles/cgjyjn9j74go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:03:47.000Z",
      "summary_90w": "",
      "raw": "Two of his former bandmates say they are owed £1.5m backdated payments, court documents show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56f1401e789815c9eca266775426dd8215aced81",
      "title": "A Call of Duty movie is coming",
      "url": "https://www.theverge.com/news/769150/call-of-duty-movie-paramount-activision",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T16:03:00.000Z",
      "summary_90w": "",
      "raw": "Call of Duty is being adapted into a live action film as part of a new deal signed by Activision and Paramount. Paramount, the film studio behind Top Gun: Maverick, will “develop, produce, and distribute a live-action feature film” based on the franchise, and “both companies are committed to honoring the brand’s rich narrative and distinctive style,” the companies say in a press release.\nYears ago, Activision was working on a Call of Duty film that never ended up getting released, but this new movie could be a huge deal. The Call of Duty series has sold more than 500 million copies globally and the campaigns in the games tell big, cinematic, action-packed stories. A Call of Duty-style story could be a good fit for a movie, though obviously we’ll have to wait and see the final product to know how it turns out.\nThe two companies haven’t shared any details about a potential release window, a director, or any stars for the cast. But David Ellison, the new CEO and chairman of Paramount, a Skydance Corporation, is apparently a big fan of the franchise, so it seems likely that the film is going to be a priority for him — especially when things like The Super Mario Bros. Movie, A Minecraft Movie, The Last of Us, and Fallout have been huge hits for other studios.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba854e3deded012457b724f56c45bc747a499de6",
      "title": "MrBeast reportedly plans to launch a phone company",
      "url": "https://techcrunch.com/2025/09/02/mrbeast-reportedly-plans-to-launch-a-phone-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:58:30.000Z",
      "summary_90w": "",
      "raw": "MrBeast, the 27-year-old popular YouTuber, plans to launch a phone company as he diversifies his brand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "40bc35c898fa88a0f13ace32fe2bdd2def02e332",
      "title": "You can charge your Apple Watch, phone, and laptop all at once with this 240W USB-C cable",
      "url": "https://www.theverge.com/news/769123/zens-usb-c-charging-cable-pro-2-3-240w",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T15:55:05.000Z",
      "summary_90w": "",
      "raw": "The Zens Pro 3 USB-C charging cable includes additional inline wireless chargers. | Image: Zens\t\n\nIt’s not an entirely new idea given Nomad’s Universal Cable from earlier this year can charge an Apple Watch and an additional device at the same time, but Zens’ new Pro 2 and Pro 3 USB-C cables offer additional functionality and some welcome future-proofing as chargers become more powerful.\nThe cheaper of the two is the €49.99 (around $58) Pro 2 USB-C charging cable that includes an inline Qi2 charging puck that can wirelessly charge a smartphone or earbuds at up to 15W speeds. It’s not Qi2.2 compatible so you won’t get faster 25W wireless charging, but it is compatible with 140W chargers so you can plug in a power-hungry laptop, and Zens says the cable also supports charging rates up to 240W once more powerful chargers become common.\nAt nearly twice the price the €99.99 (around $117) Pro 3 USB-C charging cable offers the same functionality as the Pro 2 but adds an additional wireless charger for AirPods and the Apple Watch. Both versions measure 59-inches in length and are available for preorder now with shipping expected sometime in October 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "ChatGPT to tell parents when their child is in 'acute distress'",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T15:35:38.000Z",
      "summary_90w": "",
      "raw": "It's one of a number of parental controls being introduced by OpenAI, which is being sued over the death of a teenager in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0ae0e1ce7630b5acd0f10dcc27910a2cdc730112",
      "title": "Five children in Gaza among those killed by Israeli strike while fetching water",
      "url": "https://www.theguardian.com/world/2025/sep/02/children-among-those-killed-in-gaza-while-fetching-water-by-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:32:50.000Z",
      "summary_90w": "",
      "raw": "Latest attack comes as Israel’s military urges people to leave Gaza City with 60,000 more reservists to be called up\nAt least nine people, including five children, have been killed in an Israeli strike while fetching water in al-Mawasi, an area of southern Gaza which Israel has designated as a safe zone, health officials said.\nA doctor from al-Nasser hospital shared a picture of the children’s bodies in the hospital, as well as a picture of water jugs left in a pool of blood at the site of the attack on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d203ebfab4aa685fce025a5c48b071284b5130",
      "title": "Instagram tests Picture-In-Picture viewing for reels",
      "url": "https://techcrunch.com/2025/09/02/instagram-tests-picture-in-picture-viewing-for-reels/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:31:11.000Z",
      "summary_90w": "",
      "raw": "The move comes as apps like TikTok and YouTube have had support for Picture-in-Picture for quite some time now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c59ba5b393c97c08afc250f9af06a878c3a55b4",
      "title": "Why are online puzzle games having a moment?",
      "url": "https://www.theverge.com/podcast/768156/puzzle-games-sudoku-cracking-the-cryptic-project-indigo-marc-levoy",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T15:30:00.000Z",
      "summary_90w": "",
      "raw": "Hooked on LinkedIn’s Queens? Gotta extend your Wordle streak in the New York Times games app before you start your day? You’re in good company on today’s Vergecast episode. Allison Johnson is joined by Simon Anthony and Mark Goodliffe, world-class puzzle champs and hosts of the delightful Cracking the Cryptic, a YouTube channel where they solve a puzzle on camera every single day.\n\n\nThey specialize in sudoku — and not just the classic number games you might be familiar with. Simon and Mark tackle mind-bending, seemingly impossible puzzles, working through it all in real time, sometimes over the course of several hours. What happens when you get stuck? How can you tell the difference between a puzzle made by a human and a computer-generated one? Why are we addicted to puzzle games all of a sudden? They help us crack the clues.\nThen Allison sits down with Marc Levoy, one of the pioneers of computational photography, to talk about his new camera app: Project Indigo. Levoy is known for his earlier work on the Pixel camera, and was a driving force in shaping phone photography into what it is now. We last caught up with him in 2020 when he left Google for Adobe, so we got up to speed on what the heck he’s been doing for the last five years — and the important difference between HDR and an HDR-ish photo.\nFinally, Allison takes a hotline question from someone who is not particular about their phone camera’s image quality, but does have a beef with camera bumps.\nRead more about the topics covered in today’s episode:\nCracking the Cryptic — YouTube\nThis 25-minute video is the most riveting sudoku puzzle you will ever watch\nThe Atlantic is making a big push into games\nI regret to inform you that LinkedIn’s games are very fun\nThe mastermind of Google’s Pixel camera quietly left the company in March\nThe brain behind the Google Pixel camera is building a universal camera app for Adobe\nMarc Levoy on the balance of camera hardware, software, and artistic expression\nAdobe launches a new ‘computational photography’ camera app for iPhones\nAdobe’s new camera app is making me rethink phone photography",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88909bf9a463d2ae9be300a55d52875cd23e2daf",
      "title": "Putin claims he never opposed EU membership for Ukraine but draws line at Nato – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:28:22.000Z",
      "summary_90w": "",
      "raw": "Russian leader, continuing China visit, is joined by Slovakia’s Robert Fico. This live blog is closed\nIn the meantime, we have had an update from Ukraine where a man accused of murdering a pro-western Ukrainian politician in the city of Lviv last weekend admitted that he carried out the killing but denied working for Russia, describing the attack as “personal revenge,” AFP reported.\n“This is my personal revenge on the Ukrainian authorities,” the suspect told reporters in a video published by Ukrainian media outlets, denying he worked directly with Russian special services.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "229fcf7532720280f150841b701f282bc1f4c0bc",
      "title": "British teen accused of drug smuggling told 'substantial' sum could free her from jail",
      "url": "https://www.bbc.com/news/articles/cd0d04gjk19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T15:23:40.000Z",
      "summary_90w": "",
      "raw": "Bella Culley could face up to 20 years in jail or life imprisonment if convicted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "580ffe349db445b1879e290804a721aabe3351d4",
      "title": "My rent's gone up by almost 20% - and my landlord wants to evict me",
      "url": "https://www.bbc.com/news/articles/cjw6w32z07zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T15:17:09.000Z",
      "summary_90w": "",
      "raw": "Glasgow tenant Elle Glenny says the impact of a rent increase has been catastrophic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65c5e55f7913737ad615deb04b9b807ea24450db",
      "title": "As many as 1,000 killed in Sudan landslide",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525607/sudan-mudslide",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T15:16:49.000Z",
      "summary_90w": "",
      "raw": "Up to 1,000 dead after a landslide levels a village in western Sudan, as displaced residents flee famine and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "060597fc354558c19ae50394ae87621f9045f7bd",
      "title": "OpenAI to route sensitive conversations to GPT-5, introduce parental controls",
      "url": "https://techcrunch.com/2025/09/02/openai-to-route-sensitive-conversations-to-gpt-5-introduce-parental-controls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:09:02.000Z",
      "summary_90w": "",
      "raw": "OpenAI said Tuesday it plans to route sensitive conversations to reasoning models like GPT-5 and roll out parental controls within the next month – part of an ongoing response to recent safety incidents involving ChatGPT failing to detect mental distress.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "483d0edba69eb0fb9f49b19bedfa86d7a4b237bc",
      "title": "Mining magnate Andrew Forrest’s Minderoo charity makes undisclosed donation to the Australia Institute",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/mining-magnate-andrew-forrest-minderoo-charity-makes-undisclosed-donation-to-the-australia-institute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:01:01.000Z",
      "summary_90w": "",
      "raw": "Exclusive: The progressive thinktank, which has championed a ‘real zero’ emissions policy, says it protects privacy of donors to avoid them being targeted\nGet our breaking news email, free app or daily news podcast\nAndrew Forrest’s charity has made an undisclosed donation to the Australia Institute, raising transparency concerns about the funding of influential advocacy groups.\nThe donation to the progressive thinktank, which has been confirmed by several sources familiar with the deal but not authorised to comment, highlights differing disclosure standards across the research and advocacy sector.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a85224c71c02aef3bd82ebc531d5258a55a9817",
      "title": "Australian politicians reveal their housing portfolios, with some owning as many as six homes",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/australian-politicians-reveal-their-housing-portfolios-with-some-owning-as-many-as-six-homes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:01:00.000Z",
      "summary_90w": "",
      "raw": "Dozens of politicians are landlords, having also declared rental income from their investment properties\n\nGet our breaking news email, free app or daily news podcast\n\nMore than half the politicians in federal parliament have disclosed owning investment properties or multiple homes, with at least 50 receiving rental income as landlords.\nThe enviable property portfolios of some of the nation’s most powerful parliamentarians have been revealed – including holiday homes, beach shacks, second houses interstate and overseas real estate – as the federal government considers ways to fix Australia’s housing shortage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f34878384201a9cc04d921dd7a41c04f66cbc30",
      "title": "There are just 150 of these creamy-flowered shrubs left in the world – and Victoria’s fire plan may decimate a third",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/victoria-bushfire-plan-could-push-endangered-round-leaf-pomaderris-plants-into-extinction",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:00:59.000Z",
      "summary_90w": "",
      "raw": "More than 40 round-leaf pomaderris discovered by environmental community group inside the area earmarked for fire break in July\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nA mere 150 round-leaf pomaderris are thought left in the world and a planned fire break in Victoria could decimate almost 30% of those last remaining plants.\nThe critically endangered shrub, which bursts into cascades of creamy flowers, is known to exist in only a handful of locations in central Victoria’s hill country.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0a3deafb967140559e6790fd5d34e8310c625d7",
      "title": "Up to 80,000 people in Australia may be affected by ‘sledgehammer’ powers to deport non-citizens to Nauru, lawyers warn",
      "url": "https://www.theguardian.com/australia-news/2025/sep/02/misleading-80000-people-in-australia-may-be-affected-by-proposed-powers-to-deport-non-citizens-to-nauru-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T14:58:21.000Z",
      "summary_90w": "",
      "raw": "Greens senator David Shoebridge accused Tony Burke of ‘doing his Peter Dutton impression, dog-whistling and punching down on migrants’ \nUp to 80,000 people in Australia may be affected by the Albanese government’s proposed powers to strip basic legal protections from the non-citizens it plans to deport to Nauru, refugee lawyers warn.\nThe proposed federal powers, revealed last Wednesday, are expected to pass parliament this week with the Coalition’s support at a snap two-hour committee hearing scheduled for Wednesday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb9cf641bcfe1fe3bc66f98e582ed087613061bf",
      "title": "Neo-Nazi Thomas Sewell charged with violent disorder over alleged attack on Indigenous protest site",
      "url": "https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T14:55:42.000Z",
      "summary_90w": "",
      "raw": "The 32-year-old has been charged along with two associates  hours after he confronted Victorian premier Jacinta Allan at a press conference\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-Nazi Thomas Sewell has been charged with violent disorder and affray over an alleged attack on Camp Sovereignty, a sacred Aboriginal burial ground in Kings Domain and longstanding protest site on Sunday.\nSewell, 32, from Balwyn, with charged with violent disorder, affray, assault by kicking, discharge missile and other offences by detectives from the Melbourne crime investigation unit, police said on Tuesday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86caaa6448b8f1ba3b3fab2bb91ae4ecc67f6a83",
      "title": "The 71 best Labor Day deals you can still get",
      "url": "https://www.theverge.com/tech/756227/best-labor-day-sales-deals-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T14:49:03.000Z",
      "summary_90w": "",
      "raw": "Labor Day weekend is over, which means the symbolic end of summer has passed. On a more positive note, dozens of the best Labor Day deals are still around, so you still have time to take advantage of them if you spent the long weekend offline. For a limited time, you can save on a variety of Verge-approved gadgets and goods, from earbuds and 4K TVs to the latest e-readers.\nBeing that it’s now September, it’s also a good reminder that the holidays will be here before you know it. Thankfully, some gadgets — including the latest Kindle Colorsoft, the M4 MacBook Air 13, and Sony’s WH-CH520 headphones — have fallen to their lowest price to date, making now an excellent time to get a head start on your holiday shopping. After all, there’s no guarantee they’ll drop lower in price, even when Black Friday and Cyber Monday roll around.\n\n\n\n\n\nSpeaker deals\nHeadphone and earbuds deals\nSmart home deals\nTV and streaming device deals\nGaming deals\nTablet and e-reader deals\nSmartwatch and fitness tracker deals\nOutdoor deals\nMiscellaneous deals \n\nSpeaker deals\nBeats Pill (2024)\nThe latest Beats Pill offers improved sound, USB-C, and native support for both iOS and Android features, including their respective Find My networks and voice assistants. It also bests the previous model with double the battery life and IP67 water resistance. Read our review.\n\nWhere to Buy:\n\n $149.95 $99 at Amazon\n $149.95 $99.95 at Walmart\n $149.99 $99.99 at Target\n\nJBL’s Flip 7 is on sale for around $129.95 ($20 off) at Amazon, Best Buy, Walmart, and B&H Photo, matching its second-best price to date. The Bluetooth speaker is dustproof / waterproof and comes with an interchangeable clip and loop, allowing you to attach it to your bag. It’s a mono speaker, but you can pair two together for stereo sound, and it’s rated to last up to 16 hours per charge while in Playtime Boost mode.\nUltimate Ears’ Megaboom 4 is currently available at Amazon and Best Buy for $149.99 ($50 off), which is the lowest price we’ve seen this year. The 360-degree Bluetooth speaker carries an IP67 rating, floats, and can last up to 20 hours on a single charge. The button on the top can even be programmed to start a playlist on Spotify, Amazon Music, or Apple Music.\nHeadphone and earbuds deals\nBeats Studio Pro\nThe latest Beats Studio Pro feature improved noise cancellation, sound quality, and comfort. They also support lossless audio over USB-C, making them the first Apple headphones to do so. Read our review.\n\nWhere to Buy:\n\n $349.99 $179.95 at Amazon\n $349.99 $179.95 at Walmart\n $349.99 $199.99 at Best Buy\n\nSony’s budget-friendly WH-CH520 have hit a a new low of $34.99 ($35 off) in multiple colors at Amazon. The on-ear headphones can tap into Google’s Find My Device network and support multipoint Bluetooth connectivity, so you can keep them paired to two devices simultaneously. They also support Fast Pair on Android and can last up to 50 hours per charge, which is impressive for a pair of budget-friendly cans.\nYou can now buy the latest AirPods Max with USB-C starting at $479.99 at Amazon and Walmart. Apple’s over-ear headphones combine excellent sound with powerful noise cancellation and a natural-sounding transparency mode. They also feature deep integration with other Apple products and a premium stainless steel / aluminum build that makes them stand out from plastic rivals, even if they’re somewhat heavy to wear during long listening sessions. Read our review of the original model.\nSonos Ace\nThe Sonos Ace are the company’s first set of wireless headphones. They feature a premium, comfortable build and active noise cancellation, along with compatibility with Sonos Arc and other Sonos soundbars. Read our review. \n\nWhere to Buy:\n\n $399 $299 at Amazon\n $399 $299 at Best Buy\n $399 $299 at Walmart\n\n\nBeats Studio Buds Plus\nThe Beats Studio Buds Plus sport an eye-catching translucent option and build upon the original with improved sound, better voice quality, and more effective ANC. They also include swappable silicon ear tips and support for native iOS and Android features. Read our review.\n\nWhere to Buy:\n\n $169.95 $84.95 at Woot\n $169.95 $129.95 at Amazon\n $169.95 $129.99 at Best Buy\n\nBose noise-canceling QuietComfort Earbuds are some of the best mid-tier earbuds we’ve tested, and they’re currently on sale at Amazon for $149 ($30 off), matching their second-best price to date. The wireless earbuds are comfortable to wear, and last around eight hours per charge with ANC enabled. We liked the way they sounded out of the box and appreciated their five-band EQ, which allowed us to tune them to our tastes. Read our hands-on impressions.\nSony WH-1000XM4\nSony’s WH-1000XM4 noise-canceling headphones still offer plenty of bang for your buck with excellent ANC, lively sound, and lengthy battery life. They’re not the company’s latest, but they remain an excellent buy. Read our review.\n\nWhere to Buy:\n\n $348 $198 at Amazon\n $348 $199.99 at Walmart\n $348 $199.99 at Best Buy\n\n\nBose QuietComfort Headphones\nBose’s QuietComfort Headphones, which replace the QuietComfort 45, have adjustable noise cancellation and the ability to set custom modes. However, they lack immersive audio mode and the higher-quality Bluetooth found in the QuietComfort Ultra Headphones.\n\nWhere to Buy:\n\n $359 $209 at Amazon\n $359 $209 at Best Buy\n\nSmart home deals\nTovala Smart Oven Air Fryer\nTovala’s smart oven / air fryer combo is designed to be used in conjunction with its scannable meal kits, which let you make tasty meals in about 20 minutes. Right now, you can get it for free when you buy it from Tovala and order meals six times over six months. Each meal costs around $12.99. Read our review.\n\nWhere to Buy:\n\n $299 at Tovala (with code LABORDAY25)\n\n\nBlink Video Doorbell (second-gen-en) with Sync Module Core\nBlink’s second-gen Video Doorbell records 1080p video in a 1:1 aspect ratio, allowing you to see the entire body. It comes with a Sync Module that acts as a hub, and hel to extend its battery life to approximately two years. Clips are stored in the cloud for a subscription fee of $3 per month, or locally using Blink’s Sync Module and a microSD card.\n\nWhere to Buy:\n\n $69.99 $39.99 at Amazon\n $69.99 $39.99 at Best Buy\n $69.99 $39.99 at Target\n\nBlink’s Outdoor 4 cameras can beef up your home’s smart security system, and right now you can get a pair at Amazon for $89.99 ($90 off), which is the best price we’ve seen since Prime Day. The 1080p security cameras are weather-resistant and can last up to two years before their AA batteries need to be replaced. Clips can be stored in the cloud for a subscription fee, or locally using its Sync module (included) and a flash drive. Blink’s five-camera bundle is also on sale for $199.99 ($200 off) at Amazon and Best Buy. \nWhisker’s Litter Robot 4 can automatically clean itself by sifting waste from litter, minimize odors, and keep track of your cat’s weight, which you can check in Whisker’s app. It was designed to accommodate cats of many breeds and sizes, and it works efficiently enough to be used daily by four cats. A bundle that includes the machine and a three-year extended warranty is currently going for $699 ($100 off) at Whisker’s online storefront.\nEcobee Smart Thermostat Premium\nThe Ecobee Smart Thermostat Premium is an excellent option for adding smarts and some style to your HVAC system. As well as being a smart way to control your energy use, the thermostat can also act as a video intercom for Ecobee’s excellent doorbell camera and an indoor air quality monitor.\n\nWhere to Buy:\n\n $249.99 $229.99 at Amazon\n $249.99 $229.99 at Best Buy\n $249.99 $229.99 at Ecobee\n\n\nEcobee Smart Doorbell Camera\nThis is a great wired doorbell camera, and the only one that can use an Ecobee thermostat as a video intercom, making it a no-brainer for Ecobee households, as long as you can hook it to your doorbell wiring.\n\nWhere to Buy:\n\n $159.99 $119.99 at Amazon\n $159.99 $119.99 at Best Buy\n $159.99 $119.99 at Ecobee\n\nMammotion’s Yuka Mini 500H is a robotic lawnmower that looks (and works) like a robot vacuum, and it’s currently on sale at Amazon for an all-time low of $649 ($449 off). It uses AI and sensors to map out your yard, avoid obstacles, and find the most efficient route to mow. The 500H can keep track of up to 15 “work zones” and move between them independently; it can also run for up to 55 minutes per charge.\nYou can buy the GE Profile Smart Indoor Smoker from Williams Sonoma and GE Appliances for around $599 ($100 off). If you don’t have the space for an outdoor grill, the handy gadget is a great way to add a delicious, smoky flavor to meats and vegetables right from your kitchen. It can’t handle classic BBQ cuts as well as a traditional wood-pellet smoker, but the built-in heating element does a nice job cooking your food while the smoke imparts it with additional flavor. The resulting meat might not be as tender as it would be if you were to only use smoke, but hey, at least it doesn’t take up a ridiculous amount of space in your backyard. Read our review.\nBrisk It Zelos-450 smart grill\nBrisk It’s Zelos-450 is a beginner-friendly smart electric pellet smoker with Wi-Fi connectivity and an AI assistant that suggests recipes and manages cooking. It features 450 square inches of cooking space and can reach temperatures of up to 500 degrees Fahrenheit.\n\nWhere to Buy:\n\n $449.99 $328.99 at Amazon\n $449.99 $329.99 at Walmart\n $449.99 $329.99 at Brisk It\n\n\nRing Battery Doorbell (2024)\nThe 1080p camera on Ring’s latest Battery Doorbell has improved color night vision and a taller, head-to-toe field-of-view for package detection than the previous model. It also features better battery life and push-pin dismounting.\n\nWhere to Buy:\n\n $99.99 $54.99 at Amazon\n $99.99 $54.99 at Best Buy\n $99.99 $54.99 at Target (with Circle)\n\nThe GE Profile Opal 2.0 Ultra is on sale for around $529.95 ($100 off) at Best Buy, Crate & Barrel, and Williams Sonoma. The smart gadget does an excellent job delivering a full batch of fresh, chewable ice in just 10 minutes, and can produce up to 38 pounds of ice a day. The Ultra is also easier to maintain than the base model, as it comes with a built-in filter for handling mineral buildup, a reusable air filter, and sanitization reminders. Read our review.\nIf you want smart lighting without replacing all the light bulbs in your home, Lutron’s Diva is a great smart home addition that’s on sale for $99.95 ($25 off) at Amazon and Best Buy. Once installed, you can dim your lights or turn them on and off using the switch, an included remote, or an app on your phone. It’s also compatible with all the major smart home platforms, including Amazon Alexa, Google Home, and Apple Home.\nRing Alarm 14-Piece Kit\nThe Ring Alarm 14-Piece Kit has all the sensors and accessories you need to protect a two- to four-room house. You can also opt for 24/7 professional monitoring by signing up for a Ring Home subscription, which costs between $10 and $25 a month, depending on which plan you choose.\n\nWhere to Buy:\n\n $329.99 $198.99 at Amazon\n\n\nCurrent Model P Smart Pizza Oven\nCurrent’s Model P Smart Pizza Oven runs on electricity, gets up to 850 degrees Fahrenheit, and can cook a pizza in two minutes. Its companion app lets you customize your cook based on your pizza style and thickness. Read our review.\n\nWhere to Buy:\n\n $699 $489.3 at Amazon\n $699 $489.3 at Current\n\nRoborock’s QV 35A is available for an all-time low of $399.99 ($200 off) at Roborock’s online storefront. The robot vacuum mop / combo uses lidar to construct a 360-degree map of your home — allowing it to create a more efficient cleaning route — and works on hardwood, carpets, and rugs. Dust and dirty water are deposited into containers in the included charging base, which Roborock suggests you should empty weekly. You can even set the QV 35A, which offers 8,000Pa of suction power and a pair of self-washing mopping pads, to run on a schedule via its accompanying mobile app.\nEcho Show 5 (third-gen)\nThe newest Echo Show 5 is just as small as its predecessor, but it features updated microphones and a speaker system that delivers double the bass and clearer sound quality.\n\nWhere to Buy:\n\n $89.99 $64.99 at Amazon\n $89.99 $64.99 at Best Buy\n $89.99 $64.99 at Target\n\n\nYale Assure Lock 2 Touch\nThis fingerprint lock is fast and reliable, and the keypad is a good backup option for visitors. It works with Apple Home and can be upgraded to support Wi-Fi — which you’ll need for remote unlocking, Android phones, Amazon Alexa, and Google Home support. Auto-unlock can open the door as you approach, and you can also use a key if you just can’t let go.\n\nWhere to Buy:\n\n $189.99 $139.99 at Amazon (Bluetooth)\n $279.99 $246.98 at Amazon (Wi-Fi)\n\nYou can buy Amazon’s ad-free Echo Hub at Amazon, Best Buy, and Target for just $129.99 ($50 off), which is $10 shy of its all-time low. The Echo Hub lets you control your smart home via an eight-inch touchscreen, one that even lets you check live feeds from your video doorbell and control your Ring Alarm security system. It’s loaded with a bunch of interactive widgets, too, while built-in support for both Matter and Thread means it’ll work with a whole host of smart home devices, in addition to Amazon Alexa. Read our review.\nThe Petcube Bites 2 Lite is on sale for $82.99, down from $149.99, directly from Petcube. The 1080p camera helps you keep an eye on your pets while you’re away, with a wide 160-degree view, night vision support, and two-way audio. It also features a built-in treat dispenser, so you can feed your pets when you’re not at home, though you’ll need to pay for the $9.99 a month if you want access to 24/7 livestreaming, smart alerts, three-day video history, and other premium features.\nDyson 360 Vis Nav robot vacuum\nDyson’s latest robovac is a great option for simple floor plans and carpets. It boasts a whopping 65 air watts of suction, a huge roller brush, and a spacious 500ml bin with an integrated handle that’s super easy to remove.\n\nWhere to Buy:\n\n $999.99 $499.99 at Dyson\n\n\nMill Food Recycler (second-gen)\nMill’s latest Food Recycler works overnight to shrink your food scraps by 80 percent and convert them into food grounds, which you can then use for gardening or dispose of responsibly. It has a 6.5-liter capacity, which Mill says takes roughly four weeks to fill, and eliminates most odors.\n\nWhere to Buy:\n\n $999 $874 at Mill\n\nTV and streaming device deals\nSamsung QN80F\nSamsung is offering a free 65-inch U8000F TV when you purchase select 98-inch (or larger) TVs. The QN80F features a 120Hz 4K panel, a custom-designed processor for AI upscaling and color optimization, and built-in Alexa support.\n\nWhere to Buy:\n\n $6499.98 $4999.99 at Samsung (100-inch)\n\n\nSony Bravia 8 II\nThe Bravia 8 II was chosen as the “king of TV” by a panel of judges (including The Verge’s own Nilay Patel) in Value Electronics’ 2025 shootout. The OLED TV has excellent color accuracy, a bright panel, and a 120Hz refresh rate.\n\nWhere to Buy:\n\n $2999.99 $2198 at Amazon (55-inch)\n $2999.99 $2299.99 at Best Buy (55-inch)\n $3499.99 $2998 at Amazon (65-inch)\n\nSamsung’s 98-inch DU9000 is a massive TV that’s back down to its all-time low of around $1,897.99 ($600 off) at Amazon, Best Buy, and B&H Photo. The set has a 120Hz refresh rate, HDR Plus support, and a direct-lit panel for more even brightness. It also has an AI processor to adjust its picture and brightness settings automatically, and upscale low-resolution video to look nicer on a big 4K screen. If you have a Q-Symphony-compatible soundbar, the DU9000 will even integrate its built-in speakers into the audio system.\nGoogle TV Streamer (4K)\nGoogle’s terrific TV Streamer (4K) is the company’s best attempt at a streaming device yet, with built-in ethernet, an excellent interface, and smart home compatibility with both Matter and Thread. Read our review.\n\nWhere to Buy:\n\n $99.99 $79.99 at Amazon\n $99.99 $79.99 at Walmart\n $99.99 $79.99 at Best Buy\n\nIf you need a 4K TV for a smaller space, Sony’s 43-inch K43S30 is available at Amazon, Best Buy, and Walmart for around $448 ($51 off), an all-time low. It has a 60Hz direct-lit panel that’s great for casual gaming or TV and movie streaming, and includes access to Sony Pictures Core, an exclusive streaming service that lets you watch movies in ultra high quality. You can use Google Assistant to search for content or control compatible smart home accessories with just your voice.\nLG C5 OLED TV\nLG’s C5 features a 120Hz panel, along with four HDMI 2.1 ports and support for both AMD FreeSync Premium and Nvidia G-Sync. The gamer-friendly TV also packs all the hallmarks of a modern OLED, including deep black levels and sublime contrast.\n\nWhere to Buy:\n\n $1999.99 $1296.99 at Amazon (55-inch)\n $1999.99 $1299.99 at Best Buy (55-inch)\n $2699.99 $1496.99 at Amazon (65-inch)\n\nGaming deals\nScuf Instinct Pro\nScuf’s Instinct Pro is its top-tier controller for Xbox consoles and PC. It’s one of the only third-party wireless options around, and for its very high price, you get rubberized grips, built-in mappable rear paddle buttons, hair-trigger locks, swappable sticks, and user-configurable cosmetics.\n\nWhere to Buy:\n\n $219.99 $189.99 at Scuf\n $229.99 $199.99 at Amazon\n $229.99 $199.99 at Best Buy\n\n\n\n\nYou can grab a copy of Dragon Age: The Veilguard for $19.99 ($10 off) at Best Buy (PS5) or Target (PS5, Xbox Series X), which is just $5 shy of its all-time low. Arriving 10 years after Dragon Age: Inquisition, Veilguard starts slow but ultimately delivers an excellent story filled with choices and well-written, multidimensional characters. Read our review.\nYoshi’s Crafted World, a Nintendo Switch exclusive, is currently on sale for $39.99 ($20 off) at Walmart, and Target. In the charming platformer, a woolly Yoshi explores a handmade papercraft world, dresses up in adorable costumes, and solves puzzles while eating enemies. Read our review.\nMario & Luigi: Brothership \nIn this turn-based RPG, the Mario brothers sail across islands on a quest to return to the Mushroom Kingdom, fighting bosses along the way. It’s a lighthearted Nintendo Switch game full of clever gameplay, charm, and humor. Read our review.\n\nWhere to Buy:\n\n $59.99 $39.9 at Walmart\n\n\nLogitech G Pro X Superlight\nThe original Superlight was one of its lightest gaming mice up you could buy until the release of the second-gen model. It remains a great mouse regardless, complete with a 25,600 DPI Hero sensor and a clean, minimalist design that features a single LED for displaying the battery level.\n\nWhere to Buy:\n\n $159.99 $98.6 at Amazon (white)\n $159.99 $98.99 at Best Buy (white)\n\nYou can buy the HyperX QuadCast S for $99.99 ($60 off) at Amazon, Best Buy, and Target, which is $10 shy of its all-time low. The last-gen USB-C microphone features solid sound and voice quality, along with a tap-to-mute button, programmable LED lighting, and compatibility with PCs and consoles. It also offers multiple pickup patterns, though keep in mind that the recording quality maxes out at 16-bit/48kHz.\nTablet and e-reader deals\niPad (2025)\nApple’s entry-level iPad is an excellent tablet for casual use. Its high resolution screen is great for watching video, and its A16 processor is fast enough to handle light games and productivity apps. Read our review.\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $449 $399 at Amazon (256GB, Wi-Fi)\n $649 $599 at Amazon (512GB, Wi-Fi)\n\n\nKindle (2024)\nAmazon’s new entry-level Kindle retains a six-inch, 300ppi display and USB-C. It’s brighter and slightly faster than its predecessor, though, and features longer battery life.\n\nWhere to Buy:\n\n $109.99 $89.99 at Amazon (with ads)\n $109.99 $89.99 at Best Buy (with ads)\n $129.99 $109.99 at Amazon (without ads)\n\n\nAmazon Fire HD 10 (2023)\nThe 2023 Amazon Fire HD 10 sports a 10.1-inch, 1080p display and 3GB of RAM, which is plenty if you’re streaming or browsing. It’s lighter than the last-gen model, too, and comes with support for both the Made for Amazon Stylus Pen and Amazon’s handwriting recognition technology.\n\nWhere to Buy:\n\n $139.99 $89.99 at Amazon (32GB, with ads)\n $179.99 $99.99 at Amazon (64GB, with ads)\n $154.99 $104.99 at Amazon (32GB, without ads)\n\nThe Apple Pencil Pro is on sale for $99 ($30 off) at Amazon and Walmart, nearly matching its lowest price to date. The premium stylus offers several advanced creative features not found on the entry-level model, including pressure sensitivity and a “Barrel Roll” gyroscope, which lets you rotate the stylus as you draw to quickly adjust the angle of your digital pen or brush. It also supports wireless charging and Apple’s Find My feature, and squeeze gestures that let you control smart home devices.\nKindle Colorsoft (16GB)\nThe 16GB Kindle Colorsoft is Amazon’s latest color e-reader. It features a seven-inch 300ppi screen, an adjustable front light, and a battery that can last up to eight weeks.\n\nWhere to Buy:\n\n $249.99 $219.99 at Amazon\n $249.99 $219.99 at Best Buy\n $249.99 $219.99 at Target\n\n\nAmazon Fire Max 11 (64GB, with ads)\nAmazon’s highest-end tablet features an 11-inch LCD display with 2000 x 1200 resolution as well as options for an add-on keyboard and stylus. Read our review.\n\nWhere to Buy:\n\n $229.99 $174.99 at Amazon (tablet only)\n $229.99 $174.99 at Best Buy (tablet only)\n $264.99 $211.98 at Amazon (with stylus)\n\nSmartwatch and fitness tracker deals\nGarmin Venu 3S\nThe Venu 3S remains our favorite Garmin smartwatch. It’s a comfortable wearable with up to 10 days of battery life and a vibrant 1.2-inch OLED display, not to mention solid sleep tracking, Atrial Fibrillation detection, and a built-in EKG reader. Read our review.\n\nWhere to Buy:\n\n $449.99 $399.99 at Amazon\n $449.99 $399.99 at Best Buy\n\n\nGoogle Pixel Watch 3\nGoogle’s Pixel Watch 3 is bigger and brighter than its predecessor. It also features more advanced running capabilities, offline Google Maps functionality, and deeper integration with other Google devices. Read our review.\n\nWhere to Buy:\n\n $349.99 $249.99 at Amazon (41mm)\n $349.99 $249.99 at Target (41mm)\n $399.99 $299.99 at Amazon (45mm)\n\n\nFitbit Inspire 3\nThe Fitbit Inspire 3 is a minimalist fitness band that delivers notifications and tracks your activity on a bright OLED screen. It lacks built-in GPS, contactless payments, and digital assistants, but offers a range of other excellent health and fitness tracking features. Read our impressions.\n\nWhere to Buy:\n\n $99.95 $74.95 at Amazon\n $99.95 $74.95 at Walmart\n\n\nFitbit Charge 6\nThe Fitbit Charge 6 features a haptic side button, an improved heart rate algorithm, turn-by-turn navigation with Google Maps, and the ability to broadcast your heart rate on certain Bluetooth gym equipment. Read our review.\n\nWhere to Buy:\n\n $159.95 $125.24 at Walmart\n $159.95 $136.99 at Amazon\n\nOutdoor deals\nBioLite FirePit Plus\nBioLite’s portable FirePit Plus cuts back on unwanted smoke, functions either as a charcoal or wood-fueled grill, and fans the flames via a large battery pack and built-in fan.\n\nWhere to Buy:\n\n $399.95 $299.94 at Amazon\n $399.95 $299.96 at BioLite\n\nYou can grab BioLite’s Solar Site Lights from Amazon and BioLite for $79.96 ($20 off), which is $5 shy of their best price to date. The set comes with six weatherproof bulbs that can illuminate up to 1,000 square feet when hung up, or you can place them atop the included ABS stakes to light your path. Best of all, you don’t need to bring a charger, as the included carrying case doubles as a solar charger for the lights.\nYou can get 50 percent off an AllTrails Plus subscription right now, bringing the price of a 12-month membership down to just $17.99. Unlike the free base subscription, AllTrails Plus offers offline maps, live activity sharing with friends, wrong-turn alerts, and a host of other premium features, all without ads.\nJackery’s Explorer 1000 v2 is a great tool to keep campers on the grid, and it’s currently available from Amazon for around $474.05 (about $325 off), one of its lowest price to date. The portable power station features a 1070Wh battery, along with three AC outlets, a DC output, two USB-C ports, and a USB-A port. It’s powerful enough to run small appliances — or recharge your phone, tablet, or laptop several times over — and can be fully recharged in about an hour and a half (or less with emergency charging enabled).\nGarmin’s inReach Messenger Plus is a satellite communicator that allows you to send text, pictures, or voice messages from remote areas, and it’s going for $449.99 ($50 off) at Amazon and Best Buy. It has a 1,600-character or 30-second voice clip limit, but that’s enough to get a message through in case of an emergency. The rugged gadget can also last up to 25 days on a single charge, and its IPX7 rating means it’s protected against dust and water. Just note that you’ll need a Garmin subscription, which starts at $7.99 a month, to use it.\nStarlink Standard Kit\nStarlink’s Standard Kit comes with both an antenna and a router, which allows you to easily connect your devices to a satellite-based internet connection. Download speeds up to 280Mbps are possible, but will vary by region, subscription tier, and weather conditions.\n\nWhere to Buy:\n\n $349.99 $174.97 at Walmart\n $349.99 $174.99 at Best Buy\n $349.99 $175 at The Home Depot\n\nBreeo’s X24 Smokeless Fire Pit is down to $499 ($100 off) at Amazon, its best price to date. The fire pit is made from Corten Steel and features a raised air vent and perforations near its rim to provide continuous airflow, which keeps the fire alive and re-burns the wood to reduce smoke production. Breeo says the fire pit’s material will patina over time, so don’t be alarmed if it changes color after a few uses. If you have additional space, Breeo’s X30, which is designed to accommodate eight chairs around it, is also on sale for an all-time low of $1,189.15 ($210 off) at Amazon and from Breeo.\nMSR’s TrailShot Pocket-Sized Water Filter is currently going for around $48 (about $16 off) at Amazon, which is the lowest price we’ve seen in months. The 5.2-ounce water filter is small enough to fit in your pocket and easy enough to use one-handed, letting you quickly remove 99 percent of bacteria, protozoa, and particulates. You can use the water filter to drink directly from a water source or fill a 1-liter bottle in just 60 seconds. And it’s easy to clean, too — just give it a few shakes to restore the flow rate.\nLifeStraw Peak Series Straw\nLifeStraw’s redesigned Peak Series Straw features a durable, leakproof design that’s great for backcountry treks. It can remove unwanted viruses, bacteria, and microplastics as you drink — just like the base model — but benefits from an increased flow rate and more premium materials.\n\nWhere to Buy:\n\n $24.95 $18.71 at Amazon\n $24.95 $18.71 at LifeStraw\n\n\nMpowerd Luci Solar String Lights: Color\nMpowerd’s solar-powered string lights are perfect for camping or a backyard shindig. The 18-foot string can display six colors and last up to 15 hours on a single charge; the case also doubles as a charger, allowing you to top off your phone in a pinch.\n\nWhere to Buy:\n\n $54.95 $32.93 at REI\n $54.95 $32.97 at Amazon\n\nMiscellaneous deals \nAnker 25,000mAh Laptop Power Bank\nAnker’s premium power bank can refill a smartphone battery multiple times, and charge most laptops at their maximum speed. Its most convenient feature is the two USB-C cables built into it, so you don’t have to carry separate cords. \n\nWhere to Buy:\n\n $119.99 $94.49 at Amazon\n $119.99 $94.99 at Anker (code WS7DV2RO9DEU) \n\n\n13-inch Apple MacBook Air 13 (2025, M4)\nThe M4 MacBook Air has a speedy processor, and double the RAM of previous models. It has a thin and light design, all day battery life, and still starts with 256GB of storage. Read our review.\n\nWhere to Buy:\n\n $999 $799 at Amazon\n\nAmazon and Anker (with code WS7DV2HNCKH8) are selling Anker’s 30W Nano Charger starting at $12.29 (about $4 off). It has just a single USB-C port and won’t charge bigger devices like laptops at sufficient speeds, but its petite size and collapsible plug make it handy for travel.\nYou can buy a four-pack of AirTags at Walmart for just $69.99 ($34 off), which is $5 shy of the bundle’s best price to date. Apple’s ubiquitous Bluetooth trackers feature an ultra-wideband chip and connect to the company’s massive Find My network, which translates to exceptionally precise tracking if you’re an iPhone owner. The waterproof trackers also run on user-replaceable batteries and come with a host of neat software tricks, including one that allows you to share their location with up to five people or with one of several airlines.\nAnker MagGo Wireless Charging Station (3-in-1, Dock Stand)\nAnker’s MagGo Wireless Charging Station features a MagSafe charging stand, a Qi wireless charging pad, and an Apple Watch charger. It should charge all three devices at their top speed simultaneously, and comes with a 40W USB-C power adapter and cable.\n\nWhere to Buy:\n\n $89.99 $69.99 at Amazon (with Prime)\n $89.99 $69.99 at Anker (with code WSPDV2QWE69S)\n\nIf you have a smaller space, a single Eero 6 Mesh Wi-Fi router may be sufficient, and you can pick one up for $74.99 ($15 off) — which is lower than its Prime Day price — at Amazon, B&H Photo, and Best Buy. The router can create a network covering up to 1,500 square feet, connect to 75 devices at once, and deliver speeds of up to 900Mbps. If you move to a larger place, you can pick up an additional router (or two) to expand your network. A bundle that includes one router and two extenders is currently going for $159.99 ($40 off) at Amazon and B&H Photo, if you need a larger network now.\nElgato Stream Deck Neo\nThe Stream Deck Neo is a compact macro controller with eight LCD keys, which can be programmed to carry out various shortcuts on your computer. It also features a small information display and two capacitive buttons, allowing you to quickly navigate pages upon pages of macros.\n\nWhere to Buy:\n\n $99.99 $79.99 at Amazon\n $99.99 $79.99 at Best Buy\n $99.99 $79.99 at Elgato\n\nUpdate, September 2nd: Adjusted pricing / availability, and removed expired discounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba000e4c403761382b7e2ddf8d814db92aacc87e",
      "title": "Burkina Faso's parliament votes to outlaw homosexual acts",
      "url": "https://www.bbc.com/news/articles/c2060er4062o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T14:46:32.000Z",
      "summary_90w": "",
      "raw": "People could face up to five years in prison for breaking the new measure once signed into law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb6e48f9e97b0e794849b25e9829551b4d4ece4c",
      "title": "The Backbone Pro controller is $20 off for a limited time",
      "url": "https://www.theverge.com/tech/768973/backbone-pro-bluetooth-gaming-controller-intel-battlefield-6-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T14:42:53.000Z",
      "summary_90w": "",
      "raw": "If you’ve ever thought “it’d sure be nice to have just one controller to use between my phone, tablet, and TV,” then the Backbone Pro might be made for you. Backbone’s newest gamepad has the same phone-hugging design as its 2020 predecessor, but comes with a handful of distinct features — the most notable being that it can be paired via Bluetooth to any number of devices, not just phones. The rechargeable controller just got its first temporary price cut, going from $169.99 to $149.99 at Amazon and Best Buy. Best Buy indicates this sale will expire at the end of the day.\nBackbone Pro\n\nWhere to Buy:\n\n $169.99 $149.99 at Best Buy\n $169.99 $149.99 at Backbone\n $169.99 $149.99 at Amazon\n\nThe Pro features more robust grips and bigger analog sticks (they’re ALPS, not Hall effect, sadly) while retaining the original’s hallmark feature, which is that Android and iPhone models with a USB-C port can be inserted into the controller, from which you can launch into Backbone’s polished dashboard. It effectively turns your phone into a console, with the ability to snap/record clips, chat with friends through the platform, and livestream, if you wish. It also has a USB-C port for passthrough charging, a 3.5mm headphone jack, and two customizable rear paddles.\nThe Pro offers more versatility than the original (the Pro is a solid wireless Steam Deck controller), and can perform a cool party trick, if you have the right hardware and subscriptions. If you start an Xbox cloud game streaming session from your phone, you can resume it from a TV that supports the Xbox app, and easily switch the Pro to control it there instead via Backbone’s mobile app.\nWhile few competitors attempt Backbone’s multipurpose pairing, some outshine the Pro when it comes to being able to fit more devices, namely iPads and other tablets. The GameSir G8 Plus is $79.99 and can fit an iPad mini or a Nintendo Switch. The $199.99 Razer Kishi V3 Pro XL can be widened to fit a 13-inch tablet in its maw, and features TMR thumbsticks and a six-month subscription to Apple Arcade.\nOther Verge-approved deals\nLooking for an affordable desktop GPU that includes a free code for Battlefield 6? You could do a lot worse than the stock Intel Arc B580, which is $259.99 at B&H Photo. (A prettier model from ASRock that includes more fans is just $10 more at Newegg, costing $269.99.) The B580 is a reasonably priced midrange graphics card aimed at gamers who are content playing games at 1080p resolution, although some games might perform well at 1440p. For example, it’s the GPU that EA recommends for 60 frames per second gameplay at 1440p for Battlefield 6, even if the rest of your system’s components aren’t all that recent. Here are the recommended specs\nAllTrails’ Labor Day special on its Plus tier hiking software is still happening. Normally $35.99 per year, it costs $17.99 to sign up for a year. AllTrails Plus offers a bunch of perks for hikers and trail lovers, including offline map downloads, an ad-free experience, printable maps, smart alerts if you make wrong turns, and a bevy of social features. My colleague Elizabeth Lopatto put AllTrails through a real-world test, up against its biggest competitors in the space, Gaia and CalTopo. Her conclusion was that there’s no perfect hiking software, but that “AllTrails offered better route-planning features, while Gaia was more reliable on the trail.” If you’re curious about hiking software, picking up a year of AllTrails Plus at half price seems worth a shot.\nThe JBL Tour Pro 2 wireless earbuds are down to $134.95 at Amazon, a significant discount from its original $249.95 price. These are JBL’s high-end earbuds that include a charging case with a built-in screen on the front. The screen does a decent job at replicating some features that you’d otherwise find on a smartwatch. For instance, it’ll show who’s calling, and let you either answer or reject the call. It can also alert you when you’ve received a text, although it won’t show the contents on its screen (that’s either a plus or a minus, depending on who you ask). In terms of sound quality, former Verge reviewer Chris Welch preferred Apple’s AirPods Pro and Sennheiser’s Momentum 3 to these, but at almost half-price, JBL’s set is worth considering. Read our review",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9a8e83f4b1c2aebd9a96217509f8f8446a89c9da",
      "title": "Ex-actor Zack Polanski's unusual path to become Green Party's new leader",
      "url": "https://www.bbc.com/news/articles/clyrev00lwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T14:38:46.000Z",
      "summary_90w": "",
      "raw": "Zack Polanski has stormed to victory on a platform promising bold communication and \"eco-populism\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "529fb53dc0cb1d411612c1e3abb35c9f16a14c63",
      "title": "Klarna revives IPO plans, aims to raise $1.27B",
      "url": "https://techcrunch.com/2025/09/02/klarna-revives-ipo-plans-aims-to-raise-1-27b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:30:52.000Z",
      "summary_90w": "",
      "raw": "Swedish buy now, pay later (BNPL) startup Klarna and its shareholders are reviving its initial public offering, hoping to raise as much as $1.27 billion in a listing that would value the company at up to $14 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6137e8045fcd757c81c24902e7098b04f0606915",
      "title": "Amazon ends shared Prime free shipping outside your home",
      "url": "https://www.theverge.com/news/769051/amazon-prime-free-shipping-benefit-sharing-ending",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T14:29:16.000Z",
      "summary_90w": "",
      "raw": "Amazon is axing the program that lets Prime members share their free shipping perk with people outside their household. In an update to its support page, Amazon says it will cut off Prime benefit sharing on October 1st, 2025, prompting invitees who don’t live with the account holder to sign up for their own subscription at a discounted $14.99 rate for an entire year (and then $14.99 per month after that).\nInstead, Amazon is replacing this program with Amazon Family, which lets account holders share Prime benefits — but only with people they live with. Amazon says everyone in a “Family” must live at the same primary residential address, defined as “the address you consider to be your home and where you spend the majority of your time.”\nAs we’ve seen with several streaming services that have cracked down on password sharing, Amazon is likely ending the program as a way to shore up new subscribers. On Tuesday, Reuters reported that Amazon didn’t meet Prime signup goals in the US during its extended Prime Day event in July, though the company reportedly said it had record signups in the 25 days surrounding the event.\nLaunched in 2015, Amazon Family (formerly Amazon Household) offers access to free shipping, along with additional perks like Prime Video, Prime Reading, third-party benefits like GrubHub, shared ebooks, Amazon Music, and more. You can only add up to one other adult that you live with to your account, up to four teens (but only if you added them before April 7th, 2025), and up to four child profiles.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f5aebe63d3e84e946a7f7f19216060a7d95c1cc",
      "title": "A California judge rules that Trump's deployment of the guard to LA was illegal",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525647/a-california-judge-rules-that-trumps-deployment-of-the-guard-to-la-was-illegal",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T14:22:15.000Z",
      "summary_90w": "",
      "raw": "President Trump took control of the state's National Guard in June and deployed it to Los Angeles to face anti-immigration protestors and assist officers making detentions and deportations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3b11f560239f2590834de499304632bd356d0452",
      "title": "Gold price hits record high as investors seek safety",
      "url": "https://www.bbc.com/news/articles/ceqyq7r8703o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T14:15:23.000Z",
      "summary_90w": "",
      "raw": "Experts say uncertainty resulting from US policy is making investors seek safer investments such as gold.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14b7a8a37e3db8455f33980e1ecb1bc638c314a6",
      "title": "Just 4 days left to exhibit at TechCrunch Disrupt 2025 — 10 tables remain",
      "url": "https://techcrunch.com/2025/09/02/just-4-days-left-to-exhibit-at-techcrunch-disrupt-2025-10-tables-remain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The clock is ticking, and exhibit space at TechCrunch Disrupt 2025 is moving fast. With just 4 days and 10 table left to book, now’s the time to stop circling the idea and claim your spot on the show floor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2f7dbb58839b7d5f096d79cb02cf486220c06933",
      "title": "What's causing the UK's long-term borrowing costs to rise?",
      "url": "https://www.bbc.com/news/articles/clyry4rg9wyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:38:10.000Z",
      "summary_90w": "",
      "raw": "The cost of government borrowing has risen again - what does it mean for the public finances and upcoming Budget?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42373b97478dbdee5bf76454f7a93c836fc92e83",
      "title": "The Office spin-off turns comic spotlight on hapless newsroom",
      "url": "https://www.bbc.com/news/articles/c7vl2pv4p7po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:36:00.000Z",
      "summary_90w": "",
      "raw": "The deadpan US mockumentary follows a struggling Midwestern newspaper, the Toledo Truth-Teller.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49468c6f61aa45f7746a676e94b1aa556229c449",
      "title": "Gérard Depardieu to face trial over rape and sexual assault allegations ",
      "url": "https://www.bbc.com/news/articles/cm2v2w8m88no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T13:35:40.000Z",
      "summary_90w": "",
      "raw": "His accuser, Charlotte Arnould, says she is relieved the case is going to court, seven years after she filed a complaint.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871e468947017c14e79f6657c777c3af7e6b7830",
      "title": "Astro Teller, “Captain of Moonshots,” joins TechCrunch Disrupt 2025 this October",
      "url": "https://techcrunch.com/2025/09/02/astro-teller-is-joining-us-at-techcrunch-disrupt-2025-in-october/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T13:35:39.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 is about to get even more exciting. We’re thrilled to announce that Astro Teller, the head of Alphabet’s X (aka the Moonshot Factory), will take the stage at Disrupt, happening October 27–29 at Moscone West in San Francisco. For more than a decade, Teller has guided X’s audacious mission to tackle the […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15d56ac5fce1033896de9416cb5260a786388161",
      "title": "Chloe Malle to become top editor at American Vogue ",
      "url": "https://www.bbc.com/news/articles/c0l6lw6je7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:19:34.000Z",
      "summary_90w": "",
      "raw": "The 39-year-old's appointment marks a new era for one of the most influential and glamorous fashion publications.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8d2fc469147045cdde414505343391cb2a3b347",
      "title": "Sainsbury's to trial facial recognition to catch shoplifters",
      "url": "https://www.bbc.com/news/articles/c15l5p4zwdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:15:50.000Z",
      "summary_90w": "",
      "raw": "Sainsbury's says the technology is part of efforts to identify shoplifters to curb retail crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8e24e7cf8cb54d4c1d8fdfbe913bcb6eca9ddef",
      "title": "The figures behind Scotland's drug death toll",
      "url": "https://www.bbc.com/news/articles/cgqnx74ld07o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:13:16.000Z",
      "summary_90w": "",
      "raw": "As the number of fatal overdoses fall, we look at the figures and the efforts to tackle Scotland's drug problem.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d8f6f56e84ce0719da49c43e25e83b94dfee295",
      "title": "These scientists found Alzheimer's in their genes. Here's what they did next",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/02/nx-s1-5522371/alzheimers-risk-apoe4-genes-scientists-treatment-advocacy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T13:09:33.000Z",
      "summary_90w": "",
      "raw": "Three scientists learned they carry genes that dramatically increase their risk for Alzheimer's disease. Now they're working to keep their brains healthy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c81c5c7ed3b661549075615078a4fdbf4edcb646",
      "title": "My favorite cooking gadget is getting a big upgrade",
      "url": "https://www.theverge.com/news/768614/thermomix-tm7-us-release-price-specs-launch-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T13:05:00.000Z",
      "summary_90w": "",
      "raw": "The Thermomix TM7 is the next generation of one the most versatile cooking appliances you can buy.\t\n\nI’ve owned a Thermomix TM6 for about five years, and I use it multiple times a day for everything from making smoothies in the morning to steaming veggies for dinner, whipping up a sauce, or cooking some rice. It’s the most versatile smart gadget in my kitchen. Now its successor, the Thermomix TM7, has arrived in the US, launching today for $1,699. \nYes, it’s expensive — but this all-in-one machine is designed to replace a countertop’s worth of gadgets, with functions like weighing, chopping, whisking, steaming, sautéing, slow cooking, and even fermenting. The standout upgrade is a larger 10-inch touchscreen powered by a faster multicore processor. However, I‘m wary of the missing physical dial, as the screen features all the device’s controls, as well as access to 200 built-in guided cooking recipes (and many more with a Cookido subscription for $65 a year). \nThe rest of the TM7 has been redesigned as well, with a sleeker, all-black design, an open-lid cooking option, and a larger steaming basket. Vorwerk, which owns Thermomix, says its software platform has been rebuilt from the ground up to enable future bigger updates — including voice control.\nThe TM6, which launched in 2019, has been discontinued, but Vorwerk has committed to 10 years of support.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ccffc1fde4f9fb4d9308685761f164a52aa953d",
      "title": "Italy considers hiding state flight paths after jamming of von der Leyen plane",
      "url": "https://www.theguardian.com/world/2025/sep/02/italy-looks-at-hiding-state-flight-paths-after-jamming-of-von-der-leyen-plane",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T13:02:42.000Z",
      "summary_90w": "",
      "raw": "EU member states debate how to make leaders’ flights more secure as Russia blamed for GPS loss\nItaly is considering keeping state flights secret after the satellite signal of the aircraft carrying the European Commission president, Ursula von der Leyen, was allegedly jammed by Russia, Italian defence ministry sources said.\nVon der Leyen, a fierce critic of the Russian president, Vladimir Putin, and Moscow’s war in Ukraine, was flying to Bulgaria on Sunday when her charter plane lost satellite navigation aids, delaying its arrival in Plovdiv, and reportedly forcing it to circle an airport for an hour.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "450385798164892a1edeb802864365634d8b0789",
      "title": "China drilling for oil and gas inside Taiwan’s exclusive economic zone",
      "url": "https://www.theguardian.com/world/2025/sep/02/china-drilling-oil-gas-inside-taiwan-exclusive-economic-zone",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T13:00:54.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Experts say the move could be part of Beijing’s ‘greyzone’ grab for disputed territory\nChina is drilling for oil and gas inside Taiwan’s exclusive economic zone (EEZ), a move that analysts believe is likely part of Beijing’s unilateral grab for disputed territory that could also aid a future invasion of Taiwan.\nDuring July and August at least 12 oil and gas vessels and permanent structures were detected inside Taiwan’s EEZ – including one within 50km of the restricted-waters border of the Taiwan-controlled Pratas Islands – as well as several steel supports for fixed offshore drilling platforms, called jackets. Their presence inside Taiwan’s EEZ have not been previously reported.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df4dbc2a62f62d2d5bce797304aa2b695abc9818",
      "title": "Dozens of scientists find errors in a new Energy Department climate report",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5521384/energy-report-scientists-climate-change",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T13:00:00.000Z",
      "summary_90w": "",
      "raw": "More than 85 scientists say that a recent U.S. Department of Energy report is full of errors and misrepresents climate science.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1bfe024eabe41479e19d419f512eb7f0e277e07",
      "title": "Police officers win payout over Tallia Storm picture",
      "url": "https://www.bbc.com/news/articles/c9qyqy19vj9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T12:38:59.000Z",
      "summary_90w": "",
      "raw": "An employment tribunal found Police Scotland directly discriminated against the pair who had their firearms removed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people were killed in a landslide in western Sudan on Sunday, according to a rebel group that controls the area.\nThe landslide, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, said the Sudan Liberation Movement/Army (SLM).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bb911816af7d9e9f92fae4f38df366e63d335ba",
      "title": "Germany's far-right AfD suffers series of candidate deaths ahead of local vote",
      "url": "https://www.bbc.com/news/articles/c5ykyewrerpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T12:12:54.000Z",
      "summary_90w": "",
      "raw": "Police say there is no evidence of foul play, ahead of local elections in western Germany.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "892bb402d5b33b30d9eb9ef0a20c157d80d0ca44",
      "title": "Jair Bolsonaro faces justice over alleged attempt to usurp Brazilian democracy",
      "url": "https://www.theguardian.com/world/2025/sep/02/jair-bolsonaro-faces-justice-over-alleged-attempt-to-usurp-brazilian-democracy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:12:38.000Z",
      "summary_90w": "",
      "raw": "Former president in court along with seven others accused of failed power grab after losing 2022 election\nBrazil’s former president Jair Bolsonaro and seven of his allies, including four senior members of the military, have gone on trial for allegedly attempting to stage a coup – the first time in Brazilian history such powerful figures have faced justice for seeking to topple the country’s democracy.\nBolsonaro, a paratrooper turned far-right populist who governed from 2019 until 2023, stands accused of masterminding a failed power grab after losing the 2022 election to the leftist Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d1598cf1217e9e63639539aff5fc34eff9051da",
      "title": "Kim Jong-un arrives for Beijing military parade on special armoured train",
      "url": "https://www.theguardian.com/world/2025/sep/02/north-koreas-kim-jong-un-to-arrive-in-beijing-for-military-parade-on-special-armoured-train",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:05:56.000Z",
      "summary_90w": "",
      "raw": "Slow but specialised form of transport has been used by the reclusive country’s leaders for decades\nNorth Korea’s leader, Kim Jong-un, has arrived in Beijing on his signature green train to attend a military parade in China celebrating the formal surrender of Japan in the second world war.\nKim left Pyongyang for China on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42c431dbf6d49382d6adc81880a2cfb8157b19a1",
      "title": "Whisky maker Suntory’s CEO resigns amid investigation into suspected illegal supplements",
      "url": "https://www.theguardian.com/business/2025/sep/02/whisky-suntory-ceo-resigns-takeshi-niinami",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T11:52:37.000Z",
      "summary_90w": "",
      "raw": "Takeshi Niinami bought supplements in the belief that they were legal, says Jim Beam and Laphroaig owner\nTakeshi Niinami, one of Japan’s best-known business leaders, has resigned as chief executive of the drinks company Suntory after police raided his home as part of an investigation into suspected illegal supplements.\nHis resignation from the owner of the Jim Beam whisky brand has sent shockwaves through Japan’s corporate world, with Suntory executives attempting to reassure investors and consumers at a hastily arranged news conference.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24cd045a7276ab858581db6792ace812b83c0436",
      "title": "Kraft Heinz is splitting up, separating hot dogs from ketchup",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5464951/kraft-heinz-split-breakup",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T11:26:42.000Z",
      "summary_90w": "",
      "raw": "One of the world's largest food brands is splitting apart a decade after a messy megamerger staged by Warren Buffett.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "706612c3da0e149ef99f242dcbe5aceecc4fdf36",
      "title": "Bulger killer Jon Venables set for parole review",
      "url": "https://www.bbc.com/news/articles/cnv7vrenq85o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T11:19:54.000Z",
      "summary_90w": "",
      "raw": "Jon Venables, who was 10 when he killed James Bulger in 1993, last sought parole in December 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9864a8df2d4874845a5eeb517c3073c476e3bd3",
      "title": "Congress returns to Washington. And, Brazil's ex-president starts trial today",
      "url": "https://www.npr.org/2025/09/02/g-s1-86612/up-first-newsletter-congress-returns-government-shutdown-brazil-jair-bolsonaro-trial-afghanistan-earthquake",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T11:18:31.000Z",
      "summary_90w": "",
      "raw": "Congress returns to the nation's capital as the deadline to avoid a government shutdown looms. And, Brazil's former president is on trial for attempting to overthrow the government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b969a77598ded10ac33060800b9978089f1b435",
      "title": "'Liverpool's record-breaking summer has surely made title a formality'",
      "url": "https://www.bbc.com/sport/football/articles/ceqyq52d2rvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T11:13:01.000Z",
      "summary_90w": "",
      "raw": "Has Liverpool's spending spree made the Premier League title race a formality? Chief football writer Phil McNulty reflects on the close of the transfer window.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98caf8192a0a5b3b565b576859af46382a75ad24",
      "title": "Whatever happened to mpox? Is it still a threat?",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/02/g-s1-86303/mpox-outbreak-africa",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T11:05:02.000Z",
      "summary_90w": "",
      "raw": "The virus took the world by storm. It was declared a \"public health emergency of continental concern.\" What's the current status? With the U.S. aid cuts, one doctor says, \"We're flying blind.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06aa1975d4538ca33b10208bfacf5a7f5dcd9730",
      "title": "Hundreds killed in Sudan landslide, UN  says",
      "url": "https://www.bbc.com/news/articles/cdj2jygzzk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T10:45:30.000Z",
      "summary_90w": "",
      "raw": "Sunday's landslide followed heavy rain and \"levelled\" a remote village, a local armed group says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b016be77d542ad20842b37dd9878a0d42e93294c",
      "title": "Billy Bragg releases song in support of Palestine and Greta Thunberg aid flotilla",
      "url": "https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T10:40:02.000Z",
      "summary_90w": "",
      "raw": "Hundred Year Hunger – which has a chorus in Arabic – has been released by the British protest singer to coincide with a humanitarian aid flotilla heading for Gaza\nBilly Bragg has released a new original song to show his support for the people of Palestine. The title of Hundred Year Hunger was inspired by a new book of the same name by E Mark Windle about the history of chronic malnutrition and deprivation in Gaza and will raise money for the Amos Trust’s Gaza Appeal.\nWriting on Instagram, the British protest singer said that the song “looks at the current famine that Israel has created in Gaza through the lens of a century of enforced food insecurity and malnutrition imposed on the Palestinian people, firstly by British imperialism, then as a weapon of mass displacement by the state of Israel”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c6c346e2a8e935580af4be06c7a136a230de45a",
      "title": "Archaeologists in Peru discover 3D mural that could date back 4,000 years",
      "url": "https://www.theguardian.com/world/2025/sep/02/archaeologists-peru-discover-mural-4000-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T10:30:33.000Z",
      "summary_90w": "",
      "raw": "The unprecedented find has shifted archaeological understanding about the first civilisations in the Americas\nArchaeologists in Peru have discovered a multicoloured three-dimensional wall that could date back 4,000 years, in an unprecedented find that has shifted archaeological understanding about the first civilisations in the Americas.\nThe centrepiece of the three-by-six metre wall carving is a stylistic depiction of a large bird of prey with outstretched wings, its head adorned with three-dimensional diamond motifs that visually align the south and north faces of the mural. It is covered with high-relief friezes and features designs painted in blue, yellow, red and black.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3bbe066f9ca264069dd0d492f08ca06849b7d8f",
      "title": "UK could see second night of dazzling Northern Lights ",
      "url": "https://www.bbc.com/news/articles/c5yey8l59p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T10:04:25.000Z",
      "summary_90w": "",
      "raw": "The lights put on a strong display on Monday and could continue into Tuesday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "910ae0104548d97d85ff425073854c427e32a780",
      "title": "Battle for history: China's WWII anniversary rekindles legacy debate",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5522234/china-80th-anniversary-wwii-battle-legacy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T09:03:38.000Z",
      "summary_90w": "",
      "raw": "A military parade in Beijing marking the end of World War II will draw leaders from around the world. It's an opportunity for the Communist Party to shape the narrative surrounding the end of the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "412aa03368e77abdc17146130a428eacb10acfcf",
      "title": "Federal tax credits for electric vehicles are ending, leading to spike in sales",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650/federal-tax-credits-for-electric-vehicles-are-ending-leading-to-spike-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T08:59:57.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b0afda85cdeb6c3935cb399073b567879e6a5aae",
      "title": "Russia's Putin hails 'unprecedented' ties with China at talks in Beijing",
      "url": "https://www.bbc.com/news/articles/cr4e4ngvvnro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T08:51:33.000Z",
      "summary_90w": "",
      "raw": "The two leaders are seeking to promote \"a more just and reasonable global governance system\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ddb4583e1d68cd78a8f4eaac843bcb10178d0cdb",
      "title": "How oil has brought Russia, China and India closer",
      "url": "https://www.bbc.com/news/articles/c627p49lp40o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T08:28:59.000Z",
      "summary_90w": "",
      "raw": "Russia's Vladimir Putin met China's and India's leaders in Tianjin in a show of solidarity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70d57a67fb82f005c30fec4598a2ea029e8a9aaa",
      "title": "How real is Love Is Blind? Behind the pods, edits and drama",
      "url": "https://www.bbc.com/news/articles/c939edkn4j4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T07:59:15.000Z",
      "summary_90w": "",
      "raw": "Thirty hopefuls entered the pods, five couples got engaged, three were married but only one remains together.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7789d37b5c798382871e02e48886c6dee9e86066",
      "title": "Beijing tightens control ahead of Xi's big moment on world stage",
      "url": "https://www.bbc.com/news/articles/cn020wrnw78o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T06:37:27.000Z",
      "summary_90w": "",
      "raw": "It is a big week for Xi Jinping, who will host Vladimir Putin and Kim Jong Un in Beijing at a massive military parade.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "513444dfa843e2ed963274b891736ebe8f13c954",
      "title": "BMW, I am so breaking up with you",
      "url": "https://techcrunch.com/2025/09/01/bmw-i-am-so-breaking-up-with-you/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T06:07:36.000Z",
      "summary_90w": "",
      "raw": "I’m driving my i4 back to the dealership as soon as my lease is over. I'm surprised to say I can't wait.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d8d9f4b8db8ac5bd309c52071484e2eff4658b2a",
      "title": "Eight-hour traffic jams in Delhi suburb as rains wreak havoc",
      "url": "https://www.bbc.com/news/articles/c5yeyg5n08jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T05:56:51.000Z",
      "summary_90w": "",
      "raw": "The traffic snarl, which stretched on for miles, trapped thousands of commuters for hours.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3104d87a5bd662056b24e30dd277002d2f0a57c4",
      "title": "Twenty missing in Indonesia protests, rights group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/indonesia-protests-twenty-missing-rights-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T04:59:50.000Z",
      "summary_90w": "",
      "raw": "Mass protests first erupted last week, prompted by anger over the perks and benefits given to lawmakers, including a controversial housing allowance\nAt least 20 people are missing following violent protests that have gripped cities across Indonesia over the past week, a human rights group has warned.\nMass protests first erupted on 25 August, prompted by anger over the perks and benefits given to lawmakers, including a controversial housing allowance. Public fury escalated further when a motorcycle taxi driver, 21-year-old Affan Kurniawan, was run over by a police vehicle at a protest site.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8173a2881ad5fc29a63310a224b2a0a4e43aa596",
      "title": "Indian grocery startup Citymall raises $47M to challenge ultra-fast delivery giants",
      "url": "https://techcrunch.com/2025/09/01/indian-grocery-startup-citymall-raises-47m-to-challenge-ultra-fast-delivery-giants/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T04:30:00.000Z",
      "summary_90w": "",
      "raw": "Citymall's funding comes at a time of a quick-commerce frenzy in the Indian market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T04:08:12.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5bbd5ddade2f3b4c8ec87a973c5fd34539ccc944",
      "title": "Starter homes are scarce, so Utah set a target to build more. Here's how it's going",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5431545/starter-homes-utah-housing-cost-affordable-target",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T04:01:00.000Z",
      "summary_90w": "",
      "raw": "In one of the country's priciest housing markets, Utah's leaders worry young people are shut out from building wealth. But despite new incentives, few developers are signing on to build smaller homes.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c4629edf45809674f00a41f8fc05add6df351804",
      "title": "US and Indian VCs just formed a $1B+ alliance to fund India’s deep tech startups",
      "url": "https://techcrunch.com/2025/09/01/u-s-and-indian-vcs-just-formed-a-1b-alliance-to-fund-indias-deep-tech-startups/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T03:30:00.000Z",
      "summary_90w": "",
      "raw": "Eight U.S. and Indian VC and PE giants are teaming up to fuel India's deep tech boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55abcc58b765874002cccc0e12e0c9f1be960d7b",
      "title": "India’s Offgrid raises $15M to make lithium optional for battery storage",
      "url": "https://techcrunch.com/2025/09/01/indias-offgrid-raises-15m-to-make-lithium-optional-for-battery-storage/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T00:30:00.000Z",
      "summary_90w": "",
      "raw": "India's Offgrid Energy Labs has developed proprietary zinc battery tech as a safer, more cost-effective alternative to lithium for energy storage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a3e022afdd2256a34c3a6e280d1c8816a7b3554",
      "title": "Body seen in secret mortuary could solve 50-year mystery of vanished religious leader",
      "url": "https://www.bbc.com/news/articles/clyr1qr529xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T00:18:28.000Z",
      "summary_90w": "",
      "raw": "Compelling evidence to suggest Lebanese Shia leader Musa al-Sadr was killed in Libya is uncovered by BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b464925ff52c8e202576772a8fe3172bfa6f1051",
      "title": "Trial of Brazil's ex-President Bolsonaro enters final phase",
      "url": "https://www.bbc.com/news/articles/c4gzgq9n8xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T23:29:57.000Z",
      "summary_90w": "",
      "raw": "The former president is accused of plotting a coup to remain in power after he lost the 2022 election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e755e93284072beddf13a0715f3d1b6f8a24915b",
      "title": "LayerX uses AI to cut enterprise back-office workload, scores $100M in Series B",
      "url": "https://techcrunch.com/2025/09/01/layerx-uses-ai-to-cut-enterprise-back-office-workload-scores-100m-in-series-b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-01T23:00:00.000Z",
      "summary_90w": "",
      "raw": "This Japanese AI startup just raised $100M to cut businesses’ admin burden.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c0e6d0c8ef09900d8d54bd5f5af91eea6830e085",
      "title": "Watch: Buildings destroyed and rescue efforts under way after deadly Afghanistan earthquake",
      "url": "https://www.bbc.com/news/videos/cqxgx8d14wwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:29:23.000Z",
      "summary_90w": "",
      "raw": "At least 800 people have been killed and thousands injured in the east of the country after a 6.0 magnitude earthquake struck on Sunday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68105a770ce0bbb71d9718bdd33c6fe1ec26154f",
      "title": "How the death of a delivery driver ignited Indonesia",
      "url": "https://www.bbc.com/news/articles/c2dj9w306wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:08:13.000Z",
      "summary_90w": "",
      "raw": "Protests over corruption and inequality have spiralled into violence, arson and deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0fdb78f8cff4588ef25a72cfa9eb65c1c5eb8b01",
      "title": "Space investing goes mainstream as VCs ditch the rocket science requirements",
      "url": "https://techcrunch.com/2025/09/01/space-investing-goes-mainstream-as-vcs-ditch-the-rocket-science-requirements/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-01T20:47:13.000Z",
      "summary_90w": "",
      "raw": "Seven Seven Six's Katelin Holloway represents non-technical VCs pouring billions into space startups, betting operational chops will trump aerospace degrees as the industry shifts from rockets to lunar mining and orbital manufacturing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2fb9d976c818ec7a9a579f2182d03224bc9aad3e",
      "title": "Behind the scenes and front-row access: Volunteer at TechCrunch Disrupt 2025 while you still can",
      "url": "https://techcrunch.com/2025/09/01/behind-the-scenes-and-front-row-access-volunteer-at-techcrunch-disrupt-2025-while-you-still-can/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-01T19:41:46.000Z",
      "summary_90w": "",
      "raw": "With just over a month until TechCrunch Disrupt 2025 hits San Francisco, we’re calling on students, aspiring founders, marketers, and event pros to help the TechCrunch events team pull off one of the largest and most anticipated startup events of the year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8c53797258bf907dbbb347ef267bf701ba52b936",
      "title": "The Downing Street Shake-Up",
      "url": "https://www.bbc.co.uk/sounds/play/p0m08tdx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-01T19:32:00.000Z",
      "summary_90w": "",
      "raw": "The Prime Minister says he’s in “phase two” of government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f316b9681a24d40b1cf17b7e37459bdc772ccd1",
      "title": "Nestlé sacks CEO over ‘undisclosed romantic relationship’",
      "url": "https://www.theguardian.com/business/2025/sep/01/nestle-fires-ceo-after-investigation-into-undisclosed-romantic-relationship",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T18:42:34.000Z",
      "summary_90w": "",
      "raw": "Swiss multinational finds Laurent Freixe breached code of conduct as it names Philipp Navratil as his replacement\nNestlé has dismissed its chief executive, Laurent Freixe, after an investigation into an “undisclosed romantic relationship” with a subordinate that was found to have breached its code of business conduct.\nThe Swiss-headquartered multinational named Philipp Navratil as his replacement.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "803cff7f0e2e215c9795a1585481080681bd70d9",
      "title": "'Covered in dust and too shocked to speak': Afghan villagers reel at scale of quake's devastation",
      "url": "https://www.bbc.com/news/articles/cm2vm2r6dzdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T17:46:47.000Z",
      "summary_90w": "",
      "raw": "Cut off by rock falls in the mountains, locals who survived the tremors help pull injured and dead from the rubble.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f65a37ff4654a963c0a7f61affc3937c5a5b32b2",
      "title": "Guatemala says it is willing to receive hundreds of deported children from US",
      "url": "https://www.theguardian.com/world/2025/sep/01/guatemala-to-receive-deported-children-from-us",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T17:36:33.000Z",
      "summary_90w": "",
      "raw": "Announcement comes a day after a US federal judge halted the deportation of 10 unaccompanied Guatemalan minors\nGuatemala is ready and willing to receive about 150 unaccompanied children of all ages each week from the United States, the country’s president has said, a day after a US federal judge halted the deportation of 10 Guatemalan children.\nThose children had already boarded a plane when a court responded to an emergency appeal on Sunday. They were later returned to the custody of the Office of Refugee Resettlement.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "05e16c7a06da064f96286fcda145e3a0c7a3b9c1",
      "title": "Watch: BBC analyses the warmth and hand-holding at Xi, Modi and Putin's summit",
      "url": "https://www.bbc.com/news/videos/cn0r02zgjj4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T17:09:33.000Z",
      "summary_90w": "",
      "raw": "The Chinese, Indian and Russian leaders were among those attending a regional security summit in China over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89d4226069d5468002f6233efedff9644e32bfd9",
      "title": "Leaked ‘Gaza Riviera’ plan dismissed as ‘insane’ attempt to cover ethnic cleansing",
      "url": "https://www.theguardian.com/world/2025/sep/01/leaked-gaza-riviera-plan-dismissed-as-insane-attempt-to-cover-ethnic-cleansing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T17:08:16.000Z",
      "summary_90w": "",
      "raw": "Prospectus proposes forced displacement of entire population and puts territory into US trusteeship\nA plan circulating in the White House to develop the “Gaza Riviera” as a string of high-tech megacities has been dismissed as an “insane” attempt to provide cover for the large-scale ethnic cleansing of the Palestinian territory’s population.\nOn Sunday the Washington Post published a leaked prospectus for the plan, which would involve the forced displacement of Gaza’s entire population of 2 million people and put the territory into a US trusteeship for at least a decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34dfaa5776a575338c0a898a4ad04f6ae908c6e0",
      "title": "Americanswers…on 5 Live! Why did the internet think Trump was dead?",
      "url": "https://www.bbc.co.uk/programmes/p0m081ky?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-01T16:56:00.000Z",
      "summary_90w": "",
      "raw": "And why is RFK Jr reshaping America’s top health agency?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76acbd403178bf2d6b224298d92f08b2b69fe4ba",
      "title": "‘Coalition of willing’ to discuss security guarantees for Ukraine in meeting on Thursday – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T16:10:54.000Z",
      "summary_90w": "",
      "raw": "Meeting, co-chaired by France’s Emmanuel Macron and UK’s Keir Starmer, will focus on Russia’s refusal to end war. This live blog is closed\nEU transport spokesperson Anna-Kaisa Itkonen also offered a bit more detail on the issue of GPS jamming and its impact on operations.\nShe said:\n“Generally, we have been seeing a quite a lot of such jamming and spoofing activities, notably in the eastern flank of Europe.\nEurope is the most concerned region in the or most affected region globally, on this.\n“We are, of course, aware and used to somehow to the threats and intimidations that are [a] regular component of Russia’s hostile behaviour.\nOf course, this will only reinforce even further our unshakable commitment to ramp up defence capabilities and support for Ukraine.”\n“This incident actually underlines the urgency of the mission that the President is carrying out in the frontline member states.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1e5133d56375d34ead47fd147bd9e53dc654ad4",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-01T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa7118af58788058a39f4d1853814349b14ee1c3",
      "title": "BBC reports from scene as Afghanistan earthquake rescue mission gets under way",
      "url": "https://www.bbc.com/news/videos/c3v3gg6zr3yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T13:53:10.000Z",
      "summary_90w": "",
      "raw": "Rescuers are having to travel by helicopter to the worst-hit areas, as they have been cut off by the earthquake.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7fbb69296862962575dedc4b2b68fb610fef448e",
      "title": "Israel committing genocide in Gaza, world’s top scholars on the crime say",
      "url": "https://www.theguardian.com/world/2025/sep/01/israel-committing-genocide-in-gaza-worlds-top-scholars-on-the-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T12:06:16.000Z",
      "summary_90w": "",
      "raw": "International Association of Genocide Scholars resolution backed by 86% of members who voted\nThe world’s leading genocide scholars’ association has backed a resolution stating that Israel’s actions in Gaza meet the legal definition of the crime.\nOut of the International Association of Genocide Scholars’s (IAGS) 500 members, 28% took part in the vote. Of those who voted, 86% supported the resolution. The resolution states that “Israel’s policies and actions in Gaza meet the legal definition of genocide in article II of the United Nations convention for the prevention and punishment of the crime of genocide (1948).”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "645e32d6afb3e956db899ebfe5c2a713ea41407c",
      "title": "‘We’re winning a battle’: Mexico’s jaguar numbers up 30% in conservation drive",
      "url": "https://www.theguardian.com/world/2025/sep/01/mexico-jaguar-numbers-rise-conservation-drive",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T11:49:48.000Z",
      "summary_90w": "",
      "raw": "Conservationists hope that in 15 years species will no longer be at risk of extinction in Mexico – but challenges remain\nIn 2010, Gerardo Ceballos and a group of other researchers set out to answer a burning question: how many jaguars were there in Mexico? They knew there weren’t many. Hunting, loss of habitat, conflict with cattle ranchers and other issues had pushed the population to the brink of extinction.\nCeballos and his team from the National Alliance for Jaguar Conservation (ANCJ) thought there were maybe 1,000 jaguars across the country. They decided to carry out the country’s first census of the animal to find out exactly how many there were. They found 4,100.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b922ff820e9ad58307010f6072b7e31bb43110a",
      "title": "How Trump is decimating federal employee unions one step at a time",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5515633/trump-federal-workers-labor-unions-va",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump has ended collective bargaining rights for more than one million federal workers. Unions have sued to block the move, but agencies are terminating contracts as litigation continues.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "25420189fc3ebb65efbc241c35d6fdee0cf226b0",
      "title": "Korean skincare industry expected to be hit hard by end of 'de minimus' exemption",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5519724/korean-skincare-industry-expected-to-be-hit-hard-by-end-of-de-minimus-exemption",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T08:56:33.000Z",
      "summary_90w": "",
      "raw": "On Friday, the \"de minimis\" exemption ended -- meaning that imports worth $800 or less won't be able to enter the country tax-free. One of the industries bracing for the impacts is Korean skincare.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0fcb75227b84d874cb05bf8a867bf7cc3931e9b8",
      "title": "Putin, Modi and other world leaders in China for summit",
      "url": "https://www.bbc.com/news/videos/c5y310qngqpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-31T09:39:53.000Z",
      "summary_90w": "",
      "raw": "Russian President Vladimir Putin and Indian Prime Minister Narendra Modi are among the 20 world leaders attending a regional security summit in China.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e55b0d670c13c517abbfaf395427535f85de27bd",
      "title": "Watch: The best looks from the Venice red carpet so far",
      "url": "https://www.bbc.com/news/videos/c9d0zz3145lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-30T19:12:53.000Z",
      "summary_90w": "",
      "raw": "Actor Julia Roberts makes her Venice Film Festival debut promoting her new movie After The Hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cfedc51d287bfd56cf87870ed940b50af617bf9f",
      "title": "Spirit Airlines files for bankruptcy for 2nd time in less than a year",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5522901/spirit-airlines-bankruptcy-filing",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T12:26:13.000Z",
      "summary_90w": "",
      "raw": "The budget carrier filed for fresh bankruptcy protection months after emerging from a Chapter 11 reorganization. The airline said it plans to keep flying as usual during the restructuring process.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b65f7e3d48d2caf1048c46364fb2b06ae7fca123",
      "title": "How colorful do we want our food to be? American shoppers have a say",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5452278/how-colorful-do-we-want-our-food-to-be-american-shoppers-have-a-say",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T11:44:15.000Z",
      "summary_90w": "",
      "raw": "As more major food brands commit to phasing out chemical dyes from snacks and cereals in the U.S., some are struggling to find natural replacements. Many consumers say they want bright colors.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ffe6e27ea56bb28e8d852c29ad02e7aeda0eac93",
      "title": "AI and Nvidia have been bright spots in an uncertain economy, but there are doubts now",
      "url": "https://www.npr.org/2025/08/30/g-s1-86377/ai-nvidia-economy-stocks",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T09:00:00.000Z",
      "summary_90w": "",
      "raw": "This past week, AI darling Nvidia reported blockbuster financial results that beat analysts' expectations. But investors weren't impressed and the stock price dropped.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1ca0ab8c6f56c940793465a1d373e9a2097e433e",
      "title": "Dear Life Kit: Do I have to buy birthday gifts for my 18 nieces and nephews?",
      "url": "https://www.npr.org/2025/08/30/g-s1-86361/dear-life-kit-do-i-have-to-buy-birthday-gifts-for-my-18-nieces-and-nephews",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Experts answer a round of finance questions from NPR's audience, including how to financially support a friend with Stage 4 cancer and how to stop paying for your parents.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4723b4c2df8e8416f323ac2102f695658b51a2af",
      "title": "Watch: Luxury neighbourhood in Lahore submerged in floods",
      "url": "https://www.bbc.com/news/videos/cm2vdm1pnd8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-29T10:34:53.000Z",
      "summary_90w": "",
      "raw": "Watch: Luxury neighbourhood in Lahore submerged in floods",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dc6787af52bfed9e45fe8e71ae022fd60414656",
      "title": "'We love you, you will always be with us', says father of Minneapolis shooting victim",
      "url": "https://www.bbc.com/news/videos/cwy5zzvgj44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T22:49:14.000Z",
      "summary_90w": "",
      "raw": "Fletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "177b57286ae69ad12bcceb2010dd4f0d7657c4d6",
      "title": "BBC reports from scene of deadly Russian attack on Kyiv",
      "url": "https://www.bbc.com/news/videos/c9wy42kjndzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T19:20:44.000Z",
      "summary_90w": "",
      "raw": "Russia launched a major attack on Ukraine's capital in the early hours of Thursday evening, killing at least 19 people, including four children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37aa811eccb417ff986e00dff34d9c6a9bedb670",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "url": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:00:25.000Z",
      "summary_90w": "",
      "raw": "Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing\nMalawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.\nIt comes just months after the World Health Organization (WHO) revealed that the country had successfully reduced tuberculosis (TB) cases by 40% over the past decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7517865a69cee8773511ce04954a1bfa18ce98c8",
      "title": "Attempt to partner African countries with Japanese cities triggers xenophobic backlash",
      "url": "https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T05:01:42.000Z",
      "summary_90w": "",
      "raw": "Cities in Japan have received thousands of complaints amid confusion over scheme that was intended to foster closer ties\nAn attempt to promote friendship between Japan and countries in Africa has transformed into a xenophobic row about migration after inaccurate media reports suggested the scheme would lead to a “flood of immigrants”.\nThe controversy erupted after the Japan International Cooperation Agency, or JICA, said this month it had designated four Japanese cities as “Africa hometowns” for partner countries in Africa: Mozambique, Nigeria, Ghana and Tanzania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a0f764c3195d2709031d36be34005eb81c8a471e",
      "title": "Dance through the history of funk music",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002hqjm/we-want-the-funk?at_mid=WX7MHbacyO&at_campaign=We_Want_the_Funk&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002hqjm&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=We_Want_the_Funk&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T21:32:47.000Z",
      "summary_90w": "",
      "raw": "A comprehensive journey through the history of funk music.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab4598d8865e0f0d1232ce7082ea6bedb82ff570",
      "title": "James May flies to the edge of space in a U2 spy plane",
      "url": "https://www.bbc.co.uk/iplayer/episode/b00lc5ph?at_mid=gpuM05fXU6&at_campaign=James_May_at_the_Edge_of_Space&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=b00lc5ph&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=James_May_at_the_Edge_of_Space&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-04T20:00:36.000Z",
      "summary_90w": "",
      "raw": "Follow his journey as he takes a rare and privileged flight 70,000 feet above Earth",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}