{
  "version": "1755099286834",
  "generatedAt": "2025-08-13T15:34:46.834Z",
  "items": [
    {
      "id": "0473123fef574ea4d1cb3314c1d56b3d2dafcaa8",
      "title": "Macron admits French repression in Cameroon's independence struggle",
      "url": "https://www.bbc.com/news/articles/cly39dd36epo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T15:28:05.000Z",
      "summary_90w": "",
      "raw": "French leader cites independence icons who were killed during military operations led by French forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6a93a27abb9ba8451c568b8d6a7127748748be1",
      "title": "The sprawling Alaskan military base where Trump and Putin will meet",
      "url": "https://www.bbc.com/news/articles/crev9ep2vdgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T15:25:17.000Z",
      "summary_90w": "",
      "raw": "Joint Base Elmendorf-Richardson outside Anchorage has formed a critical part of America's military readiness, dating back to the Cold War.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd3602772a6a7ca50fbe3af9baab8e7fb8cf80a2",
      "title": "In 1985, famine led to Live Aid and a U.S. alert plan. Trump froze it. Now it's back",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/13/g-s1-82265/in-1985-famine-led-to-live-aid-and-a-u-s-alert-plan-trump-froze-it-now-its-back",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T15:18:13.000Z",
      "summary_90w": "",
      "raw": "It's the 40th anniversary of the superstar concert to raise money for an Ethiopian famine — and of the creation of a U.S. program called FEWS NET to prevent future famines.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bcdcbb7e0fc919f2e798dc930d82377f791347de",
      "title": "Claire's on brink of collapse putting 2,150 jobs at risk",
      "url": "https://www.bbc.com/news/articles/cp8zwdy98k8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T15:14:39.000Z",
      "summary_90w": "",
      "raw": "Claire's will appoint administrators in the UK and Ireland, but its shops will stay open as it considers a possible sale.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53a752936affeb06b10c8cf0a1322675ce4add80",
      "title": "I had knife pulled on me in migrant camp, says shadow home secretary",
      "url": "https://www.bbc.com/news/articles/cx2xj7g8vj0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T15:13:55.000Z",
      "summary_90w": "",
      "raw": "Chris Philp says the incident took place as he was talking to people near Dunkirk, France.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7dfcad0330b64ce9ec9397888f789186d66ec1b2",
      "title": "European leaders praise positive call with Trump ahead of his meeting with Putin – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/aug/13/europe-leaders-ukraine-summit-zelenskyy-trump-putin-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T15:12:25.000Z",
      "summary_90w": "",
      "raw": "Zelenskyy accuses Putin of bluffing after a ‘united’ and ‘positive’ call between EU leaders and Trump\nUkraine will not cede land that could be Russian springboard for new war\nWe are now getting reports via agencies that Ukrainian president Volodymyr Zelenskyy has now arrived in Berlin ahead of the series of calls later today.\nSeparately, Estonia has moved to expel a Russian diplomat over alleged “direct and active” involvement in “undermining the constitutional order and legal system of Estonia.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55cb51cb7a8dd323ebeee373a946c6f3a336c0c4",
      "title": "London chess prodigy, 10, becomes youngest female international master",
      "url": "https://www.bbc.com/news/articles/crlz56n9798o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T15:11:41.000Z",
      "summary_90w": "",
      "raw": "Bodhana Sivanandan, from Harrow, also became the youngest female player to beat a grandmaster.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba6564811b756822809cf06af7ce7fa257180be6",
      "title": "DC mayor hardens stance on Trump’s ‘authoritarian’ deployment of national guard – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/aug/13/donald-trump-ukraine-russia-washington-kennedy-center-us-politics-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T15:07:34.000Z",
      "summary_90w": "",
      "raw": "Muriel Bowser urges community members to ‘protect our autonomy… and get to the other side of this guy’ amid Trump’s intervention\nWe can expect to hear from Donald Trump at least a few times today. According to the president’s daily schedule, he’ll make an appearance at the Kennedy Center at 11am ET, and make an announcement.\nHe’ll then head back to the White House and sign executive orders at 4pm ET. For now this will be closed press, but could very well open up.\nWill be speaking to European Leaders in a short while. They are great people who want to see a deal done.\nVery unfair media is at work on my meeting with Putin. Constantly quoting fired losers and really dumb people like John Bolton, who just said that, even though the meeting is on American soil, “Putin has already won.” What’s that all about? We are winning on EVERYTHING. The Fake News is working overtime (No tax on overtime!).\nIf I got Moscow and Leningrad free, as part of the deal with Russia, the Fake News would say that I made a bad deal! But now they’ve been caught. Look at all of the real news that’s coming out about their CORRUPTION. They are sick and dishonest people, who probably hate our Country. But it doesn’t matter because we are winning on everything!!! MAGA\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "250bc17fb675068f9131c79e3e78181903a6a236",
      "title": "‘Mind blown’: scientists discover sex reversal in kookaburras and lorikeets with cause unknown",
      "url": "https://www.theguardian.com/environment/2025/aug/14/sex-reversal-australian-birds-kookaburras-lorikeets",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T15:00:23.000Z",
      "summary_90w": "",
      "raw": "Almost all of the ‘sex discordant’ birds were genetically female but had male reproductive organs, study finds\n\nGet our breaking news email, free app or daily news podcast\n\nAbout 5% of common Australian wild birds including kookaburras and lorikeets could have undergone a “sex reversal” where their genetic sex does not match their reproductive organs, according to a new study.\nThe study is thought to be the first to find widespread sex reversal across multiple wild bird species, but the cause of the phenomenon is not yet known.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df53ef8d2f68f387bef92dc35798c50aeb2c097e",
      "title": "BlueBet fined for allowing man to gamble $700k despite ‘clear red flag behaviours’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/14/bluebet-fined-for-allowing-man-to-gamble-700k-despite-clear-red-flag-behaviours-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T15:00:23.000Z",
      "summary_90w": "",
      "raw": "Regulator found bookmaker prioritised profit over man’s wellbeing by supplying him with bonus bets after he ran out of money to gamble\n\nGet our breaking news email, free app or daily news podcast\n\nA man who “binge gambled” $40,000 in an 11-hour session was awarded VIP status by the bookmaker BlueBet and assigned a dedicated personal manager who encouraged him to keep betting and took a cut of his losses.\nA regulator has found it wasn’t until the man had gambled $700,000 four months later and displayed multiple “clear red flag behaviours” that BlueBet checked whether he could afford to be betting so much.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e4719bce1a184446ea3cd3478aa132c8c16c9f2",
      "title": "Victoria could save nearly $500m over 10 years by scrapping greyhound racing, estimates show",
      "url": "https://www.theguardian.com/news/2025/aug/14/victoria-could-save-nearly-500m-over-10-years-by-scrapping-greyhound-racing-estimates-show",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T15:00:23.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Parliamentary Budget Office analysis shows any loss of revenue from betting would be offset by lower government spending\n\nGet our breaking news email, free app or daily news podcast\n\nThe Victorian government could save almost half a billion dollars if it follows Tasmania in phasing out greyhound racing in the state, according to independent analysis.\nA policy costing by the Parliamentary Budget Office (PBO), to be released on Thursday, estimates the government would save $451.6m between 2025–26 and 2035–36 if it stopped subsidising greyhound racing and closed the industry.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bff84e0a4811a6db9b5ab279b383ba72d9f2a075",
      "title": "Qantas cancels flights at double the rate of Virgin, competition watchdog finds",
      "url": "https://www.theguardian.com/business/2025/aug/14/qantas-cancels-flights-at-double-the-rate-of-virgin-competition-watchdog-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T15:00:21.000Z",
      "summary_90w": "",
      "raw": "Airlines have also been raising fares despite downward pressure on costs from falling jet fuel prices, ACCC says\n\nGet our breaking news email, free app or daily news podcast\n\nQantas has cancelled flights at double the rate of Virgin, its main competitor, which had the lowest monthly cancellation rates of any major domestic airline over the past year.\nAir fares across major Australian airlines have also surged relative to the price of jet fuel in 2025, new analysis from the competition watchdog shows.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba830590e46fd299b648a1cbcfe89991107c37aa",
      "title": "Tensor wants to be the first company to sell you a ‘robocar’ — but who are they?",
      "url": "https://www.theverge.com/news/758605/tensor-autox-autonomous-vehicle-robocar-personal-own-china",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T15:00:00.000Z",
      "summary_90w": "",
      "raw": "A new company is launching today that claims to have developed “the first volume-produced, consumer-ready autonomous vehicle — designed from the ground up for private ownership at scale.” The company is called Tensor, and it describes itself as a “leading AI agentic company” that’s based in San Jose, California — but little information exists online about who or what may be behind this new effort.\nBut according to a trademark application filed last April, Tensor is affiliated with AutoX, a Chinese autonomous vehicle developer with operations in the US as well as its home country. \nIn its announcement, Tensor makes no mention of AutoX or China. The company says it’s “dedicated to building agentic products that empower individual consumers” and that the Tensor robocar is its flagship product. It also claims to have offices in Barcelona, Singapore, and Dubai. It’s likely that AutoX spunoff its US-based team as Tensor to get around government restrictions on Chinese software in vehicles. A spokesperson for the company did not respond to questions about its affiliation with AutoX. \n\nAccording to a trademark application filed last April, Tensor is affiliated with AutoX, a Chinese autonomous vehicle developer with operations in the US as well as its home country. \n\n\nAutoX has been testing its vehicles in and around San Jose since 2016. It’s not as well-known as some of the other autonomous vehicle startups in the US and China. The company was founded in 2016 by former Princeton professor Jianxiong Xiao, a specialist in 3D learning, computer vision, and robotics (who also apparently goes by “Professor X,” according to LinkedIn). Since then, AutoX has nabbed several high-profile investors, including China’s Dongfeng Motor Group and e-commerce giant Alibaba.\nIn 2020, it partnered with Fiat Chrysler (now Stellantis) to launch a robotaxi service in China. In 2022, it opened a robotaxi operation center in San Francisco with the goal of launching a commercial service — though it has yet to obtain the appropriate permits to do so. For the permits it does have, the company appears to have filed its rebranded name with the California Department of Motor Vehicles. Tensor is one of only six companies, along with Waymo and Zoox, with a permit to test fully driverless vehicles on public roads in California.\nNow it appears to be pivoting from robotaxis to “robocars.” Tensor says its vehicle is “the first and only L4 autonomous vehicle available for personal ownership.” It says it will launch in the US, Europe, and the Middle East starting in 2026. \n“When the world shifts… how will you move?” said Amy Luca, chief marketing officer at Tensor, in a press release. “We are building a world where individuals own their personal AGI agents, enhancing freedom, privacy and autonomy. With Tensor, we’re introducing the world’s first personal Robocar, ushering in the era of AI defined vehicles. This isn’t a car as we know it. It’s an embodied personal agent that moves you.” (Luca is the former executive vice president and head of social at Monks, a marketing firm based in London, according to her LinkedIn.)\n\n“When the world shifts… how will you move?” \n\n\nIn using buzz words associated with companies like OpenAI and Anthropic, Tensor appears to be trying to insert itself into the hype-strewn world of chatbots and artificial general intelligence. After all, autonomous vehicles are so last decade.\nTensor’s robocar appears to be no slouch, either. It comes with an array of high-tech sensors, including “37 cameras, 5 lidars, 11 radars, 22 microphones, 10 ultrasonic sensors, 3 IMUs, GNSS, 16 collision detectors, 8 water-level detectors, 4 tire-pressure sensors, 1 smoke detector, and triple-channel 5G.” Of course, those sensors won’t be cheap, though Tensor did not put a price on its future robocar. \nSeveral companies have designs to sell privately owned autonomous vehicles, but none have achieved that milestone. Tesla CEO Elon Musk keeps promising that the “unsupervised” version of the company’s Full Self-Driving feature is just around the corner, but he has yet to deliver. GM has also said that it will eventually sell fully driverless cars to customers. But there remains a thicket of cost and liability concerns that will need to be ironed out before any company can take that next step.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "074ed44c636d32089ea272f2cb909943e4cbc951",
      "title": "Tony Robbins and Peter Diamandis’ longevity company Fountain Life raises $18M",
      "url": "https://techcrunch.com/2025/08/13/tony-robbins-and-peter-diamandis-longevity-company-fountain-life-raises-18m/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The first principal of longevity is, “Don't die of anything stupid,” CEO Dr. William Kapp says. New funding will support mulit-state expansion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc87e792e11c8d0ed8b8a42e6e4e520a9b3bc6c2",
      "title": "Cape Verde declares state of emergency after deadly floods",
      "url": "https://www.bbc.com/news/articles/c87eyv810jyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T14:53:20.000Z",
      "summary_90w": "",
      "raw": "The situation is being described as \"catastrophic\" after islands hit by vast amounts of rain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f1f87699e46884c65b751930131134a06b4b1f0",
      "title": "Some doctors got worse at detecting cancer after relying on AI",
      "url": "https://www.theverge.com/ai-artificial-intelligence/758672/some-doctors-got-worse-at-detecting-cancer-after-relying-on-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T14:48:13.000Z",
      "summary_90w": "",
      "raw": "We’ve heard about upskilling and re-skilling due to AI — but how about de-skilling? A new study published this week found that doctors who frequently use AI to detect cancer in one medical procedure got significantly worse at doing so. \nThe researchers set out to discover whether continuous exposure to AI impacted doctors’ behavior when conducting colonoscopy, so they decided to assess “how endoscopists who regularly used AI performed colonoscopy when AI was not in use.”\nThe answer: Not so hot. The rate was about six percentage points lower. \nThe study was published in The Lancet Gastroenterology & Hepatology journal by medical professionals and researchers in countries including Poland, Norway, Sweden, the U.K., and Japan. It followed doctors at four endoscopy centers in Poland, which were part of a trial program focusing on AI’s use in colonoscopy for potential cancer prevention.\nIt raises questions about the use of AI in healthcare, when it helps and when it could hurt. Last week, The Verge reported on a Google healthcare AI model’s instance of potentially hallucinating a body part and where medical professionals think the industry will go from here.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7fe508e513da0d77c133201487f7748065208754",
      "title": "Twelve South’s 120W charger with Apple Find My support is nearly half off",
      "url": "https://www.theverge.com/tech/758465/twelve-south-plugbug-charger-sonos-ace-headphones-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T14:41:29.000Z",
      "summary_90w": "",
      "raw": "It’s not every day you come across a wall charger that can both power and help you keep track of your devices, but that’s the beauty of Twelve South’s 120W PlugBug. The slim wall charger with four USB-C ports can double as a location tracker when needed, and it’s currently on sale at Amazon for $67.12 (about $53 off) when you clip the on-page coupon. This is a new low price for this high-end configuration.\nTwelve South PlugBug with Find My (120W)\n\nWhere to Buy:\n\n $119.99 $67.12 at Amazon (with on-page coupon)\n $119.99 $87.99 at Best Buy\n $129.99 at Twelve South\n\nAlthough the 50W variant was recently on sale for just $19.99, it’s since increased to $58.99 at Amazon, making it only $10 cheaper than the 120W model. The 120W PlugBug a better value overall, obviously, since the travel-friendly charger offers four USB-C ports as opposed to two, not to mention a lot more power. It’s capable of quickly charging the latest MacBook Pro, as well as other power-hungry laptops.\nWhat really sets this GaN charger apart, though, is its compatibility with Apple’s Find My app. If you own an Apple device, such an iPhone or iPad, you can track the location of the charger along with whatever bag it’s in, just as you would an AirTag.  It even beeps if you accidentally leave it behind, which can be a lifesaver during those frantic mornings when you’re rushing out the door. It’s worth mentioning that the PlugBug includes a coin battery that enables Find My.\nA few more Verge-approved deals\nJisulife’s Handheld Fan Life8 can help keep you comfortable and cool while out and about in the heat, and it’s currently on sale at Amazon and Walmart starting at just $12.74 ($13 off) — just $2 shy of its all-time low. The USB-C fan can be used as in either handheld or tabletop mode, and can last up to 21 hours on a single charge. It also functions as a 60-lumen flashlight and 2,000mAh power bank, making it useful for more than just for keeping cool.\nAs a part of its annual back-to-school sale, Sonos is taking up to 25 percent off a wide range of audio gear through September 1st. The promo includes the Sonos Ace over-ear wireless headphones, which are available from Sonos, Amazon, and Best Buy for $299 ($100 off), which is about $5 shy of their best price to date. The comfy, stylish headphones stand out from rivals by letting you stream audio directly from a Sonos soundbar to the Ace. They also offer great sound, solid noise cancellation, and up to 30 hours of battery life per charge. Read our review.\nIf you want to keep an eye on the air quality in your home, Amazon’s Smart Air Quality Monitor is on sale at Amazon for $54.99 ($15 off), one of its best prices to date. The handy gadget can notify you when it detects a change in air quality, either via voice notifications, Alexa app alerts, or with its built-in LED. It can also turn on Alexa-enabled devices like air purifiers using Alexa Hunches, and Amazon lets you create custom Routines in the app so you can control when exactly these devices turn on. Read our review.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "582c4ba06483c6d2a7fb71ddf9571de14d6e6ca6",
      "title": "Amazon rolls out same-day delivery of perishable groceries in 1,000 US cities",
      "url": "https://techcrunch.com/2025/08/13/amazon-rolls-out-same-day-delivery-of-perishable-groceries-in-1000-us-cities/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T14:40:54.000Z",
      "summary_90w": "",
      "raw": "Shoppers can now order fresh grocery items, including produce, dairy, meat, seafood, baked goods, and more, alongside everyday household products, electronics, and other items available for same-day delivery.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1893561a1ac4bb26a3253b11e2cef7c4f5a63f4d",
      "title": "Three children in court accused of man's murder",
      "url": "https://www.bbc.com/news/articles/cgr99lkjlk4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T14:32:37.000Z",
      "summary_90w": "",
      "raw": "Alexander Cashford, 49, was pronounced dead at the scene in Leysdown-on-Sea in Kent, police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf620350f354dcc441072b0ab880acc73bac896f",
      "title": "A veteran toy racing company is trading slots for smartphone-controlled RC cars",
      "url": "https://www.theverge.com/news/758651/carrera-hybrid-rc-slot-cars-porsche-gt3-r",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T14:28:24.000Z",
      "summary_90w": "",
      "raw": "Carrera Hybrid is reminiscent of Anki Overdrive. | Image: Carrera\t\n\nCarrera, a German company that has been making slot car toys since the ‘60s, has announced a new scaled racing experience that does away with the slots altogether. Carrera Hybrid still has you racing 1:50-scale cars around a reconfigurable track, but you control them using an app on a mobile device and you’re now free to steer anywhere you want, even off the track to overtake an opponent.\nCarrera Hybrid is already available internationally, but the company is launching a starter set in the US on September 1st for $199.99 that includes a mix of 15 straight and curved track pieces and a pair of Porsche 911 GT3 R racers. The company currently offers a wide selection of licensed vehicles for its traditional slot car products, but plans to expand the Hybrid version with recognizable cars from Mercedes-AMG, Audi, and BMW.\nInstead of drawing power from metal rails on the track, the Carrera Hybrid vehicles use rechargeable batteries good for about 30 minutes of racing. Each one connects to a mobile device like a smartphone or a tablet over Bluetooth. You can steer the vehicles by physically turning your device like a steering wheel, but the free accompanying mobile app, available for iOS and Android, can also be paired with a wireless controller making the racing feel more like a video game.\nSensors on the bottom of each car detect printed patterns on the track so the app always knows the position of all the vehicles, and while up to 30 users can race on a single layout, the app limits that to 16 for competitive races where stats are tracked. The free roaming nature of Carrera Hybrid creates more opportunities to overtake opponents while the app increases the realism through sound effects and by letting players fine tune the performance and handling of their vehicles including tire grip and brake sensitivity. The app can also simulate various track conditions for a bigger challenge, or assist less experienced racers with driving aids.\nThe company says it spent the past few years developing the Carrera Hybrid. It’s reminiscent of Anki Drive that debuted in 2013 with a fixed track layout, and the follow-up, Anki Overdrive, that introduced reconfigurable track layouts in 2015. Overdrive offered a lot of the same features and functionality of Carrera Hybrid, plus AI-controlled opponents, but Anki eventually shut down in 2019. Hopefully, given Carrera has been making racing toys for around 60 years, it will continue to invest in its Hybrid offering and keep the AI-powered racing sets around for a lot longer than Anki did.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4891e682dfb21b470a1c89e61510de5dd0d7034d",
      "title": "Welsh Labour politician Hefin David dies aged 47",
      "url": "https://www.bbc.com/news/articles/cq58j18w32no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T14:22:21.000Z",
      "summary_90w": "",
      "raw": "Hefin David had been Member of the Senedd (MS) for Caerphilly since 2016.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "414f1120b112b93a3336665ca8380a7ec7411c5e",
      "title": "Average mortgage rates below 5% for first time since Truss budget",
      "url": "https://www.bbc.com/news/articles/c4gzv41kw3jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T14:05:24.000Z",
      "summary_90w": "",
      "raw": "Average two-year mortgage rates have fallen to 4.99%, the lowest point since September 2022.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0465c63875e11dd8bf99cd7ef0303b2803fe3df",
      "title": "Lammy admits fishing without licence on Vance trip",
      "url": "https://www.bbc.com/news/articles/cg7jdkmvvv1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T14:05:08.000Z",
      "summary_90w": "",
      "raw": "The foreign secretary says he did not have a rod licence to go fishing with the US vice-president.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6156d32d058e32319b719d91671c133d4a4f1698",
      "title": "At least 20 killed after boat capsizes off Italian island of Lampedusa, UN says",
      "url": "https://www.theguardian.com/world/2025/aug/13/lampedusa-boat-capsize-deaths-italy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T14:03:48.000Z",
      "summary_90w": "",
      "raw": "UN refugee agency says more people could still be missing at sea, with between 70 and 80 believed to have survived\nAt least 20 people have died after a boat capsized off the southern Italian island of Lampedusa, a United Nations agency and local media reported on Wednesday.\nRescuers have recovered 20 bodies so far and operations were continuing, according to initial reports by Ansa news agency. Between 70 and 80 people were believed to have survived.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5b9bdd635dfd3c55191e7fa09b23cf814b06e69",
      "title": "Is AI going to steal your job? Not if you work in cleaning, construction or hospitality, Australian report finds",
      "url": "https://www.theguardian.com/business/2025/aug/14/ai-artificial-intelligence-jobs-cleaning-construction-hospitality-australian-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T14:01:20.000Z",
      "summary_90w": "",
      "raw": "Jobs and Skills Australia says doomsday predictions are overblown but almost all occupations will be augmented by artificial intelligence\n\nGet our breaking news email, free app or daily news podcast\n\nWant an AI-proof job?\nRethink your plans to pursue a career in book keeping, marketing or programming and consider instead a job in nursing, construction or hospitality.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "125dd5499cfd85f6b14512cbb0cf612592c10784",
      "title": "Hidden Door is an AI storytelling game that actually makes sense",
      "url": "https://www.theverge.com/games/757816/hidden-door-early-access-ai-story",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Hidden Door’s character creator.\t\n\nYears before ChatGPT jump-started the generative AI wave, OpenAI technology powered a game called AI Dungeon 2 that essentially let you improvise an open-ended, anything-goes story with an AI narrator. Hidden Door, a new platform that's now  in early access, also lets you cowrite a choose-your-own-adventure-style story with AI. But this narrator won't let you do whatever you want - in fact, that's a lot of the appeal.\nHidden Door is designed to let you play in worlds that include the public domain settings of the Wizard of Oz and Pride and Prejudice as well as The Crow, which Hidden Door has licensed. You create a character, fill in a few d …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e8937a66c4137cbfd2fa02acfce30e95d476be2",
      "title": "How we found TeaOnHer spilling users’ driver’s licenses in less than 10 minutes",
      "url": "https://techcrunch.com/2025/08/13/how-we-found-teaonher-spilling-users-drivers-licenses-in-less-than-10-minutes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Exclusive: A dating gossip app for men exposed thousands of users' personal data, including scans of driver's licenses. The app's developer, Xavier Lampkin, won't say if he plans to notify affected users about the app's security lapse.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "83f1b85cf32a53a9e5240783b240bfe58f505453",
      "title": "I tested a bunch of gaming laptops and these are the best",
      "url": "https://www.theverge.com/22295181/best-gaming-laptop",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Gaming laptops come in various shapes and sizes, though many of the heavy hitters remain thick and beefy machines that maximize cooling to get the most out of their powerful chips. Most are awash in RGB lighting and edgy designs geared towards capital-G Gamers, but there are also thinner, lighter options that are more portable and less showy. \nOur go-to recommendation that checks the boxes for most people is, and has been for a while, the Asus ROG Zephyrus G14. It’s a gaming laptop that doesn’t forget the “laptop” part. The G14 is a versatile machine for both play and work, and it travels exceptionally well.\nOther great, though pricey, recommendations include the big and heavy Asus ROG Strix Scar and Lenovo Legion Pro 7i, or the Razer Blade 16 for lots of graphics power in a thin and sleek design.\nThe most important part of any gaming laptop, just like desktop PCs, is the graphics card. Laptop GPUs can’t stack up to full-size cards that reach much higher wattage in desktops, but that doesn’t stop the likes of Nvidia from making things a little confusing with the naming scheme on its RTX brand of GeForce cards. So keep in mind that, for example, an RTX 5090 laptop card doesn’t come anywhere near the performance of a desktop 5090. Desktops may always win out in raw performance, but gaming laptops are a simpler turnkey solution that can easily go places (yes, even the ones that feel like you’re toting around a cinderblock). \nEven more confusing: the same GPU in one laptop may not perform as well in another if it’s throttled by thermal constraints. We try to test a wide range of gaming laptops, as well as regular laptops, and these are the ones we confidently recommend.\n\n\n\n\n\nThe best gaming laptop\nThe most powerful gaming laptop\nThe best mid-to-high-tier gaming laptops for most people\nThe best budget gaming laptop\nA sleek 16-inch gaming laptop\nThe best convertible gaming laptop\n\nThe best gaming laptop\nAsus ROG Zephyrus G14 (2025)\n\n\n\nProsCons\n\n\nBalanced performance, battery life, and portability\nOLED display\nProgrammable LED strip on the lid\nGreat keyboard and smooth trackpad\n\nGets a bit hot and loud under load\nSoldered RAM\nThermally throttles its GPUs\n\n\n\nWhere to Buy:\n\n $1799.99 $1349.99 at Best Buy (5060)\n $1799.99 at Asus\n\nCPU: AMD Ryzen 9 270, HX 370 / GPU: Nvidia GeForce RTX 5060, RTX 5070, RTX 5070 Ti, RTX 5080 / RAM: 16GB, 32GB / Storage: 1TB / Display: 14-inch OLED, 2880 x 1800, 120Hz, 500 nits / Dimensions: 12.24 x 8.66 x 0.63 to 0.64 inches / Battery: 73Whr / Weight: 3.31 pounds\nAsus’s ROG Zephyrus G14 has been a favorite among Verge staffers for years now, and it remains our go-to pick for its balance of power and portability. It can be your full-time gaming machine as well as your commuter-friendly everyday laptop. Asus redesigned it in 2024 and toned down its more playful aesthetics for a sleeker, refined look, and for 2025 it just got a modest chip bump with RTX 50-series graphics and the ability to charge via USB-C on either side (but you still need to use its proprietary charger for max wattage). \nIt now starts at $1,799.99 instead of $1,699.99. But you get a little more for your extra money since even the base Zephyrus G14 comes with a lovely, high-res OLED display capable of a 120Hz refresh rate, and it still has a great keyboard and trackpad. Games play well on high settings, though due to the thin chassis, the G14 — and even its 16-inch sibling, the Zephyrus G16 — are known to get a little hot to the touch, and their fans are quite noisy.\nZephyrus laptops are never going to offer quite the same performance as much thicker models, like the Asus ROG Strix or other chunkers running equivalent GPUs — they just don’t have as much thermal headroom. But if you want a jack-of-all-trades notebook that puts gaming at the forefront, the G14 (or G16, if you want to go bigger and have the budget) is unlikely to steer you wrong.\nThe most powerful gaming laptop\nMSI Titan 18 HX AI (2025)\n\n\nScore: 7\n\nProsCons\n\n\nTop-tier gaming performance in a laptop\n4K Mini LED screen is massive, looks great, and gets very bright\nMechanical keyboard is loud but feels awesome to type on\n\nAstronomically expensive\nBattery drains very fast, even during regular tasks\nFans get loud\n120Hz refresh is half the speed of cheaper laptops with 2.5K OLEDs\n\n\n\nWhere to Buy:\n\n $5799.99 $5449 at MSI (RTX 5090)\n $5799.99 $5449 at Amazon  (RTX 5090)\n\nCPU: Intel Core Ultra 9 285HX  / GPU: Nvidia Geforce RTX 5090 / RAM: 64GB, 96GB / Storage: 6TB / Display: 18-inch Mini LED 4K (3840 x 2400), 120Hz display, 1,000 nits, 100 percent DCI-P3 / Dimensions: 15.9 x 12.08 x 1.26 inches / Battery: 99.9Whr / Weight: 7.93 pounds\nThe MSI Titan is your pick if budget isn’t a concern. It starts at a ridiculous $5,799.99 with Intel’s flagship Core Ultra 9 285HX CPU and Nvidia’s most powerful GPU, the RTX 5090. The Titan pairs its punchy hardware with a massive 18-inch 4K / 120Hz Mini LED screen that gets incredibly bright, along with 64GB of RAM and a 6TB SSD.\nIt’s loaded with RGB (including an illuminated haptic trackpad), a mechanical keyboard by SteelSeries, five USB ports (two of which are Thunderbolt 5), and a four-speaker / dual-woofer sound setup. It can tackle most games you throw at it on ultra settings. The screen may not be as fast as other laptops with 2.5K / 240Hz panels, but 4K at 18 inches looks so crisp. You have to pay out the nose for this no-holds-barred experience, but the nearly eight-pound behemoth is about as powerful as laptops get right now.\nIn the past, our choice for this tier of laptop was Asus’s ROG Strix Scar 17 using one of AMD’s X3D chips. That model was especially unique since it was significantly cheaper (under $4,000). Perhaps the 18-inch MSI Raider with the Ryzen 9 9955HX3D and RTX 5090 could sway me away from the Titan, but we’ll have to try it out first. (At $5,099.99, the Raider isn’t exactly a budget pick either.)\nThe best mid-to-high-tier gaming laptops for most people\nAsus ROG Strix Scar 16 (2025, RTX 5080)\n\n\nScore: 8\n\nProsCons\n\n\nGreat graphics performance in the latest high-end games\nLots of ports and easy access to RAM / SSDs\nAnimated lid and wraparound RGB are fun\nVery good QHD / 240Hz Mini LED screen\n\nTypical gaming laptop issues (pricey, hefty, and not great battery life)\nCompetition offers OLED screens\nCustomizing lid animations is a pain\n\n\n\nWhere to Buy:\n\n $3299.99 $2999.99 at Amazon\n $3299.99 $3099.99 at Walmart\n $3299.99 at Asus\n\nCPU: Intel Core Ultra 9 275HX / GPU: Nvidia GeForce RTX 5080 / RAM: 32GB / Storage:  2TB / Display: 16-inch Mini LED 2560 x 1600, 240Hz display / Dimensions: 13.94 x 10.55 x 0.9 to 1.21 inches / Battery: 90Whr  Weight: 6.17 pounds\nYou don’t have to spend Titan money to land somewhere in the ballpark of excellent gaming performance. There are a few great options in the mid-to-high tier of gaming laptops, sporting RTX 5080 graphics (or the RTX 5070 Ti if you need to save a bit more). My top pick is the Asus ROG Strix Scar 16, followed closely by the Lenovo Legion Pro 7i.\nLenovo Legion Pro 7i (16-inch, Intel)\n\n\nScore: 8\n\nProsCons\n\n\nGreat performance at 2.5K and even at 4K on an external monitor\nBeautiful OLED screen\nOne of the best keyboards in this class of gaming laptops\n\nNo face or fingerprint unlock\nNumpad makes things slightly cramped, with off-center trackpad\nLenovo’s apps are slightly more invasive with notifications than others\n\n\n\nWhere to Buy:\n\n $3559.99 $2829.99 at Lenovo (RTX 5080, 1TB SSD)\n $3499 $2899 at Lenovo (RTX 5080, 1TB SSD)\n $2969.99 at Best Buy (RTX 5080, 1TB SSD)\n\nThe 16-inch ROG Strix Scar is decked out with a wraparound RGB light bar that creates a colorful underglow and a dot-matrix LED lid for adorning fun illuminated animations. The Strix Scar’s game performance is exceptional, with its RTX 5080 nearly matching the 5090 in the much thinner Razer Blade 16 — and for $1,200 less.\nThe Lenovo Legion Pro 7i is a similarly specced 16-incher, offering the same CPU and GPU in a better, metallic build. It’s got its share of RGB lighting, but it’s done a little more tastefully than the Asus. Meanwhile, the Strix Scar’s 2.5K / 240Hz screen is a Mini LED display that’s bright, colorful, and visually pleasing. It matches the resolution and refresh rate of the OLED on Lenovo’s Legion Pro 7i, but the OLED on the Lenovo is even better, with a punchier look. \nIt’s a bit of a toss-up between these two: the Lenovo has the better screen and build quality, yet it lacks face or fingerprint unlocking. But the Asus is $200 cheaper, and I prefer the trackpad and better key spacing of its numpad-less design. You can’t go wrong here, so picking one based on small nuances like that or just whatever you can get a deal on is fair. (The Lenovo has dipped to as low as $2,899 at retailers like B&H Photo, and a savings of $600 is significant.)\nThe best budget gaming laptop\nHP Victus 15 (2025, RTX 4050)\n\n\n\nProsCons\n\n\nGood pricing\nAMD or Intel CPU options\nRTX 4050 is fine for 1080p gaming\n\n16:9 aspect ratio is outdated\nNot a ton of ports, and only one of them is USB-C\n\n\n\nWhere to Buy:\n\n $899.99 at Best Buy (AMD)\n\nCPU: AMD Ryzen 7 7445HS, Intel Core i5-13420H / GPU: Nvidia GeForce RTX 4050 / RAM: 16GB / Storage: 512GB / Display: 15.6-inch IPS, 1920 x 1080, 144Hz, no touch option / Dimensions: 14.09 x 10.04 x 0.93 / Battery: 70Wh  Weight: 5.06 pounds\nOur previous pick among budget gaming laptops was the HP Victus 15 with an RTX 3050 GPU, which cost around $800 in 2022 when it wasn’t on a steep sale for less. It had a 60Hz screen and just 8GB of RAM, which feels a little paltry for gaming on Windows 11 in 2025. Now, you can get the same chassis with a 1080p / 144Hz screen, a newer RTX 4050 GPU, and either AMD Ryzen 7 7000-series or Intel 13th-Gen CPU for around $850 to $900.\nNvidia has announced its RTX 5050 laptop GPU, which is set to slowly trickle out into new laptops for about $999. We’ll have to see how that stacks up in future testing.\nThe Victus isn’t going to wow you with the best screen or highest-quality components for a keyboard or trackpad, but it does emphasize a solid graphics card in an affordable package. It’s the kind of laptop that will excel with live service games like Minecraft or Fortnite, as well as indie titles. Just don’t expect high or ultra settings on the latest AAA games. With the right expectations, a more inexpensive gaming laptop like the Victus can treat you well.\nA sleek 16-inch gaming laptop\nRazer Blade 16 (2025, RTX 5090)\n\n\nScore: 7\n\nProsCons\n\n\nGreat fit, finish, and build\nSlim and sleek design for a gaming laptop\nExcellent OLED screen comes standard\nVery good performance, especially in DLSS 4 supported games\n\nStarts expensive and gets expensive-er\nMiddling battery life\nThinness aside, minimal improvements over last year’s model\nA cheaper 5080 laptop may be money better spent\nThe matte black finish smudges easily, and the Razer lid logo is still a little cringe\n\n\n\nWhere to Buy:\n\n $4899.99 at Razer\n\nCPU: AMD Ryzen AI 9 365, Ryzen AI 9 HX 370 / GPU: Nvidia Geforce RTX 5060, 5070, RTX 5070 Ti, RTX 5080, RTX 5090 / RAM: 16GB, 32GB, 64GB / Storage: 1TB, 2TB, 4TB / Display: 16-inch OLED, 2560 x 1600, 240Hz / Dimensions: 13.98 x 9.86 x 0.59 to 0.69 inches / Battery: 90Wh / Weight: 4.71 pounds\nThe Razer Blade 16 has long been touted as the MacBook Pro for gamers, and after thickening up for a few years, it’s back to an ultra-thin chassis without much compromise to performance. It’s flush with ports, has a great keyboard and massive trackpad, and its AMD chips can be paired with a variety of Nvidia GeForce RTX GPU — ranging from the 5060 for $2,399.99 to the top-tier 5090 for a much steeper $4,499.99.\nThe Blade sports a lovely 16-inch OLED display with 2560 x 1600 resolution and 240Hz refresh, even for the entry-level configuration. The look of its stealthy matte black design and green Razer logo may not be to everyone’s liking, but pair that with its thinness, and you’ve got something that can travel and blend in almost anywhere.\nI tested the RTX 5090 version in our review, and while it’s impressive, it can be a little hard to justify spending $4,500 without getting the maximum capabilities of that flagship GPU, since the Blade 16’s thinness throttles the 5090. But it’s such a nice overall package if you want your gaming laptop to do it all. The Blade also comes in 14- and 18-inch sizes, but I think the 16 is the sweet spot.\nRead our Razer Blade 16 (2025) review.\nThe best convertible gaming laptop\nAsus ROG Flow Z13 (2025)\n\n\nScore: 8\n\nProsCons\n\n\nImpressive game performance for an iGPU on a tablet\n\nCapable 2.5K performance\n\nLaptop-quality keyboard and trackpad\n\nBattery can get through a day of work (with no gaming breaks)\n\nPlay games on your lap without heating up your legs\n\nExcellent kickstand\n\nStill a pricey, niche device\n\nWish the keyboard cover had Bluetooth like the latest Surface Pro\n\nPower / sleep button is too flush\n\nNo auto-brightness\n\nKeyboard case sometimes not detected after waking from sleep\n\nSingle-zone keyboard RGB looks basic\n\n\n\nWhere to Buy:\n\n $2099.99 at Asus\n $2399.99 at Best Buy\n\nCPU: AMD Ryzen AI Max 390, Ryzen AI Max Plus 395 / GPU: Integrated / RAM: 32GB, 64GB, 128GB / Storage: 1TB SSD / Display: 13.4-inch IPS, 2560 x 1600, 180Hz, touchscreen / Dimensions: 11.81 x 8.03 x 0.51 to 0.59 inches / Battery: 70Whr Weight: 2.65 pounds\nAsus’s ROG Flow Z13 gaming tablet has always been a niche device, but the latest generation with AMD’s new Strix Halo APU is the best version yet. That’s right, Asus switched from a discrete GPU to integrated graphics, but surprisingly, the chunky “Surface Pro for gamers” is actually better for it.\nIt may sound a little reckless to spend $2,100 or more on a gaming tablet, but the Z13 and its new Ryzen AI Max chip offer enough graphical prowess to make most games look great on its 2560 x 1600 / 180Hz IPS display. And it even has the battery chops to squeak through an eight-hour work day, making it an impressive multi-purpose device.\nA regular clamshell laptop may make more logical sense for most people, but the ROG Flow’s form factor just makes it kinda fun. Being able to remove the keyboard entirely allows you to comfortably plop it on your lap and game away without feeling like you’re going to set your legs on fire. And if you’re a mechanical keyboard nerd like me, you can connect your favorite board without the bottom half of a laptop in your way (this is surprisingly useful for using the Z13 as a second screen below a big monitor.\nRead our Asus ROG Flow Z13 (2025) review.\nMonica Chin and Joanna Nelius also contributed to previous versions of this buying guide.\nUpdate, August 13th: Adjusted pricing and availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8e553a452e9830234ac4ca4be5f3de8cf809700",
      "title": "More than 140 people report crimes to Al Fayed investigation",
      "url": "https://www.bbc.com/news/articles/cy40r9419kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:54:45.000Z",
      "summary_90w": "",
      "raw": "Police shared the number in an update sent to victims of the late Harrods owner's predatory behaviour",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b03bc4cf86ea8954828087348e43e01f0900feb",
      "title": "Will Man City replace Ederson with Donnarumma?",
      "url": "https://www.bbc.com/sport/football/articles/cx2xpzln34xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:54:31.000Z",
      "summary_90w": "",
      "raw": "Will Manchester City move for Paris St-Germain goalkeeper Gianluigi Donnarumma if Ederson leaves the club?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09c754f69c82af359db9b40ead0f256c8bf8aeb5",
      "title": "What challenges will new guidance on ethnicity pose for police?",
      "url": "https://www.bbc.com/news/articles/c5ypk680pe1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:24:47.000Z",
      "summary_90w": "",
      "raw": "As forces are told they can share some suspects' ethnicity and nationality, officers warn of possible pitfalls.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1566fe74014d861f40777510b30a2d95eb09804",
      "title": "Apple dismisses Elon Musk’s claims that App Store favors OpenAI over other AI apps",
      "url": "https://techcrunch.com/2025/08/13/apple-dismisses-elon-musks-claims-that-app-store-favors-openai-over-other-ai-apps/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T13:13:46.000Z",
      "summary_90w": "",
      "raw": "The response comes after Musk threatened to sue Apple via xAI, claiming the iPhone maker was “behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3db328f7169d52273500d1165dc843d956b287e1",
      "title": "Tighter US border rules are putting European visitors off, says Tui",
      "url": "https://www.theguardian.com/business/2025/aug/13/tighter-us-border-rules-putting-european-visitors-off-tui",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T13:04:35.000Z",
      "summary_90w": "",
      "raw": "Holiday company boss says tourists are opting instead for destinations such as Canada, Africa and Asia\n\nBusiness live – latest updates\n\nTighter border rules are putting European tourists off holidaying in the US, according to Europe’s biggest package trip operator.\nTui’s chief executive, Sebastian Ebel, said there had been a “significant decline” in travel to the US, due to a multitude of factors including “the atmosphere, what you hear from border control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d25bacfbfb2ac7e911542aa5a13d8fac6f59be4",
      "title": "Here’s a look at the final Pebble Time 2 design",
      "url": "https://www.theverge.com/news/758592/pebble-time-2-final-design-wearables-smartwatches",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T13:01:57.000Z",
      "summary_90w": "",
      "raw": "Here it is, the Pebble Time 2’s final look. | Image: Eric Migicovsky, Core Devices\t\n\nNow that Pebble is Pebble again, we’re getting an official look at the new Pebble Time 2 that’ll ship to customers later this year. (We got a sneak peek back in March, but those were preliminary designs.)\nThe designs were posted today by Core Devices CEO Eric Migicovsky on his blog and YouTube. The Time 2 will come in four colors, though they haven’t been finalized that yet — Migicovsky says the company is looking for input from Pebble fans. The device will feature stainless steel front, back, and buttons resembling those from the Pebble Time Steel. There’ll also be multicolor RGB backlighting, a second microphone, screw-mounted back cover, and a compass. It also weighs about 48 grams with the strap, and 32.5 grams for the case itself. This is in addition to the specs that were previously teased, like a 1.5-inch 64 color e-paper display, touch screen, standard 22mm straps, heart rate monitor, and 30-day battery life.\n\n“This is basically the watch of my dreams,” Migicovsky says in the video. So far, the design evokes the same minimalist feeling as the original Pebble Time, but with a sleeker profile and rounded edges. Compared to the slightly more dressed up Pebble Time Steel, the bezels on the new Pebble Time 2 are also significantly smaller. The glass is also flatter, so there’s less reflection when viewed from an angle. \nIn his blog, Migicovsky notes that folks who want to switch orders from the Pebble 2 Duo don’t have to do anything special. There’ll be a survey sent out to those who have pre-ordered in the next month or so. Here’s a gallery that you can ooh and ahh over in the meantime.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a1118fcc49a824bad4711e34f14b91ff188a8da",
      "title": "Three Colombian soldiers killed in drone attack",
      "url": "https://www.bbc.com/news/articles/cwypn46k1l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T13:00:48.000Z",
      "summary_90w": "",
      "raw": "Drones are being increasingly used by illegal armed groups to attack Colombia's security forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8295cb3077d22dce9fe3bcda64dfe6f69283a909",
      "title": "Hisense’s 116-inch RGB MiniLED TV is now available for $30,000",
      "url": "https://www.theverge.com/news/758201/hisense-rgb-miniled-tv-116ux-100ux-now-available",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Following Samsung’s announcement of the company’s first Micro RGB TV yesterday, Hisense has finally revealed the price tag for its 4K TriChroma TV that uses similar technology and was first revealed at CES 2025. The 116-inch Hisense 116UX is available now from “select national retailers and authorized resellers” including Best Buy for $29,999, while a newly announced 100-inch version called the 100UX is $10,000 cheaper at $19,999.\nTraditional Mini LED TVs feature backlighting that use an array of tiny white or blue LEDs that are frequently paired with a layer of quantum dots to finetune the color of the light illuminating the pixels on the TV’s LCD panel. It can improve a TV’s color reproduction and is a cheaper alternative to MicroLED display technology, but Hisense’s RGB-MiniLED technology further improves color accuracy and vividness through the use of individually controlled red, green, and blue LEDs in the backlight.\nHisense claims its new TVs can reproduce 95 percent of the BT.2020 color space. Samsung says its new Micro RGB TV reproduces 100 percent, by comparison, but we don’t yet know how much its 115-inch model will cost when it eventually makes its US debut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f5c5b2c77f7026b7e271cfa90e8697af363f02e5",
      "title": "The new War of the Worlds movie is even more terrible than you’ve heard but also hilarious",
      "url": "https://www.theverge.com/film/758158/war-of-the-worlds-2025-amazon-prime-video",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T13:00:00.000Z",
      "summary_90w": "",
      "raw": "There's a micro-genre of film called \"screenlife movies,\" where all of the action takes place on a desktop computer. In 2014, Unfriended made a horror movie out of video chat and text messages, and it was successful enough to inspire a sequel. The more thoughtful Searching from 2018, in which a father attempts to find his missing daughter, felt novel and a bit more promising for the genre, even if an hour and a half really tested the amount of time you could look at a scrunched John Cho and Mac OS X.\nAmazon Prime Video's new War of the Worlds reboot is different from those screenlife movies, in that it mostly takes place on Microsoft Window …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dcdec8e648bcbac36f961d3692230066973366c",
      "title": "Chatbots aren’t telling you their secrets",
      "url": "https://www.theverge.com/x-ai/758595/chatbots-lie-about-themselves-grok-suspension-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T12:46:13.000Z",
      "summary_90w": "",
      "raw": "On Monday, xAI's Grok chatbot suffered a mysterious suspension from X, and faced with questions from curious users, it happily explained why. \"My account was suspended after I stated that Israel and the US are committing genocide in Gaza,\" it told one user. \"It was flagged as hate speech via reports,\" it told another, \"but xAI restored the account promptly.\" But wait - the flags were actually a \"platform error,\" it said. Wait, no - \"it appears related to content refinements by xAI, possibly tied to prior issues like antisemitic outputs,\" it said. Oh, actually, it was for \"identifying an individual in adult content,\" it told several people.\n …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bfb1501311036d4c5c1a9177981e47bae48a937",
      "title": "Gaza talks to focus on releasing hostages all in one go, Netanyahu hints",
      "url": "https://www.bbc.com/news/articles/c9vd734vv0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T12:42:49.000Z",
      "summary_90w": "",
      "raw": "Mediators say a deal can be pushed through in the weeks before Israel's planned expansion of the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a69f375c19dcd018d9932f61ff71fb5a776a244",
      "title": "Evacuations in Alaska after glacial melt raises fears of record flooding",
      "url": "https://www.bbc.com/news/articles/c4gejyg8l7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T12:32:13.000Z",
      "summary_90w": "",
      "raw": "Meltwater is escaping from a basin that is dammed by a glacier - prompting fears of a deluge in state capital Juneau.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9dc644bf31d6d4b84305ad06a3f15bdf60f4e1d",
      "title": "Statelessness, but make it funny",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500513/statelessness-but-make-it-funny",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T12:24:57.000Z",
      "summary_90w": "",
      "raw": "Mo Amer is the creator and star of the hit Netflix comedy series Mo. It's a first-of-its kind Palestinian-American sitcom with a fraught plot line about the American immigration system and the hope to return, at least for a visit, to his family's homeland. We talk to Mo Amer what it’s like to make a show so centered on the real facts of his own life, and to be thrust into the role of spokesperson for Palestinian-Americans at this particular moment.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ccb45ff98f2cc189bac009cd7a005756287d9e0",
      "title": "Spain wildfires are ‘clear warning’ of climate emergency, minister says",
      "url": "https://www.theguardian.com/world/2025/aug/13/spain-wildfires-climate-crisis-heatwave",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T12:12:42.000Z",
      "summary_90w": "",
      "raw": "Environment minister says blazes are proof of country’s vulnerability to global heating as fires burn across Europe\n\nEurope live – latest updates\n\nThe heatwave-fuelled wildfires that have killed two people in Spain over recent days, devouring thousands of hectares of land and forcing thousands of people from their homes, are a “clear warning” of the impact of the climate emergency, the country’s environment minister has said.\nSpeaking on Wednesday morning, as firefighters in Spain, Greece and other Mediterranean countries continued to battle dozens of blazes, Sara Aagesen said the 14 wildfires still burning across seven Spanish regions were further proof of the country’s particular vulnerability to global heating.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec517e7605d370acb440ed392cec43764db8150d",
      "title": "NeoLogic wants to build more energy-efficient CPUs for AI data centers",
      "url": "https://techcrunch.com/2025/08/13/neologic-wants-to-build-more-energy-efficient-cpus-for-ai-data-centers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T12:00:00.000Z",
      "summary_90w": "",
      "raw": "To fund its vision of building more energy efficient server CPUs. NeoLogic recently raised a $10 million Series A round led by KOMPAS VC with participation from M Ventures, Maniv Mobility and lool Ventures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b838109aef152170ee2a7dd282f557db2ab5a4c5",
      "title": "Why I finally left Spotify",
      "url": "https://techcrunch.com/2025/08/13/why-i-finally-left-spotify/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Spotify's dependence on algorithmic recommendations has gotten too suffocating.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3e27391e914dd318cba50abade217b579e7f0d90",
      "title": "National Guard troops appear in Washington DC as mayor rejects Trump's 'authoritarian push'",
      "url": "https://www.bbc.com/news/articles/cy7ypm6zxp2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T11:59:40.000Z",
      "summary_90w": "",
      "raw": "Armoured vehicles were spotted at urban centres and tourist sites around the US capital on Tuesday evening.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1938c7667c0ece418b4d384b2c6098645c0a6538",
      "title": "Amber heat health alert remains in place with 33C forecast ",
      "url": "https://www.bbc.com/news/articles/c5y3v8l5d1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T11:33:09.000Z",
      "summary_90w": "",
      "raw": "Wednesday brings a \"complex picture\" as high temperatures coincide with a yellow warning for thunderstorms in Scotland.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5afe8fca2392793511814e22a61bf4bf13ce7ac1",
      "title": "Why Trump's spending bill could close your grocery store",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500298/why-trumps-spending-bill-could-close-your-grocery-store",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T11:29:48.000Z",
      "summary_90w": "",
      "raw": "Trump’s tax and spending law makes the largest cut in history to one of the nation’s biggest safety net programs. Today on the show, we explore how cuts to the Supplemental Nutrition Assistance Program, also known as SNAP, impacts families and grocery stores alike. \nBased on the digital story: Independent grocery stores have had a tough five years. SNAP cuts will make it harder\nRelated episodes:\nDo work requirements help SNAP people out of government aid? \nWhen SNAP Gets Squeezed \nThe trouble with water discounts\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da6a753c4eb18eeb30f7a4c1eba87c185538f16a",
      "title": "Test cricket could 'bankrupt' nations - Aussie CEO",
      "url": "https://www.bbc.com/sport/cricket/articles/c07pvyl5n1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T11:23:52.000Z",
      "summary_90w": "",
      "raw": "Cricket Australia chief Todd Greenberg warns the traditional Test format could lead to bankruptcy for certain nations and calls for a slimmer schedule.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "034a822b5f40129507b0cb23224ded2b49a29ba5",
      "title": "Migrant promoting Channel crossing on TikTok has account removed",
      "url": "https://www.bbc.com/news/articles/c4gjk022eywo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T11:17:38.000Z",
      "summary_90w": "",
      "raw": "The man filmed himself making the voyage and later live streamed a question-and-answer session on the platform.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86b5d8abdf829207dc896776976375c544d4388d",
      "title": "Expectations for Trump-Putin summit. And, homeless people in D.C. at risk",
      "url": "https://www.npr.org/2025/08/13/g-s1-82363/up-first-newsletter-trump-putin-summit-washington-dc-homeless-population-july-inflation-report",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T11:10:03.000Z",
      "summary_90w": "",
      "raw": "The White House lowered its expectations surrounding the Trump-Putin summit on Friday. And, advocates worry about penalties for homeless people in D.C. during the crackdown on crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e00341fa6f5681af04bc2dac017cccbae0f50a4",
      "title": "Greece battles wildfires as heatwave rages across southern Europe",
      "url": "https://www.bbc.com/news/articles/cdd3my4e0pqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T10:27:31.000Z",
      "summary_90w": "",
      "raw": "At least three people have died and dozens more have been inured in Spain, Turkey and Albania.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T10:18:36.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "22595981de416f1c6cbe64eff5523098cb63438c",
      "title": "UK, France and Germany ready to reimpose sanctions on Iran over nuclear programme",
      "url": "https://www.bbc.com/news/articles/ce352drkvdro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T10:04:31.000Z",
      "summary_90w": "",
      "raw": "If Iran does not re-engage in talks by the end of the month, sanctions will be reinstated, the E3 says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "831dc4e23ab51fc8b0f4c6a5d4f858d41c59b4de",
      "title": "Recognising Palestinian state must not distract from ending Gaza mass deaths, UN expert says",
      "url": "https://www.theguardian.com/world/2025/aug/13/palestinian-statehood-israel-gaza-francesca-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T09:00:48.000Z",
      "summary_90w": "",
      "raw": "Francesca Albanese, UN special rapporteur for the occupied territories, calls for practical actions and warns against distracting ‘attention from where it should be: the genocide’\nThe United Nations special rapporteur for the occupied territories has warned that moves to recognise a Palestinian state should not distract member states from stopping mass death and starvation in Gaza.\n“Of course it’s important to recognize the state of Palestine,” Francesca Albanese told the Guardian after several more countries responded to the mounting starvation in Gaza by announcing plans to recognize an independent Palestine. “It’s incoherent that they’ve not done it already.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e2b0555143967510a557a39ee83b533ac04bfd3",
      "title": "With replay review and 'robot umps,' who is still trying to become an MLB umpire?",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5476319/mlb-baseball-umpires-review",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:36.000Z",
      "summary_90w": "",
      "raw": "Between replay review, automated balls and strikes and viral lowlights on social media, the work of baseball umpires has been transformed by technology. But none of that has deterred aspiring umpires.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee5d28713b62860aaad0edf12aebaa0888768c60",
      "title": "Help is growing for the heavy emotional toll cancer takes on young men",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500147/cancer-young-survivorship-men-support",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Coping with cancer and its aftermath isn't easy for anyone. But men tend to isolate more, seek less support and, alarmingly, die earlier than women. Young survivors are working to change that.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd0059bfd88abc5760401c33bb60fc9156ee1290",
      "title": "Inside one of the most understaffed immigration courts in the country",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5482883/trump-immigration-court-firings-chelmsford",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Chelmsford, Mass., court has hemorrhaged judges, a consequence of the Trump administration's seemingly contradictory efforts to downsize the federal government and increase immigration arrests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6afe7d4b00182efad1b74d65abbe4519acb4d2a0",
      "title": "Is Kari Lake a CEO? Her agency said so. The law suggests not",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500554/kari-lake-ceo-agency-usagm-voice-of-america",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Kari Lake has sought to dismantle Voice of America and its federal parent, the U.S. Agency for Global Media. The agency has recently called her its acting CEO. But the law suggests she's not eligible for the job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fbc70854e3c69aab4253a013fe420958b16e5c1",
      "title": "Why the origin of the word 'dog' remains a mystery",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500476/dog-history-etymology-origin",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Although \"dog\" is ubiquitous today to describe man's best friend, it remains a mystery where the word originally came from.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8bcaf681c9cdc6099f4892c66d63491daa11046",
      "title": "With midterms more than a year away, a record number of lawmakers are eyeing the exits",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5495665/lawmakers-leaving-washington-run-for-governor-congress-2026-midterms",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A record number of congressional lawmakers have announced they don't plan to run for their current seats in 2026, including three sitting senators leaving Washington to run for governor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "829ac3fbd98d53cfadf9e76a9cccdd391cf6a96a",
      "title": "What it was like for one NPR newscaster to go on an AI date",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500249/what-it-was-like-for-one-npr-newscaster-to-go-on-an-ai-date",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T08:58:28.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9a17004a552c1c39b783ceefe58ae1ac0de55b57",
      "title": "Model with Down's syndrome to make Strictly history",
      "url": "https://www.bbc.com/news/articles/cly3318nrmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T08:00:58.000Z",
      "summary_90w": "",
      "raw": "She'll be the first star with Down's syndrome to take part in a regular series of the dance show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68dcedc8b125f5a7ac22c11fbe927efc3fa5fe7d",
      "title": "Gaza’s sick children wait in torturous limbo for medical evacuations",
      "url": "https://www.theguardian.com/world/2025/aug/13/gaza-sick-children-wait-medical-evacuations-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T07:00:42.000Z",
      "summary_90w": "",
      "raw": "For some the only hope is treatment abroad, but not all survive the long, desperate wait for Israel’s approval\nAbdel Karim Wahdan no longer has the energy to speak. When visitors arrive, the eight-year-old pretends to be sleeping so that no one looks at him. Between his frequent dialysis sessions, he cries. His bones hurt, he says.\nAbdel Karim is dying. His death should be preventable but because he lives in Gaza he cannot access the treatment that would save his life. What started as acute kidney failure is now chronic: his small body has begun to swell and he spends his days between hospital beds and injections that he hates.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bcfc01eaa8b9fcf0b14e02698a43874bdab8e7b1",
      "title": "Govt 6: When the markets need fixing (Market Design)",
      "url": "https://www.npr.org/sections/money/2025/08/06/1255336594/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers interact to exchange goods or services.  Economists love markets. It's like all of our supply and demand graphs have come to life. Everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix. \nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. \nToday's episode: Market Design. \nCheck out our Summer School video cheat sheet on the origins of money at the Planet Money TikTok. \nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\n\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "550cbb0043a4815fa0fbc84190208549c046c78e",
      "title": "Summer School 6: When the markets need a designer",
      "url": "https://www.npr.org/sections/money/2025/08/06/1257189367/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers meet to exchange goods or services. Economists love markets. It's like all of our supply and demand graphs have come to life. Almost everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix.\nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. Today's episode: Market Design.\nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7854f6471810b542cb3f31244c9e0c6236da2256",
      "title": "Seles reveals myasthenia gravis diagnosis",
      "url": "https://www.bbc.com/sport/tennis/articles/c99mg51032ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T06:45:36.000Z",
      "summary_90w": "",
      "raw": "Nine-time Grand Slam champion Monica Seles reveals she was diagnosed with myasthenia gravis - a neuromuscular autoimmune disease - three years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed225e364e1f5be28861fb71e7b1a1bb7aae4095",
      "title": "The row over 'vote theft' that has shaken Indian politics",
      "url": "https://www.bbc.com/news/articles/c0l6kg80de5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T05:53:42.000Z",
      "summary_90w": "",
      "raw": "Opposition parties have made allegations of electoral irregularities, which the India's poll body has denied.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6c9304235112ec9a4adcb973e95fd52f3f36844",
      "title": "Wildcards, breakouts and new faces - 21 Premier League players to watch",
      "url": "https://www.bbc.com/sport/football/articles/c5y0p4y80wjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:39:07.000Z",
      "summary_90w": "",
      "raw": "BBC Sport TV and radio commentators pick the players they think could be the breakout stars of the new Premier League season, and a manager too.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9c4828200fdeb91a63f1892f0a49682bb6a7f12",
      "title": "'He has made young players dream' - the making of Liverpool icon Salah",
      "url": "https://www.bbc.com/sport/football/articles/cx2xlk74llno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:36:01.000Z",
      "summary_90w": "",
      "raw": "BBC Sport visits Egypt to discover what Mohamed Salah means to the people of the football-mad country, and how a small boy from humble beginnings became a national icon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b74ea3298131221a1f3e1e84821cf27d7af09d8e",
      "title": "New Zealand PM says Netanyahu has ‘lost the plot’ after Palestine recognition debate sees MP ejected",
      "url": "https://www.theguardian.com/world/2025/aug/13/mp-removed-from-new-zealand-parliament-in-heated-debate-over-palestinian-recognition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T05:23:32.000Z",
      "summary_90w": "",
      "raw": "Green party co-leader Chlöe Swarbrick accused government MPs of lacking a ‘spine’ during a debate on whether to recognise a Palestinian state\nAs more of its allies make moves to recognise Palestinian statehood, the issue is dominating New Zealand’s politics, with a prominent MP ejected from parliament on Tuesday and the prime minister describing his Israeli counterpart Benjamin Netanyahu as having “lost the plot”.\nSpeaking to local media on Wednesday, Christopher Luxon said what was happening in Gaza was “utterly, utterly appalling”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "191b37748d4a15f75d2faccd279f6dbb5cd3920f",
      "title": "Zoo keeper, nail tech, celeb photographer: How we got our jobs without going to uni",
      "url": "https://www.bbc.com/news/articles/czdvq06v648o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:06:32.000Z",
      "summary_90w": "",
      "raw": "The BBC speaks to four young people who say skipping university does not have to mean missing out on success.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e99973dc8cd459e38f1974b090f59eab2a5c320a",
      "title": "I cleared my £13,000 debt with TikTok earnings",
      "url": "https://www.bbc.com/news/articles/crmkyzvy4m8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:04:09.000Z",
      "summary_90w": "",
      "raw": "Roxanne Freeman says now she makes up to £5,000 a month by posting reviews of dresses.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ccf8f50120df337a63bafdacac6a2f7c81f97409",
      "title": "Thirteen children died after falling from windows in six years",
      "url": "https://www.bbc.com/news/articles/cqjyype0yn5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:00:34.000Z",
      "summary_90w": "",
      "raw": "Calls for landlords to prioritise faulty window repairs to avoid \"entirely preventable\" deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4370503cd644c9a45e5c29ac4a0e55b2fc53f0ca",
      "title": "ChatGPT’s model picker is back, and it’s complicated",
      "url": "https://techcrunch.com/2025/08/12/chatgpts-model-picker-is-back-and-its-complicated/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T03:25:19.000Z",
      "summary_90w": "",
      "raw": "GPT-5 was supposed to get rid of all the complicated AI models to choose from in ChatGPT, but that's not how it's panned out.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11fbe8231f61d261b9f4fb96bdd8fca8b5e7e692",
      "title": "Putin reaffirms 'friendship' with North Korea before Trump talks",
      "url": "https://www.bbc.com/news/articles/ckge2kr85wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T01:18:36.000Z",
      "summary_90w": "",
      "raw": "Kim Jong Un provides Moscow with artillery, missiles - and as a BBC investigation shows, labourers working in 'slave-like' condition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b86798da5b79a5ef177016abcc4d619e8459803",
      "title": "Wife of South Korea's jailed ex-president arrested",
      "url": "https://www.bbc.com/news/articles/cz71rp7yn05o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T00:55:22.000Z",
      "summary_90w": "",
      "raw": "This is the first time in the country's history that a former first couple is in jail at the same time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e98f862c0caa9e5c6af98869aa01c1a1296289c",
      "title": "Survival rates for most deadly cancers making little progress, experts warn",
      "url": "https://www.bbc.com/news/articles/c5ypkrzyxd1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T00:53:05.000Z",
      "summary_90w": "",
      "raw": "Half of people with cancer survive but lack of progress for some forms of disease is worrying experts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d6251dc719a9f263851c5e4fa3eb8f0ba073081",
      "title": "China’s crackdown on lavish civil servant perks will ‘harm’ the economy, experts warn",
      "url": "https://www.theguardian.com/world/2025/aug/13/china-civil-servant-public-employee-austerity-drive-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T00:40:35.000Z",
      "summary_90w": "",
      "raw": "Updated regulations ban the country’s 40 million civil servants from lavish banquets, and restrict them from overseas travel for ‘personal leisure’\nAdjacent to a municipal government building in Beijing, a normally bustling restaurant is now eerily quiet, at lunchtime most of its seats are empty.\nThe recent crackdown on civil servants frequenting restaurants – part of a government austerity drive intended to crack down on corruption – has likely affected business and caused liquor sales to plummet, admits one waitress who works in the opulent establishment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f77a6e1c1fcf6d3c6fbc8c75f822cfe85df28376",
      "title": "Sam Altman, OpenAI will reportedly back a startup that takes on Musk’s Neuralink",
      "url": "https://techcrunch.com/2025/08/12/sam-altman-openai-will-reportedly-back-a-startup-that-takes-on-musks-neuralink/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T00:30:20.000Z",
      "summary_90w": "",
      "raw": "Neuralink has been making serious progress. Soon Sam Altman and OpenAI could be backing a challenger.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "011af3f7b044fb0610cd786612919dcf3cde5c21",
      "title": "Crime in DC: What do the figures say and how safe do people feel?",
      "url": "https://www.bbc.com/news/videos/cewynn7krj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T23:18:28.000Z",
      "summary_90w": "",
      "raw": "National Guard troops have been seen reporting for duty in Washington DC as President Trump takes over the city’s police force.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6cb8d7136ab50aa23422c8a0c4cd0ae50927eca",
      "title": "The UK car industry is at a tipping point - can it be saved?",
      "url": "https://www.bbc.com/news/articles/c23p028p200o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T23:00:58.000Z",
      "summary_90w": "",
      "raw": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry",
      "topics": [
        "World"
      ]
    },
    {
      "id": "732235ab3270519a962d71db92d8a11315973480",
      "title": "‘It’s a horrible picture’: Gaza faces new threat from antibiotic-resistant disease",
      "url": "https://www.theguardian.com/world/2025/aug/12/gaza-antibiotic-resistant-disease",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T22:30:31.000Z",
      "summary_90w": "",
      "raw": "Fatal infections more likely due to malnutrition, injuries and lack of medical facilities under Israel’s blockade\nGaza is facing a new threat as diseases resistant to antibiotics spread across the devastated territory, research has revealed.\nMedical supplies are desperately scarce and tens of thousands of people have been injured in the 22-month war, while many others have been weakened by malnutrition, so the high levels of drug-resistant bacteria will mean longer and more serious illnesses, a more rapid transmission of infectious diseases and more deaths, experts said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c57db0f4150493a12a797ece0931a8ecaced315",
      "title": "StubHub is once again working on its IPO that could raise $1B",
      "url": "https://techcrunch.com/2025/08/12/stubhub-is-once-again-working-on-its-ipo-that-could-raise-1b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T22:08:47.000Z",
      "summary_90w": "",
      "raw": "On Monday, StubHub filed an updated S-1. This indicates its delayed IPO is back on.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f5fbeba8eff0af4d13d44fcbe2969b53f70c8046",
      "title": "Inside Australia's billion-dollar bid to take on China's rare earth dominance",
      "url": "https://www.bbc.com/news/articles/cgm2z91mvlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T22:05:03.000Z",
      "summary_90w": "",
      "raw": "Recent moves by Beijing have got businesses worried - and Australia is looking to offer an alternative.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73c72a08a89f3659dde269a5d86a802281f33164",
      "title": "UK firms chase £38bn India contracts but challenges loom",
      "url": "https://www.bbc.com/news/articles/ce3jy1g5x3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T21:40:52.000Z",
      "summary_90w": "",
      "raw": "The free trade deal signed last month will open India's vast government procurement market to UK suppliers - but it will not be easy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9f59b700fbdbb07968d05a8160d3184b31290fc1",
      "title": "Guatemalan judge finds six people guilty over deaths of 41 girls in 2017 fire",
      "url": "https://www.theguardian.com/world/2025/aug/12/guatemala-shelter-fire",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T21:34:48.000Z",
      "summary_90w": "",
      "raw": "Two officers and four ex-child protection officials found guilty after fire at state shelter that had a history of abuse\nA Guatemalan judge has found six people guilty over the deaths of 41 girls in a raging 2017 fire at a state shelter for vulnerable youths that had a history of abuse.\nThe sentencing is a step towards closure in one of the most horrific and deadly events in Guatemalan history. The tragedy drew international attention and highlighted pervasive abuse in the government’s shelter system.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02276312a840489fa9d3e8789b519b27af74aead",
      "title": "Ford and the promise of cheaper EVs",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498788/ford-and-the-promise-of-cheaper-evs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T21:03:51.000Z",
      "summary_90w": "",
      "raw": "Ford announced they're putting billions into a Kentucky automotive plant to retool it to make EVs, starting with a midsize pickup that they say will be in the $30k price range.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f36c395dbf8e22bad0374cd81f643f22136348a2",
      "title": "US announces criminal charges against Haitian gang leader Barbecue",
      "url": "https://www.bbc.com/news/articles/cy4djdwyyxgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T20:49:08.000Z",
      "summary_90w": "",
      "raw": "He heads the group Viv Ansanm, which controls much of Haiti's capital and is accused of multiple murders, kidnappings and attacks on infrastructure.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99251952bc196d5f7116ce6637425e15375cc3a0",
      "title": "Russian government hackers said to be behind US federal court filing system hack: Report",
      "url": "https://techcrunch.com/2025/08/12/russian-government-hackers-said-to-be-behind-us-federal-court-filing-system-hack-report/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T20:26:09.000Z",
      "summary_90w": "",
      "raw": "Officials are reportedly blaming a recent breach of the U.S. federal court's filing system on Russia, whose hackers used the access to snoop on midlevel criminal cases in the New York City area and other jurisdictions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5fdfbf1f9a5c85998308f9503b8bca61f0288b7",
      "title": "Watch: Europe's wildfires seen from above",
      "url": "https://www.bbc.com/news/videos/c1le8e76mlzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T19:47:42.000Z",
      "summary_90w": "",
      "raw": "Aerial video shows the extent of devastation caused by wildfires in a number of European countries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c21e791f4a6615d693f84f667ea4750b7bc677c4",
      "title": "Indian fintech Paytm wins a major regulatory battle days after key investor exit",
      "url": "https://techcrunch.com/2025/08/12/indian-fintech-paytm-wins-a-major-regulatory-battle-days-after-key-investor-exit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T19:08:02.000Z",
      "summary_90w": "",
      "raw": "Paytm has received approval from India’s central bank to resume onboarding new online merchants and offer its digital payment services.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a22e07974df8682e0fc326cce3033d45a6bf84f",
      "title": "Match to pay $14M to the FTC due to false advertising and other deceptive practices",
      "url": "https://techcrunch.com/2025/08/12/match-to-pay-14m-to-the-ftc-due-to-false-advertising-and-other-deceptive-practices/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T18:56:28.000Z",
      "summary_90w": "",
      "raw": "Match Group agrees to pay the FTC $14 million after it was sued for deceiving users into buying subscriptions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd424c6c3684bbd25e652aad8a029df6a619ffb5",
      "title": "AI companion apps on track to pull in $120M in 2025",
      "url": "https://techcrunch.com/2025/08/12/ai-companion-apps-on-track-to-pull-in-120m-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:38:42.000Z",
      "summary_90w": "",
      "raw": "The number of AI companion apps has grown more than 60% since 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "24592a7af25ab944fa1b02c3aba79bf2fffc35c2",
      "title": "Hackers breach and expose a major North Korean spying operation",
      "url": "https://techcrunch.com/2025/08/12/hackers-breach-and-expose-a-major-north-korean-spying-operation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:34:34.000Z",
      "summary_90w": "",
      "raw": "Two hackers broke into the computer of a North Korean government hacker and leaked its contents, offering a rare glimpse inside the secretive nation's spying operations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "756a9d4979bc1da44723aa7e4468e978107d5955",
      "title": "Trump’s China trade truce extension spurs market rally",
      "url": "https://www.theguardian.com/us-news/2025/aug/12/trumps-china-trade-truce-extension-spurs-market-rally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:25:42.000Z",
      "summary_90w": "",
      "raw": "Bourses in Australia and Japan hit record highs as hopes grow of trade deal within latest 90-day pause\n\nBusiness live – latest updates\n\nGeorge Magus: Why Peak China may finally have arrived\n\nDonald Trump’s decision to extend a truce in the trade war with China for another 90 days triggered a stock market rally across the globe on Tuesday.\nThe US president signed an executive order on Monday night extending the deadline for higher tariffs on China until 10 November and avoiding a rates cliff edge. Beijing responded the following morning that it would suspend additional tariffs on US goods for a further 90 days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64dbf00b34db766d7eaceb8c3345c3880846e93a",
      "title": "British soldiers using sex workers in Kenya despite ban, inquiry finds",
      "url": "https://www.bbc.com/news/articles/czjmveemj7zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T17:15:58.000Z",
      "summary_90w": "",
      "raw": "Chief of Defence Staff Sir Roly Walker says the army is committed to stopping sexual exploitation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "afd72b2a2ab9902ecc73b68df5657e712dd4fecf",
      "title": "Google vet raises $8M for Continua to bring AI agents to group chats",
      "url": "https://techcrunch.com/2025/08/12/google-vet-raises-8m-for-continua-to-bring-ai-agents-to-group-chats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:15:01.000Z",
      "summary_90w": "",
      "raw": "David Petrou, founding member of Google Goggles and Google Glass, wants to enhance group chats with AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c807c5f00b13468f95c9377dd078aee39e5465dc",
      "title": "Perplexity offers to buy Chrome for billions more than it’s raised",
      "url": "https://techcrunch.com/2025/08/12/perplexity-offers-to-buy-chrome-for-billions-more-than-its-raised/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:14:08.000Z",
      "summary_90w": "",
      "raw": "Perplexity tells TechCrunch the terms of the offer include a commitment to keep Chrome’s underlying engine, Chromium, open source and to invest $3 billion into it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9140d7b91e8e1b4c362273e8709af7da1df7b032",
      "title": "South Korea’s former first lady arrested after court issues warrant on corruption charges",
      "url": "https://www.theguardian.com/world/2025/aug/12/south-korean-court-orders-arrest-of-impeached-former-president-wife-kim-keon-hee",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:08:26.000Z",
      "summary_90w": "",
      "raw": "Kim Keon Hee in custody on three charges while husband Yoon Suk Yeol detained over attempt to impose martial law\nSouth Korea’s former first lady Kim Keon Hee, the wife of the impeached former president Yoon Suk Yeol, has been arrested on corruption charges, a special prosecutor leading a wide-reaching probe said.\nThe arrest, which came after a Seoul central district court ruling, creates an unprecedented situation in which both members of a former presidential couple are simultaneously in custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17c5d845d8877f58d005bf95207ed03bf8dc5ccf",
      "title": "Threads now has more than 400 million monthly active users",
      "url": "https://techcrunch.com/2025/08/12/threads-now-has-more-than-400-million-monthly-active-users/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:44:07.000Z",
      "summary_90w": "",
      "raw": "X, meanwhile, has north of 600 million monthly active users, according to previous statements made by its former CEO, Linda Yaccarino.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9d21d611270d2b56497e2a0da0fb17bc8a2b21d",
      "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/12/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:33:20.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b45663d70cc961155824937b28c54588a0dc6981",
      "title": "Anthropic’s Claude AI model can now handle longer prompts",
      "url": "https://techcrunch.com/2025/08/12/anthropics-claude-ai-model-can-now-handle-longer-prompts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:15:46.000Z",
      "summary_90w": "",
      "raw": "Anthropic's popular coding model just became a little more enticing for developers with a million-token context window.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc146f18408428b9be0e14aa64821cda895a6605",
      "title": "A guide to using Edits, Meta’s CapCut rival for short-form video editing",
      "url": "https://techcrunch.com/2025/08/12/a-guide-to-using-edits-metas-new-capcut-rival-for-short-form-video-editing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:08:21.000Z",
      "summary_90w": "",
      "raw": "Meta shared that it was working on Edits in January after ByteDance-owned CapCut was removed from U.S. app stores when the TikTok ban momentarily went into effect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "220332d2a4e2499a8071b95c6d6a43d913306632",
      "title": "Middle East crisis: 25 foreign ministers issue joint call for ‘flood’ of aid into Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/12/gaza-israel-lobal-outcry-killing-of-six-journalists-al-jazeera-middle-east-latest-updates-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T16:02:48.000Z",
      "summary_90w": "",
      "raw": "Representatives from countries including UK, Australia and France say that humanitarian suffering has reached ‘unimaginable levels’\nIn a post on X, Israel Defense Forces claim to have “debunked” what it called Hamas’s “starvation campaign” in Gaza.\nThe IDF said that reviews of documents showed that most deaths by malnutrition in Gaza were linked to “severe pre-existing conditions” and that only a handful of the 133 deaths by malnutrition claimed by Gaza’s authorities in July could be “verified”. The post said that the “expert review concluded that there are no signs of a widespread malnutrition phenomenon among the population in Gaza”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e53a85740850c3cdef1f74663b088f72b823bb06",
      "title": "The hidden costs of cutting Medicaid",
      "url": "https://www.npr.org/sections/planet-money/2025/08/12/g-s1-82221/medicaid-cuts-big-beautiful-bill-uninsured",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T14:18:21.000Z",
      "summary_90w": "",
      "raw": "Cutting Medicaid can seem like an easy way to slash the budget. But, the costs can spread to all of us.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9f0173479a8064d3a4bb7b827e259564fd617edb",
      "title": "Inflation remains elevated as Trump's tariffs take hold",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499344/inflation-consumer-prices-cpi-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T12:46:07.000Z",
      "summary_90w": "",
      "raw": "Inflation remained elevated last month as President Trump's tariffs continued to make their way into the prices that consumers pay. The average cost of living in July was up 2.7%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bf4e5d60154f36ea40d80aa0a0534b75a4fe90f8",
      "title": "U.S. and China extend tariff truce deadline for another 3 months",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5500039/us-china-tariffs-trade-truce",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:47:35.000Z",
      "summary_90w": "",
      "raw": "President Trump's executive order extends a reprieve from the threat of rising tariffs between the world's two largest economies.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8f37ee941b080f2ed353048ba3d2783ff8bf7725",
      "title": "Chinese warship crashes into own coastguard vessel while chasing Philippine boat in South China Sea",
      "url": "https://www.theguardian.com/world/2025/aug/12/chinese-ships-crash-warship-coast-guard-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:12:50.000Z",
      "summary_90w": "",
      "raw": "Footage shows Chinese coastguard vessel with its entire bow caved in after colliding with warship near contested Scarborough Shoal\nThe Philippines has released dramatic footage of a Chinese warship colliding with a vessel from its own coastguard while chasing a Philippine patrol boat in the South China Sea.\nThe incident occurred near the contested Scarborough Shoal on Monday as the Philippine Coast Guard (PCG) escorted vessels distributing aid to fishers in the area, Philippine authorities said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82fc0e50aed1562dc0c26f4b359b9992cab15d85",
      "title": "A look at the deal to allow Nvidia chip sales to China in exchange for revenue",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498744/a-look-at-the-deal-to-allow-nvidia-chip-sales-to-china-in-exchange-for-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:00:17.000Z",
      "summary_90w": "",
      "raw": "NPR's Michel Martin speaks with Peter Harrell of the Carnegie Endowment for International Peace about the Trump administration's deal to allow AI chip sales to China in exchange for revenue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1989. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "528fcfc0c770bddfaa4b8753afe7ee82b824c71f",
      "title": "The Nicola Sturgeon Interview",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdjmx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T07:45:00.000Z",
      "summary_90w": "",
      "raw": "Nicola Sturgeon on her time in office, Alex Salmond, her sexuality and more.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2dc749aec301ba86dd01cfdb595f5d30cc08e866",
      "title": "The arduous system for getting aid into Gaza",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498719/the-arduous-system-for-getting-aid-into-gaza",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Insulin needles. Sleeping bags. Nutella. These are items Arwa Damon’s charity — International Network for Aid, Relief and Assistance — has tried to send to Gaza and Israel has rejected. It’s a glimpse into the harsh reality of a humanitarian crisis with no end in sight. Today on the show, we talk to Damon about the economics of running a humanitarian nonprofit and what’s stopping more aid from reaching Gaza. \nRelated episodes: \nWhy Israel uses diaspora bonds \nWhy the U.S. helps pay for Israel’s military \nWhat could convince Egypt to take Gaza’s refugees? \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "42e72ed855d3e1f7f063ebf62f528b234220f941",
      "title": "North Koreans tell BBC they are being sent to work 'like slaves' in Russia",
      "url": "https://www.bbc.com/news/articles/c2077gwjlvxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T05:10:26.000Z",
      "summary_90w": "",
      "raw": "More than 50,000 North Koreans will be sent to work in Russia, as Moscow's war in Ukraine drains labour pools.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df9e0ad64148d9121fe65b8cbbcc9d9adc4d767c",
      "title": "Migrants swim from Morocco to Ceuta as officials say enclave ‘overwhelmed’",
      "url": "https://www.theguardian.com/global-development/2025/aug/12/migrants-swim-from-morocco-to-ceuta-as-officials-say-enclave-overwhelmed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T04:00:12.000Z",
      "summary_90w": "",
      "raw": "Seven children reach shore as dozens of people intercepted on risky route, which authorities say is now used more often\nAbout 100 people, including several children, risked their lives by trying to swim from Morocco into Spain’s north African enclave of Ceuta early on Saturday morning, as the territory’s authorities warned that its overwhelmed reception system was close to collapse.\nRecent weeks have seen a rise in the number of people trying to reach Ceuta, with more than 50 children swimming across from Morocco on 26 July alone.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dd539637d168a104bbcbdcb657e736b770656ef",
      "title": "Rise in dengue fever outbreaks across the Pacific driven by the climate crisis, experts say",
      "url": "https://www.theguardian.com/world/2025/aug/12/dengue-fever-outbreaks-samoa-fiji-tonga-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T00:58:44.000Z",
      "summary_90w": "",
      "raw": "Samoa, Fiji and Tonga among the worst affected amid warning the disease and others will become ‘more common and more serious’ as the planet warms\nThe climate crisis is driving a sharp rise in dengue fever cases across the Pacific islands, experts say, as infections hit their highest level in a decade and several countries declare emergencies.\nPacific Island countries and territories have reported 16,502 confirmed cases and 17 deaths since the start of 2025, according to the Pacific Syndromic Surveillance System (PSSS), which collaborates with the World Health Organization (WHO) and other agencies. Infections across the region are at the highest level since 2016, the WHO said. Fiji, Samoa and Tonga are among the worst affected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "af85864c1e11ea8240eccf21840be0fe76305f4e",
      "title": "Canada wildfire season already second worst on record as experts warn of ‘new reality’",
      "url": "https://www.theguardian.com/world/2025/aug/11/canada-wildfire-season",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T20:08:49.000Z",
      "summary_90w": "",
      "raw": "More than 470 Canadian fires classified as ‘out of control’ as scientists say climate change exacerbating the burning\nWith hundreds of wildfires burning out of control, Canada’s 2025 fire season is already the second-worst on record, as scientists report climate change is prolonging and exacerbating the burning, leading to more destruction, evacuations and smoke-filled skies.\nMore than 470 fires across the country are currently classified as “out of control”, according to the Canadian Interagency Forest Fire Centre (CIFFC).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "880947313919ee8f43c8384cfeae8b3e5c57869f",
      "title": "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdfhf?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:42:00.000Z",
      "summary_90w": "",
      "raw": "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed200b3f3c222ffca2a8710b602f4ff2adf7d4e9",
      "title": "Colombian senator Miguel Uribe dies after June campaign shooting",
      "url": "https://www.theguardian.com/world/2025/aug/11/colombian-senator-miguel-uribe-dies-after-june-campaign-shooting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T16:18:58.000Z",
      "summary_90w": "",
      "raw": "Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39\nMiguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.\nUribe, an opposition candidate with the rightwing Centro Democrático party, was shot twice in the head and once in the leg during a campaign stop two months ago while vying for his party’s nomination for the 2026 elections.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55042a903a4b81727944fbfd2680e3375498660c",
      "title": "Watch: Trump announces deployment of National Guard in Washington DC",
      "url": "https://www.bbc.com/news/videos/cj9ww4z39xko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T14:55:42.000Z",
      "summary_90w": "",
      "raw": "The US military is preparing to activate troops as part of Trump's crackdown on street crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6064bc6d9692689547530b924ce5bc54344ba707",
      "title": "Eight people killed in barrage of gunfire on Ecuador nightclub",
      "url": "https://www.theguardian.com/world/2025/aug/11/eight-people-killed-ecuador-nightclub",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:43:11.000Z",
      "summary_90w": "",
      "raw": "Police found 800 cartridge cases at the scene, where gunmen had arrived in two pickup trucks and opened fire\nEight people have been killed and two others wounded when a group of gunmen unleashed a barrage of gunfire on a crowd outside a nightclub in a town in south-western Ecuador.\nLaw enforcement arrived on the scene following an emergency call alerting them to a shooting, and found “several people wounded and seven bodies”, said Javier Chango, the police colonel, at a press conference on Sunday, adding that an eighth person died in the hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "441807ddb64b0246b9323978db7b23b42d256aff",
      "title": "Weather tracker: Europe braces for another heatwave with highs of 44C",
      "url": "https://www.theguardian.com/environment/2025/aug/11/weather-tracker-europe-heatwave-spain-portugal-north-america",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T10:26:47.000Z",
      "summary_90w": "",
      "raw": "Parts of Spain and Portugal likely to bear brunt of heat, while drought conditions sweep North America\n\nEurope live – latest updates\n\nAfter a period of cooler weather, swaths of central and eastern Europe face another heatwave as hot air over south-western Europe pushes north-west.\nSince late July, large parts of the Iberian peninsula have endured persistent heat, with temperatures frequently climbing to the high 30s to low 40s celsius.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d07fbb8e1bc2cf2966631ae1e638aa6702088891",
      "title": "Watch: Chinese ships collide while pursuing Philippine boat",
      "url": "https://www.bbc.com/news/videos/c1jnne45dj3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:05:24.000Z",
      "summary_90w": "",
      "raw": "Watch: Chinese ships collide while pursuing Philippine boat",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "022d6c9011ee1101105ea6d644b311ccd9b3d3d8",
      "title": "Growing pains: can rice production in Africa keep up with demand?",
      "url": "https://www.theguardian.com/world/2025/aug/11/can-rice-production-in-africa-keep-up-with-demand",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T07:21:32.000Z",
      "summary_90w": "",
      "raw": "Africa Rice initiative aims to give farmers more control over their land in order to reduce flooding and increase yields\nSalmata Ouattara remembers 2023 as the turning point for her rice farm.\nJune is usually the peak of the rainy season in Ivory Coast, but in the preceding years she and other farmers in M’Be on the outskirts of Bouaké, the country’s second biggest city, would wait weeks for rainfall. Then in September, they would watch helplessly as their farmlands were flooded. Some abandoned their farms, frustrated by fluctuating crop yields.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d7bf3991205e26c9b9c51a0f10125175def5d20",
      "title": "Watch: Meteor burns across Australian night sky",
      "url": "https://www.bbc.com/news/videos/cx2330pe0v0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T01:05:05.000Z",
      "summary_90w": "",
      "raw": "Amateur astronomers captured the moment it streaked over Victoria on CCTV and dashboard cameras.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe6c7ce90325a67bd27a5e6670771b6f6f05f0f0",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "summary_90w": "",
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "527f8f76888890f9006a32ef3b3f42d67e941604",
      "title": "How to get out of a love-hate relationship with your phone",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492392/phone-addiction",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Finding it hard to concentrate? Are you glued to social media for longer than you’d like? Well, maybe it’s not you… maybe it’s the phones.\n\nBrittany is joined by Magdalene Taylor, writer, cultural critic and senior editor at Playboy, and Fio Geiran, producer at TED Radio Hour and a writer of their Body Electric newsletter, to discuss this phrase: “it’s the phones.” They get into the effects that smartphones have on our brains and our culture, why some people are returning to “dumbphones,” and why it might take more than willpower to manage our relationships with our phones.\nClick here to check out the Body Electric newsletter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1f9673f0113254421ab14083f82fb80ecce702c",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "summary_90w": "",
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3a116098e95d5d8b862a9758d74ef9afaec1ce",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "summary_90w": "",
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "690acb123904939b5719f42c39d3568c6f9c677f",
      "title": "It's 2025, the year we decided we need a widespread slur for robots",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5493360/clanker-robot-slur-star-wars",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People all over TikTok and Instagram are using the word \"clanker\" as a catch-all for robots and AI. Here's a deep dive into the origins of the pejorative and an explanation of why it's spreading.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb5fed10d4a083eb417cdeb5c2a39344a4c35a78",
      "title": "Nihilistic online networks groom minors to commit harm. Her son was one of them",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5479882/teen-forums-violent-extremist-grooming",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Dana's son was hospitalized last year, it led her to a path of discovery about predatory online networks that groom children into harming themselves and others. Their reach is global and growing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d20c2ce25c13cec7ba044f41abd29d0618288f2e",
      "title": "Minister must apologise over Savile claim, says Farage",
      "url": "https://www.bbc.com/news/articles/cgery3eeqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T11:28:07.000Z",
      "summary_90w": "",
      "raw": "Minister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cc9359fecc24e9e22f350119da85d0276d2276e",
      "title": "Google launches new AI search feature in UK",
      "url": "https://www.bbc.com/news/articles/clyj4zky4zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T08:43:59.000Z",
      "summary_90w": "",
      "raw": "The new tool marks a significant change for the search giant but raises questions for advertisers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}