{
  "version": "1756390537160",
  "generatedAt": "2025-08-28T14:15:37.160Z",
  "items": [
    {
      "id": "f923579057e798f68b28712825399a9e403915be",
      "title": "Volunteer Met officer guilty of child rape",
      "url": "https://www.bbc.com/news/articles/c0ml30vgykro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T14:09:12.000Z",
      "summary_90w": "",
      "raw": "James Bubb, who identifies as Gwyn Samuels, is convicted of raping and sexually assaulting a child.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8e3fd594d4f4c4cc6c26861d5b32bc10289a43d",
      "title": "Police officer to face misconduct hearing over accuracy of account in e-bike deaths",
      "url": "https://www.bbc.com/news/articles/cp3e070wxx2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T14:08:33.000Z",
      "summary_90w": "",
      "raw": "The officer driving the van behind the two boys in Ely has a case to answer, the IOPC finds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91ae7eaab24790a01fe47a74df3c5f4fa7c0733f",
      "title": "Musician with broken thumb busks his way into record books",
      "url": "https://www.bbc.com/news/articles/clyr5yyp903o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T14:05:20.000Z",
      "summary_90w": "",
      "raw": "Martin Rafferty performed for 24 hours straight at a bandstand in Armagh city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9211d073b9f275aa2473579e44a94a86be8c4d0b",
      "title": "UK, France and Germany move to reimpose UN sanctions on Iran",
      "url": "https://www.bbc.com/news/articles/c4gmr3z49lxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T14:04:37.000Z",
      "summary_90w": "",
      "raw": "The three powers trigger a snapback process, which could restore sanctions in 30 days, amid ongoing concerns over Iran's nuclear programme.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40f0a0afad4fa768914e775942f538e88a912c09",
      "title": "Investors are loving Lovable",
      "url": "https://techcrunch.com/2025/08/28/investors-are-loving-lovable/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T14:04:06.000Z",
      "summary_90w": "",
      "raw": "Investors are clambering to get onto Swedish vibe-coding startup Lovable’s cap table, making unsolicited offers of investment that value the company at more than $4 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f3280e950d3cd757466ba50bc59217b25fb5143",
      "title": "European leaders outraged after Russian strikes kill 18 and damage EU's HQ ",
      "url": "https://www.bbc.com/news/articles/cvg3y7m2gz0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T14:04:05.000Z",
      "summary_90w": "",
      "raw": "The overnight attacks destroyed a block of flats and also caused damage to the EU's delegation offices.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03cc7246098ee68417866d9cb3b17fa18ed31636",
      "title": "AI hires or human hustle? Inside the next frontier of startup operations at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/28/ai-hires-or-human-hustle-inside-the-next-frontier-of-startup-operations-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T14:00:00.000Z",
      "summary_90w": "",
      "raw": "What happens when your first 10 hires aren’t people at all? At TechCrunch Disrupt 2025, we’re digging into the new wave of startups replacing or augmenting early employees with AI agents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2a7630e2bd5fb8338384cf00e0a72ffaa3580262",
      "title": "My gaming buddy",
      "url": "https://www.theverge.com/games/767156/gaming-grief",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T14:00:00.000Z",
      "summary_90w": "",
      "raw": "One of the most devastating parts of grief is how it can strike out of nowhere. There you are, doing a perfectly normal, everyday thing, and then that perfectly normal, everyday thing reminds you of something or someone who is no longer there. And when that presence you lost was intimately connected with your life, well, those moments happen frequently and unexpectedly.\nI recently had to say goodbye to an old friend named Millie, an 18-year-old shih tzu who was a constant and steady companion for nearly my entire adult life. In an attempt to get my mind off the sadness, I decided to take a little dip into the familiar with Animal Crossing,  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8dee0b8c07dbb3adf2b8cc691529d557c1699e5",
      "title": "British Tour de France winner Chris Froome airlifted to hospital after 'serious' crash",
      "url": "https://www.bbc.com/sport/cycling/articles/c4glv348xjwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T13:49:28.000Z",
      "summary_90w": "",
      "raw": "Four-time Tour de France winner Chris Froome suffers multiple injuries in a training crash in southern France.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "436057c36474e86a4d919dff7642347c0e135ac8",
      "title": "CDC director refuses to leave after White House order",
      "url": "https://www.bbc.com/news/articles/cwy3zjxy3dwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T13:32:01.000Z",
      "summary_90w": "",
      "raw": "Lawyers for Dr Susan Monarez say only the president can remove her from her job running the US Centers for Disease Control and Prevention.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "436057c36474e86a4d919dff7642347c0e135ac8",
      "title": "White House fires disease control director as other officials resign from health agency",
      "url": "https://www.bbc.com/news/articles/cwy3zjxy3dwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T13:32:01.000Z",
      "summary_90w": "",
      "raw": "Lawyers for Dr Susan Monarez say only the president can remove her from her job running the US Centers for Disease Control and Prevention.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d960e393187b24a16602dc6b99718e40aa0aad2",
      "title": "UK and EU summon top Russian diplomats after strikes hit British Council and EU offices in deadly attack on Kyiv - Europe live",
      "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T13:23:36.000Z",
      "summary_90w": "",
      "raw": "Overnight raid kills more than a dozen people as European leaders condemn ‘deliberate’ targeting of civilians and institutions\nUkrainian prime minister Yulia Svyrydenko has now responded to the overnight Russian attacks on Kyiv, criticising Moscow for “horrific and deliberate killing of civilians.”\n“The Russians are not choosing to end the war, only constant expansion of atrocities,” she said.\n“Overnight in Kyiv, dozens of buildings were hit: residential houses, office centers, civilian enterprises. Among them also the building where the European Union Delegation to Ukraine is located. \nRussians now believe that they have paralyzed Ukraine’s allies with feigned plans for ‘negotiations’ and endless delays that only serve as methods to buy time with the true goal only of preventing sanctions.\n“My thoughts are with all those affected by the senseless Russian strikes on Kyiv which have damaged the British Council building. \nPutin is killing children and civilians, and sabotaging hopes of peace. \n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c8325cc4ccf9a878a350ddf7ef1ca5250950559",
      "title": "Epping asylum seeker hotel order could spark more protests, court told",
      "url": "https://www.bbc.com/news/articles/cpqv01lxvyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T13:19:55.000Z",
      "summary_90w": "",
      "raw": "Lawyers for The Bell Hotel owners are challenging the decision for a temporary injunction at court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fc5e6b03786d845a826f1792b38f6e984b1c7f7",
      "title": "Top official embroiled in Equatorial Guinea sex tape scandal jailed ",
      "url": "https://www.bbc.com/news/articles/cx27zy49kn3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T13:12:46.000Z",
      "summary_90w": "",
      "raw": "A nephew of Equatorial Guinea's president is sentenced to eight years for embezzlement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d51236978cea1424b05550bcfe1d4c913c51943",
      "title": "Minneapolis mourns two children killed in shooting - here's what we know",
      "url": "https://www.bbc.com/news/articles/cy40znde9eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T13:03:00.000Z",
      "summary_90w": "",
      "raw": "Another 17 people were injured in Wednesday's attack, which unfolded as children attended a worship service.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f2ec3980265a23954461ea8517e86b612a19a43",
      "title": "Controversial tax rules on Welsh holiday lets could be amended under new proposal",
      "url": "https://www.bbc.com/news/articles/cvgvyxwzw2lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T13:01:57.000Z",
      "summary_90w": "",
      "raw": "Mark Drakeford says he has \"listened\" and is proposing \"small changes\" to the controversial rules.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b36521c5c1748450f6f0a30f21d22a61c9303e7",
      "title": "What are Rachel Reeves' options on property tax?",
      "url": "https://www.bbc.com/news/articles/cm2k1m56xgjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T12:57:57.000Z",
      "summary_90w": "",
      "raw": "Reports suggest the government is considering shaking up the property tax system to raise revenue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1ca323f518b23d1840a242293bbc00c7be1764dd",
      "title": "Russian missile and drone attack on Kyiv kills at least 18 people",
      "url": "https://www.theguardian.com/world/2025/aug/28/russia-launches-kyiv-attack-ukraine-capital-deaths-injuries",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T12:46:55.000Z",
      "summary_90w": "",
      "raw": "Zelenskyy says Moscow ‘chooses ballistics instead of the negotiating table’ after strikes on more than 20 locations\n• Europe live – latest updates\nRussian airstrikes on Kyiv have killed at least 18 people and wounded dozens in the most deadly night raid on the Ukrainian capital since the Alaska summit between Vladimir Putin and Donald Trump.\nSeventeen people were reported killed when a five-storey residential building in the eastern Darnytskyi district was struck in the middle of the night, said Svitlana Vodolaha, a spokesperson for the state rescue service.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f155fe14c4125ee1e558799b7a7cb2cef55082b2",
      "title": "Cases of flesh-eating screwworm on the rise in Mexico",
      "url": "https://www.bbc.com/news/articles/cn85e172yxxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T12:42:03.000Z",
      "summary_90w": "",
      "raw": "The parasites mainly infest cattle but there have also been dozens of cases involving people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb47cb4f7a6120890fdee6d4ce2182a5c58b8a7",
      "title": "Man, 59, arrested over racist abuse sent to England's Jess Carter",
      "url": "https://www.bbc.com/news/articles/c07plxg1vl3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T12:40:47.000Z",
      "summary_90w": "",
      "raw": "A 59-year-old is arrested in Lancashire after the messages were sent during Euro 2025, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ec334da274fce7ae3d35d1d6ba79c0204b5f840",
      "title": "ChargePoint’s new megawatt EV chargers could level the playing field with China",
      "url": "https://www.theverge.com/news/766156/chargepoint-dc-fast-charging-600-kw-megawatt",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T12:30:00.000Z",
      "summary_90w": "",
      "raw": "ChargePoint is ramping up the power for its next-generation DC fast charging architecture to 600 kW for passenger vehicles, and up to 3.75 megawatts (3,750 kW) for heavy-duty trucks — enough to power an entire football stadium. \nMost EVs on the road aren’t able to accept more than 350 kW of power while charging, but ChargePoint CEO Rick Wilmer said the idea was to future proof its charging infrastructure in anticipation of the arrival of higher powered EVs. Another consideration is China, which is beginning to roll out EVs with higher-voltage battery architectures that can handle increased power levels. But while China continues to set the standard for ultra-fast EV charging, the Campbell, CA-based charging company said its important for America to keep pace.\n“We’ve got to catch up,” said Wilmer in an interview. \nThe new architecture is not only more powerful, but also less expensive to install and operate, Wilmer said. The new Express chargers will be 30 percent less expensive to install and 30 percent less expensive to operate than the current generation of DC fast chargers. They will also have a 30 percent smaller footprint, with Wilmer claiming the Express chargers can be “pre-built” on a concrete slab and delivered on a flatbed truck to an installation site. \n\n“We’ve got to catch up.”\n\n\nChargePoint hasn’t said where it will be install its beefy new charging stations, though it did say it will be in conjunction with “participating utilities,” hinting at the heavy lift that’s required to supply this kind of power. Unlike like regular EV chargers, these new high-powered units can’t be installed just anywhere, as they demand high electrical capacity to operate at full load. \nThat said, ChargePoint says its partnership with power management company Eaton will develop solutions that can overcome grid restraints. The two companies announced their intention to work together earlier this year, with a particular focus on the US, Europe, and Canada. The new Express chargers will feature both companies’ logos. \nOne configuration of this new architecture is what Wilmer calls a “power block,” a 600kW charging cabinet that can support AC (alternating current) to DC (direct current) conversion as well as DC to DC conversion. He described how one power block can be used to power a variety of different EVs: “You can now divide that into 12 simultaneous ports. So imagine doing 12 vehicles at 50 kilowatts, six vehicles at 100 kilowatts, four vehicles at 150 kilowatts — do the math any way you want.”Aggregating three blocks can deliver 1.8 MW of power for heavy-duty electric trucks.\nChargePoint and Eaton were able to achieve these higher power outputs by eliminating the AC-to-DC conversion in some configurations, and just having the architecture convert DC to DC while connected directly to a microgrid, Wilmer said. This improves efficiency by “putting more power in the box.” Wilmer acknowledged that there aren’t many DC-only microgrids available to power the new architecture, but noted that Eaton was in the process of bringing more online.\nAs such, ChargePoint plans on being “very selective” in how it rolls out the new architecture starting in the second half of 2026. But Wilmer envisions power moving seamlessly between the grid, EVs, stationary batteries, and more through a vehicle-to-everything (V2X) power management system.\n“It’s very elegant with this DC architecture to move that energy around to where it’s needed on the site and then into the fixed battery and then back to the grid when it’s needed by the grid,” he said. \nThe news comes on the heels of ChargePoint’s announcement of higher powered Level 2 chargers for homes and businesses. Taken together, Wilmer says that improved EV charging can help prevent sales from sliding too far off track after federal incentives are phased out. \n“You’ve got to lower the cost, lower the cost to operate it, allow it to be deployed more quickly at less costly, and hopefully in shorter timeframes,” he said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f9589981def41dedd059d4e524f2ac5ee510020e",
      "title": "How a 16-year-old company is easing small businesses into AI",
      "url": "https://techcrunch.com/2025/08/28/how-a-16-year-old-company-is-easing-small-businesses-into-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Whether AI is a bubble or not, it's helping some small businesses save real money. Here's how one has cautiously approached adoption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f75938b49844e5400cd4d9c1abdbbfbef294c4d5",
      "title": "The best alternatives to Spotify for listening to music",
      "url": "https://www.theverge.com/22910685/music-listening-service-spotify-apple-youtube-amazon",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T12:30:00.000Z",
      "summary_90w": "",
      "raw": "When this article was originally written in February 2022, the big Spotify controversy was that artists were abandoning the audio service in protest of the company's contract with podcaster Joe Rogan, and some subscribers were deciding to follow the musicians' example. More recently, some users have threatened to bail after CEO Daniel Ek invested in a firm that specializes in AI software used for military drones. Meanwhile, the service's habit of defaulting to making all playlists and profiles public has resulted in the Panama Playlists, a website that purports to show the Spotify playlists of various well-known figures. \nDespite those issu …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "46bbc4fe980bcba261d1c6d9a09ed43c15e914e8",
      "title": "UK summons Russian ambassador over British Council missile damage in Kyiv",
      "url": "https://www.theguardian.com/politics/2025/aug/28/uk-summons-russian-ambassador-over-british-council-missile-damage-in-kyiv",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T12:26:15.000Z",
      "summary_90w": "",
      "raw": "Incident marks the first time British government property has been caught up in Moscow’s war with Ukraine\n\nUK politics live – latest updates\n\n\nEurope live – latest updates\n\nThe Foreign Office has summoned the Russian ambassador after missile strikes on Kyiv killed at least 17 people and damaged the city’s British Council office.\nThe ambassador, Andrey Kelin, was summoned at 1pm in London, in direct response to the severe damage inflicted on the building, government sources said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "880a243706ae6a3887b0f03c52fdb6e3c4b8f741",
      "title": "Blair joins White House meeting with Trump on post-war Gaza",
      "url": "https://www.bbc.com/news/articles/c4gmrxd8ryno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T12:08:04.000Z",
      "summary_90w": "",
      "raw": "The talks come as Israel prepares to seize Gaza City as a step towards full control of the territory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f97a77e51d881ffc0d1cc6732d2c7a41a86bd310",
      "title": "MagSafe PopSockets have come for your Kindle",
      "url": "https://www.theverge.com/news/767369/popsocket-popcase-kindle-magsafe-price-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T12:05:06.000Z",
      "summary_90w": "",
      "raw": "You can now add swappable magnetic PopSocket grips to Kindle e-readers without undertaking any DIY hacks. PopSocket has launched new PopCase Kindle cases that come with a built-in MagSafe ring, optimally positioned for hand placement and weight management when a MagSafe-compatible PopGrip is attached. \nThe $40 cases are available for 11th and 12th-generation Kindles in six designs — including a transparent version that can be customized with stickers, and two illustrated designs that look very BookTok-inspired. There’s also some $30 thematically matching PopGrips featuring books, but the cases will work with PopSocket’s existing lineup of MagSafe grips, including the Kick-Out Grip and Stand, if you want to read hands-free.\nUsers in the Kindle community have been using the adhesive versions of PopSockets for years to make the e-readers easier to hold, and less likely to fall on your face when reading in bed. Manually customizing cases with MagSafe rings has also proved popular with users who prefer to switch between PopGrip designs and other PopSocket accessories, but the PopCase Kindle spares having to make those DIY efforts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f91af1cdbc689d81d560ec3e4386646fcde5c44e",
      "title": "TransUnion says hackers stole 4.4 million customers’ personal information",
      "url": "https://techcrunch.com/2025/08/28/transunion-says-hackers-stole-4-4-million-customers-personal-information/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T12:04:57.000Z",
      "summary_90w": "",
      "raw": "The credit reporting giant confirmed unauthorized access to a third-party application storing the personal information of its customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d6d630609600cb0d682fe6696cf9a1bf64586702",
      "title": "DJI’s Mic 3 crams more features into a smaller package",
      "url": "https://www.theverge.com/news/767297/dji-mic-3-wireless-microphone-launch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The DJI Mic 3 has shrinked without scrimping.\t\n\nDJI is making its latest wireless lavalier microphone system even smaller without scrimping on features or battery life. The DJI Mic 3 is half the size and weight of its Mic 2 predecessor and introduces new capabilities, including two adaptive gain control modes, three voice tone presets, and a sizable increase in storage capacity for internal recordings.\nDJI’s latest wireless mic can support up to four transmitters and eight receivers at once for recording audio from large groups, with a range of 400 meters (1,312 feet). The Mic 3 automatically switches between 2.4GHz and 5GHz frequency bands to help keep the transmission stable and prevent interference. Two-level active noise cancelling is also available for reducing background sounds.\nThe Adaptive Gain Control modes include an Automatic option that can suppress sudden volume spikes and prevent clipping in noisy environments, and a Dynamic mode that automatically adjusts gain to keep volume consistent in quieter indoor settings like studios. The three voice tone presets include Regular, Rich, and Bright, which can be selected based on the vocal characteristics of whoever is speaking to adjust clarity.\nAt 16 grams, the Mic 3 is closer in size and weight to the 10-gram Mic Mini system that DJI launched last year. Unlike the Mic Mini, however, the Mic 3 retains features like built-in backup recording abilities to prevent losing audio, and a touchscreen display on the receiver to adjust settings and monitor battery levels. It also includes 32GB of storage for dual-file internal recordings that support both 24-bit and 32-bit floating points, which is significantly larger than the 8GB of built-in storage on the Mic 2.\nBattery life sits between the two older DJI lav mics, providing up to eight hours for the receiver and 10 hours for the transmitter, compared to six hours for both on the Mic 2, and up to 11.5 hours and 10.5 hours on the Mic Mini’s transmitter and receiver, respectively. The Mic 3 charging case provides 2.4 full charges, according to DJI, giving users 28 hours of extra juice on the go.\nWhat we don’t know is the price or release timeline. DJI says the Mic 3 won’t be available in the US immediately, which suggests it’ll be launching in other markets first. The two-microphone transmitter kit for the Mic 2 launched at $219, and the more affordable Mic Mini is $169 by comparison, so we’ll have to wait and see how the Mic 3 stacks up when it arrives in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49e429c10139087eb1742163799bd019077a73c4",
      "title": "Get ready, EV owners: Here come the dongles",
      "url": "https://techcrunch.com/2025/08/28/get-ready-ev-owners-here-come-the-dongles/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The transition from CCS to NACS will unlock thousands more fast chargers for many EV drivers, but they'll need to know their adapters to get the most out of it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cbe08e5cb6a64a0bee13d8f8cb9abf712d65409d",
      "title": "'Cowering Amorim image hard to shake' - can he come back from this?",
      "url": "https://www.bbc.com/sport/football/articles/cy08zywdlx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T11:44:07.000Z",
      "summary_90w": "",
      "raw": "As Manchester United reach a new low after their EFL Cup defeat at Grimsby, BBC Sport assesses whether Ruben Amorim can recover.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "087aefe280ad2cea68f574c740f35f9145169547",
      "title": "AI firm says its technology weaponised by hackers",
      "url": "https://www.bbc.com/news/articles/crr24eqnnq9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T11:40:27.000Z",
      "summary_90w": "",
      "raw": "A report from the makers of Claude said the AI tool had been used to commit cyber-attacks and fraud.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c3f305ff521c6b2172927f7c4e272164e23c58fb",
      "title": "Electric cars eligible for £3,750 discount announced",
      "url": "https://www.bbc.com/news/articles/cvgvywyev1do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T11:37:52.000Z",
      "summary_90w": "",
      "raw": "The Puma Gen-E and e-Tourneo Courier are two Ford models drivers can purchase under the government scheme.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c40448bce011377e88356ab79ff3c8d9bc04de2",
      "title": "The Summer I Turned Pretty fans told to stop abuse",
      "url": "https://www.bbc.com/news/articles/cp894e9n44po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T11:36:56.000Z",
      "summary_90w": "",
      "raw": "Viewers are asked to start \"acting normal online\" amid the build-up to the show's dramatic climax.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eeb14048b0fd697e6b26f40750faabb76e80f2b8",
      "title": "How U.S. policy failed Gaza. And, the latest info on the Minneapolis school shooting",
      "url": "https://www.npr.org/2025/08/28/g-s1-85965/up-first-newsletter-minneapolis-shooting-cdc-susan-monarez-gaza-famine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T11:30:56.000Z",
      "summary_90w": "",
      "raw": "Exclusive interviews with NPR reveal how U.S. policy during Biden's administration impacted Gaza. And, a shooter opened fire on a Minneapolis church yesterday, killing two children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e485216ef5c359604c8cf759bd3142cbedb824c",
      "title": "Israeli strikes kill six Syrian troops, Syria says",
      "url": "https://www.bbc.com/news/articles/cp37kdjk0n2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T11:13:26.000Z",
      "summary_90w": "",
      "raw": "The Israeli military declined to comment on reports of the strikes, which Syria condemned.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "853b52747ac429636dd83c4ebf76fca31e0d98c6",
      "title": "Apple pulls iPhone torrent app from AltStore PAL in Europe",
      "url": "https://www.theverge.com/news/767344/apple-removes-itorrent-altstore-pal-ios-marketplace",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T11:12:49.000Z",
      "summary_90w": "",
      "raw": "Apple has removed the iPhone torrenting client, iTorrent, from AltStore PAL’s alternative iOS marketplace in the EU, showing that it can still exert control over apps that aren’t listed on the official App Store. iTorrent developer Daniil Vinogradov told TorrentFreak that Apple has revoked his distribution rights to publish apps in any alternative iOS stores, so the issue isn’t tied to AltStore PAL itself.\n“Apple removed Alternative Distribution functionality from iTorrent’s Developer Portal without any warning,” Vinogradov said on iTorrent’s Github page. Apple has not provided a reason for the removal, according Vinogradov, and distribution was revoked at the Apple Dev Account level. The matter is also being investigated by AltStore PAL.\nWhile Apple bans torrent apps on its own iOS store, the EU’s Digital Markets Act gave iPhone users within the bloc greater freedom to install apps from third-party app stores that the Cupertino company doesn’t directly manage. iTorrent was added to AltStore PAL in July last year, which raises the question: why now?\nWe’ve asked Apple to answer that and will update this story if we hear back.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4731627b6c1e9f6cb70d0de1186b96d13d6c2c7e",
      "title": "North Korea's Kim will meet with Xi and Putin at Chinese military parade",
      "url": "https://www.npr.org/2025/08/28/g-s1-85964/north-koreas-kim-will-meet-with-xi-and-putin-at-chinese-military-parade",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T11:09:53.000Z",
      "summary_90w": "",
      "raw": "With Russia's Vladimir Putin also coming for the parade, the event will underline the three-way alignment among Beijing, Moscow and Pyongyang in the face of a U.S. push to bolster its alliances with South Korea and Japan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cafbfae9bdb7e62fb55a57077a215a18c85de0e4",
      "title": "Taipei City council in the dog house over Chinese-made patrol robot",
      "url": "https://www.theguardian.com/world/2025/aug/28/taipei-city-council-in-the-dog-house-over-chinese-made-patrol-robot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:01:43.000Z",
      "summary_90w": "",
      "raw": "Opposition councillor in Taiwanese capital accuses authorities of sending ‘Trojan horse’ into citizens’ daily lives\nTaipei City council has come under fire after admitting that a robot dog it bought to help patrol city streets using surveillance cameras was made by a Chinese companylinked to the Chinese military.\nHammer Lee, the deputy mayor of Taiwan’s capital, introduced a “new patrol partner” for the management and repair of pedestrian areas in a post on Facebook on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e4292b5aa243dad879ff6d5a3b2537c397217935",
      "title": "Tesla sales in Europe slump 40% as BYD new car registrations more than triple",
      "url": "https://www.theguardian.com/technology/2025/aug/28/tesla-sales-in-europe-slump-byd-new-car-registrations-more-than-triple-elon-musk",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T10:57:09.000Z",
      "summary_90w": "",
      "raw": "Electric car business run by Elon Musk continues to lose ground to Chinese rival despite recent revamp of Model Y\n\nBusiness live – latest updates\n\nTesla sales slumped 40% across Europe in July compared with a year earlier as Elon Musk’s electric car company faces increasingly tough competition from its Chinese rival BYD.\nThere were 8,837 sales of Tesla cars last month across the EU, the European Free Trade Association and the UK, according to figures from the European Automobile Manufacturers’ Association (ACEA). That compared with 14,769 at the same point last year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6eccaf5923ec9884b0e304aed9929dcbb8b16398",
      "title": "Reform council boss bans local newspaper's reporters",
      "url": "https://www.bbc.com/news/articles/cger45p0lv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T10:46:01.000Z",
      "summary_90w": "",
      "raw": "The Nottingham Post describes the ban as \"concerning\" and \"unprecedented\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efbd60e56168f80ccc640ae2db619d1b28d1a4ab",
      "title": "Final arguments conclude in Jimmy Lai national security trial in Hong Kong",
      "url": "https://www.theguardian.com/world/2025/aug/28/jimmy-lai-national-security-trial-hong-kong-media-democracy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T10:40:51.000Z",
      "summary_90w": "",
      "raw": "Government-picked judges consider verdict in high-profile case against pro-democracy media mogul\nFinal arguments have concluded in the national security trial of the pro-democracy media tycoon Jimmy Lai in Hong Kong.\nGovernment-picked judges are retiring to consider their verdict in the case, seen internationally as a crucial test of the rule of law in the city.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eab81e9a73bbc51995f9832a0bea0fd801e02dac",
      "title": "'My friend got hit in the back': Witnesses describe terror of Minneapolis school shooting",
      "url": "https://www.bbc.com/news/articles/cev2w1elx7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T10:36:36.000Z",
      "summary_90w": "",
      "raw": "One young boy says he was protected from gunfire in a church by a friend who lay on top of him and was shot.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eab81e9a73bbc51995f9832a0bea0fd801e02dac",
      "title": "'My friend got hit in the back': Witnesses describe terror of US school shooting",
      "url": "https://www.bbc.com/news/articles/cev2w1elx7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T10:36:36.000Z",
      "summary_90w": "",
      "raw": "One young boy says he was protected from gunfire in a church by a friend who lay on top of him and was shot.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82223cac4809d6975fb2878c7292207b9e304e0f",
      "title": "Starmer to replace third top aide in less than a year",
      "url": "https://www.bbc.com/news/articles/czr6zmd5d0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T10:16:26.000Z",
      "summary_90w": "",
      "raw": "Nin Pandit runs the PM's team in Downing Street and has only been in the role for ten months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b68f329b902d9a7fceea53b06b4c10256784d53",
      "title": "Value of small parcels sent from China to UK hits £3bn",
      "url": "https://www.bbc.com/news/articles/cnv78eey8plo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T10:03:46.000Z",
      "summary_90w": "",
      "raw": "Parcels from China that are exempt from UK import tax more than doubled in value to £3bn last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2db9e2565701862c6e3d58b6e16e80fd0e49b3e3",
      "title": "Overcrowding in NSW hospitals ‘worst’ some doctors have seen as winter illnesses clog emergency departments",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/overcrowding-in-nsw-hospitals-worst-some-doctors-have-seen-as-winter-illnesses-clog-emergency-departments",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T10:02:41.000Z",
      "summary_90w": "",
      "raw": "State health minister Ryan Park says there have been more than 45,000 presentations to EDs over the past five days\n\nGet our breaking news email, free app or daily news podcast\n\nThe New South Wales health minister has encouraged people to call the health hotline instead of going to emergency departments as a spike in winter illnesses has doctors saying overcrowding is the “worst they have ever seen”.\nIn a statement on Thursday, Ryan Park said there had been more than 45,000 presentations to EDs over the past five days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb703084374892c90928ac3c197409e8c3cfe161",
      "title": "Expelled ambassador says allegations against Iran ‘baseless’ during Sydney airport exit",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/iran-ambassador-ahmad-sadeghi-leaves-australia-airport",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T09:54:47.000Z",
      "summary_90w": "",
      "raw": "Ahmad Sadeghi faced media questioning at the airport before boarding a flight out of Australia\n\nGet our breaking news email, free app or daily news podcast\n\nIran’s former ambassador to Australia – now persona non grata – has denied allegations his government was behind two antisemitic arson attacks in Australia, describing the accusations as “baseless” as he left the country.\nAhmad Sadeghi faced media questioning at Sydney airport before boarding a flight out of Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3a1d3c89d21a69d9725e15c9c7b434f87a76b78",
      "title": "Denmark summons U.S. envoy over claims of interference in Greenland",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5520519/denmark-us-envoy-interference-greenland",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:24:23.000Z",
      "summary_90w": "",
      "raw": "Denmark's foreign minister summoned the top U.S. diplomat in the country for talks after the main national broadcaster reported that at least three people with connections to President Donald Trump have been carrying out covert influence operations in Greenland.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed794cb5753cef694d5b795171bf4143f3d86ecf",
      "title": "Labor accused of trying to ‘sneak through’ law change to strip non-citizens of fair process",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/labor-accused-of-trying-to-sneak-through-law-change-to-strip-non-citizens-of-fair-process",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T09:22:32.000Z",
      "summary_90w": "",
      "raw": "Greens’ David Shoebridge calls amendment ‘one of the nastiest, meanest attacks’ on multicultural Australia\n\nFollow our Australia news live blog for latest updates\n\nRefugee and human rights groups will launch a campaign demanding the federal government scrap a controversial migration amendment to explicitly remove procedural fairness in deportation decisions for foreign-born criminals, a proposal which advocates say is causing alarm among migrants.\nThe Senate on Thursday rejected a Greens push for an inquiry into the legislation, which the senator David Shoebridge slammed as “one of the nastiest, meanest attacks” on multicultural Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "067ea45ced6e1dcf1337bd62cf415737eefaa282",
      "title": "More than 10 European startups became unicorns this year",
      "url": "https://techcrunch.com/2025/08/28/more-than-10-european-startups-became-unicorns-this-year/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T09:16:00.000Z",
      "summary_90w": "",
      "raw": "This is a good indication of the sectors that are hot among investors, from biotech and defense tech to AI, AI, and AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bbb4faa6eefe01a57fb9e4807277c4f5d18e4f25",
      "title": "Lehrmann demands access to Facebook messages Network 10 defamation case solicitor allegedly sent to rape victim",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/lehrmann-demands-access-to-facebook-messages-network-10-defamation-case-solicitor-allegedly-sent-to-victim-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T09:05:37.000Z",
      "summary_90w": "",
      "raw": "Lehrmann’s solicitor Zali Burrows claims alleged victim was sent messages by lead solicitor in Network 10’s defence against an unrelated defamation case\n\nGet our breaking news email, free app or daily news podcast\n\nBruce Lehrmann will demand access to Facebook messages his legal team claims were sent by a Network 10 solicitor to the alleged victim in his rape case.\nLehrmann, who is on bail and yet to formally enter a plea, is accused of raping a woman twice during the morning of 10 October 2021.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e39cacd1fd58f564cc0ffe830699b10d6c8a0dc4",
      "title": "'We didn't do enough': How U.S. policy failed Palestinians in Gaza",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5515620/israel-gaza-biden-famine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "As famine plagues Gaza, NPR exclusive reporting looks at the U.S. role in the humanitarian crisis. Many former officials NPR interviewed share a common refrain: Did we do enough to prevent this?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b54ee0cdddbafa94eaf233ba3fda3606b496aca",
      "title": "70 years after Emmett Till's murder, Mississippi museum acquires gun used to kill him",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519776/emmett-till-murder-mississippi-museum-gun",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "It's been 70 years since Emmett Till, a Black teenager visiting relatives in Mississippi, was killed by white men because he whistled at a white woman. Now the gun used in his death is in a museum.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6cefbfaef2197ae6c08da96ecb86481f86dfdfd3",
      "title": "Amtrak's flagship Acela trains get a long-awaited upgrade",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5515654/amtrak-acela-trains-northeast-corridor-upgrade",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The NextGen Acela trains, as Amtrak calls them, are faster and lighter than the current fleet. They're scheduled to start revenue service along the Northeast Corridor on Thursday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8987b9337029c515bd404f63e21ebd961dade374",
      "title": "Minneapolis Catholic school shooting: What we know so far",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519768/minneapolis-school-shooting-church-what-we-know",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Local authorities recovered additional firearms at three residences in the Minneapolis area that are linked to the shooter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c64665e4dcc3e310f508f8be217d0feee4be1ed7",
      "title": "Speaker Johnson slashed Medicaid. His constituents could lose health services",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5518040/speaker-johnson-medicaid-cuts-louisiana",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In Mike Johnson's district, not only could thousands of Louisianians lose coverage, health centers are bracing for a financial hit. They're hoping for additional funding to make up for Medicaid cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "923d2709a093289394b09d640dfe274622715f7e",
      "title": "These investigators patrol Las Vegas looking for one thing: water waste",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5518196/las-vegas-drought-water-patrol-conservation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Southern Nevada Water Authority has investigators who patrol Las Vegas neighborhoods in search of wasted water.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "527492385727292a3f79b563f95beef74922accf",
      "title": "This rule made many online purchases dirt cheap for U.S. consumers. Now it's ending",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519361/de-minimis-rule-tariffs-consumers-imports-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "On Friday, the U.S. is ending its de minimis rule that made it easy for cheap goods to reach consumers. The change will affect roughly 4 million such packages processed each day.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "797f424168be268168dc953ded30595c251feba4",
      "title": "Controversial domestic violence laws pass Queensland parliament as experts warn they could be weaponised against victims",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/queensland-mps-vote-on-controversial-plan-to-give-police-power-to-issue-on-the-spot-domestic-violence-orders",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T08:43:26.000Z",
      "summary_90w": "",
      "raw": "Police to have power to issue ‘on-the-spot’ DV orders despite experts and advocacy groups warning victims could be misidentified as perpetrators\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland parliament has passed controversial legislation permitting police to issue on-the-spot domestic violence orders despite warnings from experts and advocacy group that the laws could be weaponised against victim-survivors.\nLiberal National party members of state parliament voted to pass legislation granting police the power to issue “police protection directives”, with conditions similar to other domestic violence protection orders.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb120cd0e79997e382bae01afdb7c72de72113b6",
      "title": "Caning and fines for those caught in Singapore drug vape crackdown",
      "url": "https://www.bbc.com/news/articles/cz60z98nzx7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T08:34:26.000Z",
      "summary_90w": "",
      "raw": "A rise in popularity of vapes laced with etomidate, an anaesthetic drug, has caused widespread alarm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48ece2d1ec3f83a2222de04e043e85431e4eda4a",
      "title": "FBI investigates Minneapolis school shooting as anti-Catholic hate crime",
      "url": "https://www.bbc.com/news/articles/c7760x87r4po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T08:06:34.000Z",
      "summary_90w": "",
      "raw": "Two children were killed when an attacker opened fire through the windows of the city's Annunciation Church.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0cab569622d494e34cd20f9261d5e6fba415e713",
      "title": "Xi shows Trump who holds the cards as he sets up meeting with Kim and Putin",
      "url": "https://www.bbc.com/news/articles/cx29z9g2kl2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T07:13:23.000Z",
      "summary_90w": "",
      "raw": "The leaders of North Korea and Russia will attend China's military parade next week - a win for Xi.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0088ba8e38df1a7806498dd95451bddb1478a66f",
      "title": "Iran faces return of sweeping sanctions from UK, France and Germany",
      "url": "https://www.theguardian.com/world/2025/aug/28/iran-return-sanctions-uk-france-germany",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:52:57.000Z",
      "summary_90w": "",
      "raw": "Decision by European powers follows Iran’s failure to readmit UN inspectors to all of its nuclear sites\nThe UK, France and Germany are expected to announce on Thursday that they will reimpose sweeping sanctions on Iran for failing to readmit UN inspectors into all of its nuclear sites.\nThe decision, under consideration for months, is likely to provoke the worst crisis in Iran’s relations with the west since Israel’s attacks on the country’s nuclear sites in June. Iran is already preparing countermeasures.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37aa811eccb417ff986e00dff34d9c6a9bedb670",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "url": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:00:25.000Z",
      "summary_90w": "",
      "raw": "Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing\nMalawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.\nIt comes just months after the World Health Organization (WHO) revealed that the country had successfully reduced tuberculosis (TB) cases by 40% over the past decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f2b0a180279e02a1f11eced7bbbe894a856241fc",
      "title": "North Korea's Kim Jong Un to join Putin at China military parade",
      "url": "https://www.bbc.com/news/articles/c17njr88ge4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T05:02:43.000Z",
      "summary_90w": "",
      "raw": "The reclusive North Korean leader's attendance at the event comes days after Trump said he wants to meet Kim.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9824195d4fde293403a8b0f79b9f64dfc5f1321",
      "title": "Maisa AI gets $25M to fix enterprise AI’s 95% failure rate",
      "url": "https://techcrunch.com/2025/08/27/maisa-ai-gets-25m-to-fix-enterprise-ais-95-failure-rate/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Maisa AI is built on the premise that enterprise automation requires accountable AI agents, not opaque black boxes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "79c1a82e054a0136b1ca2d994e32ae41ec5c9fe1",
      "title": "Putin and Kim to join Xi at Chinese military parade in show of defiance to the west",
      "url": "https://www.theguardian.com/world/2025/aug/28/vladimir-putin-kim-jong-un-join-president-xi-chinese-military-parade-defiance-to-west",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T04:49:05.000Z",
      "summary_90w": "",
      "raw": "The Victory Day parade in Beijing on 3 September will mark the formal surrender of Japan during the second world war. No western leaders will attend\nVladimir Putin and Kim Jong-un are among the world leaders who will attend a military parade with President Xi Jinping in Beijing next week, in a show of collective defiance amid western pressure.\nNo western leaders will be among the 26 foreign heads of state and government attending the parade next week – with the exception of Robert Fico, prime minister of Slovakia, a member of the European Union – according to the Chinese foreign ministry.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T04:46:05.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de5a3a1e63a8c0826a8ed2530b7dd28f51a9d52b",
      "title": "Teenager who shot Colombian senator sentenced to seven years ",
      "url": "https://www.bbc.com/news/articles/c707l5vvn8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T04:26:53.000Z",
      "summary_90w": "",
      "raw": "The 39-year-old politician was shot in the head during a presidential rally in Bogotá in June.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0b43b3a09c4f82121a0e8c4fad46b3f1a4e81f9",
      "title": "Spain and Portugal wildfires drive worst EU season on record",
      "url": "https://www.bbc.com/news/articles/cd6n8qqlj8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T03:13:48.000Z",
      "summary_90w": "",
      "raw": "Wildfires have scorched southern Europe and new research suggests climate change played a major role.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88c9c7deae257afa163de608c9b5766a4b89c841",
      "title": "F1's Lando Norris says friendship with team-mate Oscar Piastri is \"tricky\" as they battle for title",
      "url": "https://www.bbc.com/news/articles/cgkr452xj81o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T01:49:32.000Z",
      "summary_90w": "",
      "raw": "\"It's difficult knowing you really want to beat that person, but have a good working friendship.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c2ee56bad0e9c5808909da6f210458baa97453a",
      "title": "Microsoft fires two employee protesters who occupied its president&#8217;s office",
      "url": "https://www.theverge.com/news/767251/microsoft-fires-two-employees-building-34-brad-smith-office-protest",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T01:48:10.000Z",
      "summary_90w": "",
      "raw": "Microsoft has fired two employees that were involved in a sit-in protest in vice chair and president Brad Smith’s office. Software engineers Riki Fameli and Anna Hattle were both dismissed today, after being part of a group of seven protesters that managed to get inside Smith’s office in Building 34 yesterday. \nMicrosoft was forced to temporarily lock down its executive building. The protesters live streamed themselves on Twitch entering Smith’s office, and demanded that the company cut ties with the Israeli government. Microsoft employees Anna Hattle and Riki Fameli were both arrested during the incident, alongside former Microsoft employees Vaniya Agrawal, Hossam Nasr, and Joe Lopez. A former Google employee and another tech worker were also arrested.\nAn unnamed Microsoft spokesperson told GeekWire that the two employees were terminated “following serious breaches of company policies and our code of conduct.” Microsoft refused to provide an attributable statement to The Verge.\nHours after the protesters were arrested, Brad Smith then held an emergency press conference in his office. Seated on the edge of his desk, Smith addressed a group of reporters and viewers on a YouTube live stream. Smith said that Microsoft is “committed to ensuring its human rights principles and contractual terms of service are upheld in the Middle East.” He said the company launched an investigation earlier this month after The Guardian reported that Microsoft’s Azure cloud platform was being used for surveillance of Palestinians.\nHattle was previously arrested during protests at Microsoft’s headquarters last week, where Redmond police arrested 20 people after a group took over a plaza at Microsoft’s headquarters to protest against the company’s contracts with Israel. Protestors at Microsoft’s campus set up a “Liberated Zone” encampment, and poured red paint over a Microsoft sign on campus.\nThe latest protests were organized by No Azure for Apartheid, a group of current and former Microsoft workers who are demanding that the company cut its ties with the Israeli government. The group has carried out a variety of protests in recent months, with the latest disruptions escalating to the homes and offices of Microsoft executives.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a225ed84824b10325aac10baed0fc78ba43b916b",
      "title": "US tells Denmark to 'calm down' over alleged Greenland influence operation",
      "url": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T01:44:42.000Z",
      "summary_90w": "",
      "raw": "The aim was reportedly to infiltrate Greenland's society and promote its secession from Denmark.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a7cc0432c4399d0d21422e5d9cb70ff609ae7336",
      "title": "With India’s corporate banking lagging decades behind consumer fintech, TransBnk raises $25M to bridge the gap",
      "url": "https://techcrunch.com/2025/08/27/with-indias-corporate-banking-lagging-decades-behind-consumer-fintech-transbnk-raises-25m-to-bridge-the-gap/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T00:33:43.000Z",
      "summary_90w": "",
      "raw": "TransBnk has raised $25 million in a round led by Bessemer Venture Partners to digitize India’s corporate banking.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "01e738014874ba90c5763ccb7352fa2ade978c63",
      "title": "FDA approves updated covid vaccines, but with severe new limits",
      "url": "https://www.theverge.com/news/767208/fda-covid-vaccine-approval-rfk-cdc-director-susan-monarez",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T00:10:15.000Z",
      "summary_90w": "",
      "raw": "On Wednesday, the FDA approved the new round of COVID-19 vaccines from Pfizer, Moderna, and Novavax for use by seniors over the age of 65. But for anyone younger than that, the FDA approval only mentions  people who have “at least one underlying condition that puts them at high risk for severe outcomes from COVID-19.” It also removed one option for children entirely, revoking the Pfizer vaccine’s emergency use authorization for children under 5.\nShortly after the FDA announced the new guidelines, a report from The Washington Post said that the Centers for Disease Control and Prevention ousted its director, Susan Monarez. That was confirmed in a post on X by the Department of Health and Human Services, which is now led by longtime anti-vaccine crusader, Robert F. Kennedy Jr. However, Mark Zaid, who said he is one of the lawyers representing Monarez, responded by posting, “Dr. Monarez has neither resigned nor yet been fired. She will not resign,” and the following statement:\nStatement from Mark S. Zaid & Abbe David Lowell\nCounsel for CDC Director Susan Monarez\nAugust 27, 2025 – 7:03 pm ET\nFirst it was independent advisory committees and career experts. Then it was the dismissal of seasoned scientists. Now, Secretary Kennedy and HHS have set their sights on weaponizing public health for political gain and putting millions of American lives at risk.\nWhen CDC Director Susan Monarez refused to rubber-stamp unscientific, reckless directives and fire dedicated health experts she chose protecting the public over serving a political agenda. For that, she has been targeted. Dr. Monarez has neither resigned nor received notification from the White House that she has been fired, and as a person of integrity and devoted to science, she will not resign.\n\n\n\n\n The Post says Monarez was “pressed for days” by Kennedy about whether she would support reworking the FDA’s policies. The Post reports that “at least three top CDC officials”  have announced plans to resign, including Demetre Daskalakis, director of the National Center for Immunization and Respiratory Diseases, and Debra Houry, chief medical officer.\nAfter previewing the update in May, the government removed healthy pregnant people and children from its list of people recommended to receive the covid vaccine, which CNN reports has already prevented some people from getting vaccinated.\nIn a tweet, Kennedy claims the actions will “keep vaccines available to people who want them, especially the vulnerable,” however, they could now require millions of Americans to prove they are at risk, putting an additional hurdle in the way of getting vaccinated.\nThe New York Times reports that an upcoming CDC decision could impact availability and access at drugstore sites, as laws in some states require the CDC’s recommendation for pharmacy staff to administer the shots. As we noted last month, Kennedy recently fired 17 people from the federal committee (ACIP) responsible for making vaccine recommendations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3dee277dc6fff37ac7b6691eb70c021f7943530a",
      "title": "Ontario premier Doug Ford’s party spent nearly $300,000 on novelty ‘Canada is not for sale’ hats",
      "url": "https://www.theguardian.com/world/2025/aug/28/ontario-premier-doug-ford-spent-six-figures-canada-not-for-sale-hats",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T23:49:07.000Z",
      "summary_90w": "",
      "raw": "The Progressive Conservative party of Ontario reportedly paid C$278,910.71 on the viral hats during the province’s election campaign\nDealing with the unprecedented threats from Donald Trump’s threats to Canada’s economy and sovereignty have required unconventional strategies from federal and provincial leaders, including barring liquor sales and cancelling contracts with Tesla.\nBut among the more unorthodox strategies to hit back against the US is spending hundreds of thousands of dollars on novelty hats.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5a92de56256ab4f0c4ebcee40de5b222310578b",
      "title": "A pregnant woman's diary of escape from war zone: 'I prayed the baby wouldn't come'",
      "url": "https://www.bbc.com/news/articles/c9870xjezk4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T23:35:30.000Z",
      "summary_90w": "",
      "raw": "Gun-wielding drivers, extortion and breakdowns, as couple flee new front line in Sudan's conflict.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1d0d4c84dc0158bf1e10241b8ee35b94bf27d13",
      "title": "Japanese town wants residents to limit smartphone use to two hours a day",
      "url": "https://www.theguardian.com/world/2025/aug/28/japanese-town-toyoake-proposes-smartphone-limit-residents-two-hours-day",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T23:30:16.000Z",
      "summary_90w": "",
      "raw": "Draft ordinance in Toyoake has triggered a backlash from locals, with some calling it an attack on individual freedom\nA town in Japan is to urge all residents to restrict their smartphone use to two hours a day in an attempt to tackle online addiction and sleep deprivation.\nOfficials in Toyoake, Aichi prefecture, said the measure would target not only children but also adults, amid growing concern about the physical and psychological toll excessive smartphone use is taking on people of all ages.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7feeb578e209dbf8779d169869ddbed0aa7aee4",
      "title": "Woman says Chinese student predator raped her hours before second attack",
      "url": "https://www.bbc.com/news/articles/c79l4z3v3p3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T23:01:51.000Z",
      "summary_90w": "",
      "raw": "Police first thought there had only been one rape, because the women's stories were so similar.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "409c363b04ef899fabb5e61b84d581ca725ffc97",
      "title": "A charity is giving people money to stop homelessness - and it says it's working",
      "url": "https://www.bbc.com/news/articles/ce83716edj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T23:00:20.000Z",
      "summary_90w": "",
      "raw": "Providing money gives people at risk of losing their home the \"dignity of choice\", says the charity's boss.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b83acd6412b311db77a4630014294e92e4a9d72",
      "title": "Jacqueline Wilson on the 'easiest and hardest book I've ever written'",
      "url": "https://www.bbc.com/news/articles/c7vl097jd8eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T23:00:15.000Z",
      "summary_90w": "",
      "raw": "Picture Imperfect follows two sisters who struggle to cope with their mentally ill mother.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7420ae4ad1b58d87612b479e5d92cce498879ea0",
      "title": "Samsung is Unpacking again in early September",
      "url": "https://www.theverge.com/news/767164/samsung-is-unpacking-again-in-early-september",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T23:00:00.000Z",
      "summary_90w": "",
      "raw": "Maybe those little AI sparkles are bursting out of a trifold phone? Maybe?\t\n\nApple isn’t the only tech company to send out launch event invitations this week. If you’re keeping score at home, September is actually next week somehow, and Samsung is sneaking a virtual Unpacked in on September 4th before Apple hosts its annual iPhone event the following week. But it’s not just a convenient date to try and steal a little bit of Apple’s thunder — it’s the day before IFA kicks off in Berlin. Related: the event starts at 5:30AM ET / 11:30AM CET.\nThe event invite doesn’t give much away about what Samsung intends to announce. But if you’re an optimist like me who’s still hoping for a trifold announcement this year, doesn’t it look like that cube-type-shape is unfolding in more than one way? Wouldn’t IFA be a cool place to launch a trifold? I’m gonna hold out hope, but to be honest, I probably won’t watch the event live since it’s at 2:30AM PT. But if you’re planning to watch live at a more civilized hour, you’ll find the stream at Samsung.com and Samsung’s YouTube channel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "05e5d5f69ec530c8528f684f1e84e7972aecda5a",
      "title": "Tony Blair attends White House meeting with Trump on postwar Gaza",
      "url": "https://www.theguardian.com/politics/2025/aug/27/tony-blair-attends-white-house-meeting-with-trump-on-postwar-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T22:28:59.000Z",
      "summary_90w": "",
      "raw": "Former prime minister in Washington DC on Wednesday for talks that reportedly also included Jared Kushner\nThe former British prime minister Tony Blair has attended a White House meeting with Donald Trump to discuss plans for postwar Gaza, the Guardian understands.\nAfter stepping down as prime minister in 2007, Blair took on the role of Middle East envoy until 2015 and spent time in Jerusalem trying to formulate a plan for a two-state solution.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad34f545f11fbddcd0f55838559ac93da3c88e2e",
      "title": "What happens when the federal government owns part of a company?",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518179/what-happens-when-the-federal-government-owns-part-of-a-company",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T21:22:34.000Z",
      "summary_90w": "",
      "raw": "President Trump says taking a 10% stake in Intel will be good for the company and the country. NPR's Scott Detrow talks with Michael Strain of the American Enterprise Insitiute, who disagrees.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed0cdbbc15e60419cc7f6629991cac83dff1c9fe",
      "title": "Nvidia reports record sales as the AI boom continues",
      "url": "https://techcrunch.com/2025/08/27/nvidia-reports-record-sales-as-the-ai-boom-continues/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T21:18:39.000Z",
      "summary_90w": "",
      "raw": "Nvidia's revenue hit $46.7 billion in the second quarter, a 56% increase compared to the same period last year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "609a4376d2d84758580d6cedec1509b3b5c14345",
      "title": "4Chan and Kiwi Farms file joint lawsuit against the UK",
      "url": "https://www.theverge.com/social/767063/4chan-kiwi-farms-lawsuit-uk-ofcom",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T21:11:53.000Z",
      "summary_90w": "",
      "raw": "On Wednesday, 4Chan and Kiwi Farms, two of the most controversial social media sites on the internet, filed a federal lawsuit against the British government, arguing that the requirements of the UK's Online Safety Act infringe on their Constitutional rights as American corporations.\nIn a filing submitted to the U.S. District Court in the District of Columbia, Preston Byrne and Ron Coleman, the team representing the two sites, said that their clients are being penalized by Ofcom, the agency that regulates online content in the United Kingdom, for \"engaging in conduct which is perfectly lawful in the territories where their websites are based …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6218889d82ed00b5018eb60b73802320a029a452",
      "title": "Google launches new device protection program called Pixel Care+",
      "url": "https://techcrunch.com/2025/08/27/google-launches-new-device-protection-program-called-pixel-care/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T20:59:52.000Z",
      "summary_90w": "",
      "raw": "Google says Pixel Care+ provides a \"higher level of coverage, service and peace of mind for Google hardware owners.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "faa75837dbe3962fc163b0dff74040e96ea22f32",
      "title": "'Exhausted, hungry, and scared': What it's like to be a journalist in Gaza",
      "url": "https://www.bbc.com/news/articles/crm49zxyn0go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T20:46:24.000Z",
      "summary_90w": "",
      "raw": "Palestinian journalists give the BBC first-hand accounts of the hardship and dangers they face while reporting on the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab94ee6832c284718ee8878cedd04570a35543a3",
      "title": "911 centers are so understaffed, they’re turning to AI to answer calls",
      "url": "https://techcrunch.com/2025/08/27/911-centers-are-so-understaffed-theyre-turning-to-ai-to-answer-calls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T20:42:12.000Z",
      "summary_90w": "",
      "raw": "The company offers an AI voice assistant that helps 911 centers handle non-emergency calls.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "13667ec6fb5e02532b4a91ad9b963622f965cc7e",
      "title": "European leaders boost Moldova in face of 'relentless' Russia",
      "url": "https://www.bbc.com/news/articles/cx2xzng4rwro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T20:15:38.000Z",
      "summary_90w": "",
      "raw": "France, Germany and Poland leaders travel to state to back EU accession plan weeks before key election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54f190d6d33e1780c0481e676eb45636fdcb38f9",
      "title": "WhatsApp’s new AI feature lets you rephrase and adjust the tone of your messages",
      "url": "https://techcrunch.com/2025/08/27/whatsapps-new-ai-feature-lets-you-rephrase-and-adjust-the-tone-of-your-messages/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T20:04:35.000Z",
      "summary_90w": "",
      "raw": "With Writing Help, users can get AI-generated suggestions that rewrite their messages in professional, funny, supportive, or rephrased way.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0729f195087d8f084ce73cc311a42b56b72b288e",
      "title": "Denmark apologises to Greenland's forced contraception victims",
      "url": "https://www.bbc.com/news/articles/c5yelp5466no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T19:44:37.000Z",
      "summary_90w": "",
      "raw": "Mette Frederiksen says sorry to to women who were fitted with devices, sometimes without their knowledge.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "305a0ba616d9fdce8369723e60a38bfbb955f7d3",
      "title": "With Starship Flight 10, SpaceX prioritized resilience over perfection",
      "url": "https://techcrunch.com/2025/08/27/with-starship-flight-10-spacex-prioritized-resilience-over-perfection/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:39:43.000Z",
      "summary_90w": "",
      "raw": "SpaceX proves it can fly through failures on Starship’s tenth test flight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0af2e5fe641ff13cfbb7847dfd4ed6d0ce2ac28",
      "title": "FBI says China’s Salt Typhoon hacked at least 200 US companies",
      "url": "https://techcrunch.com/2025/08/27/fbi-says-chinas-salt-typhoon-hacked-at-least-200-us-companies/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:39:40.000Z",
      "summary_90w": "",
      "raw": "The FBI's cyber chief says the long-running China-backed hacking campaign is \"ongoing\" and affecting companies all over the world.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0434b29544c727ecb3f2b81d203eb2ec0027dd5b",
      "title": "Google and Grok are catching up to ChatGPT, says a16z’s latest AI report",
      "url": "https://techcrunch.com/2025/08/27/google-and-grok-are-catching-up-to-chatgpt-says-a16zs-latest-ai-report/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:27:01.000Z",
      "summary_90w": "",
      "raw": "The report, in its fifth iteration, showcases two and a half years of data about consumers' evolving use of AI products.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2baa1fc1477c245d7d700759e976f1876229fc74",
      "title": "OpenAI co-founder calls for AI labs to safety-test rival models",
      "url": "https://techcrunch.com/2025/08/27/openai-co-founder-calls-for-ai-labs-to-safety-test-rival-models/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:14:01.000Z",
      "summary_90w": "",
      "raw": "In an effort to set a new industry standard, OpenAI and Anthropic opened up their AI models for cross-lab safety testing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "178b751058f6cb38e926513b4bcea9279445ace3",
      "title": "4chan launches legal action against Ofcom in US",
      "url": "https://www.bbc.com/news/articles/clyjq40vjl7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T18:30:12.000Z",
      "summary_90w": "",
      "raw": "It wants the court to prohibit Ofcom from enforcing the Online Safety Act against it in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6cd74c0c8884fe6cc437471770f4958c3d811f7c",
      "title": "Judge denies Meta’s request to dismiss sexual harassment lawsuit filed by early employee",
      "url": "https://techcrunch.com/2025/08/27/judge-denies-metas-request-to-dismiss-sexual-harassment-lawsuit-filed-by-early-employee/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T18:22:35.000Z",
      "summary_90w": "",
      "raw": "Stonelake, who worked at Meta from 2009 until being laid off in early 2024, filed the suit against Meta in Washington state earlier this year, alleging sexual harassment, sex discrimination, and retaliation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b97ada77dd9d6a6e507a50023d5be46f4797a46",
      "title": "Brands are loving Taylor Swift's engagement. Do they need to calm down?",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518860/taylor-swift-travis-kelce-engagement-brands-social-media",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T18:16:08.000Z",
      "summary_90w": "",
      "raw": "Companies from Pillsbury to Invisalign to Olipop are cheering — and trying to cash in on — the couple's engagement. Experts spoke to NPR about how brands can strike a better balance.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "038e8e3ead23c90313b7d59f2786d76844bd04b4",
      "title": "Chipolo, an AirTag rival, debuts rechargeable trackers with a six-month battery life",
      "url": "https://techcrunch.com/2025/08/27/chipolo-an-airtag-rival-debuts-rechargeable-trackers-with-a-six-month-battery-life/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T18:03:50.000Z",
      "summary_90w": "",
      "raw": "Chipolo debuts a lineup of rechargeable trackers to compete with AirTag and others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e08677da730b3f0e1cf45e68ea134bda59993fe",
      "title": "What is on the table at Trump’s Gaza meeting?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lzbkn7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T17:44:00.000Z",
      "summary_90w": "",
      "raw": "And Labour is back to talking about Brexit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1437b358531f4e978c920b92efe7d7f2d9020501",
      "title": "The Boring Company is finally testing Tesla’s ‘Full Self-Driving’ in its Las Vegas tunnels",
      "url": "https://techcrunch.com/2025/08/27/the-boring-company-is-finally-testing-teslas-full-self-driving-in-its-las-vegas-tunnels/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T17:40:38.000Z",
      "summary_90w": "",
      "raw": "It may seem like a great place to test Tesla's driver assistance tech, but the underground convention center shuttle program will stay human-driven for a while.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "baa80ee24efc3c1d988c6182a9a28f1d3f21ed72",
      "title": "Pope demands ‘collective punishment’ end in Gaza as 10 more die of hunger",
      "url": "https://www.theguardian.com/world/2025/aug/27/ten-palestinians-have-died-from-starvation-in-last-24-hours-says-gaza-health-ministry",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T17:27:37.000Z",
      "summary_90w": "",
      "raw": "Latest deaths announced by Gaza health ministry bring starvation toll to 313, including 119 children\n\nChildren make up a third of outpatients treated for wounds at MSF Gaza hospitals, data shows\n\nTen Palestinians including two children have died from starvation in the last 24 hours, health authorities in Gaza said on Wednesday, as Pope Leo XIV demanded that Israel stop its “collective punishment” of the population in the besieged territory.\nAt least 313 people have died from hunger, including 119 children, since the war in Gaza began and Israel intensified its siege on the Palestinian territory. Last week a UN-backed monitoring body confirmed that Gaza was in the throes of famine and warned that without more aid, increasing numbers of people would lose access to food.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c0a8b00f4ba7ffa2f886e33c8c5dc21a1a1b9b7",
      "title": "Here are the 33 US AI startups that have raised $100M or more in 2025",
      "url": "https://techcrunch.com/2025/08/27/here-are-the-33-us-ai-startups-that-have-raised-100m-or-more-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T17:01:57.000Z",
      "summary_90w": "",
      "raw": "Last year was monumental for the AI industry in the U.S. and beyond. How will 2025 compare?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0c91913dd08d6f6a660d082fdfb68710e9d69c3",
      "title": "Painting looted by Nazis has vanished again, say Argentine police",
      "url": "https://www.bbc.com/news/articles/cn84mld1gr9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:50:16.000Z",
      "summary_90w": "",
      "raw": "Prosecutor says painting no longer at Buenos Aires home featured in estate agent's advert.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20c6c67a65509c093f01428062e466bdf3a344cf",
      "title": "German cabinet backs voluntary military service, opening door to conscription",
      "url": "https://www.bbc.com/news/articles/c15l83e4dwdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:44:44.000Z",
      "summary_90w": "",
      "raw": "The defence minister wants to increase soldiers in service from 182,000 to 260,000 by the early 2030s.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "edff1409bba9a356005b899b7d0bdbcae9d44f69",
      "title": "Return of UN nuclear inspectors to Iran met with protests by MPs",
      "url": "https://www.theguardian.com/world/2025/aug/27/return-of-un-nuclear-inspectors-to-iran-met-with-protests-by-mps",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T16:21:33.000Z",
      "summary_90w": "",
      "raw": "Some Iranian officials say readmission breaches law passed after Israel and the US attacked the country in June\nThe partial return of UN inspectors to Iran for the first time since Israel and the US attacked Iran’s nuclear sites has been met with protests by officials in Tehran, who claim the strict preconditions they set have been breached. Some even described the return as criminal.\nAbbas Araghchi, Iran’s foreign minister, tried to quell the backlash by saying the inspectors from the International Atomic Energy Agency (IAEA) would not be visiting any of the bombed sites and that discussions about these were still to be had.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ab2c12c4bb285baa043491530c825a4301dca64",
      "title": "US disaster agency suspends workers who criticised Trump cuts, reports say",
      "url": "https://www.bbc.com/news/articles/c8denvzl0y8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:15:34.000Z",
      "summary_90w": "",
      "raw": "The Fema staff are said to have been among those who recently lent their names to an open letter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4cca2efc913eb430b53d84d66de741fae81224c",
      "title": "Middle East crisis: Israeli military carries out raid in West Bank city of Nablus – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T16:07:24.000Z",
      "summary_90w": "",
      "raw": "Soldiers and armoured vehicles enter city in northern occupied West Bank, confirms Israeli military, as residents say soldiers are searching houses\nAl Jazeera reports that the prime minister of Belgium has begun a meeting with his deputies on the topic of recognising the state of Palestine.\nBart De Wever said in a statement yesterday that it does not make sense to recognise the Palestinian state unless certain conditions are satisfied.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5524b1cc69061bfef79adf47043e7f22e3570d0b",
      "title": "European banks hit by rogue PayPal payments worth 'billions'",
      "url": "https://www.bbc.com/news/articles/cj6y42jggdyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:38:52.000Z",
      "summary_90w": "",
      "raw": "Local media said German lenders had reported millions of suspicious direct debits from the payment firm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a198bd63cf839bf7d3c59a278a04e9389ea0a49d",
      "title": "South African influencer apologises over viral Russian job videos",
      "url": "https://www.bbc.com/news/articles/c4gljnn0wwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:37:07.000Z",
      "summary_90w": "",
      "raw": "There has been a backlash over the recruitment scheme and a government warning to young people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "866f7205a2e615df1712645417bb958fdc4e82f4",
      "title": "HSBC resolves app and online banking  outage",
      "url": "https://www.bbc.com/news/articles/cqjykl7ek9qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T15:29:59.000Z",
      "summary_90w": "",
      "raw": "Thousands of people reported problems during what was the latest in a long line of banking IT failures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "627c865a81844d1683e1d38d44d9568721a925ad",
      "title": "'Punk rock' dinosaur with metre-long spikes discovered",
      "url": "https://www.bbc.com/news/articles/c5y2emnnn4po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:08:21.000Z",
      "summary_90w": "",
      "raw": "The animal has come as a surprise to experts, who now have to rethink how these armoured dinosaurs evolved",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3f8468b70e316f61439568bc309ddc2bc2f7c71",
      "title": "Old master painting looted by Nazis disappears from home in Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/27/old-master-painting-looted-by-nazis-disappears-from-home-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:50:32.000Z",
      "summary_90w": "",
      "raw": "Search for artwork seen in estate agent’s photo continues after police raid on house finds tapestry hanging in its place\nArgentinian police have said they will continue hunting for an old master painting looted by the Nazis and spotted by chance in an estate agent’s listing after a search of the property in the seaside town of Mar del Plata failed to uncover the work.\n“The painting is not in the house … but we’re going to keep searching for it,” the federal prosecutor Carlos Martínez told local media. He said items that could be useful for the investigation, including two firearms, engravings and prints, had been seized.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d2361d288349aa8b1cf352f28eb9a0df6abd49c",
      "title": "Trump's 50% tariff on India kicks in as Modi urges self-reliance",
      "url": "https://www.bbc.com/news/articles/c5ykznn158qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T14:19:29.000Z",
      "summary_90w": "",
      "raw": "The US president's steep 50% tariffs on India have kicked in, sending Narendra Modi's government into firefighting mode.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "210d1b0007c1f7419d6da854bfcced8e05426751",
      "title": "A third of outpatients treated for wounds at MSF’s Gaza hospitals in 2024 were children, figures show",
      "url": "https://www.theguardian.com/world/2025/aug/27/children-make-up-third-of-outpatients-in-msf-hospitals-in-gaza-statistics-show",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:03:11.000Z",
      "summary_90w": "",
      "raw": "Explosive weapons designed to be used in battle are being used in urban areas, says Médecins Sans Frontières\n\nChildren under 15 years old made up almost a third of outpatients treated for wounds in field hospitals run by Médecins Sans Frontières (MSF) in Gaza last year, statistics published in The Lancet reveal.\nThe figures were released by MSF in correspondence with the respected medical journal and come from six health facilities in Gaza supported by the international medical NGO. The facilities are predominantly in the south and centre of the devastated territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c4b00eff8f9862a7ed3a14eb7b2de1068f4abc5",
      "title": "Take The Planet Money Summer School Quiz In Political Economy",
      "url": "https://www.npr.org/2025/08/27/g-s1-85342/planet-money-summer-school-quiz-political-economy",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T11:56:51.000Z",
      "summary_90w": "",
      "raw": "Think you have what it takes to successfully manipulate the market and build a domestic industry from the ground up? If so, these eight questions stand between you and your Summer School diploma in Political Economy.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2f818ec02bb5b95b874bc3f78a805bdcb0287ff8",
      "title": "Rightwing ‘parents’ rights’ groups gain ground in Canada as Alberta book bans target LGBTQ+ titles",
      "url": "https://www.theguardian.com/world/2025/aug/27/alberta-book-ban-canada-parents-rights-groups",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T11:30:01.000Z",
      "summary_90w": "",
      "raw": "Two such groups claim they persuaded Alberta to institute sweeping public school book ban\nSocially conservative “parents’ rights” groups that have emerged as powerfully political lobbying groups in the US are quickly gaining ground in Canada, academics and free speech advocates say, after two such groups claimed they had persuaded Alberta to institute a sweeping public school book ban.\nAlberta recently directed schools to purge library books from shelves that fit its definition of “explicit sexual content” by 1 October. If the policy is applied precisely as outlined, a host of books face being purged, including George Orwell’s 1984 due to passages in the text that discuss sexual intercourse and rape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d0e67493e7b4016073768bd9fbb808c298f219a6",
      "title": "Parents of teenager who took his own life sue OpenAI",
      "url": "https://www.bbc.com/news/articles/cgerwp7rdlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T09:18:05.000Z",
      "summary_90w": "",
      "raw": "The Raine family alleges ChatGPT \"actively helped\" their 16-year-old son take his own life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9217280dfd278e95dcddb400d1699f269a8cb078",
      "title": "Deforestation has killed half a million people in past 20 years, study finds",
      "url": "https://www.theguardian.com/environment/2025/aug/27/deforestation-has-killed-half-a-million-people-in-past-20-years-study-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T09:00:57.000Z",
      "summary_90w": "",
      "raw": "Localised rises in temperature caused by land clearance cause 28,330 heat-related deaths a year, researchers find\nDeforestation has killed more than half a million people in the tropics over the past two decades as a result of heat-related illness, a study has found.\nLand clearance is raising the temperature in the rainforests of the Amazon, Congo and south-east Asia because it reduces shade, diminishes rainfall and increases the risk of fire, the authors of the paper found.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2fccbf7a9f48faa73b6d07fceae586e2219f7b0",
      "title": "U.S. tariffs take effect on India, threatening $48.2B in exports",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518809/india-us-tariffs-trump-modi-exports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:48:54.000Z",
      "summary_90w": "",
      "raw": "Earlier this month President Trump signed an executive order imposing an additional 25% tariff on India due its purchases of Russian oil, bringing the combined tariffs to 50%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "74b51ec27a66773933f7c5b98018098bb4a2b5bc",
      "title": "Police killed in Australia shooting named as manhunt continues",
      "url": "https://www.bbc.com/news/articles/c4g6wlxd5kko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T08:08:55.000Z",
      "summary_90w": "",
      "raw": "Dezi Freeman allegedly opened fire on officers who were at his rural property to execute a warrant.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ce31cc150cb07b342e940266198c9b157cf0b5c",
      "title": "Despite sanctions, many countries are still importing Russian products",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5496336/despite-sanctions-many-countries-are-still-importing-russian-products",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:06:54.000Z",
      "summary_90w": "",
      "raw": "Economic sanctions and trade restrictions against Russia following its full-scale invasion of Ukraine were set to force Moscow's hand. But the U.S. and Europe continue to rely on Russian imports.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "0008ce6ff997920e58caaa0edbd3ca3eb34659b1",
      "title": "Ukraine admits Russia has entered key region of Dnipropetrovsk",
      "url": "https://www.bbc.com/news/articles/c17n1p24yv9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T06:19:21.000Z",
      "summary_90w": "",
      "raw": "Military says Russian advance \"is the first attack of such a large scale\" in industrial province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1d9fa353579965b6bbbd37ec06d6b3f21de7f88",
      "title": "Protesters occupy Microsoft office as company reviews its work with Israel's military",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518786/microsoft-protesters-office-israel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T05:05:42.000Z",
      "summary_90w": "",
      "raw": "Current and former Microsoft employees were among those arrested. Microsoft has said it is reviewing a report that Israel has used its platform to facilitate attacks on Palestinian targets.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7517865a69cee8773511ce04954a1bfa18ce98c8",
      "title": "Attempt to partner African countries with Japanese cities triggers xenophobic backlash",
      "url": "https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T05:01:42.000Z",
      "summary_90w": "",
      "raw": "Cities in Japan have received thousands of complaints amid confusion over scheme that was intended to foster closer ties\nAn attempt to promote friendship between Japan and countries in Africa has transformed into a xenophobic row about migration after inaccurate media reports suggested the scheme would lead to a “flood of immigrants”.\nThe controversy erupted after the Japan International Cooperation Agency, or JICA, said this month it had designated four Japanese cities as “Africa hometowns” for partner countries in Africa: Mozambique, Nigeria, Ghana and Tanzania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3cef47d66a6999bc2bdc180ebcc34570c37cce0",
      "title": "Can science reveal the secrets of UFOs?",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002hqy7/what-are-ufos?at_mid=N5aggVaXsE&at_campaign=What_Are_UFOs&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002hqy7&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=What_Are_UFOs&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Can science reveal the secrets of mysterious objects seen in our skies?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "298de5ae886f1f07635b0773f138faceccf72b56",
      "title": "Brazil judge orders round-the-clock surveillance of ‘flight risk’ Bolsonaro",
      "url": "https://www.theguardian.com/world/2025/aug/26/brazil-judge-orders-round-the-clock-surveillance-of-flight-risk-bolsonaro",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T22:21:06.000Z",
      "summary_90w": "",
      "raw": "Pre-trial monitoring ordered after police reported former president had drafted request for asylum in Argentina\nJair Bolsonaro must be under constant police surveillance, a supreme court justice has ruled, to prevent Brazil’s former president from fleeing days before the start of the trial that could see him jailed for more than 40 years.\nThe far-right leader has been wearing an electronic ankle tag since mid-July and has been under house arrest since early August. But last Monday, the prosecutor general asked the supreme court to tighten surveillance of the 70-year-old, after federal police reported he had even drafted a request for political asylum in Argentina.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "29c48700734afcd2750c5376198dfe5b0bd968f1",
      "title": "Botswana’s president declares health emergency over supply shortages",
      "url": "https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:57:33.000Z",
      "summary_90w": "",
      "raw": "Duma Boko announces urgent funding package for medicines to be distributed with military oversight\nBotswana’s president has declared a public health emergency due to shortages of essential medicines and equipment, as a downturn in the global diamond market and US aid cuts take a toll on the country’s finances.\nThe announcement came after the Ministry of Health suspended non-urgent surgeries on 4 August, stating that the country was short of medicines to treat hypertension, diabetes, cancer, asthma and eye conditions, as well as supplies including bandages and sutures and those for sexual and reproductive health.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9ba52451fd3389a1da2e1b5d8b98cbc4e94025bf",
      "title": "How plants and fungi trade resources without a brain",
      "url": "https://www.npr.org/sections/planet-money/2025/08/26/g-s1-85185/plants-fungi-resources-trade-cooperation",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Fungi and plants have something to teach humans about global trade and cooperation",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6e77b9142c6dd815ffa9d84da62d2a5df508e540",
      "title": "Judge orders Kari Lake to answer questions about Voice of America under oath",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5506283/judge-order-kari-lake-sworn-deposition-voice-of-america-oath-usagm",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T09:00:00.000Z",
      "summary_90w": "",
      "raw": "U.S. Judge Royce Lamberth ordered Trump administration official Kari Lake to be deposed about her plans for Voice of America, saying she was \"verging on contempt.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "946ee68edff0cb4e775b227a9906502f009c7174",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "url": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:28:08.000Z",
      "summary_90w": "",
      "raw": "Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents\nCambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}