{
  "version": "1757686478076",
  "generatedAt": "2025-09-12T14:14:38.076Z",
  "items": [
    {
      "id": "17039a81f67645f08dea25ed2200c01a680493e6",
      "title": "The next Pokémon looks a bit like Minecraft",
      "url": "https://www.theverge.com/news/777159/pokemon-pokopia-nintendo-switch-2",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T14:08:06.000Z",
      "summary_90w": "",
      "raw": "A new Pokémon spinoff is on the way, and it looks very different than any other entry in the long-running franchise. In fact, it looks a little bit like Minecraft — and it’s called Pokémon Pokopia.\nThe game has players controlling a Ditto that has taken on the form of a human, which means that it’s a little cute and also a little creepy. The goal of the game is to shape an empty landscape into a suitable home for some pokémon. That means taming the wilderness, growing crops, and also using a bunch of classic pokémon moves to make it all happen. The visuals look like a mix of the structured form of a Minecraft game with the cutesy characters and tone of Pokémon. Given those are two of the biggest franchises in gaming, it sounds — on paper at least — like a winning mix.\nPokopia is launching on the Nintendo Switch some time in 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35f8d28545469be8da5927248776dae865cec0d9",
      "title": "Bring death to Chronos in Hades 2 this September",
      "url": "https://www.theverge.com/news/777117/hades-2-release-date-september-nintendo-switch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T14:05:57.000Z",
      "summary_90w": "",
      "raw": "Everybody say thank you Nintendo! During its Direct livestream Hades II, the follow-up to Supergiant Game’s phenomenal roguelike Hades, finally has a release date. Prepare to bring death to Chronos on Switch and PC September 25th.\nDuring the Direct, Hades II revealed a splashy new animated trailer, reminiscent of the first Hades trailer. It features Melinoë, Hades II’s protagonist and sister to Zagreus, the prince of hell who spent the first game trying to escape it. This time, Melinoë isn’t trying to leave hell, but break in to deal death to her grandfather, the god of time Chronos. As in Hades, Melinoë is aided in her quest by the gods, heroes of mythology, and the death-dealing power of her own two hands. \nHades II has been in early access on PC for a little over a year now. The game has undergone several chunky updates, slowly adding new content and weapons in the lead-up to its full release. According to the Direct, Hades II will launch on Switch, Switch 2, and PC on September 25th with a physical release launching in November. No word yet on when it’ll come to Xbox and PlayStation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d4948b45e6f5e912d3ea0188cca817fd867ce0ca",
      "title": "Our hottest takes on AI&#8217;s wild summer",
      "url": "https://www.theverge.com/the-vergecast/777145/ai-friends-openai-claude-takes-vergecast",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T14:02:02.000Z",
      "summary_90w": "",
      "raw": "There's a lot happening in the world of artificial intelligence. There is always a lot happening in the world of artificial intelligence. The money is enormous; the stakes are high; the products are, well, all over the place. Sit on your couch and read about it all long enough, and you're bound to feel some strong feelings.\nOn this episode of The Vergecast, we get into some of those feelings. But first, David and Jake catch up on the week's remaining gadget news. In addition to all the Apple gadgets we discussed on Wednesday's episode, there's also the fact that the new AirPods Pro 3 don't ship with a charging cable, a smart rebuttal to our …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "246e6445ef0348ae3dd5927b7082d2ee749813ef",
      "title": "It’s time for Meta to add a display to its smart glasses",
      "url": "https://www.theverge.com/optimizer-newsletter/776772/optimizer-newsletter-meta-connect-ray-ban-oakley-smart-glasses",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T14:00:00.000Z",
      "summary_90w": "",
      "raw": "I don’t look like Vegeta in these, but while Meta nailed the execution, it now has to move things forward. | Photo: Amelia Holowaty Krales / The Verge\t\n\nThis is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here.\nAbout a month ago, I was walking in Williamsburg and a stylish Brooklyn hipster stopped me to ask about the Oakley Meta HSTN smart glasses I was testing. A few weeks later, I went to dinner with a friend that I hadn't seen in years. It wasn't until we were walking to the train that I noticed they were wearing a pair of Ray-Ban Meta g …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30a5b0be99cce1c8025c8dc7b7c1ea5e608daa9b",
      "title": "Poland says Russia’s drone incursion ‘wasn’t a mistake’ after Trump’s speculation – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/12/poland-russia-drones-ukraine-war-latest-news-europe-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T13:57:35.000Z",
      "summary_90w": "",
      "raw": "Donald Trump appeared to be dismissive Thursday night as he said it ‘could have been an mistake’\nTusk also says the announcement with BAE Systems is “only a part of our cooperation with the UK.”\nHe says he “received another message from prime minister Starmer about greater UK involvement in military assistance, here in Poland, on an urgent basis,” without offering further details.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07336a968cd19956ec9d0f7506aa67e0d3a4d84b",
      "title": "Metroid Prime 4 goes beyond, launching this December",
      "url": "https://www.theverge.com/news/777056/metroid-prime-4-release-date-nintend-direct-september-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T13:56:20.000Z",
      "summary_90w": "",
      "raw": "You won’t have to wait too long now for Metroid Prime 4: Beyond.\nNintendo surprised us so soon after the Kirby Air Riders direct with another direct showcase today. Clocking in at a luxurious 60 minutes, the direct covered a bunch of games (and movies) coming in the latter quarter of the year and beyond. But one of the bigger pieces of news was Metroid Prime 4: Beyond which Nintendo has announced will launch on December 4th. \nAlong with the release date, Nintendo revealed another look at the game. In the teaser, Samus has gone beyond the cramped quarters of derelict space stations and alien-haunted caves to cruise wide-open sand dunes on a brand new speeder bike that we’ve never seen before. It was so cool and interesting-looking that it almost felt like a completely different game. \nMetroid Prime 4 has the ignominious distinction of being one of the rare first-party Nintendo games to get stuck in development hell. This game was announced way, way back in 2017. Metroid Prime 4 is so old that when it was announced: Reggie Fils-Amié was still the Nintendo of America boss, the original Switch was just three months old, and… we still had an E3 which is where the game was first announced. \nThe reason for this extensive development time was that apparently Nintendo wasn’t satisfied with the way the game was progressing and rebooted its development back in 2019. In the years since, Nintendo remained quiet on Samus’ next first person 3D adventure while releasing two other Metroid games and remastering Metroid Prime in the interim.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e669825a151b0326b8609828970ddcbf50cade17",
      "title": "US joins UN Security Council condemnation of Israeli strikes on Qatar",
      "url": "https://www.bbc.com/news/articles/c740kk7vxkdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T13:52:37.000Z",
      "summary_90w": "",
      "raw": "The US traditionally blocks actions against its close ally Israel at the United Nations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56a6ed5b6af0fde8c4eaa55c8b26189918b22fec",
      "title": "Jay Wynne, former BBC weather presenter, dies aged 56",
      "url": "https://www.bbc.com/news/articles/ceq2jrwzv9wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T13:49:26.000Z",
      "summary_90w": "",
      "raw": "Jay Wynne joined BBC Weather in October 2000 and was a regular forecaster on BBC News at Ten.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57c58d02dd1a578ad09f498d765cab321f83c29d",
      "title": "Virtual Boy games are coming to Nintendo Switch Online",
      "url": "https://www.theverge.com/nintendo/777032/nintendo-switch-virtual-boy-games",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T13:49:24.000Z",
      "summary_90w": "",
      "raw": "Nintendo’s oft-maligned VR headset the Virtual Boy is getting a new life on modern hardware. Nintendo announced that the platform will be coming to its collection of retro games available to Switch Online subscribers, and will be available on both the Switch and Switch 2.\nThe twist is that in order to play these games you’ll need a dedicated headset accessory, which looks just like the original hardware, but lets you slot in the Switch (or Switch 2) tablet for viewing the games. A cardboard model will also be available, which sounds similar to the Labo VR headset.\nA total of 14 games will be available through the service, including the likes of Mario Tennis and Tetris. Nintendo says they’ll be available starting February 17th, though the 14 games will be launching over time. It’s not clear yet when the headset accessories will be launching, nor how much they’ll cost.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b30246531c8a27c9197f11ad29fdc7dd38eae29",
      "title": "Labour MPs' growing fury over Mandelson appointment",
      "url": "https://www.bbc.com/news/articles/cx238pwwqg6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T13:48:18.000Z",
      "summary_90w": "",
      "raw": "No 10 say Mandelson was sacked after new information about his links to Jeffrey Epstein came to light.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "85a6f8438ab09b81580a53d4cabdd26c06f07618",
      "title": "Ultraloq adds Android tap-to-unlock to its Apple Home Key smart lock",
      "url": "https://www.theverge.com/news/777055/ultraloq-adds-android-tap-to-unlock-to-its-apple-home-key-smart-lock",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T13:43:36.000Z",
      "summary_90w": "",
      "raw": "The Bolt NFC, a keypad smart lock that works with Apple Home Key, now supports Android phones for tap-to-unlock.\t\n\nThe Ultraloq Bolt NFC smart lock is receiving a free upgrade that enables near-field communication (NFC) tap-to-unlock with compatible Android phones. The model currently supports Apple’s Home Key, which lets you tap-to-unlock with an iPhone. The update makes it one of the first locks to offer the functionality across both iOS and Android, without requiring the phone to be unlocked or specific apps to be running.\nThe ability comes via a free software upgrade to the U Home app, available now in the Google Play Store. Xthings, Ultraloq’s parent company, says its NFC unlock experience is an app-managed credential system, relying on Android’s NFC default app handling. This allows tap-to-unlock to work with an “out of the pocket” experience; no app needs to be open, no screen activated, no unlocking required, “just a simple tap.” The company states that it will support an estimated 99 percent of NFC-enabled Android smartphones currently on the market.\nAccording to Xthings, its NFC unlocking on Android works by setting the U Home app as the phone’s NFC handler, allowing it to “run as a lightweight background service to listen for NFC intents.” When you tap the phone against the lock, it triggers the Android system to wake the correct NFC handler and pass it to U Home for authentication. \nNFC unlocking requires both the phone and lock to support NFC, allowing you to tap to unlock in the same way you tap to pay. It’s a common feature on some smart locks for iPhone users, but Android phones have not had as many options, often requiring the use of a tag or key fob. An upcoming smart lock standard called Aliro aims to make NFC unlocking universal, regardless of phone manufacturer, but it hasn’t launched yet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "808306bc1ff49fd00aceed916f8281a8c43295a0",
      "title": "Mario’s going to space in The Super Mario Galaxy Movie trailer",
      "url": "https://www.theverge.com/news/777071/super-mario-bros-movie-sequel-nintendo-direct-september-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T13:18:01.000Z",
      "summary_90w": "",
      "raw": "Nintendo wouldn’t be Nintendo if it didn’t offer surprises every now and again. During its direct showcase, the company revealed more information on the sequel to The Super Mario Bros Movie — The Super Mario Galaxy Movie including a brand new trailer.\nThe teaser trailer was just that, a taste of what’s to come. It features Mario resting under a tree in the Mushroom Kingdom while a butterfly zooms up to space as the theme to Super Mario Galaxy begins to play.\nWe had some inkling Nintendo would go in the galaxy direction for its sequel. The first movie, which grossed over a billion dollars, spawned memes, and earned a Golden Globe nomination, hinted at a wider world beyond the Mushroom Kingdom. There’s also the fact that eagle-eyed internet sleuths found domains registered to NBC Universal, Nintendo’s movie production partner, that contained the name of the film. (An earlier leak also suggested the movie was titled “Super Mario World”.) \nAccording to Nintendo executive Shigeru Miyamoto, The Super Mario Galaxy Movie will be the centerpiece of Mario’s 40th anniversary celebration. Due out in April, Chris Pratt, Charlie Day, Anya Taylor-Joy, and Jack Black will reprise their roles as Mario, Luigi, Princess Peach, and Bowser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb84290053d640301f48f14271fe40a6f3f69898",
      "title": "Apple delays release of iPhone Air in China due to pending approval of eSIM",
      "url": "https://techcrunch.com/2025/09/12/apple-delays-release-of-iphone-air-in-china-due-to-pending-approval-of-esim/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T13:15:23.000Z",
      "summary_90w": "",
      "raw": "The eSIM-only iPhone Air's release is being delayed in China, likely due to regulatory issues around the approval of the embedded SIM.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "877c3f5d12f6ef4b904e8be213ef4318992b6e6e",
      "title": "Microsoft slips unscathed through EU competition probe after promising to unbundle Teams",
      "url": "https://techcrunch.com/2025/09/12/microsoft-slips-unscathed-through-eu-competition-probe-after-promising-to-unbundle-teams/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T13:09:44.000Z",
      "summary_90w": "",
      "raw": "Microsoft will escape largely unscathed from a major antitrust investigation by the European Commission that could have resulted in billion-dollar fines for the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31f50cdda2fd1ca73ab661e059a20f47547fd677",
      "title": "Mastodon is bringing quote posts to the fediverse",
      "url": "https://www.theverge.com/news/777067/mastodon-quote-posts-fediverse-launch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T13:07:59.000Z",
      "summary_90w": "",
      "raw": "Mastodon is officially rolling out quote posts. Starting next week, you’ll see an option to quote another user by selecting the repost — or “boost” — button, allowing you to add your thoughts to someone else’s post.\nThe decentralized platform initially planned not to launch quote posts over concerns that they could be used for harassment or to take someone out of context. Mastodon reversed this decision in February, saying a lack of quote posts might discourage people from joining the fediverse.\nMastodon is bringing quote posts to mastodon.online and mastodon.social first, but will roll out the feature more broadly with the Mastodon 4.5 update. If you don’t want someone to repost your content with a quote, Mastodon will let you disable quoting for all posts, or just for individual ones. You can also limit who quotes you to anyone on the platform, followers only, or just yourself, as well as remove your content from someone else’s quote post.\nMastodon notes that if you quote a post from another fediverse platform, “it may take some time for the quote to appear.” It also worked on a technical specification for quote posting in the fediverse and hopes that other platforms will adopt it. You can find more information about quote posts, as well as how to adjust your quote post settings, on Mastodon’s website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d8854ca94ed66911d36e462609f4fecc5691366b",
      "title": "The Week: When Keir Starmer Sacked Peter Mandelson",
      "url": "https://www.bbc.co.uk/sounds/play/p0m2gjhl?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T13:06:00.000Z",
      "summary_90w": "",
      "raw": "Lord Mandelson sacked just a few days after Rayner resignation and cabinet reshuffle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fd9a5a2730cf0cdbe85f2b52db346d6cbae1e11",
      "title": "A new Astro Bot-themed PS5 controller is now available for preorder",
      "url": "https://www.theverge.com/tech/773522/astro-bot-joyful-dualsense-wireless-controller-preorder-price-release-date-ps5",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-12T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The squinting eyes give it a more joyful expression, hence the name. | Image: Sony\t\n\nIf you missed out on the limited edition Astro Bot DualSense wireless controller for PlayStation 5 last year, we have good news: Sony is launching a new \"Joyful\" version of the gamepad for $84.99 on October 30th, and preorders have just begun at the PlayStation store.\nAstro Bot \"Joyful\" DualSense wireless controller\n\nWhere to Buy:\n\n $84.99 at PlayStation\n\nLast year, Sony and Team Asobi - the developer behind Astro Bot - released a limited-edition DualSense controller to commemorate the game's launch. It featured several charming design elements that mimicked the look of Astro, including shiny blue accents on the handles and buttons and big goog …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7c5fdc3a846f6fded6470b9ac8cf5a7299967b2",
      "title": "We are entering a golden age of robotics startups — and not just because of AI",
      "url": "https://techcrunch.com/2025/09/12/we-are-entering-a-golden-age-of-robotics-startups-and-not-just-because-of-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The robotics startup market has matured over the last decade and the cost to produce robots has gone down significantly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41d65e7ba810de79dadc5468f134738b3bbfeb0e",
      "title": "A palm print and a figure in black  - what we know so far",
      "url": "https://www.bbc.com/news/articles/cy04p4x21e5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T12:55:09.000Z",
      "summary_90w": "",
      "raw": "President Trump says a suspect is in custody: \"I think we've got him.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d5d96f7f4f14c2871840f7dee4c1f55af4cb9d88",
      "title": "South Africa reopens inquest into death of Steve Biko",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5539024/south-africa-reopens-inquest-death-steve-biko",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T12:54:38.000Z",
      "summary_90w": "",
      "raw": "South Africa has reopened the investigation into the death of anti-apartheid leader Steve Biko — 48 years after he was killed in police custody.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cfc0ba597da7977efdbd7c4df94cf75ffef6b93",
      "title": "Memphis latest city Trump is targeting for federal government actions to combat crime",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5539135/memphis-crime-trump-dc-federal-action",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T12:51:25.000Z",
      "summary_90w": "",
      "raw": "In an interview Friday morning, President Trump announced Memphis is his next target for federal intervention to combat crime. The president said he has support from Tennessee's governor and Memphis' mayor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f01ce44966b510a46f09aa13b0aaca39081d696c",
      "title": "Farage insists he has no financial stake in Clacton home",
      "url": "https://www.bbc.com/news/articles/c5yg0l8vr9vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T12:44:17.000Z",
      "summary_90w": "",
      "raw": "The Reform leader is facing questions about how his partner could afford to buy the house in his constituency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0baa190781f653ca226793190ba44f6dedcbf264",
      "title": "From political outsider to a president like no other: Bolsonaro's rise and fall",
      "url": "https://www.bbc.com/news/articles/c5yqendv7k5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T12:44:13.000Z",
      "summary_90w": "",
      "raw": "The Brazilian ex-president has been sentenced to 27 years for plotting a coup, but an amnesty could be on the cards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3a0c266b476bbadce015ecebbf1504f1ece17f3e",
      "title": "Dutch broadcaster says it will join Eurovision boycott over Israel ",
      "url": "https://www.bbc.com/news/articles/c5yg0ly2nlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T12:37:05.000Z",
      "summary_90w": "",
      "raw": "The Netherlands follows Ireland in saying it can \"no longer justify Israel's inclusion\" in the event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a51651e4968af81b58ace0f0c1a9ba3a7313f7b",
      "title": "Rome woman banned from feeding birds amid neighbours’ pigeon ‘hell’",
      "url": "https://www.theguardian.com/world/2025/sep/12/rome-woman-banned-from-feeding-birds-amid-neighbours-pigeon-hell",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T12:36:44.000Z",
      "summary_90w": "",
      "raw": "Banning order comes after multiple complaints from residents of apartment block about feathers and droppings\nRome’s mayor has ordered a woman to stop feeding dozens of pigeons that have overrun an apartment block, after furious residents, claiming to be drowning in feathers and guano, demanded relief from what has been described as a Hitchcockian nightmare.\nFor several months, on the third floor of a building at 108 Via Spartaco, a woman nicknamed “The Pigeon Lady” by the press has been feeding the flock of birds that has been plaguing the block. After countless complaints from residents, exasperated by the thick layer of guano covering the building’s interior and the public areas below – not to mention the parked cars – local authorities issued an order banning her from feeding the pigeons.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f33404a96215b0e957b8637375d34a2a463eb794",
      "title": "Ukraine strikes key Russian oil terminal in massive drone attack",
      "url": "https://www.bbc.com/news/articles/cderllgw84ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T12:36:34.000Z",
      "summary_90w": "",
      "raw": "The overnight attack is the largest since May, but follows much larger bombardments from Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "72a8355947940444b1920079eb33fd8f7f3b024c",
      "title": "Operation World Cup: the murder plot at the heart of Brazil’s trial of the century",
      "url": "https://www.theguardian.com/world/2025/sep/12/operation-world-cup-the-plot-at-the-heart-of-brazils-jair-bolsonaro-trial-of-the-century",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T12:32:28.000Z",
      "summary_90w": "",
      "raw": "Intricate plan to murder top judge, president- and vice-president elect was central to Jair Bolsonaro coup hopes\nThe conspirators used codenames to conceal their identities as they prepared for their mission: to plunge Brazil into chaos by assassinating a celebrity supreme court judge called Alexandre de Moraes.\nOn an encrypted messaging group, one plotter used the alias Brazil, another Japan and a third Austria.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffe819497c09cd96dcd4c2e982be75b0d6790a12",
      "title": "Court orders 'tribe' to be evicted from Scottish woodland",
      "url": "https://www.bbc.com/news/articles/c62zxjy0j91o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T12:30:17.000Z",
      "summary_90w": "",
      "raw": "A sheriff orders the three members of a self-styled \"African tribe\" to be removed from privately-owned land in the Scottish Borders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55aa8565d76bb091e84b9011af1cb151e8e3c181",
      "title": "Europe’s cruel summer: Ursula von der Leyen faces an EU under pressure",
      "url": "https://www.theguardian.com/world/2025/sep/12/ursula-von-der-leyen-eu-under-pressure",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T12:17:50.000Z",
      "summary_90w": "",
      "raw": "European Commission president addresses a parliament reeling from Trump trade deal and escalations in Ukraine and Gaza\nWhen Ursula von der Leyen arrived in the vast semi-circle debating chamber in the European parliament in Strasbourg, she greeted MEP leaders of some of Europe’s political groups warmly. Wearing a trim khaki-green jacket, the European Commission president smiled, shook hands and exchanged air kisses with some of the politicians, who had front-row seats for her annual state of the union address.\nThe hour-long speech on Wednesday had a stark message: Europe must fight for its place in an “unforgiving” world, facing major powers that are either “ambivalent or openly hostile” towards it.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4cfedc88f762c6784539ff2cb809ae84e32b3738",
      "title": "Schools shut in two Dutch towns over youth violence and abuse videos",
      "url": "https://www.bbc.com/news/articles/cr5q28n7e06o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T12:11:41.000Z",
      "summary_90w": "",
      "raw": "All five secondary schools in Beverwijk and Heemskerk are closed in a bid to restore calm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "45bdcaa16c5cb35c836c9007830617ae72c95b49",
      "title": "South Korea outraged at 300 workers treated as ‘prisoners of war’ in US raid",
      "url": "https://www.theguardian.com/global-development/2025/sep/12/south-korean-outrage-at-us-detention-ordeal-as-300-workers-return-home",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T12:07:35.000Z",
      "summary_90w": "",
      "raw": "As Hyundai-LG workers fly home after visa ordeal, Koreans bristle at ‘humiliation’ and sense of betrayal by Seoul’s ally\nMore than 300 South Korean workers arrived at Incheon international airport on Friday afternoon, ending a week-long ordeal that began with the US Department of Homeland Security’s largest ever single-site raid by Immigration and Customs Enforcement (ICE) agents, and has left South Korea questioning whether it can trust its closest ally.\nThe 316 Koreans, along with 14 workers of other nationalities, landed shortly after 3pm local time on a chartered Korean Air flight after being detained since 4 September at a Hyundai-LG battery plant construction site in Georgia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e37626cece3324be6cf55dd2f470514d0c118fe",
      "title": "Prince Harry makes surprise Ukraine visit to support war wounded",
      "url": "https://www.bbc.com/news/articles/c3dr859vxxjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T11:50:40.000Z",
      "summary_90w": "",
      "raw": "The Duke of Sussex said he wanted to do \"everything possible\" to help the recovery of military personnel injured in the war with Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c17e9c315c509031f9757ffc140706a95d8212c",
      "title": "Man jailed for gangland shooting that left girl, 9, with bullet in brain",
      "url": "https://www.bbc.com/news/articles/cgknmmnje17o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T11:50:34.000Z",
      "summary_90w": "",
      "raw": "Javon Riley is jailed for 34 years over his role in the shooting of a girl at a restaurant in east London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a01394e06dd212109aa4d6543693fa7fc08c5f20",
      "title": "Hopes rise of pardon for Abd el-Fattah as Starmer speaks with Egypt president",
      "url": "https://www.theguardian.com/world/2025/sep/12/hopes-rise-of-pardon-for-abd-el-fattah-as-starmer-speaks-with-egypt-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T11:32:05.000Z",
      "summary_90w": "",
      "raw": "Decision expected soon after reports in Cairo about status of imprisoned dual-national human rights activist\nKeir Starmer has spoken to Abdel Fatah al-Sisi amid reports the Egyptian president has directed his officials to study an internal request to grant a pardon to release the British-Egyptian human rights activist and writer Alaa Abd el-Fattah.\nAbd el-Fattah’s British-based family are not commenting on developments save to say they are praying for his release.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49b9159650d23e35bac9200cf5b18e595b38d7f2",
      "title": "Digested week: Marsupial brings cheer in dark and dysfunctional days | Emma Brockes",
      "url": "https://www.theguardian.com/uk-news/2025/sep/12/digested-week-marsupial-brings-cheer-in-dark-and-dysfunctional-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T11:04:39.000Z",
      "summary_90w": "",
      "raw": "It was left to a – albeit extinct – tiny relative of the kangaroo to offer some relief from the blizzard of major events\nWhere to start in a week so fraught with major events you could hardly draw breath for the news flashes? It started with Trump’s alleged contribution to Jeffrey Epstein’s “birthday book,” shared by the Democrats on social media on Monday and leading to the discovery of a name not widely recognised in the US but of intense interest in the UK – Peter Mandelson. The British ambassador to the US had proffered an undiplomatically warm birthday message to the late child sex offender financier, starting a press scramble that ended, on Thursday, with Keir Starmer firing him.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f853002ed4acba2c2f5a585769d0249693d9c5a9",
      "title": "‘I’m here to help people, which gives me a superpower’: one man’s challenge to swim 10 Swiss lakes",
      "url": "https://www.theguardian.com/lifeandstyle/2025/sep/12/devon-man-challenge-swim-10-swiss-lakes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T10:59:04.000Z",
      "summary_90w": "",
      "raw": "Neil Gilson is undertaking a huge mental and physical task to raise awareness of a neuropsychiatric condition that affected his son Jack\nThe physical effort as he battles currents, coldness and wind is massive, but the mental challenge of ploughing on alone for hours on end is even more testing.\nNeil Gilson, a father of three from Devon, is about to set off on the next leg of his attempt to become the first person to swim the 10 largest lakes in Switzerland, a total of about 230 miles.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ec34282e66416d5812544cbb38034f4930d73c0",
      "title": "How a brutal gangland feud led to the shooting of a 9-year-old girl",
      "url": "https://www.bbc.com/news/articles/cm21rnyz85jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T10:58:41.000Z",
      "summary_90w": "",
      "raw": "The shooting in east London left the girl with a bullet lodged in her brain and injured three men.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33131017e12693a494a7877edc50abdd4a9e911a",
      "title": "Lords urged to scrutinise but not block assisted dying law",
      "url": "https://www.bbc.com/news/articles/cly0d1vg0e2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T10:55:07.000Z",
      "summary_90w": "",
      "raw": "MPs in the Commons backed the Terminally Ill Adults Bill by a majority of 23 in June this year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "078129e6664c17e6ef02f84f94bc74c6ae593bf9",
      "title": "Oxford Union president-elect condemned for Charlie Kirk comments",
      "url": "https://www.bbc.com/news/articles/c04qz5lk6ggo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T10:54:58.000Z",
      "summary_90w": "",
      "raw": "Student George Abaraonye posted on social media after news of the shooting broke, seeming to welcome the attack, according to media reports.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c8ca987b9a55a199cf45e1659894a0698b124cf",
      "title": "The latest on the murder of right-wing activist Charlie Kirk",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5538120/the-latest-on-the-murder-of-right-wing-activist-charlie-kirk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T10:48:47.000Z",
      "summary_90w": "",
      "raw": "The person who shot and killed right-wing activist Charlie Kirk is still at large. On Thursday, officials shared photos and video of a suspect running from the scene. NPR reports on the latest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a72c7666bcdc020783149d6892fae6cfd55bf68c",
      "title": "Police share video of Charlie Kirk shooting person of interest. And, prices rise",
      "url": "https://www.npr.org/2025/09/12/g-s1-88389/up-first-newsletter-charlie-kirk-shooting-suspect-inflation-jobs-jair-bolsonaro",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T10:28:00.000Z",
      "summary_90w": "",
      "raw": "Police shared photos and a video of a person fleeing from the scene after Charlie Kirk was fatally shot. Plus, inflation is rising, and the job market is weakening. So why are stocks soaring?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b8821594f07aceafce559b6c73f8c54a37c7444",
      "title": "Will the UK ever rejoin the EU? – podcast",
      "url": "https://www.theguardian.com/politics/audio/2025/sep/12/will-the-uk-ever-rejoin-the-eu-podcast",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T10:03:41.000Z",
      "summary_90w": "",
      "raw": "Pippa Crerar and Kiran Stacey speak to the minister for EU relations, Nick Thomas-Symonds, about the fallout from Brexit and our relationship with the European Union. Plus, we hear his thoughts on Keir Starmer’s leadership and how Labour should take on Nigel Farage and the rise of Reform –– \n\nSend your thoughts and questions to politicsweeklyuk@theguardian.com\n\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "199fec938e3c13cdd2acab993de02dc9adcfe7bc",
      "title": "Strongest tornado ever recorded in Japan hits Shizuoka prefecture",
      "url": "https://www.theguardian.com/environment/2025/sep/12/weather-tracker-strongest-tornado-ever-recorded-japan-hits-shizuoka-prefecture",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T09:52:00.000Z",
      "summary_90w": "",
      "raw": "Devastating twister packs gusts of up to 168mph, injuring 89 people and leaving trail of destruction\nJapan has experienced the strongest tornado in its recorded history after a devastating twister tore through Shizuoka prefecture.\nClassified as a JEF3, level 3 out of 5 on Japan’s tornado intensity scale, the tornado packed wind gusts of up to 168mph last Friday, injuring 89 people and leaving a trail of destruction. The hardest hit areas included Makinohara and Yoshida, where vehicles were overturned and more than 1,200 structures were damaged. Since records began in 1961, Japan has experienced 13 level 3 tornadoes, but none have reached level 4.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1bdb685bd2c39270d1122d3b96f2ea2a97e55",
      "title": "Prince Harry makes surprise visit to Ukraine in support of wounded troops",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5539034/prince-harry-visit-ukraine-wounded-troops",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T09:37:35.000Z",
      "summary_90w": "",
      "raw": "Britain's Prince Harry has arrived in Ukraine for a surprise visit in support of wounded service members.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c138099a2a36320e916a93ada7834aa80418ab5",
      "title": "Why mothers in the U.S. are scaling back on their work lives",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5537129/why-mothers-in-the-u-s-are-scaling-back-on-their-work-lives",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T09:02:37.000Z",
      "summary_90w": "",
      "raw": "Workforce participation for moms in the U.S. has been dropping for most of this year, and the reasons are more complicated than return-to-office mandates. The team from \"The Indicator\" explains why.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f1fcc7850bf4a3b993b5b87e784701b682318627",
      "title": "Insect populations drop even without direct human interference, a new study finds",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5535551/insect-populations-human-interference-study",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T09:01:00.000Z",
      "summary_90w": "",
      "raw": "Research published this month found that even in pristine, untouched areas, insect populations are still on the decline. Climate change is a likely culprit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd713b01b7d08feb2f92e97202f8659c96912026",
      "title": "Something big collapsed this week — again. Do you know what? Take our quiz",
      "url": "https://www.npr.org/2025/09/12/g-s1-88124/trump-france-saint-mars-vma-murdoch-news-quiz",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T09:01:00.000Z",
      "summary_90w": "",
      "raw": "This week, we had news of a drawing that may or may not be the president's, and of a rock that may or may not indicate that Mars had life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "85d31f7197a69b2d9b4ff8ff0e216e6401297e8b",
      "title": "North Korea executing more people for watching foreign films and TV, UN finds",
      "url": "https://www.bbc.com/news/articles/ckgqdz17ye3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T09:00:20.000Z",
      "summary_90w": "",
      "raw": "The report is based on more than 300 interviews with escapees from Kim Jong Un's secretive regime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b62dd234321e169fd665051a6b4b490c2a5520d8",
      "title": "CBS shifts to appease the right under new owner",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5537152/cbs-news-ellison-steps-appease-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "CBS' new owner, David Ellison, has taken concrete steps to address the concerns of the news division's sharpest critics — particularly President Trump and his allies.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a15567b9e951c6c846453c95511c2af08074e8e1",
      "title": "COMIC: 7 signs it's time to call it quits",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5403630/signs-its-time-to-quit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "It's hard to know when to give up on a goal, especially when you've invested so much time, effort and resources into it. Here are 7 signals you might be ready to move on.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "854280c8db3007021237029f2f114f05856ba3e2",
      "title": "Health care costs are soaring. Blame insurers, drug companies — and your employer",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5534416/health-care-costs-soaring-blame-your-employer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Some 154 million people in the United States get health care through their employer — and for many, their costs are about to go way up.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5e234a12f7e88a79d04e2de25984f5bec7922070",
      "title": "Wary of RFK Jr., Colorado started revamping its vaccine policies last spring",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/12/nx-s1-5538401/rfk-jr-colorado-revamps-vaccine-science-policies",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "While Health Secretary Robert F. Kennedy, Jr., dismantles the federal institutions that set vaccine policy, states like Colorado are changing laws and regulations in an effort to preserve access to vaccines.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7995b4d4add171ff67ce2e7ff1e756d1fe47bf8",
      "title": "Stephen Lawrence's mum appeals to witnesses as review into murder investigation begins",
      "url": "https://www.bbc.com/news/articles/cgrqnp09zl5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T08:39:52.000Z",
      "summary_90w": "",
      "raw": "Baroness Lawrence says review, triggered by BBC investigation, is the last opportunity for justice.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec313245262a91f387807cf9c970dfe86e5ee6ee",
      "title": "South Sudan vice-president charged with murder and treason  ",
      "url": "https://www.bbc.com/news/articles/c07vkln2ezro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T08:28:40.000Z",
      "summary_90w": "",
      "raw": "The roads leading to Riek Machar's house are blocked by tanks and soldiers, amid fears of renewed fighting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33a65e5ea615cae894d4804af69f376248ffd722",
      "title": "South African rapist loses bid to block Netflix film about his life",
      "url": "https://www.bbc.com/news/articles/cq65ygpv7p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T08:17:47.000Z",
      "summary_90w": "",
      "raw": "Thabo Bester had argued the documentary would affect his trial for allegedly faking his death to escape prison.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bdffbdbd70ddaeb4de30883848ec50a6febd80ef",
      "title": "Neo-Nazi Thomas Sewell given community work order for intimidating police officer and wife",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/neo-nazi-thomas-sewell-found-guilty-of-intimidating-police-officer-by-threatening-to-dox-them-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T08:09:22.000Z",
      "summary_90w": "",
      "raw": "Police officer gave evidence to Melbourne court about feeling ‘highly anxious’ over his and his family’s safety after Sewell’s podcast comments\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA neo-Nazi leader has been handed a community work order for intimidating a police officer and his wife.\nThomas Sewell, 32, was on Friday found guilty of three charges of intimidation of a law enforcement officer, and his wife, over targeted threats to expose his personal information.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5463aa5c53eed09d8b3c728b08da00d2e5e3c1bb",
      "title": "South Korean workers detained in US raid arrive home",
      "url": "https://www.bbc.com/news/articles/cn0r434g5k1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T07:46:12.000Z",
      "summary_90w": "",
      "raw": "Media and some protesters gather at the airport as more than 300 workers detained in the US last week return.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06ab44a741158dfe19ee196c133e20e6f30358d0",
      "title": "Health ministers agree to new fertility sector accreditation regime – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T07:36:35.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nAustralia’s biggest gas project greenlit to 2070 with ‘partial’ protection for Indigenous rock art\n\nGet our breaking news email, free app or daily news podcast\n\nAustralians are dying from dementia more than any other disease, as advocates warn the number of people with the disease could exceed 1 million without government intervention, AAP reports.\nDementia accounted for almost 17,400 deaths in 2023, equivalent to almost one in 10 of all deaths, according to the Australian Institute of Health and Welfare.\nThis has been an entirely unedifying week for the Coalition. Not something that we want to repeat. Something we should learn from.\nI think there has been mishandling on all sides, but the good news is we have cauterised the wound. We are going to move on now and talk about what’s important to ordinary Australians.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe3f32bd38faeed8b4cbe29f003b05fc2bf3f11b",
      "title": "Threatened, harassed and spat on: envoy details rise in attacks and recommends Islamophobia be treated with urgency",
      "url": "https://www.theguardian.com/news/2025/sep/12/islamophobia-report-envoy-aftab-malik-hands-down-recommendations-to-albanese-government",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T06:21:20.000Z",
      "summary_90w": "",
      "raw": "Aftab Malik cites bomb threats and assaults when releasing report containing 54 recommendations\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nCounter-terrorism laws should be reviewed, and the Racial Discrimination Act should be updated to protect religious groups , according to a long-awaited report from the special envoy to combat Islamophobia.\nThe report makes 54 recommendations to parliament and government departments to tackle Islamophobia, improve data collection on hate crimes, and calls on the government to “confront Islamophobia with equivalent urgency to other discriminatory practices, and provide it with the same rights, protections, and legal recourse”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ce61102f079746daea09856c29893b6b581fa48",
      "title": "'Who's that?!' Couple track down their wedding crasher, four years later",
      "url": "https://www.bbc.com/news/articles/c7v1d3r6y8mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T05:18:09.000Z",
      "summary_90w": "",
      "raw": "For years Michelle and John Wylie were puzzled about the presence of a mysterious tall man in a blue suit at their wedding.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d0dee245edb4e430fa9fdf69b6b1eb269fa5156",
      "title": "Australia’s biggest gas project greenlit to 2070 with ‘partial’ protection for Indigenous rock art",
      "url": "https://www.theguardian.com/environment/2025/sep/12/north-west-shelf-gas-project-extended-to-2070-with-partial-protection-for-indigenous-rock-art",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T05:16:44.000Z",
      "summary_90w": "",
      "raw": "Approval met with fury from conservation groups and the Greens, who called it a ‘betrayal’ of Australians who want climate action\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Albanese government has approved an extension to 2070 of one of the world’s biggest gas export projects, saying it has agreed on conditions to protect more than 1 million pieces of ancient world heritage-listed Indigenous rock art that sit nearby.\nClimate campaigners have described Woodside’s North West Shelf extension as a “carbon bomb” incompatible with global climate goals. The approval was met with fury from conservation groups and the Greens on Friday, who said it was a “betrayal” of Australians who wanted climate action.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T05:09:10.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee2c42ae71bdbaaedbe87687478c3f9fecff372b",
      "title": "Ros Atkins on... Israel's war in Gaza and proportionality",
      "url": "https://www.bbc.com/news/articles/cr5r76e127do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T05:00:28.000Z",
      "summary_90w": "",
      "raw": "BBC Verify asked experts, in the UK and elsewhere, if Israel’s actions in Gaza have been proportionate.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27fd0b2885d71c4fa8931a0830574d3f6b4570d6",
      "title": "What CCTV and drone footage tell us about the suspect's movements",
      "url": "https://www.bbc.com/news/videos/ce84y9ep1z8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T04:31:24.000Z",
      "summary_90w": "",
      "raw": "BBC Verify’s Nick Beake has been looking at newly released footage of the suspect and what we know about his escape.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c2638005b6d5461a1b04cbc74fb51a0a1c0e9e3",
      "title": "Jail for Bolsonaro by no means signals the end of his political movement",
      "url": "https://www.theguardian.com/world/2025/sep/12/jail-for-bolsonaro-by-no-means-signals-the-end-of-his-political-movement",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T04:00:27.000Z",
      "summary_90w": "",
      "raw": "With widespread support at home and from Trump, his heir will take the fight to Lula in the 2026 presidential election\nFour years have passed since Jair Bolsonaro laid out three possible denouements for his extraordinary political career, during which the oft-ridiculed fringe politician rose to become one of leading lights of the global populist right alongside Viktor Orbán and Donald Trump.\n“Going to jail, being killed or victory,” predicted Brazil’s then president as he grappled with a deluge of political crises in August 2021.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cecca052fbfbce8b1c29267b5cb69dd382a2755a",
      "title": "Venezuela says 11 killed in US boat strike were not gang members amid reports vessel was returning to shore",
      "url": "https://www.theguardian.com/world/2025/sep/11/venezuela-boat-strike-tren-de-aragua-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T01:50:42.000Z",
      "summary_90w": "",
      "raw": "Interior minister says ‘murder has been committed’ while US Congress demands justification for attack\nNone of the 11 people killed in a US military strike on a boat in the Caribbean last week were members of Venezuelan gang Tren de Aragua, Venezuela’s interior minister has said, while US media reported the attack came after the vessel had turned around and was heading back to shore.\nThe administration of Donald Trump has said the boat was transporting illegal narcotics, but has provided little further information about the incident, even amid demands from members of the US Congress for a justification for the action.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "728f8b34a2e09670b6d675f5af2e06ac8b345882",
      "title": "Bolsonaro sentenced to 27 years in prison for plotting Brazil coup",
      "url": "https://www.bbc.com/news/articles/c8xrqxk9p4xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T01:31:58.000Z",
      "summary_90w": "",
      "raw": "The former president has been found guilty of trying to mount coup to cling to power after he lost the election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d5c0125c8ba9074f4b46f2049eccfd4fd222f992",
      "title": "Man accused of Trump assassination attempt cut off by judge as trial begins",
      "url": "https://www.bbc.com/news/articles/c8d793z4mzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T01:10:28.000Z",
      "summary_90w": "",
      "raw": "Ryan Routh, who is defending himself, was reprimanded by the judge for \"making a mockery\" of the court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e52b637e33ba8c316f98ac7c9580adf5e1e70bbc",
      "title": "The secrets to tackling fussy eating habits",
      "url": "https://www.bbc.com/news/articles/c3e712j3gq5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T00:19:23.000Z",
      "summary_90w": "",
      "raw": "Fussy eating is very common. A child and baby nutritionist shares her tips on how to manage it.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2284c32ffcdbb5b608a0aa579588e48ae6ccd37",
      "title": "Young fans and critics debate Charlie Kirk's political legacy",
      "url": "https://www.bbc.com/news/articles/c62n6ql215ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-12T00:03:29.000Z",
      "summary_90w": "",
      "raw": "Kirk attracted fervent crowds, bringing young people into conservative politics, while at the same time shocking some with provocative opinions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "72ff0ae5927c42436a6d205a82d4130c6b277382",
      "title": "What the NHS can learn from the European country that helped more people survive cancer",
      "url": "https://www.bbc.com/news/articles/c701kw519lpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T23:59:05.000Z",
      "summary_90w": "",
      "raw": "Denmark's survival rates record for certain cancers were poor compared to some other wealthy countries. Then it came up with a bold plan",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb42d6a305403682983ab9203df51e7960135371",
      "title": "Worried migrants head home from India after Nepal turmoil",
      "url": "https://www.bbc.com/news/articles/c15kzx99qevo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T23:50:46.000Z",
      "summary_90w": "",
      "raw": "Nepalis rush home from India as deadly protests have engulfed the Himalayan nation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1894911a63f2eb943ee27da3be64046c3dda7114",
      "title": "Nato strengthens defences after Russian drones shot down over Poland",
      "url": "https://www.bbc.com/news/articles/c0lkz2n34z6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T23:46:28.000Z",
      "summary_90w": "",
      "raw": "Germany, the Netherlands and the Czech Republic will be sending Poland more support to defend Nato's eastern flank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f04ecb0f84e06ed7dfa220a002430aa4cab00c00",
      "title": "Spinal Tap: The world's loudest band return with a little help from their famous friends",
      "url": "https://www.bbc.com/news/articles/cy5039lqzgvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T23:34:07.000Z",
      "summary_90w": "",
      "raw": "The band reflect on their cult status and Oasis-esque reunion alongside Sirs Paul McCartney and Elton John.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f85ffe3ae9b0e94529b8c8e048529eaf91b7feb2",
      "title": "Water firm bans tankers from transporting water for billionaire's lake",
      "url": "https://www.bbc.com/news/articles/cq5jg9vy1n0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T23:24:43.000Z",
      "summary_90w": "",
      "raw": "Tankers taking water for US billionaire Stephen Schwarzman have been told to stop by Southern Water.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da7215670379007165e048548ee697d614f589b9",
      "title": "A California bill that would regulate AI companion chatbots is close to becoming law",
      "url": "https://techcrunch.com/2025/09/11/a-california-bill-that-would-regulate-ai-companion-chatbots-is-close-to-becoming-law/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T22:23:09.000Z",
      "summary_90w": "",
      "raw": "If SB 243 is enacted, California would become the first state to require operators to implement safety protocols for AI companions and hold companies legally accountable if their chatbots fail to meet those standards.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27ebde242ff8301726af4a420239734f6f8cde0",
      "title": "Bolsonaro sentenced to 27 years for plotting military coup in Brazil",
      "url": "https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T22:21:20.000Z",
      "summary_90w": "",
      "raw": "Former president sought to ‘annihilate’ country’s democracy after losing 2022 election\n\nExplainer: what did Bolsonaro’s trial reveal?\n\n​Brazil’s former far-right president Jair Bolsonaro ​has been sentenced to more than 27 years in prison for plotting a military coup​ and seeking to “annihilate” the South American country’s democracy.\nJustices Cármen Lúcia Antunes Rocha and Cristiano Zanin ruled on ​Thursday that Bolsonaro – a former paratrooper who was elected president in 2018 – was guilty of seeking to forcibly cling to power after losing the 2022 election, meaning four of the five judges involved in the trial had found Brazil’s former leader guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbfb7362f9f6f20e54155b97eda718d8a1de2187",
      "title": "OpenAI secures Microsoft’s blessing to transition its for-profit arm",
      "url": "https://techcrunch.com/2025/09/11/openai-secures-microsofts-blessing-to-transition-its-for-profit-arm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T22:18:29.000Z",
      "summary_90w": "",
      "raw": "OpenAI and Microsoft say they reached a nonbinding agreement on a revised partnership.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1862738b0ef6e63b86a4e7248ee3dc0a6bfe1884",
      "title": "Apple’s latest iPhone security feature just made life more difficult for spyware makers",
      "url": "https://techcrunch.com/2025/09/11/apples-latest-iphone-security-feature-just-made-life-more-difficult-for-spyware-makers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T22:00:46.000Z",
      "summary_90w": "",
      "raw": "Apple launched a new security feature for iPhone 17 and iPhone Air designed to reduce the effect of memory corruption bugs, and in turn make spyware and zero-days more difficult to hack into iPhones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b47960ae22f59181545b136fe55825ca24993bd3",
      "title": "The music industry is broken: OpenWav’s new app aims to change that",
      "url": "https://techcrunch.com/2025/09/11/the-music-industry-is-broken-openwavs-new-app-aims-to-change-that/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T21:07:23.000Z",
      "summary_90w": "",
      "raw": "OpenWav is building a direct-to-fan platform for music artists that lets them keep more of the profits.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0595bf256056c6f01d5bfec2089fcd7b04c3098d",
      "title": "Tesla’s robotaxi plans for Nevada move forward with testing permit",
      "url": "https://techcrunch.com/2025/09/11/teslas-robotaxi-plans-for-nevada-move-forward-with-testing-permit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T20:20:24.000Z",
      "summary_90w": "",
      "raw": "Tesla can now test its autonomous vehicle technology on public streets in Nevada, but it still has steps to take if it wants to offer paid rides like in Austin, Texas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67c75a7bf79565af92ac79e434d73cba209d663b",
      "title": "Bolsonaro's coup trial gripped Brazil - and his conviction will divide the country",
      "url": "https://www.bbc.com/news/articles/cj3yekj2xygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T20:18:21.000Z",
      "summary_90w": "",
      "raw": "The ex-president's conviction is a milestone critics will welcome, though his punishment remains unclear.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5089ba65629ea72f0e3c5789795210fd0ff96bf7",
      "title": "Archaeologists scramble to evacuate Gaza artefacts threatened by Israeli strike",
      "url": "https://www.theguardian.com/world/2025/sep/11/antiquities-evacuated-from-gaza-city-storehouse-ahead-of-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T20:17:31.000Z",
      "summary_90w": "",
      "raw": "Officials hurriedly remove nearly three decades of finds in ‘high-risk operation’\nAn official in charge of nearly three decades of archaeological finds in Gaza has described how the artefacts were hurriedly evacuated from a Gaza City building threatened by an Israeli strike.\n“This was a high-risk operation, carried out in an extremely dangerous context for everyone involved – a real last-minute rescue,” said Olivier Poquillon, director of the French Biblical and Archaeological School of Jerusalem (EBAF), which housed the relics.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d22323c121cf6d43c7ff132d183e8587bc4b776c",
      "title": "Are hotel rooms accessible for people who use wheelchairs? NPR wants to hear from you",
      "url": "https://www.npr.org/2025/09/11/g-s1-86969/hotel-safety-wheelchair-mobility",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T20:01:41.000Z",
      "summary_90w": "",
      "raw": "Hotels have accessible rooms for wheelchair users. If you or someone you know has experienced problems with those rooms, we'd like to hear about it.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "edef233579de1e0a258e940d0b75f35871772059",
      "title": "Canada: Carney unveils array of national projects to ‘turbocharge’ economy",
      "url": "https://www.theguardian.com/world/2025/sep/11/canada-mark-carney-national-projects-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T19:51:37.000Z",
      "summary_90w": "",
      "raw": "List leaves out oil pipelines and focuses on LNG expansion, mines and nuclear power as it fends off US trade war\nCanada’s Liberal government has said that a liquefied natural gas facility, critical mineral mines, a nuclear reactor and port expansion will mark the first wave of major national projects to “turbocharge” the country’s economy as it fends off a trade war with the United States.\nNotably, the list unveiled by the prime minster, Mark Carney, on Thursday does not include any new oil pipelines – projects which have proven to be deeply divisive and politically fractious in recent years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "602f9d86bd392e88fc4413cda4016d573a29a9d3",
      "title": "Charlie Kirk's assassination sparks grief and rage online",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537736/charlie-kirk-conservative-influencers-reaction",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T19:44:19.000Z",
      "summary_90w": "",
      "raw": "Some conservative influencers mourned Kirk's loss, even as others quickly blamed the left.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "786c79e38149c469eaa01d70f164fb21314efdab",
      "title": "Senators say US is complicit in Israel’s ethnic cleansing of Gaza",
      "url": "https://www.theguardian.com/us-news/2025/sep/11/democratic-senators-gaza-ethnic-cleansing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T19:39:44.000Z",
      "summary_90w": "",
      "raw": "Democrats Chris Van Hollen and Jeff Merkley reach ‘inescapable conclusion’ after fact-finding trip to region\nTwo Democratic senators claim they have reached the “inescapable conclusion” that Israel is acting on a systematic plan to destroy and ethnically cleanse Palestinians from Gaza to force local people to leave, and they say the US is complicit.\nChris Van Hollen of Maryland and Jeff Merkley of Oregon, both members of the Senate foreign relations committee, released their findings in a report on Thursday after returning from a congressional delegation to the Middle East where, they note, the destruction goes beyond bombs and bullets. They say they also found a systematic campaign to strangle humanitarian aid, which they call “using food as a weapon of war”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c027a0ebefc41c9dbf9194410e38d546298b7ae",
      "title": "Elon Musk’s Boring Company suspends work on Vegas airport tunnel after ‘crushing injury’",
      "url": "https://techcrunch.com/2025/09/11/elon-musks-boring-company-suspends-work-on-vegas-airport-tunnel-after-crushing-injury/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T19:28:23.000Z",
      "summary_90w": "",
      "raw": "A worker had to be rescued by the local fire department but is reportedly stable. Dozens of Boring Company workers have been injured over the years in Vegas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b26b9e6bac632655c366d8a237042b412e7cbba",
      "title": "Belarus frees political prisoners in exchange for easing of US sanctions ",
      "url": "https://www.bbc.com/news/articles/c740mezey41o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T18:55:36.000Z",
      "summary_90w": "",
      "raw": "Fifty-two prisoners have been released, but more than 1,000 political prisoners remain in jail.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0461e8861447ac00f85d2dc5575e3b027ee6c99",
      "title": "Justice Department sues Uber for allegedly discriminating against people with disabilities",
      "url": "https://techcrunch.com/2025/09/11/justice-department-sues-uber-for-allegedly-discriminating-against-people-with-disabilities/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T18:43:35.000Z",
      "summary_90w": "",
      "raw": "It's the latest in a long line of criticism — and action against — about the company's treatment of people with physical disabilities.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8bc59221cf99fb0926535d0526041316a5b1eee",
      "title": "VC leaders from 01 Advisors take the Builders Stage at TechCrunch Disrupt 2025 to share the scaling playbook",
      "url": "https://techcrunch.com/2025/09/11/what-comes-after-twitter-and-meta-the-founders-of-01a-share-their-playbook-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T18:40:00.000Z",
      "summary_90w": "",
      "raw": "Adam Bain, Dick Costolo, and David Fischer — the operators behind Twitter and Meta’s growth — reunite at Disrupt 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9cd36f512f6875052afe21b42d1bab582ed761f6",
      "title": "Weekly quiz: What was wrong with this medal?",
      "url": "https://www.bbc.com/news/articles/ckgy0ex5k5ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T18:31:09.000Z",
      "summary_90w": "",
      "raw": "How much attention did you pay to what happened in the world over the past seven days?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d6128e9b3e68d3a041d0fc222615b38e374423a",
      "title": "FTC launches inquiry into AI chatbot companions from Meta, OpenAI, and others",
      "url": "https://techcrunch.com/2025/09/11/ftc-launches-inquiry-into-ai-chatbot-companions-from-meta-openai-and-others/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T18:06:15.000Z",
      "summary_90w": "",
      "raw": "The federal consumer regulator seeks to learn about how AI companies evaluate the safety of their chatbots.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5ca5753778d66e1c0e5cfee6d4d40fbc3c3f7a88",
      "title": "Fiji ant study provides new evidence of insects’ decline on remote islands",
      "url": "https://www.theguardian.com/environment/2025/sep/11/fiji-ant-science-evidence-decline-insect-extinctions-remote-islands-aoe",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T18:00:13.000Z",
      "summary_90w": "",
      "raw": "DNA analysis of endemic specimens in museums finds 79% of ant populations in Pacific archipelago are shrinking\nIsland-dwelling insects have not been spared the ravages of humanity that have pushed so many of their invertebrate kin into freefall around the world, new research on Fijian ant populations has found.\nHundreds of thousands of insect species have been lost over the past 150 years and it is believed the world is now losing between 1% and 2.5% a year of its remaining insect biomass – a decline so steep that many entomologists say we are living through an “insect apocalypse”. Yet long-term data for individual insect populations is sparse and patchy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a003358b2712c6a1c04f1c961f37f4b97f44703d",
      "title": "Home mortgage demand surges as rates drop to 6.35%",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5538103/home-mortgage-rates-drop-september",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T17:28:29.000Z",
      "summary_90w": "",
      "raw": "Rates saw the biggest one-week drop in a year, spurring a spike in new purchase and refinance applications.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Charlie Kirk: Conservative influencer who rallied a youth movement",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T16:58:07.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Conservative influencer who rallied a youth movement",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T16:58:07.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6278b06afffe12cfa560b680235187e006d3b03b",
      "title": "Party like it's 2018 - Ethiopians celebrate their new year",
      "url": "https://www.bbc.com/news/articles/c4g2z8nv344o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T16:22:05.000Z",
      "summary_90w": "",
      "raw": "Photos of new year celebrations in a country with a calendar seven years behind that followed in the West.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b56c8966f95c5c129b0b3964260941d77365c703",
      "title": "Gmail makes it easier to track upcoming package deliveries",
      "url": "https://techcrunch.com/2025/09/11/gmail-makes-it-easier-to-track-upcoming-package-deliveries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google also announced that it's updating the Promotion category in Gmail to allow users to sort by \"most relevant\" promotion emails.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7121252673f0bdf689b56ba9dc36859383c883d3",
      "title": "Charlie Kirk's killing: A dangerous moment for America?",
      "url": "https://www.bbc.co.uk/sounds/play/live:bbc_world_service?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:55:00.000Z",
      "summary_90w": "",
      "raw": "Why the right wing influencer was shot and what next for the US?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f5b639f903c784e7bcfc4b8e410de412b524239",
      "title": "France says Apple notified victims of new spyware attacks",
      "url": "https://techcrunch.com/2025/09/11/france-says-apple-notified-victims-of-new-spyware-attacks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:32:05.000Z",
      "summary_90w": "",
      "raw": "The French government says Apple sent out threat notifications to customers alerting them to spyware attacks earlier in September.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "df1c6e02fda152fafb9404dab89f66e4aa68e84a",
      "title": "Google is shutting down Tables, its Airtable rival",
      "url": "https://techcrunch.com/2025/09/11/google-is-shutting-down-tables-its-airtable-rival/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:15:23.000Z",
      "summary_90w": "",
      "raw": "Google said the Tables app will not be supported after December 16, 2025, and advised that users export or migrate their data to either Google Sheets or AppSheet instead, depending on their needs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf54c8e6986a21b0c9a565cfdce4bc13ec14a30e",
      "title": "Humanoids, AVs, and what’s next in AI hardware with Waabi and Apptronik at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/11/humanoids-avs-and-whats-next-in-ai-hardware-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:02:50.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 is bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0168340090b269a173adf995b4f8817c1ffdbaee",
      "title": "HBO Max is going to get more expensive, Warner Bros. Discovery CEO says",
      "url": "https://techcrunch.com/2025/09/11/hbo-max-is-going-to-get-more-expensive-warner-bros-discovery-ceo-says/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:59:02.000Z",
      "summary_90w": "",
      "raw": "Zaslav also said that the streaming service's crackdown on passwords will be coming in the future.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "738e1ad01919d21230b7d89153f5f8374034406b",
      "title": "Kids in the UK are hacking their own schools for dares and notoriety",
      "url": "https://techcrunch.com/2025/09/11/kids-in-the-uk-are-hacking-their-own-schools-for-dares-and-notoriety/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:42:14.000Z",
      "summary_90w": "",
      "raw": "Kids are making a mark in the U.K.'s cybersecurity arena, and not in the way their parents want them to.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d0781e20d908495e2b221e24156542f9ad354063",
      "title": "Box CEO Aaron Levie on AI’s ‘era of context’",
      "url": "https://techcrunch.com/2025/09/11/box-ceo-aaron-levie-on-ais-era-of-context/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:36:31.000Z",
      "summary_90w": "",
      "raw": "Box released a new set of AI tools at its BoxWorks conference on Thursday, filling out CEO Aaron Levie's vision for an AI-led transformation of the enterprise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d5cc6f6575996d78c10f8014bcd73c40c1765571",
      "title": "South African court rules that men can take wife's surname",
      "url": "https://www.bbc.com/news/articles/cm2z351l6jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T13:52:14.000Z",
      "summary_90w": "",
      "raw": "The highest court rules that a law barring men from taking the surnames of their wives is a \"colonial import\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5837b6e2da8ebbc9d781e2aded9558316c9cff90",
      "title": "Festival axes German orchestra over concerns about Israeli conductor",
      "url": "https://www.theguardian.com/world/2025/sep/11/festival-axes-german-orchestra-over-concerns-about-israeli-conductor",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T13:04:06.000Z",
      "summary_90w": "",
      "raw": "Belgian organisers are accused of ‘naked antisemitism’ after cancelling performance by Lahav Shani\nA Belgian classical music festival has axed a leading German orchestra from its programme over concerns about its Israeli conductor, drawing accusations of antisemitism from Berlin.\nFlanders Festival Ghent announced it had cancelled a concert by the Munich Philharmonic scheduled for 18 September, citing insufficient clarity over Lahav Shani’s attitude to the Israeli government.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0343f569d8a34eefaf497a0bce755d17c32ea4b1",
      "title": "How Bill Gates’ fellowship program is adapting to global uncertainty",
      "url": "https://techcrunch.com/2025/09/11/how-bill-gatess-fellowship-program-is-adapting-to-global-uncertainty/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T13:00:00.000Z",
      "summary_90w": "",
      "raw": "As Breakthrough Energy Fellows welcomes a new cohort of 22 startups, it is also diversifying its portfolio to include more global founders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b464178e670e89ba3af772e61b1aa82cf19364f5",
      "title": "Inflation climbs in August as grocery and gas prices jump",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537074/inflation-economy-grocery-gas-federal-reserve",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T12:58:18.000Z",
      "summary_90w": "",
      "raw": "Inflation accelerated in August as Americans paid more for gasoline and groceries. Over the last 12 months, consumer prices have risen 2.9%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e6a1ad8093d6d1b87a9f7f68b8c9f80e681ad468",
      "title": "Zambia presses China for more compensation over toxic mine spill",
      "url": "https://www.bbc.com/news/articles/cwy9j8xqq2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T12:45:39.000Z",
      "summary_90w": "",
      "raw": "Zambia's Vice-President Mutale Nalumango says the compensation offered to communities \"may not be all\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d65d4b64c9de1829f4f49c0e1b4e893a5716ee6",
      "title": "NPR's next news chief built an international career at CNN",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5536569/npr-thomas-evans-news-editor-in-chief",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T12:31:09.000Z",
      "summary_90w": "",
      "raw": "NPR has promoted Thomas Evans, its editorial review chief, to lead the newsroom through a period of change, following Congress' decision to end federal funding of public media.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "100b5151ee8f0d9dba9021960fc6985a2d0f9510",
      "title": "France suspects foreign intelligence over pigs heads left outside mosques",
      "url": "https://www.bbc.com/news/articles/cx25414vg7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T11:53:28.000Z",
      "summary_90w": "",
      "raw": "Foreign nationals are blamed for the incident, which has striking similarities with other recent provocations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea0ce9e7fc0ac37a3179f63f5a6f72cb960f9fbd",
      "title": "Hundreds of South Koreans arrested in a U.S. immigration raid are being sent home",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537811/south-koreans-arrested-immigration-us-raid-sent-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T11:50:19.000Z",
      "summary_90w": "",
      "raw": "U.S. immigration authorities are preparing to send more than 300 South Korean workers home on a chartered flight from Atlanta, a week after detaining them for allegedly working illegally.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4fe8e1e2ed8a5fc2a45ce74be7321706be6531d0",
      "title": "Israeli strikes in Yemen kill 35 people, Houthis say",
      "url": "https://www.bbc.com/news/articles/c179e5v552ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T11:00:49.000Z",
      "summary_90w": "",
      "raw": "The Israeli military says it hit military targets, but the Houthis say only civilian sites were targeted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Lab results confusing? Some patients use AI to interpret them, for better or worse",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02e1f5a7f25678fb6dd1f6dcc569528ad3d1cabc",
      "title": "After crafting quiet Florida life, Shah of Iran’s alleged ‘chief torturer’ must now face trial",
      "url": "https://www.theguardian.com/world/2025/sep/11/parviz-sabeti-shah-iran-lawsuit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T09:00:32.000Z",
      "summary_90w": "",
      "raw": "Parviz Sabeti crafted an anonymous new life for his family – but now he faces a $225m lawsuit for atrocities committed in prisons in Tehran and elsewhere\nNeighbors in the upscale Florida community of Windermere know them as Peter and Nancy, the seemingly friendly retired couple they wave to on morning walks, and who always appear to enjoy visits from their two high-flying grown daughters, one a respected professor of science at Harvard University.\nYet behind the high walls of their $3.6m lakefront mansion lies a darker, more closely guarded reality: “Peter” is actually Parviz Sabeti, the alleged head of secret police and chief torturer of the former Shah of Iran’s pre-revolutionary government, now facing a $225m lawsuit in Florida for atrocities committed in prisons in Tehran and elsewhere.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "139f262bc3987c2dbd95b84f9ffd659df4b52187",
      "title": "6 ways college students can get a better handle on their money",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5519357/the-broke-college-students-guide-to-managing-money",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For college students who don't have a lot of money, it can be tough to wrap your head around student loans, credit cards and a tight budget. A financial educator offers advice for first-year students.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "32d0450fd1ecf0a66e3dcf89d08614901ee10a35",
      "title": "Hong Kong criticised for rejecting bill giving ‘bare minimum’ rights to same-sex couples",
      "url": "https://www.theguardian.com/world/2025/sep/11/hong-kong-same-sex-couples-rights-bill-rejected",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T06:16:01.000Z",
      "summary_90w": "",
      "raw": "Legislative council voted down a bill that was introduced to comply with an order from the city’s top court\nHuman rights groups have accused the Hong Kong government of failing to provide the “bare minimum” of rights to same-sex couples after it rejected a bill that was introduced to comply with an order by the city’s top court.\nThe city’s unicameral legislative council (LegCo), on Wednesday rejected the bill by a vote of 71-14 after the second reading, following months of debate in the city between opponents who said it threatened family values and advocates who said the government was out of line with the majority of residents who supported same-sex relationships.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3e57be78ca1afae15e412add71be651d57c9302",
      "title": "Killing of Trump ally lays bare America's bloody and broken politics",
      "url": "https://www.bbc.com/news/articles/cm2z9z4m22ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T05:40:57.000Z",
      "summary_90w": "",
      "raw": "Charlie Kirk's killing is another episode of gun violence in America and the latest in a line of recent political violence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e566eb7c4722f8556cd32601c0b0046354e9170",
      "title": "Flash floods in Indonesia leave at least 15 people dead and 10 missing",
      "url": "https://www.theguardian.com/world/2025/sep/11/flash-floods-indonesia-bali-deaths",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:58:57.000Z",
      "summary_90w": "",
      "raw": "Torrential rains cause flooding and landslides in East Nusa Tenggara province and on the tourist island of Bali\n\nFlooding in Bali, Indonesia – in pictures\n\nRescuers have recovered the bodies of 15 people who have died in flash flooding in two Indonesian provinces, while authorities said 10 others were missing.\nTorrential rains beginning on Monday caused flooding and landslides in East Nusa Tenggara province and on the island of Bali.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2508002d85ec34011ad48a2f2bad50d7eef8261",
      "title": "Fatal dam collapse: 'How do you restart from nothing?'",
      "url": "https://www.bbc.com/news/articles/c1kwepevkzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T00:10:25.000Z",
      "summary_90w": "",
      "raw": "Survivors of the flood tell the BBC they are still in need of government support.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9434232e262d9b16fcaf7399776bb45549356463",
      "title": "How Syria's dictatorship used a global child welfare charity to 'disappear' children",
      "url": "https://www.bbc.com/news/articles/c4g53e4zdjpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T23:15:51.000Z",
      "summary_90w": "",
      "raw": "The Assad regime used an international charity to hide children of detainees from their families.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c5b9307d5b2cc39fe1973214edd71809a14c28",
      "title": "Mystery of dancing spiders' DNA could explain how they develop into new species",
      "url": "https://www.bbc.com/news/articles/c4gzl2zj72jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T23:00:20.000Z",
      "summary_90w": "",
      "raw": "There are many more species of peacock spider than other animals, scientists think they may know why.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f685ce70e92f92303d88958421fbbea0ad357920",
      "title": "Putin and Netanyahu present twin challenges to Trump's diplomacy",
      "url": "https://www.bbc.com/news/articles/cvg9pnpqm2jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T19:44:52.000Z",
      "summary_90w": "",
      "raw": "Israel's strikes in Doha and the Russian drone incursion could present major affronts to his authority.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13ea08e07d8c36122cf44bf22c52cea93e421323",
      "title": "Accidental or deliberate? Russia's drone incursion into Poland is a test for Nato",
      "url": "https://www.bbc.com/news/articles/clydk8821nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T18:56:48.000Z",
      "summary_90w": "",
      "raw": "Whether the drone incursion was deliberate or accidental, Moscow will be watching Nato's response to it closely.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b3a878af0d65401d30b2b22e759db794e484cb6",
      "title": "Tech Life",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6zp7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T19:30:00.000Z",
      "summary_90w": "",
      "raw": "Robot sailboats are helping forecasters predict where hurricanes will hit land.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b01e5f5037c4e13f5add6c3b3cd312f3c5b5bdc6",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jb6f?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-06T01:00:00.000Z",
      "summary_90w": "",
      "raw": "How technology is bringing hope of earlier detection and prevention to wildfires.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}