{
  "version": "1758149522888",
  "generatedAt": "2025-09-17T22:52:02.888Z",
  "items": [
    {
      "id": "0396324c4cd5cf009092dc4c6d523be7fb442bc5",
      "title": "King and Trump hail UK-US special relationship in state banquet speech",
      "url": "https://www.bbc.com/news/articles/cz9jyzl4532o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:41:55.000Z",
      "summary_90w": "",
      "raw": "The state visit will continue on Thursday, as it moves from a royal spectacle to political talks with PM Keir Starmer",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a3e2223a41d8afd889e0d0df732cdffa3f147d92",
      "title": "Australia news live: Sussan Ley ‘deeply sceptical’ about Labor’s upcoming emissions target but declines to name own figure",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T22:38:53.000Z",
      "summary_90w": "",
      "raw": "Opposition leader says she wants to know the ‘cost’ and ‘credibility’ behind emissions reduction targets. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nMichaelia Cash disputes UN body findings and says genocide not ‘simply about loss of life in war’\nMichaelia Cash, the shadow foreign affairs minister, has discounted findings from a UN commission this week that Israel is committing genocide in Gaza, saying genocide was not “simply about loss of life in war”.\nWell, genocide, Sally, as you know, and I’m a lawyer, has a very specific meaning in international law.\nIt’s not simply about loss of life in war, however, tragic. It requires a deliberate intent to destroy a people in whole or in part. Now, Israel has made it very clear that its actions are about defending its citizens from Hamas terrorism, not about destroying the Palestinian people. …\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6c37dcfbb0fc69f75bef4af6534bcd990340d3a",
      "title": "I have no relationship with Trump, Brazil's President Lula tells BBC",
      "url": "https://www.bbc.com/news/articles/c3rv981qv4go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:33:33.000Z",
      "summary_90w": "",
      "raw": "In an exclusive interview, Brazil's president says Trump is \"not emperor of the world\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0caa04acf690949fe5cfd1f5b89f59816e36dac2",
      "title": "Three officers killed in Pennsylvania shooting, with two others critical",
      "url": "https://www.bbc.com/news/articles/cvg4n4zx48no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:32:20.000Z",
      "summary_90w": "",
      "raw": "Officials said the suspect has been \"neutralised\" and there is no further threat to the public.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "976377ddeed6af99721f2facf893a185d17ef689",
      "title": "Murder charge in 2002 cold case after bones found buried in South Australian back yard",
      "url": "https://www.theguardian.com/australia-news/2025/sep/18/susan-goodwin-cold-case-south-australia-murder-charge-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T22:18:23.000Z",
      "summary_90w": "",
      "raw": "Detectives arrested and charged 64-year-old man over murder of Susan Goodwin, reported missing in July 2002\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nPolice have charged a man with murder, hours after bones were found during a search for the remains of a woman who vanished more than 20 years ago.\nThe breakthrough in the cold case was made late on Wednesday after the discovery of human remains, believed to be those of Susan Goodwin, 39, buried in the back yard of a house in Port Lincoln, South Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c87bb8ca709ce8fbe89641a9170183f9da906ed",
      "title": "Melania’s hat, a yellow dress and Kate’s golden gown - standout state visit looks",
      "url": "https://www.bbc.com/news/articles/cy857ddpjp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:17:34.000Z",
      "summary_90w": "",
      "raw": "State visits are often seen as an opportunity to exercise “sartorial diplomacy” on the world stage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68ec46c261eea390ae0457d36bb2d50e4c7fb2f4",
      "title": "Microsoft’s new Xbox mode on Windows has leaked for any handheld",
      "url": "https://www.theverge.com/news/780388/microsoft-xbox-fullscreen-mode-windows-11-handheld-leak",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T22:06:08.000Z",
      "summary_90w": "",
      "raw": "Microsoft is getting ready to launch its Xbox full-screen experience on the new Xbox Ally devices next month, but it looks like you won’t need new hardware to get it. Windows enthusiasts have discovered a way to enable this new Xbox mode early in Windows 11, thanks to the latest 25H2 update to the operating system.\nThe method, which involves installing a Release Preview version of Windows 11 and lots of tweaks, works on a variety of handheld gaming PCs — including MSI’s Claw devices and Asus’ ROG Ally range. I’ve been trying it out on the original ROG Ally today, and it allows the device to ignore Asus’ own software in favor of Microsoft’s Xbox app at boot.\n\n\nMicrosoft’s new Xbox mode on Windows has leaked for any handheld. Windows enthusiasts have found a way to get the new Xbox full-screen experience running on Windows 11. Guide here: https://t.co/KvXqjQMr6A pic.twitter.com/w7iEbAtLAP\n— Tom Warren (@tomwarren) September 17, 2025\n\n\nThe new Xbox full-screen experience doesn’t load the full Windows desktop or a bunch of background processes, freeing up more memory for games. It’s essentially not loading the Explorer shell and saving around 2GB of memory by suppressing all the unnecessary parts of a typical Windows 11 installation. \nYou launch straight into the Xbox PC app instead, which includes all of your PC games from the Microsoft Store, Battle.net, Steam, and other storefronts. There’s a Game Bar for navigating around, and a new task view that’s a lot more handheld-friendly.\nYou can also still swap into a Windows desktop mode, or access Windows apps and games directly in this full-screen Xbox mode. Microsoft warns that you’re exiting to the Windows desktop and that you should use touch or a mouse and keyboard “for the best experience,” and it’s the exact same Windows experience that exists on multiple devices right now.\nIf you want to try this out for yourself, it’s a relatively easy process to get going. But be warned, fiddling with registry settings or the Windows Feature Store (known as Velocity) could result in system instability. If you’re willing to risk some issues that might need rolling back or require a reinstall of Windows, there’s a handy guide on Reddit for all the settings required.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a37c924234f58658fee5ad5a0b6f7aca2df3994",
      "title": "Watch: Pomp and protests on day one of Trump state visit",
      "url": "https://www.bbc.com/news/videos/cd07v4g0yy3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T21:53:29.000Z",
      "summary_90w": "",
      "raw": "King Charles hosts Donald Trump at Windsor Castle on the first full day of his UK state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5379f129733c7bf4a4c8bf78e845cfcf2932fed",
      "title": "Irregular raises $80 million to secure frontier AI models",
      "url": "https://techcrunch.com/2025/09/17/irregular-raises-80-million-to-secure-frontier-ai-models/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T21:52:00.000Z",
      "summary_90w": "",
      "raw": "Irregular, the AI security startup, now has a valuation of $450 million, a source  close to the deal told TechCrunch.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed820f59b8ea7b94e10639fbd36b5f989a064b96",
      "title": "$30bn Santos takeover collapses after Abu Dhabi consortium withdraws offer",
      "url": "https://www.theguardian.com/australia-news/2025/sep/18/30bn-santos-takeover-collapses-after-abu-dhabi-consortium-reconsiders-offer",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T21:47:30.000Z",
      "summary_90w": "",
      "raw": "Withdrawal spares federal government from making high-stakes decision on whether to back the deal\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAn Abu Dhabi-led consortium has withdrawn its $30bn takeover bid for Australian oil giant Santos, sparing the federal government from making a high-stakes decision on whether to back the deal.\nXRG, the investment arm of the Abu Dhabi National Oil Company, said in a statement late on Wednesday that “a combination of factors” had affected its assessment, without elaborating.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6fac2cd5a5b6a37b1c4ba4097f7b0b7c90a4363",
      "title": "The ongoing U.S.-China trade war has complicated things for U.S. chip giant Nvidia",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5542032/the-ongoing-u-s-china-trade-war-has-complicated-things-for-u-s-chip-giant-nvidia",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T21:45:37.000Z",
      "summary_90w": "",
      "raw": "U.S. chip giant Nvidia is caught in the middle of the U.S.-China trade war. But it will take more than geopolitical tensions to rein in demand for the company's chips.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "51db1646ac2a1af65a876ba5ffbeb9db0e83bad8",
      "title": "At least 2 seriously hurt in Pennsylvania shooting involving police",
      "url": "https://www.npr.org/2025/09/17/g-s1-89333/pennsylvania-police-shooting-north-codorus",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T21:35:32.000Z",
      "summary_90w": "",
      "raw": "At least two people were seriously injured in a shooting involving police in the southern part of Pennsylvania, not far from the Maryland border, and Gov. Josh Shapiro was rushing to the scene, officials said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e03ca3100e80c0f08c25c63134ceca4e842908a",
      "title": "US to invest £150bn in UK, promising thousands of jobs",
      "url": "https://www.bbc.com/news/articles/cx2nllgl3q7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T21:30:05.000Z",
      "summary_90w": "",
      "raw": "The UK government is calling this the largest commercial deal of its kind and expects it to create more than 7,600 \"high-quality jobs\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2c4afcdbd57142488c6308223e3892082045d4c",
      "title": "Ben & Jerry's co-founder Jerry Greenfield resigns over dispute with owner Unilever",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544283/ben-jerrys-jerry-greenfield-resigns-unilever",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T21:19:28.000Z",
      "summary_90w": "",
      "raw": "Greenfield said the Vermont ice cream maker \"has been silenced, sidelined for fear of upsetting those in power\" by Unilever, the multinational corporation that bought Ben & Jerry's in 2000.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d7040d93ced80935ebce1a04b866b9e1d7552bc4",
      "title": "The best iPad deals you can get right now",
      "url": "https://www.theverge.com/21280354/best-ipad-deals-apple",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T21:03:01.000Z",
      "summary_90w": "",
      "raw": "While the best iPad deals usually land during major sale events like Black Friday and Amazon Prime Day, many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most affordable iPad. The most recent iPad Pro and iPad Mini are also regularly discounted, as is the latest iPad Air.\n\nThe best iPad (2025) deals\nThe best iPad Mini (2024) deals\nThe best iPad Air (2025) deals\nThe best iPad Pro (2024) deals\n\nIt’s difficult to know where exactly you can find the most notable iPad deals unless you’re scouring the major retailers on a daily basis. But that’s often what our deal hunters at The Verge are doing, so let us help you out. Below, we’ve listed the best deals you can get on each iPad model that is available, from the 11th-gen base iPad to the more powerful models with M3 and M4 chips. Every model mentioned in this guide can run Apple’s iPadOS 26 update, which is now available to download.\nThe best iPad (2025) deals\nApple iPad (11th-gen)\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $349 $299 at Walmart (128GB, Wi-Fi)\n $449 $399 at Amazon (256GB, Wi-Fi)\n\nApple’s 11th-gen iPad landed on the scene in March. The newest base model tablet is a fairly iterative update of the prior model, but with 128GB of base storage (as opposed to 64GB) and the A16 Bionic chip, which is nearly 30 percent faster than the A14 chip used in the 10th-gen iPad. That being said, the newer chip doesn’t support the various Apple Intelligence features introduced in iPadOS 18.1 and subsequent updates. For that, you’ll want to opt for a more recent iPad Air, iPad Mini, or iPad Pro model.\nPricing-wise, the latest iPad starts at $349 with Wi-Fi and 128GB of storage. You can also upgrade to 256GB or 512GB of storage for an additional $100 or $200, respectively, or purchase an LTE model starting at $499. We saw a pretty significant price drop to $279 during Prime Day, though you can still find the entry-level model on sale at Amazon, Walmart, and Best Buy starting at $299 ($50 off). Alternatively, you can purchase the 256GB model at Amazon, Walmart, and Best Buy starting at $399 ($50 off), or the 512GB variant at Amazon, Walmart, and Best Buy for $599 ($50 off).\nThe best iPad Mini (2024) deals\niPad Mini (2024)\n\nWhere to Buy:\n\n $499 $399 at Amazon (128GB, Wi-Fi)\n $499 $399 at Best Buy (128GB, Wi-Fi)\n $599 $499 at Amazon (256GB, Wi-Fi)\n\nThe seventh-gen iPad Mini is similar in several ways to the previous model, but comes with some big internal upgrades. It includes faster Wi-Fi and USB-C speeds, support for the Apple Pencil Pro, and a newer A17 Pro processor with 8GB of RAM to support Apple Intelligence. Otherwise, it boasts nearly identical specs and features as the last-gen model, meaning it has an 8.3-inch Liquid Retina display and options for 5G. It may not be worth upgrading if you already own a sixth-gen Mini, but newcomers to the category will appreciate the upgrades.\nThe 2024 iPad Mini starts at $499 with 128GB of storage, which was the price for the previous generation’s 64GB model. Electing for 256GB of storage brings the price up to $599, and the cellular models start at $649. These are some big numbers for a small iPad, so the larger iPad Air might be worth considering if you prefer your dollar to go further with more screen real estate. But if you want an Apple tablet in the smallest possible form factor, this is where the action is.\nRight now, the 128GB base model with Wi-Fi is on sale at Amazon, Best Buy, and Target for $399 ($100 off), which is about $20 short of the all-time low we saw during Prime Day. If you need additional storage, you can also pick up the 256GB variant at Amazon and Best Buy for $499 ($100 off), or the 512GB model at Amazon, Best Buy, and Target for $699 ($100 off).\nThe best iPad Air (2025) deals\n11-inch iPad Air M3\n\nWhere to Buy:\n\n $599 $449 at Amazon (128GB, Wi-Fi)\n $699 $549 at Amazon (256GB, Wi-Fi)\n $899 $749 at Amazon (512GB, Wi-Fi)\n\n\n13-inch iPad Air M3\n\nWhere to Buy:\n\n $799 $649 at Amazon (128GB, Wi-Fi)\n $899 $749 at Amazon (256GB, Wi-Fi)\n $1099 $949 at Amazon (512GB, Wi-Fi)\n\nThe 2025 iPad Air is little more than a spec bump over the previous model, with a few technical upgrades that should allow it to last longer into the future than either the entry-level iPad or the last-gen Air. It features an M3 chip with support for Apple Intelligence, plus compatibility with Apple’s latest Magic Keyboard that has a larger trackpad and an extra row of function keys. In short, the Air is a credible laptop replacement.\nThe 11-inch model starts at $599 and the 13-inch variant $799 — the same price as prior models — but it’s common to see discounts from third-party retailers. Right now, for instance, the 11-inch Air is on sale at Amazon, Walmart, and Best Buy in its base configuration with Wi-Fi and 128GB of storage for $449 ($150 off). You can also grab the 256GB model at Amazon, Walmart and Best Buy for $549 ($150 off), or the step-up 512GB model at Amazon, Walmart, and Best Buy for $749 ($150 off).\nThe larger 13-inch model, meanwhile, is on sale at Amazon, Walmart, and Best Buy with 128GB of storage starting at $649 ($150 off). You can also pick up the 256GB model at Amazon, Walmart, and Best Buy starting at $749 ($150 off), or the 512GB variant at Amazon, Walmart, and Best Buy for $949 ($150 off).\nThe best iPad Pro (2024) deals\n11-inch iPad Pro (2024)\n\nWhere to Buy:\n\n $999 $899 at Amazon (256GB, Wi-Fi)\n $1199 $1081.43 at Amazon (512GB, Wi-Fi)\n $1599 $1476 at Amazon (1TB, Wi-Fi)\n\n\n13-inch iPad Pro (2024)\n\nWhere to Buy:\n\n $1299 $1099 at Amazon (256GB, Wi-Fi)\n $1499 $1299 at Amazon (512GB, Wi-Fi)\n $1899 $1699 at Amazon (1TB, Wi-Fi)\n\nThe 2024 iPad Pro is a far more impressive upgrade than the latest iPad Air. The 11- and 13-inch models start at $999 and $1,299, respectively, and they were the first Apple devices to feature the company’s latest M4 chip, which brings moderate performance gains and dedicated hardware for on-device Apple Intelligence processing. The new Pro models can claim other firsts, too, such as being the first iPad models with OLED displays and the lightest Pros yet, which is true of both sizes. They also feature repositioned front-facing cameras that sit along the horizontal edge (also found in the 11th-gen iPad), which prevent you from looking as though you’re staring off into space on a video call.\nAs for deals, the base 11-inch iPad Pro with 256GB of storage is currently on sale at Amazon, Walmart, and Best Buy for around $899 (about $100 off), while the model with Wi-Fi and 512GB of storage is $1,081.43 (about $118 off) at Amazon and Walmart. The sleek and super-thin 13-inch model, meanwhile, is on sale in its 256GB base configuration at Amazon, Best Buy, and Target for $1,099 ($200 off), or in its 512GB configuration at Amazon, Best Buy, and Target starting at $1,299 ($200 off). Amazon and Best Buy also have the 1TB model for $1,699 ($200 off) if you’re looking for more storage to hold your apps, photos, and videos.\nWhile there are some enticing deals on the iPad Pro with the M4 chip, it’s worth noting that the current model is more than a year old. That means if you want the most up-to-date tech, you may want to hold off before making your decision. A recent report from Bloomberg suggests that a new iPad Pro with an M5 chip could arrive as early as the fall, which is around when iPadOS 26 is expected to become available.\nUpdate, September 17th: Updated to reflect current pricing and availability. We also noted that the iPadOS 26 update is now available for all iPads mentioned in this guide.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f5170f156c540e02e967333d70e6a01d27bc130c",
      "title": "What is the President's schedule while he's in the UK?",
      "url": "https://www.bbc.com/news/articles/c8rynvlm6zjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:58:20.000Z",
      "summary_90w": "",
      "raw": "US President Donald Trump and his wife Melania are in the UK for an unprecedented second state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1c62cda56df4004eb21299e3dcb217900ecde02",
      "title": "White House moves to scrub national park sites of negative history",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5540117/government-moves-to-national-scrub-park-sites-of-negative-history",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T20:47:48.000Z",
      "summary_90w": "",
      "raw": "The National Park Service has until Wednesday to address signs that \"inappropriately disparage\" historical figures. One target is George Washington's house in Philadelphia, where he had slaves.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: All the best images from the day at Windsor Castle",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:37:24.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: US President Donald Trump on second state to UK",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T20:37:24.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "070c40215df92ef38a2e9be5155fdd80c9226670",
      "title": "Thousands gather in London to protest against visit",
      "url": "https://www.bbc.com/news/articles/cj9zve281k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:32:46.000Z",
      "summary_90w": "",
      "raw": "A coalition of more than 50 groups have organised a march in central London against the visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e01a09eca4e151595ed27c58d4b14de1845c384",
      "title": "Tesla is redesigning its door handles following safety probe, Bloomberg investigation",
      "url": "https://techcrunch.com/2025/09/17/tesla-is-redesigning-its-door-handles-following-safety-probe-bloomberg-investigation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T20:23:42.000Z",
      "summary_90w": "",
      "raw": "Chief designer Franz von Holzhausen said Wednesday that the company is \"working on\" combining the electronic and manual door releases after owners have reported getting trapped.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c54b62a987e38b30059e697626fb9fa76583a594",
      "title": "US central bank cuts interest rates but cautions over stalling job market",
      "url": "https://www.bbc.com/news/articles/c3e75y90pw0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:12:27.000Z",
      "summary_90w": "",
      "raw": "The Federal Reserve makes its first cut to interest rates since 2024, and signals more to come.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0df906731edfd2a16ce25ec6796e24359c38f747",
      "title": "Vitamin B3 can help protect against skin cancer. Here's who may benefit",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544145/vitamin-b3-can-help-protect-against-skin-cancer-heres-who-may-benefit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T20:04:49.000Z",
      "summary_90w": "",
      "raw": "Dermatologists often recommend nicotinamide — a form of Vitamin B3 — following skin cancer. A study of nearly 34,000 veterans finds this supplement reduces the risk of skin cancer recurrence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f18e986d01426f67faabbf80e59e658c859bfc95",
      "title": "Microsoft Paint is getting its own Photoshop-like project files",
      "url": "https://www.theverge.com/news/780287/microsoft-paint-project-files-feature-photoshop-psd",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T20:01:16.000Z",
      "summary_90w": "",
      "raw": "Microsoft has been steadily improving its Paint app for Windows 11 in recent years with a dark mode, transparency and layers, and even AI-powered image creation. Now, Microsoft is adding two new Photoshop-like features to Paint.\nYou’ll soon be able to save your Paint creations as a project file, much like a Photoshop Document (.PSD). The Paint project files are currently being tested with Windows Insiders in the Dev and Canary Channels. “You can now save your creation as an editable Paint project file and seamlessly pick up where you left off,” explains Dave Grochocki, principal product manager lead for Microsoft’s Windows inbox apps.\nPaint files will be stored with, you guessed it, a .paint file extension. Paint files will store your layers inside the file, too. “When you’re ready to return, simply open the file to launch it in Paint, right where you left off,” says Grochocki. \nMicrosoft is also adding opacity sliders to adjust the transparency of the pencil and brush tools in Paint. “To get started, select either tool and use the slider on the left side of the canvas to adjust the opacity to your desired level,” says Grochocki. \nIf you’re a fan of the Snipping Tool in Windows 11, Microsoft is also adding a quick markup feature that makes it easier to annotate screenshots. There’s a highlighter, pen, and eraser tool in the markup toolbar, as well as the ability to easily re-crop an image.\nFinally, Microsoft is also adding AI-powered write, summarization, and rewrite as a free feature inside Notepad for Copilot Plus PC users. You won’t need a Microsoft 365 subscription to use this, but Grochocki says you can “seamlessly switch between local and cloud models based on your needs.” Microsoft is using the local models on Copilot Plus PCs to power this Notepad feature.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c4dc00cdf0e79fce90e45b0fbc7e7cc574551595",
      "title": "Kleiner Perkins-backed voice AI startup Keplar aims to replace traditional market research",
      "url": "https://techcrunch.com/2025/09/17/kleiner-perkins-backed-voice-ai-startup-keplar-aims-to-replace-traditional-market-research/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T19:54:17.000Z",
      "summary_90w": "",
      "raw": "The two-year-old startup raised a $3.2 million seed round led by Kleiner Perkins.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15076a1989cf6746b0a16cde0fb6174d1f02d12e",
      "title": "Meet Macroscope: an AI tool for understanding your code base, fixing bugs",
      "url": "https://techcrunch.com/2025/09/17/meet-macroscope-an-ai-tool-for-understanding-your-code-base-fixing-bugs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T19:52:16.000Z",
      "summary_90w": "",
      "raw": "On Wednesday, former Twitter head of product Kayvon Beykpour announced the launch of Macroscope, an AI system aimed at developers and product leaders that summarizes updates to a codebase and catches bugs, among other things.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67e9381a6a15cac27c0915aedca0cac07c9b5ac4",
      "title": "China tells its tech companies they can’t buy AI chips from Nivida ",
      "url": "https://techcrunch.com/2025/09/17/china-tells-its-tech-companies-they-cant-buy-ai-chips-from-nivida/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T19:39:28.000Z",
      "summary_90w": "",
      "raw": "After strongly discouraging tech companies from buying Nivdia's AI chips in August, the country is now banning the practice outright.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1279e01cabe1d32d11f5a67175cf9892e1a7fc50",
      "title": "&#8216;Ask Gemini&#8217; AI will tell you what you missed during a Google Meet call",
      "url": "https://www.theverge.com/news/780211/google-ask-gemini-meet-workspace-ai-assistant",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T19:29:54.000Z",
      "summary_90w": "",
      "raw": "Ask Gemini in Meet can make it seem like you’ve been paying close attention during a call, even if you haven’t. | Image: Google\t\n\nGoogle is starting the rollout of its Ask Gemini AI assistant in Google Meet, but it will initially only be available to “select Google Workspace customers.” The assistant can answer participant’s questions by referring to captions generated during the call, resources like Google Docs, Sheets, and Slides they have permission to view, and public websites. It can also provide summaries of what a specific participant said, identify important decisions and action items, and generate a summary of what you missed when joining a meeting late, but only when Google Meet’s Take Notes for Me feature has been activated by the host.\nAsk Gemini’s responses are kept private to every participant and, alongside other meeting data like captions, they’re not stored after a Google Meet call ends. Every participant will also see when Ask Gemini is enabled during a call and while it’s turned on by default, the hosts can disable it at any time, and admins can switch the default to starting meetings with it off.\nAsk Gemini in Meet is only available on the desktop for now, and it only works during meetings held in English. Google says support for additional languages is coming soon. Over the coming weeks it’s being rolled out to Google Workspace Enterprise Plus, Enterprise (Standard), Business Plus, and Business Standard customers first. In Q1 of 2026, Google plans to also make it available to Workspace Business Starter, Enterprise Standard, and Enterprise Plus customers once the company has “collected and applied critical user feedback to improve the feature.”\nGoogle cautions that “Gemini in Workspace can make mistakes, including about people, so users should review its output.” Using it to catch up on missed parts of a meeting is useful, but it’s potentially worth your time to go back and review those parts yourself after it’s over.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d81ef59a5fed591e0b4a68fc8d33b878d7647839",
      "title": "Spain arrests 19 on suspicion of torture and murder after 50 disappear from migrant boat",
      "url": "https://www.bbc.com/news/articles/c8jm11lmx71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T19:27:19.000Z",
      "summary_90w": "",
      "raw": "Police suspect some of the victims were accused of witchcraft by others on the boat that had travelled from Senegal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "103dc233ef6bc61daa4ead3e0dd873b0b5a66608",
      "title": "Vintage port, a menu in French and 1,452 pieces of cutlery - a glimpse of the state banquet",
      "url": "https://www.bbc.com/news/articles/cn4l13gxy2lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T19:10:08.000Z",
      "summary_90w": "",
      "raw": "Chicken and a special cocktail are being served, while Rupert Murdoch and Tim Cook are among the guests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83e4973e9058544954cd5f781c60e18432aa123c",
      "title": "Israeli tanks push into major Gaza City residential area",
      "url": "https://www.bbc.com/news/articles/c4gv881exj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T18:52:53.000Z",
      "summary_90w": "",
      "raw": "The sight of tanks in Sheikh Radwan has caused widespread alarm among residents, with thousands fleeing south.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67d7b1777bbe552286ec4c34882da146bec2389b",
      "title": "Russia gives Ukrainian kids military training and reeducation, Yale researchers find",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544256/russia-ukraine-war-children-military-training-reeducation-yale",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T18:48:05.000Z",
      "summary_90w": "",
      "raw": "The Yale Humanitarian Research Lab says Russia's network of sites for Ukrainian children is larger than previously thought, and programs includes military training for children as young as 8.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e8027c2d702aa1a5ae709daacc4861fdad3c6d8",
      "title": "UK to explore extraditing Madeleine McCann suspect Christian Brückner",
      "url": "https://www.theguardian.com/uk-news/2025/sep/17/uk-to-explore-extraditing-madeleine-mccann-suspect-christian-bruckner",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T18:44:44.000Z",
      "summary_90w": "",
      "raw": "Met chief Mark Rowley says many questions remain and detectives are liaising with German and Portuguese police\nMark Rowley has said the British police investigation into Madeleine McCann will explore extraditing the German national Christian Brückner to the UK to stand trial over the three-year-old’s disappearance.\nBrückner was released from a German prison on Wednesday after serving a seven-year jail term for the rape of an elderly woman in Praia da Luz, Portugal, in 2005, two years before Madeleine disappeared while on holiday with her family in the same town.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd7481db6b8dc2a173e99e49362051f15ab2e6f8",
      "title": "The iPhone Air’s real breakthrough is its battery",
      "url": "https://techcrunch.com/2025/09/17/the-iphone-airs-real-breakthrough-is-its-battery/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T18:38:13.000Z",
      "summary_90w": "",
      "raw": "Apple's slimmest iPhone uses a \"revolutionary\" battery design that allows the cell to fill more space within the device, boosting overall energy storage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "97a3e4201653248a1b1fab7cac44cda4e6a684fe",
      "title": "The Justice Department sues Maine and Oregon, ratcheting up demands for voter data",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544354/voter-data-lawsuit-oregon-maine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T18:28:05.000Z",
      "summary_90w": "",
      "raw": "The Department of Justice is escalating its demands for sensitive data from voting officials, suing two Democratic-controlled states who have thus far rebuffed the department's requests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8307b2fecbd079e7cecb005e71c5b4e990b6d9cc",
      "title": "Logitech’s Pro X2 Superstrike offers haptic-based clicks and rapid trigger",
      "url": "https://www.theverge.com/news/778722/logitech-pro-x2-superstrike-superlight-wireless-haptics-rapid-trigger-gaming-mouse-pc",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T18:01:00.000Z",
      "summary_90w": "",
      "raw": "I may show up for the Superstrike, not for the rapid trigger, but for this panda color scheme. | Image: Logitech\t\n\nLogitech’s next flagship wireless gaming mouse is ditching mechanical switches for an analog system equipped with haptics actuators to simulate the feeling of a click. The mouse is called the Pro X2 Superstrike, and it’s coming early next year for $179.99.\nThe inductive analog system (which Logitech calls Haptic Inductive Trigger System, or HITS) boasts a small 0.6mm travel per main button. They’re supposed to let players click faster than ever thanks to their low latency — Logitech claims it improves latency by up to 30 milliseconds — plus 10 customizable actuation points, and rapid trigger support.\nRapid trigger is more commonly found in gaming keyboards, but now it’s coming to mice. The simple explanation is that it allows the sensor to reset when you barely lift up on the button, letting it quickly register another input with minimal force. It allows you take action faster than those using mice that lack rapid trigger. This mouse supports five rapid trigger reset points, configurable via G Hub, letting you get super granular with when you want the analog sensor to reset.\nThe Superstrike weighs 65 grams, and features Logitech’s Hero 2 sensor, which is also present in its current lineup of Pro X wireless gaming mice. It supports up to an 8,000Hz polling rate wirelessly via its included Lightspeed USB-A dongle, although it’s only accessible via the G Hub software. I’m generally skeptical of 8,000Hz polling rates since most people’s reaction time isn’t fast enough to warrant it, but I’m curious if it’ll make a noticeable difference in conjunction with the Superstrike’s rapid trigger functionality.\nLogitech is also announcing the Superlight 2C, a more compact version of the Superlight 2 mouse. It’s 10 percent lighter at 51 grams and five percent smaller overall, which could make it a preferred choice among PC gamers whose hands don’t jibe with the size of most gaming mice. Other than its shape, its specs seem identical to the Superlight 2. It’ll be available on October 21st for $159.99.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "860f003028295f38697c2c411f55faaa581c29b1",
      "title": "Americans want AI to stay out of their personal lives",
      "url": "https://www.theverge.com/ai-artificial-intelligence/780184/pew-research-americans-want-ai-out-of-their-personal-lives",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T18:00:28.000Z",
      "summary_90w": "",
      "raw": "A new study from Pew suggests that Americans aren’t particularly optimistic about AI. A full 50 percent of respondents said they were more concerned than excited about the use of AI in their daily lives. That’s down ever so slightly from 52 percent in 2023, but it’s up significantly from 37 percent in 2021. \nAmericans expressed a number of concerns about AI, chief among them that it will negatively impact our ability to think creatively and form meaningful relationships with other people. Just 18 percent believed that AI should play any role at all in dating and matchmaking, with just 3 percent being comfortable with it playing a “big role.” The theme in general was that Americans are okay with AI performing analysis on large data to, say, predict the weather, or find cures for disease, but they wanted it to stay out of their personal lives. Two-thirds of people want it to stay out of their love lives entirely, and 73 percent believe it has no place advising people on their religious beliefs.\nAnother concern was the spread of misinformation. 18 percent of respondents rated misinformation as their number one concern, behind only its negative impact on human abilities and connections. Americans felt that it was very important to be able to identify AI-generated work, but 53 percent said they were not confident in their ability to do so.\nInterestingly, in a reversal of what you’d expect with the emergence of new technologies, it’s actually younger Americans who are more concerned. 57 percent of those under 30 said they were extremely concerned that AI would erode people’s abilities, while only 46 percent of those over 65 said the same.\nBroadly, though, it’s clear that Americans are taking a skeptical eye towards AI. 61 percent said they wanted more control over how AI is used in their daily lives. Unfortunately, 57 percent believe they have little or no control over that.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f05d30ad947189ca2655e99502de2b693ac1aa5",
      "title": "Chimps drinking equivalent of a lager a day in fermented fruit, study finds",
      "url": "https://www.bbc.com/news/articles/cgq4710vendo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T18:00:07.000Z",
      "summary_90w": "",
      "raw": "Scientists say chimps consume the equivalent of a bottle of lager a day from dining on ripe fruit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b832602039ac9e2863016e80cc128ba36c6f5986",
      "title": "The Astro A20 X headset was made for multi-console homes",
      "url": "https://www.theverge.com/news/776006/astro-a20x-headset-switch-ps5-xbox-price-features",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Logitech has announced the Astro A20 X wireless gaming headset, which has a feature that console players might appreciate having: it lets you swap between audio from two platforms, be it an Xbox, Switch, PC, or PS5. It launches October 8th for $179.99.\nThe A20 X ships with a transmitter called the Playsync Base that can receive audio inputs via USB from two platforms. When you press the button on the back of the headset’s right ear cup, a subtle LED light on the transmitter will jump between sources, lit to indicate where your audio is currently coming from.\nThe execution here isn’t too different from what I’ve seen in other — typically pricier — gaming headsets, namely some of Astro’s own. The $399 A50 X and $299 A50 Gen 5 both allow easy audio switching for two consoles (the A50 X also includes video switching via two HDMI-in ports), as do SteelSeries’ $300-ish Arctis Nova Pro Wireless and its $180-ish wired counterpart. All of these solutions make it so you don’t have to leave your chair to swap audio sources. This one just so happens to be the most affordable wireless option that I’ve seen that supports Xbox, PlayStation, Switch, and PC in one model, even if $179.99 still isn’t cheap.\nThe A20 X has other hardware staples we expect to see, like a dedicated two-button rocker for adjusting the game and chat audio (it’s on the opposite ear cup from the volume rocker, so as to avoid confusion). It has a flexible, detachable boom microphone, a mute button, and Bluetooth 5.3 compatibility with phones and other mobile devices. However, its Bluetooth support doesn’t include concurrent wireless connections; it’s one or the other.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae2127435bef8ebaceda554ef5210cd939791bcb",
      "title": "Irish police find child remains in hunt for boy not marked as missing for four years",
      "url": "https://www.theguardian.com/world/2025/sep/17/irish-police-find-child-remains-in-hunt-for-boy-not-marked-as-missing-for-four-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T17:59:18.000Z",
      "summary_90w": "",
      "raw": "Gardaí believe body is that of Daniel Aruebose, whose 2022 disappearance was not noticed by authorities until last month\nIrish police investigating the fate of a boy who disappeared four years ago but was only registered by authorities as missing last month have found the remains of a child on Dublin wasteland.\nGardaí named the missing boy as Daniel Aruebose, who is thought to have vanished in 2022 aged three, after they discovered the remains on Wednesday in the Donabate area of north Dublin.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3f208a090c5b50afab58c1b959a9664f60ad800",
      "title": "The best laptop deals you can get right now",
      "url": "https://www.theverge.com/good-deals/23161948/apple-macbook-lenovo-acer-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T17:30:00.000Z",
      "summary_90w": "",
      "raw": "Razer’s Blade 16 gaming laptop with an Nvidia RTX 5060 GPU is on sale for $1,899 ($400 off). | Photo by Vjeran Pavic / The Verge\t\n\nIf you want a great laptop, you’re going to have to fork over a ton of money, right? Not necessarily. There are dozens of good laptops on the market at various price points. However, it can feel overwhelming to find the right one for your needs (some are better suited for, say, college students, whereas others are ideal for gamers).\nThat’s why we’ve come up with this list of some of the best laptop deals available right now. In addition to the latest discounts, we’ll share each discounted model’s best features (and downsides) to give you more clarity during your shopping journey. And if you need to do more research, you can also check out our guides to the best laptops on the market and the top gaming laptops.\nThe best laptop deals\nApple MacBook deals\nM1 MacBook Air\n2020 MacBook Air with M1 (256GB)\nThe 2020 MacBook Air has been discontinued but remains a great value. It comes outfitted with the company’s original M1 chip in one of three different colors (silver, space gray, and gold).\n\nWhere to Buy:\n\n $649 $599 at Walmart\n\nApple itself no longer sells the 13-inch MacBook Air with M1 — and hasn’t for years — but you can still get this solid laptop for $599.99 ($50 off) at Walmart. The 2020 model is available in one configuration, with 8GB of RAM and 256GB of storage, but it’s still capable at handling basic tasks like a champ, including streaming video, browsing, and dealing with documents. You can also use the M1 MacBook Air for creative work in Photoshop, Final Cut Pro, Logic, and Pixelmator, though you may experience slowdown due to its low 8GB of memory.\nThe laptop’s battery lasted between eight and ten hours when we originally reviewed it, and those figures should be mostly accurate, barring some differences likely caused by operating system updates. In addition to offering great performance for its price, the laptop also comes with other nice-to-have features, including a comfortable keyboard and an excellent trackpad. Just note its 720p webcam isn’t particularly good, so if a high-resolution webcam matters a lot to you, you may want to buy one separately. Also, be aware that, due to the limitations of the M1 chip, you can only use one external display at a time and port selection is also more limited than newer models.\nM2 MacBook Air\n13-inch MacBook Air with M2 (2022)\nThe 2022 MacBook Air is a thin, lightweight device powered by Apple’s M2 chip. The M2 model touts an improved 1080p webcam and a better display than its predecessor while retaining features like long battery life and MagSafe charging.\n\nWhere to Buy:\n\n $799 $699 at Best Buy (16GB RAM, 256GB SSD)\n\nApple’s 13-inch MacBook Air with the M2 chip is a significant leap above the M1 model it succeeded, both in terms of design and performance. The old wedge-shaped look was replaced for a more squared-off design that’s still used by the current-generation MacBook Air. It has a 1080p webcam, which was a welcome improvement given the disappointing camera on the 2020 M1 model. It’s also much lighter and thus more portable as well, yet it retains features like MagSafe charging and Touch ID, as well as a nice display.\nDespite its age, the M2 processor inside of this machine is still powerful enough to handle many tasks, from common ones such as browsing to more complex and creative projects. Compared to newer, pricier models, this one unsurprisingly struggles with gaming. That being said, it’s capable of running Cyberpunk 2077. The entry-level 13-inch MacBook Air with M2 launched with 8GB of RAM, but that configuration became unavailable last year when Apple made 16GB the new standard. \nWhile a well-rounded laptop overall, there is one key area where Apple’s M1 model is better: storage. The base M2 MacBook Air with 256GB of storage is actually slower than its predecessor because it’s stored in a single NAND chip. This was corrected in subsequent MacBook Air models, so the slowdown is unique to M2 machines with 256GB of storage. Also, be aware as well that port selection isn’t great, and the included display notch — which is also found on both the 14- and 16-inch MacBook Pros — can make using the menu bar more challenging until you get used to it. If that doesn’t bother you, however, you can get a configuration with 16GB of RAM, 256GB of storage, an 8-core CPU and GPU for $699 ($100 off) at Best Buy. Alternatively, you can get a 15-inch M2 MacBook Air with 8GB of RAM, a 256GB SSD, and 8-core CPU and 10-core GPU for $1,039.99 ($259 off) at Best Buy. If you need more storage, a 15-inch MacBook Air with 8GB of RAM, a 512GB SSD, and 8-core CPU and 10-core GPU for $1,199.99 ($298 off) at Best Buy.\nM4 MacBook Air\n13-inch Apple MacBook Air 13 (2025, M4)\nThe M4 MacBook Air has a speedy processor, and double the RAM of previous models. It has a thin and light design, all day battery life, and still starts with 256GB of storage. Read our review.\n\nWhere to Buy:\n\n $999 $799.99 at Amazon\n\nThe 13-inch MacBook Air with M4 is Apple’s latest thin and lightweight laptop, and it’s our top pick in The Verge’s guide to the best laptops right now. It’s not a MacBook Pro, but Apple’s M4 processor in the Air is still mighty capable. In our tests, it only throttled under heavy load from creative applications, which is understandable given its fanless design. The machine comes with 16GB of RAM as standard rather than an optional upgrade, but the base configuration still comes with just 256GB of storage, so be mindful of that limitation if you work with a lot of larger files. \nApple hasn’t increased the number of ports on a MacBook Air since reintroducing MagSafe to the M2 model in 2022, but this generation has Thunderbolt 4 ports rather than Thunderbolt 3 for faster file transfer speeds. Another notable addition is the 1080p Center Stage camera from the MacBook Pro, so you’ll stay in frame if you move around on a video call. Battery life should last all day, though your experience will vary depending on how hard you push this machine. \nYou can currently get a configuration of the 13-inch with M4 with 16GB of RAM and 256GB of storage, and a 10-core CPU and GPU for $799 at Amazon and Best Buy. If you need a larger screen, you can get the 15-inch MacBook Air with the same specs for $999 ($200 off) at Amazon, Best Buy, and B&H Photo.\nM4 and M4 Pro MacBook Pro\n14-inch MacBook Pro with M4\nThe entry-level MacBook Pro with M4 starts with 16GB of RAM — double that of its predecessor — and a 512GB SSD for the same starting price of $1,599. It also gets a third USB-C / Thunderbolt 4 port and comes in a space black option.\n\nWhere to Buy:\n\n $1599 $1299 at Amazon\n $1599 $1299 at Best Buy\n $1599 $1399 at B&H Photo\n\n\n14-inch MacBook Pro with M4 Pro\nThe 14-inch MacBook Pro with a 12-core / 16-core M4 Pro chip starts with 24GB of RAM — a 6GB increase over the prior generation. It also has a 512GB SSD, three Thunderbolt 5 USB-C ports, an optional nano-texture display, and a 12-megapixel webcam.\n\nWhere to Buy:\n\n $2499 $1799 at Amazon (24GB RAM, 512GB SSD)\n $2499 $1899 at Best Buy (24GB RAM, 512GB SSD)\n $1999 $1849 at Adorama (24GB RAM, 512GB SSD)\n\n\n16-inch MacBook Pro with M4 Pro\nThe 16-inch MacBook Pro with M4 Pro starts with 24GB of RAM and offers more computing cores (14 for the CPU and 20 for the GPU) compared to the 14-inch model. It also picks up Thunderbolt 5 ports and a 12-megapixel Center Stage camera.\n\nWhere to Buy:\n\n $2499 $2249 at Amazon (24GB RAM, 512GB SSD)\n $2499 $2249 at B&H Photo (24GB RAM, 512GB SSD)\n $2499 $2249 at Best Buy (24GB RAM, 512GB SSD)\n\nThe M4 generation MacBook Pros are Apple’s fastest laptops yet. The 14-inch MacBook Pro with M4 starts with 16GB of RAM and a 512GB SSD, and comes equipped with three Thunderbolt 4 ports, an HDMI port, an SD card slot, and a MagSafe charging port. It can send video to two external displays simultaneously (the previous generation could only handle one) and has an improved 12-megapixel Center Stage camera with better video quality. \nThe M4 MacBook Pro and M4 MacBook Air run on the same chip, but the Pro’s cooling system is better, so it handles resource-intensive tasks (including games) without throttling as easily. The laptop’s 14.2-inch screen is bright (up to 1,600 nits when viewing HDR content), and supports the P3 color gamut, both of which are important to professionals who rely on color accuracy when editing photos and video. The display has a 120Hz refresh rate, so scrolling through webpages or moving windows around should appear smoother than 60Hz screens. In our stress test, which included editing 33-megapixel RAW images and working with a large photo library in Adobe Lightroom, the laptop ran for 12 hours without kicking up the fans or feeling hot to the touch. \nIf you want even more power, you can jump up to the 14-inch MacBook Pro with an M4 Pro processor. It comes with 24GB of RAM, a 512GB SSD, a 12-core CPU, and a 16-core GPU. The M4 Pro MacBook Pro has over twice the memory bandwidth of the base M4 MacBook Pro, so it should perform better across the board. That said, it might be tough to notice the benefits of its extra memory and processing power during casual use, but it will come in handy when you’re pushing the laptop to the limits while video editing or playing games. It has three Thunderbolt 5 ports, and you can use that extra bandwidth with an external SSD with fast transfer speeds, to name an example. You can also get the MacBook Pro with M4 Pro with a 16-inch screen if you’d like to work on a larger display. \nRight now, the 14-inch M4 model with 16GB of RAM, a 512GB SSD and 10-core CPU and 10-core GPU is $1,299 ($400 off) at Amazon and Best Buy. You can get a 14-inch M4 Pro model with 24GB of RAM, a 512GB SSD, 12-core CPU, and 16-core GPU for $1,799 at Amazon and B&H Photo. The 16-inch M4 Pro MacBook Pro with 24GB of RAM, a 512GB SSD, 14-core CPU, and 20-core GPU is currently on sale for $2,249 ($250 off) at Amazon, Best Buy, and B&H Photo. \nMicrosoft Surface deals\nMicrosoft Surface Laptop 7th Edition\nMicrosoft Surface Laptop 7th Edition\nThe 13.8-inch Surface Laptop is Microsoft’s closest rival to the MacBook Air, using Qualcomm’s Snapdragon X chipsets for exceptional battery life.\n\nWhere to Buy:\n\n $1199.99 $888.86 at B&H Photo (X Plus, 16GB RAM, 512 SSD)\n $1399.99 $1019.99 at Amazon Buy (X Elite, 16GB RAM, 512 SSD)\n\nWe chose Microsoft’s 7th Edition Surface Laptop as one of the best laptops you can get because it’s the top Snapdragon Copilot Plus PC we’ve tried yet. The laptop runs on a power-efficient ARM processor that doesn’t skimp on performance. Its 13.8-inch 2,304 x 1,536 120Hz screen supports Dolby Vision HDR (High Dynamic Range) and looks very nice. It has a large, precision haptic trackpad that gives you plenty of room to tap and swipe, an offers satisfying feedback no matter where you press it. \nThe laptop has a pair of USB 4 ports, one USB-A 3.1 Gen 1 port, plus a headphone jack. One of the concerns of using an ARM-based Windows PC has been software compatibility, but this model proves that’s no longer something to be as worried about. It runs Photoshop, and apps compiled for X86 processors work thanks to Microsoft’s Prism emulator. Be sure to check the compatibility of the specific Windows app you rely, though, as there’s still a chance they won’t work as intended. \nEven after our toughest tests, the battery lasted seven hours. That’s with 100 percent screen brightness, after downloading multiple Steam games, attending video calls, and running through multiple projects in Photoshop. Using the laptop with less power-hungry apps, including Slack, WhatsApp, Discord, and Chrome, the laptop used just 30 percent of its battery in seven hours. For the best battery life, you’ll want to stick to using native ARM apps when possible. If you want to make the switch to an ARM-based laptop to get some of the benefits MacBook users have had for years, the 7th Generation Surface Laptop is worth checking out.\nYou can get a 13.8-inch Microsoft Surface Laptop (7th Edition) with a Snapdragon X Plus processor, 16GB of RAM and 512GB SSD for around $888.86 ($211 off) at B&H Photo. A model with the Snapdragon X Elite processor, 16GB of RAM, and a 512GB SSD is on sale for $1,019.99 ($380 off) at Amazon.\nAsus laptop deals\nAsus Zenbook S 16\nAsus Zenbook S 16\nThe Asus Zenbook S 16 features AMD’s Ryzen AI mobile processors. It’s one of the thinnest and lightest 16-inch laptops available and doesn’t cut corners on performance. It’s a mighty machine that can handle all sorts of heavy workloads with ease and grace.\n\nWhere to Buy:\n\n $1799.99 $1399.99 at Asus\n\nWe chose Asus’ Zenbook S 16 as another one of our top recommendations for students, but it’s a solid laptop for anyone who wants a large-screened Windows laptop. In our tests, the 16-inch 120Hz 3K (2,880 x 1,800) OLED display emits vivid colors and excellent contrast. The laptop was more than capable of handling common tasks, including video chats using its 1080p webcam, music streaming, but its graphics and gaming performance is what really sets it apart from laptops in its size and price classes. \nThis machine runs Cyberpunk 2077 at around 77 frames per second with the resolution set to 1080p with AMD’s FSR 2.1 upscaling software turned on. The laptop isn’t designed for gaming, but it’s good to know it’s up to the task if you’re willing to turn down some graphical settings. The Zenbook S 16’s battery lasted 11 hours during our testing. However, the percentage indicator in the Windows taskbar would often fluctuate, making it difficult to pin down exactly how much juice was left. \nYou can get a configuration of the laptop with 32GB of RAM, 1TB of storage, and an AMD Ryzen AI 9 HX 370 processor for $1,399.99 ($400 off) from Asus.\nThe best Lenovo laptop deals\nLenovo Yoga Book 9i (2024)\nLenovo Yoga Book 9i (2024)\nThe Lenovo Yoga Book 9i is a dual-screen laptop that can fold and flip into several different modes. A Bluetooth keyboard, mouse, and stylus come with it, along with a keyboard folio that can transform into a laptop stand. It’s the Swiss Army knife of laptops. Read our head-to-head review.\n\nWhere to Buy:\n\n $1999.99 $1499.99 at Best Buy\n\nA dual-screen laptop is admittedly pretty niche, but we chose Lenovo’s Yoga Book 9i is the best of the bunch in our best laptops guide. It runs on Intel’s Core Ultra 7 155U processor, and comes with 16GB of RAM, a 1TB SSD, and integrated Intel UHD graphics chip. Its key feature is the pair of 13.3-inch 60Hz OLED touchscreen displays, which each have a 2880 x 1800 resolution. The screens have a clamshell design and are attached by a hinge, so the Yoga Book 9i looks like a typical laptop when opened.\nYou can use the laptop in a few configurations. In clamshell mode, the bottom screen displays a full-sized virtual keyboard with trackpad to give you a traditional laptop experience. Our experience in this mode was mixed because it’s too easy to accidentally minimize apps, or make typos if you’re used to the tactile feel of a physical keyboard. \nYou can attach the Yoga Book 9i to the included keyboard folio, which props it up and allows you to use both screens independently like a laptop attached to an external monitor (except, in the Yoga Book 9i’s case, they’re built-in). One screen can be folded completely over the other display to use the laptop like a large-screen tablet, or folded partially to prop one screen up if you want to watch a movie at a more comfortable angle. \nDuring our testing, the Yoga Book 9i was difficult to use on a lap with the included Bluetooth keyboard because it would shift around while being used. However, moving apps from one display to another using touch gestures was intuitive thanks to tutorials in the User Center app, which immediately launch upon the first boot. The software also lets you enable and disable gestures, if you find some confusing or unnecessary. Switching from a traditional laptop to a dual-screen model will likely take an adjustment period, so it’s very helpful that Lenovo designed software to help ease you through the transition.\nDespite having two screens, the Yoga Book 9i only weighs 2.95 pounds, which was light enough to carry in a backpack without weighing us down. The keyboard folio adds some bulk, but comes with an attached elastic band to keep the laptop and accessory from getting detached while you travel. If you’re dedicated to the dual-screen lifestyle, or you want to give it a try, the Lenovo Yoga Book 9i is on sale for $1499.99 ($500 off) at Best Buy.\nThe best Razer deals \nRazer Blade 16 (2025, RTX 5090)\n\nWhere to Buy:\n\n $2399.99 $1899.99 at Razer (RTX 5060)\n $2799.99 $2199.99 at Razer (RTX 5070)\n $3499.99 at Razer (RTX 5080)\n\nThe Razer Blade 16 is one of our favorite 16-inch gaming laptops, and multiple configurations of the machine are currently on sale. Every 2025 model has a 16-inch OLED display with a 240Hz refresh rate and a 2560 x 1600 resolution. From there you can choose a machine with the mix of CPU, GPU, RAM, and storage options that’s right for your budget. However, only two models of the Razer Blade 16 are currently on sale. \nThe first is its entry-level configuration with an AMD Ryzen AI 9 365 processor, Nvidia’s RTX 5060 graphics card with 8GB of video memory, 16GB of RAM, and a 1TB SSD, which you can get for $1,899.99 ($500 off) from Razer. For a more powerful option with an RTX 5070 graphics card, 32GB of RAM, and a 1TB SSD, that’s $2,199.99 ($600 off) now from Razer. Power differences aside, both laptops are equipped with three USB 3.2 Gen 2 Type A ports, two USB4 ports, a UHS-II SD card reader, HDMI 2.1 port, 3.5mm headphone jack, and proprietary charging port.\nWe tested the highest-end configuration of the laptop, which has an Nvidia RTX 5090 GPU. However, since it’s $4,999 and not currently discounted, we recommend the much more affordable configurations to anyone who wants to play PC games on the go. One of the typical tradeoffs when getting a high-end gaming laptop is thickness and weight, but the Razer Blade 16 is surprisingly slender at 4.6 pounds and .69 inches thick at its thickest point.  \nRazer even managed to fit in a 1080p webcam that looks good and six-speaker audio system into the laptop’s thin chassis. Non-gaming features, like the Razer Blade 16’s large trackpad and keyboard were a cut above what we’d expect from a gaming laptop.\nThe laptop’s battery lasted about an hour and a half playing Cyberpunk 2077 and around two hours when playing Elden Ring, so you’ll be able to play games for a bit without plugging it in. However, we needed to turn down both game’s graphics settings to achieve that longevity. We also tested the Razer Blade 16 for creative tasks, and lightly editing roughly 1,000 images in Adobe Lightroom, which took about an hour and drained 25 percent of the laptop’s battery. Read our review.\nThe best HP laptop deals\nHP Victus 15 (2025, RTX 4050)\nThe Victus 15 is a popular, budget-friendly gaming laptop that now comes with RTX 4050 graphics, more RAM, and an improved 144Hz screen.\n\nWhere to Buy:\n\n $1049.99 $699 at Walmart (Intel)\n\nHP’s Victus 15 is our top pick for a budget-friendly gaming laptop, and a good choice if you want a laptop with a little more graphical oomph for well under $1,000 on sale.  It’s powered by an Intel Core i5-1342H processor and has 16GB of RAM and a 512GB SSD. It has an 144Hz 1080p screen and Nvidia RTX 4050 graphics card with 6GB of dedicated video memory, which shine when playing live service games like Minecraft and Fortnite. You should also be able to play more graphically-demanding games at lower graphics settings. HP equipped the laptop with an HDMI port, one USB-C port, two USB-A ports, an ethernet port, and a headphone jack.\nThe laptop doesn’t have a touchscreen, and our reviewer wasn’t a fan of its display’s 16:9 aspect ratio (it’s easy to get spoiled with 16:10 these days), but its negative qualities are easier to accept when the laptop is $699 ($350 off) at Walmart. Having a machine with a respectable dedicated GPU along for under $700 is impressive. The laptop is also capable of handling day-to-day tasks like streaming videos, putting together slideshows, spreadsheets, and documents, and video chatting with friends and colleagues. \nUpdate, September 17th: Updated pricing and availability, and added deals for HP’s Victus 15 and multiple configurations of Razer’s Blade 16.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a8635a63f0e3b62ad2eb3f1a13c45a547274914",
      "title": "What does Donald Trump want from his UK state visit?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m3dxrk?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T17:19:00.000Z",
      "summary_90w": "",
      "raw": "And the row over free speech after Charlie Kirk’s assassination",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd1e39076407c7f89afc5ae437d3a785f6d97ae4",
      "title": "Garmin’s Venu 4 adds an LED flashlight and accessibility upgrades",
      "url": "https://www.theverge.com/news/780138/garmin-venu-4-smartwatch-accessibility-flashlight-color-blindness",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T17:08:12.000Z",
      "summary_90w": "",
      "raw": "Garmin’s Venu 4 has up to 12 days of battery life in smartwatch mode. | Image: Garmin\t\n\nGarmin is launching its Venu 4 smartwatch today, expanding on the accessibility and sleep tracking features introduced with the Venu 3 two years ago. It’s available now in 41mm and 45mm models and starts at $549.99 which is $100 more expensive than the Venu 3.\nFollowing the Venu 3’s introduction of nap tracking the Venu 4 is expanding its sleep tracking by keeping tabs on how consistent your bedtime over the past seven days has been. It can track when health metrics like heart rate, skin temperature, and respiration are outside their typical range while you sleep, potentially indicating elevated stress levels or illness. The Venu 4 can also log lifestyle behaviors like caffeine and alcohol consumption and provide insights into how they may be affecting your sleep and heart rate.\nThe new Garmin Fitness Coach will generate personalized workouts for 25 different activities like cycling, walking, rowing, or a mix of several exercises, based on your past daily activity, your recovery level, and the quality of your recent sleep.\nGarmin introduced a wheelchair mode for the first time with the Venu 3 that counted pushes and added movement reminders. Accessibility is being further expanded with the Venu 4, letting it read aloud the time and health data displayed on its watch face. Color filters have also been added, including grayscale, red/green, green/red, and blue/yellow options, to improve the readability of the Venu 4’s screen for users with color blindness.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c90d63cd380460fc753b486f1db18ebd699414c1",
      "title": "You can soon attend Zoom meetings as your AI avatar",
      "url": "https://www.theverge.com/news/779154/zoom-ai-photorealistic-avatars-live-translation",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Zoom’s vision of filling meetings with AI clones has nearly arrived. On Wednesday, the video conferencing app announced that you’ll soon be able to create a “photorealistic” avatar of yourself in case you aren’t “camera-ready.” That means your AI avatar can appear polished if you’ve just crawled out of bed.\nZoom plans on launching this feature to Workplace users in December, allowing you to generate an AI lookalike based on a photo of yourself that you upload or capture directly in the app. Once Zoom generates your avatar, you’ll be able to “dress” it in different professional outfits. It will track your movement during the meeting as you talk or move around your screen in real life.\nWhile Zoom started letting users deliver prerecorded messages with an AI avatar last year, this takes things further by allowing you to pose as an AI clone in meetings. During an interview on Decoder in June 2024, Zoom CEO Eric Yuan hinted at a future where everyone has a “digital twin,” or an AI agent that uses your likeness to perform tasks and make decisions on your behalf, like attending meetings and automatically answering emails. Zoom may not be quite there yet, but it’s getting closer.\nZoom plans on rolling out some safeguards with its photorealistic avatars feature, which means you shouldn’t be able to attend your meetings as Keanu Reeves. Smita Hashim, Zoom’s chief product officer, tells The Verge that the platform will use “live camera authentication” to ensure that you’re the person in the image you’ve uploaded. Zoom will also include “in-meeting tile notices” that indicate you’re using an AI avatar. “This feature remains in development, and specific enrollment and authentication processes may change before general availability,” Hashim said.\nAlong with photorealistic AI avatars, Zoom is launching some other updates to the platform, including real-time voice translation. When the update is released in December, it will use AI to translate what a speaker is saying in real time, allowing participants to hear the speaker talk in the language of their choice. The feature currently supports English, German, Chinese, French, Spanish, Arabic, Japanese, Portuguese, and Italian.\nZoom is also releasing a new version of its AI assistant, which can do things like schedule meetings for you and create video clips. This month, Zoom will give users the ability to “bring” the assistant to in-person meetings and conferences on other platforms like Microsoft Teams and Google Meet, where it can take notes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "035ccecf380c2504c70cc27766800299588f2459",
      "title": "Zoom launches a cross application AI notetaker, AI avatars and more in its latest update",
      "url": "https://techcrunch.com/2025/09/17/zoom-launches-a-cross-application-ai-notetaker-ai-avatars-and-more-in-its-latest-update/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Zoom is launching new tools for its meeting and productivity platform including new AI avatars that would resemble users.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5b73a67210b398f390957445fbea8e6de4488d0",
      "title": "Ozzy Osbourne documentary pulled from schedules will now be shown in October",
      "url": "https://www.bbc.com/news/articles/cn836401g0qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T16:51:01.000Z",
      "summary_90w": "",
      "raw": "The documentary about the rock legend was pulled from the schedules at the last minute a month ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d052286cd91b88227f160805a7beb694a1fe7d51",
      "title": "Jaguar Land Rover supply chain staff told to apply for universal credit, union claims",
      "url": "https://www.bbc.com/news/articles/c784nwvj1l3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T16:50:02.000Z",
      "summary_90w": "",
      "raw": "Staff are being laid off with \"reduced or zero pay\" following a cyber attack, which has forced the carmaker to shut down, Unite union claims.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b77765e103c4300df7e9ef4c4a0f719e985bbd6",
      "title": "Jaguar Land Rover to pause production for third week due to cyberattack ",
      "url": "https://techcrunch.com/2025/09/17/jaguar-land-rover-to-pause-production-for-third-week-due-to-cyberattack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:44:14.000Z",
      "summary_90w": "",
      "raw": "The company owned by Tata Motors is estimated to be losing millions of pounds a week due to the shutdown.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "263e597b397a6395b6e68d20fd063e0a1e5e033c",
      "title": "Scotland's not proven verdict to be scrapped as MSPs back reforms",
      "url": "https://www.bbc.com/news/articles/cy8rndyyp7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T16:41:11.000Z",
      "summary_90w": "",
      "raw": "The verdict has been used in criminal trials for hundreds of years but campaigners had called for it to be abolished.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49e11e4d6ce8a3e20db6d25ae53fe66ae45562f5",
      "title": "Airbuds is the music social network Apple and Spotify wish they had built",
      "url": "https://techcrunch.com/2025/09/17/airbuds-is-the-music-social-network-apple-and-spotify-wish-they-had-built/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:36:38.000Z",
      "summary_90w": "",
      "raw": "Airbuds, a music social app aimed at Gen Z, raises $5M as the app reaches 5 million monthly users.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ebc52b2e7fa6d2f7762e3483cfd5cbebb946281",
      "title": "Precious gold samples stolen in raid on French natural history museum",
      "url": "https://www.theguardian.com/world/2025/sep/17/precious-gold-samples-stolen-france-natural-history-museum",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:33:44.000Z",
      "summary_90w": "",
      "raw": "Museum says specimens taken are worth €600,000 based on price of gold but have ‘immeasurable heritage value’\nHistoric gold samples with a street value of €600,000 but priceless to scientists and researchers have been stolen from the French national natural history museum in the latest of a series of museum robberies in France.\n“This has happened in a critical context for cultural establishments in France, particularly museums,” the Paris museum said. “Several public collections have been the victims of robberies in the past months.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a590a97c6e9f5ed679e048b15b33b134c546162",
      "title": "UN warns of ‘grave’ concerns for fuel and food in famine-hit northern Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:30:57.000Z",
      "summary_90w": "",
      "raw": "Food and supplies running out in northern Gaza after Israel closed only crossing, UN says. This live blog is closed\nThe Israeli army said it has struck more than 150 targets in Gaza City since launching a major ground offensive on the Gaza Strip’s main urban hub early on Tuesday.\n“Over the past two days, the [Israeli air force] and artillery corps troops struck over 150 terror targets throughout Gaza City in support of the manoeuvring troops in the area,” the military said in a statement issued on Wednesday, reports Agence France-Presse (AFP).\nNo one can fail to be distressed by the devastating impact the war has had on the children of Gaza, and I cannot imagine the fear and anguish their families have endured. It is a soul-destroying situation that compels us to act.\nEvery child deserves the chance to heal, to play, to simply be able to dream again. These young patients have witnessed horrors no child should ever see, but this marks the start of their journey towards recovery.\nIn Gaza, where the healthcare system has been decimated and hospitals are no longer functioning, there are severely ill children unable to get the medical care they need to survive.\nAs we welcome the first group of children to the UK for urgent treatment, their arrival reflects our determined commitment to humanitarian action and the power of international cooperation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "337740fbbc40f90f1ef677435953162cc83fd0c9",
      "title": "Israel’s culture minister threatens national film awards after Palestinian story takes top prize",
      "url": "https://www.theguardian.com/film/2025/sep/17/israels-culture-minister-threatens-national-film-awards-after-palestinian-story-takes-top-prize",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:20:19.000Z",
      "summary_90w": "",
      "raw": "Miki Zohar says he will cancel funding for the Ophir awards after The Sea, about a 12-year-old Palestinian boy who is denied entry to Tel Aviv, wins best picture\nIsrael’s culture minister, Miki Zohar, has announced that funding for the Ophirs, the country’s national film awards, would be cancelled after The Sea, a film about a 12-year-old Palestinian boy, won the best feature film prize.\nIn a statement on X, translated by Israeli news media, Zohar said: “There is no greater slap in the face of Israeli citizens than the embarrassing and detached annual Ophir awards ceremony. Starting with the 2026 budget, this pathetic ceremony will no longer be funded by taxpayers’ money. Under my watch, Israeli citizens will not pay from their pockets for a ceremony that spits in the faces of our heroic soldiers.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c20334a4046cd566363ec8bd46520f0bfda45dfa",
      "title": "Israeli minister attacks EU’s proposed ‘morally, politically distorted’ sanctions – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:11:58.000Z",
      "summary_90w": "",
      "raw": "Gideon Saar warns any action against his country ‘will receive an appropriate response’. This live blog is closed\nNordic correspondent\nDenmark is for the first time to buy long-range precision weapons such as missiles and drones, Mette Frederiksen has abruptly announced, as she warned “Russia is testing us”.\nThere is no doubt that Russia will be a threat to Denmark and Europe for many years to come.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca344b2536e95e77ea497040d25808019ddd3fbf",
      "title": "How Charlie Kirk became a leader of the conservative youth movement",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544168/how-charlie-kirk-became-a-leader-of-the-conservative-youth-movement",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T16:06:37.000Z",
      "summary_90w": "",
      "raw": "New York Times reporter Robert Draper explains Kirk's rise and legacy. He was killed Sept. 10. Draper also discusses conservative commentator Nick Fuentes, a rival of Kirk's with a large following.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4f039673c45cdd270920a086143ecd10779d38a",
      "title": "IDF tries to force civilians out of Gaza City as ground offensive continues",
      "url": "https://www.theguardian.com/world/2025/sep/17/idf-try-to-force-civilians-out-of-gaza-city-as-ground-offensive-continues",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:06:04.000Z",
      "summary_90w": "",
      "raw": "Two army divisions work their way towards centre of Gaza City as further Israeli airstrikes destroy buildings\nIsraeli troops pressed ahead with a ground offensive into Gaza City on Wednesday, making further efforts to force more people to flee their homes and travel to overcrowded and unsafe areas in the south of the devastated territory.\nThe Israel Defense Forces (IDF) said on Wednesday they had carried out 150 air and artillery strikes ahead of the ground operation that began early on Tuesday morning.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49b2f92b31839efc32952481a218b025efa20554",
      "title": "Nvidia boss says UK will be 'AI superpower' as tech firms invest billions",
      "url": "https://www.bbc.com/news/articles/c7016ljre03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T16:00:11.000Z",
      "summary_90w": "",
      "raw": "Microsoft, Google and Nvidia have announced investments as part of a £31bn UK-US \"Tech Prosperity Deal\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b223613576f8d5f13109e9fe994ddb58d54832c",
      "title": "AI and the Future of Defense: Mach Industries’ Ethan Thornton at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/17/the-new-face-of-defense-tech-takes-the-ai-stage-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Ethan Thornton, CEO of Mach Industries, joins the AI Stage at TechCrunch Disrupt 2025 (Oct. 27–29, San Francisco) to discuss how AI is transforming defense — from autonomous weapons to decentralized strategy. Register now and save up to $650 before rates increase.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bea2d577f1862a70392224d7b17da64659c47e9",
      "title": "Google revamps Discover page to show content from creators",
      "url": "https://techcrunch.com/2025/09/17/google-revamps-discover-page-to-show-content-from-creators/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google will now let you follow publishers and creators directly through its Search app's Discover page.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf5ce48046e3ccd0ff423bfc711816bc9a3371a2",
      "title": "Ousted CDC director testifies she was fired for resisting pressure from RFK Jr.",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/17/nx-s1-5544143/cdc-director-susan-monarez-testimony-rfk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T15:55:43.000Z",
      "summary_90w": "",
      "raw": "Susan Monarez says RFK Jr. told her to commit to decisions in advance, without reviewing evidence and to dismiss vaccine experts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca46045d4c3d3e3c7e3b763b8e7c0b0efe64ce78",
      "title": "Tennessee's governor welcomed the National Guard. Illinois' JB Pritzker is a hard no.",
      "url": "https://www.npr.org/2025/09/17/g-s1-89190/jb-pritzker-tenessee-memphis-national-guard",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T15:43:16.000Z",
      "summary_90w": "",
      "raw": "Trump on Monday said he planned to send National Guard troops to Memphis. The news gives fresh relevance to NPR's recent interview with Illinois Gov. JB Pritzker, who declined to ask for the military.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1461ff75d371c21d52ec5b3f2f80dc734c9eb23",
      "title": "Major Scottish gangland figures arrested in Dubai",
      "url": "https://www.bbc.com/news/articles/ckged73p340o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T15:25:56.000Z",
      "summary_90w": "",
      "raw": "Steven Lyons, Ross McGill, Stephen Jamieson and Steven Larwood were taken into custody following a co-ordinated operation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c0869d7de46cc81e1332783a02f9f282d98fa96",
      "title": "AI can forecast your future health – just like the weather",
      "url": "https://www.bbc.com/news/articles/cx2pj502ev6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T15:19:58.000Z",
      "summary_90w": "",
      "raw": "An artificial intelligence model can predict the risk of more than 1,000 diseases, a team of scientists say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c0869d7de46cc81e1332783a02f9f282d98fa96",
      "title": "AI can predict people's health problems, scientists say",
      "url": "https://www.bbc.com/news/articles/cx2pj502ev6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T15:19:58.000Z",
      "summary_90w": "",
      "raw": "An artificial intelligence model can predict the risk of more than 1,000 diseases, a team of scientists say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "81c202905c91a7d2e2a3271a5b1dd4a2c5332bc5",
      "title": "How the EU’s far right has seized on Charlie Kirk’s killing",
      "url": "https://www.theguardian.com/world/2025/sep/17/how-the-eus-far-right-has-seized-on-charlie-kirks-killing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T15:09:29.000Z",
      "summary_90w": "",
      "raw": "Leaders from Orbán to Le Pen have framed the shooting as evidence of persecution – a strategy that experts say could further normalise extremism across the continent\n• Don’t get This Is Europe delivered to your inbox? Sign up here\nBefore his fatal shooting, few if any of the leaders of Europe’s resurgent far right had so much as mentioned the name of Charlie Kirk. Since last week, the propaganda potential of the conservative US activist’s killing has escaped none of them.\nKirk, a rising star of Donald Trump’s Maga movement, was hit in the neck by a single bullet as he addressed students in Utah on 10 September. A 22-year-old suspect, Tyler Robinson, has been charged, but his alleged motives remain unclear.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d29af5ed1b78a8641218a01f27ebbc800461feb3",
      "title": "When Ziggy’s bond was withheld after eviction without cause from his Sydney rental, he challenged it – and won",
      "url": "https://www.theguardian.com/australia-news/2025/sep/18/sydney-rental-bond-withheld-after-eviction-without-cause-tenant-challenged-it-won",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T15:00:19.000Z",
      "summary_90w": "",
      "raw": "Advocates say it should be easier to dispute bond claims, as tenants in Australia’s toughest rental markets are increasingly losing their deposits\n\nGet our breaking news email, free app or daily news podcast\n\nZiggy Tow and his housemates thought they had had enough trouble after their property manager evicted them without grounds and listed their inner-Sydney home for an extra $300 a week.\nThen the property manager claimed back all of the $3,400 they paid in bond to cover cleaning and repair fees.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f2d6bfbf2f81fb1eb4082d0610cd72b47e0f9394",
      "title": "Labor’s 2035 emissions target a ‘sliding doors’ moment for future generations",
      "url": "https://www.theguardian.com/australia-news/2025/sep/18/labors-2035-emissions-target-a-sliding-doors-moment-as-global-heating-goal-hangs-by-a-thread",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T15:00:17.000Z",
      "summary_90w": "",
      "raw": "Australia must lead other nations in committing to 1.5C pathway for safety, security, prosperity and the environment, experts say\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nLeading climate advocates have warned the Australian government’s decision on a 2035 emissions reduction will be a historic “sliding doors moment” for the country, with an international goal to keep global heating to 1.5C now hanging by a thread.\nThe prime minister, Anthony Albanese, is expected to announce a target range on Thursday after a scheduled morning cabinet meeting before formally submitting it to the UN later this month.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9319e21a375fe1cf7b00b3bd246f21f8303bc37",
      "title": "EU proposes curbs on trade with Israel over Gaza war",
      "url": "https://www.bbc.com/news/articles/cvgr4nj7405o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T15:00:04.000Z",
      "summary_90w": "",
      "raw": "Despite the forceful language, the measures appear unlikely to pass and have been condemned by Israel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "deb3b5d38783a44ad6142ab004ec7066a639f3b0",
      "title": "Search for ancient Egyptian gold bracelet missing from Cairo museum",
      "url": "https://www.bbc.com/news/articles/cn4l1w98nj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T14:59:42.000Z",
      "summary_90w": "",
      "raw": "A photo of the 3,000-year-old bracelet has been sent to airports, seaports and border crossings to stop it being smuggled out of the country.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00f841983b60d13cc3fea511172010ce5f5a000d",
      "title": "Obama says US faces 'political crisis' after killing of Charlie Kirk",
      "url": "https://www.bbc.com/news/articles/c9dxge2ep4xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T14:57:35.000Z",
      "summary_90w": "",
      "raw": "The former president criticised the response to the shooting by President Trump, who has vowed to tackle \"radical leftists\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f56736ee516d624fd0e003d0614f6853e246624f",
      "title": "From Startup Battlefield to the Disrupt Stage: Discord founder Jason Citron returns to TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/17/from-startup-battlefield-200-to-the-disrupt-stage-discord-founder-jason-citron-returns-to-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:30:00.000Z",
      "summary_90w": "",
      "raw": "From Startup Battlefield in 2013 to the Disrupt Stage in 2018: Discord founder Jason Citron returns to TechCrunch Disrupt 2025 in San Francisco on October 27-29. Register here to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a8fc79105c2876fdeb7b88e4958ac7f52e027e5",
      "title": "Amazon launches AI agent to help sellers complete tasks and manage their businesses",
      "url": "https://techcrunch.com/2025/09/17/amazon-launches-ai-agent-to-help-sellers-complete-tasks-and-manage-their-businesses/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:18:50.000Z",
      "summary_90w": "",
      "raw": "The company is updating Seller Assistant, its AI tool for third-party sellers, to help handle tasks on the seller's behalf.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3a326535f4b00b6509ce3f29ad269e8e6aecfe61",
      "title": "VC firm Insight Partners says thousands of staff and limited partners had personal data stolen in a ransomware attack",
      "url": "https://techcrunch.com/2025/09/17/vc-giant-insight-partners-notifies-staff-and-limited-partners-after-data-breach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:05:07.000Z",
      "summary_90w": "",
      "raw": "The venture capital giant, behind cyber giants Wiz and Databricks, notified current and former employees, as well as the firm's limited partners, that their data was stolen in a January cyberattack.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e1496f47e3e208f6f929ae572e8ddb2dce516914",
      "title": "Lovable co-founder and CEO Anton Osika on building one of the fastest-growing startups in history at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/17/lovable-ceo-anton-osika-on-building-one-of-the-fastest-growing-startups-in-history-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Lovable has quickly become one of the most talked-about startups of the year, breaking records and making headlines as one of the fastest-growing software companies in history. Co-founder and CEO Anton Osika will take the Disrupt Stage to discuss \"Lovable and the Future of Consumer Tech.\" Register here to save your seat.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7deb466c33f679361aecb9ffcfb0fef725a3f649",
      "title": "A court blocked a migrant being returned to France - how much of a setback is this for No 10?",
      "url": "https://www.bbc.com/news/articles/ced5gyg2e09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T13:45:57.000Z",
      "summary_90w": "",
      "raw": "The temporary decision by a High Court judge shows how complicated deportation or removal plans can be.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d227bd36842a416f0969b77e0e45c4737987e29",
      "title": "Terra Oleo’s oil-producing microbes could replace destructive palm oil plantations",
      "url": "https://techcrunch.com/2025/09/17/terra-oleos-tiny-oil-producing-microbes-might-replace-sprawling-palm-oil-plantations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T13:10:00.000Z",
      "summary_90w": "",
      "raw": "Terra Oleo had operated in stealth for years, developing yeast strains capable of producing high-value oils that don't need refining. It has raised $3.1 million.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b02b791ae4ce2ccc830a9f4050a535c80106eb3",
      "title": "Lyft and Waymo are partnering to bring robotaxis to Nashville",
      "url": "https://techcrunch.com/2025/09/17/lyft-and-waymo-are-partnering-to-bring-robotaxis-to-nashville/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T13:05:00.000Z",
      "summary_90w": "",
      "raw": "Waymo is tapping an old partner, Lyft, to launch a robotaxi service in Nashville.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa97bbd4adda3f81daeb5229160a160e44af24ee",
      "title": "Icarus raises $6.1M to take on space’s “warehouse work” with embodied-AI robots",
      "url": "https://techcrunch.com/2025/09/17/icarus-raises-6-1m-to-take-on-spaces-warehouse-work-with-embodied-ai-robots/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Icarus Robotics wants to liberate astronauts from time-sucking logistics labor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0acdb1b5357e58a97cd2569b29d8bf9ac71f2b51",
      "title": "Greetings from American University of Beirut, where more than 1,000 cats roam",
      "url": "https://www.npr.org/2025/09/17/g-s1-89071/cats-american-university-beirut-lebanon",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T12:53:08.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c52dcc435dc8294c44b9cdaa21dbc0a90420a1c5",
      "title": "Trucks set ablaze as militants block key Senegal-Mali trade route",
      "url": "https://www.bbc.com/news/articles/c708n1ry8k4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:51:09.000Z",
      "summary_90w": "",
      "raw": "Islamists fighters are trying to prevent deliveries of fuel and other essential supplies to landlocked Mali.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "669ac1cd3d4779e76356f5e7001d277fe3bf6d2e",
      "title": "Navalny's widow says tests show he was poisoned in jail",
      "url": "https://www.bbc.com/news/articles/c5ye0x28vzqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T12:49:38.000Z",
      "summary_90w": "",
      "raw": "Yulia Navalnaya is urging the two laboratories she says found her husband was poisoned to release their findings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "669ac1cd3d4779e76356f5e7001d277fe3bf6d2e",
      "title": "Tests show Navalny was poisoned in jail, his widow says",
      "url": "https://www.bbc.com/news/articles/c5ye0x28vzqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:49:38.000Z",
      "summary_90w": "",
      "raw": "Yulia Navalnaya is urging the two laboratories she says found her husband was poisoned to release their findings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3881366c4be9bd96924917f8cb4cf9b2503fd146",
      "title": "Flying cars crash into each other at Chinese air show",
      "url": "https://www.bbc.com/news/articles/cn5qk4de997o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:34:08.000Z",
      "summary_90w": "",
      "raw": "Footage shared on social media shows burning wreckage on the ground after the mid-air collision.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ee1099489290134fc79364de2ec797b1d7a207a",
      "title": "The Summer I Turned Pretty reaches emotional climax",
      "url": "https://www.bbc.com/news/articles/czewyppr6wxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T11:42:48.000Z",
      "summary_90w": "",
      "raw": "Spoiler warning: The much-anticipated final episode reveals how the talked-about TV show's plot ends.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64521fb1d717a01d2785b63b3639f7e535bd91c4",
      "title": "Nvidia boss 'disappointed' by reported China chip ban",
      "url": "https://www.bbc.com/news/articles/cqxz29pe1v0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T11:23:24.000Z",
      "summary_90w": "",
      "raw": "Jensen Huang said the US needs \"to make sure that that people can access this technology from all over the world\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d55b5f86db748f84aba75d34014b4356b845148",
      "title": "Madeleine McCann suspect freed from German prison",
      "url": "https://www.bbc.com/news/articles/cy4rydzmrmvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T11:03:40.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner has never been charged with any crime in relation to the McCann case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65fc280d11e1065c293242f725473c9e146c58dc",
      "title": "Google Ventures doubles down on dev tool startup Blacksmith just 4 months after its seed round",
      "url": "https://techcrunch.com/2025/09/17/google-ventures-doubles-down-on-dev-tool-startup-blacksmith-just-4-months-after-its-seed-round/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Blacksmith, a Y Combinator alum, raised $10M Series A led by Google Ventures to cut costs and speed up software builds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e6c52d4692f715ff615b67366f487782794eae5",
      "title": "Sonair built its 3D ultrasonic sensor with robotic safety in mind",
      "url": "https://techcrunch.com/2025/09/17/sonair-built-its-3d-ultrasonic-sensor-with-robotic-safety-in-mind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T11:00:00.000Z",
      "summary_90w": "",
      "raw": "The company's sensor uses sonar and echos to give robots more information about their surrounding environment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1027c7cf42166edddad62a2fe94b061ccabe13b2",
      "title": "Gunmen kill 22 after shooting at baptism ceremony in Niger - reports",
      "url": "https://www.bbc.com/news/articles/ce863x3g7jko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T10:58:03.000Z",
      "summary_90w": "",
      "raw": "Niger's army has failed to contain the jihadist insurgency, with dozens killed in recent attacks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fd78b5306bca30f059bffa462eaf2369d7c387a",
      "title": "Timor-Leste scraps plan to buy MPs free cars after protests",
      "url": "https://www.bbc.com/news/articles/cy4ry7vpkdeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T10:30:42.000Z",
      "summary_90w": "",
      "raw": "Demonstrators had burned tyres and set a government vehicle alight, while police responded with tear gas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9546830f1f6af17b4f8a51d2e7b467951104af0b",
      "title": "Ex-Arsenal star Thomas Partey denies rape charges",
      "url": "https://www.bbc.com/news/articles/c2lxe9800dko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T09:42:03.000Z",
      "summary_90w": "",
      "raw": "The 32-year-old footballer was in court accused of raping two women and sexually assaulting another.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "52fc551b8e4847f511dd14b0299cba86c0c646e8",
      "title": "Facing Trump's pressure, the Fed cuts rates for the first time this year",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5539555/federal-reserve-interest-rates-inflation-jobs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Fed lowered interest rates by a quarter percentage point Wednesday in an effort to cushion the sagging job market. The move comes as policymakers face growing pressure from President Trump.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d126c1b5da42cc4bd45e152153e87422efbffc7b",
      "title": "Latest blow to Labor’s Pacific defence strategy might not be the embarrassment the Coalition claims",
      "url": "https://www.theguardian.com/world/2025/sep/17/png-australia-defence-treaty-delay-blow-for-anthony-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T08:41:03.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese must now save the defence agreement with Papua New Guinea, a week after a similar plan with Vanuatu was delayed\n\nGet our breaking news email, free app or daily news podcast\n\nWhen Anthony Albanese landed in Papua New Guinea for celebrations marking 50 years of independence this week, he was expecting to sign a landmark mutual defence agreement and designate the one-time colony as a formal ally of Australia.\nInstead, despite insisting the text of the agreement had been approved, the prime minister left Port Moresby on Wednesday with only a 300-word joint communique signed with his counterpart, James Marape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38056bd4d90f869606c627ea9136c71651370725",
      "title": "US tennis star sorry for 'offensive' comments on Chinese food",
      "url": "https://www.bbc.com/news/articles/cx270m57zm7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T06:53:25.000Z",
      "summary_90w": "",
      "raw": "She described the turtle and frog dishes as \"crazy\" and \"wild\", causing a social media storm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20b1121d21741fb0485d7bedb999df7a8db46b41",
      "title": "How an American football-loving Brit is trying to crack the 'hardest position in sport'",
      "url": "https://www.bbc.com/sport/american-football/articles/cn825edp1lxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T06:31:03.000Z",
      "summary_90w": "",
      "raw": "Sam Fenton is the first British quarterback to earn a spot in a Division One college team in the United States.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd0de4a53e9254ca2053bdc21e5409cebb8b1542",
      "title": "Champions League debut and Luiz - the rise of Pafos",
      "url": "https://www.bbc.com/sport/football/articles/cj6x7rrxzedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T06:15:58.000Z",
      "summary_90w": "",
      "raw": "BBC Sport looks at Pafos FC, the team from Cyprus set to make their full Champions League debut with David Luiz in defence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T05:18:36.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "234c150741ced732f897749cbd9d9f327647c0ce",
      "title": "NPR to trim $5 million this year as public radio stations struggle to pay bills",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5539164/npr-public-media-funding-budget",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T04:17:06.000Z",
      "summary_90w": "",
      "raw": "NPR plans to make trims totaling more than $5 million over the course of the coming fiscal year to bring its annual budget into balance. Meanwhile, local stations are asking for more help.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "beef6fa0eb6ca20ac0734bafeefd2cc117576db0",
      "title": "'The hungry can't stay silent' - behind deadly protests in oil-rich Angola",
      "url": "https://www.bbc.com/news/articles/c8ex6k88yy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T02:34:08.000Z",
      "summary_90w": "",
      "raw": "As the 50th independence anniversary approaches the country grapples with poverty and inequality.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35e1f18be2566265a28f6d5206c0cce379ab9109",
      "title": "Syria's worst drought in decades pushes millions to the brink",
      "url": "https://www.bbc.com/news/articles/c70x500lkdno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T01:44:40.000Z",
      "summary_90w": "",
      "raw": "The drought has slashed wheat harvests by 40% in a country where nearly 90% of the population already lives in poverty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98eed288986f3bb0ea338603fd7ad567a62ed5e6",
      "title": "Rocks on train tracks strand 900 Machu Picchu tourists amid protest",
      "url": "https://www.theguardian.com/world/2025/sep/17/rocks-on-train-tracks-strand-900-machu-picchu-tourists-amid-protest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T01:31:30.000Z",
      "summary_90w": "",
      "raw": "About 1,400 visitors were evacuated but hundreds were left stuck because of action linked to bus contract dispute, say Peru authorities\nAt least 900 tourists were stranded near the ancient Inca citadel of Machu Picchu on Tuesday, Peru’s tourism minister said, after a passenger train service was suspended due to a protest.\nPeruRail said service was suspended on Monday because the route in Peru’s mountainous Cusco region had been blocked by “rocks of various sizes” as residents clashed with authorities and bus companies. PeruRail’s local unit also said “third parties” had excavated part of its rail route, which affected the track’s stability and slowed down the evacuation of tourists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34a72c5ac071263b0ee85a5790a9345279142b1b",
      "title": "Watch: Key takeaways from Charlie Kirk suspect's first court appearance",
      "url": "https://www.bbc.com/news/videos/cvgj59p3v7po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T00:56:27.000Z",
      "summary_90w": "",
      "raw": "The BBC's Nada Tawfik reports from Utah, where Tyler Robinson appeared in court as prosecutors read the charges against him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66ddf4ad4a469e8cf2d3460200bc8a3d24515951",
      "title": "Anthony Albanese fails to seal defence treaty between Australia and PNG",
      "url": "https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T00:05:39.000Z",
      "summary_90w": "",
      "raw": "Australian PM will leave Port Moresby without agreement, sparking a setback for strategy to minimise China’s influence among Pacific nations\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAnthony Albanese’s strategy of pushing back against China in the Pacific has been dealt another blow, with a major defence treaty with Papua New Guinea delayed amid concerns about sovereignty.\nA deal was expected with the former Australian colony this week but the prime minister is set to leave Port Moresby without signing the so-called Pukpuk mutual defence treaty with his counterpart, James Marape, on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e09d3a0d584629b135c97a335ec264606a48f1e4",
      "title": "‘We’re still in the dark’: a missing land defender and the deadly toll of land conflict on Indigenous people",
      "url": "https://www.theguardian.com/environment/2025/sep/17/missing-land-defender-deadly-toll-land-conflict-indigenous-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T23:01:18.000Z",
      "summary_90w": "",
      "raw": "Julia Chuñil is one of 146 land defenders who were killed or went missing last year, a third of them from Indigenous communities\nOne day last November, Julia Chuñil called for her dog, Cholito, and they set off into the woods around her home to search for lost livestock. The animals returned but Chuñil, who was 72 at the time, and Cholito did not.\nMore than 100 people joined her family in a search lasting weeks in the steep, wet and densely overgrown terrain of Chile’s ancient Valdivian forest. After a month, they even kept an eye on vultures for any grim signs. But they found no trace of Chuñil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c2c136f42b129463e77e7df888ee2279b4ab3e4",
      "title": "Politicians get rich while we suffer - so I helped bring down our government in 48 hours",
      "url": "https://www.bbc.com/news/articles/cvg9n760gddo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T22:11:38.000Z",
      "summary_90w": "",
      "raw": "Gen Z protesters in Nepal tell the BBC of their pride and heartbreak after last week's momentous protests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb6f79e5d26a4e871ae3209f230cb1776100d4a",
      "title": "Trump extends TikTok reprieve as deal nears",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543413/tiktok-trump-ban-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-16T20:10:09.000Z",
      "summary_90w": "",
      "raw": "While legally questionable, the extension comes just as it appears China and the U.S. may finally have a deal on TikTok's fate.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9f92c7011ddc8d533025d3f4c904c9f7e3a22b3",
      "title": "Deal is done to keep TikTok in the US, says Trump",
      "url": "https://www.bbc.com/news/articles/c7847q9xvwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T19:56:54.000Z",
      "summary_90w": "",
      "raw": "The social media platform had faced a ban in the US over national security concerns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe1e673b71a77838042ff8c5b8e526317c306446",
      "title": "Bolsonaro ordered to pay damages for racist remarks in office",
      "url": "https://www.theguardian.com/world/2025/sep/16/bolsonaro-damages-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:23:00.000Z",
      "summary_90w": "",
      "raw": "Court rules former president, sentenced to 27 years for coup attempt, must pay R$1m for ‘cockroaches’ comment in 2021\nJair Bolsonaro has been ordered to pay R$1m (£138,000) in collective moral damages for remarks deemed “racist” while he was in office.\nThe latest ruling, delivered by a state appeals court, came less than a week after Brazil’s former president was sentenced to 27 years and three months in prison for leading an attempted coup to overturn the result of the 2022 election.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b8f4f5af137df47d7365c15f630d015d41a06b2",
      "title": "Netanyahu’s ‘super-Sparta’ vision braces Israel for isolated economic future",
      "url": "https://www.theguardian.com/world/2025/sep/16/netanyahu-super-sparta-vision-israel-economic-future-isolation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:03:46.000Z",
      "summary_90w": "",
      "raw": "Israeli PM’s outline of partial autarky and more militarised society stirs up backlash and concern over pariah status \nHours before unleashing a ground offensive against Gaza City on Tuesday, Benjamin Netanyahu braced his country for a future of mounting economic isolation, urging it to become a “super Sparta” of the Middle East.\nThe future the prime minister laid out for Israel, of a more militarised society, a partial autarky – or economically self-sufficient country – with limited trade options and relying increasingly on homemade production, has stirred up a backlash among Israelis who are ever more uneasy at the prospect of following him down the path to a pariah state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b4a3c8f5e4a0d6ca5a739ee8c0409daf458b4e1",
      "title": "Israel’s war in Gaza ‘morally, politically and legally intolerable’ says UN secretary general - as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:01:12.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. You can read our latest report here:\n\nIsrael launches ground offensive deep inside Gaza City\n\nWafa, the Palestinian news agency, has been told by medical sources that at least 38 Palestinian people, including women and children, have been killed by Israeli forces since dawn today.\nAs well as facing relentless bombardments, Gaza City, the biggest built-up area of the territory, is being gripped by a famine caused by Israel’s restrictions on aid.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d70f31bf5a09693edebf01b9acafcdcfff7f40ad",
      "title": "Israel Committing Genocide in Gaza Says UN Commission",
      "url": "https://www.bbc.co.uk/sounds/play/p0m36nph?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T18:26:00.000Z",
      "summary_90w": "",
      "raw": "Israel rejects UN Commission finding that it is committing genocide in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25e03538e3e9d46dd1bb0cc7d474bd6a8ac81b49",
      "title": "UN tries to limit staff going to Cop30 in Brazil due to high price of hotels",
      "url": "https://www.theguardian.com/environment/2025/sep/16/un-tries-to-limit-staff-going-to-cop30-in-brazil-due-to-high-price-of-hotels",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T16:44:01.000Z",
      "summary_90w": "",
      "raw": "Accommodation costs at climate summit in Belem are pricing out some developing countries and media outlets\n\nThe United Nations has urged its staff to limit attendance at the Cop30 climate summit in Brazil in November due to high accommodation prices, while government delegations are still scrambling to find rooms within their budgets.\nThe move comes as delegations grow increasingly concerned about the cost of accommodation in the coastal Amazon city of Belem hosting Cop30. Brazil said it was working to increase the number of available hotel beds, but soaring prices for accommodation have stoked calls from some governments to relocate the conference, which Brazilian officials have rejected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1b3df1e0b5ca1aebb6e879d9c851190d07c4103",
      "title": "'Completely different, yet genuinely get on' - BBC correspondents on Starmer and Trump",
      "url": "https://www.bbc.com/news/videos/c9dxq447dwvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T16:27:49.000Z",
      "summary_90w": "",
      "raw": "The BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08fc7c2a54c00dca2d02e477cbd9f5b83c6a9950",
      "title": "'The bombing has been insane': Palestinians scramble to flee Israeli assault on Gaza City",
      "url": "https://www.bbc.com/news/articles/cly0qnnx5w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T15:42:06.000Z",
      "summary_90w": "",
      "raw": "Palestinians tell the BBC whole residential blocks have been levelled as the Israeli army ramps up its offensive in the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6aeaffe1e3ca5d4f53f06de8b9776c77126dc58b",
      "title": "Who was Agnes Wanjiru, Kenyan woman killed near army base in 2012?",
      "url": "https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T15:37:20.000Z",
      "summary_90w": "",
      "raw": "Relatives remember a dependable, kind and funny woman and remain traumatised by her death\nPerhaps the Kenyan market town of Nanyuki’s greatest claim to fame was that it straddles the equator. But now it has become synonymous with something darker. It was here where Agnes Wanjiru was born and lived and where she was brutally killed.\nHer family searched for her for months before her body was found stuffed into a septic tank at the same hotel where she had last been seen alive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e5ab1016b2b4c8ee8fa716477d83ea53fd26d6",
      "title": "Watch: Bear caught on CCTV searching for food in Indian temple",
      "url": "https://www.bbc.com/news/videos/c9dxq3n2pdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T15:12:11.000Z",
      "summary_90w": "",
      "raw": "The curious creature ransacked an office in its quest to find tasty treats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fda108e96638becd32441a61f74ead623332d49",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "url": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T14:28:29.000Z",
      "summary_90w": "",
      "raw": "High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old\n\nProfile: who was Agnes Wanjiru?\n\nA warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.\nThe high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and his extradition to Kenya was being sought.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc020e784bca26bdc1d2d3aab3e677193c2d7a33",
      "title": "Watch: The Sundance Kid's life in the spotlight",
      "url": "https://www.bbc.com/news/videos/ce9rvmk8xdzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T14:09:21.000Z",
      "summary_90w": "",
      "raw": "The BBC's David Sillito takes a look at the career of the Hollywood icon who has died aged 89.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59465bbcf57a8dccf296d9a9607ae2c90a319d9a",
      "title": "Lesotho villagers complain of damage from water project backed by African Development Bank",
      "url": "https://www.theguardian.com/world/2025/sep/16/lesotho-villagers-complain-damage-water-project-african-development-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T13:44:21.000Z",
      "summary_90w": "",
      "raw": "About 1,600 people file complaint to AfDB demanding transparency over forced relocations and compensation\nEighteen rural communities in Lesotho have filed a complaint with the African Development Bank (AfDB) over its funding of a multibillion-pound water project whose construction process they claim has ruined fields, polluted water sources and damaged homes.\nAbout 1,600 people living in the villages in Mokhotlong district in north-east Lesotho are demanding transparency over planned forced relocations and compensation they say they have not been consulted on.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "186387d96ddac98408cdbe3f00f17ed1441d075e",
      "title": "Homes damaged, cars swept away as rains flood India's Uttarakhand",
      "url": "https://www.bbc.com/news/videos/c8641vd73jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T10:22:35.000Z",
      "summary_90w": "",
      "raw": "Rescue efforts are under way after the Himalayan region was hit by torrential downpour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf1ead77844492def427441a62a9e551b68f045c",
      "title": "Trump files $15 billion defamation lawsuit against 'New York Times'",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543030/donald-trump-nytimes-lawsuit",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-16T10:00:40.000Z",
      "summary_90w": "",
      "raw": "President Trump filed a $15 billion defamation lawsuit against The New York Times and four of its journalists, accusing them of harming his business and personal reputation.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "0a6312505e8e474f11a0efed51b03de5f5914245",
      "title": "Google owner reveals £5bn AI investment in UK ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/crmek723dz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T09:44:20.000Z",
      "summary_90w": "",
      "raw": "Google's president and chief investment officer Ruth Porat tells the BBC there are \"profound opportunities in the UK\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b2914e242af7fcbe31bbde4de1e054a5673857f",
      "title": "Bowen: UN commission report on genocide is blunt indictment of Israel's actions in Gaza",
      "url": "https://www.bbc.com/news/articles/c0m4rxjppl8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T07:01:46.000Z",
      "summary_90w": "",
      "raw": "A new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b3f1a3edaca89f31d673e3c7971528ad17b0088",
      "title": "Beaten and held in Russia for three years - but never charged with a crime",
      "url": "https://www.bbc.com/news/articles/cm28674vnp6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T05:00:37.000Z",
      "summary_90w": "",
      "raw": "Russia imprisoned Dmytro shortly after its invasion of Ukraine in 2022. He was freed last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a8b043a5ef482f7f78bd53960e4dbfb00477ea8",
      "title": "Australia-PNG defence treaty: countries to agree to defend each other from military attack as China’s Pacific influence grows",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T04:28:39.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese and Papua New Guinea’s defence minister downplayed the delay to the Pukpuk defence treaty being formalised\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia and Papua New Guinea will agree to defend each other in the event of a military attack, part of a landmark defence agreement due to be signed on the sidelines of celebrations to commemorate the country’s independence this week.\nAnthony Albanese and PNG’s defence minister, Billy Joseph, both downplayed a delay to the deal being formalised, insisting the plan known as a Pukpuk treaty won’t affect sovereignty in the former Australian colony.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T04:20:10.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b99d9252c79d8fb38e65cdfc6052aa5246c664",
      "title": "Pacific leaders gather to celebrate 50th anniversary of Papua New Guinea’s independence",
      "url": "https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T02:30:58.000Z",
      "summary_90w": "",
      "raw": "Celebrations and events have been held across the country to mark the milestone\n\nPNG independence: 50 years on\n\nPacific leaders have gathered in Port Moresby to celebrate Papua New Guinea’s 50th anniversary of independence from Australia, as prime minster James Marape reflected on the moment and voiced his optimism for the future despite the country’s challenges.\nPapua New Guinea was administered by Australia as a single territory from 1945. The territory included the former British protectorate of Papua and the former German colony of New Guinea. In 1975, Papua New Guinea was granted independence.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "84bfd7f45b9b307f0d9e824e51a55860513e4a8a",
      "title": "Trump announces deadly US strike on another alleged Venezuelan drug boat",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T01:26:57.000Z",
      "summary_90w": "",
      "raw": "President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’\nDonald Trump said on Monday that the United States had carried out a strike on a second Venezuelan boat and killed three alleged terrorists he claimed were transporting drugs, expanding his administration’s war against drug cartels and the scope of lethal military force to stop them.\nThe US president gave few details about the strike, saying in a social media post that the action was on his orders and that it had happened earlier in the morning. The post was accompanied by a video clip showing the boat, which appeared to be stationary, erupting into a fireball.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5747b8476441fa8d66da50cdeaba29b97d41f796",
      "title": "Appeals court says Lisa Cook can stay on the Federal Reserve board -- for now",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539252/lisa-cook-fed-trump-firing-court",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-16T00:57:53.000Z",
      "summary_90w": "",
      "raw": "A federal appeals court blocked President Trump from firing Federal Reserve governor Lisa Cook, just ahead of a key vote on interest rates.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6026cc8859de8bc9a81914aae63649a61cdf2493",
      "title": "Why Trump wants companies to report earnings less frequently",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542137/trump-corporate-earnings-sec",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T18:34:22.000Z",
      "summary_90w": "",
      "raw": "President Trump would like companies to report their earnings less frequently. Executives have long called for that -- but some financial experts worry it would go badly.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b768a80b7f41e8feeec08c67dd8d720ecfb6200e",
      "title": "Watch: JD Vance hosts Charlie Kirk's daily talk radio show",
      "url": "https://www.bbc.com/news/videos/ckge487nr6ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T18:29:57.000Z",
      "summary_90w": "",
      "raw": "The US vice-president said the late conservative influencer played a \"critical part\" in getting President Donald Trump re-elected.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48341e22cf197b930c55378266f1044034e5ce18",
      "title": "Senate confirms Stephen Miran to Fed Board. Who is he and why's he so controversial?",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542126/stephen-miran-fed-reserve-board",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T17:39:32.000Z",
      "summary_90w": "",
      "raw": "The Senate voted Monday to confirm Stephen Miran to the Federal Reserve Board. Miran, who has served in both Trump administrations, has said he will not resign from the White House but take a leave of absence, further stoking concerns about its independence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ba1a69c28d42c1982858afe85fca23104d56d0f4",
      "title": "Israel demolishes more high-rise towers as Gaza City offensive ramps up",
      "url": "https://www.bbc.com/news/videos/cr5q8mj6nrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:40:30.000Z",
      "summary_90w": "",
      "raw": "BBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a475abb3dc16ccdb5d98f98a66ee869d359880a",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jnl0?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-13T01:00:00.000Z",
      "summary_90w": "",
      "raw": "Lara Lewington explores the tech being trialled to find 'hidden' pancreatic cancer cases.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b3a878af0d65401d30b2b22e759db794e484cb6",
      "title": "Tech Life",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6zp7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T19:30:00.000Z",
      "summary_90w": "",
      "raw": "Robot sailboats are helping forecasters predict where hurricanes will hit land.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b01e5f5037c4e13f5add6c3b3cd312f3c5b5bdc6",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jb6f?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-06T01:00:00.000Z",
      "summary_90w": "",
      "raw": "How technology is bringing hope of earlier detection and prevention to wildfires.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}