{
  "version": "1757441885495",
  "generatedAt": "2025-09-09T18:18:05.495Z",
  "items": [
    {
      "id": "a7957e2d0dc5ca7bcece111af6a35e99d7111bf5",
      "title": "Apple launches iPhone 17 Pro with major camera upgrades",
      "url": "https://techcrunch.com/2025/09/09/apple-launches-iphone-17-pro-with-major-camera-upgrades/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T18:14:13.000Z",
      "summary_90w": "",
      "raw": "Apple launched the iPhone 17 Pro and the iPhone 17 Pro Max today with a new design and an upgraded camera system. The devices are powered by the new A19 Pro chipset and have a larger battery, Apple said. Plus, it noted that eSIM-only models will have a slightly larger battery as compared to Pro […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eac05bc5d1f0dbb8da0b46393a76882c585126d6",
      "title": "Macron names ally Sébastien Lecornu as new French PM",
      "url": "https://www.bbc.com/news/articles/crmenp1k0mjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T18:13:25.000Z",
      "summary_90w": "",
      "raw": "It comes after a vote of confidence ousted François Bayrou.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b034d95856626e88c2aeffd685e7148d1a7f5d8",
      "title": "At the Abundance conference, right-wing anti-regulation ideals were in abundance",
      "url": "https://www.theverge.com/regulator-newsletter/774489/natcon-abundance-conference-recap",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T18:09:04.000Z",
      "summary_90w": "",
      "raw": "Hello and welcome to Regulator. If you're here via a link and would like to read more, The Verge is running a very good subscription sale this month: $4 for a month and $35 for the year, for full access to the entire site. That's right: you can read about political horseshoe theory in action AND get our live coverage of the Apple iPhone 17 launch!\nLast week, two conferences drew the attention of all of Washington's policy nerds, though your excitement really depended on where you fell on the political spectrum. On the right, at the Westin DC Downtown: NatCon, a gathering of Trump officials and allies calling for the persecution of AI develo …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What's in the book of birthday messages to Epstein",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T18:08:42.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0c422100f50c5b7296cd3a56b2078cb7846e313",
      "title": "Trump spokesperson calls strike on Qatar ‘unfortunate’ after Israel targets Hamas leaders in Doha – live updates",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T18:07:33.000Z",
      "summary_90w": "",
      "raw": "Trump press secretary says attack on Hamas leaders ‘does not advance Israel or America’s goals’ but calls Qatar ‘a strong ally and friend’ of the US\n\nIsrael launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks\n\nDan Sabbagh is the Guardian’s defence and security editor\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48c752d230499227c3ddb4dcfd09b1d1bbf64a35",
      "title": "iPhone 17’s front-facing camera gets Center Stage",
      "url": "https://www.theverge.com/iphone/774679/iphone-17-front-facing-camera-center-stage",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T18:03:14.000Z",
      "summary_90w": "",
      "raw": "The iPhone 17’s front-facing camera has a brand new sensor that eschews the traditional 4:3 aspect ratio, for a square format. That gives the camera some extra wiggle room around the edges, to enable Center Stage for video calls and live streams from your selfie cam. That means you’ll be better centered during your Zoom calls, even if you’re walking down the street holding your phone out in front of you (not recommended) while discussing your latest work project. \nAnother perk of this change is that you no longer have to rotate your phone to take landscape selfies. In fact, the phone can use AI to automatically adjust the framing and give you options from 4:3 portrait, to 16:9 landscape or even square.\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf61c9a764b567a0bd7a3494e79cc3a9dddad060",
      "title": "Apple&#8217;s new iPhone Air accessories include a slim MagSafe battery, translucent case, and crossbody strap",
      "url": "https://www.theverge.com/news/773226/apple-iphone-air-accessories-magsafe-awe-dropping-event",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T18:03:07.000Z",
      "summary_90w": "",
      "raw": "Apple has announced a new line of accessories designed specifically for the just-announced iPhone Air, including a slim MagSafe battery, a translucent case, a bumper case, and a crossbody strap.\nWith the MagSafe battery, Apple claims that the iPhone Air will get up to 40 hours of video playback. Based on images from Apple, the battery is tall and skinny, taking up a lot of space on the back of Apple’s new thin iPhone.\nThe new case is translucent, allowing you to see the color of your phone inside the case. It also has a prominent ring for magnets, similar to Apple’s other clear cases.\nApple is additionally releasing a bumper case that wraps around the edge of the phone, but you can also get a new crossbody strap that lets you sling the phone across your body. That could be useful if you want to have your phone easily accessible and on your person without having to put it into your pocket — or if you don’t have pockets.\nApple also announced a followup to its failed FineWoven line of accessories, called TechWoven. It will also be compatible with Apple’s crossbody strap.\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bc5a242ed41a7ba381965ad787e4ed26e2fbeedb",
      "title": "Apple&#8217;s iPhone 17 Pro has the biggest battery of any iPhone",
      "url": "https://www.theverge.com/news/772666/apple-iphone-17-pro-specs-features-price-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:57:55.000Z",
      "summary_90w": "",
      "raw": "Apple has announced the iPhone 17 Pro, the top model in its new iPhone 17 lineup, alongside the regular iPhone 17 and all-new iPhone Air. The Pro returns to an aluminum build, adds the biggest battery of any iPhone yet, and boasts what Apple is calling a “full-width camera plateau” on the back.\nThe obvious change this year is a dramatic redesign of the rear camera module — sorry, “plateau” — which now stretches all the way across the body, rather than only containing the lenses. It looks just a little like the wide camera bar on Google’s Pixel phones, and funnily enough we’re already expecting to see Samsung adopt a similar design in its S26 range next year.\nIt’s still a triple camera within that new camera island, though there’s been one major upgrade. For the first time this year’s Pro models feature 48-megapixel sensors across all three cameras. The telephoto is the lens getting a bump here, with a significant resolution improvement from the 12-megapixel telephoto lens found on last year’s models. The selfie camera is also improving, with a new 18-megapixel sensor that uses Center Stage to frame every photo. \nEarlier this year, Apple announced iOS 26, the latest version of its iPhone software, which brings with it a significant change to the look and feel of your phone: Liquid Glass. It’s got big transparent energy, making various UI elements glossy, glassy, and see-through — it might take some getting used to.\nLast year’s iPhone 16 Pro was a relatively cautious update that added bigger screens, better battery life, and a Camera Control button along the side of the phone. The 16 series also marked Apple’s first serious push into AI, with the ill-fated launch of Apple Intelligence, which has long lagged behind competitors and was criticized for failing to deliver on some features announced over a year ago.\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "affece646e478f5f0ffadab3730f29d1bea90de3",
      "title": "iPhone 17 Air will be eSIM only worldwide",
      "url": "https://techcrunch.com/2025/09/09/iphone-17-air-will-be-esim-only-worldwide/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:57:51.000Z",
      "summary_90w": "",
      "raw": "The company opted to ditch physical SIMs for eSIMs for iPhones sold in the U.S. in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2326a0a477532d0bbed30706fee15ac14bc9c9b2",
      "title": "Apple debuts the ultra-thin iPhone Air",
      "url": "https://techcrunch.com/2025/09/09/apple-debuts-the-ultra-thin-iphone-air/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:51:44.000Z",
      "summary_90w": "",
      "raw": "The star of Apple's iPhone 17 event was the iPhone Air, its thinnest and lightest model to date.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "198630dd44b630000875484fd779bafc90eaba77",
      "title": "Starmer to meet Israel's president in Downing Street",
      "url": "https://www.bbc.com/news/articles/cly9jgmgqe8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:50:04.000Z",
      "summary_90w": "",
      "raw": "The PM will stress the \"the action Israel must take to end the horrific suffering\" in Gaza, No 10 said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e8da303c0ae690bcabf79ae59862e52da45f4e2",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "url": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:45:02.000Z",
      "summary_90w": "",
      "raw": "Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged\nA Canadian beekeeper has described fending off thousands of “robber bees” as they raided her shop in a brazen attempt to steal honey.\nChristine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "370c218dcd25f37cddc5cc77009405c714b3c340",
      "title": "Apple announces the ultra-slim iPhone Air",
      "url": "https://www.theverge.com/news/771942/apple-iphone-17-air-announcement",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:43:17.000Z",
      "summary_90w": "",
      "raw": "Apple just announced the thinnest iPhone ever, the iPhone Air, which measures just 5.6mm thick. CEO Tim Cook said it promises “pro performance in a thin and light design.”\nThe new iPhone Air comes with a 6.5-inch ProMotion display and a refresh rate of up to 120Hz. It also has 3,000 nits of peak brightness. Apple says the design is its “most durable” yet, featuring a ceramic shield that encloses a titanium frame on both sides.\nIt features a new A19 Pro processor, which is the most powerful iPhone chip yet, and a new Apple-built modem called the C1x, which is two times faster than the C1. Along with these upgrades, the iPhone Air comes with Apple’s new N1 chip design, which adds support for Wi-Fi 7, Bluetooth 6, and Thread.\nAnd, despite how thin it is, Apple promises “all day” battery life with up to 40 hours of video playback. To “maximize” battery space, the iPhone Air only supports e-SIMs. Apple also says adaptive power mode in iOS 26 will help improve battery life.\nThe iPhone Air features a 48-megapixel dual camera system with a 12MP telephoto lens. It comes with a new system that combines the front and rear cameras, allowing you to record a video of yourself while capturing what’s in front of you. The 18MP selfie camera also supports Center Stage, a feature also on the regular iPhone 17, which automatically fits everyone into a photo, so you don’t have to rotate the phone into landscape mode.\nThe iPhone Air comes in black, white, beige, white, and light blue. Apple also revealed several new accessories for the iPhone Air, including an ultra-thin translucent case, as well as a bumper case made from reinforced polycarbonate. Both options pair with a new cross-body strap. It starts at $999 for 256GB of storage and is available for preorder starting today, with availability starting September 19th.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d4c139595932b364975c9d74287679aa59b1b380",
      "title": "Apple unveils Apple Watch Series 11, Watch Ultra 3, and Watch SE 3",
      "url": "https://techcrunch.com/2025/09/09/apple-unveils-apple-watch-series-11-watch-ultra-3-and-watch-se-3/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:40:20.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch Series 11 can alert you to possible hypertension.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c35d741bac4cf2bb1a9fe2b27aa76b9c205905c2",
      "title": "60 years later, Sandy Koufax's perfect game is still amazing",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5533220/sandy-koufax-perfect-game-60-years-dodgers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T17:39:48.000Z",
      "summary_90w": "",
      "raw": "Tuesday marks 60 years since Sandy Koufax threw a perfect game at Dodger Stadium. The 1-0 victory over the Chicago Cubs is still considered one of the best games in baseball history.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eba10ca5c7b72488b89164acc832a12e9c216922",
      "title": "Mitchum deodorant says sorry after users complain of itchy, burning armpits",
      "url": "https://www.bbc.com/news/articles/cly0gkrqq7ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:35:26.000Z",
      "summary_90w": "",
      "raw": "Mitchum said a change in the manufacturing process had affected some of its roll-on products after users complained of soreness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b7982ad48372c7d28378ea1a6705eb0870d197b",
      "title": "Apple launches iPhone 17 with a 120Hz display",
      "url": "https://techcrunch.com/2025/09/09/apple-launches-iphone-17-with-a-120hz-display/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:33:56.000Z",
      "summary_90w": "",
      "raw": "Apple launched the iPhone 17 series today at its “awe-dropping” event, with the base model getting an upgraded display. The iPhone 17 has a slightly bigger screen at 6.3 inches as compared to the 6.1-inch screen of the iPhone 16. The display itself is getting an upgrade with the ProMotion display, which is being used […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "debf659501de676b744308ff8be82d1509a20bd2",
      "title": "Ethiopia inaugurates Africa's biggest dam amid regional tensions",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5534227/ethiopia-dam-sudan-egypt",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T17:32:58.000Z",
      "summary_90w": "",
      "raw": "Ethiopia opens Africa's largest hydropower project, the Blue Nile's Grand Ethiopian Renaissance Dam — a milestone that's sparking alarm in neighboring Sudan and Egypt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbf7430f085ca43ee113e05711073c12c2f8db42",
      "title": "Apple’s iPhone 17 introduces a new Center Stage selfie camera",
      "url": "https://www.theverge.com/apple/772543/apple-iphone-17-launch-price-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:32:26.000Z",
      "summary_90w": "",
      "raw": "Say hello to the iPhone 17.\t\n\nApple has announced the iPhone 17, the latest edition of its standard model iPhone. This iteration has been upgraded with a larger 6.3-inch display and a 120Hz ProMotion refresh rate. It comes in some lightly refreshed color variations, but otherwise preserves much of the iPhone 16 design.\nSome of the biggest updates for this generation are the cameras, including a 48-megapixel “dual fusion” camera system on the rear that combines the capabilities of a main camera and telephoto camera into one, according to Apple. The camera also includes a 24-megapixel default resolution thats better for saving smaller image files, and a 2x optical quality telephoto. There’s also a 48-megapixel fusion ultrawide that’s capable of capturing images in 4x higher resolution compared to the iPhone 16, according to Apple.\nThe iPhone 17 also introduces a new 12-megapixel Center Stage front camera, which sports a sensor that’s twice the size of the one in the previous iPhone. A notable feature is that the front camera’s sensor is now square-shaped, allowing users to take high-quality landscape mode selfies without having to rotate their phone. Users can tap on the Camera app to expand the field-of-view and rotate between portrait and landscape modes.\n\n\n\n\nThe base iPhone 17 is a smidge larger than its predecessor, bumping the 6.1-inch OLED screen to 6.3 inches with slimmer bezels. The 60Hz refresh rate has also been upgraded to an adaptive 120Hz ProMotion display, a feature that was previously limited to iPhone Pro models. When the Always On display isn’t in use, the refresh rate will drop down to 1Hz. Apple says the iPhone 17’s display can reach 3,000 nits of peak brightness, the highest ever brightness level for iPhone, according to Apple.\nThe iPhone 17‘s predecessor saw some big changes last year. The iPhone 16 adopted the Action Button, which had previously been exclusive to the Pro line; it reintroduced the vertical dual-camera arrangement, which had last been seen on the iPhone 12; and it added the Camera Control button, which also debuted on the iPhone 16 Pro.\nApple also heavily pushed the iPhone 16’s AI capabilities. But in the end, many of its flagship Apple Intelligence features didn’t ship. That didn’t seem to hurt the launch, though, with the iPhone 16 managing to outperform the iPhone 15 in Apple’s year-over-year Q4 sales.\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f051ea0de73d87788a0f6750f6eb89a6cdac3d70",
      "title": "The Apple Watch Ultra 3 has 42 hours of battery life and satellite connectivity",
      "url": "https://www.theverge.com/news/770763/apple-watch-ultra-3-awe-dropping-event",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:26:35.000Z",
      "summary_90w": "",
      "raw": "Apple just announced the Apple Watch Ultra 3, which now includes 5G, up to 42 hours of battery life and satellite connectivity. It also has a slightly bigger display — the size of the watch is the same, but the screen goes closer to the edges. The new Ultra gets notifications for signs of chronic high blood pressure and can give you a sleep score.\nThe Apple Watch Ultra 3 is available for preorder today ahead of a public release on September 19th. It will start at $799 and come in natural and black titanium.\nThe new Ultra follows the Apple Watch Ultra 2, which Apple announced in 2023; the black version of the Ultra 2, which Apple introduced last year; and the original Apple Watch Ultra, which Apple launched in 2022. Apple’s Ultra watches are generally targeted toward athletes and sporty types, with features like big battery life (Apple promises up to 36 hours in “normal use” with the Apple Watch Ultra 2), bright displays, and improved GPS for tracking workouts. They also have had a high starting price of $799.\nIn addition to the new watch, Apple is launching watchOS 26 this fall, which includes features like an Apple Intelligence-powered “Workout Buddy,” an improved Smart Stack, a wrist flick gesture to dismiss notifications, and Apple’s new Liquid Glass design language (which is also coming to other Apple products).\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31fc19b8eecf70f164bd508cfa148a28e2118af0",
      "title": "Apple announces new entry-level $249 Apple Watch SE 3 with always-on display",
      "url": "https://www.theverge.com/news/772862/apple-watch-se-2025-iphone-event-announcement-specs-price",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:24:41.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch SE 3 looks familiar, but it has some notable features the SE line never had before. | Image: Apple\t\n\nApple has a refreshed entry-level smartwatch for 2025, the new Apple Watch SE 3. Announced at the “awe dropping” event alongside new iPhones, the SE 3 has a faster S10 processor, longer battery life, stronger front glass, and (finally) an always-on display. It starts at $249 for a 40mm model and is set to launch September 19th, with preorders available now. The SE 3 will also come in a larger 44mm size, and both will be offered in midnight and starlight-colored aluminum cases.\nOther new features in the SE 3 include double-tap and wrist-flick gestures, sleep apnea detection, sleep scores, retrospective ovulation estimates, the ability to play music and podcasts through its speaker, 2x faster charging speeds, 5G cellular, and a claimed 18 hours of battery life. Like the Series 11 and Ultra 3, the SE 3’s front crystal uses Apple’s Ion-X glass, which the company claims is twice as scratch-resistant as its previous glass.\nThe 2025 Apple Watch SE is a follow-up to the outgoing model, which was launched back in 2022. It’s once again Apple’s new base model wearable —  typically a parts-bin remix of previous and current flagship features for a lower price. But it left out features like an always-on display and sensors for temperature, EKG, and blood oxygen. Of those three, the SE 3 now at least gets the temperature sensor.\nThe SE 3 will ship with watchOS 26, bringing with it Apple’s Liquid Glass software design and UI, and other features like its new Workout Buddy to give you an audible coach during exercises.\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0c83a9f83dd41b99bd765f1ee56d3515f896e189",
      "title": "Ramp says it has hit $1B in annualized revenue",
      "url": "https://techcrunch.com/2025/09/09/ramp-says-it-has-hit-1b-in-annualized-revenue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:23:12.000Z",
      "summary_90w": "",
      "raw": "Ramp answered any lingering question as to why investors valued the company at $22.5 billion just 45 days after they valued it at $16 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "432c86527baf422d733690b4bca0926afb105df8",
      "title": "Apple Watch Series 11 announced with 5G and stronger glass",
      "url": "https://www.theverge.com/news/772872/apple-watch-series-11-specs-features-price-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:19:30.000Z",
      "summary_90w": "",
      "raw": "Apple just announced the Apple Watch Series 11, which looks similar to its predecessors but is the slimmest Apple Watch to date and includes new features like 5G cellular connectivity and stronger glass.\nThe Series 11 is the first Apple with 5G connectivity and features a modem and antenna that will provide improved coverage while being less of a drain on battery life. Like the AirPods Pro 3, the Watch will have live translation capabilities.\nIt will also be the first Apple Watch with the ability to monitor for a serious medical condition called hypertension, or high blood pressure. The feature uses the Series 11’s optical heart rate sensor but instead of providing an assessment on demand it works in the background using data collected over 30 days and a new algorithm to look for signs that potentially indicate your blood pressure is potentially too high.\nA new Sleep Score feature uses metrics like how long you’ve been asleep and your sleep stages to help you better understand the quality of your rest over night.\nApple says the Series 11 will get “up to 24 hours” of battery life and will come in both recycled aluminum and polished titanium finishes. It also comes with Ion-X glass, which Apple says has a ceramic coating bonded at the atomic level making it twice as scratch-resistant as the previous glass, though it’s not clear how it compares to sapphire watch crystals.\nPricing starts at $399 for the smaller 42 millimeter GPS-only version of the Apple Watch Series 11 (the same price as the entry-level Apple Watch Series 10) and it will be available for preorder starting today and ship starting on September 19th.\nThe Apple Watch Series 11 will launch alongside watchOS 26, the latest version of Apple’s smartwatch operating system that includes new features like a wrist flick gesture that can be used to dismiss calls, notifications, and alarms, as well as take you back to your watch face. It will feature an improved Smart Stack, a Workout Buddy feature that leverages Apple Intelligence to provide personalized insights and even pep talks, and Apple’s new Liquid Glass design language that’s also coming to other Apple devices.\nDeveloping… see our live blog for the latest details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "590658b4b29df04b17e47e70aa3d381239de53a8",
      "title": "Woman dies trying to cross Channel in migrant boat",
      "url": "https://www.bbc.com/news/articles/ce84nw9pllwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:17:10.000Z",
      "summary_90w": "",
      "raw": "About 500 people are believed to have made the crossing on Tuesday in calm conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc0a64de2bf79c5536121600321827c45ba5f55a",
      "title": "AirPods Pro 3 arrive with heart-rate sensing and live translation using Apple Intelligence",
      "url": "https://techcrunch.com/2025/09/09/airpods-pro-3-arrive-with-heart-rate-sensing-and-live-translation-using-apple-intelligence/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:16:52.000Z",
      "summary_90w": "",
      "raw": "It’s been three years since Apple refreshed the AirPods Pro line, releasing the Pro 2 model in 2022. The new AirPods Pro will be priced at $249.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed74370aeb95f219027563819cf1d87d89157b3a",
      "title": "Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks",
      "url": "https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:15:13.000Z",
      "summary_90w": "",
      "raw": "Israeli officials say US notified before attack, which Doha calls cowardly and a flagrant violation of international law\n\nMiddle East crisis – live updates\n\nIsrael has launched a strike on senior Hamas officials meeting in Qatar’s capital, Doha, reportedly including the group’s chief ceasefire negotiator, in a dramatic escalation of Israeli attacks across the Middle East that has drawn international condemnation.\nThe Israeli strike came hours after its military warned all of Gaza City’s residents to evacuate before its planned offensive to take control of what it portrays as Hamas’s last remaining stronghold, where hundreds of thousands of people are living under famine conditions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73f065a0ff97169913df5471d003c050292c6048",
      "title": "More than a dozen robbers storm jewellery shop in California",
      "url": "https://www.bbc.com/news/videos/c1edl9qppelo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:11:04.000Z",
      "summary_90w": "",
      "raw": "An 88-year-old jewellery store owner in San Jose is recovering after being assaulted during a violent smash-and-grab robbery.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "257117ff1f8bc46c80d63903b63545b2d73efb2f",
      "title": "Von der Leyen under growing pressure to take tougher line with Israel",
      "url": "https://www.theguardian.com/world/2025/sep/09/von-der-leyen-under-growing-pressure-to-show-leadership-over-israel-gaza-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:09:44.000Z",
      "summary_90w": "",
      "raw": "EU Commission president urged to ‘show leadership’ and preserve bloc’s credibility amid catastrophe in Gaza\nThe European Commission president, Ursula von der Leyen, is under growing pressure from MEPs to “show leadership” and preserve the EU’s political credibility by taking a tougher approach to Israel’s government over the humanitarian catastrophe in Gaza.\nVon der Leyen is expected to refer to the EU’s role on the world stage in her annual “state of the union” speech to the European parliament on Wednesday, where she will set out her agenda for the year ahead.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad91a725646a6e7f9e19fbc150fbbc5f681b415e",
      "title": "Apple announces AirPods Pro 3 with ‘world’s best ANC’ and heart rate sensing",
      "url": "https://www.theverge.com/news/772410/apple-airpods-pro-3-release-date-pricing-announcement",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T17:05:08.000Z",
      "summary_90w": "",
      "raw": "Apple just announced the AirPods Pro 3, the first major update to the product in three years. Apple is introducing a new heart rate sensor in the AirPods Pro 3, as well as improved active noise cancellation (ANC), and a live translation feature. You’ll be able to preorder the AirPods Pro 3 today for $249, and they’ll start shipping on September 19th.\nApple is upgrading the audio quality in AirPods Pro 3, with a widened sound stage and improved noise cancellation. Apple says the AirPods Pro 3 will deliver the “world’s best ANC,” thanks to foam-infused ear tips for greater noise isolation. Apple claims this will enable twice the ANC than the previous generation of AirPods Pro, and “deliver the world’s best ANC of any in-ear wireless headphones.”\nPerhaps the biggest upgrade on the AirPods Pro 3 will be the new heart rate sensor. Apple is using its smallest heart rate sensor on the AirPods Pro 3, which is a custom photoplethysmography (PPG) sensor that “shines invisible infrared light pulsed at 256 times per second to measure light absorption in blood flow.”\nThe sensor works with the AirPods Pro accelerometers, gyroscope, GPS, and a new on-device AI model on an iPhone to track heart rate, calories burned, and activity. There’s also a new workout experience, Workout Buddy, in the iPhone fitness app that uses Apple Intelligence to track workout data and fitness history.\nApple is also bringing a new live translation feature to the AirPods Pro 3. ANC will lower the volume of the speaker and play audio back to you in your own language. “When enabled, Live Translation helps users understand another language and communicate with others by speaking naturally with AirPods,” explains Apple. “To interact with someone who doesn’t have this hands-free capability, there’s an option to use iPhone as a horizontal display, showing the live transcription of what the user is saying in the other person’s preferred language.”\nApple is also improving how AirPods Pro 3 fit in people’s ears. Apple says it has analyzed more than 10,000 3D ear scans and made each AirPod Pro smaller. The design is shaped to better fit inside the ear canal, and there are now five sizes of ear tips. Apple has even made the AirPods Pro 3 more durable, with IP57 sweat and water resistance.\nIn addition to the AirPods Pro 3, Apple is also bringing several new features to its AirPods with the release of iOS 26 this fall. AirPods will be able to be used as a camera remote for the camera app in iOS 26, and AirPods 4 and AirPods Pro 2 will now support studio-quality audio for songs, videos, podcasts, and more. Apple is also improving the call quality in iOS 26 for AirPods 4 and AirPods Pro 2, as well improving charging reminders and pausing audio if you fall asleep.\nApple last made a major update to its AirPods Pro line with the second-generation debut three years ago, with improvements to sound quality, noise cancellation, and a built-in speaker in the charging case. Apple then updated the AirPods Pro 2 in 2023 with dust resistance and a USB-C charging case instead of the company’s Lightning port.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a29f9f0508c07958be555bbf91fd9ef2f54ef96c",
      "title": "France braces for ‘block everything’ protests after PM Bayrou resigns",
      "url": "https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:04:58.000Z",
      "summary_90w": "",
      "raw": "Blockades, disruption and strikes planned for Wednesday with about 80,000 police and gendarmes to be deployed\n\nThe French prime minister, François Bayrou, has resigned after losing a confidence vote as authorities prepare for a day of disruption and protests ranging from road and school blockades to transport strikes.\nAbout 80,000 police and gendarmes will be deployed across France on Wednesday to monitor a day of anti-government demonstrations organised under the slogan “block everything”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "12ee62380315570c9993a99b483a6cb3b2731a19",
      "title": "Nepal parliament set on fire after PM resigns over anti-corruption protests",
      "url": "https://www.bbc.com/news/articles/c0m4vjwrdwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:57:48.000Z",
      "summary_90w": "",
      "raw": "KP Sharma Oli steps down amid Nepal's worst unrest in decades, with at least 22 deaths reported in clashes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3ad59564cda6227ea2788286b393cbd8eb1579d",
      "title": "Mandelson called Epstein 'best pal' in birthday message",
      "url": "https://www.bbc.com/news/articles/cwy9dwe50leo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:53:04.000Z",
      "summary_90w": "",
      "raw": "The description is contained an alleged 50th \"birthday book\" given to the disgraced financier that has been released by US lawmakers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24bc0cf7044d0f4bbbd46962fd8f96ed7cf4cacd",
      "title": "Asylum seekers speak to BBC from inside house facing local opposition",
      "url": "https://www.bbc.com/news/videos/c8exwjkglzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:47:55.000Z",
      "summary_90w": "",
      "raw": "Wigan has no asylum hotels but 900 homes in multiple occupation (HMOs), some of which house asylum seekers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80cacd185f401482f16a89cf540cc816cf4c055e",
      "title": "England's NHS trust league tables revealed - find out where yours ranks",
      "url": "https://www.bbc.com/news/articles/cq8eqxlypv7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:45:32.000Z",
      "summary_90w": "",
      "raw": "Critics question the usability of new league tables meant to inform the public and let them exercise choice.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b7ee981e5d692198813df07d93a496bfc29294f4",
      "title": "London Tube strike enters third day with more disruption expected",
      "url": "https://www.bbc.com/news/articles/cvgr9x145eyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:42:43.000Z",
      "summary_90w": "",
      "raw": "RMT workers on the London are continuing their walk out in a bid for better pay and conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Plans to cool Arctic using geo-engineering are dangerous, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "39b0def603facf99bfa6645ec21f2c224c4c4d01",
      "title": "Man arrested over Heathrow Airport evacuation",
      "url": "https://www.bbc.com/news/articles/ckgy9e0zpp3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:36:07.000Z",
      "summary_90w": "",
      "raw": "A man is arrested on suspicion of possessing a firearm after the partial evacuation of Heathrow.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c5155a1440301af96917e2a8bcc0fffe72e7a2b",
      "title": "Nvidia unveils new GPU designed for long-context inference",
      "url": "https://techcrunch.com/2025/09/09/nvidia-unveils-new-gpu-designed-for-long-context-inference/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T16:35:47.000Z",
      "summary_90w": "",
      "raw": "Nvidia's relentless development cycle has resulted in enormous profits for the company, which brought in $41.1 billion in data center sales in its most recent quarter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ce7aad2b2c343ad6f6d8291cc1fc444ef12d831e",
      "title": "Tesla is seeking permits to offer ride-hail services at Silicon Valley airports",
      "url": "https://techcrunch.com/2025/09/09/tesla-is-seeking-permits-to-offer-ride-hail-services-at-silicon-valley-airports/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T16:26:38.000Z",
      "summary_90w": "",
      "raw": "It's a precursor to the company's larger ambitions of operating a full-blown robotaxi service in the state -- something it's still yet to prove can work at scale in Texas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eecf41aac88722b0b8b41b3501f3faed2f8d4cc3",
      "title": "What do we know about Israeli strike on Hamas in Qatar? ",
      "url": "https://www.bbc.com/news/articles/cq5jl77ygv4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:23:37.000Z",
      "summary_90w": "",
      "raw": "Israel carried out a strike on senior Hamas leaders in Qatar's capital Doha on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88e204dd6ac838dcd342efa2af5d7c28f1e91cff",
      "title": "BBC boss Tim Davie robust with MPs after summer of scandal",
      "url": "https://www.bbc.com/news/articles/cewnx7y2z42o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:20:05.000Z",
      "summary_90w": "",
      "raw": "BBC culture and media editor Katie Razzall says Tim Davie gave a \"sure-footed\" performance to MPs on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23860b3f9f961d5b7f8a07f1a387073adbdf2088",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "url": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:19:28.000Z",
      "summary_90w": "",
      "raw": "Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts\nEthiopia has inaugurated Africa’s largest hydroelectric dam, a project that could transform the country’s energy sector but may also increase tensions with neighbouring Egypt.\nState media showed the Ethiopian prime minister, Abiy Ahmed, touring the site of the Grand Renaissance dam (GERD) in Guba district with the Kenyan president, William Ruto, the Somali president, Hassan Sheikh Mohamud, and the African Union chairperson, Mahmoud Ali Youssouf.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b79f1c7441cbd9c14a7d3d2959f0b5f4661a902",
      "title": "Michigan judge dismisses charges against 15 pro-Trump 'fake electors'",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535584/michigan-fake-electors-trump-charges-dropped",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T16:13:58.000Z",
      "summary_90w": "",
      "raw": "A Michigan judge has dismissed criminal charges against 15 people who signed false certificates saying Donald Trump won the state's electoral votes in 2020.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ad76c61b575e16df457b8e69ca4e4cbfa5b8e4b",
      "title": "Tesla revamps the Megapack in attempt to reverse its declining storage business",
      "url": "https://techcrunch.com/2025/09/09/tesla-revamps-the-megapack-in-attempt-to-reverse-its-declining-storage-business/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T16:10:55.000Z",
      "summary_90w": "",
      "raw": "The new battery product, known as Megapack 3, is a bid to lure utilities and data center developers that are desperate for power.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "51e10162b815d54805a3f5b63a8a5fd50b363c8f",
      "title": "At least nine pigs’ heads found outside mosques in Paris region",
      "url": "https://www.theguardian.com/world/2025/sep/09/pigs-heads-found-mosques-paris-region",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:03:29.000Z",
      "summary_90w": "",
      "raw": "Police do not rule out possibility of finding more as incidents raise alarm over increase of anti-Muslim hatred \nAt least nine pigs’ heads were found outside several mosques in the Paris region on Tuesday, the city’s police chief said, prompting alarm over rising anti-Muslim hatred.\n“Pigs’ heads have been left in front of certain mosques ... Four in Paris and five in the inner suburbs,” Laurent Nuñez told a press conference, adding that officers were not “ruling out the possibility of finding more”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d054bb6fba36ae5a9e03f5280bb3183ac3ac9744",
      "title": "The Gaza family torn apart by IDF snipers from Chicago and Munich",
      "url": "https://www.theguardian.com/world/2025/sep/09/the-gaza-family-torn-apart-by-idf-snipers-from-chicago-and-munich",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:50:13.000Z",
      "summary_90w": "",
      "raw": "Five-month investigation reveals how four members of one family were shot and killed in a single day and highlights a pattern in which Israeli troops target unarmed civilians\nDaniel Raab shows no hesitation as he watches footage of 19-year-old Salem Doghmosh crumpling to the ground beside his brother in a street in northern Gaza.\n“That was my first elimination,” he says. The video, shot by a drone, lasts just a few seconds. The Palestinian teenager appears to be unarmed when he is shot in the head.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e914818f138dd2684307aa3d51a918771761beae",
      "title": "UK has ‘not concluded’ Israel carrying out genocide in Gaza, Lammy says",
      "url": "https://www.theguardian.com/world/2025/sep/09/uk-not-concluded-israel-committing-genocide-in-gaza-lammy-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:41:04.000Z",
      "summary_90w": "",
      "raw": "Government position set out in letter to select committee as No 10 prepares for visit by Israeli president\n\nMiddle East crisis – live updates\n\nThe UK has not concluded that Israel is committing genocide in Gaza, nor that any of the British-made parts for F-35 jets sold to Israel have directly led to breaches of international humanitarian law, ministers have told parliament.\nMinisters have also rejected calls for an independent audit of UK arms sales, but admitted they were not in a position to say if Israel’s assault in Gaza had led to any breaches of humanitarian law owing to the complexity of the fighting terrain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "033f6c3a0453a4ad353120f19c76d89f4cccd58a",
      "title": "Smart ring maker Oura’s CEO addresses recent backlash, says future is a ‘cloud of wearables’",
      "url": "https://techcrunch.com/2025/09/09/smart-ring-maker-ouras-ceo-addresses-recent-backlash-says-future-is-a-cloud-of-wearables/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T15:37:58.000Z",
      "summary_90w": "",
      "raw": "Oura CEO Tom Hale is trying to set the record straight about the smart ring maker's partnership with the Department of Defense (DoD) and data miner Palantir, which is used by defense, intelligence, and law enforcement agencies in the United States and elsewhere.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4eaa339868a377c0788ba2836edaa05888345e45",
      "title": "New emojis will include Bigfoot, orca whale, treasure chest, and more",
      "url": "https://techcrunch.com/2025/09/09/new-emojis-will-include-bigfoot-orca-whale-treasure-chest-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T15:36:27.000Z",
      "summary_90w": "",
      "raw": "The Unicode Consortium has confirmed its next slate of emojis, coming in the next year to eager thumbs near you.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b6c653830a09a7b83e60d235b433366ef9d4cb9",
      "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
      "url": "https://www.bbc.com/news/articles/cr4qx6377qgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T15:33:01.000Z",
      "summary_90w": "",
      "raw": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "915ebd81df01ad0174a3a261ac49eb5a1d1be4fc",
      "title": "Prince Harry donates £1.1m to Children in Need",
      "url": "https://www.bbc.com/news/articles/ckg2xknwyp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T15:25:12.000Z",
      "summary_90w": "",
      "raw": "Prince Harry offers support to a project tackling youth violence in Nottingham.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dcd51a78081f3c802dc52c5154e4807664ccecc3",
      "title": "Phillipson and Thornberry among six Labour deputy hopefuls",
      "url": "https://www.bbc.com/news/articles/c3rvqv9yg4eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T15:16:26.000Z",
      "summary_90w": "",
      "raw": "Candidates have until the end of Thursday to secure enough backing from Labour MPs to take part.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6d2b2f035cf173b33c0ae11878437efd5889f96",
      "title": "Slashing migration would actually lead to higher house prices in Australia. Here’s why",
      "url": "https://www.theguardian.com/business/2025/sep/10/slashing-migration-would-actually-lead-to-higher-house-prices-in-australia-heres-why",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:00:46.000Z",
      "summary_90w": "",
      "raw": "Economic modelling reveals the effects of eliminating migration for a decade on growth, the workforce and the budget\n\nGet our breaking news email, free app or daily news podcast\n\nThink closing our borders would fix the housing crisis? Think again.\nEliminating migration for the coming decade would actually leave property prices 2.3% higher by the mid-2030s, according to economic modelling by KPMG; and there are other negative economic consequences too.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5514135c085b69262bd873673ff4792934f187ed",
      "title": "Victorian Labor targets affluent Melbourne suburbs for rezoning to allow 16-storey apartment towers",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/victorian-labor-targets-affluent-melbourne-suburbs-for-rezoning-to-allow-16-storey-apartment-towers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:00:46.000Z",
      "summary_90w": "",
      "raw": "Under the plan, the state government will seize planning controls for the designated areas – near train and tram stops – from local councils\n\nGet our breaking news email, free app or daily news podcast\n\nAffluent Melbourne suburbs such as Hampton, Hawthorn and Kew could be rezoned to allow apartment towers of up to 16 storeys, according to new draft maps released by the Victorian government.\nThe premier, Jacinta Allan, and the planning minister, Sonya Kilkenny, will on Wednesday release the maps showing proposed heights and boundaries for 25 of the government’s 50 activity centres, which were first announced in October 2024.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf4ceef2db24dfebd362fa722a8d92a51789bf91",
      "title": "Pocock questions Bishop’s ANU leadership as pressure builds for chancellor and vice chancellor to step down",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/pocock-questions-bishops-anu-leadership-as-pressure-builds-for-chancellor-and-vice-chancellor-to-step-down",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:00:45.000Z",
      "summary_90w": "",
      "raw": "Independent senator claims there was ‘no faith’ in leadership of Genevieve Bell or Julie Bishop among university staff\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nDavid Pocock has called on the federal government to urgently intervene into the leadership crisis at the Australian National University as pressure mounts on the chancellor and vice-chancellor to resign.\nIt comes after the independent senator told ABC earlier on Tuesday he hoped to see “some change in leadership at the top” of ANU, following a tumultuous year including redundancies, proposed course closures and allegations of a toxic work culture.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b7bbe56c335a5284801381e0fb0268841ce0acb",
      "title": "'The Office' creators deliver 'The Paper,' a sharp mockumentary about journalism",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535137/the-office-creators-deliver-the-paper-a-sharp-mockumentary-about-journalism",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T14:54:18.000Z",
      "summary_90w": "",
      "raw": "The issues facing journalism these days — from online clickbait to corporate interference — run throughout The Paper. But it's primarily a comedy, with characters and actors that will win you over.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8fcc1415e5b337ebece395e7e0ca12b24126ea76",
      "title": "Apple Intelligence: Everything you need to know about Apple’s AI model and services",
      "url": "https://techcrunch.com/2025/09/09/apple-intelligence-everything-you-need-to-know-about-apples-ai-model-and-services/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T14:51:52.000Z",
      "summary_90w": "",
      "raw": "Apple Intelligence was designed to leverage things that generative AI already does well, like text and image generation, to improve upon existing features.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c8806bc79f439f27ac2774b287d7319b8a569d12",
      "title": "Israeli strike targets senior Hamas leadership in Qatar",
      "url": "https://www.bbc.com/news/articles/ced58zywdwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T14:50:38.000Z",
      "summary_90w": "",
      "raw": "A Hamas official says the group's negotiating team was targeted during a meeting in Doha.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2cbc52a60c278440b9feaacfd22134c511670f48",
      "title": "Russian air strike kills 24 in pension queue, Ukraine says",
      "url": "https://www.bbc.com/news/articles/c1jz08j8313o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T14:36:46.000Z",
      "summary_90w": "",
      "raw": "The attack targeted the eastern village of Yarova, officials say, a few kilometres from the front line.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d3fe54eb2166cf9b3ac8d3643b89d908d7232c6",
      "title": "Spanish government moves to ban smoking on bar terraces",
      "url": "https://www.theguardian.com/world/2025/sep/09/spanish-government-moves-ban-smoking-bar-terraces",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:36:29.000Z",
      "summary_90w": "",
      "raw": "Tobacco law would also prohibit minors from using vapes and stop sale of single-use electronic cigarettes\nThe Spanish government has approved a draft tobacco law that would ban smoking and vaping on bar and restaurant terraces, prohibit minors from using vapes and related products, and end the sale of single-use electronic cigarettes.\nThe legislation, which was signed off by the cabinet on Tuesday morning, is intended to “reinforce protections on people’s health and to adapt the law to consumption patterns and to the tobacco-product market”, according to the health ministry.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ae288da0ea3ad84e91b0a0a1132ed070bcbe08c",
      "title": "Where top VCs are betting next: Index, Greylock, and Felicis share 2026 priorities at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/09/want-to-know-where-vcs-are-investing-next-be-in-the-room-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T14:36:00.000Z",
      "summary_90w": "",
      "raw": "Where are top VCs placing bets in 2026? Hear from Index Ventures’ Nina Achadjian, Greylock’s Jerry Chen, and Felicis’ Viviana Faga on the Builders Stage at TechCrunch Disrupt 2025, October 27–29 in San Francisco.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54c811e354dd58ba41b5872e4c20b6f6b1979314",
      "title": "Dozens of DR Congo mourners killed in attack linked to jihadist group",
      "url": "https://www.bbc.com/news/articles/czdj4qgm4d9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T14:30:05.000Z",
      "summary_90w": "",
      "raw": "A funeral ceremony was being held in a village when the night-time assault took place, officials say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows annual hiring was overstated by 911,000 jobs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dca2ecd0afbc054bf1d12216cba5a31ed1155838",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "url": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:16:54.000Z",
      "summary_90w": "",
      "raw": "ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery\nAn international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.\nThe ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.\nReuters and Agence France-Presse contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3dae5db8ecaa3c4d1cf2664358ae0f482b04fc10",
      "title": "Who could replace Angela Rayner as Labour deputy leader?",
      "url": "https://www.bbc.com/news/articles/c8jm9lk19v3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T14:08:09.000Z",
      "summary_90w": "",
      "raw": "The winning candidate - voted for by Labour members - will be announced on 25 October.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e00c3ad0cd32fdd94a1bab9b57be77b81c34ad5",
      "title": "Greta Thunberg flotilla says Gaza aid boat hit by drone attack in Tunisia",
      "url": "https://www.theguardian.com/world/2025/sep/09/flotilla-carrying-aid-to-gaza-struck-by-flaming-object-video-shows-sidi-bou-said-port-tunisia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:06:19.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla shares video showing vessel being hit by flaming object at port, but says its mission will go ahead\n\nMiddle East crisis – live updates\n\nA flotilla carrying aid for Gaza and pro-Palestinian activists including Greta Thunberg says one its boats has been struck in a drone attack while docked in Tunisia.\nThe Global Sumud Flotilla (GSF) shared a video showing one of its boats being hit by a flaming object at Sidi Bou Said port, near the Tunisian capital, Tunis. “One of the flotilla’s main boats … was struck by a drone in Tunisian waters,” GSF said. “The boat is sailing under the Portuguese flag and all six passengers and crew are safe.”\nReuters contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd32b6490e1052d8fca48f8c2ecfafd9e769a734",
      "title": "Premier League clubs seek clarity over Man City 'settlement'",
      "url": "https://www.bbc.com/sport/football/articles/cy859l0xw89o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T14:03:27.000Z",
      "summary_90w": "",
      "raw": "Premier League clubs want more clarity about the settlement of a legal dispute with Manchester City over the rules that govern commercial deals, BBC Sport has been told.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31bd01bf9c60501d44aa088c1b19295afecb7b55",
      "title": "France to get third PM in a year as Bayrou resigns after confidence vote – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:02:44.000Z",
      "summary_90w": "",
      "raw": "Emmanuel Macron to name successor ‘within days’ as political crisis grips France\n\nFrance to get third PM in a year\n\nLithuania has also said it will strengthen its borders with Belarus and Russia during the Zapad military exercise, the country’s border guard said today.\nThe authorities said they would carry “even more active border monitoring, patrols, and other border control measures,” looking for any potential border violations and provocations against Lithuania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b2ccbe619eb773df29b79a84dff8a8e8527486",
      "title": "Proposed ‘nation-leading’ NSW childcare reforms to include $500,000 fines",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/proposed-nation-leading-nsw-childcare-reforms-to-include-500000-fines",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Greens welcome Minns government’s ‘bare-minimum’ changes but say more work is needed to restore faith in the sector\n\nGet our breaking news email, free app or daily news podcast\n\nLarge childcare providers found in breach of safety directives will face $500,000 fines – a 900% increase – under new laws to be introduced by New South Wales parliament on Wednesday.\nThe proposed legislation will grant greater powers to the early childhood regulator to suspend educators and revoke quality ratings in a suite of measures addressing grave concerns about safety in the sector.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bbea9208e9d5e8c0563a938e565e9ff69238f913",
      "title": "Geothermal is too expensive, but Dig Energy’s impossibly small drill rig might fix that",
      "url": "https://techcrunch.com/2025/09/09/geothermal-is-too-expensive-but-dig-energys-impossibly-small-drill-rig-might-fix-that/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Dig Energy's water-jet drilling right promises to cut drilling costs by up to 80%, helping geothermal heating hit price parity with fossil fuel furnaces.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3eec95e140effec48e6ec538b87b4b8aa80a1b74",
      "title": "Macron under pressure to name new PM as France simmers ahead of protests",
      "url": "https://www.bbc.com/news/articles/c4gqx0zk72lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T13:57:55.000Z",
      "summary_90w": "",
      "raw": "François Bayrou has handed in his resignation, leaving France without a prime minister on the eve of nationwide protests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "365cd288398b5d86d04dbd8c81a918383729c3d8",
      "title": "Israel says it targeted senior Hamas leaders in a strike in Qatar",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535210/israel-qatar-hamas-doha",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T13:47:50.000Z",
      "summary_90w": "",
      "raw": "The Israeli military says it carried out an airstrike in the capital of Qatar targeting senior leaders of Hamas. A Hamas official tells NPR there were five fatalities but no leader was killed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bef72ba93e9f5f14c24ef3ccea966e320ec4a875",
      "title": "Plex urges users to change passwords after data breach",
      "url": "https://techcrunch.com/2025/09/09/plex-urges-users-to-change-passwords-after-data-breach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T13:47:22.000Z",
      "summary_90w": "",
      "raw": "Plex said that it was aware of a security incident involving the theft of Plex customer account information, including user names, email addresses, scrambled passwords, and unspecified authentication data.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Nepal anti-corruption protests explained",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T13:19:41.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned violent after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Why are young people protesting in Nepal and what are their demands?",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T13:19:41.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned violent after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32db2407a94e414f83c0b83b96fc7c1cdc34389d",
      "title": "White House denies Trump's alleged birthday message to Epstein is authentic",
      "url": "https://www.bbc.com/news/articles/cvgqnn4ngvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:48:55.000Z",
      "summary_90w": "",
      "raw": "The message purportedly written by Trump is inside a 238-page book released by a House committee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2531ba2b3c8c96d29255730ce230d95b05359ad1",
      "title": "Nuclearn gets $10.5M to help the nuclear industry embrace AI",
      "url": "https://techcrunch.com/2025/09/09/nuclearn-gets-10-5m-to-help-the-nuclear-industry-embrace-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T12:45:00.000Z",
      "summary_90w": "",
      "raw": "Nuclearn has developed AI tools to help reactor operators automate routine paperwork. \"Think of it as the junior employee,\" the company tells customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c611799b1dd712668936d7ffc4e6d15546ad851e",
      "title": "'We want trophies' - Postecoglou replaces Nuno at Forest",
      "url": "https://www.bbc.com/sport/football/articles/cvgq6495gd6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:31:37.000Z",
      "summary_90w": "",
      "raw": "Tactical analysis and fan opinion as Ange Postecoglou returns to the Premier League, three months after being sacked by Tottenham.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5995095ba214392cf4a6ff8e56c5f9a38cf629e",
      "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
      "url": "https://techcrunch.com/2025/09/09/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T12:15:00.000Z",
      "summary_90w": "",
      "raw": "Mistral AI, the French company that develops the AI chatbot Le Chat and several foundational large language models, is considered one of France’s most promising tech startups and is arguably the only European company that could compete with OpenAI. “Go and download Le Chat, which is made by Mistral, rather than ChatGPT by OpenAI — […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a6bb5ffe52f6448fb206744d70d6281ddf8b6f36",
      "title": "BlackRock-backed Minute Media acquires Indian AI startup that extracts sports highlights",
      "url": "https://techcrunch.com/2025/09/09/blackrock-backed-minute-media-acquires-indian-ai-startup-that-extracts-sports-highlights/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Minute Media's main reason behind the acquisition is to use VideoVerse's tech and its own publisher network to better distribute content across various sports properties and generate ad revenue out of distributed content.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "06379ae4354c76c42c9e014170ea16068c625eca",
      "title": "Kerry Stokes ordered to pay Ben Roberts-Smith’s $13.5m legal costs after failed defamation suit",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/kerry-stokes-ordered-to-pay-ben-roberts-smiths-135m-legal-costs-after-failed-defamation-suit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T11:52:30.000Z",
      "summary_90w": "",
      "raw": "Seven boss handed bill by federal court after backing the disgraced former soldier in action against Nine Newspapers\n\nGet our breaking news email, free app or daily news podcast\n\nSeven West Media’s chair, Kerry Stokes, has been ordered to pay $13.5m in legal costs to companies who were unsuccessfully sued for defamation by disgraced former soldier Ben Roberts-Smith.\nOn Tuesday, a federal court registrar ordered that Australian Capital Equity Pty Ltd (ACE), Stokes’ private company, pay costs fixed at almost $13.3m, and a further $225,000 in relation to the costs assessment, bringing the total bill to $13.5m.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b3984b0d0eb2e510cdc51e291e349ccf3bdaca9",
      "title": "Israeli military orders all Gaza City residents to evacuate ahead of ground assault",
      "url": "https://www.bbc.com/news/articles/cvg47kvld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:48:49.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Netanyahu says recent strikes on high-rises are \"only the beginning of the main, intensive operation\" to capture the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec005248a3896bda17a53ced282d69a827255940",
      "title": "ICC hears war crimes case against Ugandan rebel leader",
      "url": "https://www.bbc.com/news/articles/c1kwe02vyvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:31:06.000Z",
      "summary_90w": "",
      "raw": "This is the court's first-ever confirmation of charges hearing without the accused present.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1097d90ff1d8a06a7f69bf485cef26b33abb0a4a",
      "title": "Here's what happens when private equity buys homes in your neighborhood",
      "url": "https://www.npr.org/sections/planet-money/2025/09/09/g-s1-87699/private-equity-corporate-landlords",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T11:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes rents go down and neighborhood diversity go up? Corporate landlords. But they also make it harder to own for yourself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f98c627b1125d9bef41b5569afdb653d164a5dd",
      "title": "Inside Kyiv government building hit by missile strike",
      "url": "https://www.bbc.com/news/videos/cwyn3gnnvv3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:52:51.000Z",
      "summary_90w": "",
      "raw": "The BBC's Sarah Rainsford says Sunday's attack caused \"a huge amount of damage\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a0679658bb58128631d353f76513f4692715ccf",
      "title": "SCOTUS lifts limits on LA raids. And, Nation's Report Card shows drops in scores",
      "url": "https://www.npr.org/2025/09/09/g-s1-87737/supreme-court-immigration-order-nations-report-card-jeffrey-epstein",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T10:45:19.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court on Monday issued an order clearing the way for agents to resume aggressive immigration sweeps in LA. And, a new Nation's Report Card shows drops in science, math and reading scores.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drone, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:08:50.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says a fire was started but Tunisian authorities deny that a drone was involved.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f0fef5926ad08fac48daea9ee918216942349fa",
      "title": "Murdochs reach deal in succession battle over media empire",
      "url": "https://www.bbc.com/news/articles/cn825x71g4do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:01:36.000Z",
      "summary_90w": "",
      "raw": "Lachlan Murdoch will retain control of the conservative Fox and News Corp empire under the deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9378e09d87d3a68b88f425c5d0382e5eee98f44a",
      "title": "At least 10 dead after train crashes into bus in Mexico",
      "url": "https://www.bbc.com/news/articles/c98elewrepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T09:40:09.000Z",
      "summary_90w": "",
      "raw": "An investigation is under way after a freight train hit a bus as it tried to cross railway tracks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da7cb89563fafaf57834fa90dd20dcf393876fac",
      "title": "After the latest government collapse, France struggles to find a way forward",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5534427/france-government-collapse-emmanuel-macron-prime-minister",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:03:44.000Z",
      "summary_90w": "",
      "raw": "French President Emmanuel Macron is searching for a fourth prime minister in 12 months, after the National Assembly ousted François Bayrou in a no-confidence vote, making economic reform a challenge.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c4b6d0cfc3efd3305fc212dd0f8fd6bb97946c69",
      "title": "The 2025 Student Podcast Challenge Honorable Mentions",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5530068/npr-student-podcast-honorable-mentions",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Here are the honorable mentions from this year's Student Podcast Challenge, chosen from nearly 2,000 entries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4908a9e47356afa8eac588b20a065e2900a7b343",
      "title": "Norway's left clinches vote win as populist right surges into second place",
      "url": "https://www.bbc.com/news/articles/cq65255l27qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T07:38:58.000Z",
      "summary_90w": "",
      "raw": "Labour has a chance of forming a narrow majority if it secures the support of four smaller parties on the centre left.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8d88eadd40bf7553df55ac7237b44d4b8733ff7",
      "title": "Thai court rules ex-PM Thaksin must serve one year in jail",
      "url": "https://www.bbc.com/news/articles/cly7k2g37g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:41:09.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court ruling is yet another blow to the influential Shinawatra political dynasty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53da7d40f354e288577735c73921e413bb32ffb0",
      "title": "'I want to change the game' - meet Black Ferns star Jorja Miller",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cj6xzexydy6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T06:18:22.000Z",
      "summary_90w": "",
      "raw": "New Zealand's 21-year-old flanker Jorja Miller has emerged as one of the stars of the Women's Rugby World Cup.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9448aa73221d75321a7cae4cc340fbb464b4943",
      "title": "NZ 'suitcase murder': Anti-depressants found in children's bodies",
      "url": "https://www.bbc.com/news/articles/c1wgqpx3q1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:07:00.000Z",
      "summary_90w": "",
      "raw": "A jury heard Hakyung Lee killed her children in an attempted mass suicide after her husband's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a91ffb88860b2e5501809d16529913f88990ffa",
      "title": "OpenAI denies that it’s weighing a ‘last-ditch’ California exit amid regulatory pressure over its restructuring",
      "url": "https://techcrunch.com/2025/09/08/openai-denies-that-its-weighing-a-last-ditch-california-exit-amid-regulatory-pressure-over-its-restructuring/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T06:00:44.000Z",
      "summary_90w": "",
      "raw": "OpenAI executives are discussing a potential relocation out of California as increasing political resistance threatens the company's efforts to convert from nonprofit to for-profit status, according to The WSJ, but the company says it has no plans to leave.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2490d90ed4ec14bc10563301cb4cba1d28932c4",
      "title": "First photos of site where NZ bushman hid children released",
      "url": "https://www.bbc.com/news/articles/cj4y9ev2rw4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T04:32:15.000Z",
      "summary_90w": "",
      "raw": "Police also found a stash of firearms and ammunition at the campsite surrounded by dense vegetation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:30:18.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56bb7bae5d6fad8a89cc779a183e2d37e0cfa7c1",
      "title": "Images of Tom Phillips’ remote campsite revealed a day after fugitive father shot dead by New Zealand police",
      "url": "https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:06:31.000Z",
      "summary_90w": "",
      "raw": "After four years on the run with their father, Phillips’ three children have all been located and are ‘doing well under the circumstances’, say authorities\nPolice in New Zealand have released images and given details of the campsite where two of fugitive Tom Phillips’ children were found, after their father was shot and killed by police on Monday.\nPhillips had spent nearly four years hiding in the wilderness with his children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio. A police officer is recovering in hospital after being shot in the head by Phillips with a high-powered rifle in the standoff. About 11 hours after Phillips was killed, two of his children were found safe and well at the campsite in Waitomo. It is understood the third child was with Phillips at the time of the shooting.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e419c27835ff71dba478ad124f9f55059b51218",
      "title": "Anastacia: Arnold Schwarzenegger made me sing Whatta Man 12 times",
      "url": "https://www.bbc.com/news/articles/cm2zmd2rmnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T00:34:21.000Z",
      "summary_90w": "",
      "raw": "As she celebrates 25 years in music, Anastacia reflects on the gigs she played on her way to the top.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d033bcc9ad5bb685bd656044f345a264761ab17",
      "title": "Ferrari chair to do community service over tax case",
      "url": "https://www.bbc.com/news/articles/c8d7q99yd06o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T23:36:20.000Z",
      "summary_90w": "",
      "raw": "John Elkann and two of his siblings will pay €183m to settle an Italian inheritance tax dispute.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6dade64ae52995623a9e2f23eec4082f04e47baa",
      "title": "Supreme Court lifts limits on  LA immigration raids",
      "url": "https://www.bbc.com/news/articles/c784697j2v8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T21:41:45.000Z",
      "summary_90w": "",
      "raw": "US top court says that immigration agents can stop people based solely on their race, language or job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e04a43f51845386c2aa2ce3b2add249a232808b5",
      "title": "Boris Johnson was paid £240,000 after Maduro meeting, invoice shows",
      "url": "https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:12:48.000Z",
      "summary_90w": "",
      "raw": "Johnson’s office sent invoice to hedge fund manager, which was paid, weeks after meeting Venezuelan leader last year\n\nRevealed: how Boris Johnson traded PM contacts for global business deals\n\nFrom a private jet somewhere over the Caribbean Sea in February last year, Boris Johnson called his old political adversary David Cameron, then the foreign secretary, to notify him of a visit.\nJohnson had taken a day out from a family holiday in the Dominican Republic for an unlikely meeting with the leftwing president of Venezuela, Nicolás Maduro, a man whom Johnson, when in office, had likened to a “dictator of an evil regime”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cd7c4e39cfd0f683f4b2cf54a484029416907d1",
      "title": "Hamas discussing US 'ideas' for Gaza ceasefire after Trump's 'last warning'",
      "url": "https://www.bbc.com/news/articles/cn0rxl7jwwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T18:08:14.000Z",
      "summary_90w": "",
      "raw": "Hamas says it received \"some ideas\" from the US through mediators on how to reach a Gaza ceasefire deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "Why has the French PM had to go and what happens next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T17:18:52.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has lost a confidence vote, sending parliament into another period of chaos and uncertainty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8ffabc41a1ce9e91f468dc28e2cd39800eb6703",
      "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
      "url": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:44:16.000Z",
      "summary_90w": "",
      "raw": "President touted contest in Buenos Aires province – 40% of electorate – as ‘life or death battle’ but won only 34% of vote\nArgentina’s president, Javier Milei, has suffered his worst electoral defeat since taking office, as he faces his administration’s most serious corruption scandal and signs that the economy is slowing.\nIn local legislative elections on Sunday for Buenos Aires province – home to almost 40% of the country’s electorate – the coalition led by the self-styled anarcho-capitalist was beaten by the opposition by 47% to 34%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf8c157d26916af75c042b4ff5a1bc9aefc11af3",
      "title": "Six Israelis killed by Palestinian gunmen at Jerusalem bus stop",
      "url": "https://www.bbc.com/news/articles/cr70ny0l7vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:09:39.000Z",
      "summary_90w": "",
      "raw": "Israeli police say two gunmen were killed after the attack, which was one of the deadliest in the city in years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2bfa8a49cb354c3797aa48d4697c88c17ce4eb85",
      "title": "Lisbon funicular crash victim was 'transport enthusiast'",
      "url": "https://www.bbc.com/news/articles/cq8ev844egpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:08:20.000Z",
      "summary_90w": "",
      "raw": "Sixteen people died when the funicular crashed into a building in the Portuguese capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62ac98efb11351751752e1c7bd3ed059cc97c277",
      "title": "French doctor goes on trial for poisoning 30 patients, 12 fatally",
      "url": "https://www.bbc.com/news/articles/crl5ngj9zwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T11:00:18.000Z",
      "summary_90w": "",
      "raw": "Frédéric Péchier, considered by colleagues to be a highly-talented practitioner, maintains there is no proof of any poisoning.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8090bee0b7bbd41ad9c10cbe8d3aa6af2166b744",
      "title": "World Cup ticket sales are about to begin. Scoring them may not be easy — or cheap",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529273/fifa-world-cup-2026-ticket-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "FIFA is set to launch the first window of regular ticket sales for the 2026 World Cup on Wednesday. Brace yourself: because they may not be easy to get — or cheap.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "92c6e3934c891244053cede02b47ac3dd9bb0119",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:01:03.000Z",
      "summary_90w": "",
      "raw": "Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said\nA fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.\nThe whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2c05487bf4009e970ec540a06f48f1e758431b5",
      "title": "Fugitive father shot dead by police – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T06:17:21.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. Our full report is here: Tom Phillips shot dead after attempted burglary, NZ police confirm\nThe mayor of Waitomo, John Robertson, told the Guardian this morning’s events were the worst possible outcome for the community.\n“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.\nSo it’s just devastating news. Really the worst outcome we could have expected.\nNo day that goes by that I don’t think about all four of them.\nIt hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "560ce79c5ad9c75d0a13333406a1f6952e60334e",
      "title": "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533207/carlos-alcaraz-trump-us-open-tennis-rolex",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T00:37:01.000Z",
      "summary_90w": "",
      "raw": "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "eb321a5ec31ad66b516c657d96408e9d9bbd9c25",
      "title": "More than 90,000 Jeep Grand Cherokees recalled over potential loss of drive power",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533180/jeep-grand-cherokee-recall-plug-in-hybrid",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T23:24:34.000Z",
      "summary_90w": "",
      "raw": "Vehicles impacted by the recall include 2022 to 2026 plug-in hybrid electric models of the Jeep Grand Cherokee.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dbad04708a3dc7972c447fc4ea8545ac9955e61d",
      "title": "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "url": "https://www.bbc.com/news/articles/c5yqg0rln74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T23:14:55.000Z",
      "summary_90w": "",
      "raw": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fb66623af50785279079c5a85f4b29f2fddd222",
      "title": "Postal traffic to U.S. drops over 80% after trade exemption rule ends, U.N. agency says",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533121/postal-traffic-to-us-drops-more-than-80-after-trade-exemption-rule-ends-un-agency-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T17:54:41.000Z",
      "summary_90w": "",
      "raw": "The de minimis rule that allowed small packages worth less than $800 to be exempt from tariffs ended on Aug. 29.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "922661201adabb2ad3a56d0e6c944b1f248a80d3",
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:56:23.000Z",
      "summary_90w": "",
      "raw": "Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers\nThe Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.\n“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military strike against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0821bfdb2476b823c1947bf67d7f1ab6c7c26f63",
      "title": "Has Labour Just Moved Towards the Right?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1cyhy?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:54:00.000Z",
      "summary_90w": "",
      "raw": "With Angela Rayner out, is Keir Starmer’s government more right wing?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5dbb34225979e86522cc6f2fb9796eb6e48b92aa",
      "title": "The Global Story: The deal that broke Ukraine's trust",
      "url": "https://www.bbc.co.uk/programmes/w3ct714l?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "An exploration of the 1994 Budapest Memorandum, intended to enshrine Ukraine's security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "673bb3efe1c54a50e50b0d3cac69138b47323da5",
      "title": "From building dream careers to losing everything",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002d2kp/footballs-financial-shame-the-story-of-the-v11?at_mid=OgibwZ9HpE&at_campaign=Footballs_Financial_Shame_The_Story_of_the_V11&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002d2kp&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Footballs_Financial_Shame_The_Story_of_the_V11&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Unveiling a hidden scandal affecting a group of former players of the Premier League",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}