{
  "version": "1755660760274",
  "generatedAt": "2025-08-20T03:32:40.274Z",
  "items": [
    {
      "id": "a21595e5dca2c4f00850d2032e4eb040d2a72ead",
      "title": "Australia news live: Lehrmann’s appeal argument an ‘astonishing admission’, court told; Albanese says he doesn’t take Netanyahu criticism personally",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/20/australia-news-live-bruce-lehrmann-federal-court-appeal-network-10-lisa-wilkinson-brittany-higgins-parliament-productivity-economic-reform-roundtable-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T03:21:43.000Z",
      "summary_90w": "",
      "raw": "Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nAs I noted in my hello earlier, rain is on the brain in Sydney, with a deluge set to continue for days.\nMelbourne is cold, but lovely, and Adelaide and Hobart are both expecting sunshine today. Brisbane, Perth and Canberra are in for rain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3df5231f3bcf09a26980423ce5719a9dac14d3aa",
      "title": "Australian Book Week is here – and we’d love to see your children’s costumes",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/australian-book-week-is-here-and-wed-love-to-see-your-childrens-costumes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T02:50:06.000Z",
      "summary_90w": "",
      "raw": "The annual event, which promotes literacy, is celebrating 80 years as part of Australian school life\nBook Week is in full swing, marking it’s 80th year celebrating all things reading and literacy for Australia’s schoolchildren.\nThe theme for the week, which runs from Saturday 16 to Saturday 23 August, is “Book an Adventure”, encouraging children to explore new worlds through stories.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f1364ea9d19fe09b75a667fe82c336ae7dd7ae1",
      "title": "Hurricane Erin leaves some US East Coast beaches off limits",
      "url": "https://www.bbc.com/news/articles/c3r41zeqnexo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T02:47:20.000Z",
      "summary_90w": "",
      "raw": "The category two storm threatens to bring life-threatening surf and rip currents to the region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d51c75a7157c829460273751683710475ed025d8",
      "title": "Councils consider legal action over asylum hotels",
      "url": "https://www.bbc.com/news/articles/cp3e221qgeeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T02:41:52.000Z",
      "summary_90w": "",
      "raw": "Nigel Farage says Reform UK-controlled councils will do everything in their power to close the hotels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "897cd5a949e85f1ba5853a425cd114d7c6fb6fe4",
      "title": "Family of New Zealand fugitive on the run for almost four years with his children plead for his return",
      "url": "https://www.theguardian.com/world/2025/aug/20/new-zealand-fugitive-tom-phillips-children-hiding-nearly-four-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T02:41:25.000Z",
      "summary_90w": "",
      "raw": "In a New Zealand television interview, relatives spoke of their anguish since Tom Phillips disappeared with his three children in late 2021\nThe family of a fugitive father who has been hiding for more than three years in New Zealand’s rugged wilderness with his three children has pleaded with the man to come home, in some of their first public comments since he vanished.\nJust before Christmas 2021, Tom Phillips fled into the Waikato wilderness with his children Ember, now 9, Maverick, 1o, and Jayda, 12, following a dispute with their mother. Phillips does not have legal custody of his children.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8ba66dca6706e61484b0a156548f9f26cc4b7df",
      "title": "Australian minister says ‘strength not measured by how many people you can blow up’ as row with Netanyahu escalates",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/australia-israel-tony-burke-netanyahu",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T02:36:39.000Z",
      "summary_90w": "",
      "raw": "Australian home affairs minister’s criticism comes after Israeli prime minister calls Anthony Albanese a ‘weak politician who betrayed Israel’\n\nNetanyahu lashes out at Albanese\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s government has rejected Benjamin Netanyahu’s incendiary criticism and accused some Israeli politicians of “bigoted” views about Palestinians as the extraordinary political fight between the two nations turns uglier.\nThe home affairs minister, Tony Burke – whose refusal of a travel visa for the far-right Knesset member Simcha Rothman stoked criticism from Jerusalem – backed in his decision and criticised the Israeli prime minister over the war in Gaza, where tens of thousands of Palestinian civilians have been killed in Israel’s military and bombing campaign.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d878abc47011950c1db1e8d6d11ffdf056ecf28c",
      "title": "US in talks over 10% Intel stake, White House confirms",
      "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T02:09:58.000Z",
      "summary_90w": "",
      "raw": "The potential deal could involve swapping government grants for shares in the chip making giant.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9ca2e55ad84c4ca9f7af96c394b272ba4d79f9d",
      "title": "Watch: Competitors walk slackline 400m above Chinese gorge",
      "url": "https://www.bbc.com/news/videos/c4glq8d35n3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T01:46:37.000Z",
      "summary_90w": "",
      "raw": "Participants walked between two peaks more than a kilometre apart on a slackline just 2cm wide.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75d1b11f3fcd0f00e3a49339ab49acd70716fc73",
      "title": "The White House just joined TikTok",
      "url": "https://www.theverge.com/politics/762031/trump-white-house-tiktok-account",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T01:21:13.000Z",
      "summary_90w": "",
      "raw": "While it was President Joe Biden who signed the law that would force  ByteDance to sell its stake in TikTok or face a ban, it’s his successor, Donald Trump, who has yet to fulfill his promise of arranging a deal to keep TikTok running, legally, in the United States. The current deadline for a deal is September 17th. Still, it hasn’t stopped Trump’s administration from creating @WhiteHouse on TikTok, which published its first post on Tuesday night: a video celebrating Trump’s accomplishments. \nThe ban has only seen TikTok shut down in the US for one day, and its impact has been delayed three times. The first time was in January, when Trump took office and signed an executive order delaying enforcement of the ban for 75 days; then there was another delay in April, after a potential deal fell through due to Trump’s harsh tariffs against China, and then in June, when he stated that he believed Chinese President Xi Jinping was open to a deal if a buyer emerged. \nWhile Trump tried to ban TikTok in 2020, his stance softened during his re-election campaign once his team learned how many supporters Trump had on the platform. In 2024, the Trump campaign launched its own official account, @TeamTrump, and quickly dominated the platform, getting more followers and views on their content than former Vice President Kamala Harris’s now-dormant campaign account — 2.8 billion to 2.2 billion, according to journalist Kyle Tharp.  A Republican digital operative close to the campaign heavily credited Trump, a former reality TV star, for his ability to generate attention-grabbing moments that could be transformed into viral content. “TikTok is primarily an entertainment app,” he previously told The Verge, “and our usage of it was just significantly more savvy than [the Democrats].”\nAlthough the legality of and ulterior motives behind a TikTok ban remain a serious question, the Trump administration, for now, appears to find utility in maintaining an account on the platform. “Why would I want to get rid of TikTok?” Trump said on Truth Social in January, sharing a post about the billions of views his campaign account continued to rack up. White House press secretary Karoline Leavitt repeated this stance after the government account was launched. “President Trump’s message dominated TikTok during his presidential campaign,” she said in a statement to The Verge, “and we’re excited to build upon those successes and communicate in a way no other administration has before.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bc84a3a9589c12ec2420c2c92b1f2c2db48fb3",
      "title": "Six severed heads found on road in Mexico",
      "url": "https://www.bbc.com/news/articles/c8ry1m202nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T01:07:45.000Z",
      "summary_90w": "",
      "raw": "Police have not given a motive for the killings in a large peaceful region of central Mexico.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4f166f7805dbd3ca59a9053767eb0c5eb4866d1",
      "title": "Final £1 coins featuring late Queen enter circulation",
      "url": "https://www.bbc.com/news/articles/cvgn3nv6g69o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:58:35.000Z",
      "summary_90w": "",
      "raw": "More than 23 million coins are being released, alongside 7.5 million new King Charles III coins.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea2636275147e7463fad5a4731f7732d719f693d",
      "title": "More weight-loss drugs could be offered as part of new diabetes care",
      "url": "https://www.bbc.com/news/articles/cgkr2g3e5p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:51:07.000Z",
      "summary_90w": "",
      "raw": "Diabetes patients should have better and more equal access to newer medicines, says official healthcare body.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8341063f1396bd26cc493552f6cec2506a70adf6",
      "title": "UK independent space agency scrapped to cut costs",
      "url": "https://www.bbc.com/news/articles/c4gmjm8z47jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:35:23.000Z",
      "summary_90w": "",
      "raw": "Britain's space agency is set to be scrapped - a scientist fears the UK space sector could fall behind as a result",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33bf4f5531411109bab2a8ddd105fa7ce3047db2",
      "title": "The Papers: 'Migrant hotels facing closure' and 'Noel: I'm so proud of Liam'",
      "url": "https://www.bbc.com/news/articles/c5ylk2p5p9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:18:19.000Z",
      "summary_90w": "",
      "raw": "The closure of a hotel housing migrants in Epping and the Gallagher brothers make Wednesday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a0930daaa97f3bd477195d43b7b464b83604931",
      "title": "Netanyahu accuses Australian PM of 'betraying' Israel",
      "url": "https://www.bbc.com/news/articles/c5ylkpp77qxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:54:01.000Z",
      "summary_90w": "",
      "raw": "Relations between the countries have frayed since Australia said it planned to recognise a Palestinian state.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2c4b20647cb325fadf763f7517d9f1ee9502c2c3",
      "title": "How many wars has President Trump really ended?",
      "url": "https://www.bbc.com/news/articles/c5y3599gx4qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:49:04.000Z",
      "summary_90w": "",
      "raw": "US President Donald Trump claims to have ended seven wars - is that true?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7813fa3007349ce9f6a82f8d388fe02aaf2edd5",
      "title": "A growing number of 20-somethings are getting what's known as 'baby Botox'",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507247/a-growing-number-of-20-somethings-are-getting-whats-known-as-baby-botox",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T23:39:13.000Z",
      "summary_90w": "",
      "raw": "A growing number of 20-somethings are trying to stop wrinkles from forming on their face with a preventative treatment known as \"baby Botox,\" which freezes facial muscles to limit movement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "22005cf334469873df510be2ee6d1c2c7753393b",
      "title": "Here are the best Apple Watch deals available right now",
      "url": "https://www.theverge.com/21289209/best-apple-watch-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T23:38:41.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch Ultra 2 is currently on sale in select configurations starting at $649, which remains one of its best prices to date. | Photo: Amelia Holowaty Krales / The Verge\t\n\nIn September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now more Apple Watch models on the market than ever before — and a lot more deals to be had.\n \n\nThe best Apple Watch Series 10 deals\nThe best Apple Watch SE deals\nThe best Apple Watch Ultra 2 deals\nA note on the more premium models\n\nBut with all of those options, which one should you pick? Generally speaking, you want to buy the newest watch you can afford so that it continues to receive software updates from Apple. The latest update, watchOS 11, launched in September on the Series 6 and newer models, ultimately leaving those still using an older Series 4 or 5 behind. Fortunately, the next iteration of watchOS will continue to support the same devices when it arrives in the fall, even if Apple is revamping its naming convention in a bid to standardize its operating system names.\nAll that being said, picking up a watch from the latest (or a recent) generation ensures you’re getting a smartwatch with an updated design, a robust number of features, and plenty of sensors.\nNow, let’s get to the deals.\nThe best Apple Watch Series 10 deals\nApple Watch Series 10 (42mm, GPS)\n\nWhere to Buy:\n\n $399 $298 at Amazon\n $399 $298 at Walmart\n $399 $299 at Best Buy\n\n\nApple Watch Series 10 (46mm, GPS)\n\nWhere to Buy:\n\n $429 $329 at Amazon\n $429 $329 at Walmart\n $429 $329 at Best Buy\n\nThe Apple Watch Series 10 represents the latest wearable in Apple’s flagship Series lineup. It features the new S10 SiP chip, faster charging, and a wide-angle OLED display that’s brighter, larger, and easier to read than that of previous models. It weighs half as much as the Ultra, too, and is about 30 percent thinner despite its 42mm and 46mm sizing. Other upgrades include an added depth and water temperature sensor, as well as a new FDA-cleared sleep apnea detection feature, the latter of which is also available on the last-gen Series 9 and Ultra 2.\nWhile the improvements are welcome, the Series 10 isn’t a vast departure from the prior model, the Series 9. That said, it’s currently on sale at Amazon, Walmart, and Best Buy right now in the 42mm sizing with GPS starting at $298 ($101 off), which is just $19 shy of its recent Prime Day low. The 46mm variant, meanwhile, is on sale at Amazon, Walmart, and Best Buy starting at $329 ($100 off) — which is the second-best price we’ve seen on the larger configuration — while the LTE models can be had at Amazon, Walmart, and Best Buy starting at around $399 ($100 off).\nRead our Apple Watch Series 10 review.\nThe best Apple Watch SE deals\n2022 Apple Watch SE (40mm, GPS)\n\nWhere to Buy:\n\n $249 $169 at Amazon\n $249 $169 at Walmart\n $249 $169 at Best Buy\n\n\n2022 Apple Watch SE (44mm, GPS)\n\nWhere to Buy:\n\n $279 $199 at Amazon\n $279 $199 at Walmart\n $279 $199 at Best Buy\n\nThe Apple Watch SE received a refresh in late 2022. It has the same chipset as the Series 8, which is great, but with fewer sensors, no always-on display, and a slightly outdated design compared to the Series 8, 9, and 10. Those omissions might take this out of the running for some people, but it still may be exactly what you’re after. Best of all, it starts at $249 for the 40mm Wi-Fi / GPS model, which is $30 less than the previous generation’s baseline cost. Opting for cellular connectivity increases the starting price to $299 for the 40mm size (the 44mm size adds $20 to each configuration).\nRight now, the best deal on the latest SE can be found at Amazon, Walmart, and Best Buy, where you can pick up the 40mm model with GPS starting at $169 ($80 off). The 44mm / GPS configuration, meanwhile, is available from the same retailers (Amazon, Walmart, Best Buy) starting at $199 ($80 off). If you want the LTE configuration, the 40mm model is on sale at Amazon, Walmart, and Best Buy starting at $219 (also $80 off), which is about $20 shy of the best price we’ve seen on the entry-level LTE configuration.\nRead our Apple Watch SE (second-gen) review.\nThe best Apple Watch Ultra 2 deals\nApple Watch Ultra 2\n\nWhere to Buy:\n\n $799 $649.99 at Amazon (with Alpine Loop)\n $799 $649.99 at Amazon (with Trail Loop)\n $799 $649.99 at Amazon (with Ocean Band)\n\nThe latest Apple Watch Ultra launched at $799 in September with GPS and LTE support, much like the original model. The ultra-capable smartwatch has the most features, sensors, and ruggedness of any Apple Watch model available thus far, along with a display that’s 50 percent brighter than the first Ultra. The 49mm smartwatch also packs Apple’s S9 SiP and second-gen ultra wideband chips, just like the Apple Watch Series 9, while maintaining long-lasting battery life, precise GPS tracking, and a bevy of diving-friendly sensors.\nThanks to Amazon Prime Day, we recently saw the Apple Watch Ultra 2 dip to its lowest price to date in select configurations. Thankfully, it’s still on sale at Amazon with a Trail Loop, an Alpine Loop, or an Ocean Band starting at around $649.99 ($150 off). You can also pick it up in various configurations at Best Buy starting at $649, if you prefer an alternative retailer.\nRead our Apple Watch Ultra 2 review.\nA note on the more premium models\nWhile all of the Apple Watch models and colorways covered here are encased in aluminum (except the Ultra 2, which has a titanium build), Apple does make a more premium range built out of stainless steel and titanium. These offerings are functionally and aesthetically similar to their aluminum counterparts, with slightly refined colors and finishings — polished for the stainless steel and brushed for the titanium. However, they start at much steeper prices of $699 and above. They, too, can often be found on sale, but they’re never discounted as low as the standard base models, so we don’t include them here.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d619b1be4f20cf75a7b89973a8be3965eff35f23",
      "title": "What 'security guarantees' for Ukraine would actually mean",
      "url": "https://www.bbc.com/news/articles/cx2qr08l1yko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:22:36.000Z",
      "summary_90w": "",
      "raw": "There are inherent contradictions in the idea of the guarantees meant to prevent Russia from attacking Ukraine again.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9baf53e9d82931d7b2996c993a7ce09093b708c",
      "title": "US military vets are helping Afghans fight deportation",
      "url": "https://www.bbc.com/news/articles/cq68zq24vg5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:10:18.000Z",
      "summary_90w": "",
      "raw": "Afghan refugees in the US say they fear what would happen if they return to their country, which is now controlled by the Taliban.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bad964bc7a725c6f3fe915cfbc371b2230581b55",
      "title": "Empty homes are on the rise. So why aren't they being used to solve the housing shortage?",
      "url": "https://www.bbc.com/news/articles/c3r413l5n57o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:08:39.000Z",
      "summary_90w": "",
      "raw": "There are almost 720,000 empty homes in England. And many more on social housing waiting lists. Is using one to help solve the other a case of a missed opportunity?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93e5c4b97fa991c092f6d9f61052fb2748ae28b2",
      "title": "Sanex shower gel ad banned over racial stereotype",
      "url": "https://www.bbc.com/news/articles/cn92znzx8zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:05:29.000Z",
      "summary_90w": "",
      "raw": "The TV ad depicted two black models with skin problems and a white model without.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7232bc2e7e7a17fb60bcc1210438887801698dd0",
      "title": "Deel scores a lawsuit win, but not against Rippling",
      "url": "https://techcrunch.com/2025/08/19/deel-scores-a-lawsuit-win-but-not-against-rippling/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T22:47:51.000Z",
      "summary_90w": "",
      "raw": "While Deel is calling this a \"Rippling-aligned\" suit, it's not the lawsuit filed by Rippling involving an alleged corporate spy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "435679f14168d8e54d8f75b19d5f0693ddc1914d",
      "title": "Raducanu & Alcaraz out as polarising US Open event starts",
      "url": "https://www.bbc.com/sport/tennis/articles/cd0d3497mlro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T21:53:29.000Z",
      "summary_90w": "",
      "raw": "Emma Raducanu and Carlos Alcaraz might have lost in the revamped US Open mixed doubles - but they win the hearts of the New York crowd.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6eacfeebbe184b7f37a5785b98c3bab0f95390b7",
      "title": "Google Gemini can now read your Docs aloud",
      "url": "https://www.theverge.com/news/761920/google-docs-gemini-ai-read-aloud",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T21:48:21.000Z",
      "summary_90w": "",
      "raw": "Google Docs will now let you generate an audio version of your documents using AI. In a post announcing the rollout, Google says you can customize Gemini’s AI audio output with different voices and playback speeds.\nThis feature isn’t just for a document’s creator, as Google says readers can access a shared document’s AI-generated audio by selecting the Tool dropdown menu and selecting Audio  > Listen to this tab. Authors can also add a customizable audio button directly in a document by choosing Insert > Audio, which readers can click to start listening.\nGoogle announced plans to let you turn your documents into AI podcasts in April, but this feature seems a lot handier if you just want to listen to what you’ve written. You can only generate audio versions of documents in English and on desktop devices for now.\nGoogle is rolling out audio in Docs to Workspace users with business, enterprise, or education plans, as well as users who have AI Pro and Ultra subscriptions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8df9ab9df7caaf4a5d92edf8761d8869498c0a31",
      "title": "Actor son of murder-suicide victim issues stepdad funeral plea",
      "url": "https://www.bbc.com/news/articles/c4ge878r2vpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T21:22:49.000Z",
      "summary_90w": "",
      "raw": "Callum Kerr, who appeared in Hollyoaks, said it would be \"inappropriate\" for the memory of his late mother to be associated with her husband.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31c42fc1f7c2d64ab21a64a2b7239c9cc9774d99",
      "title": "Practical and political pain for Home Office after hotel ruling",
      "url": "https://www.bbc.com/news/articles/cy40wx73mwzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T21:19:08.000Z",
      "summary_90w": "",
      "raw": "The government will now have to find new places to house asylum seekers, while hoping other areas don't take similar legal action.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ed2576ada550701f24fbc66d1dc985f86c2931f",
      "title": "White House considering Budapest for Putin-Zelenskyy bilateral, report suggests – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T21:10:48.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. You can read our latest full report here:\n\nTrump rules out sending US troops to Ukraine as part of security guarantees\n\nVolodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February, which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough.\nIn his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports.\nA meeting between Zelenskyy and Putin ... could it finally happen?\nThe need for security guarantees agreed – but details unclear\nTrump believes he is very good at solving conflicts\nA potential boost for the US arms industry\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "78222925887b24951497892b4c51de4144663281",
      "title": "Too much to pack, not enough hugs: A Kenyan man's last 48 hours in America",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506209/too-much-to-pack-not-enough-hugs-a-kenyan-mans-last-48-hours-in-america-trump-self-deportation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T21:06:00.000Z",
      "summary_90w": "",
      "raw": "Samuel Kangethe has lived in the U.S. for nearly two decades, but an unresolved immigration case has made him deportable. He's decided to return to Kenya, leaving his wife and three children behind.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f50358e62ec06818f3b2b14403828b5839f550b",
      "title": "President Trump’s Talks with the Leaders of Russia and Ukraine",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507210/president-trumps-talks-with-the-leaders-of-russia-and-ukraine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T20:51:41.000Z",
      "summary_90w": "",
      "raw": "President Trump, Ukrainian President Volodymyr Zelenskyy and seven European leaders met at the White House to talk about ending the war between Russia and Ukraine. The meeting followed a summit between Trump and Russian President Vladimir Putin in Alaska last week.  We dive into the proposals to end the war and how each side might react to them.  We hear from NPR’s correspondent in Moscow and Ukraine’s former foreign minister.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b2ad3bdacc5dc1dd0b032cae42d844bc8d3c82c",
      "title": "Two summits later, Trump still faces tough obstacles in quest for peace in Ukraine",
      "url": "https://www.bbc.com/news/articles/c776edpr10eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T20:48:56.000Z",
      "summary_90w": "",
      "raw": "Meetings in Alaska and Washington were high on pomp and low on breakthroughs, but there were two potentially significant developments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d88bdc7a97987da39cc5b362451a5d3b29e3d645",
      "title": "Google announced the next step in its nuclear energy plans ",
      "url": "https://www.theverge.com/news/761809/nuclear-energy-google-ai-advanced-reactor-kairos-tva-electricity-utility",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T20:45:58.000Z",
      "summary_90w": "",
      "raw": "Google is one step closer to reaching its nuclear ambitions now that it’s working with public power utility Tennessee Valley Authority (TVA) to purchase electricity from a next-generation reactor. It’s the first power purchase agreement for technology this advanced that a US utility has made, according to the companies. \nThe plan is for TVA to buy electricity from a reactor being developed by engineering company Kairos Power in Oak Ridge, Tennessee. Once the reactor is up and running, expected in 2030, it should start supplying electricity to the local grid that serves Google data centers in Tennessee and Alabama. \n\nIf they manage to pull this all off, it could help jumpstart a whole new era for nuclear energy\n\n\nIf they manage to pull this all off, it could help jumpstart a whole new era for nuclear energy in the US. The nation’s current fleet of nuclear reactors uses decades-old technology that has struggled to compete with cheap electricity from gas-fired power plants and solar and wind farms. Kairos Power is building one of the first reactors that proponents hope can usher in a resurgence of nuclear energy, and meet rising electricity demand from Big Tech and AI.\nThe announcement follows news that Google would purchase electricity from “multiple” small modular reactors designed by Kairos Power. The Hermes 2 demonstration plant is the first reactor being developed under that agreement. It expands on the first Hermes demonstration reactor that Kairos broke ground on in July of last year after receiving the first construction permit from the Nuclear Regulatory Commission for a non-water-cooled reactor in more than half a century. \nUnlike conventional reactors that use water, Kairos’ technology uses molten fluoride salt as a coolant. Since the reactor’s molten salt coolant has a much higher boiling point than water and doesn’t reach a boil, the reactor can operate at relatively low pressure. A low-pressure reactor like Kairos’ technology is supposed to cut costs for nuclear energy by getting rid of the need to build big high-pressure containment structures. \nOak Ridge, Tennessee — where Kairos is building Hermes 2 — was once the headquarters for the Manhattan Project. Now, instead of housing facilities enriching uranium for the first atomic bombs, Oak Ridge has become a hub for nuclear energy projects and research. \nEventually, Google aims to help Kairos deploy 500 megawatts of new nuclear capacity in the US by 2035. For context, America’s 94 operating nuclear reactors had a combined capacity of 97,000MW in 2024 and accounted for just under 20 percent of the US electricity mix. Hermes 2 is supposed to reach a capacity of 50MW. \nCompanies that generate carbon pollution-free electricity, like nuclear energy and renewables, can make money by selling the electricity they provide to the power grid and by selling so-called clean energy attributes that are like separate certificates representing the environmental benefits of avoiding fossil fuel emissions. Google will receive clean energy attributes from the Hermes 2 plant through TVA.\nTech companies with climate goals often buy clean energy attributes to try to cancel out the pollution caused by their electricity use. By matching its electricity use with those certificates, a company might claim that it runs on clean energy even if it’s plugged into a power grid that still runs on dirty energy. Extra income from clean energy attributes is supposed to help developers add more carbon pollution-free power to the grid (although research has shown that the environmental benefits are often overestimated). Google’s carbon emissions rose again last year as it ramps up its AI offerings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67f84aebe8c1d4cfc9047e76c9fc0ade15673425",
      "title": "In France, debate heats up over air conditioning",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506223/in-france-debate-heats-up-over-air-conditioning",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T20:45:27.000Z",
      "summary_90w": "",
      "raw": "The politics of air conditioning in France, as the country basks in yet another heatwave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1eace25e4d7ea92a3b06732ddbba121a0b0a13c8",
      "title": "All the news from Gamescom Opening Night Live 2025",
      "url": "https://www.theverge.com/news/760975/gamescom-opening-night-live-2025-news-trailers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T20:26:19.000Z",
      "summary_90w": "",
      "raw": "North Rhine-Westphalia, Cologne: Presenter Geoff Keighley at Gamescom Opening Night Live 2023 | Photo Sascha Thelen / picture alliance via Getty Images\t\n\nWhile it didn’t feature much of Silksong outside of a brief tease — though there’s plenty more coming very soon — the main event for Gamescom, Opening Night Live, did have plenty to show off during its two hour runtime.\nMuch of it was expected and teased ahead of time, including fresh looks at Call of Duty: Black Ops 7, Ghost of Yōtei, and the second season of the Fallout TV series. There was also a solid dose of horror with games like Resident Evil Requiem, Silent Hill F, and Cronos: The New Dawn.\nThese were joined by a handful of fun surprises like a roguelike about doomscrolling from Monkey Island creator Ron Gilbert and a hand-drawn anime based on Sekiro.\nIf you couldn’t watch the whole thing live, here are the highlights. (And be warned, another Geoff Keighley-hosted event isn’t too far off: this year’s edition of The Game Awards is happening on December 11th.)\n\n\n\t\t\t\t\t\nRequiem for a scream.\n\t\t\t\nMore Legends.\n\t\t\t\nRemember the Sunwell.\n\t\t\t\nSome more horrors.\n\t\t\t\nWhat the (Silent Hill) F.\n\t\t\t\nRon Gilbert is making a roguelike.\n\t\t\t\nDispense some Wasteland Justice this December.\n\t\t\t\nWant to get nuts? Let’s get nuts.\n\t\t\t\nMonster Hunter rides (a chocobo).\n\t\t\t\nSekiro comes to the small screen.\n\t\t\t\nIt’s going to be a busy fall for shooters.\n\t\t\t\n“Silksong is real.”\n\t\t\t\nRoutine is still alive.\n\t\t\t\nDotemu’s new fantasy beat ’em launches on October 9th.\n\t\t\t\nSkate on a train.\n\t\t\t\nDotemu is making a Battlestar Galactica game.\n\t\t\t\nGamescom’s Opening Night Live pre-show is about to start.\n\t\t\t\nGet ready for Silksong’s ‘special announcement’ on Thursday\n\t\t\t\nHow to watch Gamescom Opening Night Live 2025",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c18ffbaa888ae0398867adf0818360640af4",
      "title": "Kremlin plays down Zelensky talks as Trump warns Putin may not 'want to make deal'",
      "url": "https://www.bbc.com/news/articles/cn92e52rpjxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T20:23:41.000Z",
      "summary_90w": "",
      "raw": "The US president conceded the war in Ukraine was \"tough to solve\" after several days of high-level talks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e3506841de89996b28a16a09ebb9c8ddce57669",
      "title": "Microsoft employees occupy headquarters in protest of Israel contracts",
      "url": "https://www.theverge.com/ai-artificial-intelligence/761731/pro-palestinian-protests-microsoft-headquarters-redmond-washington-no-azure-tech-for-apartheid",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T20:22:39.000Z",
      "summary_90w": "",
      "raw": "On Tuesday, a group of current and former Microsoft employees, as well as community members, took over a plaza at Microsoft's headquarters in Redmond, Washington, as part of a No Azure for Apartheid protest. They declared the area a \"Liberated Zone\" encampment and said they had changed its name from East Campus Plaza to \"The Martyred Palestinian Children's Plaza.\" The organization, which announced and distributed pictures of the takeover in a press release, said around 50 people were in attendance at the start of the event.\nThe protesters set up tents and artistic homages to the losses in Gaza, including shrouds and a large plate that reads …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "07ae72a57aca8d210e3bfb2fbe31cab2c31739ed",
      "title": "Chili's has staged a remarkable revival in sales",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506272/chilis-has-staged-a-remarkable-revival-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T20:21:58.000Z",
      "summary_90w": "",
      "raw": "The 50-year-old casual dining chain Chili's has posted five straight quarters of double digit sales increases. NPR's Mary Louise Kelly talks with Slate's Dan Kois about what's behind the brand's turnaround.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "845c205ad87dbceeefb8ecdd1cee091f223a3b85",
      "title": "The best deals on 4K TVs",
      "url": "https://www.theverge.com/22371561/best-4k-tv-deals-sale-lg-samsung-sony-tcl",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T19:59:16.000Z",
      "summary_90w": "",
      "raw": "Sony’s Bravia II is currently on sale for a whopping $700 off right now. | Image: Sony\t\n\nThings are looking bright for those who want to nab a great TV in 2025 at a substantial discount. There’s usually a great deal happening on a mid- or high-end TV from LG, Sony, TCL, Hisense, or Amazon’s own Fire TV brand — even if the biggest discounts remain reserved for Black Friday, Cyber Monday, Amazon Prime Day, and during the lead-up to the Super Bowl.\nRight now, there are a number of discounted 4K TVs to choose from, spanning a wide variety of prices, sizes, and feature sets. Whether you want a secondary screen for the bedroom or a high-end OLED that’s built to provide the ultimate gaming or cinematic experience, we’ve picked out the best TV deals.\n\nThe best 4K TV deals for most people\nThe best 4K TV deals for those on a budget\nThe best deals on high-end 4K TVs\n\nThe best 4K TV deals for most people\nTCL QM7K\nIf you want a 55-inch TV with a gorgeous and bright QD-Mini LED panel without spending over $1,000, the TCL’s QM7K is the set to get. It’s currently available at Amazon, Walmart, and Best Buy for around $598 ($700 off), which is its lowest price ever. It features a native 144Hz refresh rate with support for up to 288Hz speeds at 1080p when playing games with VRR. However, only two of its four HDMI ports support those speeds; the other two top out at 4K/60Hz or 1440p/120Hz. It also features a dynamic light algorithm to prevent images from appearing washed out.\nThe TV boasts up to 2,500 local dimming zones, according to TCL, but that depends on the size you get. The folks at Rtings found out that the 65-inch version has 966 zones, though even with fewer of them in the 55-inch model, it should still provide good brightness control. Having more dimming zones means the TV can control the brightness of more precise sections of the screen, helping to avoid blooming, which is when an area around the source of light on the screen is too bright, breaking the realism of the image. The QM7K is powered by TCL’s AiPQ Pro processor, which uses AI to manage its contrast, color, clarity, motion, and upscaling. TCL partnered with Bang & Olufsen to provide the TV’s audio system. You can also get the 75-inch model for around $1,297.99 ($702 off) at Amazon and Best Buy if you want a bigger screen.\nTCL QM7K\n\nWhere to Buy:\n\n $1299.99 $597.99 at Amazon (55-inch)\n $1299.99 $599.99 at Best Buy (55-inch)\n $1999.99 $1299.99 at Walmart (55-inch)\n\nPanasonic Z85\nWe have a dedicated section for high-end OLED TV deals below, but Panasonic’s Z85 is such a good value that it deserves consideration for those on a budget. The 65-inch model is on sale for $799.99 ($1,000 off) at BuyDig and $997.99 ($802 off) at Amazon, which is one of the deepest discounts on our list. The Z85’s OLED panel is its standout feature, as it achieves perfect black levels and vivid color. It has a 120Hz refresh rate panel, and two of its four HDMI ports support that speed at 4K. The Z85 also supports both Nvidia G-Sync and AMD FreeSync Premium, which minimize screen tearing and other visual artifacts when playing on a PC with a compatible video card.\nThe 4K TV features an HCX Pro AI Processor MKII to control its color, contrast, and clarity, optimizing the image and sound quality of whatever you’re watching in real-time. The TV’s audio system features a built-in subwoofer for enhanced bass. The Z85 runs Fire OS, Amazon’s entertainment-focused operating system, so you have the option to use many functions by asking Alexa via its voice-enabled remote. A 55-inch model of the Z85 is also available at BuyDig for just $699 ($900 off), or $897.99 ($702 off) at Amazon.\nPanasonic Z85\n\nWhere to Buy:\n\n $1599.99 $699.99 at BuyDig (55-Inch)\n $1799.99 $799.99 at BuyDig (65-inch)\n $1799.99 $997.99 at Amazon (65-inch)\n\nThe best 4K TV deals for those on a budget\nAmazon Fire TV 4-Series\nAmazon’s Fire TV 4-Series is an affordable option if you want to upgrade a smaller HDTV to a 4K model. The 50-inch model is currently on sale for $289.99 ($110 off) at Amazon. The TV features an LED panel with a 60Hz refresh rate and support for HDR10 / HLG, which is totally sufficient for casual TV viewing or watching movies and TV shows. It runs Fire OS, and comes with a remote that allows you to summon Amazon Alexa with the push of a button for a query or command. You can step up to a a 55-inch model for $359 ($100 off), if you like its modest feature set but want a slightly larger screen.\nAmazon Fire TV 4-Series\n\nWhere to Buy:\n\n $399.99 $289.99 at Amazon (50-Inch)\n $459.99 $359.99 at Amazon (55-Inch)\n\nHisense QD7\nIf your budget is under $500, the 55-inch Hisense QD7 has a lot to offer for its current sale price of around $367.99 ($132 off) at Amazon and Best Buy. It features a QLED panel that can deliver more contrast and brightness than a typical LED TV, with support for HDR10 Plus and Dolby Vision with a peak brightness of 600 nits. The 4K set features a processor capable of AI upscaling and full array local dimming with 160 local dimming zones. A panel with full array local dimming offers better control of brightness and contrast than direct- or edge-lit LED panels (this video from LG shows how it works), providing a more consistent picture across the entire screen. The QD7’s obvious weak point is gaming, due to its 60Hz refresh rate, but if that’s not important to you, it remains a superb value. If you want a larger TV, you can get a 65-inch model for around $487.99 ($112 off) at Amazon and Best Buy.\nHisense QD7\n\nWhere to Buy:\n\n $499.99 $367.99 at Amazon (55-Inch)\n $499.99 $369.99 at Best Buy (55-Inch)\n $599.99 $487.99 at Amazon (65-Inch)\n\nThe best deals on high-end 4K TVs\nSony Bravia 8 II OLED\nIf you want a TV that produces reference-quality images, Sony’s Bravia 8 II (K65XR80M2) is the best choice. It was recently selected as the top TV in Valve Electronics’ 10th annual TV Shootout based on objective and subjective tests conducted by a panel of experts comparing each set to the image on a $43,000 reference monitor. Disclosure: Verge editor-in-chief Nilay Patel was one of the judges. The 55-inch model also recently received a substantial price cut, dropping it to around $2,298.99 ($1,200 off) at Amazon and Best Buy.\nSony’s premium set has a 120Hz refresh rate panel, with two HDMI 2.1 ports that support 4K at 120Hz, and two HDMI 2.0 ports that top out at 4K / 60Hz. It doesn’t support Nvidia’s G-Sync or AMD’s FreeSync Pro, so there aren’t any specific features on this TV that PC gamers can take advantage of. Sony calls the Bravia 8 II its brightest OLED screen yet, and testing conducted by Hometheaterreview found its maximum brightness was 1,880 nits when viewing HDR content. Its predecessor topped out at 1,300 nits HDR video, or roughly 44 percent dimmer. \nThe TV runs on Sony’s XR processor, which uses AI to adjust the color, contrast, and clarity of whatever you’re watching in real time to look better. The judges in the aforementioned TV Shootout chose Sony’s set as the best model for SDR (Standard Dynamic Range) processing, but third of four models compared for HDR (High Dynamic Range) processing. Any OLED TV can show true black, but judges agreed that the Bravia 8 II pulled ahead in grayscale and contrast when viewing SDR video.\nSony says its TV has modes calibrated for Netflix, Prime Video, and its own Sony Pictures Core streaming services, too. Sony Picture Core is a streaming service that’s available on select Bravia TVs and Sony gaming consoles, and allows you to stream or download 4K movies at far higher bitrates than competing services. The Bravia 8 II comes with 10 credits, which you can use to download movies for offline viewing, and two years of unlimited streaming for films in its catalogue.\nIf you want this TV in a larger size, Amazon and Best Buy have the 65-inch model marked down to around $2,998 ($501 off).\nSony Bravia 8 II\n\nWhere to Buy:\n\n $2999.99 $2298 at Amazon (55-inch)\n $2999.99 $2299.99 at Best Buy (55-inch)\n $3499.99 $2998 at Amazon (65-inch)\n\nLG C4 OLED\nThe last-gen LG C4 remains one of the best OLED TVs you can buy, and the 65-inch model is currently on sale for around $1,396.99 ($204 off) at Amazon, B&H Photo, and Best Buy. Like LG’s newer C5 OLED, it has a 120Hz panel with support for VRR, Nvidia G-Sync, and AMD FreeSync Premium (the option exists to enable a 144Hz mode if you dig in the TV’s options). Its embedded A9 AI Processor Gen7 offers higher-quality video upscaling and image optimization compared to the C3. The biggest difference between the C4 and C5 is their maximum brightness. The C4 tops out at an advertised 1,000 nits, while the C5 tops out at around 1,165 according to tests conducted by Tom’s Guide.\nAdditionally, the C4 features a three-channel audio system, which might sound impressive compared to other TVs, but still can’t compete with a soundbar. When you’re not watching videos or playing games, you can also enable the C4’s Gallery Mode to display art. Basically, the LG C4 offers many of the same features as the C5, but retails for nearly $400 less. You can also save on the 77-inch model, which is on sale for around $2,496.99 ($1,000 off) at Amazon, B&H Photo, and Best Buy.\nLG C4\n\nWhere to Buy:\n\n $1596.99 $1396.99 at B&H Photo (65-Inch)\n $1599.99 $1396.99 at Amazon (65-Inch)\n $3496.99 $2469.99 at B&H Photo (77-Inch)\n\nSony A90K\nSony’s 42-inch A90K is a premium OLED TV that it claims is specially optimized with features for gaming on a PlayStation 5, but realistically, all of the TVs in this list work great with the PS5 — not to mention all other modern consoles. It’s currently on sale for around $1,198 ($100 off) at Amazon, B&H Photo, and Best Buy. The TV has a 120Hz panel, with two HDMI 2.0 ports and HDMI 2.1 ports.\nAbout the special PS5 features, if you connect the console to the A90K, the TV will automatically enable Auto HDR Tone Mapping for more accurate colors, along with an Auto Genre Picture Mode that will adjust its settings based on the game you’re playing. Sony’s Cognitive Processor XR automatically adjusts the TV’s contrast, brightness, and colors.\nThe A90K can access Sony Pictures Core, a movie streaming platform exclusive to higher-end Sony TVs that allows you to watch uncompressed 4K movies. Sony includes 10 credits to build your Sony Pictures Core library, plus 24 months of streaming access. The aforementioned library is more limited than other streaming services, but it’s the closest you’ll get to watching a 4K Blu-ray without having to pop in a disc. Sony also offers the A90K in a 48-inch size, and you can pick one up at Amazon and Best Buy for around $1,298 ($102 off).\nSony A90K\n\nWhere to Buy:\n\n $1298 $1198 at Amazon (42-Inch)\n $1299.99 $1199.99 at Best Buy (42-Inch)\n $1399 $1298 at Amazon (48-Inch)\n\nSony A95L\nSony’s 55-inch A95L is a premium TV with features that should appeal to gamers and cinephiles alike, and you can get it for around $2,198 ($601 off) at Amazon, B&H Photo, and Best Buy. The TV has a 120Hz panel and two HDMI 2.1 ports (four HDMI ports total), so you can play games in 4K at up to 120 frames per second. Its two HDMI 2.0 ports are fine for last-gen consoles like the original Nintendo Switch. If you connect a PS5, the TV will adjust its video settings based on the genre of game you’re playing, which is a nice touch, but games on that console will look incredible on any OLED set.\nSony’s Cognitive Processor XR powers the A95L, which enables better motion processing so sports and games look less blurry. It also claims to improve the contrast and colors compared to previous generation Sony TVs. It has a peak brightness of 1,300 nits according to lab tests by Tom’s Guide, which is higher than most of the other OLED TVs we found on sale.\nThe A95L is a Bravia-series TV, which means it can access Sony’s Picture Core. This video on demand service has the highest-bitrate (aka video quality) of any streaming platform, which means what you watch will look closer to an uncompressed 4K Blu-ray than a 4K stream from Netflix. Its library is limited, but Sony includes 10 credits with A95L, so you can download movies to keep forever, and a 24-month subscription that lets you stream videos from the library.\nIf you want a higher-end OLED TV, Sony’s A95L is a great choice and has features you won’t find on non-Sony TVs. You can also get the 65-inch model on sale for around $2,898 ($601 off) at Amazon, Best Buy, and B&H Photo.\nSony A95L\n\nWhere to Buy:\n\n $2799 $2198 at Amazon (55-Inch)\n $2699 $2199.99 at Best Buy (55-Inch)\n $3499.99 $2898 at Amazon (65-Inch)\n\nUpdate, August 19th: Updated pricing / availability and added a newer deal on Sony’s A90K.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6940cbefdd7f8022c1efb1343858f14b1e5d38ea",
      "title": "Oasis blown away by reunion, says Noel Gallagher",
      "url": "https://www.bbc.com/news/articles/cdrk267ldy7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T19:49:11.000Z",
      "summary_90w": "",
      "raw": "The songwriter added it was great to be back in a band with his brother Liam after 16 years apart.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "428649f82c24fcb60939bc1264816eab0af367b5",
      "title": "Here are the best robot vacuum deals available right now",
      "url": "https://www.theverge.com/24350561/best-robot-vacuum-mop-irobot-roomba-eufy-roborock-deals-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T19:45:55.000Z",
      "summary_90w": "",
      "raw": "The Dreame L20 Ultra robot vacuum is down to a new low price. | Photo by Jennifer Pattison Tuohy / The Verge\t\n\nWe’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordable way to experience that promised utopia right now.\nToday’s floor cleaners are also more advanced than ever. In addition to vacuuming, many of the best models can now mop, allowing you to tackle both carpet and hardwood flooring. Some can automatically dispense of their trash and dirty water, too, and clean their own components without intervention. We now even have models that can pick up dirty laundry and purify the air in your home, preventing you from having to lift a finger.\n\n\n\n\n\nThe best Roborock deals\nThe best Dreame deals\nThe best SwitchBot deals\nThe best Eufy deals\nThe best Yeedi deals\nThe best Shark deals\nThe best Roomba deals\nOther robot vacuum deals\n\nBut if you need something relatively affordable for daily cleaning, you’d be surprised how little you have to pay for premium features. Below, we’ve listed the best deals currently available on a slate of Verge-approved robot vacuums, whether you prefer a budget entry-level model from Yeedi or a top-of-the-line offering from iRobot, Dreame, and more.\nThe best Roborock deals\nRoborock’s S8 MaxV Ultra, our pick for the best robot vacuum overall, is available at Amazon, Best Buy, and directly from Roborock for $1,299.99 ($500 off), which is one of its better prices to date. The combination of a 10,000Pa suction power and dual rubber roller brushes makes it a terrific vacuum, one that can easily pick up pet hair and other debris. It can also mop with great efficiency thanks to a sonic mopping system that vibrates the mop pad 4,000 times a minute, allowing it to clean sticky juices, thick condiments, and other common spills. The mop arm can extend to cover corners and baseboard edges, too.\nThe S8 MaxV Ultra’s camera-equipped AI obstacle avoidance makes it the best navigator in Roborock’s lineup and one of the top models overall, though it’s not quite as strong as Roomba’s. The mobile app offers ample options to customize cleaning zones and schedules, and you can use its dedicated voice assistant to start and stop routines. It’s also a Matter-ready robot that’s compatible with Amazon Alexa, Google Home, and Apple Home.\nRoborock S8 MaxV Ultra\nWith top-notch vacuuming performance, an easy-to-use app, and built-in voice control, the S8 MaxV Ultra is a superb vacuum and good mop. It features Roborock’s best obstacle detection, innovative features like dirt detection, and a hands-free dock that makes it an expensive but excellent choice.\n\nWhere to Buy:\n\n $1799.99 $1299.99 at Amazon \n $1799.99 $1299.99 at Best Buy\n $1799.99 $1299.99 at Roborock\n\nThe Roborock Q8 Max Plus is a cheaper alternative you can currently pick up from Walmart for $379.99 ($440 off), which is a new record low price. It isn’t as powerful or feature-packed as the S8 MaxV Ultra, but it still delivers a solid 5,500Pa of suction power, rendering it good enough for most cleaning tasks. It also handles mopping well, with 30 adjustable water flow levels and a sizable 350ml water tank that allows it to cover larger areas without frequent refills. The robovac can map your home efficiently and avoid most obstacles thanks to built-in lidar navigation, though it lacks a built-in camera for advanced object recognition.\nRoborock Q8 Max Plus\nThe Roborock Q8 Max Plus offers strong 5,500Pa suction, solid mopping features, and reliable obstacle avoidance.\n\nWhere to Buy:\n\n $819.99 $379.99 at Walmart\n\nThe best Dreame deals\nThe Dreame X40 Ultra is a self-extending mopping robot, and while it’s on the more expensive side, you can currently pick it up for $899.99 ($600 off) at Amazon (for Prime members) and directly from Dreame, which is one of its better prices to date. You’re paying a premium for 12,000Pa of suction power and a pair of removable, self-retracting mop pads, which it can automatically clean and dry on its own using the included base. It can also empty its own bin and refill its own water tank.\nThe Dreame X40 Ultra features an extendable side brush and mop pads, too, offering better coverage for baseboards, corners, and the underside of your furniture. It uses a combination of AI-powered cameras and “3D-structured light” (presumably based on lidar technology) to map and navigate rooms, with customizable keep-out zones and more functions available in the app. There’s also a dirt detection system that can identify messier spills and adjust its cleaning routine accordingly.\nDreame X40 Ultra\nWith a neat ability to remove and reattach its mop pads, the Dreame X40 solves the problem of vacuuming carpets (with 12,000Pa suction power) while also mopping hard floors. Its mops can also swing out and under low furniture, getting where most bots can’t reach.\n\nWhere to Buy:\n\n $1499.99 $899.99 at Amazon (with Prime)\n\nThe Dreame L20 Ultra is currently available for $449.99 directly from Dreame, down from $999.99 and a new all-time low price.  The L20 Ultra is an excellent alternative to Dreame’s newer flagship robots, including the X40. It lacks a bit of power in comparison, though its 7,000Pa of suction power is still enough for most cleaning jobs. It also doesn’t have the L40’s tri-cut brush, which makes the step-up model more efficient at picking up pet hair. The only other real advantage the X40 holds over the L20 is its self-extending arms for vacuuming (though the dual mop pads can extend a bit for baseboard and corner coverage), nor does it have dirt detection.\nThe L20 Ultra’s base station is rather large, but it can take care of the entire cleaning process, including emptying the dustbin, emptying and refilling the water tanks, and washing and drying the mop pads. It doesn’t have a heated cleaning function for the mop pads, however. It uses a lidar-based AI-powered navigation system, and you can prompt it to start cleaning by voice using Amazon Alexa and Google Assistant voice commands.\nDreame L20 Ultra\nThe L20 Ultra is a great all-around bot that can remove its mop pads to vacuum carpet and do the splits with its mops to better clean your baseboards. It has 7,000Pa suction, a bigger base station, and fewer advanced cleaning features than the newer X30 and X40 Ultra models, but it’s still an excellent robot vacuum.\n\nWhere to Buy:\n\n $999.99 $449.99 at Dreame\n $999.99 $539.99 at Amazon\n $999.99 $539.99 at Walmart\n\nThe best SwitchBot deals\nThe SwitchBot S10 is available directly from SwitchBot for $399.99 ($800 off) when you use coupon code SLDE800, which is a new all-time low. The S10 is one of the most affordable robot vacuum / mop hybrids you can buy, one that can refill its own tank so long as you hook the battery-powered base station into your home’s plumbing. It can also dry its own mop pads and empty its own bin at a separate docking bay, and offers enough capacity to run for up to 90 days without intervention.\nThe S10’s self-cleaning roller mop is more effective than the typical pads we see in most other units, but it’s also limited to a smaller coverage area. It only has a single roller brush for vacuuming, but its respectable 6,500Pa suction can make up for it. And while it has lidar mapping and AI-powered obstacle avoidance, we found it still has a tendency to get stuck on laundry, bath mats, and other obstacles. The S10 is also one of the few robovacs with Matter support, however, which effectively enables native control through Apple Home, Google Home, and Alexa (though said platforms don’t yet fully support robot vacuums).\nRead our SwitchBot S10 review.\nSwitchBot S10\nThe S10 is a great mopping robot with a battery-powered water refill dock that makes it the most hands-free robovac we’ve tested. A separate auto-empty dock takes care of the dust. It’s big and loud and lacks some features found on high-end robots, but it does a great job of keeping your floors clean.\n\nWhere to Buy:\n\n $1199 $399.99 at SwitchBot (with code SLDE800)\n $1199 $499.99 at Amazon \n\nThe SwitchBot K10 Plus is available for $179.99 ($220 off) from SwitchBot (with promo code SLDE220), one of its better prices, through August 19th. At 3.6 inches high and 9.8 inches wide, it’s a more petite option if you want something that can maneuver tighter spaces, which it does to decent success with a lidar-based mapping system that supports digital keep-out zones. It only has 2,500Pa suction, but that should be powerful enough to lift dirt in all but the deepest carpeting. You can also attach disposable mopping pads, though their mopping function doesn’t work well. The K10 Plus comes with a self-emptying dock that can hold a respectable four liters of dirt before it needs emptying.\nSwitchBot K10 Plus\nThe smallest robot vac on the block, the K10 Plus, doesn’t compare to the other bots here in terms of performance, but if you have a small space where other vacs can’t get to, it’s better than nothing. It’s also very quiet, making it ideal for small spaces like home offices and bedrooms or a very small studio apartment.\n\nWhere to Buy:\n\n $399.99 $179.99 at SwitchBot (with code SLDE220)\n $399.99 $239.99 at Amazon\n\nThe best Eufy deals\nThe Eufy X10 Pro Omni — our current pick for the best midrange robot vacuum / mop — is down to $549.99 ($250 off) at Eufy’s online store when you use promo code WS24T2351, with Amazon and Best Buy matching that deal.\nThe X10 Pro Omni is a bit of a novelty, at least in comparison to other robovacs in its price range, in that it offers AI-powered obstacle detection, which allows it to deftly navigate cables and other clutter. It also features a slew of functions you’d expect from top-of-the-line models, including 8,000Pa of suction power, speedy lidar-powered mapping, and oscillating dual spinning brushes for mopping.\nMind you, none of these features are as effective as they are on more premium models, though the result is an all-in-one bot that punches above its weight. Plus, it has heated mop drying and onboard water reservoir, the latter of which prevents it from having to return to its multifunction auto-empty / wash / fill dock too frequently.\nEufy X10 Pro Omni\nThe X10 is a great robovac with excellent AI-powered obstacle detection, powerful oscillating mops, a user-friendly app, and good mapping capabilities.\n\nWhere to Buy:\n\n $799.99 $549.99 at Amazon\n $799.99 $549.99 at Eufy (with code WS24T2351)\n $799.99 $549.99 at Best Buy\n\nNow through August 24th, the Omni S1 Pro is on sale for $699.99 ($600 off) when you purchase it from Eufy with offer code WS24T2071111. The S1 Pro is an excellent robovac if you have mostly hardwood floors, with a long 11.4-inch roller mop, a square shape, and dual spinning side brushes that leave floors spotless (it can even reach into corners).\nWhat’s more, the S1 Pro is capable of self-washing its own mop with water jets as it cleans, which it can then dry afterward using hot air. It’s also a decent vacuum with 8,000Pa of suction, which is enough power to pick up most debris. Its AI-powered obstacle avoidance system is effective as well, allowing it to navigate around larger objects with relative ease. \nEufy Omni S1 Pro\nThe Eufy Omni S1 Pro’s 11.4-inch roller mop does a great job of cleaning up hardwood floors. It self-washes and dries its mop as it works, while doubling as a decent vacuum with 8,000Pa of suction.\n\nWhere to Buy:\n\n $1299.99 $699.99 at Eufy (with code WS24T2071111)\n $1299.99 $949.99 at Amazon\n\nIf you’re looking for a bump-and-roll model that’s relatively budget-friendly, the discontinued Eufy 11S Max is still on sale at Amazon and Walmart for just $149.99 ($130 off). The 11S Max stands out from other robovacs because it doesn’t use Wi-Fi, meaning it doesn’t require you to fiddle with a mobile app on your phone. Instead, you can control it using an on-board button or with the included remote, which also allows you to create cleaning schedules. It’s relatively quiet and reliable, too, with 2,000Pa of suction power and replaceable parts, making it a great long-term investment for those who want something basic.\nEufy 11S Max\nThe Eufy 11S Max is a super slim, repairable bump-and-roll bot with a large 600ml bin and three cleaning levels. Its biggest selling point for some, however, is that it lacks Wi-Fi, meaning you don’t have to fiddle with an app.\n\nWhere to Buy:\n\n $279.99 $149.99 at Amazon\n $279.99 $149.99 at Walmart\n\nThe best Yeedi deals\nThe Yeedi Cube is currently down to an all-time low of $199.99 ($270 off) at Amazon at checkout. It’s not easy to find a self-emptying / self-cleaning vacuum at this price, as those features are typically only available on robots that cost upward of $600 or more.\nWith 5,100Pa of suction power, the Cube can tackle most common vacuuming scenarios, though its single hybrid rubber / bristle brush can get easily tangled with pet hair. It mops better than most models in its range, however, namely because its vibrating microfiber pads can actually scrub your floors. The Cube uses lasers for object avoidance, too, though it’s not as effective for navigation as those with lidar and AI smarts. It can avoid large furniture and other objects, but it might need your help rerouting around cables, toys, and laundry. Still, we found it navigates better than most other robots under $300.\nYeedi Cube\nOne of the first robots that can vacuum, mop, self-empty, self-wash, and self-dry with hot air for under $1,000, the Yeedi Cube is an older model that currently retails for under $500. It’s a good vacuum and mop for hands-free cleaning on a budget.\n\nWhere to Buy:\n\n $469.99 $199.99 at Amazon\n\nThe best Shark deals\nThe Shark Matrix Plus 2-in-1 is a great robot vacuum / mop hybrid that’s now on sale for $469 ($230 off) at Amazon, which isn’t its $369.99 all-time low price but still a respectable $230 discount. Before the Eufy X10 Pro Omni took its place, the Matrix Plus 2-in-1 was our runner-up pick for those seeking a midrange robot vacuum that mops and automatically empties its own bin. Its vibrating, sonic mopping feature does an excellent job of scrubbing hardwood floors; however, keep in mind that you’ll have to fill and attach the mop reservoir manually.\nShark Matrix Plus 2-in-1 Robot Vacuum and Mop\nThe Shark Matrix Plus 2-in-1 Robot Vacuum and Mop mops very well — doing a swinging, scrubbing movement with its rear end when in “Matrix mode.” However, you have to manually fill and attach the mop reservoir and empty the bin when it mops, as it only self-empties in vacuum mode and can only avoid larger objects.\n\nWhere to Buy:\n\n $699.99 $469 at Amazon\n $699.99 at Shark\n $699.99 at Best Buy\n\nThe best Roomba deals\nYou can get iRobot’s Roomba Combo 10 Max from Amazon and Best Buy for around $599 ($800 off), which is its best price to date. We think it’s the best robot vacuum for pet hair, one that combines high suction power with rotating dual rubber brushes that pick up without getting tangled. What’s even more impressive is that it comes with a new multifunction charging dock that allows it to empty its bin, wash its own mop, and even refill its mopping tank. Add in Matter support, excellent AI-powered obstacle detection, and a retractable mop arm, and you’ve got a robovac that makes cleaning almost entirely hands-free.\nRoomba Combo 10 Max\niRobot’s first mopping bot that can refill its water tank and wash and dry its mop, the Combo 10 Max, features a retractable mop arm and superior suction power. It’s also iRobot’s first robot to support Matter.\n\nWhere to Buy:\n\n $1399.99 $599 at Amazon\n $1399.99 $1199.99 at iRobot\n\nIf you’re working with a tight budget, the Combo i5 is also a good vacuum / mop — one you can pick up on sale directly from iRobot right now for around $199, down from $349.99. It’s not as powerful as the aforementioned Combo 10 Max and can’t refill its water tank or wash and dry its own mop; however, it still features Roomba’s wide, dual rubber brushes, which do an excellent job of picking up dirt and debris. It doesn’t support virtual keep-out zones or Matter, either, though you can schedule it to clean specific rooms at set times. It’s also compatible with both Amazon Alexa and Google Assistant, and like all Roombas, it’s relatively easy to repair.\niRobot Roomba Combo i5\nThe Roomba Combo i5 Plus is the company’s budget vacuum and mop robot with room mapping features but no virtual keep-out zones.\n\nWhere to Buy:\n\n $349.99 $199.99 at iRobot\n\nOther robot vacuum deals\nNarwal Freo X Ultra\nA superior mopping bot with a superior price tag, the Narwal is smart enough to know when it needs to go back and mop more. Its vacuuming is good, and its unique onboard compression bin means no loud auto-emptying. \n\nWhere to Buy:\n\n $1399.99 $699.99 at Narwal\n $1399.99 $699.99 at Best Buy\n\n\nDeebot X8 Pro Omni\nThe Deebot X8 Pro Omni remains our favorite robot vacuum / mop. It represents a welcome return to form for Ecovacs’ flagship line, with great obstacle avoidance, a small dock, and a convenient self-cleaning brush system.\n\nWhere to Buy:\n\n $1399.99 $899.99 at Amazon\n $1399.99 $899.99 at Evovacs\n\n\nTapo RV30 Max Plus\nA budget robot vacuum and mop with high-end features, including room-specific cleaning, carpet boost, and smart navigation, it also features an auto-empty dock for just $80 more.\n\nUpdate, August 19th: Updated to reflect current pricing / availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T19:37:56.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jeanpormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d83408850b2dda18022c7e1b3eb20a61821a1364",
      "title": "Israel demands release of all Gaza hostages, casting doubt on ceasefire proposal",
      "url": "https://www.bbc.com/news/articles/cjeynvp409vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T19:28:51.000Z",
      "summary_90w": "",
      "raw": "It comes a day after Hamas said it accepted a proposal for a 60-day truce, during which around half of the 50 hostages would be freed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64df78f5090ce56ea6dd913e4fb069f1138b44fb",
      "title": "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more",
      "url": "https://techcrunch.com/2025/08/19/made-by-google-2025-how-to-watch-google-debut-the-pixel-10-pixel-watch-4-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T19:27:23.000Z",
      "summary_90w": "",
      "raw": "Google is hosting its Pixel 10 event next week. Learn how to watch the tech giant reveal its new mobile devices and what else you can expect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "93e6d03c7c4e4531f649edf86d10c6cdf123c005",
      "title": "Peruvian woman accused of trying to smuggle cocaine into Bali using sex toy",
      "url": "https://www.theguardian.com/world/2025/aug/19/peruvian-woman-bali-cocaine-smuggling",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T19:23:25.000Z",
      "summary_90w": "",
      "raw": "Officers say they found 1.4kg of drug inside toy in woman’s underwear and also accused her of hiding ecstasy pills\nA Peruvian woman has been arrested in Bali after allegedly trying to smuggle cocaine into the Indonesian resort island using a sex toy and hiding drugs in her underwear, police said.\nThe 42-year-old, identified only by her initials NS, arrived at Bali’s international airport from Qatar on 12 August when authorities became suspicious.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9006d0cd417eb7e172a410bc5c87f9b61251ed8a",
      "title": "Downton Abbey 'iconic' props and costumes up for auction ",
      "url": "https://www.bbc.com/news/videos/c3dpzre97j4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T18:51:43.000Z",
      "summary_90w": "",
      "raw": "Props, costumes and set pieces from the popular British historical drama Downton Abbey are being auctioned for charity in London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31046a93207dc6182e4b89c97d3727c63f49655e",
      "title": "Appeals court says NLRB structure unconstitutional, in a win for SpaceX",
      "url": "https://techcrunch.com/2025/08/19/appeals-court-says-nlrb-structure-unconstitutional-in-a-win-for-spacex/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:42:59.000Z",
      "summary_90w": "",
      "raw": "SpaceX scored a win in a decision from the Fifth Circuit over the labor board's structure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d7040d93ced80935ebce1a04b866b9e1d7552bc4",
      "title": "The best iPad deals you can get right now",
      "url": "https://www.theverge.com/21280354/best-ipad-deals-apple",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T18:36:49.000Z",
      "summary_90w": "",
      "raw": "Apple’s latest iPad Mini supports the Apple Pencil Pro, transforming the tablet into a great note-taking device. | Photo: Amelia Holowaty Krales / The Verge\t\n\nWhile the best iPad deals usually land during major sale events like Black Friday and Amazon Prime Day, many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most affordable iPad. The most recent iPad Pro and iPad Mini are also regularly discounted, as is the latest iPad Air.\n\nThe best iPad (2025) deals\nThe best iPad Mini (2024) deals\nThe best iPad Air (2025) deals\nThe best iPad Pro (2024) deals\n\nIt’s difficult to know where exactly you can find the most notable iPad deals unless you’re scouring the major retailers on a daily basis. But that’s often what our deal hunters at The Verge are doing, so let us help you out. Below, we’ve listed the best deals you can get on each iPad model that is available, from the 11th-gen base iPad to the more powerful models with M3 and M4 chips, all of which are set to receive Apple’s iPadOS 26 update when it arrives in the fall.\nThe best iPad (2025) deals\nApple iPad (11th-gen)\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $349 $299 at Walmart (128GB, Wi-Fi)\n $449 $399 at Amazon (256GB, Wi-Fi)\n\nApple’s 11th-gen iPad landed on the scene in March. The newest base model tablet is a fairly iterative update of the prior model, but with 128GB of base storage (as opposed to 64GB) and the A16 Bionic chip, which is nearly 30 percent faster than the A14 chip used in the 10th-gen iPad. That being said, the newer chip doesn’t support the various Apple Intelligence features introduced in iPadOS 18.1 and subsequent updates. For that, you’ll want to opt for a more recent iPad Air, iPad Mini, or iPad Pro model.\nPricing-wise, the latest iPad starts at $349 with Wi-Fi and 128GB of storage. You can also upgrade to 256GB or 512GB of storage for an additional $100 or $200, respectively, or purchase an LTE model starting at $499. We saw a pretty significant price drop to $279 during Prime Day, though you can still find the entry-level model on sale at Amazon, Walmart, and Best Buy starting at $299 ($50 off). Alternatively, you can purchase the 256GB model at Amazon, Walmart, and Best Buy starting at $399 ($50 off), or the 512GB variant at Amazon, Walmart, and Best Buy starting at $598.50 (about $50 off).\nThe best iPad Mini (2024) deals\niPad Mini (2024)\n\nWhere to Buy:\n\n $499 $474 at Amazon (128GB, Wi-Fi)\n $599 $574.3 at Amazon (256GB, Wi-Fi)\n $799 $764.95 at Walmart (512GB, Wi-Fi)\n\nThe seventh-gen iPad Mini is similar in several ways to the previous model, but comes with some big internal upgrades. It includes faster Wi-Fi and USB-C speeds, support for the Apple Pencil Pro, and a newer A17 Pro processor with 8GB of RAM to support Apple Intelligence. Otherwise, it boasts nearly identical specs and features as the last-gen model, meaning it has an 8.3-inch Liquid Retina display and options for 5G. It may not be worth upgrading if you already own a sixth-gen Mini, but newcomers to the category will appreciate the upgrades.\nThe 2024 iPad Mini starts at $499 with 128GB of storage, which was the price for the previous generation’s 64GB model. Electing for 256GB of storage brings the price up to $599, and the cellular models start at $649. These are some big numbers for a small iPad, so the larger iPad Air might be worth considering if you prefer your dollar to go further with more screen real estate. But if you want an Apple tablet in the smallest possible form factor, this is where the action is.\nRight now, the 128GB base model with Wi-Fi is on sale at Amazon and Walmart starting at $474 ($25 off), which is about $95 short of the all-time low we saw during Prime Day. If you need additional storage, you can also pick up the 256GB variant at Amazon and Walmart starting at $574.30 (about $25 off), or the 512GB model at Walmart for $764.95 (about $35 off).\nThe best iPad Air (2025) deals\n11-inch iPad Air M3\n\nWhere to Buy:\n\n $599 $536.82 at Amazon (128GB, Wi-Fi)\n $699 $623.08 at Amazon (256GB, Wi-Fi)\n $899 $805.83 at Amazon (512GB, Wi-Fi)\n\n\n13-inch iPad Air M3\n\nWhere to Buy:\n\n $799 $716.13 at Amazon (128GB, Wi-Fi)\n $799 $821.18 at Amazon (256GB, Wi-Fi)\n $1099 $1007.51 at Amazon (512GB, Wi-Fi)\n\nThe 2025 iPad Air is little more than a spec bump over the previous model, with a few technical upgrades that should allow it to last longer into the future than either the entry-level iPad or the last-gen Air. It features an M3 chip with support for Apple Intelligence, plus compatibility with Apple’s latest Magic Keyboard that has a larger trackpad and an extra row of function keys. In short, the Air is a credible laptop replacement.\nThe 11-inch model starts at $599 and the 13-inch variant $799 — the same price as prior models — but it’s common to see discounts from third-party retailers. Right now, for instance, the 11-inch Air is on sale at Amazon and Walmart in its base configuration with Wi-Fi and 128GB of storage starting at $536.82 (about $63 off). You can also grab the 256GB model at Amazon and Walmart starting at $623.08 (about $76 off), or the step-up 512GB model at Amazon and Walmart starting at $805.83 (about $94 off).\nThe larger 13-inch model, meanwhile, is on sale at Amazon and Walmart with 128GB of storage starting at $716.13 (about $83 off). You can also pick up the Wi-Fi / 256GB model at Amazon and Walmart starting at $821.18 (about $78 off), or the 512GB variant at Amazon and Walmart for $1,007.51 (about $91 off).\nThe best iPad Pro (2024) deals\n11-inch iPad Pro (2024)\n\nWhere to Buy:\n\n $999 $895.03 at Amazon (256GB, Wi-Fi)\n $1199 $1075.15 at Amazon (512GB, Wi-Fi)\n $1599 $1461.09 at Amazon (1TB, Wi-Fi)\n\n\n13-inch iPad Pro (2024)\n\nWhere to Buy:\n\n $1299 $1165.27 at Amazon (256GB, Wi-Fi)\n $1499 $1368.95 at Amazon (512GB, Wi-Fi)\n $1899 $1699 at Amazon (1TB, Wi-Fi)\n\nThe 2024 iPad Pro is a far more impressive upgrade than the latest iPad Air. The 11- and 13-inch models start at $999 and $1,299, respectively, and they were the first Apple devices to feature the company’s latest M4 chip, which brings moderate performance gains and dedicated hardware for on-device Apple Intelligence processing. The new Pro models can claim other firsts, too, such as being the first iPad models with OLED displays and the lightest Pros yet, which is true of both sizes. They also feature repositioned front-facing cameras that sit along the horizontal edge (also found in the 11th-gen iPad), which prevent you from looking as though you’re staring off into space on a video call.\nAs for deals, the 11-inch iPad Pro with Wi-Fi / 256GB of storage is currently on sale at Amazon and Walmart for around $895 ($104 off), while the model with Wi-Fi and 512GB of storage is $1,075.15 (about $124 off) at Amazon and Walmart. The sleek and super-thin 13-inch model, meanwhile, is on sale in its 256GB base configuration at Amazon and Walmart starting at $1,165.27 (about $134 off), or in its 512GB configuration at Amazon and Walmart starting at $1,368.95 (about $131 off). Amazon also has the 1TB model for $1,699 ($200 off) if you’re looking for more storage to hold your apps, photos, and videos.\nWhile there are some enticing deals on the iPad Pro with the M4 chip, it’s worth noting that the current model is more than a year old. That means if you want the most up-to-date tech, you may want to hold off before making your decision. A recent report from Bloomberg suggests that a new iPad Pro with an M5 chip could arrive as early as the fall, which is around when iPadOS 26 is expected to become available.\nUpdate, August 19th: Updated to reflect current pricing and availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "05652f0296eef23ac43f283c2f5203c0500df8e0",
      "title": "Home Depot keeps quiet on immigration raids outside its doors",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5504124/home-depot-earnings-immigration-raids-day-laborers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T18:32:19.000Z",
      "summary_90w": "",
      "raw": "The home-improvement chain is now one of the companies most caught up in Trump's immigration crackdown. The retailer's history with day laborers is long. So far, it's choosing to keep its distance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a727e622bc4150663d2b08b0b5ccf16520e7119f",
      "title": "Trump rules out sending US troops to Ukraine as part of security guarantees",
      "url": "https://www.theguardian.com/world/2025/aug/19/european-leaders-ukraine-russia-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T18:28:37.000Z",
      "summary_90w": "",
      "raw": "US president suggests he may be willing to provide air power to help enforce potential peace deal with Putin\nDonald Trump has ruled out sending US troops to Ukraine to enforce a potential peace deal with Vladimir Putin, tempering a promise to provide Kyiv with security guarantees that European allies had called a significant breakthrough towards halting the Kremlin’s invasion of Ukraine.\nAsked during a phone interview with Fox News whether he could assure listeners – including many members of his Maga base who support an isolationist America-first foreign policy – that the US would not put troops on the ground in Ukraine, Trump said: “You have my assurance, and I’m president.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32761e7cad9ee20028c6977032f1dfe362b56d09",
      "title": "Meta’s AI translation tool can dub your Instagram videos",
      "url": "https://www.theverge.com/news/761665/meta-ai-translation-facebook-instagram-reels",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T18:28:13.000Z",
      "summary_90w": "",
      "raw": "Meta is bringing its AI translation tool to more users on Facebook and Instagram, which automatically dubs your reels into another language. The feature also uses AI to make its dub match up with the sound of your voice and the movement of your mouth.\nFor now, you can only translate your reels from English to Spanish (and vice versa), similar to what Meta previewed during its Connect event last year. You can enable the tool by selecting the Translate voices with Meta AI toggle on the menu that appears before you publish a reel on Instagram and Facebook. Meta also gives you the option to add lip-syncing to your dubbed video, as well as review it before publishing.\nFacebook and Instagram will automatically surface translated reels to users in their preferred language. Your videos will also have a tag that discloses that it was translated using Meta AI. The translation tool is rolling out now to Facebook creators with 1,000 or more followers and all public Instagram accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7047171e0b158abbe3dbac478a52fd09ae3601af",
      "title": "Google pays $30M to settle lawsuit over children’s YouTube data",
      "url": "https://techcrunch.com/2025/08/19/google-pays-30m-to-settle-lawsuit-over-childrens-youtube-data/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:28:12.000Z",
      "summary_90w": "",
      "raw": "Google has agreed to pay $30M to settle a lawsuit over children's data collection, though the company denies wrongdoing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25ec24a5a71103448129c27b82f07522bb934683",
      "title": "Meta is shaking up its AI org, again",
      "url": "https://techcrunch.com/2025/08/19/meta-is-shaking-up-its-ai-org-again/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:27:37.000Z",
      "summary_90w": "",
      "raw": "On Friday, The Information reported that Meta was preparing to tear down its existing AI org and reorganize it into four new groups. Four days later, the change has been made official with an internal memo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "58735733ad9aafeacf9afa93d36ad2d28a4337bf",
      "title": "Discover how developer tools are shifting fast with Lauri Moore and David Cramer at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/19/discover-how-developer-tools-are-shifting-fast-with-lauri-moore-and-david-cramer-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:21:34.000Z",
      "summary_90w": "",
      "raw": "From no-code to AI-assisted dev environments, “vibe coding” is changing how early-stage startups build — and who they need to hire. The once-standard idea of landing a “10x engineer” as your first critical hire is getting a serious reality check with Lauri Moore (Bessemer) and David Cramer (Sentry) on the Builder Stage at TechCrunch Disrupt 2025 in October at San Francisco's Moscone West.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bae423d0b275192bd14741dba54b1b8cf6041f9a",
      "title": "Databricks CEO says fresh $1B will help him attack a new AI database market",
      "url": "https://techcrunch.com/2025/08/19/databricks-ceo-says-fresh-1b-will-help-him-attack-a-new-ai-database-market/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:48:35.000Z",
      "summary_90w": "",
      "raw": "The round, which pushes Databricks' valuation to $100B, was co-led by Insight Partners and Thrive. CEO Ali Ghodsi says he's found an enormous untapped AI agent market to spend the funds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b393113b1b7c87a3866f2ab08e483f30bf16080a",
      "title": "Hurricane Erin update: Storm set to bring large waves and flooding to US",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507004/hurricane-erin-forecast-outer-banks-east-coast",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T17:38:53.000Z",
      "summary_90w": "",
      "raw": "Forecasts nudge Erin's likely path to the west, increasing the risks at U.S. beaches. Tropical storm conditions are expected in North Carolina's Outer Banks starting late Wednesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "878a734cf4cb0657d6445f7e1e51f6e9741dfb86",
      "title": "Meta rolls out AI-powered translations to creators globally, starting with English and Spanish",
      "url": "https://techcrunch.com/2025/08/19/meta-rolls-out-ai-powered-translations-to-creators-globally-starting-with-english-and-spanish/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:20:01.000Z",
      "summary_90w": "",
      "raw": "The new feature, which is available in any market where Meta AI is available, allows creators to translate content into other languages for a broader audience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d366f5c713c5a2a3905c2ed815b3aeb3cef9a343",
      "title": "Your next customer is on the TechCrunch Disrupt 2025 expo floor — will they find you or your competitor?",
      "url": "https://techcrunch.com/2025/08/19/your-next-customer-is-on-the-techcrunch-disrupt-2025-expo-floor-will-they-find-you-or-your-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:07:51.000Z",
      "summary_90w": "",
      "raw": "There’s still time to book your exhibit table, but space is disappearing fast. The brands that move now will be the ones getting the face time, the leads, and the traction that matters most.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1237a488c7fed6bba5b67688d94e11d570a1e3fc",
      "title": "Why Oval Office map has played crucial role in Trump's view of Ukraine war",
      "url": "https://www.bbc.com/news/articles/cjeynw8jppdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T17:06:59.000Z",
      "summary_90w": "",
      "raw": "Ukraine's leader has taken issue with the American map, because of the amount of control it gives Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc595540d80662f85fbc4697aadf01a3a421a495",
      "title": "Diphtheria cases spiralling in Somalia, health officials warn",
      "url": "https://www.theguardian.com/world/2025/aug/19/diphtheria-cases-spiralling-somalia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:46:12.000Z",
      "summary_90w": "",
      "raw": "MSF says low vaccination coverage and poor living conditions driving spread of deadly bacterial disease\nDiphtheria cases are rapidly increasing across Somalia, officials and humanitarians warn, with children accounting for more than 97% of the cases.\nDiphtheria, a highly contagious and deadly bacterial disease that mainly affects children, is preventable by a vaccine. While Somalia has improved vaccination rates in recent years, the medical charity Médecins Sans Frontières (MSF) blames the uptick in cases on persisting immunisation gaps.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a69509bcd96ce8786a899f4a9734c85aef21c2ae",
      "title": "Brazil issues last-ditch plea for countries to submit climate plans ahead of Cop30",
      "url": "https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:38:38.000Z",
      "summary_90w": "",
      "raw": "Only 28 countries have submitted carbon-cutting proposals to the UN, with some of the biggest emitters yet to produce plans\nBrazil has issued an urgent call for all countries to come forward with strengthened national plans on the climate, in a last-ditch attempt to meet a key September deadline.\nOnly 28 countries have so far submitted carbon-cutting proposals to the UN, with some of the biggest emitters of greenhouse gases – including China and the EU – still to produce their plans.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "243141d6d98663d5165ac1cfa4497eb49cd1eda2",
      "title": "Zelenskyy gave Ukraine war veteran’s golf club as gift to Trump",
      "url": "https://www.theguardian.com/world/2025/aug/19/zelenskyy-ukraine-war-veteran-golf-club-gift-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:17:02.000Z",
      "summary_90w": "",
      "raw": "US president handed Ukrainian leader symbolic keys to the White House in return during meeting in Washington\nVolodymyr Zelenskyy gave Donald Trump a golf club during his visit to Washington this week that had belonged to a serviceman fighting Russia’s invasion, Kyiv said on Tuesday.\nTrump, an avid golfer who owns several courses, accepted the gift and presented Zelenskyy with symbolic keys to the White House in return, the Ukrainian leader’s office said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5801bc55f37d8366086073d912cae6e6bbb5a006",
      "title": "The ‘big church move’: Swedish town begins to roll historic building 5km",
      "url": "https://www.theguardian.com/world/2025/aug/19/the-big-church-move-sweden-kiruna-kyrka",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:12:57.000Z",
      "summary_90w": "",
      "raw": "Kiruna Kyrka’s slow journey is part of effort to stop town being swallowed by Europe’s biggest underground mine\nAfter eight years of planning, a cost of more than 500m kronor (£39m) and an early morning blessing, a church in northern Sweden began a slow-motion 5km journey on Tuesday to make way for the expansion of Europe’s biggest underground mine.\nThe 672-tonne Kiruna Kyrka, a Swedish Lutheran church inaugurated in 1912, is to be slowly rolled to its new home over two days, at a pace of half-a-kilometre an hour.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38e3f5c352bfe719420641dd1978d8d1c0937c75",
      "title": "India’s government to propose blanket ban on real-money gaming",
      "url": "https://techcrunch.com/2025/08/19/indias-government-to-propose-blanket-ban-on-real-money-gaming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T16:03:34.000Z",
      "summary_90w": "",
      "raw": "The Indian government plans to ban real-money games — whether skill- or chance-based — under its proposed online gaming regulation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a60993e44bb84506f13a10b433643a37e3fb10e",
      "title": "TechCrunch Mobility: Ford’s big bet",
      "url": "https://techcrunch.com/2025/08/19/techcrunch-mobility-fords-big-bet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T16:02:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility, your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a14344caf7151994169632bcfb6d0f9797a9d04d",
      "title": "Finnish politician dies in parliament in Helsinki",
      "url": "https://www.bbc.com/news/articles/cqxgde2gv31o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T16:01:42.000Z",
      "summary_90w": "",
      "raw": "Eemeli Peltonen's sudden death shocks Finland, with politicians on all sides expressing their sadness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56aef5e2652c30568616e3f045aff7d2423ef362",
      "title": "Aalo Atomics raises $100M to build a microreactor and data center together",
      "url": "https://techcrunch.com/2025/08/19/aalo-atomics-raises-100m-to-build-a-microreactor-and-data-center-together/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T15:41:41.000Z",
      "summary_90w": "",
      "raw": "Nuclear startup Aalo Atomics plans to turn on its first power plant, the 50-megawatt Aalo-X, in the summer of 2026. It's an aggressive timeline that bucks nuclear industry trends.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c83215dd1b60362dbf7df75be0608a4595067a50",
      "title": "Air Canada flights slowly resume after flight attendants agree to end their strike",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507052/air-canada-flights-resume-flight-attendants-union-strike",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T15:25:59.000Z",
      "summary_90w": "",
      "raw": "The flight attendants' union said a new agreement guarantees members will be paid for work performed while planes are on the ground, resolving one of the major issues that drove the strike.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2aa4a5e3ad1f186545972c6bc877dff8f101462f",
      "title": "Peruvian woman accused of smuggling drugs in sex toy in Bali",
      "url": "https://www.bbc.com/news/articles/cn92eywlwjlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T15:22:09.000Z",
      "summary_90w": "",
      "raw": "The 42-year-old allegedly also concealed drugs in her underwear, police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b13624c583ed52759ace39b2f78a3aeed684ef08",
      "title": "Putin must tread carefully amid hyped up expectations of breakthrough",
      "url": "https://www.theguardian.com/world/2025/aug/19/white-house-meeting-european-leaders-russia-putin-trump-analysis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:19:01.000Z",
      "summary_90w": "",
      "raw": "Goal of European leaders at White House meeting was to try to push the Russian leader into a corner\n\nThe mood in the White House on Monday was strikingly upbeat.\nNato’s ever-cheerful secretary general, Mark Rutte, set the tone as he addressed Donald Trump, Volodymyr Zelenskyy and the gathered European leaders. “Let’s make the best out of today,” he said with a smile, before repeatedly thanking the US president for his attention to the war in Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "267dc77071083d12db91173e312a9f0de4142fe4",
      "title": "Conservative leader wins Canada byelection, regaining parliament seat",
      "url": "https://www.theguardian.com/world/2025/aug/19/pierre-poilievre-wins-canada-parliament",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:11:51.000Z",
      "summary_90w": "",
      "raw": "Pierre Poilievre returns to House of Commons after shock April loss and narrower margin in Tory stronghold\nCanada’s Conservative leader, Pierre Poilievre, has won a closely watched byelection in the province of Alberta, giving him a chance to return to parliament after suffering a shock defeat in April’s federal election.\nPoilievre finished with 80.4% of the vote after Monday’s election in the riding of Battle River-Crowfoot, in the deeply Conservative western province.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "51c4e1618b40aa5c726c9dc9c6fa775c157f5765",
      "title": "Spain battles record wildfires even as the end of a heat wave brings lower temperatures",
      "url": "https://www.npr.org/2025/08/19/g-s1-83505/spain-wildfires-record-heat-wave-galicia",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T15:02:45.000Z",
      "summary_90w": "",
      "raw": "The fires have ravaged small, sparsely populated towns in the country's northwest, forcing locals in many cases to act as firefighters. About 2,382 square miles have burned across Spain and Portugal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf84683750eaa74bc5c0b4d608477578c4856f0f",
      "title": "Four-day work week? Six weeks of holidays? Australians have a choice about how to bank productivity gains",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/four-day-work-week-six-weeks-holidays-vacation-australia-boost-improve-productivity",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:00:17.000Z",
      "summary_90w": "",
      "raw": "Business groups call it a ‘populist, anti-productivity thought bubble’, but a four-day week holds obvious appeal\n\nGet our breaking news email, free app or daily news podcast\n\nOne of the ideas that has captured many peoples’ attention amid the flurry of proposals ahead of the economic roundtable is the Australian Council of Trade Unions’ vision of a four-day working week.\nThe peak union body argued that working less could actually be productivity enhancing, although the studies behind those claims aren’t too rigorous.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f45bb45ab529d564ce99bcd8fb4572cc505e4d8e",
      "title": "WA lawyer referred to regulator after preparing documents with AI-generated citations for nonexistent cases",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/wa-lawyer-referred-to-regulator-after-preparing-documents-with-ai-generated-case-citations-that-did-not-exist-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:00:17.000Z",
      "summary_90w": "",
      "raw": "Judge warns of ‘inherent dangers’ of lawyers relying solely on AI amid growing number of fake citations or other errors \n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA lawyer has been referred to Western Australia’s legal regulator after using artificial intelligence in preparing court documents for an immigration case. The documents contained AI-generated case citations for cases that did not exist.\nIt is one of more than 20 cases so far in Australia in which AI use has resulted in fake citations or other errors in court submissions, with warnings from judges across the country to be wary of using the technology in the legal profession.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d2154624fe3f1c4fb172c13622a6d77c3857e86",
      "title": "Why Ukraine's first lady wrote Melania Trump a letter",
      "url": "https://www.bbc.com/news/articles/czd08nj08r3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T14:52:20.000Z",
      "summary_90w": "",
      "raw": "Ukraine's First Lady Olena Zelenska has thanked US First Lady Melania Trump for imploring Vladimir Putin to protect children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c04a9c70cf9322394e76a954210c2202a2866b92",
      "title": "Starmer hails breakthrough on Ukraine - but anxiety over its future remains",
      "url": "https://www.bbc.com/news/articles/cr5rl6y04z0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T14:46:44.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's commitment to Ukraine's security is key to a lasting peace, the UK prime minister says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3664c144879e93267eb38274477272da8e929240",
      "title": "US spy chief says UK has dropped its Apple backdoor demand",
      "url": "https://techcrunch.com/2025/08/19/us-spy-chief-says-uk-has-dropped-its-apple-backdoor-demand/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T14:25:33.000Z",
      "summary_90w": "",
      "raw": "Tulsi Gabbard said that President Donald Trump and Vice President JD Vance also participated in the negotiations with the U.K. government over its once-secret demand to Apple.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f334c24ff184c7d64f76db3e500a3e3fa44e2b6b",
      "title": "Son of Norway's crown princess charged with rape and abuse",
      "url": "https://www.bbc.com/news/articles/cvg3ke05355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T14:18:52.000Z",
      "summary_90w": "",
      "raw": "Marius Borg Høiby is charged with 32 offences and could face up to 10 years in prison if found guilty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97f7fdde2d1b3b6f064f429e0e6ee1f92721a11b",
      "title": "Mediators optimistic Israel will accept ceasefire deal that is ‘almost identical’ to one they earlier agreed – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/aid-ship-food-gaza-cyprus-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T14:09:04.000Z",
      "summary_90w": "",
      "raw": "Qatar says no breakthrough has yet been made but Hamas has given ‘positive response’\nThe UN’s human rights office on Tuesday condemned a far-right Israeli minister for taunting a Palestinian prisoner in his cell and sharing the footage online, Reuters reports.\nNational security minister Itamar Ben-Gvir published a video on Friday last week showing him confronting Marwan Barghouti, the most high-profile Palestinian detainee in Israeli custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63e38b2b291f45efcd26bf53f0d79cbcd8a39d1b",
      "title": "CPG startup Keychain snags $30M to build in India, grow in the US",
      "url": "https://techcrunch.com/2025/08/19/cpg-startup-keychain-snags-30m-to-build-in-india-grow-in-the-u-s/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Keychain doesn't have a single customer in India — but the team helping it scale across North America and beyond is entirely based in Gurugram, a suburb of New Delhi.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76f7c791877dd96391ea7d2443d0f28f19c3cdc0",
      "title": "Air Canada flight attendants reach ‘tentative’ deal with airline to end strike",
      "url": "https://www.theguardian.com/world/2025/aug/19/air-canada-strike-tentative-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T13:31:37.000Z",
      "summary_90w": "",
      "raw": "Strike over wages and ground work has cancelled travel for 500,000 people worldwide\nAir Canada flight attendants say they have reached a “tentative” deal with the airline to end a strike over wages and ground work that has cancelled travel for half a million people worldwide.\nRoughly 10,000 flight attendants walked off the job after midnight Saturday, insisting Air Canada had failed to address their demands for higher pay and compensation for unpaid ground work, including during boarding.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfeb7da305893b01fa68da17c982770381812c1d",
      "title": "TikTok’s latest feature lets college students find and connect with classmates",
      "url": "https://techcrunch.com/2025/08/19/tiktoks-latest-feature-lets-college-students-find-and-connect-with-classmates/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T13:00:00.000Z",
      "summary_90w": "",
      "raw": "In a move reminiscent of Facebook's early days, TikTok is launching a new feature that allows college students to find and connect with others on their campus.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98d0a5e7929dee93e280ba9e8b0cad07817f2ad1",
      "title": "Nvidia said to be developing new, more powerful AI chip for sale in China",
      "url": "https://techcrunch.com/2025/08/19/nvidia-said-to-be-developing-new-more-powerful-ai-chip-for-sale-in-china/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T12:58:28.000Z",
      "summary_90w": "",
      "raw": "Nvidia is apparently putting together a new AI chip meant for sale in China that's half as powerful as its flagship B300 Blackwell GPU. The new chip would be more powerful than the H20 GPUs the company is currently allowed to sell in the country.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a43d3245a58c4a9f971d980091296e45bb0f598a",
      "title": "Israel to respond by Friday over Gaza truce plan accepted by Hamas",
      "url": "https://www.theguardian.com/world/2025/aug/19/israel-to-respond-by-friday-gaza-truce-plan-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T12:31:11.000Z",
      "summary_90w": "",
      "raw": "Israel under pressure to accept ceasefire proposal that is said to be almost identical to earlier US-backed plan\n\nMiddle East crisis – live updates\n\nIsrael has said it will deliver its response to international mediators by Friday over a new Gaza ceasefire plan accepted by Hamas amid mounting pressure for a truce in a war that has claimed more than 62,000 Palestinian lives.\nAfter mass protests in Israel demanding a deal to secure the release of the remaining 20 living Israeli hostages held in Gaza, it appeared that Hamas had reduced its demands over a prisoners-for-hostages exchange as well as over the scope of an Israeli-demanded “security buffer zone”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4b4289d6185268e2a44eec9b53b76a519daa4e4",
      "title": "Texas police hunt convict 'mistakenly' freed from jail",
      "url": "https://www.bbc.com/news/articles/cd0d32ezn17o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T11:39:01.000Z",
      "summary_90w": "",
      "raw": "Police say the man was sentenced to jail for assaulting a family member and evading arrest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cab4fe84a361c9bfe01b4231a2e98da21916d33d",
      "title": "Figure’s IPO filing marks Mike Cagney’s return to public markets",
      "url": "https://techcrunch.com/2025/08/19/figures-ipo-filing-marks-mike-cagneys-return-to-public-markets/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T11:23:41.000Z",
      "summary_90w": "",
      "raw": "Figure Technology, a 7-year-old blockchain-based lending company, has filed a registration statement with the SEC for an IPO of its Class A common stock. The filing offers a chance at vindication for Figure co-founder Mike Cagney.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c84ce3814e2075c88f8827781682a3b54c009d37",
      "title": "Putin and Zelenskyy could meet. And, Trump wants to stop voting by mail",
      "url": "https://www.npr.org/2025/08/19/g-s1-83374/up-first-briefing-putin-zelenskyy-may-meet-mail-in-votings-future",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T11:17:38.000Z",
      "summary_90w": "",
      "raw": "Trump says there are plans underway for Putin and Zelenskyy to meet to discuss an end to the war between Russia and Ukraine. And, Trump wants to stop states from voting by mail.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2828d7599b994dd9e868ce36f504a34445af270c",
      "title": "Here, together: Images of community from NPR station photographers",
      "url": "https://www.npr.org/sections/the-picture-show/2025/08/19/g-s1-82504/npr-station-photographer-images-world-photography-day",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T11:14:59.000Z",
      "summary_90w": "",
      "raw": "NPR marks World Photography Day with images of everyday moments of gathering from communities across the U.S. taken by photographers from the network's member stations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f39360be6cbd9d5dede725c2eef53f1637bc09e5",
      "title": "AI crawler Firecrawl raises $14.5M, is still looking to hire agents as employees",
      "url": "https://techcrunch.com/2025/08/19/ai-crawler-firecrawl-raises-14-5m-is-still-looking-to-hire-agents-as-employees/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Firecrawl nabbed Shopify’s CEO Tobias Lütke as an investor from a gutsy email after they discovered he was using the product.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "75ec4997089f067bd2ee0c5b39e2044aca0a6fda",
      "title": "Eight Sleep raises $100M to expand its AI-powered sleep tech",
      "url": "https://techcrunch.com/2025/08/19/eight-sleep-grabs-100m-to-bring-ai-into-your-bed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "The sleep tech company raised  from HSG, Valor Equity Partners, Founders Fund, Y Combinator, and big F1 names like Charles Leclerc and Zak Brown.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c9a35fa0fca7617c0aaa78f64582f17977beb1f6",
      "title": "Spotify’s latest feature lets you add your own transitions to playlists",
      "url": "https://techcrunch.com/2025/08/19/spotifys-latest-feature-lets-you-add-your-own-transitions-to-playlists/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "The new options are designed to appeal to playlist experts and other music fans, who have collectively created nearly 9 billion playlists on Spotify's platform to date.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d1a38055597df4ca5064b325168c5729923d9d3",
      "title": "Entire church begins two-day journey across Swedish city",
      "url": "https://www.bbc.com/news/articles/cde3xp4xlw9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T09:55:25.000Z",
      "summary_90w": "",
      "raw": "The landmark 113-year-old wooden building is at risk from subsidence and will be moved 5km on giant rolling platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d1a38055597df4ca5064b325168c5729923d9d3",
      "title": "The epic two-day operation to move an entire church across a Swedish city",
      "url": "https://www.bbc.com/news/articles/cde3xp4xlw9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:55:25.000Z",
      "summary_90w": "",
      "raw": "The landmark 113-year-old wooden building is at risk from subsidence and will be moved 5km on giant rolling platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d95b26375170b67026e0a2943112402cf398546",
      "title": "Two Oval Office encounters: How the tone changed from friction to smiles",
      "url": "https://www.bbc.com/news/videos/c74173p9nexo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:39:52.000Z",
      "summary_90w": "",
      "raw": "Onlookers gasped as Trump and Zelensky's meeting in Washington in February descended into chaos, but times have changed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c4dd89487e14038f0d6692c2b2472b307a2a0d1",
      "title": "Businesses face 'chaos' as EPA aims to repeal its authority over climate pollution",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5501576/climate-pollution-epa-regulation-endangerment-finding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T09:39:04.000Z",
      "summary_90w": "",
      "raw": "A lot of companies want the EPA in charge of setting national climate regulations because it helps shield them from lawsuits and creates a predictable environment in which to make investments.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bc1af1f6442a5f2e3aeb052a80ae8ba3cb66383c",
      "title": "Canada's Conservative leader wins back parliament seat",
      "url": "https://www.bbc.com/news/articles/c0l6jz8xlplo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T09:02:40.000Z",
      "summary_90w": "",
      "raw": "Poilievre won an Alberta by-election with 80% of the vote after losing his seat in another riding in April's general election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ed11b139ede01cab3303c5306c30f82d04efbf3",
      "title": "China and India should be partners, not adversaries, says foreign minister Wang Yi",
      "url": "https://www.bbc.com/news/articles/c3v3ee0076no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T07:24:53.000Z",
      "summary_90w": "",
      "raw": "Wang's India visit comes days before PM Modi's trip to China, and signals a further thaw in relations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "605366d5f4a45811bb4207b90aa75c9622a1e7e0",
      "title": "How algorithms are changing the way we speak",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506168/how-algorithms-are-changing-the-way-we-speak",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Social media has birthed an entire lexicon replicated by millions online — even if these words don’t actually mean skibidi. On today’s show, we talk to author Adam Aleksic about how TikTok and Instagram's engagement metrics, and viral memes, are rewiring our brains and transforming language at warp speed.\nAdam Aleksic’s book is Algospeak: How Social Media is Transforming the Future of Language \nRelated episodes: \nWhat we’re reading on the beach this summer   \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.  \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f78fe991277ea32b2b910d5f0b56b7671f26ca76",
      "title": "I was sexually assaulted on a plane - now I'm fighting for compensation",
      "url": "https://www.bbc.com/news/articles/cly6g2j67rko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T05:10:28.000Z",
      "summary_90w": "",
      "raw": "The 24-year-old shares the impact of her ordeal on a flight from Qatar and being refused compensation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68659a11a0afbcb6649df87b23a50f32fbe42439",
      "title": "Japan chain stops rice ball sales after staff fake expiry dates",
      "url": "https://www.bbc.com/news/articles/c7vlj3njzlpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T03:55:47.000Z",
      "summary_90w": "",
      "raw": "Ministop has apologised for 'significant inconvenience' as it suspended deli sales in 1,600 outlets.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a71b9e903a167de0d6326f64ae6d3c96739e22a",
      "title": "Zelensky leaves White House unscathed as he buys more time",
      "url": "https://www.bbc.com/news/articles/c80djre5m5vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T03:09:59.000Z",
      "summary_90w": "",
      "raw": "Unlike February's row, Trump and Zelensky struck a more diplomatic tone despite their remaining differences.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b73820569f15be3b03831e14bc5c89997e3d438d",
      "title": "Four key takeaways from Ukraine talks in Washington",
      "url": "https://www.bbc.com/news/articles/c5yp4jggrj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T01:01:32.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky managed to avoid another disastrous Oval Office meeting with Donald Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0323e285f2514b9889070e1eea4f3b299dda1df",
      "title": "Soldier found guilty of attempted espionage in New Zealand’s first spying conviction",
      "url": "https://www.theguardian.com/world/2025/aug/19/new-zealand-military-court-finds-soldier-guilty-of-attempted-espionage",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T00:06:24.000Z",
      "summary_90w": "",
      "raw": "Court martial heard soldier was caught offering to share military base maps and photographs to an undercover officer of an unnamed foreign nation\nA military court has convicted a New Zealand soldier of attempted espionage for a foreign power – the first spying conviction in the country’s history.\nThe soldier was caught offering to pass military base maps and photographs to an undercover officer posing as an agent for the foreign nation, the court martial heard.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62103f76e3604615beb5a2edb0f1a55719d63a89",
      "title": "Has Trump convinced Zelensky to meet Putin?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lxq70r?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-18T23:57:00.000Z",
      "summary_90w": "",
      "raw": "And can Trump convince Putin to meet Zelensky?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ff38cd0bea88df8d5c6b29a0a1612692a7f7b505",
      "title": "'No-one comes for us': The women trapped in Afghanistan's mental health system",
      "url": "https://www.bbc.com/news/articles/c80dg700dego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T22:19:29.000Z",
      "summary_90w": "",
      "raw": "Accessing treatment in an Afghan mental health facility is difficult - but getting out can be harder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d97caa4623f1eeef8d23be5edec308c858628351",
      "title": "'SNL' castmember Bowen Yang shares a piece of 'cultural contraband' from his youth",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5503406/bowen-yang-snl-wicked-las-culturistas",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T18:45:34.000Z",
      "summary_90w": "",
      "raw": "Growing up with immigrant parents, first in Canada and then in the U.S., Yang was \"obsessed\" with pop culture and Saturday Night Live. Now he's up for an Emmy for his performances on the venerated sketch series.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2e2f2cf4dc59303eb3e623bda9307732ab1cdc03",
      "title": "Flight attendant union leaders ‘ready to go to jail’ as Air Canada strike outlawed",
      "url": "https://www.theguardian.com/world/2025/aug/18/air-canada-flight-attendants-strike-illegal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:58:06.000Z",
      "summary_90w": "",
      "raw": "Arbitrator orders 10,000 striking staff back to work after government intervenes – unconstitutionally, union says\nUnion leaders representing 10,000 striking flight attendants have said they would be willing to go to jail rather than comply with an order to return to work, as Canada’s federal government seeks to end a bitter contract dispute that has halted hundreds of summer flights and stranded travellers around the world.\nSpeaking to reporters on Monday, the national president of the Canadian Union of Public Employees said members would remain on the picket lines as part of a work stoppage that has halted Air Canada’s national and international operations during its busiest season.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08ccd99774c3563781864bf5565d2da7215b123b",
      "title": "Zambian president’s feud with late rival continues over funeral plans",
      "url": "https://www.theguardian.com/world/2025/aug/18/zambian-presidents-feud-with-late-rival-continues-over-site-of-funeral",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:50:07.000Z",
      "summary_90w": "",
      "raw": "Family of Edgar Lungu trying to prevent repatriation of his body for state funeral presided over by his successor\nA furious row is raging over whether the Zambian president, Hakainde Hichilema, will preside over the funeral of his predecessor, Edgar Lungu, as the former president’s family wage a legal battle in South Africa to try to prevent his body from being repatriated.\nThe legal fight marks the latest twist in a feud between the two men that goes back at least a decade and has now outlasted the former president, who died in South Africa in June aged 68 while being treated for an undisclosed illness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "facc3062cf8edcf54b3e448d7a5c14915d4d29bc",
      "title": "Hamas tells mediators it approves latest Gaza ceasefire proposal – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/18/israel-protests-government-new-offensive-gaza-city-middle-east-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Hamas official tells Reuters news agency it has approved latest Gaza ceasefire proposal. This live blog is closed\n\nHamas says it accepts proposal for Gaza ceasefire and release of hostages\n\nNorway’s sovereign wealth fund, the world’s largest, said on Monday it had decided to exclude six companies with connections to the West Bank and Gaza from its portfolio, following a review of its Israeli investments.\nThe $2tn wealth fund did not name the companies it had decided to exclude, but said these would be made public once the divestment was completed, Reuters reports.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aeb8cda62bcc24e928b31557fd8617374a0c53b0",
      "title": "Hamas says it accepts proposal for Gaza ceasefire and release of hostages",
      "url": "https://www.theguardian.com/world/2025/aug/18/hamas-gaza-proposed-ceasefire-hostage-release-deal-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:44:24.000Z",
      "summary_90w": "",
      "raw": "Deal would include 60-day halt to violence and exchange of half of living Israeli hostages for Palestinian prisoners\nHamas officials say they have accepted a proposal for a Gaza ceasefire deal that would include the release of half of the approximately 20 remaining living Israeli hostages as part of a phased resolution to the war, as Gaza health officials said 62,000 Palestinians had died in the 22 months of war.\nThe proposed deal follows negotiations between Hamas and Egyptian and Qatari officials that have been taking place in Cairo in recent days, and comes after the Israeli prime minister, Benjamin Netanyahu, was confronted on Sunday by Israel’s biggest protests of the war, which called for a deal to secure the release of the hostages.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "94858bd9a9da78f38ea9290ae97f6310aa984ad2",
      "title": "BBC at Rafah crossing as queues of aid trucks wait to enter Gaza",
      "url": "https://www.bbc.com/news/videos/cev2nmwxe1po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T16:11:47.000Z",
      "summary_90w": "",
      "raw": "The BBC's Chief International Correspondent Lyse Doucet is travelling with Palestinian Prime Minister Mohammad Mustafa and Egypt’s Foreign Minister Badr Abdelatty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8df0cdecbec83f45ba9c846e7fef2baa83c3362",
      "title": "Newsmax pays $67 million to settle defamation case linked to 2020 election coverage",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5506062/newsmax-pays-67-million-to-settle-defamation-case-linked-to-2020-election-coverage",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T14:37:16.000Z",
      "summary_90w": "",
      "raw": "The right-wing news channel Newsmax has agreed to pay $67 million to Dominion Voting Systems over its coverage of the 2020 presidential election. A trial had been scheduled for October.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bdbfa0c9fdb16e4002376c8a592da8973557bc1b",
      "title": "Netanyahu criticises protests in Israel against his handling of Gaza war",
      "url": "https://www.theguardian.com/world/2025/aug/18/netanyahu-criticises-protests-israel-handling-gaza-war-hostages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T14:34:44.000Z",
      "summary_90w": "",
      "raw": "Israeli PM suggests demonstrators are toughening Hamas’s stance and delaying the release of hostages\nBenjamin Netanyahu has criticised massive street protests against his handling of the Gaza war, and failure to secure the release of remaining Israeli hostages, suggesting demonstrators were giving comfort to Hamas’s position in negotiations.\nThe Israeli prime minister made his comments against the backdrop of the largest protests in almost two years of war, with estimates that upwards of 400,000 people joined marches across Israel on Sunday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b19157522d760620258a05b742b75af6f25adda7",
      "title": "Spain and Portugal fires kill two more as Spanish troops battle blazes",
      "url": "https://www.bbc.com/news/articles/cz60y7npl32o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T13:25:59.000Z",
      "summary_90w": "",
      "raw": "Spain has sent 500 more troops to wildfire-affected regions, bringing the total deployed to 1,900.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d91c7f44192f3bdf5878dae3145b62c6abf303",
      "title": "'The water had no mercy': Hundreds killed as floods ravage north Pakistan",
      "url": "https://www.bbc.com/news/articles/ce3jeed2798o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T11:00:34.000Z",
      "summary_90w": "",
      "raw": "BBC visited villages which were wiped out overnight by rains, flash floods and landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5bf6e0bf654b5561f10c6597c1800e318010409e",
      "title": "BBC witnesses Israeli settlers' attack on Palestinian farm in West Bank",
      "url": "https://www.bbc.com/news/articles/cewy88jle0eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T09:52:56.000Z",
      "summary_90w": "",
      "raw": "A BBC team was interviewing a Palestinian farmer when masked men charged towards them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2bec0a308338e4dd5679e1c881b2bc6e8bc8556",
      "title": "Swatch pulls ‘slanted eye’ ad after backlash in China",
      "url": "https://www.theguardian.com/world/2025/aug/18/swatch-slanted-eye-ad-backlash-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T08:50:48.000Z",
      "summary_90w": "",
      "raw": "Calls for boycott after Swiss watchmaker becomes latest western brand accused of racist imagery\nThe Swiss watchmaker Swatch has apologised and removed an advert featuring a model pulling the corners of his eyes, after the image prompted accusations of racism and calls for a boycott on Chinese social media.\nInternet users heavily criticised the “slanted eye” gesture made by the Asian male model as racist.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "270e6f0c00ff6a2cf15437100a9666efe2940c2d",
      "title": "War-torn Myanmar to hold first general election since 2021 coup",
      "url": "https://www.bbc.com/news/articles/cvg3pp4n952o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T07:27:02.000Z",
      "summary_90w": "",
      "raw": "Critics have denounced the vote as a sham that will be used to entrench the military government's power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0bb520a2088556ed41c7fa7a09337ded3ea3cfc1",
      "title": "Three innovations pushing the medical field forward",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5503741/three-innovations-pushing-the-medical-field-forward",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T07:05:01.000Z",
      "summary_90w": "",
      "raw": "Innovation is crucial for long-term economic prosperity. One area where that’s happening aplenty: medical technology. From a cancer vaccine to an Alzheimer’s blood test to a life-changing exoskeleton, we take you on a tour of the economics of health technology. \nRelated episodes: \nThe hidden costs of healthcare churn  (Apple / Spotify) \nMore for Palantir, less for mRNA, and a disaster database redemption arc (Apple / Spotify) \nIt's actually really hard to make a robot, guys (Apple / Spotify) \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Voice-over by Greg Hardes. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "374a4731ad36ab9ee387a0279be42c47e60dd8de",
      "title": "Qantas hit with record fine for illegal layoffs during pandemic",
      "url": "https://www.bbc.com/news/articles/cd0dy7mm0l7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T04:46:05.000Z",
      "summary_90w": "",
      "raw": "Australia's biggest airline was sued for firing ground staff in 2020 as aviation came to a standstill.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9ea0b3db72444e11d5cdf2211995869937725f6",
      "title": "Swatch sorry for 'slanted eyes' ad after China uproar",
      "url": "https://www.bbc.com/news/articles/cn02k9ykej5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T04:27:43.000Z",
      "summary_90w": "",
      "raw": "The image of a model pulling the corners of his eyes resembled a racist image, critics say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0ce3f0bfa69296240000967c49008e6b8697191",
      "title": "Bolivia set to elect first non-left wing president in two decades",
      "url": "https://www.bbc.com/news/articles/c4gzlp85432o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T02:51:39.000Z",
      "summary_90w": "",
      "raw": "The rightward turn by the Bolivian electorate can see changes in economic policies and closer US ties.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c795129215b6bb14b9a0488b096896ee13132b57",
      "title": "Health v heritage: Pigeon feeding ban sparks debate in India  ",
      "url": "https://www.bbc.com/news/articles/cvg3mj0vkzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T23:32:50.000Z",
      "summary_90w": "",
      "raw": "Feeding pigeons is common in Indian cities but is now controversial due to rising numbers and health risks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95b32f858b0c8cf5f1f237c30f558ab992f6eeef",
      "title": "Huge crowds gather in Israel calling for hostage deal and end to Gaza war",
      "url": "https://www.bbc.com/news/articles/ce93y2dxlg4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T21:21:43.000Z",
      "summary_90w": "",
      "raw": "Large crowds fill 'Hostages Square' in Tel Aviv to call for fighting to cease and the release of all remaining hostages by Hamas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ed07098c713b5cb859bf771414823048530fe7e",
      "title": "Air Canada suspends restart plans after union defies return to work order",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5505416/air-canada-suspends-restart-plans",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-17T18:38:41.000Z",
      "summary_90w": "",
      "raw": "Air Canada will resume flights Monday evening, claiming the union illegally directed flight attendants to defy a return-to-work order.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d191fbff31ef74e1d13b123283e3cf04aa73f7c",
      "title": "More than 200 missing in flood-hit district in Pakistan, official says",
      "url": "https://www.bbc.com/news/articles/c8jp3y04jeyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T10:54:08.000Z",
      "summary_90w": "",
      "raw": "Hundreds are reported missing in Khyber Pakhtunkhwa province as a result of devastating floods.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "304d6ee1d5b04aea5df2df87bb2e56240dbe22a0",
      "title": "Washington's hydropower has created a data center boom. Some are concerned about its future.",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5501579/washington-hydropower-data-center-boom-sustainability-climate-change",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-17T09:00:59.000Z",
      "summary_90w": "",
      "raw": "In small town Washington — where hydropower is plentiful — data centers are creating jobs and funding amenities. But water and energy aren't unlimited — and some worry about long-term sustainability.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b0c15b44269f9dcf7c772ff2a940869efa1aaa3a",
      "title": "New Zealand woman and six-year-old son released from US detention",
      "url": "https://www.theguardian.com/world/2025/aug/16/new-zealand-woman-and-six-year-old-son-released-from-us-detention",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T11:56:07.000Z",
      "summary_90w": "",
      "raw": "Sarah Shaw was detained by Ice owing to a problem with her ‘combo card’ visa as she tried to re-enter the US from Canada\n\nNew Zealand woman and son detained by Ice enduring ‘terrifying’ ordeal\n\nA New Zealand woman and her six-year-old son, who were held for more than three weeks at a US immigration centre after being detained crossing the Canada-US border, have been released.\nIn a short update on Saturday, the woman’s friend Victoria Besancon said Sarah Shaw and her son were safely home. The family would be taking some time to settle in before speaking about their experience, she added.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7241623fb6e169f633e3e3d4ce284aa5c499b100",
      "title": "Trump says Xi told him China will not invade Taiwan while he is in office",
      "url": "https://www.theguardian.com/world/2025/aug/16/donald-trump-xi-jinping-china-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T00:09:59.000Z",
      "summary_90w": "",
      "raw": "US president says Chinese counterpart told him ‘I am very patient and China is very patient’\nThe US president, Donald Trump, has said that his Chinese counterpart, Xi Jinping, told him China would not invade Taiwan while Trump is in office.\nTrump made the comments in an interview with Fox News on Friday, ahead of talks with the Russian president, Vladimir Putin, over Moscow’s invasion of Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d433daa9d7e7dc43ff5cf3e6f3cdfcd3b097486",
      "title": "Weather tracker: Typhoon Podul pounds southern Taiwan",
      "url": "https://www.theguardian.com/environment/2025/aug/15/weather-tracker-typhoon-podul-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T09:47:14.000Z",
      "summary_90w": "",
      "raw": "One person dies after storm whips up waves, while temperatures approach 50C as heatwave grips Middle East\nTyphoon Podul crossed southern Taiwan on Wednesday with wind speeds of up to 110mph (177km/h), equivalent to a category 2 hurricane.\nPodul had developed a week earlier, near the Northern Mariana Islands, and tracked west across the Philippine Sea, achieving typhoon status on Tuesday before making landfall in south-east Taiwan the following day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}