{
  "version": "1756405181635",
  "generatedAt": "2025-08-28T18:19:41.635Z",
  "items": [
    {
      "id": "4f3280e950d3cd757466ba50bc59217b25fb5143",
      "title": "European leaders outraged after Russian strikes kill 21 and damage EU's HQ",
      "url": "https://www.bbc.com/news/articles/cvg3y7m2gz0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T18:13:30.000Z",
      "summary_90w": "",
      "raw": "The overnight attacks destroyed a block of flats and also caused damage to the EU's delegation offices.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc8f33fb34c09eb54c855fc8fa275a8acdf1a360",
      "title": "Xbox&#8217;s cross-device play history syncs your recently played games on every  screen",
      "url": "https://www.theverge.com/news/767697/xbox-cross-device-play-history-cloud-gaming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T18:09:58.000Z",
      "summary_90w": "",
      "raw": "On Thursday, Xbox announced it’s widely rolling out cross-device play history. With the new update,  even if you’re on a different Xbox console, Ally handheld, or PC, your recently played game list will remain the same, so you can jump right back in where you left off.\nThe change, which first started testing with Insiders last month and is now rolling out to everyone, also includes putting cloud-playable games in your recently-played list. As described in the blog post, “That means every cloud-enabled title, from original Xbox classics to Xbox Series X|S exclusives, is now in one place whether you own it or play through Xbox Game Pass.”\nOn console, you can find your recently played games through the “Play history” tile on the home page. Your recent titles will also surface on the Xbox PC app within the “Play history” tab beneath the “Most Recent” section, as well as in your library.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8eeb45506d4657da197e92cd3fd8eb90d9659141",
      "title": "I tested 15 cases for the Switch 2 and these are the best",
      "url": "https://www.theverge.com/reviews/691319/best-switch-2-cases",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T18:09:15.000Z",
      "summary_90w": "",
      "raw": "Our picks include carrying cases and ones you can leave on during handheld and docked play. | Image: The Verge, Getty Images\t\n\nYou might find it kind of sad to put your hard-earned Switch 2 into a protective case. To me, it’s freeing. Using a case relieves me of the worry that it will accumulate tons of little scratches, or worse. I’ve tested several types of cases on the Nintendo Switch 2 since its June 2025 debut, including flimsy shells that snap or slide onto the Switch 2 to provide a simple, aesthetically pleasing barrier from scratches to the console and its Joy-Cons. I’ve also tested carrying cases that protect the console when it isn’t in use.\nIt didn’t take long for me to find one that I think is the best, but that hasn’t stopped me from trying new options from brands that are familiar, as well as from companies that aren’t household names. There’s something for everyone — and every budget — below.\nI just listed my high standards for form-fitting cases made to fit the Switch 2 while it’s in use. However, the bar for carrying cases is lower. They just need to protect the console and, ideally, provide some extra value, like a pocket for cables, cartridge storage, or ideally both.\nAs for my favorite case, I didn’t want to make any major compromises; I wanted one that’s just as good for handheld mode as when docked, which is why I think the Dbrand Killswitch is the best model overall. I published a full review of the Killswitch, but the skinny is that while it’s perhaps more expensive than some may hope to pay, the level of protection and versatility it offers is worth the cost.\nThe best Switch 2 case for both handheld and docked play\nDbrand Killswitch – Switch 2\n\n\nScore: 8\n\nProsCons\n\n\nVery secure fit\nMakes the Switch 2 feel more like a Steam Deck (in the best ways)\nClever dock adapter\n\nChunky dock adapter\nNot the most affordable case\nFront protection only comes in the $80 tier\n\n\n\nWhere to Buy:\n\n $59.99 at Dbrand\n\nThe least expensive Killswitch tier costs $59.95 and includes a set of Joy-Con 2 grips, a rear cover for the console and a small matching piece to adhere to its kickstand, all of which securely latch onto each component. It also includes one of Dbrand’s skins. There’s no piece of the Killswitch that feels like it’ll incidentally wiggle off. \nUnfortunately, the protective case makes it impossible to fit the Switch 2 into the dock. However, Dbrand includes its workaround adapter that fits into the dock, essentially acting as a USB-C extender. It’s a fairly elegant solution that works as intended. The only downside is that it leaves your Switch 2’s screen exposed instead of concealed by the dock’s plastic wall. It’s a little clunky, but I’m willing to forgive it because it allows the Switch 2 to retain its docking functionality.\nThe tier I recommend for most Switch 2 players (especially those who will often throw their console into a bag) is the $79.85 “Travel” tier, which includes a semi-transparent cover that protects the front of your console when you aren’t using it. The cover fits around the front of your Killswitch-equipped console, securing around the back with a tough bungee cord latch. This tier also includes a pair of analog stick grips and a tray that holds 10 Switch cartridges and fits neatly within the travel cover.\nWhen this guide was first published, Dbrand was in the midst of updating its Killswitch so that it wouldn’t allow the Joy-Con 2s’ magnets to break away without you pressing their release buttons. Basically, if you held your Killswitch-equipped Switch 2 parallel to the ground solely by either of the Joy-Con 2 controllers and give it a shake, the entire console portion was likely to detach, potentially causing serious damage to the console. Dbrand redesigned the Joy-Con 2 grips to fix the issue, and previous buyers can request a replacement free of charge. Future buyers will receive the Killswitch with the updated, improved grips. We’ve received the tweaked pieces and can confirm that they fix the issue.\nRead my full review of the Dbrand Killswitch case for the Nintendo Switch 2\nRunner-up\nJSAUX Split Protective Case\n\nWhere to Buy:\n\n $29.99 $26.99 at Amazon\n $29.99 at Jsaux\n\nThe Jsaux Split Protective Case is an affordable alternative to Dbrand’s Killswitch, costing $29.99 but with many of the same characteristics. It includes two Joy-Con 2 grips that let you detach them from the system at will, and a transparent shell to clip around the back and the top and bottom edges of the Switch 2. Unlike the Killswitch, however, the Jsaux shell is so thin that the console can still fit into the dock. It also comes with a hard front cover that protect the screen during transit (or just for safekeeping), and it has storage for 10 Switch cartridges on its underside.\nI’ve got minor qualms with Jsaux’s case, which I can overlook given its low price (and may not be an issue for you, anyway); the Joy-Con 2 grips are smaller, and don’t add as much bulk or grip as Dbrand’s Killswitch, but they’re still serviceable. Also, its build quality isn’t as good (for instance, on my review unit, there was a little bit of warped plastic that looks like a raised eyebrow near the power and volume buttons, though it’s hard to say if this affects multiple units). \nLastly, the design of its Joy-Con 2 grips exhibit the same edge case issue that Dbrand’s model initially faced before it issued a free fix to all owners. If you hold the Switch 2 by either Joy-Con and shake the console’s full weight downward, the force may be enough to completely detach it, sending the console down to the ground. In my testing, it was really difficult to get the Switch 2 to fall, so this hopefully shouldn’t impact many people, but it’s worth mentioning nevertheless.\nThe best carrying cases for the Switch 2\ntomtoc slim carrying case for the Switch 2\n\nWhere to Buy:\n\n $47.99 $31.49 at Amazon\n\nTomtoc’s FancyCase Slim case has recently become my favorite Switch 2 zip-up case. Starting at around $33 and going up to $39 depending on the style that suits you best, it’s not the most affordable option. But it’s worth the cost if you want better protection than either the PowerA or Belkin cases below can provide. It has less give in its middle section by comparison. Another thing that sets it apart are the bulbous sections on the outer cover, which offer more vertical clearance above the Joy-Con 2’s analog sticks, ensuring they don’t get pressed while your console’s inside. Oh, and it includes color options that look like ice cream sandwiches.\nThe FancyCase Slim case is the best option I’ve tried not just for durability but also for a dash of style. That said, it’s short on other perks to justify the price. While Belkin’s Switch 2 carrying case features a pocket for storing microSD Express cards, a cable, or any other small trinket like an AirTag to track its location, the only thing inside of this one is a soft screen-protecting flap that can hold 12 Switch cartridges on the other side.\nRunners-up\nWaterField Designs CitySlicker case for Switch 2\n\nWhere to Buy:\n\n $129 at WaterField Designs\n\nWaterField Designs has been making tweaks to its beloved, but pricey CitySlicker case for every major handheld to come along. For fans of the case, or those who are looking for a more premium option, the $129 Switch 2 version doesn’t change what isn’t broken. The City Slicker hugs the console’s curves closely enough to ensure a snug fit with a fleece interior, flanked by two pockets for cables and small accessories — one in front of where the Switch 2 sits, and one behind it. There’s a larger zip-up mesh pocket on its back.\nHigh-quality materials set this case apart from the others on this list, and unsurprisingly are what drives up the cost. It features leather on the flap covering the system and around the front of the case. For the secondary material, you have the option of waxed canvas or ballistic nylon. If you want your Switch 2 to sleep in style, this would make for a great gift to yourself or to another game. However, the City Slicker likely won’t protect your console as much as a tougher zip-up or cover case can. Not to mention, you may prefer a case with more cartridge slots than the five that are punched out of this case’s luxe leather.\nThe next opportunity to pre-order the case will be on September 11th at 11:00am ET.\nPowerA Slim Case for Nintendo Switch 2\n\nWhere to Buy:\n\n $19.99 at Best Buy\n $19.96 at Walmart\n\nPower A’s slim zip-up case for the Switch 2 is a simple and inexpensive way to keep your console safe when you aren’t using it. It’s not a hard case, so it won’t survive catastrophic damage, but it’s a fine choice if you don’t want to add a bunch of heft. To that end, it’s one of the slimmest cases that I have tried. \nAt just $19.99 (half the cost of Nintendo’s official carrying case), baseline protection alone would be sufficient, but it offers safe storage for up to 10 Switch cartridges, too. The cartridge holder has a soft bottom that protects the screen, and it can also fold into a tent, allowing the Switch 2 to rest against it (the Switch 2 already has a kickstand for this).\nThis case doesn’t suffer from a negative trait that’s common among other slim cases (some of which are pricier than PowerA’s): being able to press on the Joy-Con 2 joysticks from the outside. Other cases might allow your Switch 2 to suffer some joystick damage unbeknownst to you, but not this one, as well as the others included in this section.\nBelkin Carrying Case for Nintendo Switch 2\n\nWhere to Buy:\n\n $29.99 at Amazon\n $29.99 at Belkin\n\nFor $10 more ($29.99), Belkin’s slim case is better-looking than PowerA’s and is made with better materials. It has a carrying strap, a large mesh pocket, and a secret compartment for an Apple AirTag or similar Bluetooth tracker, all of which the PowerA case lacks. Belkin’s case can carry 12 cartridges, and it’s only slightly thicker than the PowerA case, likely to compensate for whatever cables or small gizmos you might stuff into its pocket. It features deep grooves to fit the Joy-Con 2’s triggers, and its outer shell it tough enough to prevent most accidental presses on the joysticks. It comes in dark gray, cream, and a fun green shade.\nBelkin sells a $69.99 version of its slim case that features everything above and includes a 10,000mAh 20W battery for keeping the Switch 2 charged while it’s inside the case. The company says the battery can fully charge the console 1.5 times. The battery results in a thicker case, and its bespoke compartment only holds the specific Belkin model that’s included, so you won’t be able to swap in a different, faster-charging battery. Neither of those may be deal-breakers for you, but are worth keeping in mind.\nThe best grip case for the Switch 2’s handheld mode\nThe Killswitch is the best case for handheld mode because it allows you to remove the Joy-Con 2 controllers and includes an adapter to easily connect to the dock. Plus, it offers kickstand access.\nIf you don’t ever plan to connect your Switch 2 to its dock or detach its Joy-Cons, or it’ll be a rare occurrence, you might pick an all-in-one shell that fits completely around the console. It will protect every angle of your Switch 2 from dings and scratches, and may even keep it safe in the event of a drop.\nThe $29.99 Spigen Rugged Armor is a suitable option. It fits around nearly every nook of the Switch 2, leaving access to its headphone jack, USB-C ports, and speakers (it doesn’t cover up the air vents either because that’d be silly). It gets bonus points for fitting around the edges of the Joy-Con 2 while providing more pronounced grips, which may be a boon for those who experience hand or wrist pain while holding the console in handheld mode. However, as noted, you’ll need to remove the case in order to install the Switch 2 into its dock.\nSpigen Rugged Armor for Nintendo Switch 2\n\nWhere to Buy:\n\n $39.99 $29.99 at Amazon\n $39.99 at Spigen\n\nUpdate, August 28th: Verified prices and stock for products mentioned in this post. Also added the Jsaux Split Protective Case and WaterField’s CitySlicker case as recommended options at varying price points. We’re still waiting to receive updated versions of the Genki Attack Vector and Sleeper Case to determine whether they’re worth buying, so for now, we’ve removed them from this post.\nDisclosure: In 2023, The Verge collaborated with Dbrand on a series of skins and cases.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ecc4c47f4f1eeaa202b66fdb905dc431e6767d1b",
      "title": "Brawl in Mexico’s senate after debate over US military intervention to fight drug cartels",
      "url": "https://www.theguardian.com/world/2025/aug/28/mexico-senate-fight-us-military-intervention-cartels",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T17:59:02.000Z",
      "summary_90w": "",
      "raw": "Senators Alejandro ‘Alito’ Moreno and Gerardo Fernández Noroña fought in the senate after heated discussion\nMexico’s senate devolved into violence this week as two of the country’s top politicians shoved, grabbed and shouted at each other after a heated discussion over the presence of foreign troops in the country.\nAlejandro “Alito” Moreno, head of the opposition Institutional Revolutionary Party (Pri), grabbed at Gerardo Fernández Noroña, the senate president from the ruling Morena party, after lawmakers finished singing the national anthem to mark the end of the day’s session on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "436057c36474e86a4d919dff7642347c0e135ac8",
      "title": "CDC director refuses to leave after White House order",
      "url": "https://www.bbc.com/news/articles/cwy3zjxy3dwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T17:57:52.000Z",
      "summary_90w": "",
      "raw": "Lawyers for Dr Susan Monarez say only the president can remove her from her job running the US Centers for Disease Control and Prevention.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b86407e6469f218e58228767b84a14737d0c1dd7",
      "title": "Uncontacted Peruvian tribe on deadly collision course with loggers, group says",
      "url": "https://www.theguardian.com/world/2025/aug/28/peru-amazon-logging-mashco-piro",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T17:42:41.000Z",
      "summary_90w": "",
      "raw": "Survival International says Mashco Piro seen in nearby Amazon village in alarming sign group is under stress\nMembers of an Indigenous tribe who live deep in Peru’s Amazon rainforest and avoid contact with outsiders have been reported entering a neighboring village in what activists consider an alarming sign that the group is under stress from development.\nThe sightings of members of Mashco Piro tribe come as a logging company is building a bridge that could give outsiders easier access to the tribe’s territory, a move that could raise the risk of disease and conflict, according to Survival International, which advocates for Indigenous rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31a21b86b50ab4ff4b7397f1b9bb4860294278ed",
      "title": "Why billions of folks can't easily get a drink or flush a toilet",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/28/g-s1-85967/water-drink-safe-sanitation-toilet",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T17:40:15.000Z",
      "summary_90w": "",
      "raw": "A report from the World Health Organization says 1 in 4 people lack access to safe water to drink. Even more don't have water for sanitation. We asked someone who grew up that way to share childhood memories.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c3f305ff521c6b2172927f7c4e272164e23c58fb",
      "title": "Electric cars eligible for £3,750 discount announced",
      "url": "https://www.bbc.com/news/articles/cvgvywyev1do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T17:37:45.000Z",
      "summary_90w": "",
      "raw": "The Puma Gen-E and e-Tourneo Courier are two Ford models drivers can purchase under the government scheme.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1972819cc2a856abbad37eeaa9ecdd7768f1860e",
      "title": "Liverpool and Man City draw Real in Champions League",
      "url": "https://www.bbc.com/sport/football/articles/cx29zeqk1keo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Both Liverpool and Manchester City will face 15-time winners Real Madrid in the league phase of the Champions League.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb04ffd4ec213ddc5896d89c9ae1f2a498656972",
      "title": "First deportees arrive in Rwanda from the US",
      "url": "https://www.bbc.com/news/articles/ckg4xp2my0vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T17:29:29.000Z",
      "summary_90w": "",
      "raw": "The first group of deportees arrived in mid-August, according to government spokesperson Yolande Makolo.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d986c56ea49d28eca511298a7eccfb9376974fd9",
      "title": "Conductor Julian Wachner charged with possession of child sex abuse material",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5509937/conductor-julian-wachner-arrested",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T17:27:33.000Z",
      "summary_90w": "",
      "raw": "Once a prominent musician in New York City, Wachner was working as a grade school teacher in Indiana. Prosecutors have accused him of possessing sexual abuse imagery of young children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d4a0e8e7c59f19e6e8b0a86e1cbf91307cc47166",
      "title": "GM’s new adapters reflect the increasingly confused reality of EV charging",
      "url": "https://www.theverge.com/electric-cars/767535/gms-new-adapters-reflect-increasingly-confused-world-ev-charging",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T17:25:33.000Z",
      "summary_90w": "",
      "raw": "Look, I sympathize. When General Motors said it would adopt Tesla’s North American Charging Standard (NACS) for its electric vehicles back in 2023, we knew this meant adapters. But we never could have imagined how many adapters we would get. \nToday, GM announced three additional adapters to help EV owners charge at home or in public. And while I’m sure that GM thought it was presenting the information as clearly as it could, I can’t help but wonder what normal, non-EV owners must think of all this.\nThe new adapters are intended to help customers transitioning between the old CCS way of charging to a future dominated by Tesla charging. The vast majority of automakers have committed to adopting the NACS standard for charging, acknowledging that Tesla’s Supercharger network is superior to the mostly CCS-equipped third-party charging stations that exist today.\n\nI can’t help but wonder what normal, non-EV owners must think of all this.\n\n\nThe automakers said they would begin manufacturing EVs with NACS ports built in, but non-Tesla EV owners could access Tesla’s Superchargers by using CCS-to-NACS adapters in the meantime.\nBut the changeover has been slow going. The 2025 Hyundai Ioniq 5 was the first non-Tesla EV to go on sale with a native NACS port. But to the best of my knowledge, there haven’t been any others. GM says its upcoming Cadillac Optiq-V will be its first EV with a built-in NACS charging port, but that vehicle won’t be available until later this year. The 2027 Chevy Bolt will also have a native NACS port, out next year.\nIn the meantime, there’s a growing family of dongles to address this weird, in-between place we’re in right now with EV charging. There’s the typical CCS-to-NACS adapters that most automakers are selling to their customers. And now there’s the NACS-to-J1772 adapter for Level 2 charging — J1772 being the part of the CCS plug used for slower charging. And when GM starts producing EVs with native NACS ports, there will be two more adapters available: J1772-to-NACS dongles for slow charging and CCS-to-NACS ones for fast charging.\nHere’s GM’s infographic that “explains” all this:\nAgain, what’s a normal, non-EV-owning — but perhaps EV-curious — person to think about all this? Are they really going to give up the warm embrace of gas pumps for this adapter hell? Don’t get me wrong, I’m glad that GM is offering more adapters to its customers for added flexibility for all levels of charging. That is undeniably a good thing.\nBut we already know that EV charging can be a bit of a head-scratcher. EV owners have complained about varying charging speeds, non-standardized plug types and networks, a lack of price transparency for public charging, and issues with communication between car and charger. It’s getting better, and most people who do most of their charging at home shouldn’t have too many problems. But if you’re trying to bring new people into the experience, this isn’t helpful.\nI’m worried that the growing list of adapters that EV owners will need to acquire to account for any charging scenario could be a significant roadblock in the path to EV adoption — one that is already littered with significant obstacles. I’m trying to imagine my mother, who owns a Ford Mustang Mach-E and who struggles with the basics of smartphone operation, navigating all these adapters while on the road to Palm Springs to visit her friends.\nIt’s a lot to ask! Let’s hope there’s a whole world of simplified EV charging just over that next hill.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "58f58176c267695d6d8cd49cc49e3dd2d333e1f6",
      "title": "Star Wars: Starfighter is going to be star-studded",
      "url": "https://www.theverge.com/film/767588/star-wars-starfighter-cast",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T17:04:05.000Z",
      "summary_90w": "",
      "raw": "Aaron Pierre at Vanity Fair & Instagram's The 2025 Vanities Party\t\n\nProduction on Star Wars: Starfighter officially began today, and Lucasfilm has finally confirmed the other actors who will be bringing the film to life alongside Ryan Gosling.\nLucasfilm announced today that Star Wars: Starfighters has added Flynn Gray, Matt Smith, Mia Goth, Aaron Pierre, Simon Bird, Jamael Westman, Daniel Ings, and Amy Adams to its cast. The studio also shared a (very grainy) image of Gosling and Gray on the movie’s set. \nIn a statement about the casting news, director Shawn Levy said that he was beyond excited to begin crafting an “original adventure” for the franchise — one set a few years after the events of The Rise of Skywalker.\n“Star Wars shaped my sense of what story can do, how characters and cinematic moments can live with us forever,” Levy said. “To join this storytelling galaxy with such brilliant collaborators onscreen and off, is the thrill of a lifetime.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "21c243717a06ea9fd5fb69912f9ec5bee1e4a8de",
      "title": "Price of weight loss drug Mounjaro to be discounted in UK pharmacies",
      "url": "https://www.bbc.com/news/articles/cvg3ykg4jrro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T17:02:46.000Z",
      "summary_90w": "",
      "raw": "The rebate allays fears of a 170% price rise but patients are warned the cost of the drug will still jump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe4b0ddc3950a6775a361cce8e344bba7100825f",
      "title": "Threads tests a way to share long-form text on the platform",
      "url": "https://techcrunch.com/2025/08/28/threads-tests-a-way-to-share-long-form-text-on-the-platform/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T17:01:29.000Z",
      "summary_90w": "",
      "raw": "With this new feature, users can attach a block of text to a post instead of creating a thread of several different posts when looking to share more in-depth thoughts and ideas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54a84d164a767601b0ef9b8f988bc4499fcf324e",
      "title": "Battlefield 6 PC requirements are pretty chill — if you don&#8217;t mind 30fps",
      "url": "https://www.theverge.com/news/767582/battlefield-6-pc-requirements-are-pretty-chill-if-you-dont-mind-30fps",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T16:48:57.000Z",
      "summary_90w": "",
      "raw": "EA is promising Battlefield 6 will offer “the best PC experience in the history of the franchise,” including 4K resolution, 21:9 and 32:9 ultrawide monitors, HDR, uncapped framerates, both PS5 and Xbox gamepad support on PC, the ability to create and browse servers, streamer and incognito modes, and more — but it won’t require powerful hardware or even an SSD to get a bare-minimum experience. A 7-year-old budget gaming PC might do the job.\nIf you’re willing to settle for 1080p at 30fps in a online shooter (I won’t judge!) an RTX 2060 or RX 5600 XT or Arc A380 GPU with 6GB of video memory is apparently enough, with 16GB of RAM, 55GB of hard drive space, and a Core i5-8400 or Ryzen 5 2600 or equivalent.\nThat’s even slightly lower than the open beta required, which needed 75GB of storage, and today’s the first time we’re seeing what developers say it’ll take to play at 4K60 Ultra (you’ll want pretty potent CPU and GPU for that). \nThough, BF6 is offering a full complement of Nvidia, AMD, and Intel super-resolution and latency reduction techniques (DLSS 4, FSR 4, XeSS 2) with frame generation if you don’t need a native 4K image.\nUnfortunately, I won’t be able to get my friends to play it with me: they’re boycotting over its lack of Linux support, as BF6’s anti-cheat spares no thought for those of us trying to ditch Windows. I liked the couple hours I spent with the beta, but I do share PC Gamer’s concerns about the fast, Call of Duty-esque pacing and was glad to hear about the changes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fb8c80c746529bf737baa19257d65db7b3a2518",
      "title": "Man Utd chiefs back Amorim despite Grimsby defeat",
      "url": "https://www.bbc.com/sport/football/articles/c3v3470zl3lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T16:28:26.000Z",
      "summary_90w": "",
      "raw": "Manchester United head coach Ruben Amorim is understood to retain the support of the club ownership despite last night's shock Carabao Cup defeat at League Two Grimsby.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f923579057e798f68b28712825399a9e403915be",
      "title": "Met special constable found guilty of child rape",
      "url": "https://www.bbc.com/news/articles/c0ml30vgykro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T16:19:27.000Z",
      "summary_90w": "",
      "raw": "James Bubb, who now identifies as a woman named Gwyn Samuels, abused a position of trust, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d0b58a7346a7b9335f50cfa63ebc23447f58e584",
      "title": "Fubo Sports is a $55.99 / month streaming bundle made for watching football",
      "url": "https://www.theverge.com/news/767572/fubo-sports-espn-nfl-network-college-football-streaming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T16:19:11.000Z",
      "summary_90w": "",
      "raw": "Fubo is launching a new Sports plan on September 2nd that costs $55.99 per month and comes with over 20 live sports and news-focused channels, including the ESPN and Fox Sports channels, as well as local stations owned by ABC, CBS, and Fox. Where available, this package includes coverage for network TV-broadcast pro and college football games that might slip through the cracks of other streaming options, while going light on channels that aren’t all about sports:\nAt launch, Fubo Sports will include local broadcast stations owned-and-operated by ABC, CBS and FOX plus additional affiliates in select markets as well as ACC Network, Big 10 Network, CBS Sports Network, ESPN, ESPN2, ESPNews, ESPNU, Fox News, FS1, FS2, Fubo Sports Network, ION, NFL Network, SEC Network and Tennis Channel with some network 4K content also available. Access to ESPN’s new direct-to-consumer Unlimited plan, which includes ESPN+, is bundled with a Fubo Sports subscription. Customers in select markets will also receive local broadcast sports channels. Additional networks may be launched.\nTo start, Fubo Sports is only launching in “select markets” where broadcasters own or partner with local affiliates, but the service plans to expand its availability in the future. The “skinny” bundle also comes with all of the content in ESPN’s “Unlimited” $29.99 package, like the network’s 12 channels, and ESPN+ streaming options.\nLast year, Fubo sued Warner Bros. Discovery, Disney, and Fox over plans to create the now-scrapped sports streaming superpower, Venu. Fubo agreed to drop its lawsuit after reaching an agreement to merge with Hulu + Live TV next year, creating a new venture majority-owned by Disney.\nAt $55.99 per month, Fubo Sports sits between the $70 sports-focused plans offered by Comcast and DirecTV, and the $40 bundle with ESPN and Fox One. It also comes with some perks of a standard Fubo subscription, including multiview, a “catch up to live” feature that shows you highlights of a game you’re late to, and unlimited DVR.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "73a9efe7443648bcf26b617687f1da9e9fe78de3",
      "title": "Kobo replaces Pocket with Instapaper on its e-readers in a free update",
      "url": "https://www.theverge.com/news/767527/instapaper-replaces-pocket-on-kobo-e-readers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T16:16:22.000Z",
      "summary_90w": "",
      "raw": "A big draw of Kobo e-readers has always been Pocket integration. But, when Mozilla announced in late May that it was shutting down the read-it-later app in July, the Kobo community was left in a bit of a lurch. To the company’s credit, in late July, it announced that it would be replacing Pocket with another stalwart of the scene, Instapaper. And, just a month after that, support is already live and available as a free firmware update for all currently supported Kobo readers (and the list is surprisingly long).\nIf you’ve been on the hunt for a Pocket replacement ahead of all your data disappearing on October 8th, Instapaper now seems like the clear front runner if you’re a Kobo user, especially since you don’t need an Instapaper Premium subscription to take advantage. Hopefully the partnership will prove more fruitful than the one with Mozilla which hadn’t seen any significant improvements in years and was nearly killed off in 2023.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aced1cba09dd9355d191d0a746bb08b6ce8e63e7",
      "title": "Israeli forces raid former air-defence base near Syrian capital",
      "url": "https://www.theguardian.com/world/2025/aug/28/israeli-forces-former-air-defence-base-southern-syria-damascus",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T16:11:01.000Z",
      "summary_90w": "",
      "raw": "Operation at site south of Damascus is deepest in Syrian territory since ousting of Bashar al-Assad last year\nIsraeli forces raided a former air-defence base in southern Syria on Wednesday during a series of airstrikes in the area – their farthermost such operation inside Syria since Bashar al-Assad was ousted last December.\nThe airbase, near the city of al-Kiswah, about 6 miles (10km) south of Damascus, was previously a strategic base for Iranian militias during Assad’s rule.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a3f052cc55b45d83cfd11ab834fb988e143eb2d",
      "title": "Tourist pouring beer down elephant's trunk in Kenya sparks anger",
      "url": "https://www.bbc.com/news/articles/cjeyjep9pw3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T16:08:15.000Z",
      "summary_90w": "",
      "raw": "Investigations have been launched following the footage posted to Instagram - which has since been deleted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "13cebedb562cac1eb1ebcbab1c95597d83d60368",
      "title": "Anthropic will start training its AI models on chat transcripts",
      "url": "https://www.theverge.com/anthropic/767507/anthropic-user-data-consumers-ai-models-training-privacy",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Anthropic will start training its AI models on user data, including new chat transcripts and coding sessions, unless users choose to opt out. It's also extending its data retention policy to five years - again, for users that don't choose to opt out. \nAll users will have to make a decision by September 28th. For users that click \"Accept\" now, Anthropic will immediately begin training its models on their data and keeping said data for up to five years, according to a blog post published by Anthropic on Thursday. \nThe setting applies to \"new or resumed chats and coding sessions.\" Even if you do agree to Anthropic training its AI models on yo …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e810a7aae90293bb77c4966291e057481c7a7b70",
      "title": "Kirby&#8217;s new Switch 2 expansion adds just the right amount of challenge",
      "url": "https://www.theverge.com/games-review/767427/kirby-and-the-forgotten-land-star-crossed-world-review-switch-2",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T16:00:00.000Z",
      "summary_90w": "",
      "raw": "So I heard you want to play Kirby on hard mode: tough bosses, tricky platforming, complicated puzzles, hidden collectibles, and maybe even punishments for failing. The Star-Crossed World expansion in Kirby and the Forgotten Land's Switch 2 edition certainly introduces new challenges. There's pressure from time constraints and consecutive platforming sequences, multistep puzzles, and bosses have more health, varied attacks, and phases. In Star-Crossed World, the promise of a more difficult Kirby game reaches its conceptual limits. But how hard can a game built around pressing one button to obliterate the problems in front of you get? \nKirby  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "21cfb1ec95586427c66ff4ebe1eb8f8ae34bd92a",
      "title": "MathGPT.ai, the ‘cheat-proof’ tutor and teaching assistant, expands to over 50 institutions",
      "url": "https://techcrunch.com/2025/08/28/mathgpt-the-cheat-proof-ai-tutor-and-teaching-assistant-expands-to-over-50-institutions/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T16:00:00.000Z",
      "summary_90w": "",
      "raw": "MathGPT.ai, a tutor and teaching assistant that helps students learn, expands to over 50 institutions",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6eccaf5923ec9884b0e304aed9929dcbb8b16398",
      "title": "Reform council boss bans local newspaper's reporters",
      "url": "https://www.bbc.com/news/articles/cger45p0lv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:55:50.000Z",
      "summary_90w": "",
      "raw": "The Nottingham Post describes the ban as \"concerning\" and \"unprecedented\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9211d073b9f275aa2473579e44a94a86be8c4d0b",
      "title": "UK, France and Germany move to reimpose UN sanctions on Iran",
      "url": "https://www.bbc.com/news/articles/c4gmr3z49lxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:51:32.000Z",
      "summary_90w": "",
      "raw": "The three powers trigger a process which could restore sanctions in 30 days, calling Iran's nuclear programme a threat to peace and security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d46fc427cd73bfd0c365ad9cf7ec7d291a0fdf1",
      "title": "Microsoft Word now automatically saves new documents to the cloud",
      "url": "https://www.theverge.com/news/767522/microsoft-word-automatic-document-save-cloud-default",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-28T15:40:34.000Z",
      "summary_90w": "",
      "raw": "Microsoft is making a big change to how Word for Windows saves documents. The word processing app will soon automatically save new documents to the cloud, instead of Word users having to enable AutoSave and cloud storage options.\n“We are modernizing the way files are created and stored in Word for Windows,” says Raul Munoz, a product manager on the Office shared services and experiences team at Microsoft. “Now you don’t have to worry about saving your documents: Anything new you create will be saved automatically to OneDrive or your preferred cloud destination.”\nThe change to Word for Windows is being tested with Microsoft 365 Insiders, and the software maker says the change will mean you never have to worry about losing any work and that documents can be accessed across Android and iOS devices or in a web browser.\nNew documents will be saved with a date instead of the existing format that adds a number to the end of a document file name. You’ll be able to change where new documents are created by setting default cloud locations,  and you can also disable the option to create new files in the cloud automatically.\nMicrosoft has been increasingly pushing Word users to save documents to the cloud, with the AutoSave function that stores documents in the cloud by default. The software maker has also been using nag screens in Windows to convince people to enable OneDrive backup settings, which have proved unpopular with Windows users. \nThis latest option to create new files in the cloud automatically adds yet another step to saving files locally if you don’t use OneDrive or other cloud storage. Some Word users have already made their feelings clear about Microsoft’s fresh attempt to get more Windows users to use OneDrive in the comment section of Microsoft’s blog post. “It seems that every few years Microsoft adds yet another step that users have to jump through to get to their files,” said one poster. “It used to be very simple with the C drive being prominently displayed.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d81fcef6520ae8f5d32f8464943ce1fd2bf5c5d",
      "title": "Ariana Grande announces first tour for seven years",
      "url": "https://www.bbc.com/news/articles/cr74d3k3358o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:37:52.000Z",
      "summary_90w": "",
      "raw": "The tour will include five dates in London - the only shows currently announced outside North America.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d960e393187b24a16602dc6b99718e40aa0aad2",
      "title": "UK and EU summon top Russian diplomats after strikes hit British Council and EU offices in deadly attack on Kyiv - as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T15:28:32.000Z",
      "summary_90w": "",
      "raw": "Overnight raid kills more than a dozen people as European leaders condemn ‘deliberate’ targeting of civilians and institutions\nUkrainian prime minister Yulia Svyrydenko has now responded to the overnight Russian attacks on Kyiv, criticising Moscow for “horrific and deliberate killing of civilians.”\n“The Russians are not choosing to end the war, only constant expansion of atrocities,” she said.\n“Overnight in Kyiv, dozens of buildings were hit: residential houses, office centers, civilian enterprises. Among them also the building where the European Union Delegation to Ukraine is located. \nRussians now believe that they have paralyzed Ukraine’s allies with feigned plans for ‘negotiations’ and endless delays that only serve as methods to buy time with the true goal only of preventing sanctions.\n“My thoughts are with all those affected by the senseless Russian strikes on Kyiv which have damaged the British Council building. \nPutin is killing children and civilians, and sabotaging hopes of peace. \n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d27e29ed53605b8ef7ea69a4055a4285c190624",
      "title": "US Fed Governor Lisa Cook sues Trump over his attempt to fire her",
      "url": "https://www.bbc.com/news/articles/c1dxl6ry4y3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:24:39.000Z",
      "summary_90w": "",
      "raw": "The president has accused Cook of mortgage fraud, and cited constitutional power that he says allows him to fire her.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c8325cc4ccf9a878a350ddf7ef1ca5250950559",
      "title": "Epping asylum seeker hotel order could spark more protests, court told",
      "url": "https://www.bbc.com/news/articles/cpqv01lxvyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:22:54.000Z",
      "summary_90w": "",
      "raw": "Lawyers for The Bell Hotel owners are challenging the decision for a temporary injunction at court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14e608a1ad8e904a0c9bfaa979b0cd8c6f5cde36",
      "title": "Florida's 'Alligator Alcatraz' detention facility to be empty 'within a few days'",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5520698/alligator-alcatraz-detention-facility-empty",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T15:22:22.000Z",
      "summary_90w": "",
      "raw": "The immigration detention center in Florida's Everglades will soon be empty. State officials expect the facility to have no detainees \"within a few days.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aaee0b8b31c523c539cf3dad3435f38156b9da9c",
      "title": "No-code website builder Framer reaches $2B valuation",
      "url": "https://techcrunch.com/2025/08/28/no-code-website-builder-framer-reaches-2b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T15:15:51.000Z",
      "summary_90w": "",
      "raw": "Framer, a no-code website builder that claims over half a million monthly active users, has reached a $2 billion valuation after raising a $100 million Series D funding round led by existing investors Meritech and Atomico.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c678d07776509f27d6450e6f6fc8917b5aec6210",
      "title": "Lives torn apart in Kyiv after Russia's heaviest bombardment for weeks",
      "url": "https://www.bbc.com/news/articles/cj3ld2r2206o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:14:43.000Z",
      "summary_90w": "",
      "raw": "In the deadliest strike, a missile ripped through the middle of a low-rise block of flats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "46bbc4fe980bcba261d1c6d9a09ed43c15e914e8",
      "title": "UK and EU summon Russian envoys after Kyiv offices damaged in strikes",
      "url": "https://www.theguardian.com/politics/2025/aug/28/uk-summons-russian-ambassador-over-british-council-missile-damage-in-kyiv",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T15:13:46.000Z",
      "summary_90w": "",
      "raw": "Overnight attacks kill 18 and severely damage buildings including those housing EU delegation and British Council\nThe UK and European Union have summoned their Russian envoys after overnight missile strikes on Kyiv killed at least 18  people and damaged the city’s British Council and EU offices in the most deadly aerial assault on the Ukrainian capital since the Alaska summit between Vladimir Putin and Donald Trump.\nFour children are among the 17 reported dead after a residential building was struck in the middle of the night within the eastern Darnytskyi district, according to Ukraine’s interior minister, Ihor Klymenko.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d3fd430f3efc668dd9f441118647ae9841ff042",
      "title": "Mark Cuban’s war on America’s $5 trillion healthcare machine: ‘They can’t react as quickly’",
      "url": "https://techcrunch.com/2025/08/28/mark-cubans-war-on-americas-5-trillion-healthcare-machine-they-cant-react-as-quickly/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T15:13:18.000Z",
      "summary_90w": "",
      "raw": "Cuban said drug prices are opaque by design. He launched Cost Plus Drugs in 2022 to pull back the curtain on drug pricing, bring down costs to the average consumer, and disrupt the traditional pharmacy industry.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c50674000290184d892152ed05a1c4e1af4d9a4",
      "title": "Israel increasingly bars foreign doctors who want to volunteer in Gaza",
      "url": "https://www.npr.org/2025/08/28/g-s1-85512/gaza-foreign-doctors-israel",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T15:11:19.000Z",
      "summary_90w": "",
      "raw": "Foreign doctors have been serving as medical volunteers, but must be approved by Israel to enter Gaza. The World Health Organization says denial rates have increased by 50% since March.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8495df6c3a6c5413f2913996cb8c328ba4461987",
      "title": "'The whole town is on a high': What Grimsby's dramatic win over Man Utd means to fans",
      "url": "https://www.bbc.com/news/articles/cwy5zp1xg1vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T15:04:20.000Z",
      "summary_90w": "",
      "raw": "The morning after the night before, the Lincolnshire town reflects on its team's historic win.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc02fe2509f3796806f439a512dcb4c4cf8d0532",
      "title": "Fed governor Lisa Cook sues Trump over firing",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5520674/lisa-cook-lawsuit-trump-fed",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T15:03:18.000Z",
      "summary_90w": "",
      "raw": "Lisa Cook is challenging the president's attempt to remove her from office based on what she says is \"an unsubstantiated allegation\" of mortgage fraud prior to her Senate confirmation as governor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1050f8235ba6e169833a2c2ea0ad060e4f8d7c57",
      "title": "Looming crisis for NSW’s regional galleries averted with $15.4m in state arts funding",
      "url": "https://www.theguardian.com/artanddesign/2025/aug/29/looming-crisis-for-nsws-regional-galleries-averted-with-154m-in-state-arts-funding",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T15:00:53.000Z",
      "summary_90w": "",
      "raw": "Labor announced on Thursday Create NSW’s Arts and Cultural Funding Program will provide financial assistance for 62 organisations statewide\nArts organisations and galleries across New South Wales have voiced their relief after the state government announced $15.4m funding over two years, allaying worries of a looming crisis for NSW’s regional galleries.\nSixty-two arts organisations across NSW will receive $15.4m funding for the next two years through Create NSW’s Arts and Cultural Funding Program (ACFP), the state government announced on Thursday, with $7.5m going to 31 regional arts organisations, including 10 regional galleries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f252db70a0a98dc45b5ecc970c99151143c0152",
      "title": "Porepunkah suspect used to spy on my family with drones, says former neighbour",
      "url": "https://www.theguardian.com/news/2025/aug/28/porepunkah-suspect-used-to-spy-on-my-family-with-drones-says-former-neighbour",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T15:00:49.000Z",
      "summary_90w": "",
      "raw": "Loretta Quinn took out a personal safety intervention order against Dezi Freeman after a disagreement about him accessing her property\n\nGet our breaking news email, free app or daily news podcast\n\nA former neighbour of the suspected Porepunkah gunman said he used to hunt for deer nearby, had an intimate knowledge of Mount Buffalo and used to spy on her, including with drones.\nLoretta Quinn lived next to Dezi Freeman in Myrtleford, on the opposite side of Mount Buffalo to the site of the fatal shooting, between 2017 and 2019.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d20d09bb332fc7adefd3481c6b82537fe985c24",
      "title": "Outrage in Italy over porn site with doctored images of prominent women",
      "url": "https://www.theguardian.com/world/2025/aug/28/outrage-in-italy-over-pornographic-website-with-doctored-images-of-prominent-women-giorgia-meloni",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T14:58:11.000Z",
      "summary_90w": "",
      "raw": "Altered photos of women including Giorgia Meloni were posted on site along with vulgar and sexist captions\nA pornographic website that posted doctored photos of a host of high-profile Italian women including the prime minister, Giorgia Meloni, and the opposition leader, Elly Schlein, has sparked outrage in Italy.\nThe photos, accompanied by vulgar and sexist captions, were either harvested from personal social media accounts or public sources before being altered and published on the Italian platform Phica, which has more than 700,000 subscribers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c064fe33858d638dbe89d4e24cb5e1881b42030b",
      "title": "UK, Germany and France say they have triggered UN sanctions on Iran",
      "url": "https://www.theguardian.com/world/2025/aug/28/uk-germany-and-france-say-they-have-triggered-restored-un-sanctions-on-iran",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T14:56:53.000Z",
      "summary_90w": "",
      "raw": "Move by trio of European powers gives Tehran 30 days to improve access for inspection of its nuclear sites\nThe UK, France and Germany have formally notified the UN that they have triggered the restoration of sweeping UN sanctions against Iran, giving Tehran 30 days to make concessions on access to its nuclear sites or face deeper worldwide economic isolation.\nUK officials said the decision had not been taken lightly and there had been intensive diplomacy to try to avert this step. The officials emphasised there was still room for last-ditch diplomacy before the sanctions “snapback” comes into force in 30 days’ time. The annual high-level UN general assembly in September is likely to involve more intensive diplomacy over the situation with Iran.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8e3fd594d4f4c4cc6c26861d5b32bc10289a43d",
      "title": "Police officer 'has case to answer' over account of Cardiff e-bike deaths",
      "url": "https://www.bbc.com/news/articles/cp3e070wxx2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T14:47:05.000Z",
      "summary_90w": "",
      "raw": "The officer driving the van behind the boys in Ely should face a misconduct hearing, the IOPC says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab6c6c78e4a77cb3321df845106e3a6316e0da44",
      "title": "Honor’s slim Magic V5 foldable is fun to use, minus the huge camera bump",
      "url": "https://techcrunch.com/2025/08/28/honors-slim-magic-v5-foldable-is-fun-to-use-minus-the-huge-camera-bump/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Honor's slim Magic V5 has a nice build and a good camera, but the camera bump is a bit of a menace.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cb48a18f073d3ac12f224bf76c193ac47fa84fbc",
      "title": "Protesters throw stones at Argentina’s Milei over corruption allegations linked to sister",
      "url": "https://www.theguardian.com/world/2025/aug/28/argentina-javier-milei-hit-with-rocks-on-campaign-trail-amid-corruption-scandal-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T14:27:43.000Z",
      "summary_90w": "",
      "raw": "President’s motorcade pelted with stones on campaign trail as country’s news agenda dominated by alleged scandal\nThe president of Argentina, Javier Milei, has been pelted with stones while campaigning near the capital Buenos Aires by demonstrators protesting about allegations of corruption involving his influential sister.\nThe far-right leader, who was whisked from the scene by his security detail, sustained no injuries after his motorcade was attacked, presidential spokesperson Manuel Adorni wrote on X.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40f0a0afad4fa768914e775942f538e88a912c09",
      "title": "Investors are loving Lovable",
      "url": "https://techcrunch.com/2025/08/28/investors-are-loving-lovable/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T14:04:06.000Z",
      "summary_90w": "",
      "raw": "Investors are clamoring to get onto Swedish vibe-coding startup Lovable’s cap table, making unsolicited offers of investment that value the company at more than $4 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "03cc7246098ee68417866d9cb3b17fa18ed31636",
      "title": "AI hires or human hustle? Inside the next frontier of startup operations at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/28/ai-hires-or-human-hustle-inside-the-next-frontier-of-startup-operations-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T14:00:00.000Z",
      "summary_90w": "",
      "raw": "What happens when your first 10 hires aren’t people at all? At TechCrunch Disrupt 2025, we’re digging into the new wave of startups replacing or augmenting early employees with AI agents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8dee0b8c07dbb3adf2b8cc691529d557c1699e5",
      "title": "British Tour de France winner Chris Froome airlifted to hospital after 'serious' crash",
      "url": "https://www.bbc.com/sport/cycling/articles/c4glv348xjwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T13:49:28.000Z",
      "summary_90w": "",
      "raw": "Four-time Tour de France winner Chris Froome suffers multiple injuries in a training crash in southern France.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fc5e6b03786d845a826f1792b38f6e984b1c7f7",
      "title": "Top official embroiled in Equatorial Guinea sex tape scandal jailed ",
      "url": "https://www.bbc.com/news/articles/cx27zy49kn3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T13:12:46.000Z",
      "summary_90w": "",
      "raw": "A nephew of Equatorial Guinea's president is sentenced to eight years for embezzlement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b36521c5c1748450f6f0a30f21d22a61c9303e7",
      "title": "What are Rachel Reeves' options on property tax?",
      "url": "https://www.bbc.com/news/articles/cm2k1m56xgjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T12:57:57.000Z",
      "summary_90w": "",
      "raw": "Reports suggest the government is considering shaking up the property tax system to raise revenue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1ca323f518b23d1840a242293bbc00c7be1764dd",
      "title": "Russian missile and drone attack on Kyiv kills at least 18 people",
      "url": "https://www.theguardian.com/world/2025/aug/28/russia-launches-kyiv-attack-ukraine-capital-deaths-injuries",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T12:46:55.000Z",
      "summary_90w": "",
      "raw": "Zelenskyy says Moscow ‘chooses ballistics instead of the negotiating table’ after strikes on more than 20 locations\n• Europe live – latest updates\nRussian airstrikes on Kyiv have killed at least 18 people and wounded dozens in the most deadly night raid on the Ukrainian capital since the Alaska summit between Vladimir Putin and Donald Trump.\nSeventeen people were reported killed when a five-storey residential building in the eastern Darnytskyi district was struck in the middle of the night, said Svitlana Vodolaha, a spokesperson for the state rescue service.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f155fe14c4125ee1e558799b7a7cb2cef55082b2",
      "title": "Cases of flesh-eating screwworm on the rise in Mexico",
      "url": "https://www.bbc.com/news/articles/cn85e172yxxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T12:42:03.000Z",
      "summary_90w": "",
      "raw": "The parasites mainly infest cattle but there have also been dozens of cases involving people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb47cb4f7a6120890fdee6d4ce2182a5c58b8a7",
      "title": "Man, 59, arrested over racist abuse sent to England's Jess Carter",
      "url": "https://www.bbc.com/news/articles/c07plxg1vl3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T12:40:47.000Z",
      "summary_90w": "",
      "raw": "A 59-year-old is arrested in Lancashire after the messages were sent during Euro 2025, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9589981def41dedd059d4e524f2ac5ee510020e",
      "title": "How a 16-year-old company is easing small businesses into AI",
      "url": "https://techcrunch.com/2025/08/28/how-a-16-year-old-company-is-easing-small-businesses-into-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Whether AI is a bubble or not, it's helping some small businesses save real money. Here's how one has cautiously approached adoption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "880a243706ae6a3887b0f03c52fdb6e3c4b8f741",
      "title": "Blair joins White House meeting with Trump on post-war Gaza",
      "url": "https://www.bbc.com/news/articles/c4gmrxd8ryno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T12:08:04.000Z",
      "summary_90w": "",
      "raw": "The talks come as Israel prepares to seize Gaza City as a step towards full control of the territory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f91af1cdbc689d81d560ec3e4386646fcde5c44e",
      "title": "TransUnion says hackers stole 4.4 million customers’ personal information",
      "url": "https://techcrunch.com/2025/08/28/transunion-says-hackers-stole-4-4-million-customers-personal-information/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T12:04:57.000Z",
      "summary_90w": "",
      "raw": "The credit reporting giant confirmed unauthorized access to a third-party application storing the personal information of its customers, including Social Security numbers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49e429c10139087eb1742163799bd019077a73c4",
      "title": "Get ready, EV owners: Here come the dongles",
      "url": "https://techcrunch.com/2025/08/28/get-ready-ev-owners-here-come-the-dongles/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The transition from CCS to NACS will unlock thousands more fast chargers for many EV drivers, but they'll need to know their adapters to get the most out of it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cbe08e5cb6a64a0bee13d8f8cb9abf712d65409d",
      "title": "'Cowering Amorim image hard to shake' - can he come back from this?",
      "url": "https://www.bbc.com/sport/football/articles/cy08zywdlx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T11:44:07.000Z",
      "summary_90w": "",
      "raw": "As Manchester United reach a new low after their EFL Cup defeat at Grimsby, BBC Sport assesses whether Ruben Amorim can recover.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "087aefe280ad2cea68f574c740f35f9145169547",
      "title": "AI firm says its technology weaponised by hackers",
      "url": "https://www.bbc.com/news/articles/crr24eqnnq9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T11:40:27.000Z",
      "summary_90w": "",
      "raw": "A report from the makers of Claude said the AI tool had been used to commit cyber-attacks and fraud.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8c40448bce011377e88356ab79ff3c8d9bc04de2",
      "title": "The Summer I Turned Pretty fans told to stop abuse of cast",
      "url": "https://www.bbc.com/news/articles/cp894e9n44po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T11:36:56.000Z",
      "summary_90w": "",
      "raw": "Viewers are asked to start \"acting normal online\" amid the build-up to the show's dramatic climax.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eeb14048b0fd697e6b26f40750faabb76e80f2b8",
      "title": "How U.S. policy failed Gaza. And, the latest info on the Minneapolis school shooting",
      "url": "https://www.npr.org/2025/08/28/g-s1-85965/up-first-newsletter-minneapolis-shooting-cdc-susan-monarez-gaza-famine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T11:30:56.000Z",
      "summary_90w": "",
      "raw": "Exclusive interviews with NPR reveal how U.S. policy during Biden's administration impacted Gaza. And, a shooter opened fire on a Minneapolis church yesterday, killing two children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e485216ef5c359604c8cf759bd3142cbedb824c",
      "title": "Israeli strikes kill six Syrian troops, Syria says",
      "url": "https://www.bbc.com/news/articles/cp37kdjk0n2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T11:13:26.000Z",
      "summary_90w": "",
      "raw": "The Israeli military declined to comment on reports of the strikes, which Syria condemned.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4731627b6c1e9f6cb70d0de1186b96d13d6c2c7e",
      "title": "North Korea's Kim will meet with Xi and Putin at Chinese military parade",
      "url": "https://www.npr.org/2025/08/28/g-s1-85964/north-koreas-kim-will-meet-with-xi-and-putin-at-chinese-military-parade",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T11:09:53.000Z",
      "summary_90w": "",
      "raw": "With Russia's Vladimir Putin also coming for the parade, the event will underline the three-way alignment among Beijing, Moscow and Pyongyang in the face of a U.S. push to bolster its alliances with South Korea and Japan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cafbfae9bdb7e62fb55a57077a215a18c85de0e4",
      "title": "Taipei City council in the dog house over Chinese-made patrol robot",
      "url": "https://www.theguardian.com/world/2025/aug/28/taipei-city-council-in-the-dog-house-over-chinese-made-patrol-robot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:01:43.000Z",
      "summary_90w": "",
      "raw": "Opposition councillor in Taiwanese capital accuses authorities of sending ‘Trojan horse’ into citizens’ daily lives\nTaipei City council has come under fire after admitting that a robot dog it bought to help patrol city streets using surveillance cameras was made by a Chinese companylinked to the Chinese military.\nHammer Lee, the deputy mayor of Taiwan’s capital, introduced a “new patrol partner” for the management and repair of pedestrian areas in a post on Facebook on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efbd60e56168f80ccc640ae2db619d1b28d1a4ab",
      "title": "Final arguments conclude in Jimmy Lai national security trial in Hong Kong",
      "url": "https://www.theguardian.com/world/2025/aug/28/jimmy-lai-national-security-trial-hong-kong-media-democracy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T10:40:51.000Z",
      "summary_90w": "",
      "raw": "Government-picked judges consider verdict in high-profile case against pro-democracy media mogul\nFinal arguments have concluded in the national security trial of the pro-democracy media tycoon Jimmy Lai in Hong Kong.\nGovernment-picked judges are retiring to consider their verdict in the case, seen internationally as a crucial test of the rule of law in the city.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eab81e9a73bbc51995f9832a0bea0fd801e02dac",
      "title": "'My friend got hit in the back': Witnesses describe terror of Minneapolis school shooting",
      "url": "https://www.bbc.com/news/articles/cev2w1elx7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T10:36:36.000Z",
      "summary_90w": "",
      "raw": "One young boy says he was protected from gunfire in a church by a friend who lay on top of him and was shot.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eab81e9a73bbc51995f9832a0bea0fd801e02dac",
      "title": "'My friend got hit in the back': Witnesses describe terror of US school shooting",
      "url": "https://www.bbc.com/news/articles/cev2w1elx7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T10:36:36.000Z",
      "summary_90w": "",
      "raw": "One young boy says he was protected from gunfire in a church by a friend who lay on top of him and was shot.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82223cac4809d6975fb2878c7292207b9e304e0f",
      "title": "Starmer to replace third top aide in less than a year",
      "url": "https://www.bbc.com/news/articles/czr6zmd5d0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T10:16:26.000Z",
      "summary_90w": "",
      "raw": "Nin Pandit runs the PM's team in Downing Street and has only been in the role for ten months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2db9e2565701862c6e3d58b6e16e80fd0e49b3e3",
      "title": "Overcrowding in NSW hospitals ‘worst’ some doctors have seen as winter illnesses clog emergency departments",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/overcrowding-in-nsw-hospitals-worst-some-doctors-have-seen-as-winter-illnesses-clog-emergency-departments",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T10:02:41.000Z",
      "summary_90w": "",
      "raw": "State health minister Ryan Park says there have been more than 45,000 presentations to EDs over the past five days\n\nGet our breaking news email, free app or daily news podcast\n\nThe New South Wales health minister has encouraged people to call the health hotline instead of going to emergency departments as a spike in winter illnesses has doctors saying overcrowding is the “worst they have ever seen”.\nIn a statement on Thursday, Ryan Park said there had been more than 45,000 presentations to EDs over the past five days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb703084374892c90928ac3c197409e8c3cfe161",
      "title": "Expelled ambassador says allegations against Iran ‘baseless’ during Sydney airport exit",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/iran-ambassador-ahmad-sadeghi-leaves-australia-airport",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T09:54:47.000Z",
      "summary_90w": "",
      "raw": "Ahmad Sadeghi faced media questioning at the airport before boarding a flight out of Australia\n\nGet our breaking news email, free app or daily news podcast\n\nIran’s former ambassador to Australia – now persona non grata – has denied allegations his government was behind two antisemitic arson attacks in Australia, describing the accusations as “baseless” as he left the country.\nAhmad Sadeghi faced media questioning at Sydney airport before boarding a flight out of Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3a1d3c89d21a69d9725e15c9c7b434f87a76b78",
      "title": "Denmark summons U.S. envoy over claims of interference in Greenland",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5520519/denmark-us-envoy-interference-greenland",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:24:23.000Z",
      "summary_90w": "",
      "raw": "Denmark's foreign minister summoned the top U.S. diplomat in the country for talks after the main national broadcaster reported that at least three people with connections to President Donald Trump have been carrying out covert influence operations in Greenland.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed794cb5753cef694d5b795171bf4143f3d86ecf",
      "title": "Labor accused of trying to ‘sneak through’ law change to strip non-citizens of fair process",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/labor-accused-of-trying-to-sneak-through-law-change-to-strip-non-citizens-of-fair-process",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T09:22:32.000Z",
      "summary_90w": "",
      "raw": "Greens’ David Shoebridge calls amendment ‘one of the nastiest, meanest attacks’ on multicultural Australia\n\nFollow our Australia news live blog for latest updates\n\nRefugee and human rights groups will launch a campaign demanding the federal government scrap a controversial migration amendment to explicitly remove procedural fairness in deportation decisions for foreign-born criminals, a proposal which advocates say is causing alarm among migrants.\nThe Senate on Thursday rejected a Greens push for an inquiry into the legislation, which the senator David Shoebridge slammed as “one of the nastiest, meanest attacks” on multicultural Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "067ea45ced6e1dcf1337bd62cf415737eefaa282",
      "title": "More than 10 European startups became unicorns this year",
      "url": "https://techcrunch.com/2025/08/28/more-than-10-european-startups-became-unicorns-this-year/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T09:16:00.000Z",
      "summary_90w": "",
      "raw": "This is a good indication of the sectors that are hot among investors, from biotech and defense tech to AI, AI, and AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e39cacd1fd58f564cc0ffe830699b10d6c8a0dc4",
      "title": "'We didn't do enough': How U.S. policy failed Palestinians in Gaza",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5515620/israel-gaza-biden-famine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "As famine plagues Gaza, NPR exclusive reporting looks at the U.S. role in the humanitarian crisis. Many former officials NPR interviewed share a common refrain: Did we do enough to prevent this?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "527492385727292a3f79b563f95beef74922accf",
      "title": "This rule made many online purchases dirt cheap for U.S. consumers. Now it's ending",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519361/de-minimis-rule-tariffs-consumers-imports-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "On Friday, the U.S. is ending its de minimis rule that made it easy for cheap goods to reach consumers. The change will affect roughly 4 million such packages processed each day.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bb120cd0e79997e382bae01afdb7c72de72113b6",
      "title": "Caning and fines for those caught in Singapore drug vape crackdown",
      "url": "https://www.bbc.com/news/articles/cz60z98nzx7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T08:34:26.000Z",
      "summary_90w": "",
      "raw": "A rise in popularity of vapes laced with etomidate, an anaesthetic drug, has caused widespread alarm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48ece2d1ec3f83a2222de04e043e85431e4eda4a",
      "title": "FBI investigates Minneapolis school shooting as anti-Catholic hate crime",
      "url": "https://www.bbc.com/news/articles/c7760x87r4po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T08:06:34.000Z",
      "summary_90w": "",
      "raw": "Two children were killed when an attacker opened fire through the windows of the city's Annunciation Church.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0cab569622d494e34cd20f9261d5e6fba415e713",
      "title": "Xi shows Trump who holds the cards as he sets up meeting with Kim and Putin",
      "url": "https://www.bbc.com/news/articles/cx29z9g2kl2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T07:13:23.000Z",
      "summary_90w": "",
      "raw": "The leaders of North Korea and Russia will attend China's military parade next week - a win for Xi.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37aa811eccb417ff986e00dff34d9c6a9bedb670",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "url": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:00:25.000Z",
      "summary_90w": "",
      "raw": "Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing\nMalawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.\nIt comes just months after the World Health Organization (WHO) revealed that the country had successfully reduced tuberculosis (TB) cases by 40% over the past decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f2b0a180279e02a1f11eced7bbbe894a856241fc",
      "title": "North Korea's Kim Jong Un to join Putin at China military parade",
      "url": "https://www.bbc.com/news/articles/c17njr88ge4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T05:02:43.000Z",
      "summary_90w": "",
      "raw": "The reclusive North Korean leader's attendance at the event comes days after Trump said he wants to meet Kim.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9824195d4fde293403a8b0f79b9f64dfc5f1321",
      "title": "Maisa AI gets $25M to fix enterprise AI’s 95% failure rate",
      "url": "https://techcrunch.com/2025/08/27/maisa-ai-gets-25m-to-fix-enterprise-ais-95-failure-rate/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Maisa AI is built on the premise that enterprise automation requires accountable AI agents, not opaque black boxes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "79c1a82e054a0136b1ca2d994e32ae41ec5c9fe1",
      "title": "Putin and Kim to join Xi at Chinese military parade in show of defiance to the west",
      "url": "https://www.theguardian.com/world/2025/aug/28/vladimir-putin-kim-jong-un-join-president-xi-chinese-military-parade-defiance-to-west",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T04:49:05.000Z",
      "summary_90w": "",
      "raw": "The Victory Day parade in Beijing on 3 September will mark the formal surrender of Japan during the second world war. No western leaders will attend\nVladimir Putin and Kim Jong-un are among the world leaders who will attend a military parade with President Xi Jinping in Beijing next week, in a show of collective defiance amid western pressure.\nNo western leaders will be among the 26 foreign heads of state and government attending the parade next week – with the exception of Robert Fico, prime minister of Slovakia, a member of the European Union – according to the Chinese foreign ministry.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T04:46:05.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de5a3a1e63a8c0826a8ed2530b7dd28f51a9d52b",
      "title": "Teenager who shot Colombian senator sentenced to seven years ",
      "url": "https://www.bbc.com/news/articles/c707l5vvn8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T04:26:53.000Z",
      "summary_90w": "",
      "raw": "The 39-year-old politician was shot in the head during a presidential rally in Bogotá in June.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0b43b3a09c4f82121a0e8c4fad46b3f1a4e81f9",
      "title": "Spain and Portugal wildfires drive worst EU season on record",
      "url": "https://www.bbc.com/news/articles/cd6n8qqlj8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-28T03:13:48.000Z",
      "summary_90w": "",
      "raw": "Wildfires have scorched southern Europe and new research suggests climate change played a major role.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88c9c7deae257afa163de608c9b5766a4b89c841",
      "title": "F1's Lando Norris says friendship with team-mate Oscar Piastri is \"tricky\" as they battle for title",
      "url": "https://www.bbc.com/news/articles/cgkr452xj81o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-28T01:49:32.000Z",
      "summary_90w": "",
      "raw": "\"It's difficult knowing you really want to beat that person, but have a good working friendship.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a7cc0432c4399d0d21422e5d9cb70ff609ae7336",
      "title": "With India’s corporate banking lagging decades behind consumer fintech, TransBnk raises $25M to bridge the gap",
      "url": "https://techcrunch.com/2025/08/27/with-indias-corporate-banking-lagging-decades-behind-consumer-fintech-transbnk-raises-25m-to-bridge-the-gap/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-28T00:33:43.000Z",
      "summary_90w": "",
      "raw": "Mumbai-based TransBnk offers a foundational layer of microservices, enabling use cases such as treasury, liquidity, and escrow management to be built upon.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3dee277dc6fff37ac7b6691eb70c021f7943530a",
      "title": "Ontario premier Doug Ford’s party spent nearly $300,000 on novelty ‘Canada is not for sale’ hats",
      "url": "https://www.theguardian.com/world/2025/aug/28/ontario-premier-doug-ford-spent-six-figures-canada-not-for-sale-hats",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T23:49:07.000Z",
      "summary_90w": "",
      "raw": "The Progressive Conservative party of Ontario reportedly paid C$278,910.71 on the viral hats during the province’s election campaign\nDealing with the unprecedented threats from Donald Trump’s threats to Canada’s economy and sovereignty have required unconventional strategies from federal and provincial leaders, including barring liquor sales and cancelling contracts with Tesla.\nBut among the more unorthodox strategies to hit back against the US is spending hundreds of thousands of dollars on novelty hats.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5a92de56256ab4f0c4ebcee40de5b222310578b",
      "title": "A pregnant woman's diary of escape from war zone: 'I prayed the baby wouldn't come'",
      "url": "https://www.bbc.com/news/articles/c9870xjezk4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T23:35:30.000Z",
      "summary_90w": "",
      "raw": "Gun-wielding drivers, extortion and breakdowns, as couple flee new front line in Sudan's conflict.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1d0d4c84dc0158bf1e10241b8ee35b94bf27d13",
      "title": "Japanese town wants residents to limit smartphone use to two hours a day",
      "url": "https://www.theguardian.com/world/2025/aug/28/japanese-town-toyoake-proposes-smartphone-limit-residents-two-hours-day",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T23:30:16.000Z",
      "summary_90w": "",
      "raw": "Draft ordinance in Toyoake has triggered a backlash from locals, with some calling it an attack on individual freedom\nA town in Japan is to urge all residents to restrict their smartphone use to two hours a day in an attempt to tackle online addiction and sleep deprivation.\nOfficials in Toyoake, Aichi prefecture, said the measure would target not only children but also adults, amid growing concern about the physical and psychological toll excessive smartphone use is taking on people of all ages.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d1ca6f5290038973fcdb252dd15e44bb897a34e",
      "title": "Has crime in Washington fallen two weeks on from Trump's crackdown?",
      "url": "https://www.bbc.com/news/articles/czxpzkylg3vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T23:13:42.000Z",
      "summary_90w": "",
      "raw": "Trump says crimes in the capital \"are down like we wouldn't believe\" following his crackdown.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7feeb578e209dbf8779d169869ddbed0aa7aee4",
      "title": "Woman says Chinese student predator raped her hours before second attack",
      "url": "https://www.bbc.com/news/articles/c79l4z3v3p3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T23:01:51.000Z",
      "summary_90w": "",
      "raw": "Police first thought there had only been one rape, because the women's stories were so similar.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "409c363b04ef899fabb5e61b84d581ca725ffc97",
      "title": "A charity is giving people money to stop homelessness - and it says it's working",
      "url": "https://www.bbc.com/news/articles/ce83716edj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T23:00:20.000Z",
      "summary_90w": "",
      "raw": "Providing money gives people at risk of losing their home the \"dignity of choice\", says the charity's boss.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "05e5d5f69ec530c8528f684f1e84e7972aecda5a",
      "title": "Tony Blair attends White House meeting with Trump on postwar Gaza",
      "url": "https://www.theguardian.com/politics/2025/aug/27/tony-blair-attends-white-house-meeting-with-trump-on-postwar-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T22:28:59.000Z",
      "summary_90w": "",
      "raw": "Former prime minister in Washington DC on Wednesday for talks that reportedly also included Jared Kushner\nThe former British prime minister Tony Blair has attended a White House meeting with Donald Trump to discuss plans for postwar Gaza, the Guardian understands.\nAfter stepping down as prime minister in 2007, Blair took on the role of Middle East envoy until 2015 and spent time in Jerusalem trying to formulate a plan for a two-state solution.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad34f545f11fbddcd0f55838559ac93da3c88e2e",
      "title": "What happens when the federal government owns part of a company?",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518179/what-happens-when-the-federal-government-owns-part-of-a-company",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T21:22:34.000Z",
      "summary_90w": "",
      "raw": "President Trump says taking a 10% stake in Intel will be good for the company and the country. NPR's Scott Detrow talks with Michael Strain of the American Enterprise Insitiute, who disagrees.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed0cdbbc15e60419cc7f6629991cac83dff1c9fe",
      "title": "Nvidia reports record sales as the AI boom continues",
      "url": "https://techcrunch.com/2025/08/27/nvidia-reports-record-sales-as-the-ai-boom-continues/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T21:18:39.000Z",
      "summary_90w": "",
      "raw": "Nvidia's revenue hit $46.7 billion in the second quarter, a 56% increase compared to the same period last year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6218889d82ed00b5018eb60b73802320a029a452",
      "title": "Google launches new device protection program called Pixel Care+",
      "url": "https://techcrunch.com/2025/08/27/google-launches-new-device-protection-program-called-pixel-care/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T20:59:52.000Z",
      "summary_90w": "",
      "raw": "Google says Pixel Care+ provides a \"higher level of coverage, service and peace of mind for Google hardware owners.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "faa75837dbe3962fc163b0dff74040e96ea22f32",
      "title": "'Exhausted, hungry, and scared': What it's like to be a journalist in Gaza",
      "url": "https://www.bbc.com/news/articles/crm49zxyn0go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T20:46:24.000Z",
      "summary_90w": "",
      "raw": "Palestinian journalists give the BBC first-hand accounts of the hardship and dangers they face while reporting on the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab94ee6832c284718ee8878cedd04570a35543a3",
      "title": "911 centers are so understaffed, they’re turning to AI to answer calls",
      "url": "https://techcrunch.com/2025/08/27/911-centers-are-so-understaffed-theyre-turning-to-ai-to-answer-calls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T20:42:12.000Z",
      "summary_90w": "",
      "raw": "The company offers an AI voice assistant that helps 911 centers handle non-emergency calls.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "13667ec6fb5e02532b4a91ad9b963622f965cc7e",
      "title": "European leaders boost Moldova in face of 'relentless' Russia",
      "url": "https://www.bbc.com/news/articles/cx2xzng4rwro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T20:15:38.000Z",
      "summary_90w": "",
      "raw": "France, Germany and Poland leaders travel to state to back EU accession plan weeks before key election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54f190d6d33e1780c0481e676eb45636fdcb38f9",
      "title": "WhatsApp’s new AI feature lets you rephrase and adjust the tone of your messages",
      "url": "https://techcrunch.com/2025/08/27/whatsapps-new-ai-feature-lets-you-rephrase-and-adjust-the-tone-of-your-messages/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T20:04:35.000Z",
      "summary_90w": "",
      "raw": "With Writing Help, users can get AI-generated suggestions that rewrite their messages in professional, funny, supportive, or rephrased way.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0729f195087d8f084ce73cc311a42b56b72b288e",
      "title": "Denmark apologises to Greenland's forced contraception victims",
      "url": "https://www.bbc.com/news/articles/c5yelp5466no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T19:44:37.000Z",
      "summary_90w": "",
      "raw": "Mette Frederiksen says sorry to to women who were fitted with devices, sometimes without their knowledge.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "305a0ba616d9fdce8369723e60a38bfbb955f7d3",
      "title": "With Starship Flight 10, SpaceX prioritized resilience over perfection",
      "url": "https://techcrunch.com/2025/08/27/with-starship-flight-10-spacex-prioritized-resilience-over-perfection/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:39:43.000Z",
      "summary_90w": "",
      "raw": "SpaceX proves it can fly through failures on Starship’s tenth test flight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0af2e5fe641ff13cfbb7847dfd4ed6d0ce2ac28",
      "title": "FBI says China’s Salt Typhoon hacked at least 200 US companies",
      "url": "https://techcrunch.com/2025/08/27/fbi-says-chinas-salt-typhoon-hacked-at-least-200-us-companies/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:39:40.000Z",
      "summary_90w": "",
      "raw": "The FBI's cyber chief says the long-running China-backed hacking campaign is \"ongoing\" and affecting companies all over the world.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0434b29544c727ecb3f2b81d203eb2ec0027dd5b",
      "title": "Google and Grok are catching up to ChatGPT, says a16z’s latest AI report",
      "url": "https://techcrunch.com/2025/08/27/google-and-grok-are-catching-up-to-chatgpt-says-a16zs-latest-ai-report/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:27:01.000Z",
      "summary_90w": "",
      "raw": "The report, in its fifth iteration, showcases two and a half years of data about consumers' evolving use of AI products.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "178b751058f6cb38e926513b4bcea9279445ace3",
      "title": "4chan launches legal action against Ofcom in US",
      "url": "https://www.bbc.com/news/articles/clyjq40vjl7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T18:30:12.000Z",
      "summary_90w": "",
      "raw": "It wants the court to prohibit Ofcom from enforcing the Online Safety Act against it in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b97ada77dd9d6a6e507a50023d5be46f4797a46",
      "title": "Brands are loving Taylor Swift's engagement. Do they need to calm down?",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518860/taylor-swift-travis-kelce-engagement-brands-social-media",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T18:16:08.000Z",
      "summary_90w": "",
      "raw": "Companies from Pillsbury to Invisalign to Olipop are cheering — and trying to cash in on — the couple's engagement. Experts spoke to NPR about how brands can strike a better balance.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8e08677da730b3f0e1cf45e68ea134bda59993fe",
      "title": "What is on the table at Trump’s Gaza meeting?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lzbkn7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T17:44:00.000Z",
      "summary_90w": "",
      "raw": "And Labour is back to talking about Brexit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "baa80ee24efc3c1d988c6182a9a28f1d3f21ed72",
      "title": "Pope demands ‘collective punishment’ end in Gaza as 10 more die of hunger",
      "url": "https://www.theguardian.com/world/2025/aug/27/ten-palestinians-have-died-from-starvation-in-last-24-hours-says-gaza-health-ministry",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T17:27:37.000Z",
      "summary_90w": "",
      "raw": "Latest deaths announced by Gaza health ministry bring starvation toll to 313, including 119 children\n\nChildren make up a third of outpatients treated for wounds at MSF Gaza hospitals, data shows\n\nTen Palestinians including two children have died from starvation in the last 24 hours, health authorities in Gaza said on Wednesday, as Pope Leo XIV demanded that Israel stop its “collective punishment” of the population in the besieged territory.\nAt least 313 people have died from hunger, including 119 children, since the war in Gaza began and Israel intensified its siege on the Palestinian territory. Last week a UN-backed monitoring body confirmed that Gaza was in the throes of famine and warned that without more aid, increasing numbers of people would lose access to food.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0c91913dd08d6f6a660d082fdfb68710e9d69c3",
      "title": "Painting looted by Nazis has vanished again, say Argentine police",
      "url": "https://www.bbc.com/news/articles/cn84mld1gr9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:50:16.000Z",
      "summary_90w": "",
      "raw": "Prosecutor says painting no longer at Buenos Aires home featured in estate agent's advert.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20c6c67a65509c093f01428062e466bdf3a344cf",
      "title": "German cabinet backs voluntary military service, opening door to conscription",
      "url": "https://www.bbc.com/news/articles/c15l83e4dwdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:44:44.000Z",
      "summary_90w": "",
      "raw": "The defence minister wants to increase soldiers in service from 182,000 to 260,000 by the early 2030s.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "edff1409bba9a356005b899b7d0bdbcae9d44f69",
      "title": "Return of UN nuclear inspectors to Iran met with protests by MPs",
      "url": "https://www.theguardian.com/world/2025/aug/27/return-of-un-nuclear-inspectors-to-iran-met-with-protests-by-mps",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T16:21:33.000Z",
      "summary_90w": "",
      "raw": "Some Iranian officials say readmission breaches law passed after Israel and the US attacked the country in June\nThe partial return of UN inspectors to Iran for the first time since Israel and the US attacked Iran’s nuclear sites has been met with protests by officials in Tehran, who claim the strict preconditions they set have been breached. Some even described the return as criminal.\nAbbas Araghchi, Iran’s foreign minister, tried to quell the backlash by saying the inspectors from the International Atomic Energy Agency (IAEA) would not be visiting any of the bombed sites and that discussions about these were still to be had.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ab2c12c4bb285baa043491530c825a4301dca64",
      "title": "US disaster agency suspends workers who criticised Trump cuts, reports say",
      "url": "https://www.bbc.com/news/articles/c8denvzl0y8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:15:34.000Z",
      "summary_90w": "",
      "raw": "The Fema staff are said to have been among those who recently lent their names to an open letter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4cca2efc913eb430b53d84d66de741fae81224c",
      "title": "Middle East crisis: Israeli military carries out raid in West Bank city of Nablus – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T16:07:24.000Z",
      "summary_90w": "",
      "raw": "Soldiers and armoured vehicles enter city in northern occupied West Bank, confirms Israeli military, as residents say soldiers are searching houses\nAl Jazeera reports that the prime minister of Belgium has begun a meeting with his deputies on the topic of recognising the state of Palestine.\nBart De Wever said in a statement yesterday that it does not make sense to recognise the Palestinian state unless certain conditions are satisfied.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5524b1cc69061bfef79adf47043e7f22e3570d0b",
      "title": "European banks hit by rogue PayPal payments worth 'billions'",
      "url": "https://www.bbc.com/news/articles/cj6y42jggdyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:38:52.000Z",
      "summary_90w": "",
      "raw": "Local media said German lenders had reported millions of suspicious direct debits from the payment firm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a198bd63cf839bf7d3c59a278a04e9389ea0a49d",
      "title": "South African influencer apologises over viral Russian job videos",
      "url": "https://www.bbc.com/news/articles/c4gljnn0wwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:37:07.000Z",
      "summary_90w": "",
      "raw": "There has been a backlash over the recruitment scheme and a government warning to young people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "866f7205a2e615df1712645417bb958fdc4e82f4",
      "title": "HSBC resolves app and online banking  outage",
      "url": "https://www.bbc.com/news/articles/cqjykl7ek9qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T15:29:59.000Z",
      "summary_90w": "",
      "raw": "Thousands of people reported problems during what was the latest in a long line of banking IT failures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "627c865a81844d1683e1d38d44d9568721a925ad",
      "title": "'Punk rock' dinosaur with metre-long spikes discovered",
      "url": "https://www.bbc.com/news/articles/c5y2emnnn4po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:08:21.000Z",
      "summary_90w": "",
      "raw": "The animal has come as a surprise to experts, who now have to rethink how these armoured dinosaurs evolved",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3f8468b70e316f61439568bc309ddc2bc2f7c71",
      "title": "Old master painting looted by Nazis disappears from home in Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/27/old-master-painting-looted-by-nazis-disappears-from-home-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:50:32.000Z",
      "summary_90w": "",
      "raw": "Search for artwork seen in estate agent’s photo continues after police raid on house finds tapestry hanging in its place\nArgentinian police have said they will continue hunting for an old master painting looted by the Nazis and spotted by chance in an estate agent’s listing after a search of the property in the seaside town of Mar del Plata failed to uncover the work.\n“The painting is not in the house … but we’re going to keep searching for it,” the federal prosecutor Carlos Martínez told local media. He said items that could be useful for the investigation, including two firearms, engravings and prints, had been seized.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c4b00eff8f9862a7ed3a14eb7b2de1068f4abc5",
      "title": "Take The Planet Money Summer School Quiz In Political Economy",
      "url": "https://www.npr.org/2025/08/27/g-s1-85342/planet-money-summer-school-quiz-political-economy",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T11:56:51.000Z",
      "summary_90w": "",
      "raw": "Think you have what it takes to successfully manipulate the market and build a domestic industry from the ground up? If so, these eight questions stand between you and your Summer School diploma in political cconomy.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b2fccbf7a9f48faa73b6d07fceae586e2219f7b0",
      "title": "U.S. tariffs take effect on India, threatening $48.2B in exports",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518809/india-us-tariffs-trump-modi-exports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:48:54.000Z",
      "summary_90w": "",
      "raw": "Earlier this month President Trump signed an executive order imposing an additional 25% tariff on India due its purchases of Russian oil, bringing the combined tariffs to 50%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "74b51ec27a66773933f7c5b98018098bb4a2b5bc",
      "title": "Police killed in Australia shooting named as manhunt continues",
      "url": "https://www.bbc.com/news/articles/c4g6wlxd5kko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T08:08:55.000Z",
      "summary_90w": "",
      "raw": "Dezi Freeman allegedly opened fire on officers who were at his rural property to execute a warrant.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ce31cc150cb07b342e940266198c9b157cf0b5c",
      "title": "Despite sanctions, many countries are still importing Russian products",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5496336/despite-sanctions-many-countries-are-still-importing-russian-products",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:06:54.000Z",
      "summary_90w": "",
      "raw": "Economic sanctions and trade restrictions against Russia following its full-scale invasion of Ukraine were set to force Moscow's hand. But the U.S. and Europe continue to rely on Russian imports.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e1d9fa353579965b6bbbd37ec06d6b3f21de7f88",
      "title": "Protesters occupy Microsoft office as company reviews its work with Israel's military",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518786/microsoft-protesters-office-israel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T05:05:42.000Z",
      "summary_90w": "",
      "raw": "Current and former Microsoft employees were among those arrested. Microsoft has said it is reviewing a report that Israel has used its platform to facilitate attacks on Palestinian targets.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7517865a69cee8773511ce04954a1bfa18ce98c8",
      "title": "Attempt to partner African countries with Japanese cities triggers xenophobic backlash",
      "url": "https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T05:01:42.000Z",
      "summary_90w": "",
      "raw": "Cities in Japan have received thousands of complaints amid confusion over scheme that was intended to foster closer ties\nAn attempt to promote friendship between Japan and countries in Africa has transformed into a xenophobic row about migration after inaccurate media reports suggested the scheme would lead to a “flood of immigrants”.\nThe controversy erupted after the Japan International Cooperation Agency, or JICA, said this month it had designated four Japanese cities as “Africa hometowns” for partner countries in Africa: Mozambique, Nigeria, Ghana and Tanzania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3cef47d66a6999bc2bdc180ebcc34570c37cce0",
      "title": "Can science reveal the secrets of UFOs?",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002hqy7/what-are-ufos?at_mid=N5aggVaXsE&at_campaign=What_Are_UFOs&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002hqy7&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=What_Are_UFOs&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Can science reveal the secrets of mysterious objects seen in our skies?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "29c48700734afcd2750c5376198dfe5b0bd968f1",
      "title": "Botswana’s president declares health emergency over supply shortages",
      "url": "https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:57:33.000Z",
      "summary_90w": "",
      "raw": "Duma Boko announces urgent funding package for medicines to be distributed with military oversight\nBotswana’s president has declared a public health emergency due to shortages of essential medicines and equipment, as a downturn in the global diamond market and US aid cuts take a toll on the country’s finances.\nThe announcement came after the Ministry of Health suspended non-urgent surgeries on 4 August, stating that the country was short of medicines to treat hypertension, diabetes, cancer, asthma and eye conditions, as well as supplies including bandages and sutures and those for sexual and reproductive health.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "946ee68edff0cb4e775b227a9906502f009c7174",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "url": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:28:08.000Z",
      "summary_90w": "",
      "raw": "Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents\nCambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}