{
  "version": "1756878225072",
  "generatedAt": "2025-09-03T05:43:45.072Z",
  "items": [
    {
      "id": "4827aec408e374f42ee2a797f5cf51ab212876cb",
      "title": "Australia politics live: PM sidesteps questions about Andrews at Xi military parade; Ley turns up heat on aged care minister",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T05:13:06.000Z",
      "summary_90w": "",
      "raw": "Follow today’s news live\n\nDaniel Andrews attends China military parade, poses with Kim Jong-Un and Vladimir Putin\n\nGet our breaking news email, free app or daily news podcast\n\nRowland denies government trying to put more information out of public’s reach\nSo what about the Albanese government’s promise that it’s open and transparent?\nAs we found out through robodebt, which was another example of a lack of transparency which cost people lives under the previous government, just labelling something cabinet in confidence does not make it so and we intend to enshrine that in this law.\nWe’ve had cases where FoI requests have been generated, sometimes around 600 of them in one instance, going to a small agency, which tied up the services of that agency for over two months. Now, you might think that’s not important, but let me tell you what that agency was. That was eSafety. That is an organisation responsible for ensuring the safety, particularly of young people, online getting tied up, doing 600 frivolous FoI requests that they are required by law to deal with.\nI would point out that there is currently a charging regime in the Freedom of Information Act, and every state and territory bar the ACT actually imposes a modest application fee of somewhere between $30 and the mid-50s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73d35113143e4631d5210620aa3fe4ad3ed1ddb6",
      "title": "Trump cannot use Alien Enemies Act to deport Venezuelan gang members, appeals court rules",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526773/trump-alien-enemies-act-venezuela-gangs-ruling",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T05:10:08.000Z",
      "summary_90w": "",
      "raw": "The administration deported people designated as Tren de Aragua members to a notorious prison in El Salvador where, it argued, U.S. courts could not order them freed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b5df07f5139894edd78f5d4f7d7efa963b6de99",
      "title": "Death penalty for Indian man who burnt alive wife over skin colour",
      "url": "https://www.bbc.com/news/articles/clyryrwwdj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T05:06:03.000Z",
      "summary_90w": "",
      "raw": "The judge said the murder fell in the category of \"rarest of the rare\" and was \"a crime against humanity\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35a2b984866eaebfefe30c90f521a173333fadd0",
      "title": "UTS ordered by SafeWork NSW to pause job cuts due to risk of ‘psychological harm’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/uts-job-cuts-paused-safework-nsw-warning",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:54:13.000Z",
      "summary_90w": "",
      "raw": "Union labels intervention a ‘rare and damning rebuke’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe University of Technology Sydney has been forced to pause a plan to slash hundreds of jobs after a rare intervention by SafeWork NSW, which said workers would be subject to a “serious and imminent risk of psychological harm” if management pushed ahead.\nUnder the ruling, UTS cancelled all meetings scheduled on Wednesday and Thursday with about 800 impacted staff and paused the release of its change proposal, which was to be rolled out this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T04:45:44.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d780d85d07f58756778ed7d787673463ddb10d9",
      "title": "New Zealand woman alleged to have drunkenly danced in aisle on Sydney flight fails to appear in court",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/new-zealand-woman-who-allegedly-danced-in-aisle-of-plane-drunkenly-fails-to-appear-in-court-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:42:21.000Z",
      "summary_90w": "",
      "raw": "Australian federal police allege Sheree Young ignored safety instructions and swore at cabin crew on a flight in July\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA New Zealand woman has failed to appear in court after being charged for alleged drunken behaviour on a scheduled international flight from Sydney, including dancing in the aisle before takeoff.\nSheree Young, 50, was on a flight from Sydney to Queensland around 4pm on 21 July when she performed allegedly intoxicated behaviour, including ignoring safety instructions, swearing at cabin crew and dancing in the aisle as the pilot was taxiing for takeoff, the Australian federal police alleged.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7404343c2da6faf4684e77af35d988edee6e036d",
      "title": "North Korea: Kim Jong-un’s daughter makes international debut fuelling succession speculation",
      "url": "https://www.theguardian.com/world/2025/sep/03/north-korea-kim-jong-uns-daughter-makes-international-debut-fuelling-succession-speculation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:40:29.000Z",
      "summary_90w": "",
      "raw": "Kim Ju-ae’s arrival in Beijing ahead of China’s victory day military parade show she is her father’s preferred successor, experts say\nThe appearance of Kim Jong-un’s daughter in China ahead of Xi Jinping’s “victory day” parade in Beijing has added to speculation that she is being groomed to become the first female ruler of North Korea.\nPhotos released by North Korean state media showed Kim Ju-ae, who is believed to be in her early teens, stepping off her father’s heavily armoured train in the Chinese capital, where she was greeted by Chinese officials at the start of her debut on the international stage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4288ca9b3b4d71f0e59977406b789ec67b51c30c",
      "title": "Australian Greens co-founder Drew Hutton takes party to court in bid to reinstate life membership",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/australian-greens-co-founder-drew-hutton-takes-party-to-court-in-bid-to-reinstate-life-membership",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:29:25.000Z",
      "summary_90w": "",
      "raw": "Affidavit filed in Queensland supreme court as Hutton seeks to overturn expulsion from Greens over trans rights debate\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA co-founder of the Australian Greens is taking his former party to court in a bid to reinstate the life membership stripped from him about six weeks ago over what it considers his pursuit of debate harmful to trans people.\nDrew Hutton filed an affidavit in the Queensland supreme court on Tuesday arguing that he was denied natural justice and procedural fairness when the 78-year-old retiree had his membership terminated by an assembly of branch delegates on 20 July.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7314fd11d6ae0683fe59584296e0f9dedc06d90f",
      "title": "Unprecedented ‘weirdest stuff’ and concerns about Americanisation of Australia’s 2025 election to be probed in review",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/voter-intimidation-shadowy-groups-and-interference-rising-threats-to-australian-elections-under-review",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:21:47.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Voter intimidation, influence of shadowy groups and alleged threat of interference are major themes a parliamentary committee will explore\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nConcerning reports of aggression and intimidation allegedly experienced by voters and electoral workers have prompted a review of the 2025 election by the federal parliament.\nBoosting security around polling places and concerns about cashed-up, shadowy and “hyper-partisan” campaign groups will be probed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99fa8ead2efdd79c9f5b45e5a20f4827ff27b0e6",
      "title": "Daniel Andrews attends China military parade, poses with Kim Jong-Un and Vladimir Putin",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/dan-andrews-china-military-parade-poses-with-kim-jong-un-vladimir-putin",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:20:57.000Z",
      "summary_90w": "",
      "raw": "Former Victorian Labor premier earlier filmed shaking Chinese president Xi Jinping’s hand\n\nFull report: Xi Jinping appears with Vladimir Putin and Kim Jong-un at China military parade\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nDaniel Andrews has posed alongside North Korean dictator Kim Jong-un and Russian president Vladimir Putin at a military parade in Beijing’s Tiananmen Square.\nThe former Victorian Labor premier stood several rows behind the North Korean semi-recluse (who is facing complaints of alleged crimes against humanity) during the photo opportunity for leaders from the so-called “axis of upheaval”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "678c1de7491f05191cd475ec9128809ed46041de",
      "title": "China's Xi displays military might, global ambitions at elaborate parade",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5524923/china-xi-parade-putin-kim",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T04:20:32.000Z",
      "summary_90w": "",
      "raw": "It was a grand display of China's ambitions as thousands of goose-stepping soldiers marched through Tiananmen Square in the heart of Beijing, as Chinese President Xi Jinping looked on from above.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1cad9bfa5299b79f238a747e09b64f37f8dacdf5",
      "title": "'Lucky' Djokovic to face Alcaraz after battling past Fritz",
      "url": "https://www.bbc.com/sport/tennis/articles/c4gzgdl6dklo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T04:10:01.000Z",
      "summary_90w": "",
      "raw": "Novak Djokovic sets up a blockbuster US Open semi-final encounter with Carlos Alcaraz after battling past American Taylor Fritz.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95a398b4549b780449b69fa72fb64f9b270be41b",
      "title": "Thailand tycoon who championed cannabis legalisation takes lead in race to be PM",
      "url": "https://www.theguardian.com/world/2025/sep/03/thailand-elections-tycoon-championed-cannabis-legalisation-takes-lead-pm-race",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:08:49.000Z",
      "summary_90w": "",
      "raw": "Conservative Bhumjaithai party leader Anutin Charnvirakul gets main opposition party’s conditional backing to form interim government\nTycoon-turned-politician Anutin Charnvirakul appears to have taken the lead in a chaotic race to become Thailand’s next prime minister, after days of tense negotiations.\nAnutin, who is leader of the conservative Bhumjaithai party and perhaps best known for championing medical cannabis legalisation, has received the backing of MPs from the main opposition party People’s party to form an interim government, provided he signs an agreement laid out by its leaders.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d4c8253a35a3d55bd4fa1b0b4514cf77311fdd4",
      "title": "Leaders gather in Beijing for military display – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/china-victory-day-military-parade-80th-japan-surrender-live-updates-xi-jinping-putin-kim-jong-un-latest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:05:46.000Z",
      "summary_90w": "",
      "raw": "This blog is closed\n\nFull report: Xi, Kim and Putin appear together in Beijing\n\nThe parade has commenced, they are singing the Chinese national anthem.\nPhotos have emerged showing North Korean leader Kim Jong-un stepping off his armoured train at Beijing Railway Station accompanied by his daughter, Kim Ju-ae.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b15a2e067e5341f9a6fab8e872f8a38e5f98ea5c",
      "title": "Sánchez: Europe’s response to war in Gaza has been a ‘failure’",
      "url": "https://www.theguardian.com/world/2025/sep/03/sanchez-europes-response-to-war-in-gaza-has-been-a-failure",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:00:14.000Z",
      "summary_90w": "",
      "raw": "Spanish prime minister says double standards over Gaza and Ukraine threaten to undermine the west’s global standing\n\n‘You need solidarity and consistency’: Pedro Sánchez on the EU, Trump and fighting the far right\n\n\n​Europe and the west’s double standards over the wars in Ukraine and Gaza threaten to undermine its global standing, the Spanish prime minister, Pedro Sánchez, has warned, describing the response to Israel’s assault on the Palestinian territory as one of the darkest episodes of international relations in the 21st century.\nIn an interview with the Guardian before talks with UK prime minister, Keir Starmer, in London on Wednesday, the socialist leader also said the US under Donald Trump was trying to end the post-second world war, rules-based global order it had originally created.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad7775d11a4d79ff28aaa90e8d620b7153ceb652",
      "title": "'Fury' over Father Ted creator arrest and 'nervy bond markets'",
      "url": "https://www.bbc.com/news/articles/c4gjg0pe26no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:55:31.000Z",
      "summary_90w": "",
      "raw": "Father Ted creator Graham Linehan's arrest and skyrocketing borrowing costs dominate Wednesday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ace766178d2ad238f44e43eb9ee36a2d98145e72",
      "title": "Trump accuses Xi of conspiring against US with Putin and Kim",
      "url": "https://www.bbc.com/news/articles/c1dxd9eyy71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:45:58.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b19907959fae91b037286af0c679b1c96289fded",
      "title": "Xi, Putin and Kim: behind the choreographed image that could symbolise a shift in the global balance of power",
      "url": "https://www.theguardian.com/world/2025/sep/03/xi-putin-kim-choreographed-image-that-could-symbolise-shift-global-balance-power",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T03:45:29.000Z",
      "summary_90w": "",
      "raw": "In an unprecedented spectacle the leaders of Russia, China and North Korea led a group of more than 20 world leaders at a victory day parade in Beijing\n\nFull report: Xi Jinping appears with Vladimir Putin and Kim Jong-un at China military parade\n\nIt is an image that, had it been published just a few years ago, would have been dismissed as a piece of mischievous photo-shopping: the leaders of Russia and China, accompanied by the head of a pariah regime whose mission to arm his country with nuclear weapons had been opposed at the United Nations by his two companions.\nBut dramatic shifts in the geopolitical landscape – Russia’s invasion of Ukraine and, crucially, the re-election of Donald Trump – have combined to bring Xi Jinping, Vladimir Putin and North Korean leader Kim Jong-un together in what many observers are calling a dramatic redrawing of the global balance of power.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4797c9a7e5dd808d65c909097b9a96e5bae3b474",
      "title": "Watch: Key moments from China's big show of strength",
      "url": "https://www.bbc.com/news/videos/c62n2mm6ngjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:35:24.000Z",
      "summary_90w": "",
      "raw": "The military parade was attended by world leaders including Vladimir Putin and Kim Jong Un and showcased China’s new weapons.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on drug-carrying vessel from Venezuela",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:26:28.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48917e7349cdb49fd13d9d5b0dfb99a96615ac9a",
      "title": "Watch: New ICBM missile on display at China's military parade",
      "url": "https://www.bbc.com/news/videos/cy989zg5n3no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:15:08.000Z",
      "summary_90w": "",
      "raw": "During the parade, China unveiled an intercontinental strategic nuclear missile known as the DF-5C.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb04e52aa7da6a76d28b5616e418fee79c43827d",
      "title": "Moment Xi, Putin and Kim pose with world leaders at China's military parade",
      "url": "https://www.bbc.com/news/videos/cly6ylk070zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T02:20:57.000Z",
      "summary_90w": "",
      "raw": "It's the first time the three world leaders have been seen together in public.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c7da3bb5ff305a783fad17be811feb999267c58",
      "title": "Watch: China's military parade begins with gun salute",
      "url": "https://www.bbc.com/news/videos/czjmjljvlw1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T02:14:52.000Z",
      "summary_90w": "",
      "raw": "Troops marched in Tiananmen Square to showcase China's military strength in an event marking 80 years since Japan surrendered in WW2.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df6292318cff9f48c879b31767d4a501c2af5851",
      "title": "Indonesia embassy official’s shooting in Lima probably a ‘contract killing’, says Peru government",
      "url": "https://www.theguardian.com/world/2025/sep/03/indonesian-embassy-official-shooting-lima-likely-contract-killing-says-peru-government-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T02:11:57.000Z",
      "summary_90w": "",
      "raw": "Interior minister says ‘they were waiting for’ official who was shot at point-blank range outside his home in killing that has shocked Peru\nPeru’s government has said the fatal shooting of an Indonesian embassy official in Lima on Monday night was likely a “contract killing”.\nZetro Leonardo Purba, 40, an official at the Indonesian embassy in Peru, was shot dead outside his block of flats in Lima’s Lince neighbourhood while riding a bicycle home from work on Monday evening.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f8aa17ecd8380ddeed0b8af5c055ec41f544019",
      "title": "Disney will pay $10 million to settle FTC claim it used cartoons to collect YouTube data on kids",
      "url": "https://www.theverge.com/policy/769771/disney-ftc-coppa-settlement-kids-data",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T02:01:35.000Z",
      "summary_90w": "",
      "raw": "Disney has agreed to pay $10 million to settle allegations from the Federal Trade Commission that it violated federal law by misleadingly labeling cartoons on YouTube so it could illegally collect children’s personal data.\nThe FTC alleges that Disney failed to label some videos of its popular kids cartoons it uploaded to YouTube as “Made for Kids” — a designation that makes such videos ineligible for certain features, like the collection of personal information. It’s a way YouTube makes it harder to target kids with personalized ads. But rather than mark individual videos as either “Made for Kids” or “Not Made for Kids,” the FTC alleges, Disney left the default designation at the channel level, so any video uploaded to a “Not Made for Kids” channel would bear that “Not Made for Kids” label instead. \nThe result was that videos with content from kid-friendly movies like “The Incredibles,” “Toy Story,” and “Frozen” would be marked as “Not Made for Kids,” according to the government, circumventing YouTube’s heightened restrictions, including allowing YouTube to autoplay other “Not Made for Kids” videos after the Disney ones finished. That resulted in Disney collecting information on kids and serving them targeted ads on videos that were technically designed at not for kids, the FTC alleges, in violation of the Children’s Online Privacy Protection (COPPA) Rule, which requires parental consent to collect information on kids under 13. \nYouTube implemented the labeling system after its own 2019 settlement with the FTC over alleged violation of the COPPA Rule. \nDisney should have known that some of its videos were marked incorrectly, the government alleges, since YouTube already told Disney in 2020 that it was labeling its videos incorrectly,  changing the labels on over 300 of its videos from “Not Made for Kids” to “Made for Kids” at that time, according to the complaint. But Disney continued to upload videos with only the default designation at the channel level, the FTC says.\nUnder the proposed settlement, Disney will pay a $10 million civil settlement, obtain parents’ consent for collecting data from kids under 13 as required by law, and create a new program to review whether videos uploaded to YouTube should be marked as made for kids or not which it must maintain for the next ten years — unless YouTube comes up with its own system “to determine the age, age range, or age category of all YouTube users.” If so, Disney will no longer need its own system to figure out how videos should be labeled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "19748ab56d2566a698991b9886df485db53e89a0",
      "title": "US House panel releases 33,000 pages of Epstein files",
      "url": "https://www.bbc.com/news/articles/cp949lrj373o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T01:12:07.000Z",
      "summary_90w": "",
      "raw": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9f7a6816ffd9702bb19c0245b06297472e23a09b",
      "title": "Sue Gray questions class-based civil service internship scheme",
      "url": "https://www.bbc.com/news/articles/cd7y7jln1l8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T00:57:46.000Z",
      "summary_90w": "",
      "raw": "The PM's former chief of staff says she \"learned a lot from being around people from different walks of life\" in the civil service.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd9711cb196a8a00d95830cc9302c67960583c10",
      "title": "Jury clears Cardi B of assault on security guard in Los Angeles",
      "url": "https://www.bbc.com/news/articles/cgjyj0dp3ego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T00:19:19.000Z",
      "summary_90w": "",
      "raw": "A number of viral moments thrust the civil case into the spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82e610cca10f41f87777ee7339defdd579cc4003",
      "title": "Asylum protests putting police under chronic pressure, chief says",
      "url": "https://www.bbc.com/news/articles/c6272r550w3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T00:06:44.000Z",
      "summary_90w": "",
      "raw": "Chief Constable Gavin Stephens says police have dealt with over 3,000 summer protests and warns against an \"increase in tension and polarity\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07f8b0cb89a5ba28cead6ee8b73d58f6be205e1f",
      "title": "Google critics think the search remedies ruling is a total whiff",
      "url": "https://www.theverge.com/news/769738/google-doj-antitrust-remedies-ruling-critics",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T00:06:24.000Z",
      "summary_90w": "",
      "raw": "The remedies ruling in the Department of Justice’s antitrust case against Google finally landed on Tuesday. Last year, Judge Amit Mehta ruled that Google was a monopolist in the search and advertising markets, but while today’s ruling says that Google will have to share some search data with competitors, Google doesn’t have to spin off Chrome and it can keep paying for deals like the one that lets it be the default search in Safari.\nMany Google critics aren’t happy with the remedies that have been handed down, saying that they don’t go far enough to slow Google’s dominance and restore competition in the market. Here are some statements from critics:\nSenator Amy Klobuchar (D-MN):\nToday’s ruling is a reminder of Google’s sweeping power over the online economy, but the limited remedies ordered by the court demonstrate why we need additional rules of the road for Big Tech. That’s why we must pass my bipartisan American Innovation and Choice Online Act to stop dominant platforms like Google from continuing to unfairly preference their own products over competitors’ — which hurts consumers and entrepreneurs, and stifles innovation. Through three administrations, our antitrust enforcers have proven that Google’s tactics endanger the future of a free and open internet and risk choking off innovation in critical areas like artificial intelligence. I will continue to work across the aisle to ensure even the most powerful tech companies have to play by the rules.\nDuckDuckGo CEO Gabriel Weinberg:\nWe do not believe the remedies ordered by the court will force the changes necessary to adequately address Google’s illegal behavior. Google will still be allowed to continue to use its monopoly to hold back competitors, including in AI search. As a result, consumers will continue to suffer. We believe Congress should now step in to swiftly make Google do the thing it fears the most: compete on a level playing field.\nNews / Media Alliance president and CEO Danielle Coffey:\nWe are disappointed in today’s decision. Judge Mehta’s ruling did not address the ability of Google to further cement its market power through its AI offerings. Google is forcing content creators to give away their content to be used in its AI offerings in order to remain in Google Search. This is a no-win scenario that will continue to harm publishers that invest in high-quality, journalistic and creative content. Giving publishers the ability to opt out of Google’s AI is critical to preserving an open internet free from anti-competitive behavior, and preserving a fair playing field for companies across a variety of industries. This ruling is not the end, but it is a missed opportunity.\nThe Tech Oversight Project executive director Sacha Haworth:\nWhile Judge Amit Mehta’s decision blocks some of Google’s predatory practices, it fails to meet this historic moment and shows that his decision was made based on speculative arguments about generative AI, in which Google, because of its interlocking monopolies and distribution advantage, is already a dominant player. Search is one of the largest avenues for future AI queries, and it’s crystal clear that rather than doing the hard thing, Judge Mehta was far more willing to let Google continue bending the internet and our economy to its will than enforcing the law, which is designed to create a level playing field that benefits the American people and innovative, new companies.\nAmerican Economic Liberties Project executive director Nidhi Hegde:\nThe Court found Google liable for maintaining one of the most consequential and damaging monopolies of the internet era, yet has bizarrely decided to leave its power almost fully intact. Imposing liability in name only is pure judicial cowardice. This ruling leaves the public unprotected, crucial and evolving markets concentrated, and worse, sends a signal that will embolden monopolists everywhere.\nNot everyone is fully opposed, with some speaking in favor of Judge Mehta not breaking up Google. However, some have also expressed concerns over the data-sharing portion of the remedies.\nComputer & Communications Industry Association president and CEO Matt Schruers:\nThe District Court’s ruling rightly rejected the drastic breakup proposed by the DOJ regarding Chrome and Android, which would have altered antitrust precedent and harmed competition and consumers. As the Court stated, the DOJ overreached in seeking the forced divestiture of these key assets. For consumers, the ruling means that Google will be compelled to share search queries and other data with certain competitors, which could significantly impact privacy and national security.\nCompetitive Enterprise Institute Center for Technology and Innovation director Jessica Melugin:\nToday’s ruling in the Google search case wisely avoids most of the requests from the Department of Justice, including a forced divestiture of Chrome and Android, overly broad payment bans, and other requested overreaches. But the mandated data sharing introduces questions about who might qualify as a ‘qualified competitor’ and if that benefits consumers, or just Google competitors.\nNetChoice vice president of public affairs Robert Winterton:\nThe court’s nuanced approach has prevented the DOJ from dismantling a leading American tech company at a pivotal time in history, ensuring President Trump’s administration stays true to its promise to empower American innovation.\nChamber of Progress CEO Adam Kovacevic:\nGoogle’s rivals wanted Judge Mehta to throw the book at Google, but he repeatedly cited the Microsoft antitrust precedent that remedies should be narrowly tailored to fit the offense. He spent 29 pages discussing how generative AI is now a competitive threat to traditional search engines. Innovation is a hare while antitrust law is a tortoise.\nGoogle plans to appeal the first ruling that found the company was an illegal monopolist.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2198325404ec05b6690bef29cfd7a60f3bba5d8f",
      "title": "Government unable to calculate Afghan data breach cost, watchdog says",
      "url": "https://www.bbc.com/news/articles/cm2k25dx1z3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:56:06.000Z",
      "summary_90w": "",
      "raw": "The National Audit Office says it has not been given enough information to have \"confidence\" a relocation scheme cost £850m.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "becc1608a39480c6ab122531f566e2f5351865a4",
      "title": "Filmmaker in legal battle over 'Downton Shabby'",
      "url": "https://www.bbc.com/news/articles/cr4ey262365o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:50:22.000Z",
      "summary_90w": "",
      "raw": "Hopwood DePree takes Rochdale council to the High Court over control of his ancestral stately home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac6e637aea2e03155e61ab66063e3b5b6e89d840",
      "title": "Seven claims made in new royal book from Brexit to Coronation",
      "url": "https://www.bbc.com/news/articles/c78z84d3gdgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:47:00.000Z",
      "summary_90w": "",
      "raw": "A new book on the connections between the royals and politics has revealed some eye-catching stories.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1be008a4cce520232e3bbb3f293735bb69f77fe",
      "title": "A scheme helped prevent sex offenders committing more crimes - then it closed. Why?",
      "url": "https://www.bbc.com/news/articles/cgqnqzkg83jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:40:29.000Z",
      "summary_90w": "",
      "raw": "The case raises difficult questions about how best to protect potential victims.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5bbe882f5c32980c0db615e01ac63766ae09113",
      "title": "Don't pay a fake parking fine – four ways to protect yourself from scams",
      "url": "https://www.bbc.com/news/articles/cn8438ngpe1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:37:07.000Z",
      "summary_90w": "",
      "raw": "Four simple tips to make sure you don't fall victim to fake texts or payment demands from BBC expert Nick Stapleton.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "afad8bf2be71a718e1a725e0e02831f9066c42e8",
      "title": "Thames Water bidders ready to clear out top managers",
      "url": "https://www.bbc.com/news/articles/cp8z8djjml5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:58.000Z",
      "summary_90w": "",
      "raw": "Sources close to the deal accept that the government needs to be seen to be tough with the company.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7a68a331a49b9b4892ef7c9ad493a7664760f13",
      "title": "Watch: Captain Scott’s famous polar shipwreck as never seen before",
      "url": "https://www.bbc.com/news/articles/cpwyvyqkx9yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:27.000Z",
      "summary_90w": "",
      "raw": "The Terra Nova carried Captain Scott and his men on their doomed expedition to the South Pole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e355c68b37a3fb7359bb77b3f60e468f33b9fa1",
      "title": "Ousted Democratic FTC commissioner can return (again) for now",
      "url": "https://www.theverge.com/news/769683/fired-democratic-ftc-commissioner-rebecca-slaughter-reinstated",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T23:19:51.000Z",
      "summary_90w": "",
      "raw": "Rebecca Kelly Slaughter, the Democratic Federal Trade Commissioner fired by President Donald Trump without cause, can at least temporarily return to work while her legal case plays out. \nThis happened once before when Slaughter briefly returned to her office months after Trump claimed to fire her, when US District Court Judge Loren AliKhan found her dismissal unlawful. Trump broke with decades of Supreme Court precedent known as Humphrey’s Executor, preventing presidents from firing independent commissioners without cause. But her return was short-lived — a few days later the appeals court temporarily paused the order reinstating Slaughter.\nThis latest order, approved 2-1 by a panel of appeals court judges, dissolves that stay and lets Slaughter get back to work until they decide on the merits of the case. While the majority judges don’t actually rule on the case, they write that the government is not likely to win, since “any ruling in its favor from this court would have to defy binding, on-point, and repeatedly preserved Supreme Court precedent.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b3a8a7e44df85bb3e631614f1e7bb8979c0f1a8f",
      "title": "Trump confirms U.S. strike on alleged Venezuelan drug boat",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525984/venezuela-trump-drugs-caribbean",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T23:07:53.000Z",
      "summary_90w": "",
      "raw": "President Trump says the U.S. military has struck a drug-laden vessel in the southern Caribbean after it left Venezuela. The strike comes a week after Washington deployed warships to the region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b1c6fcf6b0eb902c6ee4beaf7014de6d55646ad",
      "title": "Chris Mason: How Polanski's Green leadership could impact UK politics",
      "url": "https://www.bbc.com/news/articles/c9d0d32q0eno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T22:49:49.000Z",
      "summary_90w": "",
      "raw": "Zack Polanski's landslide victory is the latest example of a shake up in the country's politics.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1a85b2cd28ef41b47c910e085725e38a0071bb1",
      "title": "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T22:16:18.000Z",
      "summary_90w": "",
      "raw": "Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions \nThe US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between Washington and Caracas.\nTrump trailed the announcement during an address at the White House on Tuesday afternoon, telling reporters the US had “just, over the last few minutes, literally shot out … a drug-carrying boat”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a56676df663ab832e550668815ce2b54c1b2d91",
      "title": "Australia-Israel relations have hit a low point. Behind the scenes, it's business as usual",
      "url": "https://www.bbc.com/news/articles/cdd31vnygemo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T22:02:46.000Z",
      "summary_90w": "",
      "raw": "The two democratic allies have had a spectacular falling out - but what has actually changed?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53112f74c4bcaee6abbc430c1a5584946e8182f3",
      "title": "Watch: Timelapse shows Northern Lights display over North Sea",
      "url": "https://www.bbc.com/news/videos/ckglgp9q2nno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T21:47:48.000Z",
      "summary_90w": "",
      "raw": "Monday night's dazzling sight was filmed from Flamborough in East Yorkshire, over three hours and 40 minutes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0401e9d2081d4f99d62e71998ecf04b1f4099bc",
      "title": "Energy drinks to be banned for under-16s",
      "url": "https://www.bbc.com/news/articles/c707074qdnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T21:30:02.000Z",
      "summary_90w": "",
      "raw": "Health and Social Care Secretary Wes Streeting said he was acting on concerns for children's health.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "297e7f44da89dc1e261487d351c441ffa185db64",
      "title": "US v. Google: all the news from the search antitrust showdown",
      "url": "https://www.theverge.com/23869483/us-v-google-search-antitrust-case-updates",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T21:19:57.000Z",
      "summary_90w": "",
      "raw": "On August 5th, 2024, Judge Amit Mehta ruled in the case of United States of America v. Google, saying, “…the court reaches the following conclusion: Google is a monopolist, and it has acted as one to maintain its monopoly. It has violated Section 2 of the Sherman Act.” \nNearly a year later, the judge has followed that up with a ruling on remedies for Google’s search monopoly. While lawyers for the Department of Justice had argued that Google should be broken up and forced to split off products like Chrome, Search, and Android, Judge Mehta has ruled against the DOJ’s proposed remedies, banning exclusive deals but leaving others, like its massive search default deal with Apple, and allowing Google to keep Chrome.\nOf course, even that isn’t enough to end the biggest tech antitrust trial since the US took on Microsoft in the 1990s — possibly aside from the government’s antitrust case targeting Google’s ad business. Lawyers for Google and the Department of Justice will continue arguing over the ruling in appeals, as well as what to do about the company and its products.\nRead on below for all of the updates and notes from the case.\nGoogle critics think the search remedies ruling is a total whiff\n\t\t\t\nHere’s what Google and the DOJ had to say about the search remedies ruling.\n\t\t\t\nGoogle gets to keep Chrome, judge rules in search antitrust case\n\t\t\t\nInside the courthouse reshaping the future of the internet\n\t\t\t\nThe Google remedies trial is over.\n\t\t\t\nGoogle wants a 60-day stay on any remedies.\n\t\t\t\nGoogle attorney: “This is a trainwreck of a technical committee.”\n\t\t\t\nThe “delicate balance” of advertisers.\n\t\t\t\nBack to Google, into overtime.\n\t\t\t\nLightning round.\n\t\t\t\n“Hey, you wanna try Bing for ten bucks?”\n\t\t\t\nWe’re nearing the end.\n\t\t\t\n“Google thinks it’s the only one that can invent things.”\n\t\t\t\n“The value of Chrome to Google is substantially more than the value of Chrome to anyone else.”\n\t\t\t\nGoogle’s attorney cites a “laundry list” of reasons selling Chrome (and maybe Android) is bad.\n\t\t\t\nThe future of Chromium depends on acquihiring, apparently.\n\t\t\t\nThe future of Chromium.\n\t\t\t\n“Let’s talk about Chrome.”\n\t\t\t\nA quick recap.\n\t\t\t\nJudge: “I’m not sure Microsoft would even step forward and put very much in the pot.”\n\t\t\t\n“Microsoft’s not coming in with a non-exclusive deal,” says Google lawyer.\n\t\t\t\n“We just like, threw it out there, to see what would happen!”\n\t\t\t\n“Maybe people don’t want ten blue links anymore.”\n\t\t\t\nCan Google possibly lose in a ban on placement deals?\n\t\t\t\nShould Firefox die to punish Google?\n\t\t\t\n“Those payments have frozen the ecosystem.”\n\t\t\t\nNext up: distribution.\n\t\t\t\nAnother break.\n\t\t\t\nPrivacy is becoming a sticking point.\n\t\t\t\n“I think the privacy stuff is a complete failure here.”\n\t\t\t\nWe’re back to Google.\n\t\t\t\nCould Google only share the long tail?\n\t\t\t\n“Nobody’s really testified about user-side data.”\n\t\t\t\nMehta still seems skeptical of the link between AI and search.\n\t\t\t\nShould AI companies get syndicated data from Google?\n\t\t\t\nBack now, talking about data and scale.\n\t\t\t\nBreak time.\n\t\t\t\n“Our remedies are tied to barriers to entry.”\n\t\t\t\nGoogle is still the best search engine for Apple, says attorney.\n\t\t\t\nAI is back up for debate.\n\t\t\t\nJudge Mehta: is there a middle ground on data-sharing?\n\t\t\t\n“By definition, network effects crowd out competition,” says Mehta.\n\t\t\t\nGoogle lawyer: “Was anybody clamoring to preload Bing on these devices?”\n\t\t\t\nGoogle’s lawyer is up.\n\t\t\t\nLots of AI questions to the DOJ.\n\t\t\t\n“Google’s self-reinforcing monopoly machine.”\n\t\t\t\nClosing arguments in the Google search antitrust trial.\n\t\t\t\nGoogle rejected giving publishers more choice to opt out of AI Search\n\t\t\t\nEddy Cue is fighting to save Apple’s $20 billion paycheck from Google\n\t\t\t\nApple’s Eddy Cue: ‘You may not need an iPhone 10 years from now’\n\t\t\t\nGoogle searches are falling in Safari for the first time ever — probably because of AI\n\t\t\t\nApple is looking at adding Perplexity and other AI search engines to Safari\n\t\t\t\nDOJ’s proposed Google changes would ‘deeply undermine user trust,’ search chief says\n\t\t\t\nPublisher opt-outs of AI training cut Google’s DeepMind training data in half.\n\t\t\t\nFirefox could be doomed without Google search deal, says executive\n\t\t\t\nSundar Pichai says the DOJ’s antitrust plan could kill Google Search\n\t\t\t\nGoogle confirms it’s close to getting Gemini support on iPhones\n\t\t\t\nTough day in court for Google Plus and Google Buzz.\n\t\t\t\nSundar Pichai says the remedies against Google would be a crushing blow.\n\t\t\t\nIt’s Sundar time in US v. Google.\n\t\t\t\nChrome could suffer apart from Google, says Google.\n\t\t\t\nGoogle is paying Samsung an ‘enormous sum’ to preinstall Gemini\n\t\t\t\nWhy are companies lining up to buy Chrome?\n\t\t\t\nYahoo wants to buy Chrome\n\t\t\t\nPerplexity wants to buy Chrome if Google has to sell it\n\t\t\t\nMoney, Chrome, and ChatGPT: The high stakes of Google’s monopoly trial\n\t\t\t\nThe Department of Justice really, really wants Google to sell Chrome.\n\t\t\t\nThe future of Google Search is back in court.\n\t\t\t\nGoogle is in more danger than ever of being broken up\n\t\t\t\nGoogle agrees to let employees talk about its Search antitrust trial.\n\t\t\t\nTrump’s DOJ still says Google should be broken up\n\t\t\t\nDOJ says it will let Google pay Apple for services unrelated to search.\n\t\t\t\nApple’s attempt to intervene in the Google Search antitrust trial is denied\n\t\t\t\nApple asks court to halt Google search monopoly case\n\t\t\t\nGoogle CEO Sundar Pichai tells employees to expect a hard 2025.\n\t\t\t\nEddy Cue explains why Apple won’t make a search engine\n\t\t\t\nApple would like to step in to defend its Google search deal.\n\t\t\t\nGoogle to court: we’ll change our Apple deal, but please let us keep Chrome\n\t\t\t\nGoogle’s counteroffer to the government trying to break it up is unbundling Android apps\n\t\t\t\nBreaking down the DOJ’s plan to end Google’s search monopoly\n\t\t\t\nGoogle responds to DOJ’s ‘extreme proposal.’\n\t\t\t\nDOJ says Google must sell Chrome to crack open its search monopoly\n\t\t\t\nGoogle workers to DOJ: we need protections to make your breakup effective\n\t\t\t\nCould Chrome be ready to Rumble?\n\t\t\t\nUS lawyers will reportedly try to force Google to sell Chrome and unbundle Android\n\t\t\t\nGoogle is replacing the exec in charge of Search and ads\n\t\t\t\nHow the DOJ wants to break up Google’s search monopoly\n\t\t\t\nA Google breakup is on the table, say DOJ lawyers\n\t\t\t\nThe DOJ will have its proposed plan to deal with Google’s monopoly soon.\n\t\t\t\nThe DOJ wants info on Google’s AI strategy to bust up its search monopoly\n\t\t\t\nYelp sues Google for antitrust violations\n\t\t\t\nWhat Google rivals want after the DOJ’s antitrust trial win\n\t\t\t\nGoogle lost its first antitrust case, so what happens next?\n\t\t\t\n‘There’s no price’ Microsoft could pay Apple to use Bing: all the spiciest parts of the Google antitrust ruling\n\t\t\t\nNow that Google is a monopolist, what’s next?\n\t\t\t\nJudge rules that Google ‘is a monopolist’ in US antitrust case\n\t\t\t\nWell, that’s an interesting name for it.\n\t\t\t\nAs Google’s antitrust trial wraps, DOJ seeks sanctions over missing messages\n\t\t\t\nMultibillion-dollar Apple deal looms large in Google antitrust trial\n\t\t\t\nGoogle paid Apple $20 billion in 2022 to be Safari’s default search engine.\n\t\t\t\nA Google witness let slip just how much it pays Apple for Safari search\n\t\t\t\n‘Android is a massive tracking device.’\n\t\t\t\nHere’s a rare look at Google’s most lucrative search queries\n\t\t\t\nSundar Pichai argues in court that Google isn’t evil, it’s just a business\n\t\t\t\nGoogle agreed to not promote Chrome to Safari users.\n\t\t\t\nGoogle once asked Apple to preload its search app on iOS\n\t\t\t\nIt’s Internet Explorer day in US v. Google!\n\t\t\t\nHello again from DC District Court!\n\t\t\t\nGoogle paid a whopping $26.3 billion in 2021 to be the default search engine everywhere\n\t\t\t\n“Chrome exists to serve Google search.”\n\t\t\t\nSundar Pichai will testify in US v. Google on Monday.\n\t\t\t\nGoogle reportedly pays $18 billion a year to be Apple’s default search engine\n\t\t\t\nThe Google antitrust trial has been frustratingly locked down — the NYT just filed a motion to open it up\n\t\t\t\nRead Sundar Pichai’s full email conversation about the Apple-Google deal.\n\t\t\t\nThe Google trial shows that Apple’s search deal is the most important contract in tech\n\t\t\t\nBack in 2007, Sundar Pichai thought Google shouldn’t be Safari’s only search option.\n\t\t\t\nDetails of Apple’s talks to replace Google with Bing and even DuckDuckGo revealed in unsealed court testimony\n\t\t\t\nToday on The Vergecast: Big Tech goes to court.\n\t\t\t\nSatya Nadella tells a court that Bing is worse than Google — and Apple could fix it\n\t\t\t\nAn hour-long history lesson about Microsoft’s many failures in mobile.\n\t\t\t\nMicrosoft doesn’t think AI is going to upend search competition – it thinks it could get even more locked-down.\n\t\t\t\nSatya Nadella says Bing was prepared to lose billions just to be Apple’s search default.\n\t\t\t\nGood morning from DC District Court!\n\t\t\t\nOne of the documents Google wanted hidden in its trial compared the search ads business to “cigarettes or drugs.”\n\t\t\t\nSatya Nadella is testifying in US v. Google next week.\n\t\t\t\nThe Google antitrust trial is opening back up… a little\n\t\t\t\nApple defends Google Search deal in court: ‘There wasn’t a valid alternative’\n\t\t\t\nWould Safari have been popular without its Google integration?\n\t\t\t\nShould Apple add a search engine choice screen to the iPhone setup process?\n\t\t\t\nApple’s Eddy Cue says there’s really no “valid alternative to Google.”\n\t\t\t\nThe US v. Google court is starting in closed session today. Again.\n\t\t\t\nToday’s an important day in US v. Google.\n\t\t\t\nApple’s Eddy Cue will take the stand Tuesday in the Google antitrust trial\n\t\t\t\nThe Google antitrust trial is still maddeningly locked-down.\n\t\t\t\nClickbait? In my antitrust trial?\n\t\t\t\nHere are the documents the Google antitrust trial judge didn’t want you to see\n\t\t\t\nOkay, can we see Google trial documents or not?\n\t\t\t\nWill US v. Google evidence stay public? We still don’t know.\n\t\t\t\nJustice Department and Google spar over public access to antitrust trial files\n\t\t\t\nGoogle quietly raised ad prices to boost search revenue, says executive\n\t\t\t\nUS v. Google, Week Two begins.\n\t\t\t\nIn the Google antitrust trial, defaults are everything and nobody likes Bing\n\t\t\t\nBreaking down the Google antitrust trial.\n\t\t\t\nOpening arguments in US v. Google just ended! Only ten weeks left to go.\n\t\t\t\n“We don’t have good data on actual user switching.”\n\t\t\t\nBing is already Google’s punching bag for the trial.\n\t\t\t\nThere’s still an ads case inside this search case against Google.\n\t\t\t\nWhat makes a search engine a search engine?\n\t\t\t\n50 percent of Google searches allegedly come through a paid-for default deal.\n\t\t\t\n“Defaults matter, but they’re not determinative.”\n\t\t\t\nThe antitrust trial against Google Search starts today — here’s what to expect\n\t\t\t\nHow Google plans to win its antitrust trial",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aabe0d43fa409797fe6d741cdff14d0cd90e3095",
      "title": "The best deals on MacBooks right now",
      "url": "https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T21:19:20.000Z",
      "summary_90w": "",
      "raw": "Apple’s latest 13-inch MacBook Air with an M4 chip is on sale starting at $799 ($200 off).\t\n\nApple currently sells MacBooks equipped with its own M-series chips in a wide range of sizes and price points. It discontinued the M1 MacBook Air to make room for newer models, but some retailers are still selling the 2020 laptop starting at $599 ($50 off) at Walmart — a far cry from the $2,499 starting price of the latest 16-inch MacBook Pro with M4 Pro.\nPurchasing a new MacBook can be a pricey endeavor, but finding a deal is surprisingly easy. Apple has recently shaken up the starting RAM for several models, creating more options than ever before and resulting in steeper discounts on older models.\n\nThe best MacBook Air deals\nThe best MacBook Pro deals\nM4 and M4 Pro MacBook Pro\nThe best Mac Mini deals\n\nAlthough Macs may not get perpetual discounts, it’s not uncommon to see various models discounted by as much as $800. Alternatively, purchasing refurbished options directly from Apple is another way to save money without waiting for the changing deal winds to blow your way. It’s also the only option to find certain SKUs of older models as Apple continues to move forward on newer releases. Apple’s refurbished store provides a one-year warranty on all products, and generally offers discounts of up to 15 to 20 percent off the price of a new unit.\nBut if you want to buy new and you’re looking to save whatever you can, here are the best MacBook Air, MacBook Pro, and Mac Mini deals available.\nThe best MacBook Air deals\nM1 MacBook Air\nThe M1 MacBook Air was considered Apple’s entry-level laptop before the M3 model’s arrival prompted Apple to stop selling it directly in its online and brick-and-mortar stores. It’s still a great choice if you want a MacBook for non-intensive productivity work, especially given that it features a comfortable keyboard, an excellent trackpad, and all-day battery life. For many people, the M1 Air still ticks the right boxes when it comes to performance and price, even if it’s long enough in the tooth to have been removed in our guide to the best laptops.\nThe base MacBook Air with the M1 chip comes with 8GB of RAM and 256GB of storage. It’s becoming harder to find in new condition, but Walmart has committed to keeping it around for the foreseeable future and is currently discounting it to $599 ($50 off), which is its lowest price to date.\n2020 MacBook Air with M1 (256GB)\nThe 2020 MacBook Air has been discontinued but remains a great value. It comes outfitted with the company’s original M1 chip in one of three different colors (silver, space gray, and gold).\n\nWhere to Buy:\n\n $649 $599 at Walmart\n\nM2 MacBook Air\nThe M2 MacBook Air is a slim, lightweight laptop with a 1080p webcam and a handy magnetic charger that frees up one of its two USB-C ports. Although its M2 processor wasn’t as revolutionary as the M1 generation, it’s a better performer for any kind of user than the M1, including creators with demanding workloads.\nIt does have some slight downsides, though, including slower storage in the base 256GB configuration and a notch cutout in its otherwise excellent screen. But even so, Apple hasn’t offered a more travel-friendly laptop than this one since the days of the polarizing 12-inch MacBook, and this prior-gen model was once good enough to top our list of the best laptops.\nThe M2-powered MacBook Air from 2022 seems to be on its way out, with availability waning; however, you can still get the 13-inch M2 model with 16GB of RAM, 256GB of storage, and an eight-core GPU in select colors at Best Buy starting at $699 ($100 off). The 15-inch MacBook Air M2 is also still available in short supply at some retailers for its original MSRP, though, at this point, you’d be better off going with a discounted M4 model.\n13-inch MacBook Air with M2 (2022)\nThe 2022 MacBook Air is a thin, lightweight device powered by Apple’s M2 chip. The M2 model touts an improved 1080p webcam and a better display than its predecessor while retaining features like long battery life and MagSafe charging.\n\nWhere to Buy:\n\n $799 $699 at Best Buy (16GB RAM, 256GB SSD)\n\nM3 MacBook Air\nThe M1 Air and its wedge had to perish for the M3 MacBook Air to exist. Apple’s updated entry-level laptops arrived in 2023 in both 13.6- and 15.3-inch variants simultaneously, bringing with them slightly faster performance and a slate of minor upgrades. Apple added Wi-Fi 6E, for one, along with an additional Thunderbolt port that allows you to use two external displays when the lid is closed. They also continue to offer 18 hours of battery life and a MagSafe charging port. Apple discontinued the M3 MacBook Air with 8GB of RAM last year and now considers the 16GB / 256GB model as the starting configuration.\nThe entry-level 13-inch M3 MacBook Air configuration with an 8-core GPU, 16GB of RAM, and a 256GB SSD is tough to find in stock. However, you can get the 24GB RAM / 512GB SSD model with a 10-core GPU for $1,099 ($200 off) in select colors at Best Buy. Given the relatively small price difference between these two models, it’s great that you’re getting double the amount of internal storage and additional memory. \nAs for the M3-powered 15-inch MacBook Air, you can buy it in select colors at Best Buy and B&H Photo with 256GB of storage, 16GB of RAM, and a 10-core GPU for $899 ($200 off). Meanwhile, the upgraded model with 512GB of storage, 16GB of RAM, and a 10-core GPU is currently down to $1,099 ($200 off) at Best Buy. If you need even more memory, the model with 512GB of storage, 24GB of RAM, and a 10-core GPU is available for $1,199 ($450 off) at Best Buy and B&H Photo.\n13-inch MacBook Air with M3 (2024)\nThe MacBook Air M3 is a jack-of-all-trades, with a balanced combination of performance and power efficiency. It also now supports dual displays with the lid closed, and the storage speed is noticeably faster. You don’t need to think about if this laptop will meet your needs — it just will.\n\nWhere to Buy:\n\n $1299 $1099 at Best Buy (24GB RAM, 512GB SSD)\n\n\nApple MacBook Air M3 (15-inch)\nThe 15-inch MacBook Air is also equipped with Apple’s M3 chip. It features a larger display and better speaker array than the 13-inch MacBook Air M3. As of October 2024, it starts with 16GB of RAM instead of the original 8GB when it launched.\n\nWhere to Buy:\n\n $1099 $899 at Best Buy (16GB RAM, 256GB SSD)\n $1099 $899 at B&H Photo (16GB RAM, 256GB SSD)\n $1299 $1099 at Best Buy (16GB RAM, 512GB SSD)\n\nM4 MacBook Air\nIn March, along with an updated Mac Studio, Apple released an updated MacBook Air, which comes in both a 13- and 15-inch configuration with an M4 processor. Interestingly, the latest Air starts at a lower price than the prior model, yet it offers slightly faster performance and twice as much base RAM at 16GB. It can also connect to two external monitors with the lid open, comes in a sky blue color, and features the 12-megapixel Center Stage webcam from the latest MacBook Pro. Needless to say, there’s a lot to like.\nBoth the 13-inch and 15-inch MacBook Airs are currently receiving some sizable discounts. You can pick up the 13-inch base model with a 10-core CPU, eight-core GPU, 16GB of RAM, and 256GB of storage on sale at Amazon in select colors starting $799 ($200 off). If you prefer the larger 15-inch model, the entry-level configuration with a 10-core GPU, 16GB of RAM, and 256GB of storage is on sale for $1,049 ($150 off) at Amazon and B&H Photo.\n13-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nPowered by the M4 chip, Apple’s latest 13-inch MacBook Air is faster than its predecessor and offers double the base RAM. It can also now connect to two external displays with the lid open and features an improved Center Stage webcam.\n\nWhere to Buy:\n\n $999 $799 at Amazon\n $999 $869 at B&H Photo\n\n\n15-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nApple’s 15-inch MacBook Air with the M4 chip is nearly identical to its 13-inch sibling. However, it includes a six-speaker sound system, not four, and your choice of a free 35W Dual USB‑C Port Compact Power Adapter or 70W USB‑C Power Adapter.\n\nWhere to Buy:\n\n $1199 $1049 at Amazon\n $1199 $1049 at B&H Photo\n\nThe best MacBook Pro deals\nDuring its “Scary Fast” event in 2023, Apple announced MacBook Pros that use M3 processors — including a 14-inch model that replaced the 13-inch M2 model. Apple followed the M3 models up with M4-based machines in October 2024, but the last-gen M3 models can often be the better bargain, as they’re still relatively easy to find and receive steeper discounts.\nM3 and M3 Pro MacBook Pro\nThe entry point into the MacBook Pro world is a MagSafe-equipped MacBook Pro that uses the existing 14-inch design and slightly pares it down. The 14-inch M3 MacBook Pro has the same 3024 x 1964 resolution display and 120Hz refresh rate as its pricier siblings, and in addition to a MagSafe charging port, it has an SD card slot and HDMI port. However, it starts with just 8GB of RAM and lacks the third USB-C / Thunderbolt port found on the M3 Pro and M3 Max models (as well as Thunderbolt 4 speeds).\nThe M3 MacBook Pro may be a bit of an odd middle child in some ways, but it’s still a very good laptop — especially if you can find a deal that puts more price distance between the M3 model and the M3 Pro version. Availability for the base model with 8GB and 512GB of storage seems to be waning as Apple standardizes 16GB of RAM across its lineup.\nWe’re having trouble finding the 16GB RAM / 512GB SSD model in stock. However, Best Buy is selling the 14-inch, M3-powered MacBook Pro with 8GB of RAM, a 1TB SSD, and a 10-core GPU for $1,199 ($400 off). If you need a higher-powered laptop with a larger display, you can get the 16-inch, M3 Pro-powered MacBook Pro with 36GB of RAM, a 512GB SSD, and an 18-core GPU for $2,299 ($500 off) at Best Buy.\n14-inch MacBook Pro with M3 (2023)\nApple’s previous-gen 14-inch laptop powered by the M3 processor uses a similar design to the pricier 14-inch MacBook Pro with Apple’s Pro- / Max-series chips but is offered at a lower price with similar ports and less RAM.\n\nWhere to Buy:\n\n $1599 $1199 at Best Buy (8GB RAM, 1TB SSD)\n\nM4 and M4 Pro MacBook Pro\nApple released the M4-series MacBook Pro in November 2024. Notably, the base 14-inch M4 MacBook Pro is the first to launch with 16GB of RAM — double the previous generation’s starting memory — and 512GB of storage for the same $1,599 starting price as the last-gen model. It also picks up a third Thunderbolt 4 port, which is positioned on the right side and supports dual external monitors while the lid is open. Also new this year is an upgraded 12-megapixel webcam that supports Center Stage and a new Desk View feature, plus the option to add a nano-texture display for an extra $150. It’s also available in space black.\nThe 14- and 16-inch MacBook Pro models with M4 Pro and M4 Max chips also received additional RAM, bringing them up to 24GB. They start with 512GB of storage, too, and retail for $1,999 and $2,499, respectively. While the total port selection hasn’t changed compared to their respective M3 Pro and M3 Max counterparts, you’ll get faster Thunderbolt 5 ports on these more substantial models. That’s in addition to the SD slot, dedicated full-sized HDMI port, and 3.5mm jack. They also have the upgraded 12-megapixel Center Stage webcam with Desk View and the optional nano-texture display option.\nMany variations of the M4 MacBook Pro with different screen and processor configurations are on sale right now. For example, you can currently pick up the base 14-inch MacBook Pro M4 with 16GB of RAM and a 512GB SSD at Amazon for $1,412.54 (about $185 off). Meanwhile, the 24GB / 512GB variant with an M4 Pro chip (12-core CPU / 16-core GPU) is down to $1,699 ($300 off) at Amazon and Best Buy.\nThe base 16-inch MacBook Pro is also on sale with an M4 Pro chip, 24GB of RAM, and 512GB of storage for $2,205.28 (about $294 off) at Amazon.\nApple MacBook Pro 14 (2024, M4)\nThe entry-level MacBook Pro with M4 starts with 16GB of RAM — double that of its predecessor — and a 512GB SSD for the same starting price of $1,599. It also gets a third USB-C / Thunderbolt 4 port and comes in a new space black option.\n\nWhere to Buy:\n\n $1599 $1412.54 at Amazon (16GB RAM, 512GB SSD)\n $1599 $1499 at B&H Photo (16GB RAM, 512GB SSD)\n\n\n14-inch MacBook Pro with M4 Pro\nThe 14-inch MacBook Pro with a 12-core / 16-core M4 Pro chip starts with 24GB of RAM — a 6GB increase over the prior generation. It also has a 512GB SSD, three Thunderbolt 5 USB-C ports, an optional nano-texture display, and a 12-megapixel webcam.\n\nWhere to Buy:\n\n $2499 $1699 at Amazon (24GB RAM, 512GB SSD)\n $2499 $1699 at Best Buy (24GB RAM, 512GB SSD)\n $2499 $1799 at B&H Photo (24GB RAM, 512GB SSD)\n\n\nApple MacBook Pro 16 (2024, M4 Pro)\nThe 16-inch MacBook Pro with M4 Pro starts with 24GB of RAM and offers more computing cores (14 for the CPU and 20 for the GPU) compared to the 14-inch model. It also picks up Thunderbolt 5 ports and a new 12-megapixel Center Stage camera.\n\nWhere to Buy:\n\n $2499 $2205.28 at Amazon (24GB RAM, 512GB SSD)\n $2499 $2299 at B&H Photo (24GB RAM, 512GB SSD)\n\nThe best Mac Mini deals\nThe newest Mac Minis in town are the M4-based models, which arrived late last year. Apple reduced the horizontal footprint of its desktop and paired it with its M4 chipset and 16GB of RAM, which is double that of the previous generation and brings it in line with other base model Macs from 2024. That makes Apple’s newest desktop computer a tremendous value.\nM4 and M4 Pro Mac Mini\nDeals on the newest Mac Mini are a bit easier to come by now than they were at launch, which is good since the outgoing M2 model is becoming more difficult to find. The M4 Mac Mini starts with an M4 processor, 16GB of RAM, and 256GB of storage for $599. That’s an incredible value for a tiny desktop computer that can rival the Mac Studio and Mac Pro when it comes to certain tasks, including light gaming, 4K video editing, and 3D modeling. Vertically, the M4 Mac Mini is a fair bit thicker than the last-gen M2 model at 2 inches tall, yet it measures a mere 5 inches wide and 5 inches deep.\nIn addition to the odd decision to place the power button on its underside, Apple moved the 3.5mm headphone jack and two of its five USB-C / Thunderbolt 4 ports to the front. The rear features an additional three Thunderbolt ports, HDMI-out, and a gigabit ethernet port. You can also get the Mac Mini with an M4 Pro chipset starting at $1,399, which comes with faster Thunderbolt 5 storage and the option to upgrade to 10-gigabit ethernet for another $100.\nRight now, you can get the base Mac Mini at B&H Photo with an M4 chip, 16GB of RAM, and a 256GB SSD for $549 ($51 off). If you need more storage, you can step up to the version with 16GB of RAM and a 512GB SSD for around $743 ($66 off) at B&H Photo and Amazon.\nMeanwhile, the base M4 Pro model with 24GB of RAM and 512GB of storage is on sale for around $1,255 ($144 off) at Amazon and B&H Photo.\nApple Mac Mini (M4)\nThe latest Mac Mini features Apple’s upgraded M4 chips and a smaller build than the prior model. Each configuration now starts with 16GB of RAM and includes five total Thunderbolt ports, gigabit ethernet, HDMI, and a 3.5mm jack. Read our review.\n\nWhere to Buy:\n\n $599 $549 at B&H Photo (M4, 16GB RAM, 256GB SSD)\n $599 $557 at Amazon (M4, 16GB RAM, 256GB SSD)\n $799 $743 at Amazon (M4 Pro, 16GB RAM, 512GB SSD)\n\nUpdate, September 2nd: Updated to reflect current pricing and availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8fa7d774a3e82c502d9270f025845dbf2f84783e",
      "title": "Google and Apple&#8217;s $20 billion search deal survives",
      "url": "https://www.theverge.com/news/769599/google-apple-search-deal-us-doj-antitrust-case-remedies",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T21:10:13.000Z",
      "summary_90w": "",
      "raw": "Google will be able to keep making search deals like its $20 billion agreement to be the default option in Apple’s Safari browser, a federal district court judge ruled in the US v. Google antitrust case on Tuesday. Executives from both Apple and Firefox-made Mozilla have defended their search deals with Google, with Mozilla’s CFO testifying that Firefox might be doomed without the deal in place.\n“Google will not be barred from making payments or offering other consideration to distribution partners for preloading or placement of Google Search, Chrome, or its GenAI products,” Judge Amit Mehta wrote. “Cutting off payments from Google almost certainly will impose substantial—in some cases, crippling—downstream harms to distribution partners, related markets, and consumers, which counsels against a broad payment ban,” Mehta said.\nGoogle also won’t have to show choice screens on its products, according to the ruling. The determinations were made as part of a broader remedies ruling that does not force Google to divest Chrome or Android, which the Justice Department had wanted. Google will, however, have to share some search data with competitors.\nLast year, Judge Mehta ruled that Google was a monopolist in the search and advertising markets, and this new ruling followed a remedies trial. Google plans to appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c08b57592134ecabac0d1d7637ad82c99b5e603",
      "title": "How three businesses are coping with tariff limbo",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525791/how-three-businesses-are-coping-with-tariff-limbo",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:08:39.000Z",
      "summary_90w": "",
      "raw": "US importers are in a kind of tariff limbo. A federal appeals court has struck down most of President Trump's import taxes. But the tariffs are still being collected, for now, until there's a final decision from the Supreme Court.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7688c17e54001c3dc871f62669b81ea184807eb9",
      "title": "Amazon&#8217;s Lens Live AI shops for anything you can see",
      "url": "https://www.theverge.com/news/769585/amazon-lens-live-ai-real-time-shopping",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T21:01:13.000Z",
      "summary_90w": "",
      "raw": "Amazon will now let you shop for products by pointing your camera at them. On Thursday, the company announced Lens Live, a new feature that uses your camera to scan things in the environment around you, while surfacing matching product listings.\nThis feature, which is only rolling out to the Amazon Shopping app on iOS for now, lets you pan your camera around a room or focus on a specific product. Amazon says Lens Live will use an object detection model to identify the products shown on your camera in real-time, and then compare them against the billions of products on its marketplace.\nOnce it finds similar items, Lens Live will display them in a swipeable carousel, where it will also show options to add products to your cart or wishlist. It sounds like Amazon’s take on Google’s Gemini Live, an AI-powered assistant that similarly lets you scan things in your environment and ask questions about them. The difference is that Amazon’s AI tool puts a big “buy” button on everything you see.\nLens Live also integrates Amazon’s AI assistant Rufus to summarize product descriptions and answer questions about them. The feature builds upon the existing capabilities of Amazon’s visual search features, which let you search for products by uploading an image, scanning a barcode, or snapping a picture in the Amazon Shopping app. Amazon plans on bringing Lens Live to more customers in the “coming weeks.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcf71c63cee7c52bc78112f84e9f86ac64ba7280",
      "title": "After Hurricane Katrina, evacuees changed Houston and the city changed them",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5456230/houston-new-orleans-hurricane-katrina-evacuees",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T21:00:31.000Z",
      "summary_90w": "",
      "raw": "It's hard to know how many people who lost their home in New Orleans made Houston their permanent home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cbf8cbaded0fcf643a4fb6138c9e7a8e568eb84b",
      "title": "Google gets to keep Chrome, judge rules in search antitrust case",
      "url": "https://www.theverge.com/policy/717087/google-search-remedies-ruling-chrome",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T20:57:46.000Z",
      "summary_90w": "",
      "raw": "Google will not have to sell its Chrome browser in order to address its illegal monopoly in online search, DC District Court Judge Amit Mehta ruled on Tuesday. Over a year ago, Judge Mehta found that the search giant had violated the Sherman Antitrust Act; his ruling now determines what Google must do in response.\nMehta declined to grant some of the more ambitious proposals from the Justice Department to remedy Google’s behavior and restore competition to the market. Besides letting Google keep Chrome, he’ll also let the company continue to pay distribution partners for preloading or placement of its search or AI products. But he did order Google to share some valuable search information with rivals that could help jumpstart their ability to compete, and bar the search giant from making exclusive deals to distribute its search or AI assistant products in ways that might cut off distribution for rivals.\nIt’s the most significant antitrust remedies ruling against a tech giant in about 25 years, since the DOJ’s case against Microsoft. While it marks a major milestone in the case, it could still be years until Google is actually required to implement these solutions — if ever. Now that Mehta has handed down his remedies ruling, Google can finally appeal his underlying finding that it’s an illegal monopolist. From there, the case could go as far as the Supreme Court.\nGoogle has “concerns about how these requirements will impact our users and their privacy, and we’re reviewing the decision closely,” the company’s vice president of regulatory affairs Lee-Anne Mulholland said in a statement. DOJ antitrust chief Gail Slater struck a victorious tone in a statement, but signaled the agency had yet to decide whether to appeal to get more of its requested remedies. “The first Trump administration sued Google to restore competition for millions of Americans subjected to Google’s monopoly abuses. Today, the second Trump administration has won a remedy to do just that,” Slater said. “We will continue to review the opinion to consider the Department’s options and next steps regarding seeking additional relief.”\nLast year, the DOJ submitted a long wish list for breaking Google’s hold over the online search market, and argued that no one solution would be sufficient to truly unlock competition in the space. Its most splashy proposals included requiring Google to sell its Chrome browser, which it sees as a key access point for search engines where Google can prioritize itself, and requiring it to let competitors buy search query data and signals to fuel their own search engines in order to jumpstart competition.\nOver the course of a three-week remedies trial this spring, Mehta heard from Google’s CEO and high-ranking executives from Apple, OpenAI, Perplexity, and traditional search competitors. Google argued that Mehta should only narrowly bar it from certain contract provisions that the judge had found to be exclusionary, and warned that the government’s more lofty proposals could jeopardize user privacy, disincentivize funding for the open-source browser engine Chromium, and unfairly force Google to share knowledge with competitors it had worked hard to earn. Apple and Firefox owner Mozilla, for their parts, warned they could become collateral damage if the judge barred Google from paying them to make its search engine the default on their services.\n\n“The court is highly skeptical that a Chrome divestiture would not come at the expense of substantial product degradation”\n\n\nIn his 230-page ruling, Mehta explained that even though Google’s default status as the search engine on Chrome “undoubtedly contributes to Google’s dominance in general search,” forcing Google to sell it is ultimately “a poor fit for this case.” The DOJ failed to prove that solutions less extreme than a break-up would not be enough to restore competition, he wrote. Furthermore, he says, the DOJ did not prove a causal connection between its monopoly power and Chrome defaults. “But more to the point, there would be nothing ‘natural’ about a Chrome divesture,” Mehta said. “It would be incredibly messy and highly risky.” That’s because it doesn’t run as a “standalone business” and relies greatly on Google’s own infrastructure, he wrote. Even if another owner tried to take it over, he wrote, “the court is highly skeptical that a Chrome divestiture would not come at the expense of substantial product degradation and a loss of consumer welfare.”\nMehta also feared that upending Google’s payments to search distribution platforms would have negative effects rippling across the ecosystem. Banning these kinds of payments to companies like Apple and Mozilla for default placement on their browsers and devices could theoretically “bring about a much-needed thaw,” Mehta said, and even encourage a company like Apple to enter the search market itself. But, he concluded, granting such a remedy risks harming phone and browser makers by denying them significant revenue, while Google gets to keep its money while likely maintaining much of its user base. Though he acknowledged that denying a payments ban is an imperfect solution, Mehta said that “allowing Google to continue making payments is more palatable now than when the liability phase concluded,” since a boom in venture funding for generative AI projects means that “companies already are in a better position, both financially and technologically, to compete with Google than any traditional search company has been in decades (except perhaps Microsoft).”\nDeclining to ban Google from paying for defaults actually “heightened” the need to adopt a remedy that forces Google to share some of its search data with competitors, Mehta noted. “Qualified Competitors will have to continue to compete with Google on price to gain distribution. So, their competitive advantage will have to come from innovation and differentiating their search services from Google’s,” he wrote. To do that, search competitors need scale that they have largely been denied by Google’s search monopoly. So Mehta agreed to let qualified competitors buy at marginal cost a one-time snapshot of a variety of search data that Google collects, which he says will let those rivals “identify and crawl more web pages with valuable content and do so more efficiently.”\nThis remedy is far shy of what the DOJ requested, however. Mehta granted only a narrow subset of the search data the DOJ wanted Google to share with rivals, and only agreed to compel Google to share it once, rather than periodically for the freshest data, which he says, “minimizes the risk of free riding identified by Google’s expert economist and acknowledged by Plaintiffs.” Mehta similarly granted the DOJ’s proposal to require Google to syndicate search results to competitors, but narrowed the scope, allowed Google to price them above marginal cost, and only made the requirement last five years, rather than the 10 the government asked for.\nDuckDuckGo CEO Gabriel Weinberg, who testified as a search competitor on behalf of the government, said in a statement that Mehta’s ruling would not be effective. “Google will still be allowed to continue to use its monopoly to hold back competitors, including in AI search. As a result, consumers will continue to suffer,” he wrote. “We believe Congress should now step in to swiftly make Google do the thing it fears the most: compete on a level playing field.”\n\n“You don’t find someone guilty of robbing a bank and then sentence him to writing a thank you note for the loot”\n\n\nThe American Economic Liberties Project, a group that’s advocated for stronger antitrust enforcement against the tech industry, slammed Mehta’s ruling as an act of “cowardice.” “You don’t find someone guilty of robbing a bank and then sentence him to writing a thank you note for the loot,” executive director Nidhi Hegde said in a statement. “Similarly, you don’t find Google liable for monopolization and then write a remedy that lets it protect its monopoly. This feckless remedy to the most storied case of monopolization of the past quarter century is a complete failure of his duty and must be appealed.”\nThe DOJ’s complaint was originally filed in 2020, before generative AI tools like OpenAI’s ChatGPT became available to the public. But by the time the remedies trial happened earlier this year, the role AI would play in the future of internet search became a necessary one for Mehta to grapple with. The government implored the judge to make sure the anticompetitive issues with Google’s search business don’t simply shape-shift into its AI offerings.\nGoogle’s empire has faced serious blows from multiple courts this year. In late July, a California appeals court upheld a jury verdict against the company in Epic Games’ lawsuit against its mobile app store monopoly. Earlier this year, a federal judge in Virginia found Google also illegally monopolized the market for some advertising technology tools it offers, and it will return to that court to argue potential remedies for that case in September. Google is still in the middle of these fights, but it’s looking more and more likely that the company’s current form will not last much longer.\nView Link",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe3ea0609a814b72cff681d5788c7defd3c9a0b2",
      "title": "Electric vehicle sales increase as federal tax credits for them come to an end",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650-e1/electric-vehicle-sales-increase-as-federal-tax-credits-for-them-come-to-an-end",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T20:52:12.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7f2bb8b23b878380bd0e4d29f64be437073fcf5b",
      "title": "Waymo expands to Denver and Seattle with its Zeekr-made vans",
      "url": "https://techcrunch.com/2025/09/02/waymo-expands-to-denver-and-seattle-with-its-zeekr-made-vans/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:48:09.000Z",
      "summary_90w": "",
      "raw": "Add another two cities to the growing list where Waymo is looking to deploy its robotaxis. The company will start with manual testing but is eyeing a commercial launch in both cities.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26c6c9f1fceb7746b5ccf887c3e09f63125372ec",
      "title": "Google avoids break up, but has to give up exclusive search deals in  antitrust trial",
      "url": "https://techcrunch.com/2025/09/02/google-avoids-break-up-faces-new-oversight-in-search-antitrust-trial/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:45:20.000Z",
      "summary_90w": "",
      "raw": "U.S. District Court Judge Amit P. Mehta outlined remedies on Tuesday that would bar Google from entering or maintaining exclusive deals that tie the distribution of Search, Chrome, Google Assistant, or Gemini to other apps or revenue arrangements.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a26107a3bda8ac62ac81d675007ef9c502047bb1",
      "title": "Military lawyers called up to relieve a shortfall in immigration judges",
      "url": "https://www.npr.org/2025/09/02/g-s1-86691/military-lawyers-immigration-judges-jag",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T20:33:37.000Z",
      "summary_90w": "",
      "raw": "The move comes after the Justice Department last week made changes to who could qualify as a temporary immigration judge —effectively lowering the requirements and removing the need to have prior immigration experience.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f005205d7b2bf2ec47fd8ffccf3142bcad7d0939",
      "title": "Silksong: all of the updates about the Hollow Knight sequel",
      "url": "https://www.theverge.com/news/769489/hollow-knight-silksong-news-updates",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T20:24:36.000Z",
      "summary_90w": "",
      "raw": "A screenshot from Hollow Knight: Silksong.\t\n\nAfter years of development and pent-up anticipation from fans, Hollow Knight: Silksong, the full sequel to the indie classic Hollow Knight, will finally be released on September 4th. It will cost $19.99 and include new zones, more than 200 enemies, over 40 bosses, and an orchestral score from the composer of the first game.\nSilksong was first announced in 2019, two years after the release of Hollow Knight, but developers Team Cherry have stayed pretty quiet about the sequel in the years since — even after a planned launch window was announced in 2022, which was followed by a delay months later. In an interview with Bloomberg, Team Cherry co-founders Ari Gibson and William Pellen said that the game was “never stuck”; instead, the small team working on Silksong was just taking its time.\nTeam Cherry announced Silksong‘s release date just two weeks ahead of the game’s launch. The game is launching on PC, Nintendo Switch, Xbox, and PlayStation.\nHere’s all of our coverage of Silksong.\n\n\n\t\t\t\t\t\nSilksong is only $19.99\n\t\t\t\nSilksong is out soon, and indie games are getting out of the way\n\t\t\t\nA Silksong September.\n\t\t\t\nSilksong finally launches in September\n\t\t\t\n“Silksong is real.”\n\t\t\t\nGet ready for Silksong’s ‘special announcement’ on Thursday\n\t\t\t\nReal Silksong news is imminent.\n\t\t\t\nSilksong will also be at Nintendo’s Gamescom booth.\n\t\t\t\nXbox will let you play Silksong at Gamescom in August\n\t\t\t\nSilksong spotted!\n\t\t\t\nHollow Knight: Silksong is launching in 2025\n\t\t\t\nTime to get your hopes up about a Silksong release date.\n\t\t\t\nIs the Silksong release date in the room with us right now?\n\t\t\t\nHollow Knight: Silksong has been delayed\n\t\t\t\nNo Silksong.\n\t\t\t\nSilksong when?\n\t\t\t\nHollow Knight: Silksong is coming to PlayStation, too\n\t\t\t\nHollow Knight: Silksong is coming to Xbox, and it will be out within the next year",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T20:13:30.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "060597fc354558c19ae50394ae87621f9045f7bd",
      "title": "OpenAI to route sensitive conversations to GPT-5, introduce parental controls",
      "url": "https://techcrunch.com/2025/09/02/openai-to-route-sensitive-conversations-to-gpt-5-introduce-parental-controls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:13:04.000Z",
      "summary_90w": "",
      "raw": "OpenAI said Tuesday it plans to route sensitive conversations to reasoning models like GPT-5 and roll out parental controls within the next month – part of an ongoing response to recent safety incidents involving ChatGPT failing to detect mental distress.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "874d8f638c530c94473380152c2f8818dc82aaf0",
      "title": "Trump says Space Command will move to Alabama, after long battle over its HQ",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525899/trump-space-force-command-alabama-colorado",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T20:09:54.000Z",
      "summary_90w": "",
      "raw": "President Trump announced he intends to move U.S. Space Command headquarters to Huntsville, Ala., after a protracted battle over whether it would stay in Colorado, as former President Joe Biden advocated.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9e374ae173080de07fc2f21060a516f8f80f70a",
      "title": "How the Democrats keep copying the MAGA influencer playbook (and failing)",
      "url": "https://www.theverge.com/regulator-newsletter/769232/democrats-chorus-influencer-program-regulator",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T20:00:02.000Z",
      "summary_90w": "",
      "raw": "Hello and welcome to Regulator. Today, I will attempt to regulate my own apoplexy.\n\nRecently, Wired published an article revealing the existence of a secret Democrat influencer incubator that trained liberal and progressive content creators to push coordinated messaging across their shared social media platforms and paid them handsomely to do so. The fallout has been chaotic, at least in the left-wing influencer world: creators are shanking their rivals for participating in the program, and the paid influencers are trying to defend themselves for taking the money. But the controversy around the Chorus Creator Incubator Program stems from the …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "364368d0c7fdddfffc65ebbf6ed7a407659e52b8",
      "title": "Judges side with Trump EPA over canceled Inflation Reduction Act grants to nonprofits",
      "url": "https://techcrunch.com/2025/09/02/judges-side-with-trump-epa-over-canceled-inflation-reduction-act-grants-to-nonprofits/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:53:50.000Z",
      "summary_90w": "",
      "raw": "An appellate court found that the Trump administration was within its rights to cancel billions of dollars in grants. The nonprofits that had their grants canceled are expected to appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "19c9d71fe33d74644215f33e9dcea203c275498e",
      "title": "Amazon launches Lens Live, an AI-powered shopping tool for use in the real world",
      "url": "https://techcrunch.com/2025/09/02/amazon-launches-lens-live-an-ai-powered-shopping-tool-for-use-in-the-real-world/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:42:23.000Z",
      "summary_90w": "",
      "raw": "Lens Live will not replace Amazon's existing visual search tool, Amazon Lens, which lets you take a picture, upload an image, or scan a barcode to discover products. Instead, it brings a real-time component to Amazon Lens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5408d8decba8751b9b8bb5e6702c9e5e6725d8b4",
      "title": "Trump addresses online health rumours in Oval Office",
      "url": "https://www.bbc.com/news/videos/c62724wdxzwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T19:30:43.000Z",
      "summary_90w": "",
      "raw": "In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5408d8decba8751b9b8bb5e6702c9e5e6725d8b4",
      "title": "Watch: Trump addresses online health rumours in Oval Office",
      "url": "https://www.bbc.com/news/videos/c62724wdxzwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T19:30:43.000Z",
      "summary_90w": "",
      "raw": "In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "214535bf158ba5b4b9fd1af6c5a859128f9293e7",
      "title": "Trump administration blocks groups from voter registration at naturalization events",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525875/trump-naturalization-voter-registration-uscis",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T19:16:29.000Z",
      "summary_90w": "",
      "raw": "Nongovernmental groups like the League of Women Voters are now barred from registering new voters at naturalization ceremonies, the U.S. Citizenship and Immigration Services has announced.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14b16917e684b02308b4e4087d9f22d5bbe0a805",
      "title": "Clegg accuses Vance of 'hypocrisy' over free speech criticism",
      "url": "https://www.bbc.com/news/articles/c2l7lg84780o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T19:12:03.000Z",
      "summary_90w": "",
      "raw": "Many senior right-wing US figures attack UK free speech laws while \"intimidating and bullying\" critics, Sir Nick says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d83ca70fc5399376184426b5ac11daa2f344a7",
      "title": "OpenAI acquires product testing startup Statsig and shakes up its leadership team",
      "url": "https://techcrunch.com/2025/09/02/openai-acquires-product-testing-startup-statsig-and-shakes-up-its-leadership-team/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:04:05.000Z",
      "summary_90w": "",
      "raw": "OpenAI is bringing on the founder of Statsig as its CTO of Applications, and making changes to other leadership roles at the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8029d4954875f1fd57dd6c192c3f7d58f57d721",
      "title": "Tick tock: Congress has 14 legislative days to stop a government shutdown",
      "url": "https://www.npr.org/2025/09/02/g-s1-86626/congress-return-shutdown-epstein",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T18:50:38.000Z",
      "summary_90w": "",
      "raw": "Congressional lawmakers return to D.C. with a massive September agenda, including efforts to avoid a government shutdown and a debate on whether to change the rules for confirming nominees.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7711054b51bf0367bbca9cf52c5dab71776daaf6",
      "title": "Afghan quake victims buried on mountain top as aftershocks continue",
      "url": "https://www.bbc.com/news/videos/cd9j9g5n92do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:46:09.000Z",
      "summary_90w": "",
      "raw": "The BBC's Yama Bariz travelled to a region devastated by the 6.0 magnitude earthquake.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871e468947017c14e79f6657c777c3af7e6b7830",
      "title": "Astro Teller, ‘Captain of Moonshots,’ joins TechCrunch Disrupt 2025 this October",
      "url": "https://techcrunch.com/2025/09/02/astro-teller-is-joining-us-at-techcrunch-disrupt-2025-in-october/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T18:44:48.000Z",
      "summary_90w": "",
      "raw": "TechCrunch is thrilled to announce that Astro Teller, the head of Alphabet’s X (aka the Moonshot Factory), will take the stage at TechCrunch Disrupt 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8c0eb25c3cf324b6eae79b70c6b25c5f979b68fe",
      "title": "Thousands of Israeli reservists report for duty ahead of Gaza City offensive",
      "url": "https://www.bbc.com/news/articles/cyvnv5lv4zpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:15:46.000Z",
      "summary_90w": "",
      "raw": "Ground forces are already pushing into the city, where hospitals say more than 50 people were killed by Israeli strikes on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c762575c02c0050e081f400ca742b4cdd720504",
      "title": "What do we know about Kim Jong Un's daughter - and potential successor?",
      "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:07.000Z",
      "summary_90w": "",
      "raw": "Kim Ju Ae's visit to China with her father is likely to further fuel speculation she may succeed him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bdd52b1720cf8f7b1156fda93a00dbd27bfe7f43",
      "title": "Trump's use of National Guard in Los Angeles was illegal, judge rules",
      "url": "https://www.bbc.com/news/articles/c5ylyd9lkkqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T17:48:32.000Z",
      "summary_90w": "",
      "raw": "The ruling comes as Trump seeks to use National Guard troops in order to crack down on crime in other US cities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40a3d29eca31a80068ccb02d3c0a0b95fb653582",
      "title": "Argentina couple under house arrest amid search for painting stolen by Nazis",
      "url": "https://www.theguardian.com/world/2025/sep/02/argentina-painting-nazis-house-arrest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:20:35.000Z",
      "summary_90w": "",
      "raw": "Daughter of former Nazi official and her husband to be questioned after raid on home failed to find masterpiece\nA federal court in Argentina has ordered house arrest for the daughter of a former Nazi official and her husband after a raid failed to locate a painting stolen from a Jewish art dealer in Amsterdam.\nAuthorities raided a home in the coastal city of Mar del Plata last week after a Dutch newspaper identified a painting seen in a real estate photo as an Italian masterpiece registered on a database of lost wartime art.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dea386d8cdddc41b883e3c81287e76feb67f6f5",
      "title": "Tesla’s 4th ‘Master Plan’ reads like LLM-generated nonsense",
      "url": "https://techcrunch.com/2025/09/02/teslas-4th-master-plan-reads-like-llm-generated-nonsense/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T17:18:12.000Z",
      "summary_90w": "",
      "raw": "Tesla's fourth \"Master Plan\" lacks an important building block of plans: specifics. Even Elon Musk agrees it was too generic.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcf4dbd954a035980cfa5cbf263e9a5ee454ed61",
      "title": "How rural hospitals are banding together to survive",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/02/nx-s1-5519257/rural-hospitals-independent-health-networks",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T17:11:16.000Z",
      "summary_90w": "",
      "raw": "Independent and rural hospitals are collaborating with their neighbors to shore up their finances instead of joining larger health systems to stay afloat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ccee5dd1b0e243054368010ece26c049d5a13e6",
      "title": "Outcry as Swedish ‘cultural canon’ snubs Abba and anything since 1975",
      "url": "https://www.theguardian.com/world/2025/sep/02/outcry-as-swedish-cultural-canon-snubs-abba-and-anything-since-1975",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:45:54.000Z",
      "summary_90w": "",
      "raw": "Critics argue ‘shared map’ of Swedish culture is ‘very exclusionary’ and a ‘nationalist education project’\nThe Gustav Vasa 1541 bible, Pippi Longstocking, Ikea, the right to roam, paternity leave, Sámi joiks, the Nobel prize and works by Ingmar Bergman and August Strindberg all made it into Sweden’s long-awaited, much-criticised proposal for a “cultural canon”.\nHowever, notable omissions from the list of 100 works and references that have formed Sweden’s culture and history – intended, its creators said in Uppsala on Tuesday, to establish a “shared map and compass” for Swedish citizens and new arrivals to Sweden – included Abba and anything from after 1975, a period that has seen Sweden transform into an international, multicultural society.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07715646549620450e4b081adaa0d3b069b4a69",
      "title": "Margaret Atwood releases short story critiquing book bans in Canada",
      "url": "https://www.theguardian.com/world/2025/sep/02/margaret-atwood-alberta-canada-book-ban",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:44:53.000Z",
      "summary_90w": "",
      "raw": "Author quipped she wrote ‘suitable’ piece after Alberta school ban included her novel The Handmaid’s Tale\nMargaret Atwood has released a new short story critiquing elected officials for a wide-ranging book ban in the Canadian province of Alberta. The controversial decision to remove books purportedly containing “explicit sexual content” has seen numerous works of literature swept up in the dragnet, including Atwood’s dystopian work The Handmaid’s Tale.\nIn a social media post, Atwood wrote that since her famed work was no longer permissible in Alberta schools, she had written a “suitable” short work for teens, adding the work was necessary because the province’s minister of education thought students were “stupid babies”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3261c1ce6e289d0c2c892a031887da26050e4df9",
      "title": "Tesla’s Dojo, a timeline",
      "url": "https://techcrunch.com/2025/09/02/teslas-dojo-a-timeline/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:39:01.000Z",
      "summary_90w": "",
      "raw": "Musk teased Dojo for years and ramped up discussions about the supercomputer throughout 2024. But Dojo is now out, and another supercomputer called Cortex has entered the chat.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2ea109f825065079513d3bc6892866ac98ffb56",
      "title": "Vogue promotes Chloe Malle to top editor spot",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525663/vogue-chloe-malle-anna-wintour",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T16:38:09.000Z",
      "summary_90w": "",
      "raw": "Malle takes over as the leader of American Vogue immediately. Malle, who has been with the publication since 2011, will still report to Anna Wintour who remains Condé Nast's chief content officer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "19d472e6b6f9866bc55467838678a9da55e96db0",
      "title": "Anthropic raises $13B Series F at $183B valuation",
      "url": "https://techcrunch.com/2025/09/02/anthropic-raises-13b-series-f-at-183b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:34:16.000Z",
      "summary_90w": "",
      "raw": "AI firm Anthropic's $13 billion Series F round will be used to grow its enterprise adoption, deepen safety research, and support international expansion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f142f2f1ec1e1b3ad2c32f4683177278c1e67425",
      "title": "WordPress shows off Telex, its experimental AI development tool",
      "url": "https://techcrunch.com/2025/09/02/wordpress-shows-off-telex-its-experimental-ai-development-tool/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:26:48.000Z",
      "summary_90w": "",
      "raw": "WordPress CEO Matt Mullenweg introduced the new WordPress AI tool, called Telex, at the company's WordCamp US 2025 conference in Portland last week, alongside other AI experiments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e97c95b340cc7d9d0ebced2db4b426d303c1ad7b",
      "title": "Tesla Dojo: The rise and fall of Elon Musk’s AI supercomputer",
      "url": "https://techcrunch.com/2025/09/02/tesla-dojo-the-rise-and-fall-of-elon-musks-ai-supercomputer/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:18:46.000Z",
      "summary_90w": "",
      "raw": "Dojo was going to be Tesla’s custom-built supercomputer. Here's what Elon Musk had in mind, what happened, and what's coming next.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d46869ae69d440200183c86e14c507c85ddb92b2",
      "title": "ICE reactivates contract with spyware maker Paragon",
      "url": "https://techcrunch.com/2025/09/02/ice-reactivates-contract-with-spyware-maker-paragon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:11:25.000Z",
      "summary_90w": "",
      "raw": "The Israeli spyware maker now faces the dilemma of whether to continue its relationship with U.S. Immigration and Customs Enforcement and help fuel its mass deportations program.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba854e3deded012457b724f56c45bc747a499de6",
      "title": "MrBeast reportedly plans to launch a phone company",
      "url": "https://techcrunch.com/2025/09/02/mrbeast-reportedly-plans-to-launch-a-phone-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:58:30.000Z",
      "summary_90w": "",
      "raw": "MrBeast, the 27-year-old popular YouTuber, plans to launch a phone company as he diversifies his brand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "ChatGPT to tell parents when their child is in 'acute distress'",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T15:35:38.000Z",
      "summary_90w": "",
      "raw": "It's one of a number of parental controls being introduced by OpenAI, which is being sued over the death of a teenager in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0ae0e1ce7630b5acd0f10dcc27910a2cdc730112",
      "title": "Five children in Gaza among those killed by Israeli strike while fetching water",
      "url": "https://www.theguardian.com/world/2025/sep/02/children-among-those-killed-in-gaza-while-fetching-water-by-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:32:50.000Z",
      "summary_90w": "",
      "raw": "Latest attack comes as Israel’s military urges people to leave Gaza City with 60,000 more reservists to be called up\nAt least nine people, including five children, have been killed in an Israeli strike while fetching water in al-Mawasi, an area of southern Gaza which Israel has designated as a safe zone, health officials said.\nA doctor from al-Nasser hospital shared a picture of the children’s bodies in the hospital, as well as a picture of water jugs left in a pool of blood at the site of the attack on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d203ebfab4aa685fce025a5c48b071284b5130",
      "title": "Instagram tests Picture-in-Picture viewing for reels",
      "url": "https://techcrunch.com/2025/09/02/instagram-tests-picture-in-picture-viewing-for-reels/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:31:11.000Z",
      "summary_90w": "",
      "raw": "The move comes as apps like TikTok and YouTube have had support for Picture-in-Picture for quite some time now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88909bf9a463d2ae9be300a55d52875cd23e2daf",
      "title": "Putin claims he never opposed EU membership for Ukraine but draws line at Nato – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:28:22.000Z",
      "summary_90w": "",
      "raw": "Russian leader, continuing China visit, is joined by Slovakia’s Robert Fico. This live blog is closed\nIn the meantime, we have had an update from Ukraine where a man accused of murdering a pro-western Ukrainian politician in the city of Lviv last weekend admitted that he carried out the killing but denied working for Russia, describing the attack as “personal revenge,” AFP reported.\n“This is my personal revenge on the Ukrainian authorities,” the suspect told reporters in a video published by Ukrainian media outlets, denying he worked directly with Russian special services.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "580ffe349db445b1879e290804a721aabe3351d4",
      "title": "My rent's gone up by almost 20% - and my landlord wants to evict me",
      "url": "https://www.bbc.com/news/articles/cjw6w32z07zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T15:17:09.000Z",
      "summary_90w": "",
      "raw": "Glasgow tenant Elle Glenny says the impact of a rent increase has been catastrophic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "529fb53dc0cb1d411612c1e3abb35c9f16a14c63",
      "title": "Klarna revives IPO plans, aims to raise $1.27B",
      "url": "https://techcrunch.com/2025/09/02/klarna-revives-ipo-plans-aims-to-raise-1-27b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:30:52.000Z",
      "summary_90w": "",
      "raw": "Swedish buy now, pay later (BNPL) startup Klarna and its shareholders are reviving its initial public offering, hoping to raise as much as $1.27 billion in a listing that would value the company at up to $14 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b7a8a37e3db8455f33980e1ecb1bc638c314a6",
      "title": "Just 4 days left to exhibit at TechCrunch Disrupt 2025 — 10 tables remain",
      "url": "https://techcrunch.com/2025/09/02/just-4-days-left-to-exhibit-at-techcrunch-disrupt-2025-10-tables-remain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The clock is ticking, and exhibit space at TechCrunch Disrupt 2025 is moving fast. With just 4 days and 10 table left to book, now’s the time to stop circling the idea and claim your spot on the show floor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2f7dbb58839b7d5f096d79cb02cf486220c06933",
      "title": "What's causing the UK's long-term borrowing costs to rise?",
      "url": "https://www.bbc.com/news/articles/clyry4rg9wyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:38:10.000Z",
      "summary_90w": "",
      "raw": "The cost of government borrowing has risen again - what does it mean for the public finances and upcoming Budget?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ccffc1fde4f9fb4d9308685761f164a52aa953d",
      "title": "Italy considers hiding state flight paths after jamming of von der Leyen plane",
      "url": "https://www.theguardian.com/world/2025/sep/02/italy-looks-at-hiding-state-flight-paths-after-jamming-of-von-der-leyen-plane",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T13:02:42.000Z",
      "summary_90w": "",
      "raw": "EU member states debate how to make leaders’ flights more secure as Russia blamed for GPS loss\nItaly is considering keeping state flights secret after the satellite signal of the aircraft carrying the European Commission president, Ursula von der Leyen, was allegedly jammed by Russia, Italian defence ministry sources said.\nVon der Leyen, a fierce critic of the Russian president, Vladimir Putin, and Moscow’s war in Ukraine, was flying to Bulgaria on Sunday when her charter plane lost satellite navigation aids, delaying its arrival in Plovdiv, and reportedly forcing it to circle an airport for an hour.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bb911816af7d9e9f92fae4f38df366e63d335ba",
      "title": "Germany's far-right AfD suffers series of candidate deaths ahead of local vote",
      "url": "https://www.bbc.com/news/articles/c5ykyewrerpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T12:12:54.000Z",
      "summary_90w": "",
      "raw": "Police say there is no evidence of foul play, ahead of local elections in western Germany.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "892bb402d5b33b30d9eb9ef0a20c157d80d0ca44",
      "title": "Jair Bolsonaro faces justice over alleged attempt to usurp Brazilian democracy",
      "url": "https://www.theguardian.com/world/2025/sep/02/jair-bolsonaro-faces-justice-over-alleged-attempt-to-usurp-brazilian-democracy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:12:38.000Z",
      "summary_90w": "",
      "raw": "Former president in court along with seven others accused of failed power grab after losing 2022 election\nBrazil’s former president Jair Bolsonaro and seven of his allies, including four senior members of the military, have gone on trial for allegedly attempting to stage a coup – the first time in Brazilian history such powerful figures have faced justice for seeking to topple the country’s democracy.\nBolsonaro, a paratrooper turned far-right populist who governed from 2019 until 2023, stands accused of masterminding a failed power grab after losing the 2022 election to the leftist Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24cd045a7276ab858581db6792ace812b83c0436",
      "title": "Kraft Heinz is splitting up, separating hot dogs from ketchup",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5464951/kraft-heinz-split-breakup",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T11:26:42.000Z",
      "summary_90w": "",
      "raw": "One of the world's largest food brands is splitting apart a decade after a messy megamerger staged by Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b016be77d542ad20842b37dd9878a0d42e93294c",
      "title": "Billy Bragg releases song in support of Palestine and Greta Thunberg aid flotilla",
      "url": "https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T10:40:02.000Z",
      "summary_90w": "",
      "raw": "Hundred Year Hunger – which has a chorus in Arabic – has been released by the British protest singer to coincide with a humanitarian aid flotilla heading for Gaza\nBilly Bragg has released a new original song to show his support for the people of Palestine. The title of Hundred Year Hunger was inspired by a new book of the same name by E Mark Windle about the history of chronic malnutrition and deprivation in Gaza and will raise money for the Amos Trust’s Gaza Appeal.\nWriting on Instagram, the British protest singer said that the song “looks at the current famine that Israel has created in Gaza through the lens of a century of enforced food insecurity and malnutrition imposed on the Palestinian people, firstly by British imperialism, then as a weapon of mass displacement by the state of Israel”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "412aa03368e77abdc17146130a428eacb10acfcf",
      "title": "Federal tax credits for electric vehicles are ending, leading to spike in sales",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650/federal-tax-credits-for-electric-vehicles-are-ending-leading-to-spike-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T08:59:57.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7789d37b5c798382871e02e48886c6dee9e86066",
      "title": "Beijing tightens control ahead of Xi's big moment on world stage",
      "url": "https://www.bbc.com/news/articles/cn020wrnw78o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T06:37:27.000Z",
      "summary_90w": "",
      "raw": "It is a big week for Xi Jinping, who will host Vladimir Putin and Kim Jong Un in Beijing at a massive military parade.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "513444dfa843e2ed963274b891736ebe8f13c954",
      "title": "BMW, I am so breaking up with you",
      "url": "https://techcrunch.com/2025/09/01/bmw-i-am-so-breaking-up-with-you/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T06:07:36.000Z",
      "summary_90w": "",
      "raw": "I’m driving my i4 back to the dealership as soon as my lease is over. I'm surprised to say I can't wait.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8173a2881ad5fc29a63310a224b2a0a4e43aa596",
      "title": "Indian grocery startup Citymall raises $47M to challenge ultra-fast delivery giants",
      "url": "https://techcrunch.com/2025/09/01/indian-grocery-startup-citymall-raises-47m-to-challenge-ultra-fast-delivery-giants/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T04:30:00.000Z",
      "summary_90w": "",
      "raw": "Citymall's funding comes at a time of a quick-commerce frenzy in the Indian market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bbd5ddade2f3b4c8ec87a973c5fd34539ccc944",
      "title": "Starter homes are scarce, so Utah set a target to build more. Here's how it's going",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5431545/starter-homes-utah-housing-cost-affordable-target",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T04:01:00.000Z",
      "summary_90w": "",
      "raw": "In one of the country's priciest housing markets, Utah's leaders worry young people are shut out from building wealth. But despite new incentives, few developers are signing on to build smaller homes.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c4629edf45809674f00a41f8fc05add6df351804",
      "title": "US and Indian VCs just formed a $1B+ alliance to fund India’s deep tech startups",
      "url": "https://techcrunch.com/2025/09/01/u-s-and-indian-vcs-just-formed-a-1b-alliance-to-fund-indias-deep-tech-startups/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T03:30:00.000Z",
      "summary_90w": "",
      "raw": "Eight U.S. and Indian VC and PE giants are teaming up to fuel India's deep tech boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0308b909a7a9283ddb8a81dcb7981f3e7e84a419",
      "title": "A North Korean defector on why Kim Jong Un has sent troops to Ukraine – podcast",
      "url": "https://www.theguardian.com/news/audio/2025/sep/02/north-korea-opportunity-ukraine-podcast",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T02:00:24.000Z",
      "summary_90w": "",
      "raw": "What does North Korea’s involvement in Ukraine mean for Kim Jong-un’s geopolitical ambitions? With Jean Lee\nWhen Hyun-Seung Lee was 17 he was conscripted into the North Korean army. Meals were basic and conditions were poor.\n“Most soldiers wash their clothes and bathe in streams or rivers … Soldiers must gather their own firewood from nearby mountains for heating and cooking,” he says.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a3e022afdd2256a34c3a6e280d1c8816a7b3554",
      "title": "Body seen in secret mortuary could solve 50-year mystery of vanished religious leader",
      "url": "https://www.bbc.com/news/articles/clyr1qr529xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T00:18:28.000Z",
      "summary_90w": "",
      "raw": "Compelling evidence to suggest Lebanese Shia leader Musa al-Sadr was killed in Libya is uncovered by BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0e6d0c8ef09900d8d54bd5f5af91eea6830e085",
      "title": "Watch: Buildings destroyed and rescue efforts under way after deadly Afghanistan earthquake",
      "url": "https://www.bbc.com/news/videos/cqxgx8d14wwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:29:23.000Z",
      "summary_90w": "",
      "raw": "At least 800 people have been killed and thousands injured in the east of the country after a 6.0 magnitude earthquake struck on Sunday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68105a770ce0bbb71d9718bdd33c6fe1ec26154f",
      "title": "How the death of a delivery driver ignited Indonesia",
      "url": "https://www.bbc.com/news/articles/c2dj9w306wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:08:13.000Z",
      "summary_90w": "",
      "raw": "Protests over corruption and inequality have spiralled into violence, arson and deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89d4226069d5468002f6233efedff9644e32bfd9",
      "title": "Leaked ‘Gaza Riviera’ plan dismissed as ‘insane’ attempt to cover ethnic cleansing",
      "url": "https://www.theguardian.com/world/2025/sep/01/leaked-gaza-riviera-plan-dismissed-as-insane-attempt-to-cover-ethnic-cleansing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T17:08:16.000Z",
      "summary_90w": "",
      "raw": "Prospectus proposes forced displacement of entire population and puts territory into US trusteeship\nA plan circulating in the White House to develop the “Gaza Riviera” as a string of high-tech megacities has been dismissed as an “insane” attempt to provide cover for the large-scale ethnic cleansing of the Palestinian territory’s population.\nOn Sunday the Washington Post published a leaked prospectus for the plan, which would involve the forced displacement of Gaza’s entire population of 2 million people and put the territory into a US trusteeship for at least a decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7fbb69296862962575dedc4b2b68fb610fef448e",
      "title": "Israel committing genocide in Gaza, world’s top scholars on the crime say",
      "url": "https://www.theguardian.com/world/2025/sep/01/israel-committing-genocide-in-gaza-worlds-top-scholars-on-the-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T12:06:16.000Z",
      "summary_90w": "",
      "raw": "International Association of Genocide Scholars resolution backed by 86% of members who voted\nThe world’s leading genocide scholars’ association has backed a resolution stating that Israel’s actions in Gaza meet the legal definition of the crime.\nOut of the International Association of Genocide Scholars’s (IAGS) 500 members, 28% took part in the vote. Of those who voted, 86% supported the resolution. The resolution states that “Israel’s policies and actions in Gaza meet the legal definition of genocide in article II of the United Nations convention for the prevention and punishment of the crime of genocide (1948).”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b922ff820e9ad58307010f6072b7e31bb43110a",
      "title": "How Trump is decimating federal employee unions one step at a time",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5515633/trump-federal-workers-labor-unions-va",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump has ended collective bargaining rights for more than one million federal workers. Unions have sued to block the move, but agencies are terminating contracts as litigation continues.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "25420189fc3ebb65efbc241c35d6fdee0cf226b0",
      "title": "Korean skincare industry expected to be hit hard by end of 'de minimus' exemption",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5519724/korean-skincare-industry-expected-to-be-hit-hard-by-end-of-de-minimus-exemption",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T08:56:33.000Z",
      "summary_90w": "",
      "raw": "On Friday, the \"de minimis\" exemption ended -- meaning that imports worth $800 or less won't be able to enter the country tax-free. One of the industries bracing for the impacts is Korean skincare.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cfedc51d287bfd56cf87870ed940b50af617bf9f",
      "title": "Spirit Airlines files for bankruptcy for 2nd time in less than a year",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5522901/spirit-airlines-bankruptcy-filing",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T12:26:13.000Z",
      "summary_90w": "",
      "raw": "The budget carrier filed for fresh bankruptcy protection months after emerging from a Chapter 11 reorganization. The airline said it plans to keep flying as usual during the restructuring process.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37aa811eccb417ff986e00dff34d9c6a9bedb670",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "url": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:00:25.000Z",
      "summary_90w": "",
      "raw": "Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing\nMalawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.\nIt comes just months after the World Health Organization (WHO) revealed that the country had successfully reduced tuberculosis (TB) cases by 40% over the past decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    }
  ]
}