{
  "version": "1755450819662",
  "generatedAt": "2025-08-17T17:13:39.662Z",
  "items": [
    {
      "id": "07b445106c16eeaba0b4d2a020412060227ef470",
      "title": "'A major asset for us' - Ramsey completes Newcastle move",
      "url": "https://www.bbc.com/sport/football/articles/cvg0renye2po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T16:51:37.000Z",
      "summary_90w": "",
      "raw": "Newcastle United sign midfielder Jacob Ramsey from Aston Villa for £40m.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3250e4e3bf2289e525ea27276ca9ab887bc4627a",
      "title": "Actor Terence Stamp, who starred as Superman villain, dies aged 87",
      "url": "https://www.bbc.com/news/articles/c39d41g7nmlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T16:51:29.000Z",
      "summary_90w": "",
      "raw": "The Oscar-nominated actor shot to fame in the 1960s, going on to star in numerous films across a six decade career.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a4568a744714ee0a34e6d59b6c136b4e2f64f3f",
      "title": "Zelenskyy says territorial swaps not possible under Ukrainian constitution ahead of White House meeting – live",
      "url": "https://www.theguardian.com/world/live/2025/aug/17/trump-putin-meeting-european-leaders-ukraine-peace-deal-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T16:45:50.000Z",
      "summary_90w": "",
      "raw": "Steve Witkoff says Russian president agreed to allow US and European allies to offer Ukraine security guarantee and also unspecified concessions on five Ukrainian regions\nGermany’s chancellor, Friedrich Merz, will also be travelling to Washington tomorrow for the Trump-Zelenskyy talks, according to the federal government.\nThe chancellor’s spokesperson has been quoted by BBC News as having said:\nThe trip will serve as an exchange of information with US President Donald Trump following his meeting with Russian President Vladimir Putin in Alaska.\nChancellor Merz will discuss the status of peace efforts with the heads of state and government and underscore Germany’s interest in a swift peace agreement in Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8365a249eb71560c66dbbefca9bef8ec56c18885",
      "title": "Baker marks England call-up with Hundred hat-trick",
      "url": "https://www.bbc.com/sport/cricket/articles/czjmg3drx42o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T16:36:37.000Z",
      "summary_90w": "",
      "raw": "Sonny Baker marks his first England call-up with a hat-trick as Manchester Originals boost their men's Hundred hopes by beating rivals Northern Superchargers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c6e22451d6d638ed877210974dd8456734dc511",
      "title": "‘Pray for rain’: wildfires in Canada are now burning where they never used to",
      "url": "https://www.theguardian.com/world/2025/aug/17/new-canada-wildfires-locations",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T16:35:48.000Z",
      "summary_90w": "",
      "raw": "Canada’s response to the extreme weather threat is being upended as the traditional epicentre of the blazes shifts as the climate warms\nRoad closures, evacuations, travel chaos and stern warnings from officials have become fixtures of Canada’s wildfire season. But as the country goes through its second-worst burn on record, the blazes come with a twist: few are coming from the western provinces, the traditional centre of destruction.\nInstead, the worst of the fires have been concentrated in the prairie provinces and the Atlantic region, with bone-dry conditions upending how Canada responds to a threat that is only likely to grow as the climate warms.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3326df8a17ecf3ab16dc143e3fbfbb062e9d2280",
      "title": "After meeting Putin, Trump changes his position on the need for a ceasefire",
      "url": "https://www.npr.org/2025/08/17/g-s1-83183/putin-trump-ceasefire",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T16:35:13.000Z",
      "summary_90w": "",
      "raw": "When President Trump was flying to Alaska to meet Vladimir Putin, he said the goal was a ceasefire. But after they talked, Trump aligned himself with Putin and downplayed the need for a truce.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d11f61a8e8631d24674373ed39af1b1858dff2e",
      "title": "Duolingo CEO says controversial AI memo was misunderstood",
      "url": "https://techcrunch.com/2025/08/17/duolingo-ceo-says-controversial-ai-memo-was-misunderstood/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-17T16:34:17.000Z",
      "summary_90w": "",
      "raw": "While Duolingo CEO Luis von Ahn faced backlash after declaring that Duolingo would become an “AI-first company,” he suggested in a new interview the real issue was that he “did not give enough context.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95d89baa600e281819f9f650484656e7a8be8416",
      "title": "Ukrainian politicians condemn idea of ceding territory to Russia",
      "url": "https://www.theguardian.com/world/2025/aug/17/ukrainian-politicians-condemn-idea-of-ceding-territory-to-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T16:30:55.000Z",
      "summary_90w": "",
      "raw": "Mood hardens in Kyiv after Trump-Putin summit as lawmakers argue country must not be forced to surrender\nA string of Ukrainian politicians and public figures condemned the idea of handing over unoccupied land to Russia for peace on Sunday, arguing that their country had not been defeated and should not be forced into a surrender.\nThe hardening of the mood comes at the end of a weekend where there was first ridicule and disgust in Ukraine at the red carpet treatment of Vladimir Putin by Donald Trump at their summit in Alaska – followed by frustration as it appeared that Trump was siding with the Russian leader.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "729670f7576f8b9d6b1baa41db5ebab0393b0e3f",
      "title": "Ex-Israeli intelligence chief said 50 Palestinians must die for every 7 October victim",
      "url": "https://www.theguardian.com/world/2025/aug/17/israeli-general-aharon-haliva-palestinians-7-october-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T16:26:18.000Z",
      "summary_90w": "",
      "raw": "‘It does not matter if they are children,’ said Aharon Haliva in recorded comments calling the death toll ‘necessary’\nThe Israeli general who headed military intelligence on 7 October 2023 has said 50 Palestinians must die for every person killed that day and “it does not matter now if they are children”, in recordings broadcast by Israel’s Channel 12 TV station.\nAharon Haliva said the toll in Gaza, which he put at more than 50,000 dead, was “necessary” as a “message to future generations” of Palestinians.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c3cdcbb4318237ead765e1e6544fb9c914cde7b",
      "title": "Israeli plan to displace 1 million Palestinians spreads fear in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/17/israeli-plan-to-displace-1m-palestinians-spreads-fear-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T16:15:33.000Z",
      "summary_90w": "",
      "raw": "Population devastated by repeated displacement, hunger and lack of medical supplies braces for further humanitarian disaster \nPalestinians were gripped by fear and anxiety on Sunday after the Israeli military said it was preparing for the forcible displacement of 1 million people from Gaza City.\nThe announcement came days after Israel said it intended to launch a new offensive to seize control of the territory’s largest urban centre, in a plan that raised international alarm, and ahead of the IDF’s latest attacks in the Palestinian territory which Gaza’s health officials said had killed at least 40 people on Saturday including a baby in a tent and people seeking aid.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3b058cbf8053b15ef5674ad9d2e2650fbb46ec35",
      "title": "Rubio says both Russia and Ukraine ‘have to make concessions’ for peace deal",
      "url": "https://www.theguardian.com/us-news/2025/aug/17/rubio-trump-putin-russia-ukraine-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T15:45:49.000Z",
      "summary_90w": "",
      "raw": "US secretary of state says talks between Putin and Trump had ‘made progress’ but ‘big areas of disagreement’ remain\nIn a combative series of interviews on Sunday, the US secretary of state, Marco Rubio, said that “both sides are going to have to make concessions” for there to be a peaceful resolution to the war that erupted when Russia invaded Ukraine in 2022.\n“You can’t have a peace agreement unless both sides make concessions – that’s a fact,” the Trump administration’s top diplomat said Sunday on ABC’s This Week. “That’s true in virtually any negotiation. If not, it’s just called surrender. And neither side is going to surrender. So both sides are going to have to make concessions.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ebab0a5e335ef1ccbb10959879418e6942ac095c",
      "title": "Terence Stamp: 1960s icon who was the 'master of the brooding silence'",
      "url": "https://www.bbc.com/news/articles/cnkk4e8xqjwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T15:23:31.000Z",
      "summary_90w": "",
      "raw": "Stamp, the dashing 60s acting icon who re-emerged as a fine character actor, has died aged 87.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0fdfaaf6f3db211dd1b104f28f121b0f14ef3c64",
      "title": "Malnourished Gazan woman flown to Italy dies in hospital",
      "url": "https://www.bbc.com/news/articles/ce87n455dvxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T15:23:12.000Z",
      "summary_90w": "",
      "raw": "The woman was one of 180 Gazans evacuated by Italy in response to the humanitarian crisis",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c37c54ddd4cabdd2b1d0376fafe63cd279281fc",
      "title": "One neurosurgeon, 8 million patients",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/17/g-s1-82000/neurosurgeon-neurosurgery-sierra-leone",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T15:14:23.000Z",
      "summary_90w": "",
      "raw": "Alieu Kamara is the first and only neurosurgeon in Sierra Leone. \"Before Dr. Kamara, there was no hope,\" said professor Kehinde Oluwadiya of the University of Sierra Leone Teaching Hospital Complex.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a46c68dfb97547a8318c2c9e40b02820d4d0110",
      "title": "Boy, 2, dies after car hits pedestrians",
      "url": "https://www.bbc.com/news/articles/ckgylnwj79eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T15:10:44.000Z",
      "summary_90w": "",
      "raw": "A man in his 20s is arrested on suspicion of causing death by dangerous driving, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a479490a8619c437022c2b21edd5aebb08ebfbad",
      "title": "Air Canada flight attendants to defy back-to-work order and remain on strike",
      "url": "https://www.theguardian.com/world/2025/aug/17/government-orders-striking-air-canada-flight-attendants-return-work",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T15:06:13.000Z",
      "summary_90w": "",
      "raw": "Union to challenge order issued less than 12 hours after start of action that has left more than 100,000 travellers stranded\nAir Canada’s flight attendants plan to remain on strike, their union has said, defying government efforts to force them back to work and into binding arbitration over a dispute that has left more than 100,000 travellers stranded around the world during the peak summer travel season.\nAbout 10,000 flight attendants who work for Canada’s largest airline walked out on the job early on Saturday amid a bitter dispute over what the union has described as “poverty wages” and unpaid labour.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df78bfafde885cba5e9f9d5e9aedd7f1267ee638",
      "title": "Bolivians go to polls in election that could end 20 years of leftist rule",
      "url": "https://www.theguardian.com/world/2025/aug/17/bolivians-go-to-polls-in-election-that-could-end-20-years-of-socialism",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T15:02:45.000Z",
      "summary_90w": "",
      "raw": "Rightwing candidates lead polling ahead of fragmented left amid country’s worst economic crisis in four decades\nBolivians are going to the polls in an election that could mark a shift to the right and the end of nearly 20 years of rule by the leftist Movimiento al Socialismo (Mas).\nThe party, which came to power with the first election of Evo Morales in 2005, risks losing its legal status if it fails to reach 3% of the vote – a threshold it has not hit in polls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d1d57c0db7a38326194e3ca76f0933b165689f89",
      "title": "Young Australians may endure worse lives than their parents, ‘worried’ productivity chief warns",
      "url": "https://www.theguardian.com/australia-news/2025/aug/18/young-australians-may-endure-worse-lives-than-parents-danielle-wood-productivity-commission-chair-warns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T15:00:36.000Z",
      "summary_90w": "",
      "raw": "Productivity Commission chair urges ‘growth mindset’ to solve looming problems for future generations ahead of economic summit, while reiterating call to limit AI regulation\n\nGet our breaking news email, free app or daily news podcast\n\nYoung Australians may endure worse lives than their parents, the nation’s productivity chief has warned.\nDanielle Wood, chair of the productivity commission, said young people are facing a future of lower wages, increased costs and the impacts of climate breakdown without major government action to tackle major economic challenges.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "85ad47c98f0dcf9a34cb2f91737ccdf23634c1fe",
      "title": "Northern Beaches hospital agrees settlement after claims newborn left with lifelong disabilities",
      "url": "https://www.theguardian.com/australia-news/2025/aug/18/northern-beaches-hospital-agrees-settlement-after-claims-newborn-left-with-lifelong-disabilities-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T15:00:34.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Child was born via emergency caesarean at 25 weeks after mother says hospital initially failed to diagnose her appendicitis, court documents show\n\nGet our breaking news email, free app or daily news podcast\n\nSydney’s Northern Beaches hospital has settled outside court with a family after claims their baby was born by emergency caesarean at 25 weeks and left with lifelong disabilities.\nCourt documents seen by Guardian Australia reveal the baby’s mother presented to the hospital’s birthing unit in 2022, complaining of lower abdominal pain on her right side. The woman – who cannot be named for legal reasons – says she was sent home without being given an ultrasound or undergoing any further investigation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2155de4f8f4c303b883fb4839bcaac7b3acaf47c",
      "title": "European leaders including Starmer to join Zelenskyy in Washington for meeting with Trump",
      "url": "https://www.theguardian.com/world/2025/aug/17/european-leaders-to-join-zelenskyy-washington-meeting-trump-ukraine-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T14:12:12.000Z",
      "summary_90w": "",
      "raw": "Emmanuel Macron, Friedrich Merz and others will aim to push back against ceding of Ukraine territory in ‘peace plan’\n\nUkraine war live – latest updates\n\nEuropean leaders including Britain’s Keir Starmer will join Ukraine’s president, Volodymyr Zelenskyy, at a White House meeting on Monday with Donald Trump, in a coordinated effort to push back on a US-endorsed “peace plan” that would allow Russia to take further Ukrainian territory.\nThe UK prime minister, the French president, Emmanuel Macron, Germany’s chancellor, Friedrich Merz, the European Commission president, Ursula von der Leyen, the Finnish president, Alexander Stubb, and Italy’s prime minister, Giorgia Meloni, will all accompany Zelenskyy in the Oval Office.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5257f0fcf733e549b07d4b986edf9d75fee5229e",
      "title": "Little-known rule that meant Eze goal was disallowed",
      "url": "https://www.bbc.com/sport/articles/c9d0v5xq21yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T14:06:13.000Z",
      "summary_90w": "",
      "raw": "Crystal Palace midfielder Eberechi Eze thought he had given his side the lead with a well struck free-kick within the opening 15 minutes at Stamford Bridge.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9326b201a36f2c237d8519a0cb72cc4fca510592",
      "title": "Novelist Sally Rooney says she will support Palestine Action despite ban",
      "url": "https://www.bbc.com/news/articles/cp94jz0y7ygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T14:06:00.000Z",
      "summary_90w": "",
      "raw": "The Irish novelist says \"if this makes me a supporter of terror under UK law, so be it\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8bab4e01e61bca51ca637262d58a1b28b9e54cc6",
      "title": "Keir Starmer hopes to exploit curious relationship with Trump in Ukraine talks",
      "url": "https://www.theguardian.com/politics/2025/aug/17/keir-starmer-curious-relationship-trump-ukraine-talks-zelenskyy-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T13:46:26.000Z",
      "summary_90w": "",
      "raw": "PM has positioned himself as someone who can get along with US president while stressing Europe’s red lines\n\nUkraine war live – latest updates\n\nAsked behind the scenes at June’s G7 summit if he could explain why Donald Trump seemed to like him so much, Keir Starmer admitted he did not really know. Whatever the reason, when it comes to Ukraine, the UK prime minister is once again hoping to exploit this somewhat curious relationship.\nAs soon as it was announced that a string of European leaders planned to join Volodymyr Zelenskyy to back the Ukrainian president in crucial talks with Trump at the White House on Monday, it was obvious Starmer would be joining them.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dce1283ba50d015a79d27c8724876b48458356a7",
      "title": "Hurricane Erin grows in size as it barrels towards Caribbean",
      "url": "https://www.bbc.com/news/articles/cdxyezqx4r5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T13:39:29.000Z",
      "summary_90w": "",
      "raw": "The \"extremely powerful\" storm is downgraded in intensity but could still bring life-threatening effects.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef90686c9acbeff88433c1ac2feeb9e4bf52edbe",
      "title": "Sudan army torturing people to death, says rights group",
      "url": "https://www.bbc.com/news/articles/cy4dqp8eeedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T13:20:38.000Z",
      "summary_90w": "",
      "raw": "Emergency Lawyers group alleges the army is operating \"execution chambers\" in the capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09367fac2d95ed90b7b0e66b6436b7c100cb3bed",
      "title": "European leaders to join Zelensky at White House meeting with Trump",
      "url": "https://www.bbc.com/news/articles/crm4ln2ekg1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T13:07:22.000Z",
      "summary_90w": "",
      "raw": "British PM Sir Keir Starmer will be among those joining the Ukrainian leader on the US trip.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "22393fa4ac84593c06252baa2e13c8c0efca14c2",
      "title": "Hurricane Erin downgraded to Category 3 storm",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5505324/hurricane-erin-downgraded",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T12:39:42.000Z",
      "summary_90w": "",
      "raw": "Heavy rain is still expected across the Virgin Islands and Puerto Rico, with rainfall of up to 8 inches in some areas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a26f7badf083700a90a940b5f6080284ef5ebf5",
      "title": "Why the former editor of Polygon is making a podcast for old gamers",
      "url": "https://www.theverge.com/games/760244/chris-plante-post-games-podcast-old-gamers-polygon",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-17T12:30:00.000Z",
      "summary_90w": "",
      "raw": "In a recent episode of Post Games, host Chris Plante explores how video games can help players understand death. He's interviewing Kaitlin Tremblay, who is working on Ambrosia Sky, a game about death.\n\"What is it about games that is so useful for exploring the topic?\" Plante asks.\n\"I think there's something really lovely about the way in which games invite players in,\" Tremblay says. There is \"something quite lovely about asking a person to cooperate and to be a part of the story, and to move through the space.\"\nIt's a tone, and a substance of conversation, unlike any I've heard on a gaming podcast before. And it underscores what's so uni …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e707dee8099ac2c40e5dd921e2995d58cb4ad366",
      "title": "European leaders to join Ukraine's Zelenskyy for White House meeting with Trump",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5505319/european-leaders-zelenskyy-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T12:26:28.000Z",
      "summary_90w": "",
      "raw": "European Commission President Ursula von der Leyen and NATO Secretary-General Mark Rutte are among those expected to attend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b66f4e6b33091ae0ff5ff2a98c2b567008db1db5",
      "title": "Hollywood stuntman set on fire for Pink Floyd cover dies aged 88",
      "url": "https://www.bbc.com/news/articles/c05e0z9lj3mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T12:25:31.000Z",
      "summary_90w": "",
      "raw": "Ronnie Rondell Jr's decades-long career saw him appear in films and TV including Baywatch, Spartacus and The Matrix Reloaded.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc0f7ca2a93035e9e8dea8d37f08a3a8dd4009e8",
      "title": "Israeli media ‘completely ignored’ Gaza starvation – is that finally changing?",
      "url": "https://www.theguardian.com/world/2025/aug/17/israeli-media-completely-ignored-gaza-starvation-is-that-finally-changing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T12:25:20.000Z",
      "summary_90w": "",
      "raw": "A growing focus on hunger in Gaza in the global media has led some Israeli outlets to report on it for the first time\nImages of Palestinian children in Gaza, emaciated by hunger under the blockade imposed by Israel, and of families grieving the more than 61,000 people killed in the territory have stirred outrage among foreign governments and much of the global public. Inside Israel, however, the reaction has been markedly different.\nIn a poll conducted in late July by the Israel Democracy Institute (IDI), more than three-quarters of Jewish Israelis – 79% – said they were either “not very troubled” or “not troubled at all” by reports of famine and suffering among Gaza’s Palestinian population.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c322ee82bd72be58d886595996297fe09fdcca06",
      "title": "Teenage Engineering did it again",
      "url": "https://www.theverge.com/installer-newsletter/760232/teenage-engineering-pc-case-fairphone-cables-charger-alien-earth-installer",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-17T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Hi, friends! Welcome to Installer No. 94, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, did you hydrate today, and also you can read all the old editions at the Installer homepage.) \nThis week, I'm visiting LinkedIn way too much because of Mini Sudoku, looking at the fake texts in Apple's marketing materials, marveling at tiny doodles on microchips, listening to Taylor Swift's New Heights podcast episode, learning about model railroad power debates, reading about the death of expertise, catching up on my favorite HGTV home renovation show, and watching a very good drumline.\nI also have for you some …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6167b059a933fb08b7d8ed431298bd2158987a9c",
      "title": "The one feature that keeps me from recommending flip phones",
      "url": "https://www.theverge.com/the-stepback-newsletter/760031/foldables-flip-phones-flaw",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-17T12:00:00.000Z",
      "summary_90w": "",
      "raw": "How it started\nI carry a lot of different phones around, and I rarely get questions about them because most people stopped talking about which phone they own around 2017. I could be using an unreleased iPhone 18 Pro Max Air Ultra to pay for my coffee and nobody would raise an eyebrow (present company excepted, of course). To the majority, a phone is a phone; no matter who makes it or what software it runs, they're all roughly the same size and shape. Unless that phone happens to be a flip phone. \nFlip phones attract attention from the kind of people who have seen every type of phone in existence, which makes sense: they're very obviously d …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8a929ff87ddecc47aee2a456da0eeeac1a7f764",
      "title": "Air Canada flights to resume after union told to end strike ",
      "url": "https://www.bbc.com/news/articles/cwyex8489gno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T11:44:35.000Z",
      "summary_90w": "",
      "raw": "Canada's jobs minister intervenes in the dispute in a bid to preserve \"stability and supply chains\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64e4896685aa3bcdf289e4405a05f0ff6b8885c4",
      "title": "Derelict fortress transformed into £3m party island ",
      "url": "https://www.bbc.com/news/articles/crm4er70410o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T11:27:30.000Z",
      "summary_90w": "",
      "raw": "Mike Conner hopes the island's next owner will make the most of it to bring more tourists to Wales.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d191fbff31ef74e1d13b123283e3cf04aa73f7c",
      "title": "More than 200 missing in flood-hit district in Pakistan, official says",
      "url": "https://www.bbc.com/news/articles/c8jp3y04jeyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T10:54:08.000Z",
      "summary_90w": "",
      "raw": "Hundreds are reported missing in Khyber Pakhtunkhwa province as a result of devastating floods.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "807bd645fda9b5490592c65face21d8fe3fa4df8",
      "title": "Thousands cross Channel in small boats since new migrant deal with France",
      "url": "https://www.bbc.com/news/articles/cgln6wzd585o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T10:38:14.000Z",
      "summary_90w": "",
      "raw": "More than 2,500 people have crossed the English Channel in the 11 days since the \"one in, one out\" migrant scheme took effect, Home Office figures show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8652adb651a7eb0668e8d9039ec58d317b00e0cb",
      "title": "Watch: Plane makes emergency landing on Australian golf course",
      "url": "https://www.bbc.com/news/videos/cp892124ndqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T10:37:55.000Z",
      "summary_90w": "",
      "raw": "Video shows the aircraft flying over the golf course before crash landing, as the pilot and passenger escaped without major injuries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "304d6ee1d5b04aea5df2df87bb2e56240dbe22a0",
      "title": "Washington's hydropower has created a data center boom. Some are concerned about its future.",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5501579/washington-hydropower-data-center-boom-sustainability-climate-change",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T09:00:59.000Z",
      "summary_90w": "",
      "raw": "In small town Washington — where hydropower is plentiful — data centers are creating jobs and funding amenities. But water and energy aren't unlimited — and some worry about long-term sustainability.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f152050e7f37e6e36fd2521b6619b11cad62e74",
      "title": "Palestinians flee IDF attacks on Gaza City as Israelis protest against occupation plan",
      "url": "https://www.bbc.com/news/articles/c2018wx3zlgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T08:57:49.000Z",
      "summary_90w": "",
      "raw": "Israeli bombardment has created a \"catastrophic\" situation in the city's Zeitoun neighbourhood, the city's Hamas-run authority says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a8077a3054af9f0dc7401a1adc5415297feaf55",
      "title": "All Blacks beat Pumas to return to top of world rankings",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cgkr8y81dnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-17T07:39:13.000Z",
      "summary_90w": "",
      "raw": "New Zealand hold off a second-half fightback to beat Argentina 41-24 in their Rugby Championship opener and return to the top of the world rankings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "613cd0ed75041ea52ffd9acfd164d889ae44f73f",
      "title": "Three Republican-led states to send hundreds of National Guard troops to Washington",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5505271/three-republican-led-states-to-send-hundreds-of-national-guard-troops-to-washington",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T07:34:37.000Z",
      "summary_90w": "",
      "raw": "West Virginia said it was deploying 300 to 400 Guard troops, while South Carolina pledged 200 and Ohio says it will send 150 in the coming days, marking a significant escalation of the federal intervention.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c855914f96c502c5750157b07e20e61ccb8d850",
      "title": "Cost of Victoria’s renewable energy transmission plan projected to double",
      "url": "https://www.theguardian.com/australia-news/2025/aug/17/cost-victoria-expanded-renewable-energy-transmission-plan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T06:37:27.000Z",
      "summary_90w": "",
      "raw": "Higher energy bills to cover the increased transmission costs could be offset by more renewable energy in the grid, state government says\n\nGet our breaking news email, free app or daily news podcast\n\nOne of Australia’s largest renewable energy transmission projects has expanded zones for solar, battery and wind developments with the cost of connection to almost double.\nThe latest version of Victoria’s 2025 Transmission Plan, released by state government agency VicGrid on Sunday, revealed a 200,000-hectare increase in the area available to developers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6790fddadb4ca0b8620bf3fe526f9799d9b706b1",
      "title": "PM deflects question about literal red carpet for Putin and says Trump ‘an advocate for peace’ in Ukraine – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/17/australia-news-live-federal-politics-net-zero-victoria-protests-nsw-weather-sunday-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T05:00:22.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\nTim Wilson sidesteps question about whether Coalition will dump support for net zero\nFinally, Wilson was asked about internal pressure within the Coalition to abandon support for any policies that might help Australia achieve net zero and to address the climate crisis.\nWe should make sure that we have net zero outages, net zero price increases, and net zero emissions, because you need to have things in a position of balance of policy to make sure that we can grow the future of the Australian economy, because that’s also the basis of social licence to cut emissions as well. If you don’t have net zero outages and net zero price increases, public support for net zero emissions reduction is also going to fray.\nI’m going to work with my colleagues to make sure we drive them forward as part of a policy package to take to the next election. I’m absolutely committed to making sure we have simplification, to make it easier to employ more Australians, and to raise standards of living, and improve the number of Australians [getting jobs] and well-paid jobs.\nWe’ve got big challenges coming ahead around [things] like artificial intelligence and making sure we make workplaces more productive, but also building out the capacity for small businesses to be successful as part of a dynamic economy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b55cd0ee4728a3d3bbdee2a4f1e3403496b86e4",
      "title": "Tasmanian salmon farming expansion on hold as state Liberals order review ahead of parliament showdown",
      "url": "https://www.theguardian.com/australia-news/2025/aug/17/tasmanian-salmon-farming-expansion-on-hold-liberal-party-jeremy-rockcliff",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-17T04:12:53.000Z",
      "summary_90w": "",
      "raw": "Premier Jeremy Rockliff attempts to win support from crossbench MPs and survive no-confidence motion when state parliament returns this week\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Tasmanian Liberal party has promised a pause on salmon farm expansion and an independent review of the industry as it attempts to win support from crossbench MPs and survive a no-confidence motion in the state parliament this week.\nIn a concession to independent MPs critical of the operation of salmon farms in public waterways, the premier, Jeremy Rockliff, on Sunday said he supported the industry but that it was “on notice” after a mass mortality event last summer, and it must “operate transparently and responsibly and meet its obligations to the community”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d21f1b0575def995feaac78f7bd38d3b34a3383",
      "title": "Serbia ruling party offices set on fire in protests",
      "url": "https://www.bbc.com/news/articles/c9qye9qvxn5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T02:12:35.000Z",
      "summary_90w": "",
      "raw": "Russia throws support behind the beleaguered president, saying it won't \"remain unresponsive\" to unrest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2071b07c93cbdb2e6782b8fd6cdb59925a4d7fe2",
      "title": "Protesters target Serbian ruling party offices in fifth night of demonstrations",
      "url": "https://www.bbc.com/news/videos/c3wn7v0gxy4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T01:56:59.000Z",
      "summary_90w": "",
      "raw": "Offices belonging to President Aleksander Vučić's political party were vandalised during the fifth consecutive night of unrest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af6a84d7ee53056194bf649c4a9db7e5de3ef7c7",
      "title": "Hundreds march to White House to protest Trump's D.C. crackdown",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5504861/trump-dc-protest-federal-takeover-white-house",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-17T01:03:01.000Z",
      "summary_90w": "",
      "raw": "Protesters marched to the White House on Saturday as D.C. Metropolitan Police officers and National Park Service police looked on from a distance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "224b8b05797f3ea4a20110c9b1b072109c9e066d",
      "title": "Claire's was 'shopping heaven' until Shein came along",
      "url": "https://www.bbc.com/news/articles/c23pek275p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T23:21:53.000Z",
      "summary_90w": "",
      "raw": "As the future of the chain hangs in the balance, what made tweenagers fall in love with its quirky charm?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3be4883dfb1dd555655b07a2ef005a6b11ade2b4",
      "title": "Leaves falling, berries ripe, but it's hot. Is autumn coming early?",
      "url": "https://www.bbc.com/news/articles/c2enmn7j3zjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T23:12:36.000Z",
      "summary_90w": "",
      "raw": "Has autumn come sooner than expected to the UK - and does it even matter if it has?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8849fc32cdd38f7dcdaacf955a604cd40d017684",
      "title": "Trump posted a photo of me sitting by my tent - then a bulldozer arrived",
      "url": "https://www.bbc.com/news/articles/cx2x39d2jxvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T23:07:39.000Z",
      "summary_90w": "",
      "raw": "DC's largest homeless encampment was destroyed after the president called for a crackdown. What happened to its residents?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3895bb0ef26e52b94644b02dcdb46109d0d40f6a",
      "title": "'Don't forget to have fun'. Pupils open time capsule letters to themselves",
      "url": "https://www.bbc.com/news/articles/c5y3e14xx0po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T23:05:02.000Z",
      "summary_90w": "",
      "raw": "Students at a secondary school in London wrote letters to themselves at the height of Covid - and opened them again just before their GCSEs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d73b75fab558885fa290cdc98c00877cf200f0e",
      "title": "Israel specified 'danger zones' in Gaza. That's where aid was dropped",
      "url": "https://www.bbc.com/news/videos/cn851l607djo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T23:04:22.000Z",
      "summary_90w": "",
      "raw": "BBC Verify finds 10 occasions where aid was dropped into an area Israel has warned people not to enter, saying it would put their lives at risk.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73234448f9775c5010eb6cab00d39f208d3bc47f",
      "title": "Once home to a cult, the Chilean tourist village haunted by torture and child abuse",
      "url": "https://www.bbc.com/news/articles/c93k3l373n5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T23:03:05.000Z",
      "summary_90w": "",
      "raw": "Chile wants to turn the site where a cult leader tortured prisoners and abused his followers into a memorial.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44828beab258add482a87b4692d5c235a1441e45",
      "title": "Beyond chow mein: Can a new wave of restaurants help China win hearts?",
      "url": "https://www.bbc.com/news/articles/cy4dk1z02w7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T22:07:14.000Z",
      "summary_90w": "",
      "raw": "As an authoritarian China tries other forms of soft power, a sumptuous table may  be a useful draw.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bfdbc0cc9954f8bde085bfc77eaa15eeafcea162",
      "title": "Wildfires rage in Spain and Portugal as heatwave continues",
      "url": "https://www.bbc.com/news/videos/c80dx2z8jldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T21:06:13.000Z",
      "summary_90w": "",
      "raw": "Thousands of firefighters have been battling huge blazes in Spain and Portugal on Saturday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e73eed602670bb86e186da7dd324b1bf37f3395d",
      "title": "Judge says FTC investigation into Media Matters ‘should alarm all Americans’",
      "url": "https://techcrunch.com/2025/08/16/judge-says-ftc-investigation-into-media-matters-should-alarm-all-americans/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-16T20:32:36.000Z",
      "summary_90w": "",
      "raw": "A federal judge has blocked the FTC's investigation into Media Matters research around advertising and antisemitic content on X.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66e48214d7c6f8db051e87c4a20e07ed3a66640e",
      "title": "What to know as Air Canada strike ends and flights resume ",
      "url": "https://www.bbc.com/news/articles/cq680gm5q86o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T20:20:46.000Z",
      "summary_90w": "",
      "raw": "Air Canada advises passengers not to go to the airport unless they have tickets on other airlines.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9afd084eee2f0ca710b348ca88d695c811fe7ef7",
      "title": "AI-powered stuffed animals are coming for your kids",
      "url": "https://techcrunch.com/2025/08/16/ai-powered-stuffed-animals-are-coming-for-your-kids/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-16T19:39:40.000Z",
      "summary_90w": "",
      "raw": "Do A.I. chatbots packaged inside cute-looking plushies offer a viable alternative to screen time for kids? Maybe not.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ea2ded1f7ba15f144b2292bf29a54fc31da83906",
      "title": "State Department halts 'medical-humanitarian' visas for people from Gaza",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5504634/state-department-halts-gaza-visas",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-16T19:08:10.000Z",
      "summary_90w": "",
      "raw": "The U.S. State Department says it's halting visas for visitors from Gaza as it reviews its process for granting visas for medical evacuees.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da1d39bedf0e2a2113d814f1c1ddabfaf820daa5",
      "title": "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations ",
      "url": "https://techcrunch.com/2025/08/16/anthropic-says-some-claude-models-can-now-end-harmful-or-abusive-conversations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-16T15:50:05.000Z",
      "summary_90w": "",
      "raw": "Anthropic says new capabilities allow its latest AI models to protect themselves by ending abusive conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1d7baa594901824acfebf3dd14be34075b0323e6",
      "title": "Immigration arrests dip in July, and activists hope they're partly responsible",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5504144/immigration-arrests-dip-in-july-and-activists-hope-theyre-partly-responsible",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-16T15:38:34.000Z",
      "summary_90w": "",
      "raw": "Immigration arrests falter in July after a big push for mass deportations in June. Activists in sanctuary jurisdictions hope their resistance plays a role.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b1ff0b4a7118c1da24778846722cdac8cd54802",
      "title": "Trump's ceasefire pivot will cause dismay in Kyiv and Europe",
      "url": "https://www.bbc.com/news/articles/clyvd2jpy1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-16T15:02:32.000Z",
      "summary_90w": "",
      "raw": "The US president demanded a ceasefire before he met Putin. His change of mind flies in the face of what Europe and Ukraine want.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "362d7cdbab3c2a8d2dd1eab24db3bc72db3027a4",
      "title": "Time not right to recognise Palestinian state, says Danish PM – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/16/middle-east-crisis-gaza-israel-hamas-lebanon-hezbollah-latest-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T15:01:57.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. You can read all our Middle East coverage here.\nThe Metropolitan police has said that 60 more people will be prosecuted for showing support for Palestine Action, which was proscribed by the UK government last month.\nMore than 700 people have been arrested for supporting the group since its proscription on 5 July.\nWe are deeply concerned about the unimaginable crisis in Gaza, which is having a terrible impact on civilians and especially the children. \nStarvation is deepening. Water scarcity is increasing very much each day. Colleagues on the ground are reporting that people are now basically rationing between either using water for drinking or for hygiene. \n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5087993cad920c732c046096dad6f0a6f4e26de8",
      "title": "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut",
      "url": "https://www.theverge.com/tech/760131/google-pixel-9-pro-fold-lenovo-legion-go-s-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-16T14:23:27.000Z",
      "summary_90w": "",
      "raw": "Some people like to stay on the cutting edge of technology. If that’s you, you already know that Google is going to officially unveil its Pixel 10 phones (including a new Fold) during its August 20th event. But if you’re someone who prefers to use these opportunities to save on last-gen tech, you’ve been rewarded with a sweet deal on the Pixel 9 Pro Fold. The base 256GB version in obsidian (black) is down to $1,199 at Amazon and Best Buy, which is 33 percent off its original $1,799 price. It was selling for $100 more just last week.\nGoogle Pixel 9 Pro Fold\n\nWhere to Buy:\n\n $1799 $1199 at Amazon (256GB)\n $1799 $1199 at Best Buy (256GB)\n $1799 at Google (256GB)\n\nThe Pixel 9 Pro Fold was a big leap forward compared to Google’s first-gen foldable, touting a lightweight design that looks and feels like a normal phone before you unfold it. One of its main drawbacks was that, despite its high original price, you don’t get the same great cameras in the cheaper Pixel 9 Pro (which, by the way, is only $599 at Best Buy). They’re still good, mind you, but reviewer Allison Johnson said during her testing that its telephoto lens produced softer images by comparison, and low-light photos were less detailed. Drawbacks aside, she was eager to recommend the foldable phone at its original $1,800 price.\nThe Pixel 10 Pro Fold is nearly upon us, and it’ll likely deliver some sizeable improvements. Google itself has already shown off its design in YouTube clips, and it’s very similar to the model on sale now. However, there’s a rumor that it might have an IP68 rating, which would make it dustproof. Dust was the kryptonite for early foldable models, but the tech has apparently come a long way since then, so this would be a huge selling point in favor of the new model if it’s true.\nRead our full Pixel 9 Pro Fold review.\nOther Verge-approved deals for your weekend\nWe had some tough (but warranted) words for the Windows version of the Lenovo Legion Go S gaming handheld in our review. The Verge’s Sean Hollister summed it up by saying it “feels good, plays bad,” which I echo in my Polygon review from earlier this year. One of Sean’s main complaints is the exorbitant $730 price that Lenovo was charging, especially since its specs aren’t all that impressive compared to the Steam Deck, and don’t get us started on the pain of using Windows 11 in handheld mode. However, its recent $300 off price drop at Best Buy to $499.99 makes it easier to overlook its faults. This model has AMD’s Ryzen Z2 Go chip, 32GB of RAM, and a 1TB SSD. It’s a decent value now considering that the version with SteamOS instead of Windows 11 costs $599.99, yet includes half the RAM and storage, though we’d still recommend picking a system with a Z1 Extreme chip. Also, note that Valve told us it doesn’t officially support SteamOS on the Windows model.\nIf you’re looking for your first — or next — Sonos speaker, there aren’t too many deals worth flagging on new units right now. One good refurbished deal has come to the surface, though, and it’s on the Sonos One SL, which is $119 at Wellbots for Verge readers. Enter the code SONOSVERGE40 at checkout to knock the price down from $159. This is an appealing deal because it beats the current prices at Sonos’ own refurbished outlet, and because it comes with a one-year warranty through Sonos — just as new speakers do. The 2019 One SL can be used alone, or synced up with other Sonos Wi-Fi speakers through the company’s app. It lacks a microphone, so you can’t bark voice commands at it. Read our Sonos One review.\nThose who own a 4K Blu-ray player, like the Panasonic DP-UB420-K, can add more flicks to their library of discs on the cheap over at Gruv. The shopping site (which is owned by Universal Pictures) is offering a bunch of 4K Blu-ray titles in a “3 for $30” sale, making each one just $10 before tax and shipping. Just to give you some examples of visually-stunning films that are eligible, there’s Dunkirk, Crazy Rich Asians, The Matrix Resurrections, and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2f900f133ed2ff5ee83121680d25987aa213a10c",
      "title": "'The world is behaving irrationally' - Putin's warm welcome gets cold reaction in Ukraine",
      "url": "https://www.bbc.com/news/articles/ckg4mj4011lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T13:22:46.000Z",
      "summary_90w": "",
      "raw": "In the absence of a deal, Ukrainians focused on the optics of Putin's visit to Trump in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9918c5ebe7d17674356b855808e9ee5a6d66f7f",
      "title": "Video shows prominent Palestinian prisoner for the first time in years",
      "url": "https://www.npr.org/2025/08/16/g-s1-83121/marwan-barghouti-video-famous-palestinian-prisoner",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-16T13:18:56.000Z",
      "summary_90w": "",
      "raw": "The world got a glimpse of Marwan Barghouti for the first time in years in a video of a far-right Israeli minister berating him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a488e465ffce827449ae9476362ef7b279c0d9a",
      "title": "New Orleans mayor and bodyguard lover charged with fraud and corruption",
      "url": "https://www.bbc.com/news/articles/cr4edddqpr7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T13:09:36.000Z",
      "summary_90w": "",
      "raw": "Prosecutors accuse LaToya Cantrell of conspiring with her protection cop to pay him for personal liasons.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce6eecd6ad2344efd6e8c5596585351e51160522",
      "title": "Dead Take’s best scares come from real-life performances",
      "url": "https://www.theverge.com/games/760213/dead-take-review-fmv-horror-game-ben-starr",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-16T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Dead Take, the second game from Tales of Kenzera: Zau developer Surgent Studios, is a quiet horror game where the monster is ambition and the lengths a person will go for stardom. Like a lot of horror games, Dead Take relies on jumpscares to get the heart pumping. But playing this game, my deepest, most upsetting scares didn't come from the startle of a sudden knock but from the performances of the game's actors.  \nIn Dead Take, you play as Chase Lowry (Neil Newbon), a struggling actor who has come to the creepy mansion of Hollywood producer and kingmaker Duke Cain (Abubakar Salim), to look for his friend, Vinnie Monroe (Ben Starr), another …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ba79ae97f961f8540daf17a5a85ee98a072ac6d",
      "title": "Government forces Air Canada flight attendants back to work, into arbitration",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5504621/air-canada-suspends-operations-strike-flight-attendants",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T12:48:06.000Z",
      "summary_90w": "",
      "raw": "Canada's government forced Air Canada and its striking flight attendants back to work and into arbitration Saturday after a work stoppage stranded more than 100,000 travelers around the world.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2d6c46b08ed22f02be704696a31548c6d71c0f79",
      "title": "A brazen attack on air safety is underway — here’s what’s at stake",
      "url": "https://www.theverge.com/planes/758913/air-safety-regulation-faa-trump-bedford-sully",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "At the end of July, the National Transportation Safety Board (NTSB) convened a three-day public hearing to investigate January's mid-air collision over Washington, DC that killed 67 people. After the hearing, two conclusions were inescapable. \nFirst, the disaster should have been prevented by existing safety rules. And second, the government regulators responsible for air safety have become hesitant to enforce those rules, especially when it means standing up to industry demands for more flights and lower costs. \nInstead of fixing the regulatory state's institutional cowardice, however, the Trump administration is moving to undermine it ev …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "06584689c771fb2c359c14f49df8587c9d31b3c5",
      "title": "Opinion: Remembering Ted Clark, great colleague — better friend",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5497210/opinion-remembering-ted-clark-great-colleague-better-friend",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Scott Simon remembers former longtime NPR colleague Ted Clark, who passed away last week at the age of 79.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b0c15b44269f9dcf7c772ff2a940869efa1aaa3a",
      "title": "New Zealand woman and six-year-old son released from US detention",
      "url": "https://www.theguardian.com/world/2025/aug/16/new-zealand-woman-and-six-year-old-son-released-from-us-detention",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T11:56:07.000Z",
      "summary_90w": "",
      "raw": "Sarah Shaw was detained by Ice owing to a problem with her ‘combo card’ visa as she tried to re-enter the US from Canada\n\nNew Zealand woman and son detained by Ice enduring ‘terrifying’ ordeal\n\nA New Zealand woman and her six-year-old son, who were held for more than three weeks at a US immigration centre after being detained crossing the Canada-US border, have been released.\nIn a short update on Saturday, the woman’s friend Victoria Besancon said Sarah Shaw and her son were safely home. The family would be taking some time to settle in before speaking about their experience, she added.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5dca241d216f1f504fb92b4486b809b47ff84579",
      "title": "Macron condemns 'act of hatred' after tree memorial for murdered Jew is cut down",
      "url": "https://www.bbc.com/news/articles/cwy5wppr1p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T10:21:32.000Z",
      "summary_90w": "",
      "raw": "The French president said the felling of the tree honouring Ilan Halimi was \"an attempt to kill him a second time\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee2e2f6a652a7861b9ca2932f52e4b2097ea16c6",
      "title": "Electricity prices are climbing more than twice as fast as inflation",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5502671/electricity-bill-high-inflation-ai",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Electricity prices are rising more than twice as fast as overall inflation.  That's especially costly during the dog days of summer when air conditioners are working hardest.  In addition to hot weather, a variety of factors are causing power bills to climb, including the high cost of natural gas used to generate electricity and soaring demand from data centers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "416127ea82c27fd40a2f528f653fd6d644a2b93b",
      "title": "Private equity and crypto could be heading for your 401(k). Here's what to know",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5504096/401k-private-equity-crypto-executive-order",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A recent executive order paves the way for retirement accounts to include a lot more than stock and bond funds.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "aa99bf0ee5eb37990c660ded77ccd99ae092b0af",
      "title": "'A long way for nothing?' BBC correspondents on Alaska meeting",
      "url": "https://www.bbc.com/news/videos/c707rnvrxe2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T02:40:46.000Z",
      "summary_90w": "",
      "raw": "After the leaders left without taking questions, Anthony Zurcher and Steve Rosenberg stayed on to unpack what we learned.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "59b457a6ea3d1e773da01e11eb7b27fca30e8263",
      "title": "How the Trump-Putin summit unfolded... in under 2 minutes",
      "url": "https://www.bbc.com/news/videos/c62wdzlnv1do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T00:37:36.000Z",
      "summary_90w": "",
      "raw": "The meeting concluded with no deal being reached between Donald Trump and Vladimir Putin but \"great progress\" was made in Ukraine talks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "250dc39f0d2b97b69bc0434be618269084fbcaab",
      "title": "Are mangoes good for diabetes? Indian studies challenge conventional wisdom",
      "url": "https://www.bbc.com/news/articles/crr2jpq2yzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-16T00:28:17.000Z",
      "summary_90w": "",
      "raw": "Two Indian trials suggest that controlled mango consumption, instead of carbs, may improve blood sugar in diabetes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6bfc78dcfcb8297c72154a8b786971b3e8a3aaa",
      "title": "Winklevoss twins’ crypto company Gemini files for IPO",
      "url": "https://techcrunch.com/2025/08/15/winklevoss-twins-crypto-company-gemini-files-for-ipo/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-16T00:16:43.000Z",
      "summary_90w": "",
      "raw": "Another crypto company is headed for the public markets.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7241623fb6e169f633e3e3d4ce284aa5c499b100",
      "title": "Trump says Xi told him China will not invade Taiwan while he is in office",
      "url": "https://www.theguardian.com/world/2025/aug/16/donald-trump-xi-jinping-china-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T00:09:59.000Z",
      "summary_90w": "",
      "raw": "US president says Chinese counterpart told him ‘I am very patient and China is very patient’\nThe US president, Donald Trump, has said that his Chinese counterpart, Xi Jinping, told him China would not invade Taiwan while Trump is in office.\nTrump made the comments in an interview with Fox News on Friday, ahead of talks with the Russian president, Vladimir Putin, over Moscow’s invasion of Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10d2daff858811236aff312a58f07bf8440a1928",
      "title": "Laura Loomer and the limits of posting everything",
      "url": "https://www.theverge.com/politics/760269/laura-loomer-deposition",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T23:36:49.000Z",
      "summary_90w": "",
      "raw": "PHILADELPHIA, PENNSYLVANIA – SEPTEMBER 10, 2024: Laura Loomer arrives at Philadelphia International Airport on The Trump Organization’s Boeing 757. | Photo: Getty Images\t\n\nFor all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she's the influencer responsible for getting Donald Trump to fire over a dozen members of his administration (and counting) for the hazily-defined crime of being disloyal to MAGA. This is something that none of her peers, individually, have been able to do. But to understand how she operates, look no further than Loomer's latest attempted power play, which,  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d86f6c742a9dda9f394936c923deaa52d73e1ef9",
      "title": "Tuvalu considers pulling out of Pacific leaders’ summit amid China-linked power struggle",
      "url": "https://www.theguardian.com/world/2025/aug/16/tuvalu-considers-pulling-out-of-pacific-leaders-summit-amid-china-linked-power-struggle",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T23:30:45.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Prime minister Feletei Teo says Tuvalu may withdraw from crucial meeting after key countries such as Taiwan were barred from attending\nTuvalu’s prime minister Feletei Teo said his country may pull out of the region’s top political meeting next month, after host nation Solomon Islands moved to block all external partners – including China, US and Taiwan – from attending.\nThe Pacific Islands Forum leaders meeting will be held in Honiara in September. On 7 August, Solomon Islands prime minister Jeremiah Manele told parliament that no dialogue partners would be invited to the annual gathering.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efe14c98502dc77b5862e7605adf4f5c99071ade",
      "title": "Sam Altman, over bread rolls, explores life after GPT-5",
      "url": "https://techcrunch.com/2025/08/15/sam-altman-over-bread-rolls-explores-life-after-gpt-5/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T22:20:59.000Z",
      "summary_90w": "",
      "raw": "At a dinner with reporters in San Francisco, OpenAI CEO Sam Altman spilled details on the company's ambitions beyond ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e4d04b9bc917cc7d93e4a0c7eb5c8f9cba9744b",
      "title": "Home Depot stays quiet as immigration raids target day laborers",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5495539/home-depot-stays-quiet-as-immigration-raids-target-day-laborers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T21:06:06.000Z",
      "summary_90w": "",
      "raw": "Home Depot stores have been the location of dramatic federal raids targeting day laborers. But the company has largely been quiet.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d7f2e5f082bc1dea0eecab7f0f6f405c21bd054d",
      "title": "How your solar rooftop became a national security issue",
      "url": "https://techcrunch.com/2025/08/15/how-your-solar-rooftop-became-a-national-security-issue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T20:58:45.000Z",
      "summary_90w": "",
      "raw": "Texas solar company EG4 became the poster child for home energy cybersecurity risks this week after federal officials published an advisory detailing how hackers could hijack its inverters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9041bd0498a07914e211729b3bb152f484d3d6d1",
      "title": "Sen. Hawley to probe Meta after report finds its AI chatbots flirt with kids",
      "url": "https://techcrunch.com/2025/08/15/sen-hawley-to-probe-meta-after-report-finds-its-ai-chatbots-flirt-with-kids/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T20:38:40.000Z",
      "summary_90w": "",
      "raw": "“Is there anything - ANYTHING - Big Tech won’t do for a quick buck?” Hawley wrote in a post on X announcing the investigation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d653c14eed0113712bba566071fa205436f84515",
      "title": "After a freeze, Trump administration reluctantly agrees to fund EV chargers",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5501584/ev-charger-nevi-funding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T20:33:59.000Z",
      "summary_90w": "",
      "raw": "Transportation Secretary Sean Duffy says he doesn't agree with federal subsidies for high-speed EV chargers, but that his department \"will respect Congress' will\" and release the funds.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "46c03eb4ea26419aedf83c0516aee36f54d7a40b",
      "title": "When our inflation infeelings don’t match the CPI",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500523/when-our-inflation-infeelings-dont-match-the-cpi",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T20:30:00.000Z",
      "summary_90w": "",
      "raw": "For most Americans, we just lived through the highest period of inflation in our lives. And we are reminded of this every time we go grocery shopping. All over TikTok, tons of people have posted videos of how little they got for … $20. $40. $100. Most upsetting to us: an $8 box of Cinnamon Toast Crunch.\n\nFood prices are almost 30% higher than they were five years ago. It’s bad. And those new, higher prices aren’t going away.\nAt the same time, prices are no longer inflating at a wild pace. For the last two years, the rate of inflation has slowed way down. And yet, our fears or feelings that things will spiral out of control again? Those have not slowed down.\nThis mismatch has been giving us all the …. feelings. Inflation feelings. Infeelings. \nOn our latest show: we sort through our infeeltions. We talk to the economists who have studied us. We learn why our personal inflation calculators don’t always match the professional ones.\nListen free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.\nSupport Planet Money, get bonus episodes and sponsor-free listening and now Summer School episodes one week early by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c951d36c90f21bec8a85f29b15bac07635d569cc",
      "title": "The best budget smartphone you can buy",
      "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T20:29:35.000Z",
      "summary_90w": "",
      "raw": "You can get a great budget device these days if you know how to pick your priorities. | Image: The Verge\t\n\nSome of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in. If that’s you — and there’s no judgment here from a certifiable gadget nerd — then you can probably think of more worthwhile ways to spend $1,000 than on a phone.\nBudget phones to the rescue. These devices are roughly $500 or under, though not all of them, and they’re more capable than ever. You won’t get all the bells and whistles, but you will save a little money to spend on, I don’t know, actual bells and whistles. It’s your world.\nWhat compromises can you expect from a budget phone? Some combination of the following: slower processors, less storage, and worse cameras than flagship phones, almost across the board. Many have lower-resolution screens, and water resistance is often less robust than on a pricier phone.\n\nThe best cheap iPhone\nThe best Android phone under $500\nThe budget phone with a big, beautiful screen\nOther budget phones to consider\n\nThe best cheap iPhone\niPhone 16E\nThe iPhone 16E is the spiritual successor to the iPhone SE, bringing flagship-level performance for less than the standard 16. We really wish it included MagSafe for $599, but those upgrading from older iPhones will probably be satisfied with what’s included.\n\n\nScore: 7\n\nProsCons\n\n\nReliable performance\nGood, if limited, camera system\nIt’s the cheapest new iPhone you can buy\n\nNo MagSafe\n$599 feels like $100 too much\nNo ultrawide\n\n\n\nWhere to Buy:\n\n $599 at Apple\n $599.99 at Best Buy\n $599.99 at Verizon\n\nScreen: 6.1-inch, 1170p OLED / Processor: A18 Cameras: 48-megapixel f/1.6 with OIS, 12-megapixel selfie / Charging: 20W wired, 7.5W wireless / Weather-resistance rating: IP68\nIf I were making this recommendation to you face-to-face, you’d hear a heavy sigh. Yes, this is the cheapest new iPhone Apple makes. Yes, it comes with most of the things that make an iPhone an iPhone. But it comes with some significant tradeoffs — some of which make more sense than others — and it’s not exactly cheap. If you’re amenable to last year’s model or a refurbished iPhone 14, one of those might actually be a better option. But for an unfussy person who just wants a new iPhone for the least amount of money, the 16E will do the trick.\nThere’s a single 48-megapixel rear camera on the back, meaning there’s no ultrawide like on the regular 16. That’s an understandable tradeoff — so is the use of the older “notch” design rather than the Dynamic Island. But it’s harder to understand why Apple left out MagSafe here — that’s the ring of magnets built into the back of virtually every other iPhone since 2020. The 16E still supports wireless charging, but it can’t take advantage of the ecosystem of magnetic chargers and accessories on its own; you’ll need to add a magnetic case. This is a silly omission, and Apple should feel bad about it.\nAnother heavy sigh: the 16E supports Apple Intelligence, which you won’t get if you opt for an iPhone 15 or 14. Should you care? It’s really hard to say. What exists of Apple Intelligence so far is underwhelming and the most interesting bits won’t arrive anytime soon. If you want to future-proof your purchase as much as possible, the 16E will be ready for Apple’s AI. But don’t buy one expecting a life-changing experience now. It’s just an iPhone after all, for better and worse, and right now it’s the best price you’ll find on a brand-new one.\nRead my full iPhone 16E review.\nThe best Android phone under $500\nGoogle Pixel 9A\nThe Pixel 9A adds more robust water resistance and a brighter, bigger screen to what was already a winning formula for a good midrange phone.\n\n\nScore: 8\n\nProsCons\n\n\nRobust IP68 rating\nSeven years of software updates\nBrighter, bigger screen\n\nMissing a couple of AI features\nAI is occasionally handy, usually weird\n\n\n\nWhere to Buy:\n\n $499 $399 at Amazon\n $499 $399 at Best Buy\n $499.99 $399 at Google\n\nScreen: 6.3-inch, 1080p OLED, 120Hz / Processor: Tensor G4 Cameras: 48-megapixel f/1.7 with OIS, 13-megapixel ultrawide, 13-megapixel selfie / Battery: 5,100mAh / Charging: 23W wired, 7.5W wireless / Weather-resistance rating: IP68\nGoogle’s Pixel A-series phones have been my go-to recommendation for a cheap Android phone for years, but there was still room for improvement. With the 9A, Google made some modest tweaks that make it even easier to recommend — and at $499, the price is right. \nThe phone uses a Tensor G4 chipset that doesn’t run as hot as some of its predecessors, and performance is reliable. The 6.3-inch OLED screen is a little bigger and a bit brighter than last year’s, which makes a noticeable difference when you use the phone outside. Durability also received a slight boost to IP68, which means it can withstand a drop in deeper water than the IP67-rated Pixel 8A.\nThe 9A’s camera is fine, though it comes up short against the rest of the Pixel 9 series in low light. Portrait mode could be better, too, and if you care a lot about image quality, then that might be a good reason to consider stepping up to a Pixel 9. But it does the trick for everyday snaps, and for the price, the 9A’s better qualities outweigh its shortcomings by a wide margin.\nRead my full Google Pixel 9A review.\nThe budget phone with a big, beautiful screen\nOnePlus 13R\nThe OnePlus 13R is a pared-down version of the company’s flagship phone, and it offers excellent battery life and a great screen for the price.\n\n\nScore: 6\n\nProsCons\n\n\nExcellent battery life\nGreat screen for the price\nSix years of security updates\n\nNo wireless charging\nOnly splash-resistant\nFewer OS updates than Google and Samsung\n\n\n\nWhere to Buy:\n\n $599.99 $499.99 at Amazon\n $599.99 $499.99 at Best Buy\n $599.99 $499.99 at OnePlus\n\nScreen: 6.78-inch, 1264 x 2780 120Hz OLED / Processor: Snapdragon 8 Gen 3 Cameras: 50-megapixel f/1.8 with OIS, 50-megapixel 2x telephoto, 8-megapixel ultrawide, 16-megapixel selfie / Battery: 6,000mAh / Charging: 80W wired / Weather-resistance rating: IP65\nThe OnePlus 13R isn’t quite as well-rounded as my pick for the best overall budget Android phone, the Pixel 9A. It’s also a little pricier at $599 — although we’ve seen it on sale for $499 for extended periods of time — but for some people, the 13R’s upgrades will make it a better choice. It comes with one of the best big screens in its class, and many people love a big screen. The 13R also offers very strong battery performance; unless you’re a power user, you can probably manage two full days on a single charge.\nThere’s also very fast charging with the included charger, though you won’t find wireless charging at any speed. The 13R also lacks full water resistance; it should hold up fine against sprays and rain showers, but it isn’t rated to withstand full immersion. Plenty of people won’t find those omissions bothersome, but they make it harder to recommend to a general audience, especially at a higher price than the Pixel 9A.\nRead my full OnePlus 13R review.\nOther budget phones to consider\nThe 2025 Motorola Moto G Power offers a lot despite its starting price of $299.99. It features a 6.8-inch LCD display, a 5,000mAh battery, wireless charging support, and a 3.5mm headphone jack, which is increasingly rare in 2025. Additionally, the device combines both IP68 and IP69 ratings, meaning it’s rated for both submersion in water and exposure to high-pressure water jets and steam, in addition to full protection from dust.\nThe Samsung Galaxy S24 FE is another perfectly capable phone that doesn’t quite earn a recommendation here. It’s a little outside the scope of this guide at $649 anyway, but you do get a telephoto lens and a nice, big screen for that price. Still, you’re better off saving a bunch and picking up the Pixel 9A or trying to score a trade-in promo for the newer Galaxy S25. Read our review.\nThe Samsung Galaxy A56 recently launched in the US with a starting price of $499. The device has all the makings of a solid midrange phone, including a 6.7-inch OLED display, a 50-megapixel main camera, an Exynos 1580 chip, and a 5,000mAh battery with 45W wired charging. Although we haven’t tested it yet, it has some pretty stiff competition in the form of the Pixel 9A, which also has a starting price of $499.\nWe got our first glimpse of the TCL 60 XE Nxtpaper 5G back at CES 2025, and it’s finally in our hands for testing. The device features an Nxtpaper matte LCD screen that’s supposed to be easier on your eyes than a traditional LCD, as it reduces your exposure to blue light. It also features a “Max Ink Mode,” which turns the screen monochrome and silences notifications. This, in turn, can help extend the phone’s battery life to multiple days. Read our initial impressions.\nThe Samsung Galaxy A36 5G is another great choice that recently launched in the US for $399.99. The device sports a big OLED display, a decent midrange Snapdragon 6 Gen 3 processor, and an IP67 rating for water and dust resistance. Samsung is promising six years of OS and security updates, which is a lot in this price range. Compared to the Galaxy A35 5G, which we previously included in this guide but is no longer available, the A36 5G drops the microSD slot for a second SIM card slot. While we haven’t tested the A36 5G, its predecessor offered a good balance of hardware and price, and the latest release sounds just as compelling.\nUpdate, August 15th: Updated pricing / availability and added a bullet for the Galaxy A36 5G. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "499216c62047f685cd7d58451ed3594e05afaa38",
      "title": "Les Amis, the European app helping women form friendships, launches in New York",
      "url": "https://techcrunch.com/2025/08/15/les-amis-the-european-app-helping-women-form-friendships-launches-in-new-york/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T20:04:50.000Z",
      "summary_90w": "",
      "raw": "Les Amis is an app designed to make it easy for women to form friendships and attend local events.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "83b4797e99c5a3207f0380c51eeadcf00da62915",
      "title": "TikTok’s new guidelines add subtle changes for LIVE creators, AI content, and more",
      "url": "https://techcrunch.com/2025/08/15/tiktoks-new-guidelines-add-subtle-changes-for-live-creators-ai-content-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T19:17:48.000Z",
      "summary_90w": "",
      "raw": "TikTok is preparing an update to its Community Guidelines, which dictate the rules for participating on the social video platform as well as what standards the company uses to determine the videos that make it onto its For You feed.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ab3ab6c1377b2ba9c684625271fec85a5f54b5a",
      "title": "Louisiana sues Roblox for creating an environment where &#8216;child predators thrive&#8217;",
      "url": "https://www.theverge.com/news/760162/roblox-louisiana-lawsuit-child-predators-safety",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T18:38:16.000Z",
      "summary_90w": "",
      "raw": "The state of Louisiana has filed a lawsuit against Roblox, alleging that the company has “permitted and perpetuated an online environment in which child predators thrive, directly contributing to the widespread victimization of minor children in Louisiana.” \nRoblox sees more than 111.8 million daily active users, and it’s hugely popular with children, with users under 13 comprising nearly 40 percent of players last quarter. However, the platform has come under significant scrutiny over reported failures to protect children on the platform, with Bloomberg publishing a major report last year about predators on Roblox and the investment firm Hindenburg Research alleging that its research revealed “an X-rated pedophile hellscape.” In recent months, Roblox has taken steps to bolster its child safety features, including introducing parent accounts that can manage their child’s account and the ability for parents to block people on their child’s friend list.\nBut Louisiana alleges that Roblox’s “deliberate failure to implement effective safety measures to protect child users from well-documented predatory threats, along with its ongoing failure to warn parents and children of the foreseeable dangers posed by its platform, has directly facilitated the widespread sexual exploitation of minors and inflicted severe, lasting harm upon the children of Louisiana,” according to the complaint.\n“Roblox is overrun with harmful content and child predators because it prioritizes user growth, revenue, and profits over child safety,” Attorney General Liz Murrill says. “Every parent should be aware of the clear and present danger poised to their children by Roblox so they can prevent the unthinkable from ever happening in their own home.”\nRoblox spokesperson Kadia Koroma sent the following statement about the lawsuit to The Verge:\nThe assertion that Roblox would intentionally put our users at risk of exploitation is categorically untrue. Every day, tens of millions of people around the world use Roblox to learn stem skills, play, and imagine and have a safe experience on our platform. We dedicate vast resources to supporting a safe infrastructure including advanced technology and 24/7 human moderation, to detect and prevent inappropriate content and behavior — not only because it’s important to us but because it is such a critical issue and so important to our community. We dispute these allegations and we remain committed to working with Attorney General Murrill to keep kids safe.\nWhile no system is perfect, Roblox has implemented rigorous safeguards—such as restrictions on sharing personal information, links, and user-to-user image sharing—to help protect our community. Unfortunately, bad actors will try to circumvent our systems to try to direct users off the platform, where safety standards and moderation practices may differ. We continuously work to block those efforts and to enhance our moderation approaches to promote a safe and enjoyable environment for all users.\nThe company also published an article responding to the lawsuit on its newsroom.\nSeven lawsuits regarding child predator issues have been filed against Roblox in a “little over two weeks,” Bloomberg reports.\nThis week, Roblox published a post on its website about why it removes what it describes as “vigilantes” who try to catch bad actors on Roblox by using tactics “similar to actual predators.” One user, who goes by “Schlep” and says on his X profile that he has contributed to “6 Roblox arrests and counting,” posted screenshots on X last week of what he says was a cease-and-desist notice by Roblox.\nUpdate, August 15th: Added statement from Roblox.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f8e7e98cf47162095bcef6e4088429cea341853",
      "title": "Here are the best AirPods deals you can get right now",
      "url": "https://www.theverge.com/21302051/best-apple-airpods-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T18:29:53.000Z",
      "summary_90w": "",
      "raw": "Apple’s latest AirPods Pro are receiving the biggest discount at 32 percent off. | Photo: Chris Welch / The Verge\t\n\nIf you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Amazon Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, though you can still find great deals throughout the year.\n \n\nThe best AirPods 4 deals\nThe best AirPods Pro (second-gen) deals\nThe best AirPods Max deals\n\nBelow, we’ve rounded up the best deals currently available on each model, including both iterations of the AirPods 4, the latest AirPods Pro, and the AirPods Max.\nThe best AirPods 4 deals\nApple AirPods 4\nApple’s AirPods 4 improve on previous models with better sound, clearer voice calls, and an even more comfortable design. For $50 extra, you can purchase a model with active noise cancellation and wireless charging.\n\nWhere to Buy:\n\n $129 $99 at Amazon\n $129 $99 at Walmart\n $129 $99.99 at Best Buy\n\n\nAirPods 4 with Active Noise Cancellation\nThe fancier version of the new AirPods 4 offer support for active noise cancellation, a wireless charging case that can use either Qi or Apple Watch pads, and a speaker in the case that chirps to help you find it.\n\nWhere to Buy:\n\n $179 $148.99 at Amazon\n $179 $148.99 at Walmart\n $179 $149.99 at Best Buy\n\nAt its September 2024 event, Apple introduced the AirPods 4, a pair of wireless earbuds available in two variations: a $129 standard model and a $179 noise-canceling model. Both versions represent significant upgrades over the third-gen AirPods, with a more comfortable design and improved audio performance. They’re also better for taking calls thanks to Apple’s Voice Isolation feature, which focuses the mics on your voice so you can be heard more clearly in noisy environments.\nThe $179 AirPods 4 with Active Noise Cancellation offer a surprisingly effective noise-canceling mode, a helpful transparency mode, and several other Pro-level features. The latest AirPods Pro do a better job of tuning out noise, but the AirPods 4 with ANC still do a good job of reducing sound. They also feature other perks formerly reserved for Apple’s top-of-the-line earbuds, including wireless charging and a case with a built-in speaker that allows you to easily track it down via Apple’s Find My app.\nGiven they’ve been out for nearly a year, we consistently see discounts on both versions of the AirPods 4. Right now, for instance, the standard AirPods 4 are on sale at Amazon, Walmart, and Best Buy for around $99 ($30 off), which is just $10 shy of their all-time low. The AirPods 4 with ANC, meanwhile, are matching their second-best price to date at Amazon, Walmart, and Best Buy, where you can currently pick them up starting at $148.99 (also $30 off).\nRead our full AirPods 4 review.\nThe best AirPods Pro (second-gen) deals\nApple AirPods Pro (second-gen) with USB-C charging case\nThe second-gen AirPods Pro improve upon Apple’s original pair with much better noise cancellation, sound quality, and onboard volume controls. The latest refresh also ships with a USB-C charging case, as opposed to Lightning.\n\nWhere to Buy:\n\n $249 $169 at Amazon\n $249 $169 at Walmart\n $249.99 $169.99 at Best Buy\n\nIn 2022, Apple released the second-gen AirPods Pro, which feature a similar build to the first-gen model but offer better noise cancellation, swipe-based controls, and an extra-small pair of swappable silicone ear tips for smaller ears. Apple followed up a year later with a minor refresh, one that features a USB-C charging case and an upgraded IP54 rating for water and dust resistance. The newest model also supports lossless audio when used with Apple’s new Vision Pro headset and doubles as a pair of FDA-approved hearing aids.\nAs far as deals go, Apple’s updated AirPods Pro with USB-C are currently available at Amazon, Walmart, and Best Buy for around $169 ($80 off), which remains the best price we’ve seen this year outside of Prime Day.\nRead our AirPods Pro with USB-C impressions.\nThe best AirPods Max deals\nApple AirPods Max\nApple’s AirPods Max feature exemplary build quality, sound phenomenal, and keep up with the best at noise cancellation.\n\nWhere to Buy:\n\n $549 $479.99 at Amazon (USB-C)\n $549 $479.99 at Walmart (USB-C)\n $549 $479.99 at Best Buy (USB-C)\n\nThe AirPods Max aren’t the iconic in-ears that have become synonymous with the AirPods name. They’re large and luxurious, comprised of aluminum, steel, and mesh fabric that remains comfortable during extended listening sessions. They also sport excellent noise cancellation, Apple’s spatial audio feature, and expansive, balanced sound, even if they lag behind some of their peers when it comes to bass response and features. They’re not the best noise-canceling headphones for most people — blame the sticker price — but it’s hard to find a better pair of Bluetooth headphones if you’re an iPhone user.\nToward the end of last year, Apple replaced the first-gen Max with a new model that features support for USB-C charging and a few new color options. As of writing, they’re on sale at Amazon, Walmart, and Best Buy in all six colors for $479.99 ($70 off) — not quite the $399 low we saw during Prime Day.\nRead our original AirPods Max review.\nUpdate, August 15th: Updated to reflect current pricing / availability and add several related links.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "723b0dda382a077e968b563bc04bcb196874fab5",
      "title": "Kyte, which billed itself as the ‘best competitor to Hertz,’ shuts down",
      "url": "https://techcrunch.com/2025/08/15/kyte-which-billed-itself-as-the-best-competitor-to-hertz-shuts-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T18:29:06.000Z",
      "summary_90w": "",
      "raw": "The startup entered into receivership after selling its customer list to Turo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a056b9b2538821f15829507191268962fe09488f",
      "title": "Trump wants to clean up the space industry’s red tape: Here’s who wins",
      "url": "https://techcrunch.com/2025/08/15/trump-wants-to-clean-up-the-space-industrys-red-tape-heres-who-wins/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T18:09:09.000Z",
      "summary_90w": "",
      "raw": "A new executive order takes aim at the bureaucracy that the White House says is holding back American competitiveness in space.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61e4a61ce13c041338d2390d1da227d54d15ed26",
      "title": "Israeli unit tasked with smearing Gaza journalists as Hamas fighters – report",
      "url": "https://www.theguardian.com/world/2025/aug/15/israeli-military-unit-reportedly-tasked-with-linking-journalists-in-gaza-to-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T17:00:37.000Z",
      "summary_90w": "",
      "raw": "Israeli-Palestinian magazine says IDF ‘legitimisation cell’ set up to blunt global outrage over killing of media staff\nA special unit in Israel’s military was tasked with identifying reporters it could smear as undercover Hamas fighters, to target them and to blunt international outrage over the killing of media workers, an Israeli-Palestinian investigation has found.\nThe “legitimisation cell” was set up after the 7 October 2023 Hamas attack, the Israeli-Palestinian +972 Magazine and Hebrew-language Local Call reported.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ff3e5beede45ebab646cfffcea621f42addf76b",
      "title": "CFPB staff layoffs can proceed, appeals court rules",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5403868/appeals-court-ruling-cfpb-layoffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T16:21:49.000Z",
      "summary_90w": "",
      "raw": "The Trump administration sent reduction-in-force notices to more than 1,400 staffers at the Consumer Financial Protection Bureau in April.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8afffc9093501b4c9dab822ee4699259076fcba2",
      "title": "A comprehensive list of 2025 tech layoffs",
      "url": "https://techcrunch.com/2025/08/15/tech-layoffs-2025-list/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T16:08:50.000Z",
      "summary_90w": "",
      "raw": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "09a037ed2d107d69d9e3b285a2ea87a7c5554a00",
      "title": "Ultrahuman acquires viO HealthTech to launch enhanced cycle and ovulation tracking",
      "url": "https://techcrunch.com/2025/08/15/ultrahuman-acquires-vio-healthtech-to-launch-enhanced-cycle-and-ovulation-tracking/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Cycle and Ovulation Pro is available starting Friday as a premium PowerPlug in the Ultrahuman app for $3.99 per month or $39.99 per year for users in the U.S., U.K., EU, Australia, and Canada.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "647975cea125e3ed7571695ecd0d86e7a4a2699c",
      "title": "ChatGPT’s mobile app has generated $2B to date, earns $2.91 per install",
      "url": "https://techcrunch.com/2025/08/15/chatgpts-mobile-app-has-generated-2b-to-date-earns-2-91-per-install/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T15:36:28.000Z",
      "summary_90w": "",
      "raw": "On average, the app is generating close to $193 million per month, up from $25 million last year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3b4c96fa46cf19909635bf903b4df161c679342d",
      "title": "The Trump-Putin summit: Tactics and trolling?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lx6k8c?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T14:54:00.000Z",
      "summary_90w": "",
      "raw": "Trump and Putin head to Alaska for talks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be21839a8e7356ba04c634fe074badf98124abf3",
      "title": "Louisiana attorney general sues Roblox",
      "url": "https://techcrunch.com/2025/08/15/louisiana-attorney-general-sues-roblox/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T14:43:20.000Z",
      "summary_90w": "",
      "raw": "The lawsuit points to several sexually explicit experiences that were on the platform, including “Escape to Epstein Island,” “Diddy Party,” and “Public Bathroom Simulator Vibe.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f73f9282222e9b09b1010a5c6e585fd4f03a04",
      "title": "Meet the first batch of VCs set to judge Startup Battlefield 200 at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/15/meet-the-first-batch-of-vcs-set-to-judge-startup-battlefield-200-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Startup Battlefield 200 is the crown jewel of TechCrunch Disrupt. From thousands of applicants, only the top 20 will take the Stage at Disrupt 2025 (October 27-29, San Francisco) to pitch their vision to panels of top-tier VCs in front of a live audience. Every contender is chasing game-changing impact — and we’re here for the drama, the breakthroughs, and the big reveals.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8af381f97959af15a2684e72fd463cda886a5314",
      "title": "'It's coming home' - the undignified row over the body of Zambia's ex-president",
      "url": "https://www.bbc.com/news/articles/clyv68324zgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:39:28.000Z",
      "summary_90w": "",
      "raw": "Edgar Lungu, who died in June, is yet to be buried - the debate over what next exposes deep divisions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89e6b7dc66b19ad27e6c9791b597260be84fce9a",
      "title": "Online fashion retailer Shein’s UK sales leap by a third to more than £2bn",
      "url": "https://www.theguardian.com/business/2025/aug/15/online-fashion-retailer-shein-uk-sales-leap-by-a-third-to-more-than-2bn",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T10:09:20.000Z",
      "summary_90w": "",
      "raw": "Profits rise 56% to £38.2m in 2024 as company overtakes British rival Boohoo and closes in on Asos\nShein, the online fast-fashion retailer founded in China, increased sales in the UK by about a third to more than £2bn last year, overtaking the British rival Boohoo and closing in on Asos.\nThe company, which had been considering a £50bn float on the London Stock Exchange but is expected to list in Hong Kong, said profits rose 56% to £38.2m last year on which it paid £9.6m corporation tax, according to accounts filed at Companies House this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d433daa9d7e7dc43ff5cf3e6f3cdfcd3b097486",
      "title": "Weather tracker: Typhoon Podul pounds southern Taiwan",
      "url": "https://www.theguardian.com/environment/2025/aug/15/weather-tracker-typhoon-podul-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T09:47:14.000Z",
      "summary_90w": "",
      "raw": "One person dies after storm whips up waves, while temperatures approach 50C as heatwave grips Middle East\nTyphoon Podul crossed southern Taiwan on Wednesday with wind speeds of up to 110mph (177km/h), equivalent to a category 2 hurricane.\nPodul had developed a week earlier, near the Northern Mariana Islands, and tracked west across the Philippine Sea, achieving typhoon status on Tuesday before making landfall in south-east Taiwan the following day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a6c4565740cea489d8be97d249c1a14588628f1",
      "title": "In maps: The war-ravaged Ukrainian territories at the heart of the Trump-Putin summit",
      "url": "https://www.bbc.com/news/articles/cgkrn433lk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T07:30:17.000Z",
      "summary_90w": "",
      "raw": "Kyiv has rejected ceding territory seized by Russia to secure a ceasefire.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8fb10fb888a15be2fb114905aee712fdf7a41e0b",
      "title": "Climate crisis harming world heritage painted houses in Burkina Faso, say residents",
      "url": "https://www.theguardian.com/environment/2025/aug/15/climate-crisis-harming-world-heritage-painted-houses-tiebele-in-burkina-faso-say-residents",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T05:00:23.000Z",
      "summary_90w": "",
      "raw": "Tiébélé’s wavy-walled houses covered in geometric lines showing signs of disintegration amid erratic weather\nA world heritage site that was once a famous tourist destination is suffering from signs of disintegration, as climate change affects weather patterns.\nThe wavy-walled houses covered with singular geometric lines of the Royal Court of Tiébélé in Burkina Faso, established in the 16th century, are recognisable all over the world. The paintings represent the thoughts, culture, and religion of the Kassena people, literally written on the walls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba580e7d06fd2721fa7f8fe1271c85e20ec0c533",
      "title": "Hundreds hit with food poisoning in Indonesia after eating free meals from president’s flagship program",
      "url": "https://www.theguardian.com/world/2025/aug/15/hundreds-struck-by-poisoned-in-indonesia-after-eating-free-meals-from-presidents-flagship-program",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T01:48:11.000Z",
      "summary_90w": "",
      "raw": "Since its launch in January, Prabowo Subianto’s signature policy has been marred by mass food poisoning cases affecting over 1,000 people\nMore than 360 people fell ill in the Indonesian town of Sragen in Central Java after consuming school lunches, according to officials, in the largest food poisoning case to hit President Prabowo Subianto’s flagship free meals programme to date.\nSince its launch in January, the free school meals programme has been marred by mass food poisoning cases across the archipelago, affecting more than 1,000 people.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "23a86c8795eddd5fdd84052798d2dfd7f7be0777",
      "title": "Inside Trump’s meeting with Putin… Americast is in Alaska!",
      "url": "https://www.bbc.co.uk/sounds/play/p0lx1wv0?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T20:45:00.000Z",
      "summary_90w": "",
      "raw": "Can Trump stop the war in Ukraine?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "58317c20d65f7e97b048b1aed22731c6d41f755b",
      "title": "US government is reportedly in discussions to take stake in Intel",
      "url": "https://techcrunch.com/2025/08/14/u-s-government-is-reportedly-in-discussions-to-take-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T20:38:20.000Z",
      "summary_90w": "",
      "raw": "This deal would be meant to help Intel bulk up its U.S. chip manufacturing, including its much-delayed Ohio factory.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b496f6ddb830a6861f17c48a354336ffcc3871a",
      "title": "What is Bluesky? Everything to know about the X competitor",
      "url": "https://techcrunch.com/2025/08/14/what-is-bluesky-everything-to-know-about-the-x-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:59.000Z",
      "summary_90w": "",
      "raw": "We’ve compiled the answers to some of the most common questions users have about Bluesky.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7cedea8287c90818e33157aacce663554f41001",
      "title": "The wait is almost over: The 2025 Startup Battlefield 200 list drops August 27",
      "url": "https://techcrunch.com/2025/08/14/the-wait-is-almost-over-the-2025-startup-battlefield-200-list-drops-august-27/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:46.000Z",
      "summary_90w": "",
      "raw": "After reviewing thousands of groundbreaking applications from around the globe, TechCrunch is just days away from announcing the 2025 Startup Battlefield 200.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4bb7fbbf22261c69523d382527bfb7191ed2fb96",
      "title": "Blackwater founder Erik Prince to send hundreds of fighters to strife-torn Haiti",
      "url": "https://www.theguardian.com/world/2025/aug/14/erik-prince-blackwater-haiti",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:19:48.000Z",
      "summary_90w": "",
      "raw": "Critics say Vectus Global’s presence – including snipers – will undermine Haiti’s police and UN security force\nHundreds of combatants from the US, Europe and El Salvador will reportedly be deployed to Haiti in the coming weeks to battle the country’s gangs as part of a mission led by the controversial Blackwater founder and Donald Trump backer Erik Prince.\nAccording to Reuters, Prince’s new security firm, Vectus Global – which has been operating in the violence-ravaged Caribbean country since March – is preparing to intensify its activities there to help authorities win key roads and territories back from heavily armed criminal groups.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb7740c574fe5c26e6a4a4f6088a00a2dd90b12a",
      "title": "FBI returns stolen document signed by conquistador Hernán Cortés to Mexico",
      "url": "https://www.theguardian.com/world/2025/aug/14/hernan-cortes-document-mexico",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:04:07.000Z",
      "summary_90w": "",
      "raw": "US officials did not say who had the 16th-century page that was missing from Mexico’s archives for decades\nNearly five centuries after Spanish conquistador Hernán Cortés signed it and decades after someone swiped it from national archives, a priceless manuscript page has been returned by the FBI to Mexico.\nThe document contains a detailed accounting of the logistics related to Cortés’s journey to what eventually became New Spain – a territory that stretched from Central America to modern-day Washington state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6befc5e77a703e2b37e89f0330b9cb6c5d85306",
      "title": "Ancient manuscripts return to Timbuktu 13 years after jihadist takeover",
      "url": "https://www.theguardian.com/world/2025/aug/14/timbuktu-manuscripts-taken-to-bamako-to-protect-them-from-jihadist-militants-returned",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T13:37:28.000Z",
      "summary_90w": "",
      "raw": "Malian city welcomes return of hundreds of crates of treasures after more than a decade stored in capital Bamako\nPolitical and religious figures in Malian city of Timbuktu have welcomed the return of ancient manuscripts that were removed to the capital, Bamako, more than a decade ago to prevent them from falling into the hands of militants linked to al-Qaida.\nAccording to a UN expert mission, jihadists destroyed more than 4,000 manuscripts and as many as nine mausoleums after occupying the desert city in 2012. Workers at the state-run Ahmed Baba Institute used rice sacks to smuggle the remaining documents out of the city a number of ways, including by donkey cart and motorcycle.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e8843b0baa539760fd10984836e3f8ccfbaa73a",
      "title": "Relationship and new album - what we learned from Taylor Swift on Travis Kelce's podcast",
      "url": "https://www.bbc.com/news/articles/cedv5dy9v8lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:27:37.000Z",
      "summary_90w": "",
      "raw": "The pop superstar gives a rare insight into their life together and reveals details of her new album.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "829ac3fbd98d53cfadf9e76a9cccdd391cf6a96a",
      "title": "What it was like for one NPR newscaster to go on an AI date",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500249/what-it-was-like-for-one-npr-newscaster-to-go-on-an-ai-date",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T08:58:28.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1989. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3edbb9d58950b43fecbd6568879ea86ec6078020",
      "title": "Joan: the razor-sharp-tongued first lady of laughter",
      "url": "https://www.bbc.co.uk/iplayer/episode/m0022vtz/joan-rivers-at-the-bbc?at_mid=bTHmrampYq&at_campaign=Joan_Rivers_at_the_BBC&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0022vtz&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Joan_Rivers_at_the_BBC&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2024-09-08T22:01:11.000Z",
      "summary_90w": "",
      "raw": "Katherine Ryan presents a celebration of the razor-sharp-tongued first lady of laughter.",
      "topics": [
        "World"
      ]
    }
  ]
}