{
  "version": "1755969166883",
  "generatedAt": "2025-08-23T17:12:46.883Z",
  "items": [
    {
      "id": "ee3448af06a6b375c324d8af12fc3f136c9eaac8",
      "title": "'A creative and explosive talent' - Eze signs for Arsenal",
      "url": "https://www.bbc.com/sport/football/articles/c5y077p4z7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T16:44:11.000Z",
      "summary_90w": "",
      "raw": "Arsenal complete the signing of England forward Eberechi Eze from Crystal Palace.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8de20f7d3dd96a09a2c2d749183d4c788582bca4",
      "title": "Bose’s compact TV Speaker is more than $100 off right now",
      "url": "https://www.theverge.com/tech/764496/bose-tv-speaker-soundbar-8bitdo-ultimate-2-bluetooth-controller-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-23T16:41:24.000Z",
      "summary_90w": "",
      "raw": "Bose’s entry-level soundbar features a compact design, making it a great fit for small bedrooms. | Image: Bose\t\n\nIf you’re looking to upgrade your movie night, a soundbar is an easy way to beef up the audio. While there are some high-priced options out there, you don’t have to spend a lot to actually hear a movie’s dialog. Right now, the Bose TV Speaker is down to $163.45 (about $115 off) at Amazon, the lowest price we’ve seen yet.\nBose TV Speaker\n\nWhere to Buy:\n\n $279 $163.45 at Amazon\n $279 $199 at Bose\n $279 $199.99 at Best Buy\n\nThe Bose TV Speaker is a solid starter soundbar that can easily integrate into existing setups with a simple one-cable connection (via optical or HDMI). At under 24 inches wide and around two inches tall, the soundbar features a small footprint, yet it delivers a rich, immersive sound thanks to its three-speaker setup. For more bass, you can press the “Bass” button on the remote, while a dedicated dialogue mode further elevates what people are saying, allowing you to finally turn off the subtitles.\nAdditionally, the Bose TV Speaker has Bluetooth connectivity, so you can use the soundbar to listen to music or podcasts. While it lacks more premium features like Dolby Atmos, Bose offers some of our favorite noise-cancelling headphones and earbuds, so you can expect a similar level of quality in its home audio products.\nOther weekend discounts\nTwelve South’s 4-foot PowerCord is currently down to an all-time low of $26.86 (about $13 off) at Amazon. The PowerCord combines a USB-C cable and a 30W wall adapter, so you no longer need to carry them separately. It supports Power Delivery 3.0, providing fast charging to the latest smartphones — it can charge an iPhone 16 from 0 to 55 percent in just 30 minutes. Meanwhile, the PowerCord features a durable braided cable that connects to the bottom of the adapter, so it doesn’t awkwardly poke out from the wall.\nThere are several great controllers for the Nintendo Switch 2 beyond the Switch 2 Pro Controller. One of them is the 8BitDo Ultimate 2 Bluetooth Controller, which is currently down to $59.99 ($10 off) at Amazon — a few bucks more than the all-time low we saw over Prime Day. The controller packs more reliable TMR joysticks, Hall effect triggers, extra R4 / L4 bumpers, and rear paddle buttons. It also comes with a 2.4GHz dongle and charging dock, making the controller easy to charge between gaming sessions.\nIf you’re not quite ready for a full-fledged smartwatch, the Casio G-Shock Move DW-H5600 is a nice compromise — and it’s currently down to $183.72 (about $115 off) at Amazon, the best price we’ve seen all year. The DW-H5600 includes a sensor that can measure your heart rate, sleep, blood oxygen levels, and active time. It can also feed you basic smartphone notifications, so you can keep tabs on incoming calls and emails.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7946ba40e34d53f61418f99826728394b018aeae",
      "title": "Asylum hotel protesters met by counter-demonstrators across UK",
      "url": "https://www.bbc.com/news/articles/ce35pd9q2ldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T16:32:31.000Z",
      "summary_90w": "",
      "raw": "Protests over the use of hotels for housing asylum seekers and counter protests have been taking place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8e6575dd0308f9f931cf4375d96a87e4d375f2b",
      "title": "Pentagon fires intelligence agency chief after Iran attack assessment",
      "url": "https://www.bbc.com/news/articles/c2dj217z2w6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T16:24:47.000Z",
      "summary_90w": "",
      "raw": "The firing comes just weeks after a White House rebuke of a leaked intelligence report assessing the impact of US strikes on Iran.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c85a3f28d533cbd06aaa49118060fadb371eaaf",
      "title": "Emily in Paris assistant director dies ‘suddenly’ during filming",
      "url": "https://www.bbc.com/news/articles/crm4ppe9x31o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T16:12:59.000Z",
      "summary_90w": "",
      "raw": "Local media named the man as 47-year-old Diego Borella, an assistant director on the show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "640974c515df0f642dd42a1e60792ba5098d8da8",
      "title": "Scotland stun Wales with record six-try show of solidarity",
      "url": "https://www.bbc.com/sport/rugby-union/articles/c99ml5zmx9jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T16:10:19.000Z",
      "summary_90w": "",
      "raw": "Scotland cast aside off-field issues to claim their biggest winning margin against Wales in their crunch World Cup opener.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55e29957a5eb3bc49b955bb79cafdb1a75ff1337",
      "title": "The Trump administration’s big Intel investment comes from already awarded grants",
      "url": "https://techcrunch.com/2025/08/23/the-trump-administrations-big-intel-investment-comes-from-already-awarded-grants/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-23T16:07:30.000Z",
      "summary_90w": "",
      "raw": "While Intel says the government is making an “$8.9 billion investment in Intel common stock,”   the administration does not appear to be committing new funds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf9b5982589166623a19906f5fb5dd66ad1ac94c",
      "title": "Trump administration halts work on an almost-finished wind farm",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513919/trump-stops-offshore-wind-renewable-energy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T15:38:19.000Z",
      "summary_90w": "",
      "raw": "The Revolution Wind farm was slated to start sending power to homes and businesses in Rhode Island and Connecticut starting next year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b9920e3d1c6a4ec77905356ceff0d85fb4bdac1",
      "title": "Turkish first lady appeals to Melania Trump over Gaza children",
      "url": "https://www.bbc.com/news/articles/cn47ppy382wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T15:38:08.000Z",
      "summary_90w": "",
      "raw": "In a letter, Turkey's first lady asks Mrs Trump to appeal to Israel to end the war in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf9b9a38554ac35a098d931e3e4c09596a93ff7a",
      "title": "Watch: Hot air balloon lands in residential street",
      "url": "https://www.bbc.com/news/videos/c4gm8jvl2e7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T15:30:56.000Z",
      "summary_90w": "",
      "raw": "A large balloon lands in a residential street lined with cars and telegraph poles and wires.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "79f760f26d18c505a5b866ee4b7b0daa4535310f",
      "title": "'Is Trafford really top drawer?' - Guardiola's keeper conundrum",
      "url": "https://www.bbc.com/sport/football/articles/czr62er2035o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T15:24:30.000Z",
      "summary_90w": "",
      "raw": "James Trafford's performance in the home loss against Tottenham has given Pep Guardiola a decision to make on his number one goalkeeper.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "652ab4ef1b5f749b113648d4054fa8842313efd0",
      "title": "UK to bask in 30C heat on bank holiday Monday",
      "url": "https://www.bbc.com/news/articles/cj6yp0j7znxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T15:19:41.000Z",
      "summary_90w": "",
      "raw": "The weekend weather will be largely dry and cloudy before a return to wind and rain from Tuesday",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f4e15e9fd451e9aa53ab3ddd19357d7e8d8f217",
      "title": "US seeks to deport Kilmar Abrego Garcia to Uganda",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513937/us-deport-kilmar-abrego-garcia-uganda",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T15:19:41.000Z",
      "summary_90w": "",
      "raw": "Immigration officials said they intend to deport Kilmar Abrego Garcia to Uganda after he declined an offer to be deported to Costa Rica, according to a Saturday court filing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b74b2f0b44c968f9439b87008ab15f184170776b",
      "title": "Villiers' 'sensational' caught and bowled leaves Tufnell shocked",
      "url": "https://www.bbc.com/sport/cricket/videos/cqleppxx0p3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T15:14:02.000Z",
      "summary_90w": "",
      "raw": "Watch Phil Tufnell's reaction to Mady Villiers catch off her own bowling to dismiss Georgia Redmayne.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ef225889f986ca4f1fd3b97e4a4218e62fa21d8",
      "title": "Three people in life-threatening condition after restaurant 'arson attack'",
      "url": "https://www.bbc.com/news/articles/cj6ypd547j8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T15:07:55.000Z",
      "summary_90w": "",
      "raw": "Three of those injured are in a life-threatening condition following the blaze in east London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67d0f0b89ce9dcef099506ba16dd7a75dec583fa",
      "title": "What&#8217;s on your desk, Dominic Preston?",
      "url": "https://www.theverge.com/tech/762930/home-office-logitech-standing-desk",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-23T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Not all of  The Verge’s staff live in the US. For example, news editor Dominic Preston is based in London and is, as he says, “responsible for keeping our news coverage ticking over in UK mornings before the US team comes online.” He also curates our new Verge Daily newsletter and covers Android phones, especially all the models that don’t launch in the US. \nAnd outside of work? “I’m a bit of a food obsessive,” he says, “and run a newsletter called Braise where I review London restaurants and cookbooks, and occasionally try my own hand at recipe writing. That means I spend most of my free time cooking, eating, or thinking about food, and so also a decent amount of time in the gym trying to make up for that.” \nWhere is your workspace located?\nThis is an office that I share with my partner in our flat in London. It used to be a second bedroom, but now we’ve kitted it out with two desks and a sofa bed for the occasional times we actually have guests to stay. My partner is a PhD student, so her working hours are a bit unpredictable, and split between here and school — which means that 90 percent of the time I’ve got the office to myself.\nCould you tell us about your desk(s)?\nWe both have standing desks. Mine is an Autonomous SmartDesk 2 that’s electronic and automatic, hers an old pneumatic model by Bakker Elkhuizen that they don’t make anymore, which annoys her because it requires a bit of effort to shift up and down. They’re both decorated with self-healing cutting mats, which are still occasionally used for arts and crafts (or as the backdrop for my product photos) but mostly double as giant mouse mats.\nYou have both a chair and a walking station. What are they, and how well do they work for you?\nThe chair is a secondhand Herman Miller. It actually used to be my partner’s, while I sat in a big Duelhawk Jet Black PU gaming chair (also no longer available), until we each realized we preferred the other’s seat and swapped. I’m old enough, and sore enough, to be willing to invest a little in the chair I’ll be using every day anyway.\nThe walking pad is a pretty cheap one from Mobvoi. I actually bought it immediately after reading a piece by my colleague Victoria Song on a different Mobvoi model, and following her advice I’ve made no attempt to touch its smart features or track my workouts; so far it’s served me well. I just use it as slow as it goes, and try to spend as much of every morning walking on it as possible — on a good day I’ll rack up two or three hours of steady walking time; on a bad day I’ll keep putting it off until the coffee hits and never quite get going. Either way, I let myself sit down for the afternoon, which is more likely to be concentrated writing time — I find it hard to do anything too creative or complicated while walking at the same time.\n(I know, I know, my cable management isn’t great. I tend to be very tidy, but cables are one of the few things I absolutely don’t have the patience to organize. Sadly, having a standing desk really lays bare those sins, so I may have to force myself to get better about it.)\n\n\n\n\nHere’s the long one: tell us about the various tech devices you’re using. \nMy current setup is slightly awkwardly trapped between my work and personal computers, though I have some plans in the works to improve it.\nMy work machine is an M2 MacBook Air, which lives propped up on a Ugreen laptop stand. It’s connected to the monitor on the right, a cheap 24-inch QHD Philips model that I bought in 2020. \nThe confusing part of my setup is that second monitor, an embarrassingly old Acer one. That’s because I’ve also got a desktop PC that I use outside of work, and that connects to both monitors. At the end of the work day I can flip the MacBook shut, and my personal setup is good to go. It’s all unnecessarily cluttered, though, especially since the MacBook can’t support both external monitors at once, so this year’s big upgrade will probably be a 32-inch 4K monitor to replace the pair of them. I’ll happily take any recommendations from the comments!\nMy keyboard is the Logitech MX Keys S, which I love. I’m as much of a sucker for a good mechanical board as the next guy, but I love low-profile, full-size keyboards, and good mechanical options in that space are few and far between. I used to use a Hexgears Venture, but I ran it into the ground eventually, and this has served me well since.\nLogitech MX Keys S\n\nWhere to Buy:\n\n $129.99 at Amazon\n $129.99 at Best Buy\n $129.99 at Logitech\n\nThe mouse is also Logitech, though it isn’t my usual one. I picked up this MX Anywhere 3S a while back to use when I’m traveling to trade shows and product launches, and usually have the larger MX Master 3S on my desk. Sadly the left button on that has given up the ghost, and I’m holding off on replacing it in the hopes that the long-rumored MX Master 4 is about to launch.\nContinuing the Logitech theme (I’m just now realizing quite how much of my desk setup was built by them), I have an old Z337 2.1 speaker system that just barely fits on the desk right now (another reason I need to switch to a single monitor), and a Brio 500 webcam that I mostly like for how easy it is to flip the built-in privacy shutter.\nEverything connects up through an Anker Prime USB hub that’s almost certainly more powerful than I need it to be, but has lots of front-facing USB ports for charging my array of phones, helped by a Xiaomi 50W wireless charging stand, which made more sense when I was using a Xiaomi 14 Ultra as my main phone, but is slightly wasted now — other phones don’t hit that max charging speed.\nAnker Prime Charging Docking Station\n\nWhere to Buy:\n\n $269.99 $169.99 at Amazon\n $269.99 $169.99 at Anker (with code WS7DV27TLOVQ)\n\nI tend to have a rotating cast of phones floating around my desk, though this is relatively tidy for me — on messy days I can have up to five or six handsets taking up space. Beyond the Vivo X200 Ultra I used to take these photos, you can see the Fairphone 6 and Huawei Pura X, the two phones I’ve most recently been testing for reviews. \nTell us about your camera collection.\nI decided I wanted to try out film photography back in 2019, because I was spending a lot more time writing about cameras as part of my phone reviews and using cameras as part of my job. I figured film would be a good way to make myself learn more about the core principles. \nI picked up this Canon EF on eBay. It’s a ’70s SLR with a metal body, which means it’s heavy but is built like a tank — I suspect it will outlast me. It came with a Canon 50mm lens, and I’ve gradually picked up a few cheap options to go with it: a 28mm wide-angle, a 35-70mm for when I want flexibility, and a 70-210mm telephoto I bought specifically for a safari in Kenya a couple years back. I always tell myself I’ll buy better-quality lenses when I’m a good enough photographer to get the most out of them, but I’ll probably just have to bite the bullet eventually.\nThe microphone living alongside them all is the Rode NT-USB, which I use for podcasts and videos, though I’d like to get a boom arm for it so I can store it around the desk.\nYou’ve got a lot of toys and games on those shelves! How long have you been collecting them?\nThis is a really motley assortment of things I’ve collected over the years — some bought, some gifted, some acquired from an old office clearout. There’s more dotted around the rest of my apartment, though my girlfriend is on an (understandable) mission to concentrate it all in the office.\nDo you have any favorites?\nI’m an absolute Alien obsessive, and I actually have two full-size facehuggers, one plushie and one vinyl, which I adore. There’s also a (sadly not full-size) power loader from Aliens, which I can’t get enough of. Elsewhere in the apartment I have a few original ’90s Street Sharks and Small Soldiers action figures, which are still waiting for the right shelf to display them on.\nThe board game collection is small but steadily growing. I’ve been playing a lot of Gloomhaven over the last year or so, though Betrayal at House on the Hill is probably the game that gets broken out most often. I’ve also got a healthy collection of D&D 5e and Alien RPG sourcebooks — I can strongly recommend the latter, and that’s not just the fanboy in me speaking!\nOkay, tell us about that beautiful cat. \nThat’s Noodle, one of our two cats (the other is Loaf, and yes, of course they have an Instagram account).\n\nNoodle doesn’t mind when the standing desk rises.\n\nShe’s actually a recent addition to my desk. We’ve had the cats for a couple of years, but in the last few months Noodle has decided she really wants to hang out with me while I work, and will happily lie down on my keyboard to do so. We set her up with a little blanket bed instead, which she now sleeps in about half the day, though she still isn’t above a keyboard nap when the mood strikes. The biggest surprise to me is that she doesn’t seem to mind the standing desk going up or down while she’s on it, which I expected would cause a bit of panic.\nPhotographs by Dominic Preston / The Verge",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b88987adbebe66609d556ad8bca6af4136044ad",
      "title": "Emmett Till lynching records unveil government response",
      "url": "https://www.bbc.com/news/articles/cdd3pnjzj6eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T14:11:27.000Z",
      "summary_90w": "",
      "raw": "The records shed light on the investigation of the black teenager's death, which galvanised the US civil rights movement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efbfe2e90e6af4b69dccfad4a51002d5ac218782",
      "title": "Ghislaine Maxwell denies seeing 'inappropriate' conduct by Trump",
      "url": "https://www.bbc.com/news/articles/cdd3pe6189go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T14:01:15.000Z",
      "summary_90w": "",
      "raw": "Maxwell was interviewed after pressure on Trump to release information about whether prominent figures were involved in Jeffrey Epstein's crimes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb241102b131a29ca78891e41bcb96263b29fa26",
      "title": "More Palestinians die of starvation as famine spreads in Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/23/israel-gaza-famine-middle-east-latest-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T14:00:02.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed, you can read more on this story here\nThe head of the World Health Organization (WHO) has called for an urgent scale-up of evacuations from Gaza, warning that more than 15,600 patients remain in need of specialised care.\nIn a post on X, WHO director-general Tedros Adhanom Ghebreyesus thanked the UAE for supporting the latest evacuation of critically injured and sick patients but stressed that far more action is needed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98daf575bf373074762919bfaa996710c9e4b8ad",
      "title": "First trans comedian to win Edinburgh comedy award",
      "url": "https://www.bbc.com/news/articles/cvgvz090195o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T13:57:13.000Z",
      "summary_90w": "",
      "raw": "Sam Nicoresti took the esteemed award for their show Baby Doomer, while Ayoade Bamgboye won the award for best newcomer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61987369750f9c83a0ea7ba631b29bc3fc8b0627",
      "title": "Hawaii's Kilauea volcano erupts again and shoots lava for 31st time since December",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513910/hawaii-kilauea-volcano-erupts-again-shoots-lava",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T13:36:49.000Z",
      "summary_90w": "",
      "raw": "Hawaii's Kilauea volcano resumed erupting Friday by shooting an arc of lava 100 feet into the air and across a section of its summit crater floor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2fbd9d8c00d2cf6a007e629f63fdca396d8852e",
      "title": "The Fairphone 6 no longer feels like a compromise (except in the US)",
      "url": "https://www.theverge.com/phones/762755/fairphone-6-review-no-longer-compromise",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-23T13:30:00.000Z",
      "summary_90w": "",
      "raw": "The Fairphone 6 arrives almost two years after the 5, a testament to the company's approach to the upgrade cycle. If anything, I suspect the company would be frustrated if Fairphone 5 owners were considering a new model already - these are phones to keep, to repair, and to hold on to until the bitter end.\nThe newest Fairphone continues the company's commitment to user-repairability, long-term customer support, and ethical production. That means compromises for the consumer: You'll find more powerful phones with prettier displays and more capable cameras for less money. But this year those compromises are smaller and easier than ever before, …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0c5a6498b95a5366dffdd473751ad4d91beb799c",
      "title": "Family of UK aid volunteer reportedly killed in Ukraine ‘disappointed’ by Foreign Office",
      "url": "https://www.theguardian.com/uk-news/2025/aug/23/family-british-aid-volunteer-reportedly-killed-ukraine-donbas-foreign-office",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T13:22:09.000Z",
      "summary_90w": "",
      "raw": "Relatives of Annie Lewis Marffy in ‘red-tape limbo’ over recovery of her body and issuing of death certificate\nThe family of a British aid volunteer reportedly killed in a drone strike in Ukraine said they were very disappointed by the reaction from the Foreign Office.\nAnnie Lewis Marffy, 69, travelled from her home in Silverton, near Exeter in Devon in late May to deliver supplies packed into a green Toyota Rav4 in a mission arranged by the non-profit organisation Aid Ukraine UK. She was to take the vehicle in convoy with a British volunteer to Kramatorsk in the contested Donbas region.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8757e36cb771cbfc4f97c8a86600b89c0829b7c",
      "title": "Ninja Gaiden: Ragebound is a perfect reimagining of the classic series",
      "url": "https://www.theverge.com/games-review/716421/ninja-gaiden-ragebound-review-nintendo-switch-playstation-xbox-pc",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-23T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Ninja Gaiden is having a renaissance. The last mainline entry was originally released more than a decade ago, but by the end of 2025, there will be three new Ninja Gaiden titles. Two are 3D: Ninja Gaiden 2 Black, a modern-day remaster of Ninja Gaiden II released earlier this year, and Ninja Gaiden 4, co-developed by PlatinumGames and set to release in October. But there's a new 2D game, too. Ninja Gaiden: Ragebound is a retro-styled side-scrolling platformer from Dotemu and the developers of Blasphemous - and it absolutely rips.\nIn Ragebound, you play as Kenji Mozu, a young ninja trained by usual series star Ryu Hayabusa. Early on, Kenji's  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ea264f0c19ce40fd18a24c94699cc42dc20531d",
      "title": "Woman jailed for race hate post says she was political prisoner",
      "url": "https://www.bbc.com/news/articles/ce83pj1ggmeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T12:40:08.000Z",
      "summary_90w": "",
      "raw": "She gives her first newspaper interview after being released from prison.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89d9a814f2a161db038ee6c95aa02baba0229874",
      "title": "‘We want builders on site, not filling in forms’: Albanese government cuts red tape in bid to boost home building",
      "url": "https://www.theguardian.com/australia-news/2025/aug/23/we-want-builders-on-site-not-filling-in-forms-albanese-government-cuts-red-tape-in-bid-to-boost-home-building",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T12:30:01.000Z",
      "summary_90w": "",
      "raw": "Pausing changes to Construction Code, establishment of ‘strike team’ within environment department and use of AI in planning among reforms\n\nGet our breaking news email, free app or daily news podcast\n\n\nThe Albanese government has promised to cut red tape and fast-track environmental approvals for new homes in an effort to address Australia’s housing crisis.\nOn Saturday, the government announced plans to pause further residential changes to the National Construction Code and to streamline the assessment of more than 26,000 homes under the Environment Protection and Biodiversity Conservation Act.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eac1e43d5d6e5dea0b576bcc07fb6544d38fde7a",
      "title": "Opinion: Wardrobe diplomacy",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5504862/opinion-wardrobe-diplomacy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Months after his explosive meeting at the White House, Ukrainian President Volodymyr Zelenskyy returned this week wearing a black blazer. His dress last time invited criticism from Trump supporters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "414a12ca785ad96073abd46a56b6ecb31d8ac5a9",
      "title": "Will Trump help 4Chan escape the UK’s internet police?",
      "url": "https://www.theverge.com/politics/764653/4chan-uk-online-safety-act-trump",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-23T12:00:00.000Z",
      "summary_90w": "",
      "raw": "After the United Kingdom began enforcing its sweeping Online Safety Act in April, British regulator Ofcom served violation notices to three notorious sites: 4chan, Gab, and Kiwi Farms, each of which risked multimillion-dollar fines. Late last week, Preston Byrne, a First Amendment lawyer representing them, struck back. Byrne announced he would sue Ofcom in US federal court and added an unusual request. He called on the Trump administration \"to invoke all diplomatic and legal levers available to the United States\" to protect his clients from the OSA's reach.\nByrne's request could put a trio of sites known as hotbeds of violence, harassment,  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "51d93dae3a6d9e6c9840ee306d60efcc254b277c",
      "title": "How international students feel arriving on campus after the revamped visa process",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509921/international-students-on-campus",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T11:47:41.000Z",
      "summary_90w": "",
      "raw": "International students from around the world are arriving on American college campuses after a very rocky summer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c54a09c83b5292ff2b297655b572da882af6789e",
      "title": "Tinted sunscreen does something regular sun protection can't",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5507260/hyperpigmentation-tinted-sunscreen-protection",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Most sunscreens protect skin from UV light but the tinted variety also block visible light. And that can be important for people with hyperpigmentation or melasma, especially those with darker skin.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "796c73e91639a0d325246f2b853ba6b64b059a3c",
      "title": "Photos: The perilous lives of miners in South Africa's abandoned mines",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/23/g-s1-82257/photos-miners-abandoned-mines-south-africa",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T10:53:19.000Z",
      "summary_90w": "",
      "raw": "'Artisanal miners' is the phrase used for South Africans who salvage coal from abandoned mines. It's a grueling and risky life. \"Bit by bit it's killing something inside me,\" says one such miner.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f11d5a93b2c86552d7e8aaa1a4681f0141b6a11e",
      "title": "Dutch foreign minister quits over failure to secure sanctions against Israel",
      "url": "https://www.theguardian.com/world/2025/aug/23/netherlands-foreign-minister-sanctions-israel-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T10:22:45.000Z",
      "summary_90w": "",
      "raw": "Caspar Veldkamp resigns after cabinet reaches deadlock on adopting harsher measures over situation in Gaza\n\nMiddle East crisis live: latest updates\n\nThe Dutch foreign minister, Caspar Veldkamp, has resigned after a cabinet meeting failed to secure sanctions against Israel, weakening the Netherlands’ already fragile caretaker government.\nVeldkamp’s colleagues from the centrist New Social Contract (NSC) party also walked out after the cabinet debate late on Friday reached an impasse over adopting harsher measures against Israel.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "219a1700dbfa71a6f9ccb5049c6ec186ae6086d6",
      "title": "Man who alleged hundreds were raped and buried in Indian temple town arrested",
      "url": "https://www.bbc.com/news/articles/cgm2z9zjgx7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T09:31:01.000Z",
      "summary_90w": "",
      "raw": "The former temple cleaner's startling claims threw the town of Dharmasthala in Karnataka into turmoil.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "85e61841c1e7a92a941c0251eef349d6f58c963c",
      "title": "Trump makes over the Rose Garden, Mar-a-Lago style",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509554/rose-garden-paved",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump has swapped out the grass in the Rose Garden with stone, turning what had been a lawn into a patio that bears a striking resemblance to one at his Mar-a-Lago resort in Palm Beach, Fla.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8d353592baf86655bde406163b5b2a0c139f801",
      "title": "Farage vows mass deportations to tackle small boats",
      "url": "https://www.bbc.com/news/articles/c9vd3rx33g1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T08:38:04.000Z",
      "summary_90w": "",
      "raw": "Plans outlined by the Reform UK leader would see the country taken out of the European Convention on Human Rights.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32e06b02508cbc127fa04d65f5e75f408c8f176d",
      "title": "What did Erik and Lyle Menendez do and when could they be released?",
      "url": "https://www.bbc.com/news/articles/c5y2dgep4zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T08:37:41.000Z",
      "summary_90w": "",
      "raw": "Lyle and Erik Menendez have been denied release by separate parole boards this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32e06b02508cbc127fa04d65f5e75f408c8f176d",
      "title": "What next for Menendez brothers after parole bids rejected",
      "url": "https://www.bbc.com/news/articles/c5y2dgep4zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T08:37:41.000Z",
      "summary_90w": "",
      "raw": "Lyle and Erik Menendez have been denied release by separate parole boards this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "01eefb9f438b2cd2477efff7b3d34b2ce98d7b78",
      "title": "Five dead in bus crash after Niagara Falls tour",
      "url": "https://www.bbc.com/news/articles/cm2kp312ryxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T07:23:44.000Z",
      "summary_90w": "",
      "raw": "Police say most of the victims are tourists from India, China and the Philippines.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fe3c7696b77c20608e1d90a6cb80e655d8eefc9",
      "title": "Why California and Texas are at the centre of a redistricting battle",
      "url": "https://www.bbc.com/news/articles/cdxydpr1zz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T06:13:57.000Z",
      "summary_90w": "",
      "raw": "The two most populous states are in a political battle poised to have a major impact on the balance of power in Washington DC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a38c85b8feafb2c61e1972d3502862fd674c56b6",
      "title": "'A loan from nan started my business - it's now made £71m'",
      "url": "https://www.bbc.com/news/articles/c5y2vdlm8xgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T05:58:42.000Z",
      "summary_90w": "",
      "raw": "Paige Louise Williams opened her first salon in 2014 - now the business is set to turn over £138m.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d15c41976a1ad3121ab38beb992b0611eb15edb",
      "title": "David Littleproud vows to take nuclear energy to next election and claims ‘no malice’ behind brief Coalition split",
      "url": "https://www.theguardian.com/australia-news/2025/aug/23/david-littleproud-vows-to-take-nuclear-energy-to-next-election-and-claims-no-malice-behind-brief-coalition-split",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T05:58:08.000Z",
      "summary_90w": "",
      "raw": "Nationals leader rails against regional Australia becoming littered with transmission lines, solar panels and wind turbines at LNP conference\n\nGet our breaking news email, free app or daily news podcast\n\nThe Nationals are vowing to introduce nuclear power to Australia’s energy mix, promising to take the policy to the next election after it contributed to a split in the Coalition.\nNationals leader David Littleproud explained to party faithful on Saturday what led to his party’s week-long decoupling from the Liberals following the May federal election rout.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "79573e9c21daaa18eff757ac056f5dd07a8d2b8d",
      "title": "‘These are Ukrainian lands’: people in Donetsk pour scorn on Putin’s territorial demands",
      "url": "https://www.theguardian.com/news/ng-interactive/2025/aug/23/ukraine-donetsk-putin-territorial-demands",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T05:00:56.000Z",
      "summary_90w": "",
      "raw": "In Kramatorsk, 12 miles from the frontline, daily life goes on amid the constant threat of attacks\nIn a branch of the Ukrainian coffee chain Lviv Croissants in the frontline city of Kramatorsk, there is a noticeboard where people leave coloured Post-it notes with simple hand-drawn messages. One just says “Kramatorsk”, with red hearts below and a yellow and blue semi-circular fan above, the colours of Ukraine.\nAmong those looking at the notes is Bohdan, a 26-year-old, who has been serving in the army for the past three years. The soldier, now in logistics, has chosen to spend his one day off in Kramatorsk with his dog Arnold to photograph for himself recent Russian bombing on a city where he was based for 18 months.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5368bb9bb8544d5e2f5cf9654b8fef6fa70ab853",
      "title": "South Korea fires warning shots at North Korean troops crossing border",
      "url": "https://www.bbc.com/news/articles/cn85pvv13e8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T04:54:25.000Z",
      "summary_90w": "",
      "raw": "Pyongyang's state media call the shots a \"deliberate provocation\", as the South Korean leader begins visit to US and Japan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T04:45:02.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "475ba42225719a86735ff6e4e6fd401f4608db74",
      "title": "Judge blocks Trump from cutting funding over 'sanctuary' policies",
      "url": "https://www.npr.org/2025/08/23/g-s1-84863/judge-blocks-trump-from-cutting-funding-sanctuary-cities",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-23T04:10:12.000Z",
      "summary_90w": "",
      "raw": "A judge ruled the Trump administration cannot deny funding to Boston, Chicago, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43a134db32c1cca53b9d6a814b8d2951936b74e0",
      "title": "North Korea accuses South Korea of ‘deliberate provocation’ after warning shots fired at soldiers on border",
      "url": "https://www.theguardian.com/world/2025/aug/23/north-korea-accuses-south-korea-of-deliberate-provocation-after-warning-shots-fired-at-soldiers-on-border",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T04:09:47.000Z",
      "summary_90w": "",
      "raw": "Seoul says military fired warning shots on Tuesday after troops from the North briefly crossed border\nSouth Korea fired warning shots at North Korean soldiers who briefly crossed the heavily fortified border earlier this week, Seoul said on Saturday, after Pyongyang accused it of a “deliberate provocation” that risks “uncontrollable” tensions.\nSouth Korea’s new leader Lee Jae Myung has sought warmer ties with the nuclear-armed North and vowed to build “military trust”, but Pyongyang has said it has no interest in improving relations with Seoul.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9c5641f5398b38da2984631b86a56c92ed3a57c",
      "title": "‘We’re publicans’: County Limerick community forms syndicate to save village’s last pub",
      "url": "https://www.theguardian.com/world/2025/aug/23/ireland-county-limerick-kilteely-syndicate-villages-last-pub",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T04:00:51.000Z",
      "summary_90w": "",
      "raw": "Group in Kilteely pooled savings to buy bar and licence and ‘everybody brought something to the table’\nA century ago, the County Limerick village of Kilteely had seven pubs but one by one they shut. This year, it braced to lose the last.\nThe economic and social trends that have shuttered family-run pubs across Ireland appear remorseless, leaving many communities with nowhere to meet, have a drink and share stories.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7abbbf9f1b948701d74d31999598539cc837d9db",
      "title": "Why India's Election Commission is facing a test of credibility",
      "url": "https://www.bbc.com/news/articles/cj9w43p7741o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T00:31:01.000Z",
      "summary_90w": "",
      "raw": "The polling monitor is facing heat over voter roll revision and allegations of vote theft, that it has denied.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "30926582c9f17eda8b186e60ae01dbdc861fe69e",
      "title": "An EV road user charge is looming. Could it slam the brakes on Australia’s clean car transition?",
      "url": "https://www.theguardian.com/environment/2025/aug/23/ev-road-user-charge-australia-electric-cars-vehicles-clean-transition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T00:00:48.000Z",
      "summary_90w": "",
      "raw": "The revenue from fuel excise is falling but it’s not only because of EVs, which make up less than 2% of cars on the roads\n\nGet our breaking news email, free app or daily news podcast\n\nEvery time a driver puts 10 litres of fuel in their car, they’re paying about $5 in tax that goes to the federal government.\nThat is, of course, unless they drive an electric vehicle. No petrol or diesel being bought means the government loses that 51c per litre.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e71843c40ffeaceed28f9da016b01cacaaf00425",
      "title": "Lobbying rules in NSW are woefully inadequate but Icac’s calls for reform keep getting ignored",
      "url": "https://www.theguardian.com/australia-news/2025/aug/23/nsw-lobbying-rules-icac-reform-ignored",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T00:00:47.000Z",
      "summary_90w": "",
      "raw": "The state’s corruption watchdog is up against the age-old dynamic of cosy relationships: no one on the inside of politics wants to change\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s parliaments aren’t just filled with MPs, staff and media – but also armies of lobbyists seeking an audience or a coffee with the people who can affect their interests with the stroke of a pen.\nMillions of dollars are at stake. Will the government rezone land? Tweak a law that makes an activity legal? Exempt an activity from tax or grant an environmental approval?\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8420bdb786773011f64661f13a012b802bd35517",
      "title": "Are young women more left wing than men - and, if so, why?",
      "url": "https://www.bbc.com/news/articles/cqxg89jzvl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T23:48:35.000Z",
      "summary_90w": "",
      "raw": "A divide appears to be opening up between young women and young men in the way they vote and view the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee1a32180e89ed7a1419b06f08cedeefed1ac9a1",
      "title": "The US teenagers wowed by African prom dresses",
      "url": "https://www.bbc.com/news/articles/cvg3dj5n7nmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T23:38:25.000Z",
      "summary_90w": "",
      "raw": "\"I felt like a Disney princess,\" says a prom goer about her dress, one of many custom-made in Nigeria.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "446d5e9f5527bf569610104a314b63888e19d06f",
      "title": "As Trump touts D.C. arrests, experts caution they're not the best indicator of public safety",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511990/trump-d-c-arrests-poor-indicator-public-safety",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-22T23:32:30.000Z",
      "summary_90w": "",
      "raw": "The Trump administration says it has arrested more than 700 people in Washington, D.C., in its mission to crack down on crime. Experts say it's difficult to draw conclusions from that about public safety.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41e6db23a56d6855172ce2896fe023ee100046c6",
      "title": "Trump's plan for DC homeless is giving San Francisco deja vu",
      "url": "https://www.bbc.com/news/articles/c2kz4d0vwlzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T23:19:47.000Z",
      "summary_90w": "",
      "raw": "San Francisco's crackdown on homelessness has transformed the city - but advocates say the root of the problem still remains.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b51e43becd214860c7323a69c1ea37ea16bca597",
      "title": "Fans loved her new album. The thing was, she hadn't released one",
      "url": "https://www.bbc.com/news/articles/clydz8d03dvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T23:12:40.000Z",
      "summary_90w": "",
      "raw": "Artists on the mystery of being targeted by fraudsters releasing \"AI slop\" songs in their name.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "81d96f63b66fb98b5688e0eb5af00c4da64b0e4d",
      "title": "'Two laptops, six plugs': The South Korean cafes grappling with students who don't leave",
      "url": "https://www.bbc.com/news/articles/c80d9e8ep7do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T23:02:12.000Z",
      "summary_90w": "",
      "raw": "As Starbucks asks some to stop bringing printers into its branches to work, what's going on?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee82357111b407af447822beac6704348b7b7c95",
      "title": "Apple accuses former Apple Watch staffer of conspiring to steal trade secrets for Oppo",
      "url": "https://www.theverge.com/news/764775/apple-watch-trade-secrets-oppo-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T22:20:31.000Z",
      "summary_90w": "",
      "raw": "Apple is suing a former employee on the Apple Watch team who left to join Oppo, alleging that he “conspired to steal Apple’s trade secrets relating to Apple Watch and to disclose them to his new employers.”\nAhead of starting his new job at Oppo, the employee, Dr. Chen Shi, attended “dozens” of meetings with technical members on the Apple Watch team to learn about their work and downloaded 63 documents “from a protected Box folder” that he loaded onto a USB drive, according to the lawsuit. Shi allegedly sent a message to Oppo saying that he was working to “collect as much information as possible” before starting his job. And he searched the internet for terms like “how to wipe out macbook” and “Can somebody see if I’ve opened a file on a shared drive?” from his Apple-issued MacBook before leaving the company.\nShi was formerly a sensor system architect at Apple, and the company says he had “a front row seat to Apple’s development of its cutting-edge health sensor technology, including highly confidential roadmaps, design and development documents, and specifications for ECG sensor technology.”\nHe now heads up a team working on sensing technology at Oppo — which Apple says it learned because of “messages he left on his Apple-issued work iPhone.” In his resignation letter to Apple, Shi said he was leaving “due to personal and family reasons.” Via that iPhone, Apple also says it found messages from Oppo demonstrating that it “encouraged, approved, and agreed to Dr. Shi’s plan to collect Apple’s proprietary information before leaving Apple.”\nWhen The Verge tried to contact Oppo for comment, the email bounced back because the mailbox was full.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d8ae4bcdd6af1a14ceec035d68061ac4692d833",
      "title": "US government takes 10 percent stake in Intel in exchange for money it was already on the hook for",
      "url": "https://www.theverge.com/news/764480/intel-donald-trump-lip-bu-tan-deal",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T21:45:38.000Z",
      "summary_90w": "",
      "raw": "Trump revealed the news during a briefing about the World Cup. | Photographer: Annabelle Gordon/UPI/Bloomberg via Getty Image\t\n\nThe US is investing $8.9 billion into Intel, but most of the funds come from money that the government was supposed to pay the embattled chipmaker anyway. In an announcement on Friday, Intel said the federal government will fund its investment using the remaining $5.7 billion in grants it hasn’t yet received under the Biden administration’s CHIPS Act, in addition to the $3.2 billion received as part of the Secure Enclave program.\nPresident Donald Trump confirmed the investment during a press briefing before the formal announcement, saying Intel CEO Lip-Bu Tan agreed to give the government a 10 percent stake. Earlier this month, Trump called on Tan to resign over his ties to China, and today he positioned the deal as a way for the executive to “keep his job.”\nTrump told reporters that he floated the offer during negotiations with Tan. “I said, ‘I think it would be good having the United States as your partner,’” Trump said. “They’ve agreed to do it, and I think it’s a great deal for them.” Intel has already received $2.2 billion under the CHIPS Act.\nThe government’s investment in Intel “will be a passive ownership, with no Board representation or other governance or information rights,” according to Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan says in the press release.\nThe confirmation of the deal comes just days after SoftBank announced plans to invest $2 billion into Intel to “further expand” chipmaking in the US. \nThe federal government’s stake in the embattled chipmaker marks yet another move that blurs the line between government and business, as reports suggest that the Trump administration has demanded that Nvidia and AMD give the government a 15 percent cut of chip sales to China.\nTreasury Secretary Scott Bessent hinted at the government’s potential investment this week, saying during an interview with CNBC that it “would be a conversion of grants” meant to “stabilize the company for chip production here in the US.”\nIt doesn’t seem like this is the end for Trump’s approach to deal-making, as he said during the briefing that “he’ll do more of them” in the future.\nUpdate, August 22nd: Added information from Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f87870a407dbf9a8df29bc574cc3e09744c0ae9b",
      "title": "Meta partners with Midjourney on AI image and video models",
      "url": "https://techcrunch.com/2025/08/22/meta-partners-with-midjourney-on-ai-image-and-video-models/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T21:41:31.000Z",
      "summary_90w": "",
      "raw": "Meta's chief AI officer said that the company is partnering with Midjourney to license its AI image and video model technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15f5ff4479424002114ed2f5b0c0fbde20cc52df",
      "title": "Chappell Roan slays Reading Festival with fairytale-themed set",
      "url": "https://www.bbc.com/news/articles/cr74p245zdlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T21:26:47.000Z",
      "summary_90w": "",
      "raw": "The US star took to the stage on Friday night, and was almost drowned out by her devoted fans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9aeae17c2c2648f56c11a0bb0b744885f0e80fa2",
      "title": "Netflix wants its partners to follow these rules when using gen AI",
      "url": "https://www.theverge.com/netflix/764433/netflix-gen-ai-production-guidelines",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T21:22:47.000Z",
      "summary_90w": "",
      "raw": "Netflix has already faced backlash over the use of AI in  What Jennifer Did, director Jenny Popplewell’s 2024 true crime documentary that seemingly used AI-generated images in place of real archival photos. That documentary stood out as a shining example of gen AI’s ability to distort reality in situations where people are specifically looking to be told the truth about something.  Now the streamer is taking steps to avoid similar problems. \nThis week, Netflix published a post on its Partner Help Center hub detailing its guiding principles regarding gen AI and the situations in which it is ok with production teams using the technology. In Netflix’s view, gen AI tools are “valuable creative aids” that make it easier for “users to rapidly generate new and creatively unique media (video, sound, text, and image).” Because the gen AI space is moving at such a breakneck pace, however, the company felt that it was important to outline the rules it expects its partners to follow if and when they use these tools.\n“To support global productions and stay aligned with best practices, we expect all production partners to share any intended use of GenAI with their Netflix contact, especially as new tools continue to emerge with different capabilities and risks,” the post explains. “Most low-risk use cases that follow the guiding principles below are unlikely to require legal review. However, if the output includes final deliverables, talent likeness, personal data, or third-party IP, written approval will be required before you proceed.”\nNetflix’s gen AI best practices are predicated on five specific guidelines that it sees as being “essential to act responsibly when employing generative workflows.” Netflix says:\nThe outputs do not replicate or substantially recreate identifiable characteristics of unowned or copyrighted material, or infringe any copyright-protected works\nThe generative tools used does not store, reuse, or train on production data inputs or outputs.\nWhere possible, generative tools are used in an enterprise-secured environment to safeguard inputs.\nGenerated material is temporary and not part of the final deliverables.\nGenAI is not used to replace or generate new talent performances or union-covered work without consent.\nNetflix also says if its partners are confident that they are following those guidelines, they only need to tell their designated company contact that they intend to use gen AI. But if partners are unsure or know that they’re not adhering to the rules, they should escalate to your Netflix contact for more guidance before proceeding, as written approval may be required.”\nThe post repeatedly stresses that while Netflix is very open to its partners using gen AI in a number of ways, it wants them to be mindful of the potential legal risks they might wander into by not running their plans by management and the company’s legal team beforehand. The post also makes a point of emphasizing that Netflix believes “audiences should be able to trust what they see and hear on screen.” And given gen AI’s potential to “blur the line between fiction and reality or unintentionally mislead viewers,” the streamer wants its partners to tread carefully.\nThough the post does not mention production costs,  all of this comes just a few weeks after Netflix co-CEO Ted Sarandos said that the company remains “convinced that AI represents an incredible opportunity to help creators make films and series better, not just cheaper.” Soon after, Sarandos began pointing to Netflix’s new Argentinian sci-fi series The Eternaut as an example of how gen AI could be used to bring a show in under budget. And now it seems like Netflix is very keen on other creative teams embracing that kind of workflow.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "980840a40ffe0d7ee2fc3079bfa4c730c2052c5e",
      "title": "Bluesky blocks Mississippi under new age verification law",
      "url": "https://www.theverge.com/internet-censorship/764697/bluesky-blocks-mississippi-age-verification-law",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T21:09:14.000Z",
      "summary_90w": "",
      "raw": "Bluesky will block access from Mississippi IP addresses in response to a new state law requiring age verification and parental consent for underage users. The decision, outlined in a blog post, will stand until courts decide the fate of the law.\n“Mississippi’s approach would fundamentally change how users access Bluesky,” says the post, in ways that rules like the UK’s Online Safety Act (which Bluesky complies with) don’t. The law, HB 1126, “would block everyone from accessing the site — teens and adults — unless they hand over sensitive information, and once they do, the law in Mississippi requires Bluesky to keep track of which users are children.” In the UK, by contrast, users are only blocked from accessing direct messages and sensitive content unless they undergo a verification process using a third-party tool. “Building the required verification systems, parental consent workflows, and compliance infrastructure would require significant resources that our small team is currently unable to spare as we invest in developing safety tools and features for our global community, particularly given the law’s broad scope and privacy implications.”\nHB 1126 is one of numerous attempts to age-gate social media in the US, but most similar laws have been blocked under court challenges as likely unconstitutional. HB 1126 went into effect thanks to an unexplained decision by the Supreme Court earlier this month, rejecting an emergency request to block it while a legal challenge progresses. A concurring opinion from Justice Brett Kavanaugh acknowledged that the law probably violated the First Amendment but said the plaintiffs had not sufficiently demonstrated harms. While the court has said that age verification can be used to block minors from accessing explicit sexual content without unduly burdening adults’ access to information, there’s no precedent extending that option to social media in general.\nNow, however, Bluesky users who log in from inside the borders of Mississippi (without a VPN, anyway) will be met with a message explaining the decision. The decision applies specifically to the Bluesky app; other apps and services on the decentralized AT Protocol will make their own calls about access.\n “Child safety is a core priority, and in this evolving regulatory landscape, we remain committed to building an open social ecosystem that protects users while preserving choice and innovation,” the post says. “We’ll keep you updated as this situation develops.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91eb6435967d44c0bafb0d147e05ee5b7fa42eb6",
      "title": "Coinbase CEO explains why he fired engineers who didn’t try AI immediately",
      "url": "https://techcrunch.com/2025/08/22/coinbase-ceo-explains-why-he-fired-engineers-who-didnt-try-ai-immediately/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T21:07:21.000Z",
      "summary_90w": "",
      "raw": "After getting licenses to cover every engineer, some at the cryptocurrency exchange warned Armstrong that adoption would be slow, predicting it would take months to get even half the engineers using AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c4eaa1375167fa1378b946b0cdf8de3e733c7e53",
      "title": "Meta is going to stuff Midjourney AI images into your feed",
      "url": "https://www.theverge.com/news/764715/meta-ai-midjourney-license-partnership",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T21:07:04.000Z",
      "summary_90w": "",
      "raw": "Meta is partnering with Midjourney to “license their aesthetic technology” for use in its own models and products, Meta’s new chief AI officer, Alexandr Wang, announced on Friday. The partnership involves a “technical collaboration between our research teams,” Wang said, suggesting the deal involves more than simply using Midjourney’s existing product across Meta services.\nWang didn’t specify the terms of arrangement. Meta spokesperson Ashley Gabriel declined to comment and pointed to Wang’s posts. Midjourney didn’t immediately reply to requests for comment. \nMeta has been investing heavily in its AI “superintelligence” efforts as of late to catch up to rivals like OpenAI and Google. Mark Zuckerberg has personally worked to poach AI researchers from other companies with humongous offers — Wang only joined Meta after it paid $14.3 billion to acquire 49 percent of Scale AI, the company he co-founded.\nThe partnership with Midjourney ties directly into Meta’s goals for AI imagery across its services. The Meta AI app is built around a feed of AI-generated images and videos. Facebook has added a button to create AI images when you go to make a new post. There are options to generate AI images within chats in WhatsApp and Instagram, too.\nMidjourney got on the map for its AI image and video generation tools. As Meta works to build out features like the Meta AI app’s social feed, it’s easy to imagine Meta relying on Midjourney’s tech to help people make better-looking photos and videos.\n“We are incredibly impressed by Midjourney,” Wang says. “They have accomplished true feats of technical and aesthetic excellence, and we are thrilled to be working more closely with them.” The two companies will share more about what they’re working on together “soon.”\nEven with the partnership, Midjourney remains “an independent, community-backed research lab” with “no investors,” founder and CEO David Holz says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd1b95dd1b7e23f812f2b958402fa4961fed5d0b",
      "title": "Will Serena Williams's weight-loss admission help shed stigma of anti-obesity drugs?",
      "url": "https://www.bbc.com/news/articles/c8de89lg21jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T20:34:35.000Z",
      "summary_90w": "",
      "raw": "Could her comments instil a new sense of confidence in those using the drugs and quieten the critics?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ee5caec71d02b629bd543e39e2e3462b7691631",
      "title": "Bluesky blocks service in Mississippi over age assurance law",
      "url": "https://techcrunch.com/2025/08/22/bluesky-blocks-service-in-mississippi-over-age-assurance-law/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T20:30:49.000Z",
      "summary_90w": "",
      "raw": "In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "553c54c9a95bf6b2f53d07fe9eac88648f9b5bef",
      "title": "Russia is trying to stop meeting on peace and prolong war, Zelensky says",
      "url": "https://www.bbc.com/news/articles/ckgjpmg4r23o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T20:27:18.000Z",
      "summary_90w": "",
      "raw": "Volodymyr Zelensky urges Western allies to impose fresh sanctions on Moscow if it shows no interest in peace.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dcaa10d0197c69cf1199ccc2d62c1205c467651f",
      "title": "Israeli children refused access to leisure park in southern France",
      "url": "https://www.theguardian.com/world/2025/aug/22/israeli-children-refused-access-to-leisure-park-in-southern-france",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T20:26:47.000Z",
      "summary_90w": "",
      "raw": "Manager of zipline facility detained for alleged religious discrimination after group of eight- to 16-year-olds turned away\nThe manager of a leisure park in southern France has been detained for alleged religious discrimination after a group of Israeli children were refused access.\nThe children, aged eight to 16, were on holiday in Spain and had made a reservation for Thursday to use the Tyrovol zipline adventure park in Porté-Puymorens, near the Spanish border in the Pyrenees mountains, the Perpignan prosecutor’s office said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2ccca2a9f1e24fd78603a20588f65ba4838eb8ef",
      "title": "Apple gets ready for AI in the enterprise with new ChatGPT configuration options",
      "url": "https://techcrunch.com/2025/08/22/apple-gets-ready-for-ai-in-the-enterprise-with-new-chatgpt-configuration-options/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T20:00:34.000Z",
      "summary_90w": "",
      "raw": "Apple will let businesses configure ChatGPT enterprise access in the fall.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d9b7f31f0f519de117855cb4577e107879ca18e1",
      "title": "How Israel's policies created famine in Gaza",
      "url": "https://www.bbc.com/news/articles/ckg4p90z1kxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T19:55:47.000Z",
      "summary_90w": "",
      "raw": "Israel has systematically obstructed food entering Gaza, aid agencies say, as a UN-backed body confirms a famine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bea0c4bd5004df61f0774b02909bdb6febf02bce",
      "title": "FBI searches home of Trump adviser-turned-critic John Bolton",
      "url": "https://www.bbc.com/news/articles/c98lre1vqn4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T19:27:21.000Z",
      "summary_90w": "",
      "raw": "Bolton served in Trump's first administration but has since become a fierce critic of the president.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5fac4c3a5adee8cb44f56604f6799c0ef28d4c3a",
      "title": "US government plans to take a 10% stake in Intel",
      "url": "https://techcrunch.com/2025/08/22/u-s-government-plans-to-take-a-10-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T19:14:36.000Z",
      "summary_90w": "",
      "raw": "Such federal government ownership of a major corporation would mark a dramatic departure from long-standing U.S. policy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8b1b4859f7ef18fa8de8df0b2a07aca08701eb0",
      "title": "The EV tax credit ends soon — but there's a little bit of wiggle room for car buyers",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511244/ev-tax-credit-deadline-irs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T19:12:24.000Z",
      "summary_90w": "",
      "raw": "A federal EV tax credit worth up to $7,500 ends Sept. 30. But the IRS has just clarified that shoppers don't need to actually have the keys in hand by the deadline to get the credit.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "fefdadbe773a1f59dde02631474ccef8a321961d",
      "title": "TikTok denies India comeback after reports of website going live",
      "url": "https://techcrunch.com/2025/08/22/tiktok-denies-india-comeback-after-reports-of-website-going-live/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T18:59:43.000Z",
      "summary_90w": "",
      "raw": "TikTok isn’t making a comeback in India.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8efc5c20337cdf8339c588298161678402806c7c",
      "title": "‘We didn’t understand the goals of the war’: Israel’s inflated Hamas death toll shows lack of strategy in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/22/israel-defence-forces-war-strategy-hamas-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:42:21.000Z",
      "summary_90w": "",
      "raw": "‘War dashboard’ showing number of militants killed was objective in itself with no plan for how Gaza could be governed afterwards, say sources in elite Unit 8200\nAs Israel gears up for a new offensive in Gaza, figures from a classified database suggest the country’s political and military leadership has for two years misled their country and the world about a war that has overwhelmingly killed civilians.\nIn May this year, Israel’s military intelligence database of Hamas and Palestinian Islamic Jihad fighters had 47,653 names. Of them, 8,900 were marked as killed, or probably killed, a joint investigation by the Guardian, the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call has found.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8ccae1d84520c93440e8146778fb4a91e944f75",
      "title": "Apple is in talks to use Google’s Gemini for Siri revamp, report says",
      "url": "https://techcrunch.com/2025/08/22/apple-is-in-talks-to-use-googles-gemini-for-siri-revamp-report-says/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T18:15:08.000Z",
      "summary_90w": "",
      "raw": "Apple promised a major revamp to Siri, but the company's AI capabilities have lagged behind competitors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c010a41fea4a754a2146b241cc5f4484d1a674c1",
      "title": "The next Starship flight will test much more than hardware",
      "url": "https://techcrunch.com/2025/08/22/the-next-starship-flight-will-test-much-more-than-hardware/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T18:11:17.000Z",
      "summary_90w": "",
      "raw": "The 10th Starship flight test will be a referendum on the company's build-fly-fix approach.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41871fdc131ac2dcc651ea909ada9228a26bcafb",
      "title": "Trump says 'We want to be very good to Canada,' as its leader drops some tariffs",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511357/canada-carney-tariffs-us",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T18:08:47.000Z",
      "summary_90w": "",
      "raw": "After Canadian Prime Minister Mark Carney announced he would lower tariffs, President Trump said \"We want to be very good to Canada. I like Carney a lot. I think he's a very good person.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4e85a38f37708c91cd8de79467d795f433ad1bb1",
      "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump",
      "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:02:17.000Z",
      "summary_90w": "",
      "raw": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain\nCanada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States.\nFrom 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a6890ee9ac73b03729bbd87e23ff5bfb6874022",
      "title": "Y Combinator says Apple’s App Store has hindered startup growth",
      "url": "https://techcrunch.com/2025/08/22/y-combinator-says-apples-app-store-has-hindered-startup-growth/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Y Combinator is asking the court to deny Apple’s appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d02312a95901a3b4206e07164f8a37558f3709cc",
      "title": "Nvidia reportedly halts production on its H20 AI chips",
      "url": "https://techcrunch.com/2025/08/22/nvidia-reportedly-halts-production-on-its-h20-ai-chips/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T16:53:47.000Z",
      "summary_90w": "",
      "raw": "Beijing is reportedly urging Chinese companies to turn to domestic chips just weeks after Nvidia got the green light to sell in China again.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a10c75632c95aa833e2405a19ccc24d9ed689561",
      "title": "Aspiration co-founder to plead guilty to $248M fraud scheme",
      "url": "https://techcrunch.com/2025/08/22/aspiration-co-founder-to-plead-guilty-to-248m-fraud-scheme/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T16:42:30.000Z",
      "summary_90w": "",
      "raw": "Joseph Sanberg is accused of falsely inflating revenue and fabricating a letter from Aspiration's audit committee to obtain loans, which the startup ultimately defaulted on.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abba3e8df4d89d1a4f89f8e5d34dd56135785fbc",
      "title": "Fed Chair Jerome Powell signals possible rate cut, sending stocks sharply higher",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509941/jerome-powell-federal-reserve-interest-rates-jackson-hole",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T16:05:33.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve chairman Jerome Powell signaled a possible interest rate cut in the months to come, sending stocks sharply higher.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "39e1f8fa1f2f81ae66443cb0fcbdb02c23cdb86c",
      "title": "YC-backed Oway raises $4M to build a decentralized ‘Uber for freight’",
      "url": "https://techcrunch.com/2025/08/22/yc-backed-oway-raises-4m-to-build-a-decentralized-uber-for-freight/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T15:53:52.000Z",
      "summary_90w": "",
      "raw": "The thousands of trucks zipping along U.S. highways are often only about half full -- something Oway wants to change with its \"ride-share for freight\" software.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c143503a12578cf6e33314dbfbb862387d36bc10",
      "title": "Gaza mother blames famine for halving daughter's weight",
      "url": "https://www.bbc.com/news/videos/ce87px1yd23o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T15:39:49.000Z",
      "summary_90w": "",
      "raw": "Rida Hijjeh says her daughter has lost 9.5kg, as famine is confirmed in Gaza City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18a61be248e0107061cb76ddc0c09751d591778c",
      "title": "Google makes it easier to edit Drive videos with a new Vids shortcut button",
      "url": "https://techcrunch.com/2025/08/22/google-makes-it-easier-to-edit-drive-videos-with-a-new-vids-shortcut-button/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T15:33:29.000Z",
      "summary_90w": "",
      "raw": "Now Workspace users can initiate a video edit using the Vids app directly from the Google Drive interface.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5b29dbd58d34fa5b21551ca33ea37862c4331754",
      "title": "UN agency says Gaza famine is direct result of Israel’s actions and may amount to war crime – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/22/famine-benjamin-netanyahu-palestine-gaza-israel-war-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:33:27.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed, you can read more on this story here\nMothers in Gaza have resorted to using legume water and herbs as alternative to infant milk amid Famine, charity warns\nDr. Ra’ed Al-Baba, who works at Al Awda Hospital run by ActionAid’s partner Al-Awda, said usage of alternatives to infant milk had “catastrophic” consequences.\nThere are mothers who resort to using legume water, herbs, and other alternatives to infant milk because of the severe shortage. These methods carry catastrophic risks, causing gastroenteritis, food poisoning, delayed growth, severe anaemia, and even the inability to move. We have seen cases of extreme dehydration from polluted water mixed with these substitutes. This is not survival, this is slow death.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ac8d83a42f82db803f1b6d815b87f854bea023a",
      "title": "GYG shares: Guzman y Gomez plummets on ASX but expansion still on the menu as increased US losses rattle investors",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/guzman-y-gomez-keeps-expansion-on-the-menu-despite-increased-us-losses-rattling-investors",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:33:25.000Z",
      "summary_90w": "",
      "raw": "GYG shares plummet by more than 20% on ASX despite global sales in the Sydney-based restaurant chain passing $1bn, as co-CEOs say ‘we are seeing momentum’ in American market\n\nGet our breaking news email, free app or daily news podcast\n\nMexican-themed chain Guzman y Gomez plans to open at least 15 restaurants in the US despite doubling its losses on its “relentless” bid to expand into the competitive American market.\nDespite its struggles in the US, GYG recorded more than $1bn in sales across its network for the first time and more than doubled its net profit to $14.5m in the 12 months to July – its first year on the Australian Stock Exchange (ASX).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a46c2168acd19a904d6a32b56d8347f51884e181",
      "title": "X pulls the ability to like and follow from its developer API’s free tier",
      "url": "https://techcrunch.com/2025/08/22/x-pulls-the-ability-to-like-and-follow-from-its-developer-apis-free-tier/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T14:57:03.000Z",
      "summary_90w": "",
      "raw": "X is making it harder for spammers with these API changes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65191e8d4a794120955e083139e06ff901c20457",
      "title": "UN-backed experts declare famine in and around Gaza City",
      "url": "https://www.theguardian.com/world/2025/aug/22/ipc-declares-famine-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:34:29.000Z",
      "summary_90w": "",
      "raw": "IPC says famine is ‘entirely man-made’ and immediate response is needed or avoidable deaths will soar\nAn “entirely man-made” famine is taking place in Gaza’s largest city and its surrounding area amid deteriorating conditions that threaten an exponential increase in deaths across the devastated territory, UN-backed experts have declared.\nThe Integrated Food Security Phase Classification (IPC), a globally recognised organisation that classifies the severity of food insecurity and malnutrition, found that three key thresholds for famine had been met, signalling a major escalation of the humanitarian crisis in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "16446152f8b78654e58d5fbc07e188e1c57c68fc",
      "title": "Developer gets prison time for sabotaging former employer’s network with a ‘kill switch’",
      "url": "https://techcrunch.com/2025/08/22/developer-gets-prison-time-for-sabotaging-former-employers-network-with-a-kill-switch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T14:26:34.000Z",
      "summary_90w": "",
      "raw": "The ex-developer was convicted of planting malicious code designed to crash its servers in the event that he was fired.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "925fc70e2f1ddfb4d52caebc245e8c4a95843fb0",
      "title": "Waymo approved to start autonomous vehicle testing in New York City",
      "url": "https://techcrunch.com/2025/08/22/waymo-approved-to-start-autonomous-vehicle-testing-in-new-york-city/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T14:19:05.000Z",
      "summary_90w": "",
      "raw": "It's the first permit of its kind, and a crucial step along the path toward launching a true robotaxi service in the Big Apple.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "229e5ba5d2982b5f1832044ba1d34d963fb76fa9",
      "title": "Thousands face deportation to danger as Trump targets temporary protections",
      "url": "https://www.theguardian.com/us-news/2025/aug/22/temporary-protected-status-tps-immigration-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:00:34.000Z",
      "summary_90w": "",
      "raw": "People with temporary protected status face possible deportation even though their home countries – including Afghanistan and Haiti – remain unsafe\nMany thousands of immigrants living in the US who came from certain countries regarded as risky or dangerous are at the mercy of US judges and the Trump administration’s agenda to slash their work authorization and protection from deportation.\nSince taking office, the Trump administration has announced the termination of temporary protected status (TPS) for citizens of seven of the 15 countries previously designated for shelter under this legal umbrella – with the Department of Homeland Security (DHS) controversially citing improved conditions in some of those places.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb225b4296115aeadcd9e886c214751ceeca6a5b",
      "title": "'My youngest child doesn't know what fruit tastes like': Gaza residents on famine",
      "url": "https://www.bbc.com/news/articles/cz602wvjv7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T14:00:26.000Z",
      "summary_90w": "",
      "raw": "A UN-backed body says more than half a million people across Gaza are facing \"starvation, destitution and death\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d2e50777871c1c54187d67c71ed62e025909adf",
      "title": "Home sales are ticking up — and more are coming to market",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5510058/housing-market-mortgage-rates-homebuilding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T09:00:00.000Z",
      "summary_90w": "",
      "raw": "High mortgage rates cooled home sales over the last few years. But data released this week shows signs that things may be thawing a bit.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3d1e7b78075c22105d4b0bf1e730c6af6090527e",
      "title": "She's cared for America's elderly for decades. Trump wants her gone by Sept. 8",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5502439/trump-immigration-tps-health-care",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has moved to end temporary protected status for immigrants from Honduras and other countries. Among them are health care workers tending to older and disabled people.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b2515d6d73547dd2a2f97e1974d1f98e219ed2ca",
      "title": "What happens when people stop trusting their government's economic data?",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5499343/what-happens-when-people-stop-trusting-their-governments-economic-data",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T08:46:55.000Z",
      "summary_90w": "",
      "raw": "What happens when people stop trusting their government's economic data? Planet Money reports on what happened in Greece.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "0e68f2be1fb5d9239c71d200b1d3bc0d4812313f",
      "title": "Largest retailers in the U.S. have raised prices on some items",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509940/largest-retailers-in-the-u-s-have-raised-prices-on-some-items",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T08:45:57.000Z",
      "summary_90w": "",
      "raw": "Some of the largest retailers in the U.S., including Walmart, Home Depot and Target, have had to raise prices on some items due to tariffs. They've kept prices down on other items.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c149f74cfe1f889734c9026275128145e9f32df9",
      "title": "OpenAI announces New Delhi office as it expands footprint in India",
      "url": "https://techcrunch.com/2025/08/21/openai-announces-new-delhi-office-as-it-expands-footprint-in-india/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T06:06:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has started hiring in India as it looks to expand its presence in the fast-growing South Asian tech market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4bcd2af7ceb9cfebc90f202fafbc195d5ca897f7",
      "title": "Friday briefing: Is Israel’s plan for Gaza City a full-scale assault – or political theatre?",
      "url": "https://www.theguardian.com/world/2025/aug/22/first-edition-gaza-city-israel-attack",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T05:43:33.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: After Israeli officials announced a stepped-up military operation in the city, Palestinians and the world wait to see what happens next\n\nGood morning. Israel claims to have launched the first stages of a sweeping military operation to conquer Gaza City – the administrative heart of the strip – warning that a million people could be forced from their homes, sparking a wave of fear among residents.\nIn the past few nights Palestinians have described relentless bombardments, with thousands already scrambling to escape, while others are too starved or frail to evacuate.\nUK news | Protesters at the next mass demonstration against the ban on Palestine Action will withhold their details from officers to force en-masse processing at police stations in an effort to make it “practically impossible” to arrest everyone.\nUkraine | Moscow threw Donald Trump’s Ukraine peace initiative into disarray on Thursday, insisting it must have a veto over any postwar support for the country as its forces carried out a large-scale overnight missile barrage.\nImmigration | Refugee support organisations have been forced to install safe rooms in their premises, relocate to less visible sites and in some cases close their offices in response to the threat of far-right violence, the Guardian can reveal.\nUS news | A federal judge in Miami late on Thursday ordered the closure of the Trump administration’s notorious “Alligator Alcatraz” immigration jail within 60 days and ruled that no more detainees were to be brought to the facility while it was being wound down.\nHealth | Baby food manufacturers have been given 18 months to improve the quality of their products in England amid mounting concerns that leading brands are nutritionally poor.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df32adc48d8de520c7f8e3beb96fc3a33dc37bf4",
      "title": "Thailand former PM cleared of royal insult charge but Shinawatra dynasty’s fate still hangs in balance",
      "url": "https://www.theguardian.com/world/2025/aug/22/thailand-former-pm-thaksin-shinawatra-royal-insult-lese-majesty-court-case",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T04:38:30.000Z",
      "summary_90w": "",
      "raw": "Lese-majesty case against Thaksin Shinawatra is dismissed, but his daughter Paetongtarn will hear next week if she will be removed as prime minster\nA criminal court in Thailand has dismissed a case accusing former prime minister Thaksin Shinawatra of defaming the monarchy, the first of three court cases that could decide the fate of one of the country’s prominent political families.\nThaksin was accused of insulting the monarchy during an interview with South Korean newspaper Chosun Ilbo in 2015.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e7b9d354350303b743edc7e9ec3cd2d754f96ce0",
      "title": "Indonesia working on details of plan to treat 2,000 people from Gaza amid concerns about right to return",
      "url": "https://www.theguardian.com/world/2025/aug/22/indonesia-plans-details-treat-2000-injured-palestinians-galang-island",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:17:11.000Z",
      "summary_90w": "",
      "raw": "Security ministry and the ministries of health and foreign affairs have met to discuss how the controversial proposal to treat Palestinians would work\nThe Indonesian government is working on plans to treat 2,000 people from war-ravaged Gaza, holding a series of inter-ministerial discussions to discuss logistics, legality and foreign policy implications relating to the highly sensitive proposal, according to a senior government official.\nIndonesia announced earlier this month that it would provide temporary medical assistance to 2,000 Palestinians from Gaza, with the uninhabited island of Galang identified as one possible site. Located just south of Singapore, the island was once home to a former camp for Vietnamese refugees and most recently the site of a pandemic hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da18fa84cafeeab92f9444caff810ebc751fabcb",
      "title": "OpenAI lawyers question Meta’s role in Elon Musk’s $97B takeover bid ",
      "url": "https://techcrunch.com/2025/08/21/openai-lawyers-question-metas-role-in-elon-musks-97b-takeover-bid/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T00:31:38.000Z",
      "summary_90w": "",
      "raw": "OpenAI says that Elon Musk met with Meta CEO Mark Zuckerberg to discuss a $97 billion takeover bid of the ChatGPT-maker.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90c01b64500f2a39e171e36fc3f33564e75c3508",
      "title": "Anduril, Blue Origin to study how to transport cargo from orbit to Earth for the Pentagon",
      "url": "https://techcrunch.com/2025/08/21/anduril-blue-origin-to-study-how-to-transport-cargo-from-orbit-to-earth-for-the-pentagon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T22:11:37.000Z",
      "summary_90w": "",
      "raw": "Blue Origin and Anduril notched small contracts that could revolutionize how the Pentagon transports cargo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e36eaa894d587d79f948705831112c742adba1a",
      "title": "With Fed under pressure, Jerome Powell prepares for a high-stakes speech",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509586/federal-reserve-jerome-powell-jackson-hole-speech",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T17:27:32.000Z",
      "summary_90w": "",
      "raw": "The Fed chair will speak Friday at an annual economic symposium in Jackson Hole, Wyo.  The speech comes as the central bank is under mounting pressure from the White House to lower interest rates.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7571ab87fd83998490d50825567d17e7746dbe56",
      "title": "Bolsonaro given 48 hours to explain alleged plans to flee to Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/21/bolsonaro-given-48-hours-to-explain-alleged-plans-to-flee-to-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T14:16:57.000Z",
      "summary_90w": "",
      "raw": "Brazilian supreme court judge sets ultimatum after police claim far-right populist sought to flee to avoid punishment over failed coup\nA supreme court judge has given Brazil’s ex-president, Jair Bolsonaro, 48 hours to explain police claims he was planning to flee to Argentina to avoid punishment for allegedly masterminding a failed coup after losing the 2022 election.\nBolsonaro’s trial for the alleged attempt to seize power is scheduled to conclude early next month. The far-right populist faces more than four decades in prison if found guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee2bdf53de52a89aa4268fa884abea9c6054098e",
      "title": "Rescued baby gorilla recovers from smuggling ordeal",
      "url": "https://www.bbc.com/news/videos/c93dex5643po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T13:21:38.000Z",
      "summary_90w": "",
      "raw": "Turkish authorities hope the youngster, named Zeytin, can soon be returned to his native Nigeria.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11e67f16b6483a2a58e306c44d5eb711909cb5c7",
      "title": "New Zealand to spend $3bn upgrading helicopters and ‘embarrassing’ defence planes",
      "url": "https://www.theguardian.com/world/2025/aug/21/new-zealand-seahawk-helicopters-defence-spending-planes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T03:06:28.000Z",
      "summary_90w": "",
      "raw": "Government says country will buy five Seahawk helicopters and two Airbus A321XLR aircraft\nNew Zealand will spend nearly NZ$3bn ($1.7bn) upgrading its ageing defence fleet, including replacing its “embarrassing” planes that have left multiple prime ministers grounded during international travel, the government has announced.\nThe defence minister, Judith Collins, said NZ$2bn would be spent buying five MH-60R Seahawk helicopters and another NZ$700m to buy two Airbus A321XLR aircraft.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1631129ec82de30e58c1bb8da79989ecae1ad5a0",
      "title": "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum",
      "url": "https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T01:56:35.000Z",
      "summary_90w": "",
      "raw": "Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges\nBrazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead of his judgment for allegedly plotting a military coup.\nThe far-right populist is facing a jail term of over 40 years when Brazil’s supreme court convenes next month to decide whether he is guilty of conspiring to overturn the result of the 2022 presidential election, which Bolsonaro lost to his leftwing opponent Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cfb04dfc85f883713024974762fb812fc3034d7a",
      "title": "Watch: Moments from the Menendez brothers trial in 1993",
      "url": "https://www.bbc.com/news/videos/cdxydv1rrn9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T00:31:41.000Z",
      "summary_90w": "",
      "raw": "Erik and Lyle, who are serving prison sentences for the murders of their parents, are making their case for parole this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9a0017d08b1ba5c2f4096f70fd1412d58279d5f",
      "title": "Watch: Are museums in DC too 'woke'? We ask visitors what they think",
      "url": "https://www.bbc.com/news/videos/c8ry171gvmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T21:53:59.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump has called for a review of Smithsonian museums, saying they focus too much on \"how bad Slavery was\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70614f519d0aa81fe1318fa871dba0c17e4fba94",
      "title": "US court allows Trump officials to end protected status for 60,000 migrants",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/appeals-court-trump-temporary-protected-status",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T21:48:05.000Z",
      "summary_90w": "",
      "raw": "Administration officials given legal right to move towards deportation of people from Nepal, Honduras and Nicaragua\nA federal appeals court on Wednesday sided with the Trump administration and halted for now a lower court’s order that had kept in place temporary protections for 60,000 migrants from Central America and Nepal.\nThis means that the Republican administration can move toward removing an estimated 7,000 people from Nepal whose temporary protected status designations expired on 5 August. The TPS designations and legal status of 51,000 Hondurans and 3,000 Nicaraguans are set to expire 8 September, at which point they will become eligible for removal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a9347d28be98f5a69604b97d249f804980f1f92",
      "title": "India ‘successfully tests’ nuclear-capable missile able to reach deep into China",
      "url": "https://www.theguardian.com/world/2025/aug/20/india-successfully-tests-nuclear-capable-missile-able-to-reach-deep-into-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T20:26:06.000Z",
      "summary_90w": "",
      "raw": "Agni-5 intermediate-range ballistic missile also part of Narendra Modi’s defence strategy against Pakistan\nIndia has said it successfully test-fired an intermediate-range ballistic missile that, when operational, should be capable of carrying a nuclear warhead to any part of China.\nThe Agni-5 missile was successfully launched in India’s eastern Odisha state on Wednesday, and authorities said it “validated all operational and technical parameters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed07203107a892f0cf3b4ba7318eba2658de4371",
      "title": "Watch: JD Vance heckled as he meets National Guard in Washington DC",
      "url": "https://www.bbc.com/news/videos/c8e1jrnry5ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T18:26:28.000Z",
      "summary_90w": "",
      "raw": "Protesters shouted at Vance, Pete Hegseth and Stephen Miller as they entered DC's largest rail hub.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f14cb00a74122ba106ef86ff987d9e8bc7c48b83",
      "title": "Watch: Fire rages at Milan airport check-in desk ",
      "url": "https://www.bbc.com/news/videos/cj4wz44kqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T16:18:45.000Z",
      "summary_90w": "",
      "raw": "Footage shared on social media shows a man knocked to ground after smashing an advertisement screen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34813e0f1f26d76786862ca068e099b13644362d",
      "title": "Human rights regulator criticises Met's use of facial recognition cameras",
      "url": "https://www.bbc.com/news/articles/c1kzgx4v2pko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:18:42.000Z",
      "summary_90w": "",
      "raw": "The Equality and Human Rights Commission says it believes the Met's use of the tech is unlawful.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b2c5d6d0908d4a6f91069746af4fa65f34b8ddc",
      "title": "South African minister investigated for historical racial slurs on social media",
      "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:15:35.000Z",
      "summary_90w": "",
      "raw": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts \nSouth Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid.\nMcKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts, which were still online at the time of publication.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca9dc3e79708726084045a1b585cddef480086c2",
      "title": "Uganda denies reports that it has struck deal with Trump to take in US deportees",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/uganda-trump-deal-immigration",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T13:01:24.000Z",
      "summary_90w": "",
      "raw": "Ugandan official said the east African country does not have the capability to take in undocumented immigrants\nUganda said it has not reached any agreement with the US to take in undocumented immigrants, contradicting reports that the east African country had struck a deal with the Trump administration to do so.\nHenry Oryem Okello, Uganda’s state minister for foreign affairs, told Reuters the country does not have the capability to take in immigrants. It comes as the US has deported migrants convicted of crimes in the US to non-native countries including South Sudan and Eswatini.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb14f806fc0e9cddfe22f88dbb7364666c65fc4d",
      "title": "Watch final trip for church on wheels as it moves to new home ",
      "url": "https://www.bbc.com/news/videos/c4g0e1nj2pqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T12:31:30.000Z",
      "summary_90w": "",
      "raw": "It took two days to move the church in Sweden's Kiruna, which was at risk at risk from ground subsidence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d878abc47011950c1db1e8d6d11ffdf056ecf28c",
      "title": "US in talks over 10% Intel stake, White House confirms",
      "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T06:37:52.000Z",
      "summary_90w": "",
      "raw": "The potential deal could involve swapping government grants for shares in the chip making giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}