{
  "version": "1758303711687",
  "generatedAt": "2025-09-19T17:41:51.687Z",
  "items": [
    {
      "id": "d927e755690c9c6d8e59911a3736eec95b53d2fd",
      "title": "So… is there a TikTok deal or not?",
      "url": "https://www.theverge.com/policy/781967/tiktok-deal-us-china-still-ambiguous",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T17:35:20.000Z",
      "summary_90w": "",
      "raw": "China and the US have “made progress” on granting permission for ByteDance to sell TikTok to an American consortium, fulfilling a nine-months-overdue legal requirement. After saying a tentative deal had been reached Monday and that approval would come Friday, President Donald Trump’s administration has issued an update that leaves the current status ambiguous and the details bare-bones.\n“I just completed a very productive call with President Xi of China. We made progress on many very important issues including Trade, Fentanyl, the need to bring the War between Russia and Ukraine to an end, and the approval of the TikTok Deal,” Trump posted on Truth Social, noting he and Xi Jinping would meet at the APEC Summit in Korea in October. “The call was a very good one, we will be speaking again by phone, appreciate the TikTok approval, and both look forward to meeting at APEC!”\n“Appreciate the TikTok approval” makes Xi’s benediction sound like a done deal. “We made progress,” however, does not.\nTikTok posted an equivocal response on X. “We thank President Xi Jinping and President Donald J. Trump for their efforts to preserve TikTok in the United States,” it said. “ByteDance will work in accordance with applicable laws to ensure TikTok remains available to American users through TikTok U.S.”\nThis leaves us in effectively the same place as we were earlier this week, when the Trump administration announced a “framework” agreement had been reached; not long after, it extended the January 2025 sale deadline for the fourth time. Reporting on Tuesday indicated that the deal could actually take 30 to 45 more days.\nThe expected buyers are a consortium that includes Oracle, Andreessen Horowitz, and Susquehanna International Group, with ByteDance reportedly retaining a share just shy of 20 percent, as mandated by a divest-or-ban law Congress passed in 2024. They’re expected to develop a version of the app with a new recommendation algorithm walled off from Chinese control.\nTikTok users, meanwhile, are still in the dark about the future of their app — hoping another trade war won’t throw a wrench in the agreement, with no hard timeline for resolution in sight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0df5c2733e64bc914ab7b717bacfe3aff91084df",
      "title": "How FCC chair Brendan Carr is leading Trump's charge against the media",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5546764/fcc-brendan-carr-kimmel-trump-free-speech",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T17:27:58.000Z",
      "summary_90w": "",
      "raw": "In the eight months since becoming chair of the Federal Communications Commission, Brendan Carr has waged war against the free speech of those who have reported on, criticized, or satirized the president.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a88a9044afc3696f82800dc4d849097008d49e60",
      "title": "Trump and ByteDance tout TikTok deal approval, but no official details yet",
      "url": "https://techcrunch.com/2025/09/19/trump-and-bytedance-tout-tiktok-deal-approval-but-no-official-details-yet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T17:20:53.000Z",
      "summary_90w": "",
      "raw": "The two countries have been working on a way to save TikTok's U.S. business, after the TikTok ban in January over national security concerns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "634b20b3a4710822c7c577aca477738ed0354783",
      "title": "Meta’s AR ambitions meet reality, and California gets serious about AI safety…again",
      "url": "https://techcrunch.com/video/metas-ar-ambitions-meet-reality-and-california-gets-serious-about-ai-safetyagain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T17:20:38.000Z",
      "summary_90w": "",
      "raw": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday.Subscribe to us on Apple Podcasts, Overcast, Spotify and all the casts. You […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c64cd389d338067229bde642ab32ab66b0f423f6",
      "title": "Poland says Russian jets violated oil platform safety zone in Baltic Sea as Nato confirms it intercepted MiG-31s over Estonia – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T17:18:04.000Z",
      "summary_90w": "",
      "raw": "Nato spokesperson condemns ‘reckless Russian behaviour’ after three MiG-31 fighters enter Estonian airspace for 12 minutes\nHere we go: we are now getting more details on the 19th package of sanctions, via Commission president Ursula von der Leyen and foreign policy chief Kaja Kallas.\nWe are still waiting for the announcement on when we will get more detail on the 19th sanctions package.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6bdfeb3aff19e5ac3c83328af0247efdd3f13e1",
      "title": "Irish language band Kneecap barred from Canada over UK terror charges",
      "url": "https://www.bbc.com/news/articles/cvgrvw4ejn4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T17:13:25.000Z",
      "summary_90w": "",
      "raw": "The group has fired back at the Canadian government, calling their comments \"deeply malicious\" and threatening legal action.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a428a2e19fe4bddfeebf797cc76cc0c3ac67b18",
      "title": "UN votes to allow Palestinian president to address annual gathering via video link",
      "url": "https://www.theguardian.com/world/2025/sep/19/un-palestinian-president-annual-gathering-video-link",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T17:08:53.000Z",
      "summary_90w": "",
      "raw": "Trump had refused to grant visas for Palestinian delegation due to attend conference and UN general assembly\nThe United Nations general assembly has voted to allow the Palestinian president, Mahmoud Abbas, to address next week’s annual gathering of world leaders next week in New York via video link after Donald Trump said he would not give him a US visa.\nThe resolution received 145 votes in favour and five votes against, while six countries abstained.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47183384a50e2623b07f2c4183ff8215e8b42195",
      "title": "Nato intercepts Russian fighter jets on ‘reckless’ violation of Estonian airspace",
      "url": "https://www.theguardian.com/world/2025/sep/19/estonia-accuses-russia-of-brazen-violation-of-its-airspace",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T17:02:17.000Z",
      "summary_90w": "",
      "raw": "Italian air force heads off three MiG-31s over Gulf of Finland amid increased tension on alliance’s eastern border\nNato has intercepted three Russian MiG-31 fighter jets that violated Estonia’s airspace over the Baltic Sea in a 12-minute incursion, calling it proof of Moscow’s “reckless” behaviour.\nThe EU’s top diplomat, Kaja Kallas, a former Estonian prime minister, accused Moscow of an “extremely dangerous provocation” and said the latest Russian violation of Nato’s eastern borders “further escalates tensions in the region”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60365a1261ff08997d9a844e8f643aeb2484c361",
      "title": "Erika Kirk will lead her late husband's organization. Here's what to know about her",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5546856/erika-kirk-ceo-turning-point-usa-charlie-kirk-death",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T16:59:09.000Z",
      "summary_90w": "",
      "raw": "Erika Kirk, 36, has a devotional podcast and Christian clothing line. She has vowed to continue her late husband's work.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91fa0bd765b95876dfce11dee3c67098d3669aa6",
      "title": "Amy Hunt claims GB's second medal at World Athletics with brilliant 200m silver",
      "url": "https://www.bbc.com/sport/athletics/articles/c701x1wn5rno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:58:19.000Z",
      "summary_90w": "",
      "raw": "Great Britain's Amy Hunt announces herself on the global stage by claiming a stunning 200m silver in her first major final at the World Championships in Tokyo.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c807e6d336e6274c2c3548a4228526a60c1179ef",
      "title": "Judge strikes down Trump's $15bn lawsuit against the New York Times",
      "url": "https://www.bbc.com/news/articles/c62n7025wdgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T16:38:16.000Z",
      "summary_90w": "",
      "raw": "A US federal judge took issue with the contents of Trump's lawsuit against the newspaper and gave him 28 days to amend it.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b48738ecc336e687bf5d1348d84f08382165c913",
      "title": "Israel army says it will use ‘unprecedented force’ in Gaza City and urges residents to leave – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/19/palestinian-state-palestine-recognition-gaza-israel-middle-east-latest-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T16:36:48.000Z",
      "summary_90w": "",
      "raw": "IDF tells residents of Gaza City to flee south but closes Salah al-Din road evacuation route. This live blog is closed\nPakistan’s defence minister says his nation’s nuclear programme “will be made available” to Saudi Arabia if needed under the countries’ new defence pact, marking the first specific acknowledgment that Islamabad had put the kingdom under its nuclear umbrella.\nDefence minister Khawaja Mohammad Asif’s comments underline the importance of the pact struck this week between Pakistan and Saudi Arabia, which have had military ties for decades, AP reports.\nI welcome the excellent cooperation with the Palestinian Authority. We are working together to ensure his swift extradition.\nThis is another step forward for justice and truth. My thoughts are with all the families who have endured the pain of waiting for so long.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b57ac69e0fe62b83c21c9a852f02b15f7a1d04b",
      "title": "Nato intercepts Russian warplanes violating Estonian airspace",
      "url": "https://www.bbc.com/news/articles/czrp6p5mj3zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:33:13.000Z",
      "summary_90w": "",
      "raw": "Estonia says three Russian MiG-31 fighter jets remained in Estonian airspace for 12 minutes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6de42966e29f50a27a38da993c6bccc18cdfd898",
      "title": "Hollywood stars back boycott as Israel's minister targets film academy",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5536976/einbinder-bardem-israeli-film-boycott-gaza",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T16:32:48.000Z",
      "summary_90w": "",
      "raw": "Javier Bardem and Hannah Einbinder join a Hollywood boycott of Israel's film industry over Gaza, as Israel's culture minister also moves against its film academy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce8994860c46dd64c34a0df87408232410ec297f",
      "title": "Settling old scores and creating new drama - Cardi B releases first album in seven years",
      "url": "https://www.bbc.com/news/articles/cgmz2wx201po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:30:26.000Z",
      "summary_90w": "",
      "raw": "The US rapper references her 2024 divorce and a beef with another female rapper on Am I The Drama?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8da9e997e286853837fb10926ccaa5f91b5b878d",
      "title": "Minister rejects Trump's call for military to tackle illegal migration in UK",
      "url": "https://www.bbc.com/news/articles/c04qre9l0v3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:24:23.000Z",
      "summary_90w": "",
      "raw": "Peter Kyle says the military is focused on key issues around the world and the UK Border Force has specific responsibility for policing borders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c02447361a06ea600d13b3e5954d16794e95aae",
      "title": "Naked and high flight attendant 'let himself down'",
      "url": "https://www.bbc.com/news/articles/clyxj2gy7pno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:23:12.000Z",
      "summary_90w": "",
      "raw": "Haden Pentecost was found by colleagues in an aeroplane toilet after taking drugs and stripping.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4326fa9b47371316da42834b46089547d6e8c98c",
      "title": "Migrant returned to France after government wins court challenge",
      "url": "https://www.bbc.com/news/articles/cx273vnkjpmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:20:53.000Z",
      "summary_90w": "",
      "raw": "Eritrean man arrives in Paris under the \"one in, one out\" deal as at least three boats carrying migrants leave beaches in France.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7b6f8c0997ce7a895a351ff4d4ebe0d7151b22f",
      "title": "Civilians made up 15 of every 16 people killed by Israel in Gaza since March, data suggests",
      "url": "https://www.theguardian.com/world/2025/sep/19/civilians-made-up-15-of-every-16-people-israel-killed-in-gaza-since-march-data-suggests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T16:15:38.000Z",
      "summary_90w": "",
      "raw": "Report from independent conflict tracker Acled indicates one of the highest civilian death rates since start of war\nAbout 15 of every 16 Palestinians the Israeli military has killed since its renewed offensive in Gaza began in March have been civilians, data collected by the independent violence-tracking organisation Acled indicates.\nThe civilian death rate implied by a report from Acled, which stands for Armed Conflict Location and Event Data, is one of the highest recorded during the conflict, and will increase international pressure on Israel as its forces advance into Gaza City, forcing up to a million people to evacuate and threatening further large-scale civilian casualties.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a29f37b6e16f9490ae83346c58b744d202e9e0c8",
      "title": "Scottish government minister Jamie Hepburn resigns after assault claim",
      "url": "https://www.bbc.com/news/articles/ceq2y0npj32o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T16:11:50.000Z",
      "summary_90w": "",
      "raw": "Conservative MSP Douglas Ross said the the SNP MSP grabbed him as he left the Holyrood chamber on Wednesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "193030d3b8196ea0815436475671fd99d4534859",
      "title": "Trump says talk with China's Xi yielded progress, including on TikTok",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5545600/tiktok-deal-talks-trump-xi",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T16:05:57.000Z",
      "summary_90w": "",
      "raw": "Officials have been working on a deal to bring popular video app TikTok under U.S. ownership to avoid shutting it down in the United States.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc62819cb4d8d5b9e0c901c97a1d1e564fbf311d",
      "title": "Meta CTO explains why the smart glasses demos failed at Meta Connect — and it wasn’t the Wi-Fi",
      "url": "https://techcrunch.com/2025/09/19/meta-cto-explains-why-the-smart-glasses-demos-failed-at-meta-connect-and-it-wasnt-the-wi-fi/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T16:04:11.000Z",
      "summary_90w": "",
      "raw": "Meta CTO Andrew Bosworth offered a postmortem on Meta's demo fails this week at its developer conference, where it showed off new smart glasses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e14df3b9a0f3ef4c4e6f6e62a5dc178b7b16114",
      "title": "One hellscape to another: Gazans tell of dire conditions in Israeli-declared humanitarian zone",
      "url": "https://www.bbc.com/news/articles/cp8jzjpzk50o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T15:50:15.000Z",
      "summary_90w": "",
      "raw": "Israel has ordered hundreds of thousands of people to head south to al-Mawasi as it seeks to fully occupy Gaza City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89b0fdadf0d78b514afe9ca09c215aaf2e5be449",
      "title": "MAGA influencers are already fighting over Charlie Kirk’s death",
      "url": "https://www.theverge.com/policy/781862/charlie-kirk-nick-fuentes-candace-owens-tucker-carlson",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T15:50:01.000Z",
      "summary_90w": "",
      "raw": "Nick Fuentes, the leader of a Christian based extremist white nationalist group speaks to his followers, ‘the Groypers.’ in Washington D.C. on November 14, 2020\t\n\nThe only true surprise about this latest MAGA influencer civil war is how quickly it happened, given the circumstances: Charlie Kirk, an ubiquitous presence, influential political force, and seemingly everyone's best friend, had been dead for barely a week before everyone began fighting each other for a piece of him. \nThe indictment of Tyler Robinson, released Tuesday, cited, among other things, the Discord chats that he sent to his roommate wherein he appeared to confess to the shooting. Its contents were strong enough for the power brokers of MAGA world - all the way up to President Donald Trump himself and his cabinet - to begin a rapid, …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9fd35e56b4e2ce24f4f5f0ee473c416c8ffdbb4",
      "title": "The motive behind Charlie Kirk's killing: What we know and don't know",
      "url": "https://www.bbc.com/news/articles/c7v1rle0598o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T15:48:18.000Z",
      "summary_90w": "",
      "raw": "Prosecutors have broadly outlined suspect Tyler Robinson's political views - but many questions remain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fe6405124dff0c665e9c10849d59a2f940f7427",
      "title": "Self-styled African tribe in Scottish woodland served with second eviction notice",
      "url": "https://www.bbc.com/news/articles/cd9yjkngyklo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T15:47:43.000Z",
      "summary_90w": "",
      "raw": "Three members of the self-proclaimed Kingdom of Kubala have already been evicted from one area of woodland in Jedburgh.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be4524af3e2e409b5d68ef6101600af7a5e09199",
      "title": "Trump says Xi approves of TikTok deal as leaders plan South Korea meeting",
      "url": "https://www.bbc.com/news/articles/c4g7l7yl832o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T15:45:33.000Z",
      "summary_90w": "",
      "raw": "The president hailed \"progress\" during a phone call with Xi and said that he also would travel to China next year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7cfc1849f60c13d545dcbfa9090c22456fde2205",
      "title": "Swiss theatre director told to withdraw book alleging Austrian politician mocked Holocaust victims",
      "url": "https://www.theguardian.com/books/2025/sep/19/swiss-theatre-director-told-to-withdraw-book-alleging-austrian-politician-mocked-holocaust-victims",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T15:45:13.000Z",
      "summary_90w": "",
      "raw": "Court fines publisher after Milo Rau falsely claimed that far-right former chancellor Heinz-Christian Strache sang a song ridiculing the six million Jews murdered by the Nazis\nA Swiss theatre director known for re-enacting landmark trials has been told by a judge in Vienna that his publisher must withdraw a book in which he alleged that a far-right Austrian politician sang a song mocking the victims of the Holocaust.\nOn Thursday, Vienna’s regional court fined independent German publishing house Verbrecher Verlag €1,500 (£1,300) for publishing a book in which Milo Rau alleged that Heinz-Christian Strache, the former leader of the Freedom party (FPÖ), once sang a song with the line: “We’ll manage the seventh million”, a reference to the approximately 6 million European Jews murdered at the hands of the Nazi regime.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23d1ea4b52ae1e078da3863198d3488328fc9e61",
      "title": "ESPN and Fox One net one million signups in under two weeks",
      "url": "https://www.theverge.com/news/781885/espn-fox-one-sports-streaming-one-million-signups",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T15:32:15.000Z",
      "summary_90w": "",
      "raw": "It feels like we’ve reached total saturation when it comes to streaming services, but apparently people are happy to sign up for one (or two) more services if they include live sports. According to Antenna, a firm that tracks the streaming industry, the new ESPN service and Fox One signed up about a million new subscribers in just 10 days. And that number doesn’t include those signing in through a cable subscription or coming over from an existing Disney+ sub. \nAntenna didn’t specify how many people signed up for ESPN versus Fox One, though according to Front Office Sports, most of the subscribers are for ESPN. With the NFL season just getting underway it’s no surprise that many were eager to sign up for a service that would let them watch live football without cable. Fox One includes Fox News and Fox Business, but the real draw is livestreams from Fox Sports, FS1, FS2, and local Fox affiliates. These are, of course, just early results and it remains to be seen if both services will see continued success when the football season ends.\nWhile you can subscribe to ESPN’s new offering for $29.99 a month, or Fox One for $19.99 a month, bundles will continue to be a big part of Disney’s strategy. The company is even planning to offer the two under a single sub for $39.99 starting October 2nd.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "79b14488f38ab22d059cb0ef046a71821256cd1e",
      "title": "Here are the price-matching policies for Best Buy, GameStop, and others",
      "url": "https://www.theverge.com/21570383/price-matching-policy-apple-google-microsoft",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T15:30:00.000Z",
      "summary_90w": "",
      "raw": "Nothing is more frustrating than buying a new pair of headphones, an OLED TV, or a laptop just to find out that you could have gotten it for a lot cheaper somewhere else. That’s why, in order to keep customers happy and prevent them from shopping elsewhere, many retailers offer price-matching policies in which they promise to match a lower price found elsewhere. That kind of information comes in handy no matter the time of year, but it’s especially helpful during shopping events like Amazon Prime Big Deal Days, a two-day event that formally kicks off October 7th.\nWhat follows are the price-matching policies for a variety of major retailers. There are a few things to note here. First, all price-matching policies have several rules attached to them. We’ve summarized some of the rules here, but we recommend visiting the provided links and reading the policies carefully. Second, most retailers that serve as a marketplace for other sellers, specifically wholesale retailers like Costco and Sam’s Club, don’t have price-matching policies, and many traditional stores won’t match their prices.\nLastly, there are always exceptions to the rules. If you’re looking for a deal on a product and you know it’s available for a lower price elsewhere (or it was previously offered at the same retailer), it never hurts to call or chat with a customer service rep and ask if they’ll match the price. You have nothing to lose but time, and there’s always a chance they may find a loophole or make a special exception.\nAmazon\nAmazon doesn’t offer price matching. Full stop. You can contact customer support, but even if you’re an Amazon Prime customer, it’s not likely that they’ll help you out.\nThat said, Amazon does offer a pretty liberal return policy, meaning you can often return an item you purchased from Amazon if it’s available for less elsewhere (or at Amazon). Then, you can just repurchase the product wherever it’s cheapest.\nTarget\nTarget will match the price of identical items purchased from Target, Amazon, Best Buy, Walmart, and a select group of other competitors if you request it at the time of purchase or within 14 days of your purchase. You must bring the original ad or listing in both instances, whether digital or in print, along with your receipt, into the store. Alternatively, you can call for online purchases at 1-800-591-3869 or chat online via contactus.target.com.\nBe mindful, however, that Target’s policy excludes in-store price matches from other Target stores, doorbusters, and competitors’ lightning sales — including those offered by Amazon. It also doesn’t apply to products sold via Target Plus, Target Circle bonuses, “marketplace” items sold via third-party sellers, clearance items, closeout items, used items, and products that currently come with — or were initially bundled with — a promotional Target gift card. \nBest Buy\nBest Buy’s Price Match Guarantee states that a product could be eligible for a price reduction if it’s new, identical to the competitor’s product, immediately available at a qualifying competitor’s store or on its site, and not shown on Best Buy’s exclusion list — which includes “items for sale the Thursday before Thanksgiving Day through the Monday after Thanksgiving.” Items must have the identical model number and color. However, disclaimer here: Best Buy doesn’t price-match discounts that are only available as part of a competing retailer’s membership or loyalty rewards program, which disqualifies member-only events like Amazon Prime Big Deal Days.\nTo get the difference, you have to contact Best Buy via its on-site chat and be able to show the ad or website with a lower price point. Alternatively, you can call 1-888-237-8289 or visit any Best Buy or Pacific Sales store. Approved retailers include Amazon, B&H Photo, Apple, Costco, Sam’s Club, Target, and Walmart. Items must be sold directly through the store, not a third-party seller.\nBest Buy will also, upon request, match an in-store or online price that was lowered during the return and exchange period, which typically lasts up to 15 days.\nWalmart\nWalmart doesn’t price match the prices of its competitors, though Walmart’s online store offers price matching on items purchased from Walmart stores if the item is in stock at Walmart.com.\nHowever, the policy doesn’t apply to those who live in Alaska, Hawaii, or Puerto Rico. Additionally, it doesn’t apply to special event prices, like those seen during Black Friday. Walmart also does not retroactively price match items bought from Walmart.com that have dropped in price after the time of purchase. The retailer additionally doesn’t price match items purchased from Walmart Marketplace retailers or third-party sellers.\nApple\nWhile we’ve seen some claims that Apple will price match up to 10 percent for products bought at certain major retailers, there is no official policy on the company’s website.\nIf Apple reduces the price of an Apple-branded product within 14 days of when you receive your item, you can visit an Apple Store or contact the Apple Contact Center at 1-800-MY-APPLE to request a refund or get credit for the price difference. However, that doesn’t apply to special sales like Black Friday or Cyber Monday.\nB&H Photo\nB&H says that it might be able to honor a current lower price or match the price of a competitor, but it does so on a case-by-case basis. You have to contact its customer service team using the on-site chat, email, or by calling 1-800-606-6969 / 1-212-444-6615. If approved, B&H Photo will price match one identical item per customer.\nCostco\nCostco does not price match with competitors. However, according to its website, it will issue a credit for the difference between the price a member has paid and a promotional price if you bought the item online at Costco and requested the credit up to 30 days before the change in price. If you bought the product from a Costco warehouse location, visit the membership counter at the store where you made the purchase. Costco doesn’t price match items bought from Costco warehouses with Costco.com purchases.\nDell\nDell will price match identical products from Dell, Amazon, Best Buy, Walmart, Target, HP, Apple, Lenovo, and a number of other retailers. Dell will not match prices available at Costco or Sam’s Club. You can call 1-877-275-3355 or chat online to run a price check, but you’ll need to provide a link to the competitor’s product. Dell outlines the specs you’ll need to compare for an item to be eligible for a price match before you contact them for a price match before you make a purchase.\nYou can also contact the company about a price difference within 30 days of purchase. However, there is a long list of restrictions, and none of this is available between Thanksgiving Day and the Monday following Thanksgiving (or on Green Monday). Dell also doesn’t match membership-only pricing or the exclusive discounts you’ll find during Prime Big Deal Days or Best Buy’s Member Deals Days. Items that are discounted as a Deal of the Week or Daily Deals through Dell’s Member Purchase Program are also ineligible.\neBay\neBay doesn’t offer price matching on purchases made during the week of Thanksgiving through Cyber Monday, but it does provide a generous price guarantee on select items outside that window. If you buy an item marked with the “Best Price Guarantee” badge — or one featured in eBay Deals — and find a lower price from an approved competitor within 48 hours, eBay will give you 110 percent of the price difference in the form of a coupon. That means you’ll receive a coupon worth the full difference plus an extra 10 percent, which you can use toward your next eBay purchase. Approved competitors include Amazon, Best Buy, Target, and Walmart.\nThe products must be new, unopened, and identical to the competitor’s item. You have to contact eBay Customer Service, and if they verify your claims are legitimate, you will receive the coupon and be able to use it toward your next eBay purchase.\nGameStop\nGameStop does not mention an official price-matching policy on its website. In 2022, however, GameStop tweeted that the store will price match items sold and shipped by Amazon as long as they’re available online or in-store. Although GameStop only mentioned Amazon in the tweet, others have reported that the store will price match items purchased from Target and elsewhere.\nGoogle\nIf a request is made within the standard return period, Google will match online pricing from select retailers — specifically Amazon, Best Buy, Walmart, B&H Photo, and Target. It doesn’t, however, match preorder pricing from other retailers or carrier deals. The product must also be in stock and identical, right down to the color and configuration. Plus, you need to provide a public link to the promo page or product listing to verify the lower price. Items sold by third-party sellers are ineligible for a price match.\nOther exclusions apply, too, including limited-time daily or hourly deals; wholesale, business, educational, or member-only pricing; mail-in offers and coupons; product bundles, clearance, and non-new items; and items from third-party sellers on a competitor’s website. Google will only provide a price match on smartphones and other items with data plans if they’re unlocked devices.\nYou may also receive the difference if the product you purchased from the Google Store drops in price within the standard return period, though you’ll need to contact Google directly to get the price match or correction.\nThe Home Depot\nThe Home Depot will match the price of identical, in-stock products from other retailers, except for membership-based wholesalers. The retailer must be able to ship the item to your location, so prices from regional retailers are ineligible. The price-match policy does not apply to special events like Black Friday, though, and it doesn’t apply to clearance prices, used and refurbished items, and rebate offers. \nYou must bring the ad or listing with you in-store to the register. (You can also request price matches for online purchases that are shipped to the customer.) For online orders, you’ll need to provide the exact SKU for the item on the competitor’s site and The Home Depot’s site. To request a price match over the phone, you can call: 1-800-430-3376. Additionally, The Home Depot will only honor requests submitted by the original buyer — no friends or family allowed. \nHP\nAccording to HP’s website, the company will match the current pretax price for new comparable PCs and identical HP printer, display, and accessory model numbers from nationally recognized online retailers, such as Dell, Amazon, Newegg, and Best Buy. The specs have to be the same to get a price match on PCs, but the product model number does not need to be identical.\nYou must ask for the match at the time of purchase by calling 1-800-888-0229 or via chat. You can’t request a price match via email, and the policy does not extend to items bought during promotional periods. It also doesn’t apply to membership stores like Costco and Sam’s Club, items purchased through a third-party vendor on an approved site, or items purchased using financing.\nHP also offers price protection on the HP-branded products it sells. If a price drops during your return window, you can request an adjustment by emailing myhpsales@hp.com. This doesn’t apply to products purchased during certain promotional events such as Green Monday and products on sale during the week of Thanksgiving and the week after, plus other seasonal holiday sales.\nLenovo\nLenovo matches pricing on comparable PCs from Lenovo, HP, or Dell with the same key specs as long as they’re sold through a list of recognized retailers. That list includes bigger stores such as Best Buy, Walmart, Amazon, Newegg, and B&H Photo as well as direct competitors such as Dell and HP. The comparable PC must also be in stock and readily available from both Lenovo and the competing retailer, and you have to contact a Lenovo sales rep with specific details about the specs and availability of the product you’re inquiring about in order to facilitate the match. \nThat said, you can’t take advantage of coupons or special discounts while receiving a price match, and the policy doesn’t apply to membership stores like Costco. The policy also doesn’t apply to “Marketplace” items where third parties fulfill the order, so double-check that you bought the product directly from the retailer. Build-your-own models are also ineligible for a price match.\nLenovo also offers a price guarantee refund for laptops and personal desktop computers bought from Lenovo.com within 30 days of purchase. To receive a refund, you must contact Customer Care and show the lower price of the identical product offered on Lenovo.com. This policy doesn’t apply to doorbuster or clearance products, however.\nLowe’s\nLowe’s will match the price of identical, in-stock products when you present an ad, product listing, or photo from a qualifying online or local retailer, including Amazon, Best Buy, Target, and Walmart. The product must be purchased directly from the retailer and not a third-party seller, however, and it doesn’t apply to special sales events like Black Friday and other holiday promotions.\nAdditionally, Lowe’s doesn’t match prices from one Lowe’s store to another, nor any rebate discounts or those available only to a select group of customers (such as loyalty clubs). Clearance, seasonal, buy one get one free, and custom made items are also ineligible for a price match. To request a price match, you can head to the store, call 1-877-465-6937, or chat online.\nMicrosoft\nMicrosoft will refund you the difference if it drops the price of an in-stock physical product purchased online from the Microsoft Store within 60 days of your purchase being delivered.  The same policy also applies if you find the identical product on sale at a lower price at a qualifying retailer like Amazon or Best Buy, though it doesn’t extend to the Surface Hub, HoloLens, Windows DevKits, or digital products.\nFurthermore, some eligible products have specific retailer exclusions. For example, price matches for Surface products at other retailers are limited to Amazon and Best Buy, while Xbox products are limited to the two aforementioned retailers as well as Target, GameStop, and Walmart. The price match policy excludes products from third-party sellers, clearance items, bundles, rebates, and prices only available after guests log in.\nYou’ll need to contact Microsoft’s Sales and Support team at 1-800-642-7676 within 60 days of delivery to request a refund. If you purchase an item from a Microsoft Experience Center, you’ll have to go back to that location with your receipt. In both instances, Microsoft will credit your original payment method the difference between the price you paid and the current lower price, which typically takes between three and five days to process.\nNewegg\nNewegg offers price matching on select items; these products are identified by the label “Price Match Guarantee” that appears in the price box on the right side of the product page. This applies whether you find that lower price on Newegg or at what Newegg judges as a major retailer, which includes Amazon, Best Buy, Walmart, Target, GameStop, and Sears. The product must be identical, and the match won’t apply to rebates, coupons, or price drops that are only available as part of a retailer’s membership or loyalty program. It also only applies to products sold directly through the retailer, not a third-party seller.\nYou need to notify Newegg of the lower price within 14 days of purchase. You’ll then be issued a credit you can use on the Newegg website, though you’ll only have 90 days to do so. Newegg’s price-match guarantee is not valid during major holiday sales events, including Black Friday, Cyber Monday, and Green Monday.\nSam’s Club\nYou can request a price match against other Sam’s Club stores but not competitors. Note that this doesn’t apply to items on markdown or clearance.\nUpdate, September 19th: Added a mention of Amazon’s forthcoming Prime Big Deal Days sale and adjusted the copy to reflect current retailer policies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76da15917d99fd221197b26f75f1635beb3febb4",
      "title": "Judge quashes Home Office’s decision on US extradition of vulnerable man",
      "url": "https://www.theguardian.com/law/2025/sep/19/judge-quashes-home-office-decision-diogo-santos-coelho-extradition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T15:20:27.000Z",
      "summary_90w": "",
      "raw": "Portugal has also made extradition request for Diogo Santos Coelho, who is facing cybercrime charges\nA high court judge has quashed a Home Office decision that paved the way for a vulnerable autistic man to be extradited to the US on cybercrime charges carrying a possible 52-year sentence.\nThe UK government has accepted that Diogo Santos Coelho, 25, a Portuguese national, was groomed and exploited online by adults from the age of 14, leading to him setting up the website RaidForums, to which the alleged crimes relate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "773c210de342befc1a8777d0e7fc718bb3f18d15",
      "title": "Two ambulance workers arrested after the deaths of six people",
      "url": "https://www.bbc.com/news/articles/cvgvnvnm0vro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T15:07:44.000Z",
      "summary_90w": "",
      "raw": "Two ambulance workers have been arrested over the deaths of six adults, Wiltshire Police have said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5b30bfaa69741d01c868fddc19823093493ab70",
      "title": "Assisted dying bill moves one step closer to becoming law",
      "url": "https://www.bbc.com/news/articles/cj9zw3399jdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T15:04:26.000Z",
      "summary_90w": "",
      "raw": "The bill has passes its second reading in the Lords after peers agree to set up a scrutiny committee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88510ceee0d0a3745a9d5bd84c22e110148660fe",
      "title": "Liberal MPs speak up about ‘disturbing’ Advance campaign against ‘mass immigration’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/20/liberal-mps-speak-up-about-disturbing-advance-anti-immigration-campaign",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T15:00:51.000Z",
      "summary_90w": "",
      "raw": "Several MPs say the activist group’s advertising push is becoming a problem for the party because ‘you cannot win from the margins’\n\nGet our breaking news email, free app or daily news podcast\n\nSeveral Liberal MPs have raised concerns an anti-immigration campaign by the activist group Advance is hurting the party’s brand and alienating migrant communities.\nAnalysis of Advance’s Meta advertising since May’s federal election shows it has promoted 44 anti-immigration ads, with more than 1.5m impressions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c8f060bcffc6667938a08a4642ae63cc1fef4d9",
      "title": "Australia’s fossil fuel earnings set to fall by $50bn a year by 2035",
      "url": "https://www.theguardian.com/business/2025/sep/20/australias-fossil-fuel-earnings-set-to-fall-by-50bn-a-year-by-2035",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T15:00:48.000Z",
      "summary_90w": "",
      "raw": "Treasury modelling shows pursuit of a 65% cut in emissions will mean a boom in the export of green energy commodities\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s production of fossil fuels and the export value of coal and LNG are both predicted to plummet this decade, while at the same time the country reshapes its economy to reach net zero, according to Treasury modelling.\nThe annual value of fossil fuel exports is predicted to fall by $50bn by 2035 if Australia sticks with its current policies and reaches emissions reduction cuts of 65% – an amount in the bottom half of the target range announced this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38ac02c205d9a722eab7d9a9915e81fe6b89be57",
      "title": "Australia’s renters may miss out on green energy savings enjoyed by ‘well-off’ homeowners, expert says",
      "url": "https://www.theguardian.com/australia-news/2025/sep/20/australian-households-could-save-4300-year-solar-power-energy-electrification",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T15:00:48.000Z",
      "summary_90w": "",
      "raw": "Treasury analysis shows savings of up to $4,300 a year per household but the challenge is to ensure everyone can benefit \n\nGet our breaking news email, free app or daily news podcast\n\nAustralian households could save as much as $4,300 a year by switching to solar panels, installing batteries and driving an electric car, according to Treasury modelling, though renters may miss some of those benefits.\nThe new analysis was included as part of the Climate Change Authority’s recommendation that the government pursue a 2035 emissions reduction target of 62-70%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a3f079051d2780d2ec26c9eca3b80ae8fd38931d",
      "title": "Final hours to apply: Be the life of TechCrunch Disrupt 2025 by hosting your own Side Event",
      "url": "https://techcrunch.com/2025/09/19/final-hours-be-the-life-of-techcrunch-disrupt-2025-by-hosting-your-own-side-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Today is your last chance to host a Side Event at TechCrunch Disrupt 2025 in San Francisco. By tonight, applications close. No extensions. No late entries. Apply now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "417cc998b05c5eb282f293d4c49cf6aa6c959c2a",
      "title": "First students evacuated from Gaza to study in UK",
      "url": "https://www.bbc.com/news/articles/czxwyygpgplo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T14:59:34.000Z",
      "summary_90w": "",
      "raw": "The group includes at least four medical doctors who have places to study at UK universities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d65e2ecd3bcb48ede82194792cff1c77f41efc8",
      "title": "What you need to know about England's semi-final with France at Women's Rugby World Cup",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cd63ged31n0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T14:57:39.000Z",
      "summary_90w": "",
      "raw": "Match preview, kick-off time, teams and head-to-head stats as England face France in the Women's Rugby World Cup semi-finals on Saturday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0cc85103ccbb82932b41bf537d281296c31bc31c",
      "title": "OpenAI might be developing a smart speaker, glasses, voice recorder, and a pin",
      "url": "https://www.theverge.com/news/781854/openai-chatgpt-hardware-rumors-smart-speaker-glasses-pin",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T14:50:38.000Z",
      "summary_90w": "",
      "raw": "Details leak about the AI gadgets that Jony Ive (left) and Sam Altman (right) may be cooking up.\t\n\nOne of the mysterious AI devices that OpenAI is considering developing with Apple’s former chief design officer, Jony Ive, “resembles a smart speaker without a display,” The Information reports. People “with direct knowledge of the matter” told the publication that OpenAI has already secured a contract with Luxshare, and has also approached Goertek — two of Apple’s product assemblers — to supply components like speaker modules for its future lineup of AI gadgets.\nOpenAI has also considered building glasses, a digital voice recorder, and a wearable pin, according to sources speaking to The Information, with the first products being targeted for release in late 2026 or early 2027.\nIn May, OpenAI CEO Sam Altman said that he envisioned a “family of devices” being born from the partnership with Ive, the first of which was described as being pocket-size, contextually aware, and screen-free. That tracks with these new rumors about OpenAI’s first device, but this is the first time that information has leaked about additional gadgets. \nAltman previously said that OpenAI’s first AI device wouldn’t be a pair of glasses, but these rumors suggest that smart eyewear may follow its initial product launch. An AI pin would be a surprising addition, given Ive wasn’t keen to develop a body-wearable and had slammed the Humane AI Pin. Previous reports also suggest that Altman and Ive have considered developing an in-ear device, which is notably absent in this rumored upcoming product lineup.\nThe Information’s sources say the ChatGPT maker has started tapping into Apple’s supply chain network in China to help produce these devices. Luxshare is a major assembler of iPhones and AirPods, while Goertek assembles AirPods, HomePods, and Apple Watches. Apple reportedly canceled a meeting with manufacturing and supply chain teams in China last month over concerns it would keep executives away from the company’s US headquarters, at a time when they were needed to prevent defections to OpenAI, according to The Information, citing an unnamed person “who was informed of the decision.”\nApple employees who worked on the company’s consumer hardware have also increasingly jumped ship to OpenAI since its partnership with Ive’s IO startup was announced. Tang Tan — OpenAI’s current chief hardware officer, and former Apple product design head — has promised people being poached from Apple that they will “encounter less bureaucracy and more collaboration at OpenAI,” a person familiar with Tang’s outreach told The Information.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41341c5e8d9f6a8d51c0379f23716b9f050e1a35",
      "title": "'We are rookies': Day 2 of CDC vaccine meeting opens with a reversal and a surprise",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/19/nx-s1-5546769/cdc-vaccine-acip-hepatitis-b-covid",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T14:48:08.000Z",
      "summary_90w": "",
      "raw": "RFK Jr.'s reshaped ACIP vaccine panel re-did a vote from yesterday on the MMRV vaccine and scrapped plans for another vote on the hepatitis B birth dose.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed279cfb7935e181bf100b5673e5237c6ad4141f",
      "title": "Meta&#8217;s quest to own your face",
      "url": "https://www.theverge.com/podcast/781830/meta-smart-glasses-ray-ban-vergecast",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T14:47:06.000Z",
      "summary_90w": "",
      "raw": "Meta obviously believes in smart glasses. It's not alone: Google, Apple, Samsung, and others all appear to be heavily invested in the idea that the next big gadget will be on your face. But at least for now, it appears Meta is the company building the best, most interesting, and most successful version of that gadget.\nOn this episode of The Vergecast, we talk a lot about Meta's big bet on face computers. But first, a surprise! Nilay joins the show for a special episode of Brendan Carr is a Dummy, America's favorite podcast within a podcast, to talk about why it matters so much that Jimmy Kimmel's show was suspended, how Carr and the Trump a …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4cb55336c2a3774ca0e63f922e7e417bb82f78c6",
      "title": "Scores killed by RSF drone strike on mosque in besieged Sudanese city",
      "url": "https://www.theguardian.com/world/2025/sep/19/rsf-drone-strike-kills-scores-people-mosque-sudan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T14:45:42.000Z",
      "summary_90w": "",
      "raw": "First responders say 75 worshippers dead as paramilitaries push to capture last foothold of Sudanese army in Darfur\nA drone strike by the paramilitary Rapid Support Forces on the besieged Sudanese city of El Fasher has killed 75 people worshipping in a mosque, first responders have said, as the group continued its push to capture the last foothold of Sudan’s army in the Darfur region.\nThe attack, one of the deadliest this year in the city, hit the al-Daraja neighbourhood, where civilians from the famine-hit Abu Shouk displacement camp had fled after it was overrun by fighters .\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc7735e9b1361683862a726300e93ea1b9247051",
      "title": "Prison officer given suspended term for inmate affair",
      "url": "https://www.bbc.com/news/articles/czxwywr8eqko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T14:43:32.000Z",
      "summary_90w": "",
      "raw": "Megan Breen, 23, was given a 10-month suspended sentence for the relationship at HMP Prescoed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "129299c37f32dcca104c1671ef44ff18ae84ceed",
      "title": "First look at the Google Home app powered by Gemini",
      "url": "https://www.theverge.com/news/781810/first-look-google-home-app-powered-by-gemini",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T14:40:59.000Z",
      "summary_90w": "",
      "raw": "A Google Home app redesign is coming.\t\n\nFollowing the announcement that it is bringing Gemini to its Google Home smart home platform, it appears the company is updating its Google Home app to incorporate the new features. Android Authority dove into code for the upcoming v3.41.50.3 version of the app and found “a significant redesign.” \nWhile the overall UI doesn’t look like it’s changed dramatically, some usability tweaks streamline the app while putting Gemini front and center.\n\nAccording to screenshots published by Android Authority and detailed in a YouTube video, you can now “Ask Home” to control your devices by typing or saying what you want to happen or to search your video and home history to get detailed descriptions of what has already happened. This is all accessible through a new Ask Home search bar at the top of the app, which, according to AA, opens a new “Ask Home” conversation screen.\nGoogle had already announced that Gemini for Home is coming to  Google’s smart speakers and displays, allowing you to use natural language to control smart home devices with your voice, so it’s logical that this function will also be part of the Home app.\nOther updates AA spotted included that the Favorites tab has been renamed to Home, and the Devices and Settings tab has gone from the bottom bar, leaving only three icons . (Devices will now be accessible via a grid icon in the Home tab.)\nIt looks like you will also be able to add outdoor air quality and temperature as a favorite tile, and there are new icons for video and a thermometer on the Home page. The latter may hint at upcoming Nest hardware, which is slated to launch next month.\nI hope this big app refresh will also bring the many features Google has been trialing in its Public Preview program to all users.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6ccf33b5ef476121fb95ad7ab765a81e30b69a34",
      "title": "Meta Ray-Ban Display and everything else unveiled at Meta Connect 2025",
      "url": "https://techcrunch.com/2025/09/19/meta-connect-2025-what-to-expect-and-how-to-watch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T14:40:27.000Z",
      "summary_90w": "",
      "raw": "Meta unveiled new versions of its AI-powered smart glasses, as well as a gesture-indicating wristband.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9f4aba42916b0ecf283b555f147e49855995526",
      "title": "Meet the latest VC judges joining Startup Battlefield 200 at TechCrunch Disrupt 2025 ",
      "url": "https://techcrunch.com/2025/09/19/meet-the-latest-vc-judges-joining-startup-battlefield-200-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Twenty founders will pitch their companies on the Disrupt Stage, but only one will walk away with the $100,000 equity-free prize and the coveted Disrupt Cup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "319fa0efb4644cd234bbaf6a94c7532473f37f6a",
      "title": "British couple freed by Taliban hug daughter in emotional reunion",
      "url": "https://www.bbc.com/news/articles/c0q7l8ewj0wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T14:29:57.000Z",
      "summary_90w": "",
      "raw": "Barbie, 76, and Peter Reynolds, 80, arrive in Qatar after being detained in Afghanistan for months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a918734fda04c5849bb75b8f2dbdf7ad66edd4e",
      "title": "Drone strike on Sudan mosque kills 78, medic tells BBC",
      "url": "https://www.bbc.com/news/articles/cp8wzzjze8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T14:29:37.000Z",
      "summary_90w": "",
      "raw": "Local activists and residents describe the early morning attack on worshippers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "830b53ea20eb4fbbde9d49b81bc2b6ca0c0db3dc",
      "title": "Octopus Energy spins off its Kraken utility billing and AI platform",
      "url": "https://techcrunch.com/2025/09/19/octopus-energy-spins-off-its-kraken-utility-billing-and-ai-platform/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T14:28:03.000Z",
      "summary_90w": "",
      "raw": "The British renewable energy provider said that its Kraken platform had $500 million in committed annual revenue, spurring a spinoff that could result in a massive IPO.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "79814ae4288a0bcc010eaa9e4d3a1a20e820c642",
      "title": "How developers are using Apple’s local AI models with iOS 26",
      "url": "https://techcrunch.com/2025/09/19/how-developers-are-using-apples-local-ai-models-with-ios-26/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T14:21:29.000Z",
      "summary_90w": "",
      "raw": "As iOS 26 is rolling out to all users, developers have been updating their apps to include features powered by Apple's local AI models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2ce764448fe39f053feeb805f3c897947b91daf5",
      "title": "UK and Irish governments agree new Troubles legacy deal",
      "url": "https://www.bbc.com/news/articles/ckged550k76o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T14:18:09.000Z",
      "summary_90w": "",
      "raw": "The UK and Irish governments announce a framework which seeks to heal a rift between London and Dublin created by the NI Legacy Act.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1412f300783ae952c62e65aae9d34c4c7beb58ee",
      "title": "Watch: Hugs on tarmac as family reunite after Afghan ordeal",
      "url": "https://www.bbc.com/news/videos/cly6v6r531jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T14:11:39.000Z",
      "summary_90w": "",
      "raw": "The couple's family say they are \"overwhelmed with gratitude and relief\" at their release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0c25daa6e13abd558e40dbaac832df48a497e64",
      "title": "Him is a grueling and messy takedown of American football culture",
      "url": "https://www.theverge.com/entertainment/781175/him-review-justin-tipping-marlon-wayans",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "There is a certain degree of body horror baked into American football that becomes readily apparent whenever players sustain gruesome, career-ending injuries on camera. For some, football's overt violence is part of its appeal, and players are seen as people who have chosen to risk their safety in pursuit of fame and glory. Over the years, the public has become much more aware of football's potential to leave players' bodies and minds irreparably damaged. Much has also been written about the structural racism that is pervasive throughout the football business. But the NFL continues to rake in billions of dollars annually because fans love tu …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f45e66d5b12749936f099d120228ffdf661e9b60",
      "title": "One week left: Lock in discounted pricing for TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/19/one-week-left-lock-in-discounted-pricing-for-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "We are in the final week to lock in your TechCrunch Disrupt 2025 pass and save up to $668. Join one of the biggest tech gatherings of the year — commit now before prices rise on September 27.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a34f43f1128c38c6f7374ea2be681477d14a328b",
      "title": "The strongest argument for smart glasses is accessibility",
      "url": "https://www.theverge.com/column/781772/optimizer-newsletter-meta-ray-ban-display-smart-glasses-accessibility",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Regardless of how you feel about these devices, they are currently helping disabled communities live more independently.\t\n\nThis is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here.\nThere's a hard conversation to be had about smart glasses in the coming weeks and months. At Meta Connect 2025, I got a first glimpse of the Meta Ray-Ban Display, the company's first pair of smart glasses with a built-in monocular display. There's no beating around the bush. The demos I got were nothing short of impressive. But somet …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "40723b9f9d703ce272c4779b53dabba0c60e18c4",
      "title": "Tour our smart home reviewer’s smart backyard",
      "url": "https://www.theverge.com/video/781682/tour-smart-backyard",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Esther, the chicken, facing a Segway robot lawnmower. | Photo: Alex Parkin / The Verge\t\n\nWhen The Verge's senior smart home reviewer, Jennifer Pattison Tuohy, offered to give us a tour of her smart backyard, I was thrilled. Firstly, I have never seen a technologically advanced backyard curated by an industry expert before, and secondly, I wasn't even sure what to expect. My vision of a smart home includes automated vacuums, a smart thermostat, and maybe one of those AI fridges that suggests recipes - all of which work within controlled environments and are built around making life inside more comfortable. So I found myself repeatedly asking, \"How exactly do smart devices make something as unyielding as outside, comfortable?\" \nI …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1108421e035da810210a4c32ccffb5f0a2d25c95",
      "title": "Amsterdam’s answer to its rubbish crisis? Remove some of the litter bins",
      "url": "https://www.theguardian.com/world/2025/sep/19/amsterdams-answer-to-its-rubbish-crisis-remove-some-of-the-litter-bins",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T13:48:35.000Z",
      "summary_90w": "",
      "raw": "Problems have arisen in Dutch capital since introduction of a deposit scheme for small bottles and cans\nCity leaders in Amsterdam are taking a novel approach to keeping its streets clean – by taking away litter bins to combat rubbish in part blamed on people rifling through them to obtain refund deposits on some discarded items.\nThere has been a surge in complaints about litter in the Dutch capital since the introduction of a deposit scheme for small bottles and cans. Last year, a quarter of residents described their neighbourhood as dirty or very dirty, rising to two in five in the city centre.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "777cff29cba59665ea218f2da97407703a4d86d5",
      "title": "US TV hosts back Kimmel as Trump threatens TV networks",
      "url": "https://www.bbc.com/news/articles/clyxjve3pe2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T13:06:25.000Z",
      "summary_90w": "",
      "raw": "America's leading late-night TV hosts lament Jimmy Kimmel's suspension as a \"blatant assault on freedom of speech\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9d6e7e2a89e3bfc7c3f0a8dd38c53e405585492",
      "title": "House full of rubbish goes to auction at £38k",
      "url": "https://www.bbc.com/news/articles/c1dqxnrqe2eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T11:58:26.000Z",
      "summary_90w": "",
      "raw": "The three-bedroom-house in Nantlle is in need of renovation and refurbishment.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02444f271af7321f71436a10f0d5ab7b7c173d0b",
      "title": "South African hospital worker arrested with human placentas",
      "url": "https://www.bbc.com/news/articles/cdx20q10273o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T11:55:22.000Z",
      "summary_90w": "",
      "raw": "The maternity cleaner was allegedly seeking potential buyers for the body tissue when she was picked up.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93a187a7b2e26b873114fe1c32ae4a9aea65cb90",
      "title": "Taliban official dismisses Trump's hope to 'take back' Afghan airbase",
      "url": "https://www.bbc.com/news/articles/c24rz9jeyjjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T11:45:25.000Z",
      "summary_90w": "",
      "raw": "Bagram airbase was handed over to the Afghan military shortly before the Taliban returned to power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "272f53b17cdd2694d109086bc4d6ea56d088dcee",
      "title": "Kirk's death fuels free speech disputes. And, vaccine panel changes MMRV guidance",
      "url": "https://www.npr.org/2025/09/19/g-s1-89564/up-first-newsletter-free-speech-charlie-kirk-cdc-mmrv-vaccine-antifa-terror-designation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T11:08:07.000Z",
      "summary_90w": "",
      "raw": "Free speech has become an increasing focal point after comments about Charlie Kirk's assassination have caused people to lose jobs. And, a CDC vaccine panel rolls back MMRV vaccine guidance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a99d214df16ea45e9d072fb5979869cec209885",
      "title": "Their teenage sons died by suicide. Now, they are sounding an alarm about AI chatbots",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/19/nx-s1-5545749/ai-chatbots-safety-openai-meta-characterai-teens-suicide",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Grieving parents and online safety advocates at a congressional hearing called for new laws to regulate AI companion apps to protect the mental health of minors.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26a6050ee8d8c75986ba07cb4087129a05d01cca",
      "title": "What FCC chair's threats against ABC could mean for other media companies",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5545681/what-fcc-chairs-threats-against-abc-could-mean-for-other-media-companies",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T10:53:35.000Z",
      "summary_90w": "",
      "raw": "Robert Corn-Revere with the Foundation for Individual Rights and Expression talks about the effect the FCC chair's threats against ABC could have for other media companies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6d7ccc2cf22cd027d97b9e9b941f3441f0938f0",
      "title": "Aid cuts hit Uganda hard. With worry and grit, it's finding new ways to save lives",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/19/g-s1-88001/health-care-aid-cuts-uganda",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T10:48:47.000Z",
      "summary_90w": "",
      "raw": "Uganda is one of the countries that's greatly affected by the reduction of U.S. foreign aid. Here's how the health care system is responding — with trepidation, innovation and resilience.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "864852ee31ab00801ca555085e3bfebbf3e27cf3",
      "title": "MI6 launches dark web portal to attract spies in Russia",
      "url": "https://www.bbc.com/news/articles/c0r0vk1j4j8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T10:35:18.000Z",
      "summary_90w": "",
      "raw": "Outgoing MI6 chief Sir Richard Moore said potential agents in Russia and around the world will be targeted by the UK spy agency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed168dff40ccc4035e54329108d24f85f37ed363",
      "title": "Police find remains they think are US man accused of killing his daughters",
      "url": "https://www.bbc.com/news/articles/cp8j9v711pjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T10:01:31.000Z",
      "summary_90w": "",
      "raw": "The human remains of a man wanted on suspicion of killing his three daughters have been found in Washington state.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e43e31fa4760b72dc21abf99d81e5f74abb6d9b7",
      "title": "Mastodon has a new plan to make money: Hosting and support services for the open social web",
      "url": "https://techcrunch.com/2025/09/19/mastodon-has-a-new-plan-to-make-money-hosting-and-support-services-for-the-open-social-web/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Mastodon launches hosting and support services to generate revenue and expand the open social web.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "45ccfb75ea534294b2f4372152fb61969dd8c003",
      "title": "Three people died when Optus network upgrade affected triple zero calls, CEO confirms",
      "url": "https://www.theguardian.com/business/2025/sep/19/three-people-died-when-optus-network-upgrade-affected-triple-zero-calls-ceo-confirms",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T09:58:37.000Z",
      "summary_90w": "",
      "raw": "Telco head says two people in South Australia and one in Western Australia died, offering his ‘sincere apologies’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThree people died after an Optus network upgrade prevented triple zero calls in three states and territories on Thursday, the telco’s chief executive officer has confirmed.\nTwo of the deceased were in South Australia and one was in Western Australia, Stephen Rue said, but added that welfare checks after the upgrade were “ongoing”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db958afcc993bccdbbd0f51fb471e34780a404d3",
      "title": "Grocery prices have jumped up, and there's no relief in sight",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5539547/grocery-prices-tariffs-food-inflation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-19T09:30:00.000Z",
      "summary_90w": "",
      "raw": "Groceries saw their biggest jump in nearly three years last month, a worrisome sign for inflation-weary shoppers. Tariffs are contributing to higher prices for imported staples like bananas and coffee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f63f985cbe3710a7fa214b1070f15dc702a2a94a",
      "title": "Kenya’s Turkana people genetically adapted to live in harsh environment, study suggests",
      "url": "https://www.theguardian.com/global-development/2025/sep/19/kenya-turkana-people-genetically-adapted-to-live-in-harsh-environment-study-suggests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T09:21:37.000Z",
      "summary_90w": "",
      "raw": "Research which began with conversations round a campfire and went on to examine 7m gene variants shows how people survive with little water and a meat-rich diet\nA collaboration between African and American researchers and a community living in one of the most hostile landscapes of northern Kenya has uncovered key genetic adaptations that explain how pastoralist people have been able to thrive in the region.\nUnderlying the population’s abilities to live in Turkana, a place defined by extreme heat, water scarcity and limited vegetation, has been hundreds of years of natural selection, according to a study published in Science.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "800eb6de6e10e0ad44c339c04c5738a7d13c39c5",
      "title": "A judge ordered Google to share its search data. What does that mean for user privacy?",
      "url": "https://www.npr.org/2025/09/19/nx-s1-5538073/google-search-antitrust-data-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-19T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The ruling in the Google antitrust trial has led to a host of hard-to-answer questions about the future of Google's search data, which the tech giant must now share with competitors. What does that mean for users' data privacy?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e50ec8c38e7d585d4e4a7bb21ee16e9ac48a6cb5",
      "title": "Optus CEO says three people died after triple zero calls affected during network upgrade – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T08:44:35.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nConvicted rapist Gareth Ward argues he should receive lighter sentence due to ‘enormous fall from grace’\n\nGet our breaking news email, free app or daily news podcast\n\nA so-called miracle cure for stroke is no more effective than a placebo, a study has found.\nAAP reports the treatment, known as perispinal etanercept, involves injecting an arthritis medication into the back of a patient’s neck and tilting them downwards so it travels towards their brain.\nIt’s been a challenge, because … you buy a car today and it’s operating for 15 or more years, so it takes time to turn that around.\nI’m not here to pretend to you that that has all of a sudden impacted on emissions yet. It’s going to take quite a while to have the full impact on our emissions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9df4c6788d881f907f8a010a893c41d10bba80b7",
      "title": "The lonely life and death of Delhi's only African elephant",
      "url": "https://www.bbc.com/news/articles/cx2nlevy2gpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T07:03:00.000Z",
      "summary_90w": "",
      "raw": "For 24 years, Shankar endured a lonely existence - including at least 13 spent in solitary confinement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5e89f0343676ea66100a3590034c6aa195aa8bb",
      "title": "Eritrean man is second to be deported to France under UK’s ‘one in, one out’ deal",
      "url": "https://www.theguardian.com/uk-news/2025/sep/19/eritrean-man-is-second-to-be-deported-to-france-under-uk-one-in-one-out-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T06:55:42.000Z",
      "summary_90w": "",
      "raw": "Home Office says man left Heathrow for Paris early on Friday after losing high court attempt to block move\nAn Eritrean man has been deported to France under the UK government’s “one in, one out” deal with the neighbouring country.\nThe man – the second to be deported under the agreement – was on a flight that left Heathrow for Paris at 6.15am on Friday, the Home Office confirmed after he lost a high court attempt to block the move.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7af3e2713e9cf81a2334ae868564482d63724597",
      "title": "US blocks UN call for Gaza ceasefire for sixth time",
      "url": "https://www.bbc.com/news/articles/ce3yj41083no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T06:02:33.000Z",
      "summary_90w": "",
      "raw": "Washington's representative says the Security Council resolution does not go far enough in condemning Hamas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c001a2435931fe7dc9b359d8db55abf6653052b9",
      "title": "China issues warning to Papua New Guinea over defence deal with Australia",
      "url": "https://www.theguardian.com/world/2025/sep/19/china-issues-warning-papua-new-guinea-over-defence-deal-with-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T05:34:56.000Z",
      "summary_90w": "",
      "raw": "Beijing’s comments come as leading military figures in PNG express concern over a potential defence treaty with Australia\n China has urged Papua New Guinea not to sign a treaty that could restrict or prevent it from cooperating with another country, days after Australia failed to secure a defence pact with the Pacific nation.\nIn a statement on Facebook late on Thursday, the Chinese embassy in Papua New Guinea said it respected the country’s “right to conclude a bilateral treaty with other countries on a voluntary basis”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T05:08:44.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7080fc9b7ae98d28411bb71e68190976a005f429",
      "title": "Premier League ticket black market exposed by BBC investigation",
      "url": "https://www.bbc.com/sport/articles/cwy9dlqxx2ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T05:05:42.000Z",
      "summary_90w": "",
      "raw": "Find out what happened when we tried to attend four Premier League games with tickets from \"unauthorised\" websites.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bbf8a09fd9da3d6fb40596ec4a1df38ff5d14945",
      "title": "Bali to block new hotels and restaurants after deadly flooding raises questions about mass tourism",
      "url": "https://www.theguardian.com/world/2025/sep/19/bali-bans-new-hotels-restaurants-after-deadly-flooding-raises-questions-about-mass-tourism",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T04:19:44.000Z",
      "summary_90w": "",
      "raw": "Bali governor says new instructions issued to stop hotels and restaurants being built on productive land, especially rice fields\nIndonesia will ban the construction of new hotels and restaurants built atop cleared rice fields and agricultural land on the popular resort island of Bali, after recent flash flooding killed at least 18 people.\nA state of emergency was declared on Bali on 10 September after the island experienced the most severe flooding in more than a decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07fd07bd835f05aeff87a1ff4075558e1e45c3fb",
      "title": "Indian fintech Jar turns profitable by enabling millions to save in gold",
      "url": "https://techcrunch.com/2025/09/18/indian-fintech-jar-turns-profitable-by-helping-millions-save-in-gold/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-19T03:30:00.000Z",
      "summary_90w": "",
      "raw": "Jar has been profitable after tax for the past two quarters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba1a14eaf7a533db6e80001d5750abfd88c57baf",
      "title": "Doctor penalised for calling mushroom murderer 'disturbed sociopath'",
      "url": "https://www.bbc.com/news/articles/cjr51251353o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-19T02:56:35.000Z",
      "summary_90w": "",
      "raw": "Chris Webster said he realised Patterson was a killer within minutes of speaking to her.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "16fa2bce481565d1df7a13ce77c2438192132084",
      "title": "Mass protest expected in Philippines capital amid public fury over alleged corruption in government projects",
      "url": "https://www.theguardian.com/world/2025/sep/19/mass-protest-expected-in-philippines-capital-amid-public-fury-over-alleged-corruption-in-government-projects",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-19T02:18:23.000Z",
      "summary_90w": "",
      "raw": "Sunday’s demonstration in Manila to coincide with anniversary of 1972 martial law declaration as president backs rally in bid to placate anger\nThousands of people are expected to join a mass protest in Manila on Sunday amid a groundswell of anger in the Philippines against perceived corruption in government-funded flood control projects.\nDubbed the “Trillion Peso March”, the demonstration is named after a Greenpeace estimate of $17.6bn that the environmental organisation alleges is the amount skimmed from climate-related projects in 2023.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b28cbb1c2468483702bee792a5cecf35307d0515",
      "title": "The man taking on Trump's media foes",
      "url": "https://www.bbc.com/news/articles/c4g921p3eq3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-19T01:56:12.000Z",
      "summary_90w": "",
      "raw": "But it is unclear to what extent media companies might push back - at the potential expense of their bottom line.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a67fef8f0613ca0caa5393c044d436262041f52",
      "title": "Trolls mock me for having fewer viewers, Fortnite streamer Ninja tells BBC",
      "url": "https://www.bbc.com/news/articles/cvg98zd9q75o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-19T00:06:52.000Z",
      "summary_90w": "",
      "raw": "Tyler Blevins says trolls attack him every day for being less popular than he was at the height of his fame.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95a31dc54b98f3ce04128d9f39483486b4231e15",
      "title": "Why France is at risk of becoming the new sick man of Europe",
      "url": "https://www.bbc.com/news/articles/cvg9n6vr2eyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T23:34:01.000Z",
      "summary_90w": "",
      "raw": "The country is at the conjuncture of several crises at once - but is it fair to blame Macron for 'this shipwreck'?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a98f4c6841610e066d9c4a22a839c712809aa575",
      "title": "OpenAI’s research on AI models deliberately lying is wild ",
      "url": "https://techcrunch.com/2025/09/18/openais-research-on-ai-models-deliberately-lying-is-wild/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T22:54:20.000Z",
      "summary_90w": "",
      "raw": "AI models don't just hallucinate. They also \"scheme,\" meaning deliberately lie or hide their true intentions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04e8a25ef2d2234f69c818c4cd4256922a29999d",
      "title": "What's the FCC's role in what stations broadcast?",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5545742/whats-the-fccs-role-in-what-stations-broadcast",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T22:12:01.000Z",
      "summary_90w": "",
      "raw": "NPR's Ari Shapiro talks with former FCC chairperson Tom Wheeler about ABC pulling Jimmy Kimmel off the air after comments on the right's reaction to the killing of Charlie Kirk.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "410dd25be04376771b50ad5064b9520f17cbdb14",
      "title": "China is calling a TikTok deal a win. What's in it for them?",
      "url": "https://www.bbc.com/news/articles/c9dxq0jz2l9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-18T22:07:20.000Z",
      "summary_90w": "",
      "raw": "Experts tell the BBC what a final deal might look like, and what Beijing might get in return.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a84fee23caf3c35ce8ecb25ba820dd4e10769e07",
      "title": "Has Trump cancelled Jimmy Kimmel over Charlie Kirk?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5y?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T21:48:00.000Z",
      "summary_90w": "",
      "raw": "And we get an inside view of Trump's UK state visit with the president's chief of staff",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9d9dd2b099af522a87373aa42387738292612559",
      "title": "Kimmel's suspension for Kirk comments sparks furor over free speech and censorship",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5545671/kimmel-suspension-charlie-kirk-death-free-speech-censorship",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T21:42:26.000Z",
      "summary_90w": "",
      "raw": "After Jimmy Kimmel's show was suspended \"indefinitely\" for comments he made following Charlie Kirk's death, questions about free speech and just what is government censorship reach heightened levels.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d42844adeff70338bbfe349aac1c3acf8391dbd9",
      "title": "Ros Atkins on… What Kimmel's suspension means for free speech in the US",
      "url": "https://www.bbc.com/news/videos/crme42nr8exo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T21:38:29.000Z",
      "summary_90w": "",
      "raw": "The BBC's analysis editor looks at a decision that leading Democrats have called \"an abuse of power\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4357331718a6105447dd549318d4dfa4356515bf",
      "title": "Raising Series A in 2026: Insights from top early-stage VCs at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/18/term-sheets-traction-and-truth-bombs-inside-the-series-a-mindset-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T21:30:00.000Z",
      "summary_90w": "",
      "raw": "Katie Stanton (Moxxie Ventures), Thomas Krane (Insight Partners), and Sangeen Zeb (GV) share how to win Series A funding in 2026 at TechCrunch Disrupt 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f444fd5bc44cb8d6bbba601fb72c209b92db64eb",
      "title": "Jimmy Kimmel's suspension shows how the FCC is wielding its power",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5545617/jimmy-kimmels-suspension-shows-how-the-fcc-is-wielding-its-power",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T21:20:42.000Z",
      "summary_90w": "",
      "raw": "NPR's Ari Shapiro talks with former FCC chairperson Tom Wheeler about ABC pulling Jimmy Kimmel off the air after comments on the right's reaction to the killing of Charlie Kirk.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6639a084cb34d871c4e52427c796e7fbe29ad863",
      "title": "Huawei announces new AI infrastructure as Nvidia gets locked out of China",
      "url": "https://techcrunch.com/2025/09/18/huawei-announces-new-ai-infrastructure-as-nvidia-gets-locked-out-of-china/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T21:14:15.000Z",
      "summary_90w": "",
      "raw": "Huawei's SuperPoD interconnect technology creates clusters of chips, including AI chips, to increase compute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a53d840d4b41bb5e98de62f5fcf0239e381cecea",
      "title": "How AI startups are fueling Google’s booming cloud business",
      "url": "https://techcrunch.com/2025/09/18/how-ai-startups-are-fueling-googles-booming-cloud-business/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T20:53:33.000Z",
      "summary_90w": "",
      "raw": "Google Cloud is one of the company's fastest-growing business lines and continues to rack up new customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b4759f062e8c6ad8f70ea656c23c6c3abae078f0",
      "title": "Sarah Smith: Trump visit showed UK's warm relations - and limited influence",
      "url": "https://www.bbc.com/news/articles/cgkn3key65do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T20:06:48.000Z",
      "summary_90w": "",
      "raw": "The good-natured state visit demonstrated strong relations, but no ally is likely to change the US president's mind.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da4bfa4530d9bdf240148bd6dfb080b7d3acdf28",
      "title": "Starmer has avoided state-visit bear traps but has he changed any of Trump’s thinking?",
      "url": "https://www.theguardian.com/us-news/2025/sep/18/starmer-trump-state-visit-influence-ukraine-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T19:30:04.000Z",
      "summary_90w": "",
      "raw": "PM cannot afford for US president to walk away from Ukraine crisis and must persuade him to publicly support specific Gaza plans\nWith bear traps avoided and fireworks unlit, Keir Starmer will be delighted that his press conference with Donald Trump lent credence to his claim to be America’s first partner in defence, trade and now technology.\nTrump, for his part, got the “great pictures” he wanted and was on his best low-wattage behaviour. He said he did not disagree with his host about much, save Starmer’s plan to recognise a Palestinian state. And he teetered on the edge of being diplomatic, at least until he advised Starmer to use the military to stop small boats crossing the Channel.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "594c1b4a838bcce63ebb40b23f44f5b268c1ae6a",
      "title": "Tim Cook, Sam Altman, and more attend Trump’s UK state banquet",
      "url": "https://techcrunch.com/2025/09/18/tim-cook-sam-altman-and-more-attend-trumps-uk-state-banquet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T19:14:47.000Z",
      "summary_90w": "",
      "raw": "This change reveals the shifting economic needs of the U.K. and U.S. in the age of AI, as well as the rising prominence of technology and its leaders in Trump’s second administration.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c62aefc1f684b91cb15ed05c54f05fe9c3b229cb",
      "title": "US government charges British teenager accused of at least 120 ‘Scattered Spider’ hacks",
      "url": "https://techcrunch.com/2025/09/18/us-government-charges-british-teenager-accused-of-at-least-120-scattered-spider-hacks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T18:27:33.000Z",
      "summary_90w": "",
      "raw": "Thalha Jubair, 19, was arrested in London on Thursday and accused by U.K. and U.S. authorities of involvement in dozens of hacks, including London's transit system and the U.S. Courts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b628f630f0db6daa5827122d57023b6ab4377028",
      "title": "Democrats and Hollywood stars decry Kimmel's suspension as government censorship",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5545509/jimmy-kimmel-suspended-free-speech-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T18:26:45.000Z",
      "summary_90w": "",
      "raw": "High-profile politicians and performers are criticizing the suspension of Jimmy Kimmel's show as an attack on free speech. They are calling for the Trump administration and ABC to be held accountable.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2eee16e20d2229ee5a3111e7edb8736da6de0e89",
      "title": "Here’s the tech powering ICE’s deportation crackdown ",
      "url": "https://techcrunch.com/2025/09/18/heres-the-tech-powering-ices-deportation-crackdown/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T18:15:00.000Z",
      "summary_90w": "",
      "raw": "From phone spyware and facial recognition to phone unlocking technology and databases and more, this tech powers Trump's deportation machine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8444c858b1ab60ad674b7bc58ce4226c94901f0e",
      "title": "More than 250,000 displaced from Gaza City in past month, UN figures show",
      "url": "https://www.theguardian.com/world/2025/sep/18/un-figures-people-displaced-from-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T18:10:44.000Z",
      "summary_90w": "",
      "raw": "Tens of thousands more forced to flee makeshift homes and shelters daily in face of new Israeli offensive\nMore than a quarter of a million people have been displaced from Gaza City in the last month, according to figures from the UN, with tens of thousands more forced to flee makeshift homes and shelters daily in the face of a new Israeli offensive.\nStrikes by Israeli artillery, tanks and warplanes hit Gaza City again on Thursday as a UN official said “new waves of mass displacement” were under way, after about 60,000 fled the new assault in 72 hours earlier this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "16d12de02a4b01876bb81645648dda68dd39c934",
      "title": "Judges rule against Trump administration on deporting Guatemalan children and Venezuelans",
      "url": "https://www.theguardian.com/us-news/2025/sep/18/ruling-trump-deport-children-guatemalan-venezuelan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T18:10:34.000Z",
      "summary_90w": "",
      "raw": "Double defeat protects Venezuelans with temporary protected status and Guatemalan minors\nThe Trump administration has been handed a double defeat by judges in immigration cases, barring the executive branch from deporting a group of Guatemalan children and from slashing protections for many Venezuelans in the US.\nA federal judge on Thursday ordered the administration to refrain from deporting Guatemalan unaccompanied immigrant children with active immigration cases while a legal challenge plays out.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93d9c84b3833b9a4f306c98f28fe51791cb31be7",
      "title": "Notion launches agents for data analysis and task automation",
      "url": "https://techcrunch.com/2025/09/18/notion-launches-agents-for-data-analysis-and-task-automation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T18:00:00.000Z",
      "summary_90w": "",
      "raw": "The productivity platform said that the agent can create pages and databases, or update them with new data, properties, or views.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3bd05ac099c5cd9b5e7fe886a75769e8f5b2752",
      "title": "Uber is trying drone delivery again",
      "url": "https://techcrunch.com/2025/09/18/uber-is-trying-drone-delivery-again/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T17:57:17.000Z",
      "summary_90w": "",
      "raw": "The company is partnering with Flytrex to make Uber Eats deliveries later this year. Uber is also making a small investment in Flytrex.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e82e1040bc51e771122614e732c53dbcc9f462aa",
      "title": "Putin, Gaza, tariffs and Mandelson: key details from Trump-Starmer press conference",
      "url": "https://www.theguardian.com/us-news/2025/sep/18/donald-trumps-state-visit-press-conference-what-did-we-learn",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T17:56:06.000Z",
      "summary_90w": "",
      "raw": "The two leaders skirted around areas of potential conflict but there was still plenty of news and startling information\nGiven an hour to speak freely in front of the world’s media, Donald Trump is always likely to spring a surprise or two.\nHis joint press conference with Keir Starmer at Chequers on Thursday was largely a disciplined performance, skirting around several potential topics of conflict. But it was still full of news, telling details, and startling information and opinions. \n\r\n Here are some of the most important, and some you might have missed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9720856937aa3ceef9d85d0d2107d851cfafc776",
      "title": "Weekly quiz: Why were these nuns on the run?",
      "url": "https://www.bbc.com/news/articles/cn5qk09v151o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T17:40:15.000Z",
      "summary_90w": "",
      "raw": "How much attention did you pay to what happened in the world over the past seven days?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "877a3c9865f2013847f72909f502a42539acb8c5",
      "title": "Chipmaker Nvidia to invest $5bn in rival Intel",
      "url": "https://www.bbc.com/news/articles/c4gjd1mnjpyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-18T16:30:58.000Z",
      "summary_90w": "",
      "raw": "The two American chipmakers will partner to make personal computer and data centre chips, in a lifeline for Intel as it struggles to profit from the AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2697728fb2e412df39911f1d4536a23e95349a7",
      "title": "Two teenagers charged over Transport for London cyber attack",
      "url": "https://www.bbc.com/news/articles/c62z8k14kxxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-18T14:32:17.000Z",
      "summary_90w": "",
      "raw": "The police say the hack caused \"significant disruption\" and \"millions in losses\" for TfL.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "faca9ddd04016d25f556b75434021beaad2abdd9",
      "title": "Facebook owner unveils new AI-powered smart glasses",
      "url": "https://www.bbc.com/news/articles/c5y599yz0l3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-18T12:25:49.000Z",
      "summary_90w": "",
      "raw": "The event comes as Meta faces ongoing scrutiny over the impact of its products, particularly on children.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: US President Donald Trump on second state to UK",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T11:15:06.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3a5c0bb52860491a9b25a1ef6c176c6cd5bd29d",
      "title": "Foreign influencers are doing their best to spin the Charlie Kirk assassination",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5544235/kirk-assassination-foreign-influence-disinformation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-18T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Russia, Iran and China have all attempted to shape the narrative, but so far, their influence has been relatively minor, experts say.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7c13522d4ec05444ed5cabe9e53cfe9eb5269ca",
      "title": "Kirk shooting videos spread online, even to viewers who didn't want to see them",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5542231/kirk-shooting-violence-social-media",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Graphic videos of the Charlie Kirk shooting spread widely online, raising concerns over the emotional and political toll of exposure to violent imagery.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3d3a66642c9d7a609783180c1ce86731df377bcb",
      "title": "New policies are making life harder for trans people — and prompting big financial decisions",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5445303/transgender-people-financial-anxiety",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T09:00:00.000Z",
      "summary_90w": "",
      "raw": "White House executive orders and legislation in many states have targeted the rights and protections of trans people. For some, that has meant increased financial worry.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "64c1d9e35c9be0be17fd9a7bd88fd07c0babdba0",
      "title": "What does the Google antitrust ruling mean for the future of AI?",
      "url": "https://www.npr.org/2025/09/18/nx-s1-5539869/google-antitrust-ruling-future-of-ai",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-18T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A federal judge's mild ruling in the Justice Department's suit over Google's search engine monopoly has critics worried that the tech giant can now monopolize artificial intelligence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9c7456a6ade5cb426fa8bb5cca1dfbcd19f66e6d",
      "title": "Katty Kay: America is at a dangerous crossroads following the Charlie Kirk shooting ",
      "url": "https://www.bbc.com/news/articles/c78n0e83ye0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T04:18:51.000Z",
      "summary_90w": "",
      "raw": "This moment has parallels with other periods of discord in US history, but it is more complicated than simply repeating them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c769c68ed396ab9102fd2c8b25d7f9d4763914f1",
      "title": "'Ultimate in cancel culture': Fans outside Jimmy Kimmel studio react to show's axing",
      "url": "https://www.bbc.com/news/videos/c5yqp5n01e0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T03:05:43.000Z",
      "summary_90w": "",
      "raw": "The BBC spoke to fans who expressed surprise and disappointment after the late night show was taken off air \"indefinitely\" over Charlie Kirk comments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e066b6155405bc0884fa4814bcdafe5ffd6fdb5d",
      "title": "Venezuela starts days of military and ‘electronic warfare’ drills after US strikes on alleged drug boats",
      "url": "https://www.theguardian.com/world/2025/sep/18/venezuela-military-exercises-after-us-boat-attacks-kill-14-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T00:41:51.000Z",
      "summary_90w": "",
      "raw": "Armed forces say ‘special naval militia’ involved in Caribbean deployment as defence minister cites ‘threatening, vulgar voice’ of Washington\nVenezuela says it has begun three days of military exercises on its Caribbean island of La Orchila as tensions soar amid US military activity in the region.\nForces deployed for what Washington called an anti-drug operation have blown up at least two Venezuelan boats and a combined 14 people allegedly transporting drugs across the Caribbean this month – a move slammed by UN experts as “extrajudicial execution”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77f9d052fad8ba223bc25dea37fe04a5e791751d",
      "title": "Battling a rare brain-eating disease in an Indian state",
      "url": "https://www.bbc.com/news/articles/c79ven0xxyqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T00:00:04.000Z",
      "summary_90w": "",
      "raw": "In Kerala this year, more than 70 people have been diagnosed and 19 have died from the brain-eating amoeba.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80c607567baa32ff1e204e61e914e2a9ca62d465",
      "title": "Spain counts the cost of 'nightmare' wildfire summer",
      "url": "https://www.bbc.com/news/articles/cge211w5lr5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T23:04:55.000Z",
      "summary_90w": "",
      "raw": "The country's farming and tourism sectors have been heavily affected by a spate of blazes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d40955c9a90e03baeccd5975985bfb6f976e9c7",
      "title": "Could the US interest rate cut boost the housing market?",
      "url": "https://www.bbc.com/news/articles/c4gv3ynyp43o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T23:02:17.000Z",
      "summary_90w": "",
      "raw": "Borrowing costs are not guaranteed to come down much more than they already have, even after this week's rate cut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41f19cf059c1ca2678187f4758d7f847bb6782a0",
      "title": "Fury over corruption and 'nepo babies' as floods paralyse Philippines",
      "url": "https://www.bbc.com/news/articles/czrp7xkd2gpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T22:06:32.000Z",
      "summary_90w": "",
      "raw": "An unusually fierce monsoon has derailed daily life more than ever in the South East Asian nation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a37c924234f58658fee5ad5a0b6f7aca2df3994",
      "title": "Watch: Pomp and protests on day one of Trump state visit ",
      "url": "https://www.bbc.com/news/videos/cd07v4g0yy3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T21:53:29.000Z",
      "summary_90w": "",
      "raw": "King Charles hosts Donald Trump at Windsor Castle on the first full day of his UK state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49b2f92b31839efc32952481a218b025efa20554",
      "title": "Nvidia boss says UK will be 'AI superpower' as tech firms invest billions",
      "url": "https://www.bbc.com/news/articles/c7016ljre03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T16:00:11.000Z",
      "summary_90w": "",
      "raw": "Microsoft, Google and Nvidia have announced investments as part of a £31bn UK-US \"Tech Prosperity Deal\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3881366c4be9bd96924917f8cb4cf9b2503fd146",
      "title": "Flying cars crash into each other at Chinese air show",
      "url": "https://www.bbc.com/news/articles/cn5qk4de997o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T12:34:08.000Z",
      "summary_90w": "",
      "raw": "Footage shared on social media shows burning wreckage on the ground after the mid-air collision.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "64521fb1d717a01d2785b63b3639f7e535bd91c4",
      "title": "Nvidia boss 'disappointed' by reported China chip ban",
      "url": "https://www.bbc.com/news/articles/cqxz29pe1v0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T11:23:24.000Z",
      "summary_90w": "",
      "raw": "Jensen Huang said the US needs \"to make sure that that people can access this technology from all over the world\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d126c1b5da42cc4bd45e152153e87422efbffc7b",
      "title": "Latest blow to Labor’s Pacific defence strategy might not be the embarrassment the Coalition claims",
      "url": "https://www.theguardian.com/world/2025/sep/17/png-australia-defence-treaty-delay-blow-for-anthony-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T08:41:03.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese must now save the defence agreement with Papua New Guinea, a week after a similar plan with Vanuatu was delayed\n\nGet our breaking news email, free app or daily news podcast\n\nWhen Anthony Albanese landed in Papua New Guinea for celebrations marking 50 years of independence this week, he was expecting to sign a landmark mutual defence agreement and designate the one-time colony as a formal ally of Australia.\nInstead, despite insisting the text of the agreement had been approved, the prime minister left Port Moresby on Wednesday with only a 300-word joint communique signed with his counterpart, James Marape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd0de4a53e9254ca2053bdc21e5409cebb8b1542",
      "title": "Champions League debut and Luiz - the rise of Pafos",
      "url": "https://www.bbc.com/sport/football/articles/cj6x7rrxzedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T06:15:58.000Z",
      "summary_90w": "",
      "raw": "BBC Sport looks at Pafos FC, the team from Cyprus set to make their full Champions League debut with David Luiz in defence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "beef6fa0eb6ca20ac0734bafeefd2cc117576db0",
      "title": "'The hungry can't stay silent' - behind deadly protests in oil-rich Angola",
      "url": "https://www.bbc.com/news/articles/c8ex6k88yy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T02:34:08.000Z",
      "summary_90w": "",
      "raw": "As the 50th independence anniversary approaches the country grapples with poverty and inequality.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35e1f18be2566265a28f6d5206c0cce379ab9109",
      "title": "Syria's worst drought in decades pushes millions to the brink",
      "url": "https://www.bbc.com/news/articles/c70x500lkdno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T01:44:40.000Z",
      "summary_90w": "",
      "raw": "The drought has slashed wheat harvests by 40% in a country where nearly 90% of the population already lives in poverty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98eed288986f3bb0ea338603fd7ad567a62ed5e6",
      "title": "Rocks on train tracks strand 900 Machu Picchu tourists amid protest",
      "url": "https://www.theguardian.com/world/2025/sep/17/rocks-on-train-tracks-strand-900-machu-picchu-tourists-amid-protest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T01:31:30.000Z",
      "summary_90w": "",
      "raw": "About 1,400 visitors were evacuated but hundreds were left stuck because of action linked to bus contract dispute, say Peru authorities\nAt least 900 tourists were stranded near the ancient Inca citadel of Machu Picchu on Tuesday, Peru’s tourism minister said, after a passenger train service was suspended due to a protest.\nPeruRail said service was suspended on Monday because the route in Peru’s mountainous Cusco region had been blocked by “rocks of various sizes” as residents clashed with authorities and bus companies. PeruRail’s local unit also said “third parties” had excavated part of its rail route, which affected the track’s stability and slowed down the evacuation of tourists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34a72c5ac071263b0ee85a5790a9345279142b1b",
      "title": "Watch: Key takeaways from Charlie Kirk suspect's first court appearance",
      "url": "https://www.bbc.com/news/videos/cvgj59p3v7po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T00:56:27.000Z",
      "summary_90w": "",
      "raw": "The BBC's Nada Tawfik reports from Utah, where Tyler Robinson appeared in court as prosecutors read the charges against him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66ddf4ad4a469e8cf2d3460200bc8a3d24515951",
      "title": "Anthony Albanese fails to seal defence treaty between Australia and PNG",
      "url": "https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T00:05:39.000Z",
      "summary_90w": "",
      "raw": "Australian PM will leave Port Moresby without agreement, sparking a setback for strategy to minimise China’s influence among Pacific nations\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAnthony Albanese’s strategy of pushing back against China in the Pacific has been dealt another blow, with a major defence treaty with Papua New Guinea delayed amid concerns about sovereignty.\nA deal was expected with the former Australian colony this week but the prime minister is set to leave Port Moresby without signing the so-called Pukpuk mutual defence treaty with his counterpart, James Marape, on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e09d3a0d584629b135c97a335ec264606a48f1e4",
      "title": "‘We’re still in the dark’: a missing land defender and the deadly toll of land conflict on Indigenous people",
      "url": "https://www.theguardian.com/environment/2025/sep/17/missing-land-defender-deadly-toll-land-conflict-indigenous-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T23:01:18.000Z",
      "summary_90w": "",
      "raw": "Julia Chuñil is one of 146 land defenders who were killed or went missing last year, a third of them from Indigenous communities\nOne day last November, Julia Chuñil called for her dog, Cholito, and they set off into the woods around her home to search for lost livestock. The animals returned but Chuñil, who was 72 at the time, and Cholito did not.\nMore than 100 people joined her family in a search lasting weeks in the steep, wet and densely overgrown terrain of Chile’s ancient Valdivian forest. After a month, they even kept an eye on vultures for any grim signs. But they found no trace of Chuñil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb6f79e5d26a4e871ae3209f230cb1776100d4a",
      "title": "Trump extends TikTok reprieve as deal nears",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543413/tiktok-trump-ban-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-16T20:10:09.000Z",
      "summary_90w": "",
      "raw": "While legally questionable, the extension comes just as it appears China and the U.S. may finally have a deal on TikTok's fate.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9f92c7011ddc8d533025d3f4c904c9f7e3a22b3",
      "title": "Deal is done to keep TikTok in the US, says Trump",
      "url": "https://www.bbc.com/news/articles/c7847q9xvwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T19:56:54.000Z",
      "summary_90w": "",
      "raw": "The social media platform had faced a ban in the US over national security concerns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6aeaffe1e3ca5d4f53f06de8b9776c77126dc58b",
      "title": "Who was Agnes Wanjiru, Kenyan woman killed near army base in 2012?",
      "url": "https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T15:37:20.000Z",
      "summary_90w": "",
      "raw": "Relatives remember a dependable, kind and funny woman and remain traumatised by her death\nPerhaps the Kenyan market town of Nanyuki’s greatest claim to fame was that it straddles the equator. But now it has become synonymous with something darker. It was here where Agnes Wanjiru was born and lived and where she was brutally killed.\nHer family searched for her for months before her body was found stuffed into a septic tank at the same hotel where she had last been seen alive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fda108e96638becd32441a61f74ead623332d49",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "url": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T14:28:29.000Z",
      "summary_90w": "",
      "raw": "High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old\n\nProfile: who was Agnes Wanjiru?\n\nA warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.\nThe high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and his extradition to Kenya was being sought.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a6312505e8e474f11a0efed51b03de5f5914245",
      "title": "Google owner reveals £5bn AI investment in UK ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/crmek723dz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T09:44:20.000Z",
      "summary_90w": "",
      "raw": "Google's president and chief investment officer Ruth Porat tells the BBC there are \"profound opportunities in the UK\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b2914e242af7fcbe31bbde4de1e054a5673857f",
      "title": "Bowen: UN commission report on genocide is blunt indictment of Israel's actions in Gaza",
      "url": "https://www.bbc.com/news/articles/c0m4rxjppl8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T07:01:46.000Z",
      "summary_90w": "",
      "raw": "A new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T04:20:10.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b091cca68567bfa47ecacac0773cd3113129a276",
      "title": "Fast-paced zombie horror starring Brad Pitt",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jkgd/world-war-z?at_mid=yMffwrv6JX&at_campaign=World_War_Z&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002jkgd&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=World_War_Z&at_bbc_team=BBC&at_creation=film",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T05:00:00.000Z",
      "summary_90w": "",
      "raw": "A former UN employee is called in to help stop a pandemic that has spread around the world",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}