{
  "version": "1754956365400",
  "generatedAt": "2025-08-11T23:52:45.400Z",
  "items": [
    {
      "id": "4d3645fc4298483e5039599cc2193e79704658ff",
      "title": "Australia news live: Albanese says Netanyahu’s frustrating ‘denial’ of suffering in Gaza led to move to recognise Palestine",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/12/australia-news-live-albanese-palestine-state-israel-war-gaza-rba-interest-rates-decision-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T23:31:24.000Z",
      "summary_90w": "",
      "raw": "Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nSeven West Media profits shrink amid declining ad revenue\nChannel Seven’s media company saw a $61m drop in revenue in the year to June as TV advertising slipped, with after-tax profit nearly 20 times smaller than it recorded in 2021.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4db589fda9ab179ce83edc966db573ec0aa42f94",
      "title": "Sheila Jordan, a singular voice in jazz, has died",
      "url": "https://www.npr.org/2025/08/11/847306270/sheila-jordan-obituary",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T23:26:48.000Z",
      "summary_90w": "",
      "raw": "She recorded a magical debut album on Blue Note and was later named a Jazz Master by the National Endowment of the Arts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bbdf52cc08492970e8253669e31882b50f69d80",
      "title": "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce",
      "url": "https://techcrunch.com/2025/08/11/seoul-based-datumo-raises-15-5m-to-expand-llm-evaluation-challenging-scale-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T23:00:00.000Z",
      "summary_90w": "",
      "raw": "Datumo began as an AI data labeling company and now wants to help businesses build safer AI with tools and data that enable testing, monitoring, and improving their models — without requiring technical expertise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2c29cb8bc2324922a1b7411d06642cea6e4595fb",
      "title": "The Papers: 'Don't trust Putin' and 'Two weddings and a feud'",
      "url": "https://www.bbc.com/news/articles/c6266y42xndo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T22:59:27.000Z",
      "summary_90w": "",
      "raw": "Starmer's warning to Trump for his meeting with Putin and the Peltz-Beckham vows make Tuesday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "190dc4d813dea7dc3041531ea95eaf389f5f06cd",
      "title": "How a Red Bull can helped solve mystery of missing cyclist",
      "url": "https://www.bbc.com/news/articles/c9d0j2y3w3eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T22:41:49.000Z",
      "summary_90w": "",
      "raw": "Dr Caroline Muirhead helped lead police to the spot where Tony Parsons had been buried after a confession from her boyfriend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Chip giants Nvidia and AMD to pay 15% of sales revenue in China to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5ebcf134e3c630af6cdd7c2917113af663672cbe",
      "title": "Is crime in Washington DC 'out of control', as Trump claims?",
      "url": "https://www.bbc.com/news/articles/c8600x7dnn4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T22:23:22.000Z",
      "summary_90w": "",
      "raw": "President Trump says he will deploy hundreds of troops to Washington DC to address crime there.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a565b76075891591c6779aeaf18f41680d74425",
      "title": "Palestinian reporters killed, international reporters banned – Israel’s other Gaza war is over narrative",
      "url": "https://www.theguardian.com/world/2025/aug/11/palestinian-reporters-killed-and-foreigners-barred-in-israels-battle-for-gaza-narrative",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T22:17:10.000Z",
      "summary_90w": "",
      "raw": "Members of press and influencers covering devastation are being silenced despite protection under international law\n\nAnas al-Sharif, prominent Al Jazeera correspondent, among five journalists killed in Israeli airstrike on Gaza\n\n\nIsrael is running two Gaza campaigns: one for military control of the strip; another for narrative control of how the world understands what happens there.\nIn theory, Palestinian journalists and social media influencers documenting starvation, mass killing and other Israeli war crimes in Gaza are protected civilians under international law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d069c100536fc833bd73728c91d8510c8ee729cb",
      "title": "That viral video of a ‘deactivated’ Tesla Cybertruck is a fake",
      "url": "https://www.theverge.com/tesla/757594/tesla-cybertruck-deactivated-viral-video-fake",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T22:03:39.000Z",
      "summary_90w": "",
      "raw": "Did Tesla remotely deactivate a Cybertruck in the middle of a highway because the owner featured it in an unauthorized music video? The story already seemed highly unlikely, and on Monday afternoon, Tesla tweeted about the video, saying, “This is fake – that’s not our screen. Tesla does NOT disable vehicles remotely.”\nOn Sunday, Instagram user @bighuey313 posted a video of his supposed deactivated Cybertruck, complete with a flashing red warning message on the truck’s main touchscreen. “Dog wtf my cybertruck just shut off on the freeway! 😡” he wrote in the caption. “Almost just crashed wtf @teslamotors.”\nThe owner also posted an image of what he claimed was a cease-and-desist letter from Tesla’s vice president of legal affairs, Dinna Eskin. The letter cites “unauthorized use of Tesla’s intellectual property in musical content distributed under your name.” \nThe video quickly went viral on BlueSky, where anti-Elon Musk sentiment has helped fuel nationwide protests against Tesla. But users quickly noticed a number of discrepancies, such as the fact that the letter opens “We represent Tesla” despite being signed by the company’s in-house counsel. The letter also uses Eskin’s old title, “Sr. Director and Deputy General Counsel,” despite her current title of VP. And the warning message isn’t formatted like Tesla’s typical in-vehicle alerts and notifications. An X user speculated that the flashing red title was likely just a YouTube video playing on fullscreen to simulate a legitimate error. \nDespite these issues, the video went viral on BlueSky, X, and Reddit — and likely will continue to travel far and wide, confirming many people’s prior opinions about Tesla and Elon Musk. \nUpdate August 11th: Tesla posted on X confirming the video is fake.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76623f799ee8438f072a60dc622e788fbfa0b125",
      "title": "Slow Ventures cuts first check from $60M creator fund into woodworking founder",
      "url": "https://techcrunch.com/2025/08/11/slow-ventures-cuts-first-check-from-60m-creator-fund-into-woodworking-founder/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T22:00:00.000Z",
      "summary_90w": "",
      "raw": "This marks the first investment for Slow’s $60 million Creator Fund since its launch in February. The fund looks to help creators launch businesses, under the belief that what made them successful influencers is what can also make them a good founder.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49f39d34f1c1c390160df5538610febd4b7c13f3",
      "title": "Raducanu 'getting back to best' but edged out by Sabalenka",
      "url": "https://www.bbc.com/sport/tennis/articles/cz600zzy6yno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T21:58:27.000Z",
      "summary_90w": "",
      "raw": "Britain's Emma Raducanu pushes world number one Aryna Sabalenka but falls short of a statement win at the Cincinnati Open.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "106d4c96283067a8e45325e2dcba2ac1d67777af",
      "title": "Anthropic’s Claude chatbot can now remember your past conversations",
      "url": "https://www.theverge.com/news/757743/anthropic-claude-ai-search-past-chats",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T21:56:15.000Z",
      "summary_90w": "",
      "raw": "On Monday, Anthropic released a hotly anticipated memory function for its Claude chatbot.\nIn a YouTube video, the company demonstrated a user asking what they had been chatting about with Claude before their vacation. Claude searches past chats to read and summarize them for the user, then asks if they’d like to move on and keep working on the same project.\n“Never lose track of your work again,” the company wrote. “Claude now remembers your past conversations, so you can seamlessly continue projects, reference previous discussions, and build on your ideas without starting from scratch every time.” \n\nThe feature works across web, desktop, and mobile, and it can keep different projects and workspaces separate. It started rolling out to Claude’s Max, Team, and Enterprise subscription tiers today — just go to “Settings” under “Profile” and switch the feature on under “Search and reference chats” — and the company said other plans should receive access soon.\nBut there’s an important caveat here: It’s not yet a persistent memory feature like OpenAI’s ChatGPT. Claude will only retrieve and reference your past chats when you ask it to, and it’s not building a user profile, according to Anthropic spokesperson Ryan Donegan.\nAnthropic and OpenAI have been going head-to-head in the AI arms race for quite a while, racing to roll out competing features and functionalities — like voice modes, larger context windows, and new subscription tiers — as they both raise ever-increasing funding amounts. Last week, OpenAI launched GPT-5, and Anthropic is currently looking to close a round that could value it as high as $170 billion.\nMemory functions are another way leading AI companies are looking to attract and keep users on one chatbot service, increasing “stickiness” and user engagement.\nChatbots’ memory functions have been the subject of online debate in recent weeks, as ChatGPT has been both lauded and lambasted for its references to users’ past conversations, with some users controversially treating it as a therapist and others experiencing mental health struggles that some are referring to as “ChatGPT psychosis.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ac16c3089255a02fd7e7bd2f69faf8de1d3a7b88",
      "title": "European Leaders Insist Ukraine Must be Part of Peace Talks",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5499372/european-leaders-insist-ukraine-must-be-part-of-peace-talks",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T21:39:54.000Z",
      "summary_90w": "",
      "raw": "EU foreign ministers meet ahead of Friday’s Trump-Putin talks in Alaska, with Brussels insisting any peace deal must include Ukraine.  And Al Jazeera’s Anas al-Sharif was killed in an Israeli airstrike that also took out the broadcaster's crew in Gaza City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83e83d608d4ab14688a142a9daa349b6339a2cf2",
      "title": "Trump says he will try to get back territory for Ukraine in talks with Putin",
      "url": "https://www.bbc.com/news/articles/c0e99yqv332o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T21:25:43.000Z",
      "summary_90w": "",
      "raw": "The US president says talks with Putin on Friday will be a \"feel-out meeting\" aimed at urging Russia to end the war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a0e51a27b7c6e83dad2500c47a37e5b0999bd4de",
      "title": "Rapists 'probably' forfeit right to choose gender, says Nicola Sturgeon",
      "url": "https://www.bbc.com/news/articles/c05eedgp804o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T21:08:17.000Z",
      "summary_90w": "",
      "raw": "The former first minister also says she was partly to blame for a loss of \"rationality\" in the gender debate.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e2d8102d0d733b7e27759e9e3e4c2ef52e59ccc",
      "title": "US Steel plant explosion in Pennsylvania leaves one dead and 10 injured",
      "url": "https://www.bbc.com/news/articles/ckgjj49neldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T21:00:30.000Z",
      "summary_90w": "",
      "raw": "A search and rescue operation is underway for another person who is unaccounted for, while the cause of the explosion is unknown.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32d4667812699d7ea22edd9be203705fd13a2e8f",
      "title": "Zelensky could still attend Trump-Putin meeting, but rest of Europe is shut out",
      "url": "https://www.bbc.com/news/articles/cn5eedq7ldro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T20:51:01.000Z",
      "summary_90w": "",
      "raw": "As things stand, there are no invites for the country being invaded, nor the continent it sits in, writes James Waterhouse.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "233bd258facdfe8421fa06339878ccd402c8a8a2",
      "title": "iOS 26 beta 6 adds new ringtones, snappy app launches, and more",
      "url": "https://techcrunch.com/2025/08/11/ios-26-beta-6-adds-new-ringtones-snappy-app-launches-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T20:39:31.000Z",
      "summary_90w": "",
      "raw": "The new developer beta release, iOS 26 beta 6, adds new ringtones, faster app launches, and fixes the Camera swipe direction issues.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "250224b912f08f71cbd292dae3f308c6ea2c56c9",
      "title": "Even the lowly canister vacuum now wants access to your Wi-Fi network",
      "url": "https://www.theverge.com/news/757731/miele-guard-l1-electro-canister-vacuum-smart-wifi-mobile-app",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T20:20:32.000Z",
      "summary_90w": "",
      "raw": "You can added canister vacs to the growing list of connected appliances. | Image: Miele\t\n\nDespite the convenience of cordless stick vacs, canister vacuums are still very much a thing for those with battery anxiety or those who want a lighter cleaner. Miele still offers over 20 different models of canister vacs in the US, but its latest is the company’s first to introduce smart functionality making it yet another appliance that wants access to your home’s Wi-Fi network.\nThe Miele Guard L1 Electro is available now for $1,499 making it the most expensive model in the company’s L1 lineup and considerably pricier than even the $380 canister vacuum that Dyson still sells. That seems like a lot for a vacuum that still has a power cord, but the Electro does offer additional functionality including a built-in LCD touchscreen for changing the vacuum’s cleaning mode. The screen also displays status messages letting you know when the filter or vacuum bag needs replacing, or if a clog is detected.\nThe Electro connects to Miele’s mobile app over Wi-Fi giving you another option for staying on top of those important status messages. And should it be time to replace bags or filters, you can conveniently order them directly through the app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "330b0c9991d1a258a6942c6b9f093bc6a40cd403",
      "title": "Southern Europe swelters under deadly heatwave as temperatures pass 40C",
      "url": "https://www.theguardian.com/world/2025/aug/11/southern-europe-swelters-under-deadly-heatwave-as-temperatures-pass-40c",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T20:15:20.000Z",
      "summary_90w": "",
      "raw": "Four-year-old boy dies of heatstroke in Italy as scientists warn of ‘molotov cocktail’ of climatic conditions\nDeadly heat of up to 44C is searing southern Europe, as scientists warn of a “molotov cocktail” of climatic conditions that is fuelling vast wildfires across the Mediterranean.\nIn Italy, where temperatures of 40C are expected in Florence later this week, a four-year-old boy died of heatstroke, and a red alert warning was issued for seven major cities, including Bologna and Florence.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af85864c1e11ea8240eccf21840be0fe76305f4e",
      "title": "Canada wildfire season already second worst on record as experts warn of ‘new reality’",
      "url": "https://www.theguardian.com/world/2025/aug/11/canada-wildfire-season",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T20:08:49.000Z",
      "summary_90w": "",
      "raw": "More than 470 Canadian fires classified as ‘out of control’ as scientists say climate change exacerbating the burning\nWith hundreds of wildfires burning out of control, Canada’s 2025 fire season is already the second-worst on record, as scientists report climate change is prolonging and exacerbating the burning, leading to more destruction, evacuations and smoke-filled skies.\nMore than 470 fires across the country are currently classified as “out of control”, according to the Canadian Interagency Forest Fire Centre (CIFFC).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d765fa57cdb5f39c656d5f8309d93d82d7e5da6",
      "title": "Poshmark CEO and founder to step down",
      "url": "https://techcrunch.com/2025/08/11/poshmark-ceo-and-founder-to-step-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T19:38:57.000Z",
      "summary_90w": "",
      "raw": "After nearly 15 years, Manish Chandra will transition to being a member of the board of directors. Namsun Kim, who has served as executive chairman since April, has been appointed as his successor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d8d1ed4c709ccb015f64865a971005b3fdf9b547",
      "title": "Trump deploys National Guard to Washington DC and pledges crime crackdown",
      "url": "https://www.bbc.com/news/articles/cm2110me5g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T19:31:16.000Z",
      "summary_90w": "",
      "raw": "The president also takes control of the city's police force, as the mayor rejects his claims of a crime wave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a09a47dae8f16b57033ea2ae7db4cfb82b654edb",
      "title": "This see-thru Game Boy is a work of art — because she designed a transparent circuit board",
      "url": "https://www.theverge.com/games/757662/natalie-the-nerd-transparent-translucent-game-boy-pcb",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T19:21:53.000Z",
      "summary_90w": "",
      "raw": "Have you heard of Natalie the Nerd? She’s a pillar of the Nintendo Game Boy modding scene who taught herself to reverse engineer and design Game Boy circuit boards. \nNow, she’s put her skills to work in probably the most beautiful build I’ve ever seen: a working see-through Game Boy Color where even the circuit board is made of clear plastic. Because she designed and created that board herself from scratch, you see. \n\nI’ve been floored by console mods before, but I’d typically limit praise to saying they’re “damn clean.” But this thing, to paraphrase Indiana Jones, belongs in a museum. “Damn that’s lovely,” says one of my colleagues. “It’s such a delight,” says another. \n\nAnother reason why it’s probably a museum piece: she agreed with one commenter that it’s likely too flimsy and fragile for extended use. “Yeah not practical at all, just art work TBH,” she wrote.\nNatalie lives in Australia, where she sometimes sells RGB lighting kits and other aftermarket components for Game Boy modding and offers repair services. You can also support her work at ko-fi.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4b894b77cf501c72e06fc67db77b08adf11fab0",
      "title": "Revel shutters rideshare business, pivots to EV charging",
      "url": "https://www.theverge.com/news/757661/revel-shutters-rideshare-business-pivots-to-ev-charging",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T19:04:26.000Z",
      "summary_90w": "",
      "raw": "A Revel charging station in Brooklyn in 2022.\t\n\nRevel is shutting down its ridehail business, citing heightened competition from rideshare leaders like Uber and Lyft. The company, which began as an electric moped business before shifting to rideshare, plans to pivot to electric vehicle charging. \n“At the end of the day, rideshare is a very competitive market and asset-heavy,” Revel CEO Frank Reig said in a statement to Bloomberg. “It’s low margin. We have made the difficult decision that the best way we can keep the EV transition moving forward is by ending our rideshare service and focusing on building the fast-charging infrastructure our biggest cities need to keep going electric.”\nThe Brooklyn-based company launched in 2018 with its signature neon blue rental mopeds before graduating to an all-Tesla ridehail fleet. Revel’s signature baby-blue Model Ys mostly operated in New York and New Jersey.\nRevel is seeking to sell 165 for-hire vehicle license plates, as well as a buyer for its Tesla and Kia vehicles, according to Bloomberg. The company recently opened several EV charging hubs in New York City and California, and plans to open hundreds more by the end of next year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31bf8884ed02789120e6304ec2612079df67c0d4",
      "title": "US government seized $1M from Russian ransomware gang",
      "url": "https://techcrunch.com/2025/08/11/u-s-government-seized-1-million-from-russian-ransomware-gang/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T19:04:12.000Z",
      "summary_90w": "",
      "raw": "A global law enforcement coalition targeted the infrastructure of the group behind the Royal and BlackSuit ransomware strains, allegedly responsible for extorting victims out of $370 million since 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6ee5738d382c5f654ce061cf587b90f65934696",
      "title": "The Trump-Putin Meeting: What About Zelensky?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdhyt?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Why are Trump and Putin meeting in Alaska?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2b174f284d9d91773d2e012e8222083373dc",
      "title": "‘I risked everything’: remembering six media workers killed by Israel in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/11/i-risked-everything-remembering-six-media-workers-killed-by-israel-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T18:50:23.000Z",
      "summary_90w": "",
      "raw": "CJP says the period since 7 October 2023 has been the most deadly for journalists since it began gathering data in 1992\nJournalists have been prominent among casualties since the war in Gaza was triggered by Hamas’s incursion into Israel in October 2023.\nSome were working for well-known international media, others were employed by local news organisations. Several were high-profile veterans, but many were newcomers to the profession.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7efb3034ab0bc2c79ae572e8b5cc7cd332e6fb96",
      "title": "You can save $30 on the OnePlus Watch 3, a great Galaxy Watch 8 alternative ",
      "url": "https://www.theverge.com/tech/757554/oneplus-watch-3-2-back-to-school-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T18:47:08.000Z",
      "summary_90w": "",
      "raw": "The OnePlus Watch 3 starts at $269.99 ($30 off) for the new 43mm model. | Image: The Verge / OnePlus\t\n\nOnePlus has kicked off its back-to-school sale, and the deals are pretty solid. There are discounts on the company’s impressive tablets, but the highlights are the new low prices on its smartwatches. Right now, you can buy the 43mm OnePlus Watch 3 for $269.99 ($30 off), while the 46mm is $319.99 ($30 off). Even the OnePlus Watch 2 is cheaper than it’s ever been at $199.99 ($100 off). Students get an additional 10 percent off, making these deals even sweeter.\nWe’ve recommended the OnePlus Watch 2 as a great alternative to Google and Samsung smartwatches since its debut, and the Watch 3 builds upon it with small, but meaningful upgrades. It retains everything we loved in its predecessor, like dual-frequency GPS and long battery life, but now adds Google Gemini, a rotating crown that scrolls, and video watch faces. The company also added its 60S Health Check-In, which provides a quick snapshot of your heart rate, blood oxygen levels, mental wellness, wrist temperature, sleep quality, and vascular age (with European users also getting EKGs) with a click of a button.\nThe OnePlus Watch 3 comes in two sizes: a new 43mm model introduced in July, and a 46mm version released back in April. Both are similar in terms of specs, but the 43mm model skips the 46mm’s temperature sensor that was used for reproductive cycle tracking and fall detection. The 46mm wearable also boasts a larger, brighter 2,200-nit OLED display, which is double the brightness of the 43mm version (1000 nits).\nRead our hands-on impressions of the OnePlus Watch 3.\nOnePlus Watch 3\nThe OnePlus Watch 3 builds upon the OnePlus Watch 2 with a new 43mm size and rotating crown bezel. The 43mm adds reproductive cycle tracking and fall detection as well, while the 46mm adds a wrist temperature sensor.\n\nWhere to Buy:\n\n $299.99 $269.99 at OnePlus (43mm)\n $349.99 $319.99 at OnePlus (46mm)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "880947313919ee8f43c8384cfeae8b3e5c57869f",
      "title": "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdfhf?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:42:00.000Z",
      "summary_90w": "",
      "raw": "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a5e209010f29b91e5f74430190a107b11d6971d",
      "title": "How founders are ditching VC norms and finding capital on their own terms at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/11/how-founders-are-ditching-vc-norms-and-finding-capital-on-their-own-terms-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T18:38:22.000Z",
      "summary_90w": "",
      "raw": "Founders today have more capital paths than ever. But how do you navigate them — and know which one actually supports your growth?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9a17004a552c1c39b783ceefe58ae1ac0de55b57",
      "title": "More celebrities unveiled for Strictly Come Dancing",
      "url": "https://www.bbc.com/news/articles/cly3318nrmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:30:39.000Z",
      "summary_90w": "",
      "raw": "Dani Dyer, Alex Kingston and Jimmy Floyd Hasselbaink will be taking to the BBC show's dance floor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f15b7a1c760bd61c6b6c3ed2ef737bde3df78ca",
      "title": "These are my favorite Switch 2 accessories",
      "url": "https://www.theverge.com/buying-guides/720160/best-switch-2-accessories",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T18:30:25.000Z",
      "summary_90w": "",
      "raw": "The Switch 2 can be enjoyed right out of the box, but it’s even better with the right accessories. Some of these add-ons are more crucial than others, especially if you’re deciding what to buy early on. For example, a case and a screen protector can keep your console safe from scuffs, scratches, and drops, so both are what I’d consider to be essential. \nOn the other hand, a microSD Express card lets you add even more digital games to your library, although the console’s somewhat generous 256GB of internal storage means you may not need one right away. Some others don’t add enough to the gaming experience to be worth it. Those Joy-Con 2 steering wheel accessories? You can pass on those.\nThe Switch 2 and its games are expensive enough, so we’ve assembled this guide with picks that are a great value. You don’t need to spend hundreds on accessories — many of us at The Verge certainly aren’t. No matter your budget, we’ve included numerous categories, beginning with a starter kit of recommendations we think everyone should consider.\nOur seven must-have Switch 2 accessories\namFilm OneTouch two-pack of glossy screen protectors\nThis two-pack of glossy screen protectors is a great value.\n\nWhere to Buy:\n\n $15.99 $8.99 at Amazon\n\ntomtoc slim carrying case for the Switch 2\nA slim, durable case that comes in multiple color schemes.\n\nWhere to Buy:\n\n $47.99 $33 at Amazon\n\nNintendo Switch 2 Pro Controller\nThe Switch 2 wireless controller with the most features, but it’s not cheap.\n\nWhere to Buy:\n\n $89 at Walmart\n $89.99 at Best Buy\n $89 at Amazon\n\n8BitDo USB Adapter 2\nGrab this to be able to use your Xbox or PS5 controller on your Switch 2.\n\nWhere to Buy:\n\n $19.99 $18.99 at Amazon (with on-page coupon)\n $19.99 at 8BitDo\n $19.99 at Best Buy\n\nSandisk microSD Express card\nOnce you’ve filled up the Switch 2’s built-in 256GB SSD, add some extra storage.\n\nWhere to Buy:\n\n $53.99 at Amazon (128GB)\n $71.99 at Amazon (256GB)\n $115.99 at Amazon (512GB)\n\nUgreen USB-C-to-ethernet adapter\nSwitch 2 Wi-Fi download speeds are painfully slow. This can help speed things up in handheld mode.\n\nWhere to Buy:\n\n $14.99 $12.99 at Amazon\n\nFastsnail Switch/Switch 2 Joy-Con charging dock\nA great accessory for households with original Switch Joy-Con laying around.\n\nWhere to Buy:\n\n $24.99 $19.99 at Amazon\n\nBest Switch 2 controllers\nNintendo Switch 2 Pro\nThe Switch 2 Pro is Nintendo’s latest flagship wireless controller. It’s similar in several ways to the excellent Pro controller that debuted alongside the Switch, especially in design, with its analog stick layout, and because it’s the most replete with features you won’t find on other Switch 2 gamepads. \nIts motion control support isn’t a novel feature (many third-party controllers offer that), but its Amiibo NFC support is still something that almost no alternatives offer. Another feature that makes this one worth considering despite its high price is its 3.5mm headphone jack, in case you want to plug in a set of wired headphones for private listening. Additionally, it can wake the Switch 2 from standby via Bluetooth (only a select few wireless models possess this ability), so you don’t have to get off your couch to hit the console’s power button. Lastly, this model has two additional buttons that can be mapped to mimic almost any other button. (some cheaper alternatives, including the 8BitDo Ultimate 2 and Pro 3, feature four extra buttons).\nThe Switch 2 Pro is very comfortable, and it’s the controller that I always want to use when given the choice between the options below. But it’s not perfect. For one, it’s pricey at $89.99, and you’d think for that price Nintendo might have opted for drift-resistant sticks. Alas, you owe $5 to your buddy who bet that Nintendo would doggedly opt again for potentiometer sticks that are proven to tear down over time. Its sticks haven’t caused issues so far, but it’s possible that they might not fare as well — and as long — as models below that feature more durable Hall effect or TMR joysticks. \nRead our review of the Switch 2 Pro\nNintendo Switch 2 Pro Controller\nThe Switch 2 Pro Controller features new remappable “GL” and “GR” rear buttons, the “C” button to access in-game chat features, and a headphone jack.\n\nWhere to Buy:\n\n $89 at Walmart\n $89.99 at Best Buy\n $89.99 at Target\n\n8BitDo Pro 3\n8BitDo’s Pro 3 is a good alternative to the Switch 2 Pro controller: it’s slightly cheaper, yet better in some ways (and a bit worse in others) that might matter to you. \nStarting with the good, the company upgraded its joysticks to the even more durable TMR sensors. The two back paddles are carried over from the first iteration, though there’s a new pair of buttons (L4 and R4) near the triggers that can be customized. Also of note are new toggle switches around its backside (similar to what we saw on the DualSense Edge) that let you alter the travel distance of its two triggers. Toggling a switch makes the corresponding trigger feel more like a mouse click. \nIt’s also worth noting that this controller is significantly more customizable than the Switch 2 Pro, as well as most other controllers out there. Its face buttons are magnetically attached, and can be removed to let the Pro 3 flip between the Switch layout and the Xbox layout.\nWhile the Pro 3’s TMR sticks might make it last longer, there are some trade-offs compared to the pricier Nintendo alternative — none of which are deal-breakers if saving money is a top priority. For example, its attempts to replicate the subtle blips and buzzing of Nintendo’s impressive HD haptics in the Switch 2 Pro controller are just not good. Its attempts at replicating the smallest, nuanced vibrations of Donkey Kong walking in Bananza makes it go full boar. I’d sooner turn off the vibration entirely than deal with how jarringly intense it feels, and thankfully you can in the app.\nOther downsides are more minor, but are still worth knowing about. It lacks a 3.5mm headphone jack, and it doesn’t have the C button to launch GameChat. However, you can easily assign the feature to one of the Pro 3’s buttons via the Switch 2’s OS — but not to its additional buttons (the two R buttons near the triggers, and the two rear paddles). If you’d prefer to use the controller’s built-in button combo to reassign in-game commands to any of its buttons, that’s easy to do, per the instructions in its PDF manual. \nRead our review of the 8BitDo Pro 3\n8BitDo Pro 3 controller\n\nWhere to Buy:\n\n $69.99 at Amazon\n\n8Bitdo USB Adapter 2\nIt’s technically not a controller, but I’m a broken record when it comes to recommending 8BitDo’s USB Adapter 2 for households already with more than one console. In the case that you have an Xbox or a PS5 and would rather not buy a bespoke Switch 2 controller, just buy this $20 adapter instead, and use it to connect a wireless controller you already own.\nThis adapter goes into the Switch 2’s dock (or directly into the console, if you have a USB-A to C adapter). Connecting your controller is as easy as putting it into pairing mode, then ensuring that the “Pro Controller Wired Communication” option is turned on within the console’s settings. Click and hold the adapter’s coin-shaped button to initiate pairing, then you should be good to go. The DualSense’s rumble and motion controls work seamlessly, and you can remap buttons as you please within the console’s OS, just like you would an official Switch controller.\nBest adapter: 8BitDo Wireless Bluetooth USB Adapter 2\nThe 8BitDo’s latest adapter resembles a flash drive, but once connected to your Switch’s dock, it allows you to wirelessly pair it with a variety of PlayStation, Xbox, and Nintendo controllers.\n\nWhere to Buy:\n\n $19.99 $18.99 at Amazon (with on-page coupon)\n $19.99 at 8BitDo\n $19.99 at Best Buy\n\nBest Switch 2 cases\nDbrand Killswitch\nThe Killswitch is a great Switch 2 companion, whether you’re someone who primarily uses the console in handheld mode or while it’s docked. It’s a case that wraps around the Switch 2’s back, with detachable components that snugly grip onto each Joy-Con 2, adding some extra bulk that makes them more comfortable to hold. Above all else, it’s a great way to protect your console from scratches and slightly more significant damage. What’s also great is that it doesn’t limit its flexibility as a hybrid console.\nEach Killswitch ships with a USB-C dock adapter that is inserted into the Switch 2 dock. Since the case-equipped console can no longer fit in Nintendo’s dock, this adapter lets you connect it to your TV without taking off the case. It’s tougher to correctly align the Switch 2’s USB-C jack with this adapter than it is to put it in the dock, but it gets easier with practice. \nRead our review of the Dbrand Killswitch\nDbrand Killswitch – Switch 2\n\nWhere to Buy:\n\n $59.99 at Dbrand\n\nTomtoc FancyCase Slim zip-up case\nThe best, slimmest zip-up case you should buy is made by Tomtoc. Compared to the Belkin hard zip-up case that I got my hands on before the Switch 2’s launch, the Tomtoc FancyCase slim case feels more durable; anecdotally, it holds up much better to being squeezed by hand. It even has more vertical clearance above the Joy-Con 2 sticks, so it’ll never press them in on accident. Like most zip-up cases, it features a screen cover that doubles as cartridge storage. This one can hold 12 cartridges.\nI’m confident that it’ll absorb more potential damage over time than other cases I’ve tried. Plus, it just looks cooler, with low-profile designs for gamers who don’t want to draw attention to their console. That said, its “Froz Edition” has ice cream-inspired looks that are a lot more expressive.\ntomtoc slim carrying case for the Switch 2\nThis hard case has a soft touch and a slim fit, and includes a flap that can hold up to 12 cartridges as it protects the console’s screen.\n\nWhere to Buy:\n\n $47.99 $33 at Amazon\n\nBelkin fabric zip-up case\nBelkin’s $29.99 zip-up case is another competent, good-looking option that’s slim and lightweight. It’s worth considering over the Tomtoc for one reason only: its built-in pocket, which is great if you need to stow a charging cable or any other small doo-dads. Not to mention, this pocket contains another pocket for an AirTag or similar Bluetooth tracker, so you can track this case’s location should you lose track of it.\nBelkin makes a thicker, pricier version of this case that has a 20,000mAh 20W battery inside. It’s nearly identical until you open it. A cutout fits this (and only this) Belkin battery perfectly, and it lets you charge your Switch 2 at top speeds while it’s protected.\nBelkin Carrying Case for Nintendo Switch 2\n\nWhere to Buy:\n\n $29.99 at Amazon\n $29.99 at Belkin\n\nBest Switch 2 cameras\nThe best webcam that you can get for your Switch 2 should be the cheapest one you can find that’s guaranteed to work with it. So far, Logitech has confirmed that almost all of its webcams support the Switch 2, and Elgato has updated its Facecam MK.2 to support it, as well. Elgato’s model is pricier than we recommend most people spend, but it’s a solid option if you also have a PC to use it with. It’s worth knowing that the Switch 2 displays low-fidelity video feeds during gameplay, so unless you plan to use the webcam with your PC as well, it’s not worth spending a lot for a model that promises great video quality. \nLogitech Brio 100 webcam\n\nWhere to Buy:\n\n $39.99 $24.99 at Amazon\n $39.99 $24.99 at Staples\n $39.99 $24.99 at Logitech\n\nNintendo Switch 2 Camera\n\nWhere to Buy:\n\n $54 at Walmart\n $54.99 at Best Buy\n $54.99 at Target\n\nElgato Facecam MK.2\n\nWhere to Buy:\n\n $139.99 at Best Buy\n $139.99 $123.39 at Amazon\n $139.99 $129.99 at B&H Photo\n\nBest Switch 2 portable batteries\nThe Switch 2 is more powerful than the original Switch. However, it doesn’t require all that much more power to charge, even while you’re playing games. While new phones and tablets are breaking new ground with fast charging speeds, getting a power bank that can deliver at least 20W is totally sufficient to get the fastest-possible charging speeds with the Switch 2 in handheld mode. \nBy using a display-equipped USB-C cable with a wattage reading, I was able to see that the Switch 2 usually pulls a maximum of about 15-17W of power (sometimes less) from a USB-C battery during gameplay. When the system was asleep, the rate went down to between 8-13W, fluctuating at different points during the charging process. From a totally dead state, the console took almost 90 minutes to reach 69 percent with a 20W battery plugged into it. You’ll likely drain your USB-C battery more quickly if you’re playing as you charge.\nThankfully, your options for compatible batteries are plentiful. You’ll likely be paying for more power than you’ll need with the Switch 2, but more power (and especially more ports) are never a bad thing to have too much of.\nAnker Zolo Power Bank (10K, 30W)\n\nWhere to Buy:\n\n $25.99 $16.09 at Amazon (with Prime)\n $25.99 at Anker\n\nUgreen Nexode power bank (20K, 45W)\n\nWhere to Buy:\n\n $45.99 $34.99 at Amazon\n\nBaseus Picogo power bank (10K, 45W)\n\nWhere to Buy:\n\n $39.99 $25.99 at Amazon\n\nBest microSD Express cards for Switch 2\nThe Switch 2 supports microSD Express cards of up to 2TB, even though models with that amount of storage aren’t yet available for purchase. Most brands make cards in 128GB, 256GB, and 512GB configurations, and some offer 1TB cards as well. I’d suggest grabbing the cheapest microSD Express card you can find, as so far they all offer similarly fast read/write speeds. \nSandisk microSD Express card\n\nWhere to Buy:\n\n $53.99 at Amazon (128GB)\n $71.99 at Amazon (256GB)\n $115.99 at Amazon (512GB)\n\nSamsung microSD Express Card (256GB)\n\nWhere to Buy:\n\n $59.99 at Amazon\n $59.99 at Best Buy (256GB)\n $59.99 at Target (256GB)\n\nPNY microSD Express card\n\nWhere to Buy:\n\n $58.99 $54.96 at Amazon (256GB)\n $58.99 $55.99 at B&H Photo (256GB)\n $58.99 at PNY (256GB)\n\nGameStop microSD Express card\n\nWhere to Buy:\n\n $54.99 at GameStop (256GB)\n $189.99 at GameStop (1TB)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d52e58139c5aab4d9ad2910cee564afe6a3d1189",
      "title": "How do Newcastle resolve Isak saga & rescue 'nightmare' window?",
      "url": "https://www.bbc.com/sport/football/articles/c0mllyjp881o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:19:59.000Z",
      "summary_90w": "",
      "raw": "MOTD pundit and Newcastle United legend Alan Shearer explains why his old club have had a pre-season to forget, and how Liverpool target Alexander Isak could stay at St James' Park.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a7f384a1ff0033f185297270e9f51ece2163cfc",
      "title": "Trump says he and Putin will discuss ‘land swapping’ at Ukraine war summit",
      "url": "https://www.theguardian.com/world/2025/aug/11/eu-trump-putin-meeting-ukraine-diplomacy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T18:18:07.000Z",
      "summary_90w": "",
      "raw": "US president gives details on Alaska meeting and expresses frustration with Zelenskyy’s conditions for any peace deal\nDonald Trump has confirmed that he and Vladimir Putin will discuss “land swapping” when they meet on Friday in Alaska for a high-stakes summit on the Ukraine war. But the US president expressed frustration with Volodymyr Zelenskyy for putting conditions on such a potential agreement.\nDuring a news conference at the White House on Monday, Trump said he was frustrated with Zelenskyy’s insistence that Ukraine would need to hold a national referendum on any peace deal that stipulated recognising Russian control over territory that it has occupied during the war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9985db563beaa7993d8218c75667d79ee99dbe83",
      "title": "Trump says he will 'feel out' Putin in Alaska on ending the war in Ukraine",
      "url": "https://www.npr.org/2025/08/11/g-s1-82010/trump-putin-alaska-ukraine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T18:15:08.000Z",
      "summary_90w": "",
      "raw": "President Trump says he thinks Russian President Vladimir Putin is ready to end his war on Ukraine, but he will use a Friday summit to \"feel out\" his counterpart.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5789a29da3507e1d523e2e25ad2492577bfd0e64",
      "title": "iRobot’s future isn’t looking up",
      "url": "https://www.theverge.com/news/757434/irobot-earnings-show-roomba-maker-still-struggling",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T17:48:52.000Z",
      "summary_90w": "",
      "raw": "iRobot, maker of the iconic Roomba robot vacuum, announced its second-quarter earnings late last week, and the numbers keep going down. Despite launching an entirely new product line, its revenue declined 23 percent to $127.6 million from the previous quarter, with the lucrative US and European markets being hit hardest.\nThe company has struggled in the face of increased competition from Chinese manufacturers and the collapse of a sale to Amazon, which left it deep in debt. Earlier this year, CEO Gary Cohen indicated iRobot could shut down within 12 months if something didn’t change. The clock is ticking.\nLast week, Cohen said that while customer response to the new product line has been “encouraging,” iRobot didn’t meet its goals this quarter “due to persistent market headwinds and delays in scaling production and sales of our new products.” He confirmed the company is still looking at a potential sale or other “strategic alternatives” to get out of debt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a691470abc6f7adf58d4178f1636c062bd040ea0",
      "title": "UN condemns targeted Israeli attack that killed five Al Jazeera journalists",
      "url": "https://www.bbc.com/news/articles/cq688qz3rlro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T17:47:23.000Z",
      "summary_90w": "",
      "raw": "Israel says it targeted correspondent Anas al-Sharif, accusing him of leading a Hamas cell, which he had denied. Israel provided little evidence for the claim.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f02a184dd2709ae67aff294da35e91c5fddd34d0",
      "title": "Ocean’s new app brings inbox triage, tasks, and invites to Gmail users",
      "url": "https://techcrunch.com/2025/08/11/oceans-new-app-brings-inbox-triage-tasks-and-invites-to-gmail-users/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T17:46:50.000Z",
      "summary_90w": "",
      "raw": "Ocean debuts an email app for Gmail users with triage tools, a task manager, and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "572b0be163b9dac8b27be8d4f2d73148e5420ae3",
      "title": "Who was Anas al-Sharif, prominent Gaza journalist killed by Israel?",
      "url": "https://www.bbc.com/news/articles/c6200wnez73o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T17:16:51.000Z",
      "summary_90w": "",
      "raw": "Sharif was killed when Israel targeted a tent used by media in northern Gaza, alongside six others, Al Jazeera said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f99749bd627cd94c4aab9fa9e94d1548e34d65f6",
      "title": "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more",
      "url": "https://techcrunch.com/2025/08/11/made-by-google-2025-how-to-watch-google-debut-the-pixel-10-pixel-watch-4-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T17:12:20.000Z",
      "summary_90w": "",
      "raw": "Google is hosting its Pixel 10 event next week. Learn how to watch the tech giant reveal its new mobile devices and what else you can expect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d15c95b0abc5fcd03ab193b618d2014132d96b3",
      "title": "Trump administration stops illegal freeze of $5B EV charger funds after losing in court",
      "url": "https://techcrunch.com/2025/08/11/trump-administration-stops-illegal-freeze-of-5b-ev-charger-funds-after-losing-in-court/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T17:12:08.000Z",
      "summary_90w": "",
      "raw": "The money is on the table again, but with fewer requirements for proving out safety, environmental impacts, and inclusion of minority- and women-owned businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b3a6da4b89ac965a0869d54eb872fd7e7cb0fd3f",
      "title": "Drivers warned about scam car finance payout calls",
      "url": "https://www.bbc.com/news/articles/c860021w3g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T17:07:24.000Z",
      "summary_90w": "",
      "raw": "The warning comes after the watchdog announced it would set up a compensation scheme for motorists who were sold car finance deals that were unlawful.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d204a92b3d807ffd139b0983ff1c872283552f7d",
      "title": "Harry and Meghan sign new multi-year Netflix deal",
      "url": "https://www.bbc.com/news/articles/cvgnne6lznzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T17:06:32.000Z",
      "summary_90w": "",
      "raw": "It's a looser arrangement than their previous deal - and comes ahead of a second series of Meghan's cookery show being screened later this month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a595212a6b9ecf3e7cc868ac8d45f54d6877ff5a",
      "title": "Meta makes conservative activist an AI bias advisor following lawsuit",
      "url": "https://www.theverge.com/news/757537/meta-robby-starbuck-conservative-activist-ai-bias-advisor",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T17:04:37.000Z",
      "summary_90w": "",
      "raw": "Conservative activist Robby Starbuck will serve as an advisor at Meta to address “ideological and political bias” within the company’s AI chatbot, according to a report from The Wall Street Journal. The move comes as part of a settlement Meta reached with Starbuck, who filed a lawsuit claiming Meta AI wrongly stated he was involved in the January 6th Capitol riot.\nStarbuck has waged public pressure campaigns against companies that have diversity, equity, and inclusion (DEI) programs, with companies like Tractor Supply, John Deere, and Harley-Davidson dropping their DEI efforts as a result. According to a lawsuit filed in April, Starbuck claims he discovered Meta AI’s false output after a Harley-Davidson dealer published a screenshot from Meta’s AI chatbot linking Starbuck to the Capitol riot and QAnon. \nNow, following President Donald Trump’s executive order to make AI less “woke,” Starbuck will advise Meta on bias. “Since engaging on these important issues with Robby, Meta has made tremendous strides to improve the accuracy of Meta AI and mitigate ideological and political bias,” Meta and Starbuck said in a statement to the WSJ.\nDuring an interview with CNBC, Starbuck declined to say whether Meta paid him to resolve the lawsuit. “I’m one person, but this could cause a lot of problems across the entire industry when it comes to elections and political bias, and we wanted to be leaders in solving this problem,” Starbuck said during the interview. Earlier this year, Meta paid $25 million to settle a 2021 lawsuit filed by President Donald Trump over the suspensions of his accounts.\nOther people have attempted to file lawsuits alleging AI chatbot defamation. Conservative radio host Mark Walters filed a lawsuit against OpenAI in 2023, alleging that ChatGPT falsely stated that Walters was accused of embellishing funds from a non-profit organization. A judge granted summary judgment in favor of OpenAI and dismissed the defamation claim in May.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6851b8fb0ebe0663ab3c156875f072b49783a527",
      "title": "Mourners gather amid outrage over Israeli troops’ killing of journalists in Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/11/israel-gaza-war-anas-al-sharif-al-jazeera-benjamin-netanyahu-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T17:02:08.000Z",
      "summary_90w": "",
      "raw": "UN condemns killing of Anas al-Sharif and colleagues, calling it a ‘grave breach of international humanitarian law’\nAnas al-Sharif among five journalists killed in Israeli airstrike\nReporters Without Borders has condemned the “acknowledged murder by the Israeli army” of Al Jazeera correspondent Anas al-Sharif in Gaza, who the armed forces admitted they had targeted, along with several of his colleagues.\nThe press freedom campaign group told news agency AFP it “strongly and angrily condemns the acknowledged murder by the Israeli army” of al-Sharif and other journalists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c8d01b364de46314b41670466b7287c42930d34",
      "title": "‘Death spiral’: Mekong River megafish have shrunk by half, study reveals",
      "url": "https://www.theguardian.com/environment/2025/aug/11/mekong-river-megafish-shrunk-by-half-study-overfishing-dams-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T17:00:09.000Z",
      "summary_90w": "",
      "raw": "Fish once as large as grizzly bears have become far smaller in recent years due to overfishing, dams and climate crisis\nThe size of megafish in the Mekong River has shrunk alarmingly in recent years owing to overfishing, a study has found. The length of the largest and most endangered freshwater giants, some as big as grizzly bears, decreased by 40% in seven years.\nSome fish, like the Mekong giant catfish, have been studied for over a longer period and show a decline in weight of 55% in the past 25 years, dropping from an average of 180kg (397lb) to 80kg.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56e9a2b94c5f33139de666fd1aa87231a4ffac08",
      "title": "Reddit will block the Internet Archive",
      "url": "https://www.theverge.com/news/757538/reddit-internet-archive-wayback-machine-block-limit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-11T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit. The Wayback Machine will no longer be able to crawl post detail pages, comments, or profiles; instead, it will only be able to index the Reddit.com homepage, which effectively means Internet Archive will only be able to archive insights into which news headlines and posts were most popular on a given day.\n“Internet Archive provides a service to the open web, but we’ve been made aware of instances where AI companies violate platform policies, including ours, and scrape data from the Wayback Machine,” spokesperson Tim Rathschmidt tells The Verge. \nThe Internet Archive’s mission is to keep a digital archive of websites on the internet and “other cultural artifacts,” and the Wayback Machine is a tool you can use to look at pages as they appeared on certain dates, but Reddit believes not all of its content should be archived that way.“Until they’re able to defend their site and comply with platform policies (e.g., respecting user privacy, re: deleting removed content) we’re limiting some of their access to Reddit data to protect redditors,” Rathschmidt says. \nThe limits will start “ramping up” today, and Reddit says it reached out to the Internet Archive “in advance” to “inform them of the limits before they go into effect,” according to Rathschmidt. He says Reddit has also “raised concerns” about the ability of people to scrape content from the Internet Archive in the past.\nReddit has a recent history of cutting off access to scraper tools as AI companies have begun to use (and abuse) them en masse, but it’s willing to provide that data if companies pay. Last year, Reddit struck a deal with Google for both Google Search and AI training data early last year, and a few months later, it started blocking major search engines from crawling its data unless they pay. It also said its infamous API changes from 2023, which forced some third-party apps to shut down, leading to protests, were because those APIs were abused to train AI models. \nReddit also struck an AI deal with OpenAI, but it sued Anthropic in June, claiming Anthropic was still scraping from Reddit even after Anthropic said it wasn’t scraping anymore.\n“We have a longstanding relationship with Reddit and continue to have ongoing discussions about this matter,” Mark Graham, director of the Wayback Machine, says in a statement to The Verge.\nUpdate, August 11th: Added statement from the Wayback Machine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d40fb478cd771fbbbfcf1c9f64be7125bddf97ff",
      "title": "Ghislaine Maxwell court materials to stay secret, judge rules",
      "url": "https://www.bbc.com/news/articles/c1jnn2r7r47o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T16:30:07.000Z",
      "summary_90w": "",
      "raw": "The judge said there was nothing new to learn from the materials, and releasing them could hurt future grand jury proceedings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "51c058eb5ac3857218a9f0bd5b1021d2406190b0",
      "title": "Three children arrested on suspicion of murder of man in Kent",
      "url": "https://www.bbc.com/news/articles/cn855zj319yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T16:27:05.000Z",
      "summary_90w": "",
      "raw": "A 16-year-old girl and two boys, aged 14 and 15, are in police custody after an incident on Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee2697c4648551522e49bb73913b47d0916623f2",
      "title": "GitHub CEO to step down",
      "url": "https://techcrunch.com/2025/08/11/github-ceo-to-step-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:25:01.000Z",
      "summary_90w": "",
      "raw": "The move comes as GitHub is facing growing competition from companies like Google and Cursor over AI tools for programmers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0cef7e8e3c521fed6938ca7fff5ba9c5d2d74739",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/11/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:22:05.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed200b3f3c222ffca2a8710b602f4ff2adf7d4e9",
      "title": "Colombian senator Miguel Uribe dies after June campaign shooting",
      "url": "https://www.theguardian.com/world/2025/aug/11/colombian-senator-miguel-uribe-dies-after-june-campaign-shooting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T16:18:58.000Z",
      "summary_90w": "",
      "raw": "Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39\nMiguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.\nUribe, an opposition candidate with the rightwing Centro Democrático party, was shot twice in the head and once in the leg during a campaign stop two months ago while vying for his party’s nomination for the 2026 elections.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5749a3266ac0f0dc79c438612428d00ed2f0a5c",
      "title": "TechCrunch Mobility: The triple punch headed for automakers",
      "url": "https://techcrunch.com/2025/08/11/techcrunch-mobility-the-triple-punch-headed-for-automakers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:06:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0e24e27bb448e4cb192bb9aef59e92bd3accc38a",
      "title": "When, where and how to catch a glimpse of the Perseid meteor shower",
      "url": "https://www.bbc.com/news/articles/cwy7d7e82gno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T16:02:32.000Z",
      "summary_90w": "",
      "raw": "The Perseids are considered the best meteor shower of the year",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a163d62f4f5569e816eafae2f6f906bdd7b014a",
      "title": "European leaders set to join call with Zelenskyy and Trump on Wednesday, Germany says - as it happpened",
      "url": "https://www.theguardian.com/world/live/2025/aug/11/ukraine-russia-trump-putin-summit-zelenskyy-europe-live-news-update",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T16:01:56.000Z",
      "summary_90w": "",
      "raw": "Trump also expressed frustration with Ukrainian president and pushed for a Zelenskyy-Putin meeting during press conference \nOn France, AP noted that the red alert has been issued only eight times since it was created in 2004 after a deadly summer the year before.\nIt is reserved for extreme, prolonged heat with major health risks and the potential to disrupt daily life.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e66519a8a7a15f8cc688272ca6a20dc964aef788",
      "title": "Electronic Arts blocks more than 300,000 attempts to cheat after launching Battlefield 6 beta",
      "url": "https://techcrunch.com/2025/08/11/electronic-arts-blocks-more-than-300000-attempts-to-cheat-after-launching-battlefield-6-beta/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:01:30.000Z",
      "summary_90w": "",
      "raw": "Soon after the launch of first-person shooter Battlefield 6, cheaters flooded the games, forcing Electronic Arts to respond.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded8323ef01c9a8645666d22f063db1c60abf5a6",
      "title": "Revel shuts down its ride-hail business to focus on EV charging",
      "url": "https://techcrunch.com/2025/08/11/revel-shuts-down-its-ride-hail-business-to-focus-on-ev-charging/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T15:33:14.000Z",
      "summary_90w": "",
      "raw": "Revel has abandoned its small Uber and Lyft competitor four years after it started, and is looking to sell or return its bright-blue Tesla and Kia EVs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, stoic and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25d6b09f99576fb94bbcb34668e782d8243acaa8",
      "title": "Sydney has wettest start to August in decades – and there could be more rain when spring arrives",
      "url": "https://www.theguardian.com/environment/2025/aug/12/sydney-wettest-start-august-decades-could-be-more-rain-spring",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T15:00:07.000Z",
      "summary_90w": "",
      "raw": "More than double the monthly average rain fell in the first 11 days, marking the wettest start to the month since 1998\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAfter Sydney’s soggiest start to August in nearly three decades, even more rain could be on the way, with a wetter than usual spring forecast for eastern New South Wales.\nOnly 11 days into August, rainfall in the city had reached 194mm – more than double the monthly average – marking the wettest start to the month since 1998, according to Weatherzone.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "714eb0e154ca54f52b2aee51a900cb1cc5349b5f",
      "title": "Nvidia unveils new Cosmos world models, infra for robotics and physical uses",
      "url": "https://techcrunch.com/2025/08/11/nvidia-unveils-new-cosmos-world-models-other-infra-for-physical-applications-of-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Nvidia on Monday unveiled a set of new world AI models, libraries, and other infrastructure for robotics developers, most notable of which is Cosmos Reason, a 7-billion-parameter \"reasoning\" vision language model for physical AI applications and robots.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "05a63ae699b32039d504a866818eb757b8c3ef59",
      "title": "No plans to change passenger rules for new young drivers a 'major oversight', AA says",
      "url": "https://www.bbc.com/news/articles/c8jpp3jwe32o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T14:56:51.000Z",
      "summary_90w": "",
      "raw": "Government plans to overhaul driving laws do not include graduated licences for new drivers, despite calls for their introduction.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68f358f6bc037412af4a5d3379d94d256bec4a0e",
      "title": "Colombian Senator Miguel Uribe dies two months after being shot",
      "url": "https://www.bbc.com/news/articles/c78mmj97ygmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T14:55:18.000Z",
      "summary_90w": "",
      "raw": "Miguel Uribe has died of injuries he sustained in a targeted attack on his life at a rally in June.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "446fae1a124b3bce49b50f995037861331169278",
      "title": "Elon Musk confirms shutdown of Tesla Dojo, ‘an evolutionary dead end’ ",
      "url": "https://techcrunch.com/2025/08/11/elon-musk-confirms-shutdown-of-tesla-dojo-an-evolutionary-dead-end/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T14:50:26.000Z",
      "summary_90w": "",
      "raw": "“Once it became clear that all paths converged to AI6, I had to shut down Dojo and make some tough personnel choices, as Dojo 2 was now an evolutionary dead end,” Musk posted on X, the social media platform he owns, on Sunday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "762ee542a8598e16cb0290b4087a0e491b574164",
      "title": "Some don't know 'full nature' of Palestine Action, says Cooper",
      "url": "https://www.bbc.com/news/articles/cj0yyvj7jmmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T14:46:32.000Z",
      "summary_90w": "",
      "raw": "Defending the group's proscription under terror law, she said the organisation was \"not a non-violent organisation\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8baae8c7c6612484634589ea2422301df3e910f8",
      "title": "Councillor was rabble rousing crowd, court hears",
      "url": "https://www.bbc.com/news/articles/cj6yyw13w4jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T14:46:05.000Z",
      "summary_90w": "",
      "raw": "Ricky Jones denies encouraging violent disorder after comments at a counter-protest last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6064bc6d9692689547530b924ce5bc54344ba707",
      "title": "Eight people killed in barrage of gunfire on Ecuador nightclub",
      "url": "https://www.theguardian.com/world/2025/aug/11/eight-people-killed-ecuador-nightclub",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:43:11.000Z",
      "summary_90w": "",
      "raw": "Police found 800 cartridge cases at the scene, where gunmen had arrived in two pickup trucks and opened fire\nEight people have been killed and two others wounded when a group of gunmen unleashed a barrage of gunfire on a crowd outside a nightclub in a town in south-western Ecuador.\nLaw enforcement arrived on the scene following an emergency call alerting them to a shooting, and found “several people wounded and seven bodies”, said Javier Chango, the police colonel, at a press conference on Sunday, adding that an eighth person died in the hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b36528f992cc0ea310158a1c5b312be26bf2bef",
      "title": "Ford throws out Henry Ford’s assembly line to make low-cost EVs in America",
      "url": "https://techcrunch.com/2025/08/11/ford-throws-out-henry-fords-assembly-line-to-make-low-cost-evs-in-america/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T14:31:06.000Z",
      "summary_90w": "",
      "raw": "The automaker is investing $2 billion into the Louisville Assembly Plant with a $30,000 EV pickup slated for 2027.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "586d51d067e1af362dd6f81931a2c63aa2298b89",
      "title": "UK's biggest toy shop chain The Entertainer handed to staff",
      "url": "https://www.bbc.com/news/articles/cgm2jjwmw9jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T14:14:42.000Z",
      "summary_90w": "",
      "raw": "The toy retailer's 1,900 workers will get a share of profits and a say in how the business is run.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9f71f139474b37a51e68ad686ccd921c78a89c62",
      "title": "WA’s ‘longest and most intense’ marine heatwave killed coral across 1,500km stretch",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/was-longest-and-most-intense-marine-heatwave-killed-coral-across-1500km-stretch",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:01:06.000Z",
      "summary_90w": "",
      "raw": "Scientists shocked by bleaching event that hit reefs from the world heritage-listed Ningaloo to the remote Ashmore Reef\n\nGet our breaking news email, free app or daily news podcast\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nThe “longest, largest and most intense” marine heatwave ever recorded in Western Australia has killed coral throughout an area that stretches 1,500km, according to state and federal scientists. \n\r\n More than 100 scientists and marine managers will gather in Perth on Tuesday for a special meeting to discuss the devastating event that bleached and killed corals on remote reefs earlier this year.\nThe marine heatwave that hit reefs from the world heritage-listed Ningaloo to the remote Ashmore Reef left many scientists shocked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77a282777b6452f619ee5cac92da4a4155e3ba8c",
      "title": "EU citizens awaiting UK residency status have right to travel, Home Office told",
      "url": "https://www.theguardian.com/uk-news/2025/aug/11/eu-citizens-awaiting-uk-residency-status-have-right-to-travel-home-office-told",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:56:02.000Z",
      "summary_90w": "",
      "raw": "Statutory body expresses ‘serious concerns’ over difficulties faced by some applicants taking short trips abroad\nEU citizens waiting for the Home Office to decide their pre-Brexit residency status should not be removed from the UK if they make a short return visit abroad for business, leisure or family matters, the statutory body for EU citizens’ rights has said.\nThe Independent Monitoring Authority for Citizens’ Rights Agreements (IMA) has written to the Home Office to express “serious concerns” about the difficulties applicants on the waiting list face if they leave the country.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc5fe4102f3d6d27826066d282eca2ad65b0692b",
      "title": "Canadian man rescued after 9 days in wilderness surviving on pond water",
      "url": "https://www.bbc.com/news/articles/c23ppzevgpvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T13:55:55.000Z",
      "summary_90w": "",
      "raw": "The 39-year-old built a makeshift shelter to survive in British Columbia's  wilderness and wrote \"help\" on a rock.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d0ea03aa591ea6a2fa4bfacdff41d84d1bf535d",
      "title": "Judge denies release of Ghislaine Maxwell grand jury transcripts",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5492207/epstein-maxwell-grand-jury-transcripts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T13:52:38.000Z",
      "summary_90w": "",
      "raw": "President Trump called for the release of the grand jury transcripts after growing pressure to divulge more information about Jeffrey Epstein's case, but the judge on the case said there is nothing new to release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1982ba33fe6d1ac6d4f280fb356d608c6e699d29",
      "title": "Finland charges tanker crew members with sabotage of undersea cables",
      "url": "https://www.theguardian.com/world/2025/aug/11/finland-accuses-tanker-crew-sabotage-undersea-cables-anchor",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:33:33.000Z",
      "summary_90w": "",
      "raw": "Captain and first and second officers of Eagle S, understood to be part of Russia’s ‘shadow fleet’, charged over incident\nFinnish authorities have filed charges against members of the crew of an oil tanker suspected of damaging five undersea cables by dragging its anchor between Finland and Estonia.\nFinland’s deputy prosecutor general’s office said on Monday it had filed charges of aggravated sabotage and aggravated interference with telecommunications against the captain and first and second officers of the Eagle S. The Cook Islands-registered tanker is understood to be part of Russia’s “shadow fleet” – comprising vessels that sail under foreign flags to evade sanctions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66db2f710278fec589a05ac0d76920d7f45fa942",
      "title": "Palestinian activist killed by settler filmed his shooting, footage shows",
      "url": "https://www.theguardian.com/world/2025/aug/11/awdah-hathaleen-shooting-video-west-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:26:14.000Z",
      "summary_90w": "",
      "raw": "B’Tselem publishes film showing killing of Awdah Hathaleen after suspect released by court over ‘weakened’ evidence\n\nMiddle East crisis – latest updates\n\nAwdah Hathaleen, the prominent Palestinian activist who was killed late last month by an extremist Jewish settler in the West Bank, filmed the moment he was shot, newly released video footage reveals.\nHathaleen, who worked on the filming of the Oscar-winning documentary No Other Land, which examined settler violence against the Palestinian community of Masafer Yatta, was killed by Yinon Levi, a settler who was already under sanctions in the UK and EU for violent acts against Palestinians.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82108e688a77979c9ae409e6241be06eb8c5afb2",
      "title": "Nvidia, AMD may sell high-end AI chips to China if they pay US a cut",
      "url": "https://techcrunch.com/2025/08/11/nvidia-amd-may-sell-high-end-ai-chips-to-china-if-they-pay-us-a-cut/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T13:09:13.000Z",
      "summary_90w": "",
      "raw": "The global AI chip race narrative used to be about U.S. national security, but apparently now it's about tariffs: Nvidia and AMD have agreed to pay the U.S. government 15% of the revenue they make from sales of high-end AI chips to China in exchange for licenses to sell those chips in the country, the Financial Times reported, citing anonymous sources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7369236ecc2f0aa73b316e4fb9aac9a4b3c4215c",
      "title": "Helping Australian teachers share lesson plans could improve stagnating student results, Productivity Commission says",
      "url": "https://www.theguardian.com/australia-news/2025/aug/11/helping-australian-teachers-share-lesson-plans-could-improve-stagnating-student-results-productivity-commission-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T12:30:04.000Z",
      "summary_90w": "",
      "raw": "A national database of lesson plans was one of the recommendations of the fourth interim report into how to lift Australia’s flagging productivity\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA national online database of lesson plans would help teachers cut hours from their weekly workloads and help reverse years of stagnating student results, the Productivity Commission says.\nThe commission’s fourth interim report on how to lift Australia’s flagging productivity focused on building a skilled and adaptable workforce.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "917aa8a634ac8bdfe0daa479a7a26baedbbad9bb",
      "title": "EasyJet pilot suspended after being seen 'drunk and naked'",
      "url": "https://www.bbc.com/news/articles/c80dd15378eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T12:03:48.000Z",
      "summary_90w": "",
      "raw": "The budget airline grounded the unnamed pilot after hotel guests reportedly complained after the incident in Cape Verde.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86408e6b3c506881f90c2d8d0e2761be6c8b0d4b",
      "title": "Global outrage mounts as funeral held for five journalists killed by Israel",
      "url": "https://www.theguardian.com/world/2025/aug/11/funeral-held-for-anas-al-sharif-and-other-journalists-killed-in-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:39:01.000Z",
      "summary_90w": "",
      "raw": "Last post from Anas al-Sharif, whom Al Jazeera calls one of Gaza’s bravest journalists, decries failure to stop ‘massacre’\n\nMiddle East crisis – live updates\n\nThe death of the prominent Al Jazeera journalist Anas al-Sharif, killed along with four colleagues in an Israeli airstrike on Sunday, prompted condemnation from around the world, as hundreds of mourners carried their bodies through the streets of Gaza City.\nSharif, one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. Seven people were killed in the attack, including the Al Jazeera correspondent Mohammed Qreiqeh and the camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa, according to the Qatar-based broadcaster.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de1f677a27bc1bbfc959ada3cba628638197ab71",
      "title": "Trump vows to crack down on D.C. crime. And, Putin-Trump meeting to discuss end of war",
      "url": "https://www.npr.org/2025/08/11/g-s1-81981/up-first-newsletter-washington-dc-federal-agents-putin-trump-summit-israel-gaza",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T11:33:15.000Z",
      "summary_90w": "",
      "raw": "President Trump has deployed federal agents in the nation's capital to crack down on crime and homelessness. And, Trump and Russian President Vladimir Putin are expected to meet Friday in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a5e41cf743125102a17b92b669f591cbfda8315",
      "title": "Apple’s new Siri may allow users to operate apps just using voice",
      "url": "https://techcrunch.com/2025/08/11/apples-new-siri-may-allow-users-to-operate-apps-just-using-voice/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T11:23:38.000Z",
      "summary_90w": "",
      "raw": "Apple is testing a version of Siri that will be able to take actions on your behalf across various apps by following voice commands. The company plans to release a new version of App Intents, its framework gives developers the ability to allow users access to parts of their app via different systems, like search and Shortcuts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5edf8e28079d3903fd510d1b509d43ff753814b4",
      "title": "Helicopter pilot in crash that killed Outback Wrangler star was a ‘party animal’, court told",
      "url": "https://www.theguardian.com/australia-news/2025/aug/11/outback-wrangler-court-helicopter-pilot-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:16:45.000Z",
      "summary_90w": "",
      "raw": "Jock Purcell tells court Sebastian Robinson was ‘hopeless with paperwork’ and says Matt Wright – who has pleaded not guilty to attempting to pervert the course of justice – was ‘lenient’ with record keeping \n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA pilot whose helicopter crashed, killing Outback Wrangler co-star Chris “Willow” Wilson, was a “party animal” and cocaine user who was “hopeless” at keeping flight records, a court has been told.\nPilot Sebastian Robinson was left a paraplegic after the February 2022 crash during a crocodile-egg collecting mission in remote swampland in the Northern Territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b6003219965f1b2897cd364ed9369c51167aabc",
      "title": "Farmers displaced by $1.5bn Trump golf course reportedly being offered rice and cash",
      "url": "https://www.theguardian.com/world/2025/aug/11/farmers-displaced-trump-golf-course",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:07:50.000Z",
      "summary_90w": "",
      "raw": "White House denies suggestions resort in Vietnam presents conflict of interest amid row over compensation rates\nVillagers whose farms in Vietnam will be bulldozed to make way for a $1.5bn golf resort backed by the Trump family have reportedly been offered rice provisions and cash compensation of as little as $12 for a square metre of land by state authorities.\nThousands of villagers will be offered compensation based on land size and location, according to a report by Reuters. The agency spoke to elderly farmers who said they feared they would struggle to find a stable livelihood.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25a6bf028ec68c59674bf84a858b87c3338ea89d",
      "title": "Man jumps on to moving high-speed train",
      "url": "https://www.bbc.com/news/articles/c05eevjl06jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:51:50.000Z",
      "summary_90w": "",
      "raw": "The man was left behind after apparently taking advantage of a scheduled stop to have a cigarette.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f606e727abaf23dd9d358808a09e513c80654a94",
      "title": "Dozens of Malian soldiers arrested over alleged coup plot against junta, sources say",
      "url": "https://www.bbc.com/news/articles/c79llr41y3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:48:54.000Z",
      "summary_90w": "",
      "raw": "The wave of arrests reflect increased tensions within the military government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df2c314f7e9f33abc8d050357b7394409e99d467",
      "title": "China rams own warship while chasing Philippine vessel",
      "url": "https://www.bbc.com/news/articles/cev22n0lm1xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:34:44.000Z",
      "summary_90w": "",
      "raw": "The crash in the disputed Scarborough Shoal rendered a Chinese warship \"unseaworthy\", Manila said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "441807ddb64b0246b9323978db7b23b42d256aff",
      "title": "Weather tracker: Europe braces for another heatwave with highs of 44C",
      "url": "https://www.theguardian.com/environment/2025/aug/11/weather-tracker-europe-heatwave-spain-portugal-north-america",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T10:26:47.000Z",
      "summary_90w": "",
      "raw": "Parts of Spain and Portugal likely to bear brunt of heat, while drought conditions sweep North America\n\nEurope live – latest updates\n\nAfter a period of cooler weather, swaths of central and eastern Europe face another heatwave as hot air over south-western Europe pushes north-west.\nSince late July, large parts of the Iberian peninsula have endured persistent heat, with temperatures frequently climbing to the high 30s to low 40s celsius.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ce7f0de56478b344de0d016c1792b75486304d",
      "title": "Delhi given eight weeks to round up hundreds of thousands of stray dogs ",
      "url": "https://www.bbc.com/news/articles/cly665zjg2eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:22:02.000Z",
      "summary_90w": "",
      "raw": "Activists say it will be difficult to move over a million stray dogs to shelters within eight weeks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d83cad531dde5ba3c18a37c3be8d683de6db748",
      "title": "Amber health alerts as heatwave temperatures set to hit 34C",
      "url": "https://www.bbc.com/weather/articles/cz60081dpyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T10:02:31.000Z",
      "summary_90w": "",
      "raw": "Temperatures are expected to peak on Tuesday as heat health alerts are issued for the whole of England.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f86f2b14d072b4d96758ad8c0d7172778b83d9e5",
      "title": "British man who perished in Antarctic glacier found 65 years later",
      "url": "https://www.bbc.com/news/articles/c4g034yx4gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T09:05:51.000Z",
      "summary_90w": "",
      "raw": "His brother tells BBC News that he had lost hope he would ever be found.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1c069b50e5706daf98b2d1895fbc0b55c730b37",
      "title": "Conservative writer Max Boot discusses the changing world order",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5494725/conservative-writer-max-boot-discusses-the-changing-world-order",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:04:07.000Z",
      "summary_90w": "",
      "raw": "Steve Inskeep speaks with author and conservative commentator Max Boot about the changing world order.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d369b043fb360561f4eacbf65523dbf297880eb4",
      "title": "Factories from GE to Kraft Heinz lose immigrant workers, stressing those who remain",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496335/trump-immigration-workers-parole-tps",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump campaigned on helping American workers through his immigration policies. Now that he's revoked work authorization for thousands of immigrants, those left behind are feeling taxed by their absence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4da50f5b04db72769ec29b4cd6a30e0192b5ac8b",
      "title": "Influencers criticize birth control and push 'natural' methods. Here's what to know",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5494736/hormonal-birth-control-side-effects",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Social media is full of videos saying hormonal contraception can hurt you and promoting natural alternatives. How did the treatments get such a bad reputation and do alternatives work?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88f224a667546254d25af6df313cfb4eded31142",
      "title": "Trump's tariff revenue has skyrocketed. But how big is it, really?",
      "url": "https://www.npr.org/2025/08/11/g-s1-81934/trump-tariffs-record-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump's new tariffs are pouring in. But it's still only a fraction of overall government revenues — and falls short of new spending in the recent Republican megabill.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "022d6c9011ee1101105ea6d644b311ccd9b3d3d8",
      "title": "Growing pains: can rice production in Africa keep up with demand?",
      "url": "https://www.theguardian.com/world/2025/aug/11/can-rice-production-in-africa-keep-up-with-demand",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T07:21:32.000Z",
      "summary_90w": "",
      "raw": "Africa Rice initiative aims to give farmers more control over their land in order to reduce flooding and increase yields\nSalmata Ouattara remembers 2023 as the turning point for her rice farm.\nJune is usually the peak of the rainy season in Ivory Coast, but in the preceding years she and other farmers in M’Be on the outskirts of Bouaké, the country’s second biggest city, would wait weeks for rainfall. Then in September, they would watch helplessly as their farmlands were flooded. Some abandoned their farms, frustrated by fluctuating crop yields.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "faf1b03d39c539838f0e31c4d98651b701ca52d8",
      "title": "Profitable Nigerian food delivery Chowdeck lands $9M from Novastar, Y Combinator",
      "url": "https://techcrunch.com/2025/08/11/nigeria-profitable-food-delivery-chowdeck-lands-9m-from-novastar-y-combinator/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T07:11:55.000Z",
      "summary_90w": "",
      "raw": "Chowdeck, a Lagos-based food delivery startup that has stayed profitable in a notoriously tough and low-margin market, has raised $9 million in Series A funding to launch a quick commerce strategy and expand into more cities in Nigeria and Ghana.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3f0cba1ce4f971e6dfe974a4aa734e9b97063a8b",
      "title": "What we're reading on the beach this summer",
      "url": "https://www.npr.org/2025/08/11/1257106922/what-were-reading-on-the-beach-this-summer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T07:00:59.000Z",
      "summary_90w": "",
      "raw": "It's time for our annual beach reading recs. Today we bring you three books, with a little economic learning to boot. Our recs: \nWho is Government? The Untold Story of Public Service by Michael Lewis \nEl Dorado Drive by Megan Abbott \nAlgospeak: How Social Media is Transforming the Future of Language by Adam Aleksic \nRelated episodes: \nBeach reading with a side of economics How to beach on a budget \nHow to beach on a budget \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c9f7910646582932516b5a776241699945134b18",
      "title": "British backpacker pleads guilty to killing man while drunk on e-scooter",
      "url": "https://www.bbc.com/news/articles/c0e999y7vq2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T05:59:30.000Z",
      "summary_90w": "",
      "raw": "Alicia Kemp, 25, from Redditch, was on a working holiday in Western Australia when she hit the father-of-two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14a5b8f3d8c6fefe9ec0e08b34b3ffab6df36e81",
      "title": "Eight killed in Ecuador nightclub shooting",
      "url": "https://www.bbc.com/news/articles/czr66pj1k72o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T05:41:13.000Z",
      "summary_90w": "",
      "raw": "The nightclub was in Guayas, one of four Ecuadorian provinces currently in a state of emergency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6b8598517d86cf5d598034ed450cc5b6a1450b7",
      "title": "Japan rocked by bullying scandal after team withdraws from high school baseball tournament",
      "url": "https://www.theguardian.com/world/2025/aug/11/japan-baseball-bullying-koryo-high-school-tournament-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T05:22:57.000Z",
      "summary_90w": "",
      "raw": "Koryo high pulled out of the popular competition after an outcry over reports that some of its members had bullied a junior player\nOne of Japan’s most popular sports tournaments is reeling after the sudden withdrawal of a team whose teenage players have been accused of abusing a younger teammate.\nKoryo high school, which had been representing Hiroshima prefecture in the summer high school baseball championships, announced on Sunday it would no longer take part.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffdd7e22e2c335548d32088764e5a89c66532b41",
      "title": "Their loved ones are missing at war. So these Ukrainian children spend summer together",
      "url": "https://www.bbc.com/news/articles/cdx0ex5v437o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T04:35:55.000Z",
      "summary_90w": "",
      "raw": "Will Vernon gets exclusive access to a pioneering summer camp for Ukrainian children with missing parents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cbbae2d9d1fb73abe4f1d7cb63ee90e872bd59b1",
      "title": "Australia to recognise Palestinian state in September",
      "url": "https://www.bbc.com/news/articles/cvg33351n61o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T04:16:09.000Z",
      "summary_90w": "",
      "raw": "It follows similar moves by the UK, France and Canada.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc0e84373504817010918a2e7510c8757f9d683e",
      "title": "China diplomat tipped as next foreign minister detained by authorities – report",
      "url": "https://www.theguardian.com/world/2025/aug/11/liu-jianchao-china-diplomat-detained-beijing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T03:02:20.000Z",
      "summary_90w": "",
      "raw": "Liu Jianchao, the envoy in charge of managing ties with foreign political parties, was reportedly detained in late July\nLiu Jianchao, a senior Chinese diplomat widely seen as a potential future foreign minister, has been detained by authorities for questioning, the Wall Street Journal has reported.\nLiu was taken away after returning to Beijing in late July from an overseas work trip, it reported on Sunday, citing people familiar with the matter.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b42380276c70efff19a30ad3f6d96d87b8f9266",
      "title": "China's unemployed young adults who are pretending to have jobs",
      "url": "https://www.bbc.com/news/articles/cdd3ep76g3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T01:50:13.000Z",
      "summary_90w": "",
      "raw": "With Chinese youth unemployment high, individuals are paying to go into offices and pretend to work.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b452372fb87b55b0353d738a8a0da81a7058a0fc",
      "title": "Turkey earthquake flattens buildings in north-east Balikesir province",
      "url": "https://www.bbc.com/news/articles/cwy557j3y5lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T00:13:55.000Z",
      "summary_90w": "",
      "raw": "The magnitude 6.1 quake left one person dead and caused 16 buildings to collapse in the north-west Balikesir province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea131997d68ef45d7a7fd94d748204d2ff4544ef",
      "title": "New voters list in Indian state includes wrong photos and dead people",
      "url": "https://www.bbc.com/news/articles/c3wnx7689l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T23:22:21.000Z",
      "summary_90w": "",
      "raw": "A political row has broken out over India's Election Commission's decision to update the rolls in Bihar.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82be48808290f612f64dc026bffb8a40dffd0c9d",
      "title": "Adidas designer sorry for shoes 'appropriated' from Mexico",
      "url": "https://www.bbc.com/news/articles/c1mpzm4p7edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T21:32:07.000Z",
      "summary_90w": "",
      "raw": "He has apologised over the Oaxaca Slip-on, inspired by sandals made by Indigenous artisans, after criticism from Mexico.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f04c0c49c83d6f52b14b0d4a2d606dc24c973cb0",
      "title": "Bowen: Israeli settlers intensify campaign to drive out West Bank Palestinians",
      "url": "https://www.bbc.com/news/articles/cj4wwxz12jko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T21:03:27.000Z",
      "summary_90w": "",
      "raw": "In the shadow of the Gaza war, violence is rising in the occupied territories as radical settlers seize land with the backing of the government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3701fabc6ee355102da47927fc04888656c871d4",
      "title": "Netanyahu defends Gaza plans as Israel heavily criticised at UN Security Council",
      "url": "https://www.bbc.com/news/articles/c5yll33v9gwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T18:52:12.000Z",
      "summary_90w": "",
      "raw": "Israel's Prime Minister also claimed Israeli hostages held in Gaza were \"the only ones being deliberately starved\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "615e95778343b72986b3a8815215add49b70ffbd",
      "title": "Three swimmers killed by sea mines in Odesa, Ukrainian media report",
      "url": "https://www.bbc.com/news/articles/c1mpp9127dro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T16:38:06.000Z",
      "summary_90w": "",
      "raw": "A local official confirmed the three had been killed by \"explosive devices\", at beaches where recreational swimming is banned.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe6c7ce90325a67bd27a5e6670771b6f6f05f0f0",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "summary_90w": "",
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35f5b7f5a08af746467e75b951d1769e913f63c0",
      "title": "Businesses can use your online data to overcharge you. What can customers do?",
      "url": "https://www.npr.org/2025/08/10/nx-s1-5494712/businesses-can-use-your-online-data-to-overcharge-you-what-can-customers-do",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-10T12:41:15.000Z",
      "summary_90w": "",
      "raw": "NPR's Adrian Ma speaks to Sam Levine, former director of the FTC's Bureau of Consumer Protection, now at UC Berkeley, about the use online data to charge some customers more for products and services.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "34270487e80eb609a59f83d75f10736f6de2c8e7",
      "title": "Israel protesters intensify pressure against plan to expand Gaza war",
      "url": "https://www.bbc.com/news/articles/c4ged13jjglo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T11:53:29.000Z",
      "summary_90w": "",
      "raw": "Meanwhile in Gaza, five people, including two children, died in the past 24 hours from malnutrition, the Hamas-run health ministry said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d33561c04a8a5a6dc79d30eafe31de3ea6baf4a2",
      "title": "Meteorite that hit home is older than Earth, scientists say ",
      "url": "https://www.bbc.com/news/articles/cwy003l0pw0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T11:28:54.000Z",
      "summary_90w": "",
      "raw": "Scientists who analysed fragments that crashed into a roof in Georgia, US, say it likely formed 4.56 billion years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74b35f94c13ce0e17916bd355794db3c2940082a",
      "title": "South Korea’s military shrinks by 20% as low birthrate hits recruitment",
      "url": "https://www.theguardian.com/world/2025/aug/10/south-korea-military-shrinks-by-20-per-cent-as-low-birthrate-hits-recruitment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T10:15:05.000Z",
      "summary_90w": "",
      "raw": "World’s lowest fertility rate leaves Seoul 50,000 troops short of maintaining defence readiness, report warns\nSouth Korea’s military has shrunk by 20% in the past six years, largely due to a sharp decrease in the population of men of enlistment age for mandatory service in the country with the world’s lowest birthrate, according to a report.\nThe sharp decline in the pool of men available for military service is also causing a shortfall in the number of officers and could result in operational difficulties, the defence ministry said in the report.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a40d925f087052e60ed2bef9ece495c7224e00e7",
      "title": "Ukraine's European allies say peace talks must include Kyiv",
      "url": "https://www.bbc.com/news/articles/c0e9py7e28xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T07:27:28.000Z",
      "summary_90w": "",
      "raw": "The White House says Trump is open to Ukraine joining talks with Putin on Friday, as Zelensky insists any deal without Kyiv is a “dead decision”.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59cc58fd6194d07870d360f8d7a9df61efec8846",
      "title": "Jubilant scenes but bumpy road ahead in post-Hasina Bangladesh",
      "url": "https://www.bbc.com/news/articles/c741qken2wvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T01:52:02.000Z",
      "summary_90w": "",
      "raw": "Bangladesh marked a year since Sheikh Hasina fled with promises of renewal, but little mention of its problems.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9ea741cd2d40531263faa6c451ba841f69a90de",
      "title": "France's last newspaper hawker gets Order of Merit from his old customer - President Macron",
      "url": "https://www.bbc.com/news/articles/cdx0vvpeq9wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T23:28:53.000Z",
      "summary_90w": "",
      "raw": "Ali Akbar has sold papers in Paris since 1973 and once counted President Macron among his customers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b28633a5033c3291c9d357dab22dd3aa6179e98",
      "title": "What it means to be 'culturally' Irish in 2025 is complicated - as Ed Sheeran has shown",
      "url": "https://www.bbc.com/news/articles/cgln9y13x3yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T23:09:31.000Z",
      "summary_90w": "",
      "raw": "Ed Sheeran grew up in England but described himself as 'culturally Irish,' prompting debate about what that really means",
      "topics": [
        "World"
      ]
    },
    {
      "id": "424baed4d74787067b5fa955bd4e435e60e631ed",
      "title": "Mars rock found in Niger sells for millions in New York - now the country wants answers",
      "url": "https://www.bbc.com/news/articles/cly3q635n4no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-09T23:07:33.000Z",
      "summary_90w": "",
      "raw": "The West African country investigates how a space rock found there was put up for sale in New York.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b738ea59ed9d06875f61ea110fc61fe764a33fe",
      "title": "Bolsonaro supporters pray for Trump rescue as coup plot trial verdict nears",
      "url": "https://www.theguardian.com/world/2025/aug/09/bolsonaro-supporters-pray-for-trump-rescue-coup-plot-trial-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-09T09:00:02.000Z",
      "summary_90w": "",
      "raw": "Far-right ex-president’s devotees pin hopes on pressure campaign but tariffs and sanctions appear likely to fail\nEach morning, Edite Costa steps out of her bungalow on Brasília’s sun-baked savannah, stands beneath a mango tree and lifts her hands to the sky in prayer. “I ask God to work so that not just Trump but all Americans come to help us rip out the evil that has taken hold of the country I love,” said the 66-year-old Baptist, who is a fervent supporter of Brazil’s far-right former president Jair Bolsonaro.\nBolsonaro could face decades in jail for allegedly leading a murderous conspiracy to seize power after his leftwing rival Luiz Inácio Lula da Silva beat him in the 2022 presidential election. But Costa believes her populist leader can still be saved – if her prayers are answered and Donald Trump intervenes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6118adfb29d3a3ccc1cde04666492186d44a4219",
      "title": "We get asked about tariffs all the time. Here's what we say",
      "url": "https://www.npr.org/2025/08/09/nx-s1-5496262/trump-tariffs-economy-inflation",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "From inflation to recession, we who cover the economy and business at NPR get asked about tariffs all the time. Here are some of the most frequent questions — and what we answer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3c59ae5cdcee706c5c15bee697b5db5933d0e412",
      "title": "What happens when governments cook the books",
      "url": "https://www.npr.org/2025/08/08/1256971798/bls-bureau-labor-statistics-greece-argentina",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-09T02:48:51.000Z",
      "summary_90w": "",
      "raw": "After President Trump fired the head of the Bureau of Labor Statistics, economists and statisticians across the board were horrified. Because the firing raises the spectre of potential manipulation – and it raises the worry that, in the future, the numbers won't be as trustworthy.\nSo: we looked at two countries that have some experience with data manipulation. To ask what happens when governments get tempted to cook the books. And...once they cook the books... how hard is it to UN-cook them?\nIt's two statistical historical cautionary tales. First, we learn how Argentina tried to mask its true inflation rate, and how that effort backfired. Then, we hear about the difficult process of cleaning up the post-cooked-book mess, in Greece. \nFor more: \n - Can we just change how we measure GDP?\n - The price of lettuce in Brooklyn\n - What really goes on at the Bureau of Labor Statistics (Update)\n - Can we still trust the monthly jobs report? (Update)\n - How office politics could take down Europe\n - The amazing shrinking economy might stop shrinking\n\nListen free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.\nSupport Planet Money, get bonus episodes and sponsor-free listening and now Summer School episodes one week early by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "87e0cb3806c43dd5fbc2c815f724788e794b20aa",
      "title": "Elon Musk's AI accused of making explicit AI Taylor Swift videos",
      "url": "https://www.bbc.com/news/articles/cwye62e1ndjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T23:06:01.000Z",
      "summary_90w": "",
      "raw": "Grok Imagine's \"spicy\" mode made explicit videos of Taylor Swift, according to The Verge and Gizmodo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cbe7856e19b5b650b0cba2aea05137b4b05be374",
      "title": "IRS Commissioner Billy Long replaced after less than two months",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5496549/irs-billy-long-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-08T20:18:04.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has replaced former Missouri Congressman Billy Long as IRS Commissioner, after less than two months on the job.  It's the latest in a string of management shakeups at the tax collection agency.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f15d46072d76650f324bbc501ec86b4112d6eee9",
      "title": "We've all gotten those hiring scam texts. Instead of deleting, this writer played along",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5494743/weve-all-gotten-those-hiring-scam-texts-instead-of-deleting-this-writer-played-along",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-08T20:17:22.000Z",
      "summary_90w": "",
      "raw": "Alexander Sammon received a suspicious job recruitment text from someone who claimed to be a hiring manager. He decided to play along to see how far the scam would go, and wrote about it for Slate.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "09db49576b6bc95ecf674b612004c5ae8fbea7c1",
      "title": "Trump calls for Intel boss to resign immediately, alleging China ties",
      "url": "https://www.bbc.com/news/articles/c70x6602pdyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T16:43:07.000Z",
      "summary_90w": "",
      "raw": "The unusual demand adds to challenges facing the firm, which has been seen as falling behind in the chip race.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a0cffe0b1719cb447d49291529b1e9b8f862e00",
      "title": "OpenAI beats Elon Musk's Grok in AI chess tournament",
      "url": "https://www.bbc.com/news/articles/ce830l92p68o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T11:37:19.000Z",
      "summary_90w": "",
      "raw": "The tournament saw models from Anthropic, Google, xAI and DeepSeek compete against each other to be crowned the top AI chess player.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "527f8f76888890f9006a32ef3b3f42d67e941604",
      "title": "How to get out of a love-hate relationship with your phone",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492392/phone-addiction",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Finding it hard to concentrate? Are you glued to social media for longer than you’d like? Well, maybe it’s not you… maybe it’s the phones.\n\nBrittany is joined by Magdalene Taylor, writer, cultural critic and senior editor at Playboy, and Fio Geiran, producer at TED Radio Hour and a writer of their Body Electric newsletter, to discuss this phrase: “it’s the phones.” They get into the effects that smartphones have on our brains and our culture, why some people are returning to “dumbphones,” and why it might take more than willpower to manage our relationships with our phones.\nClick here to check out the Body Electric newsletter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ecb6c69e01d0fc9179554bc4a3d17f24198c3777",
      "title": "Life-like robots for sale to the public as China opens new store",
      "url": "https://www.bbc.com/news/articles/cgm2jed7xvyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T04:58:20.000Z",
      "summary_90w": "",
      "raw": "Robots on sale at the store include humanoid butlers, chess partners and dogs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1f9673f0113254421ab14083f82fb80ecce702c",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "summary_90w": "",
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3a116098e95d5d8b862a9758d74ef9afaec1ce",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "summary_90w": "",
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10b63c981e5dcb79a30e0f479f1d96c7c3b1d3d7",
      "title": "US hunter reportedly killed by buffalo during expedition in South Africa",
      "url": "https://www.theguardian.com/world/2025/aug/06/hunter-killed-by-buffalo-south-africa",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T14:04:02.000Z",
      "summary_90w": "",
      "raw": "Asher Watkins, 52, of Texas died while tracking 1.3-ton Cape buffalo on a hunting trip in the country’s Limpopo province\nAn American game hunter was killed by a buffalo he was stalking during a hunting expedition in South Africa over the weekend, according to multiple reports.\nAsher Watkins, 52, of Texas, died on 3 August while tracking a 1.3-ton Cape buffalo in South Africa’s Limpopo province, according to a statement from Coenraad Vermaak Safaris (CV Safaris), the company that organized the hunting trip.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "690acb123904939b5719f42c39d3568c6f9c677f",
      "title": "It's 2025, the year we decided we need a widespread slur for robots",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5493360/clanker-robot-slur-star-wars",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People all over TikTok and Instagram are using the word \"clanker\" as a catch-all for robots and AI. Here's a deep dive into the origins of the pejorative and an explanation of why it's spreading.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb5fed10d4a083eb417cdeb5c2a39344a4c35a78",
      "title": "Nihilistic online networks groom minors to commit harm. Her son was one of them",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5479882/teen-forums-violent-extremist-grooming",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Dana's son was hospitalized last year, it led her to a path of discovery about predatory online networks that groom children into harming themselves and others. Their reach is global and growing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66ced3c97746b3b0d64269796bb661b6d428ffdd",
      "title": "So long, study guides? The AI industry is going after students",
      "url": "https://www.npr.org/2025/08/06/g-s1-81012/chatgpt-ai-college-students-chegg-study",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Students are increasingly using AI tools to help with — and do — their homework. Here's how older online study services, students and professors are adapting.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8945631f18016d4fdf50ff4c1677d71cb800d86",
      "title": "Drones delivering coffee? Trump administration wants more companies using UAVs",
      "url": "https://www.npr.org/2025/08/05/g-s1-81121/drones-uavs-trump-administration-faa-duffy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-05T21:36:55.000Z",
      "summary_90w": "",
      "raw": "The Trump administration wants to make it easier for companies to use drones for business — from delivering coffee to inspecting power lines to working on farms.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b247f10f2df4bdf9312924806cdc968fb5a578c0",
      "title": "The Gulf bets big on AI as it seeks the 'new oil'",
      "url": "https://www.bbc.com/news/articles/cvg8z2mx508o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T23:14:44.000Z",
      "summary_90w": "",
      "raw": "The UAE and Saudi Arabia are partnering with the US to position themselves as AI hubs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d4dc5d0e31d716c7a5c39a97704e011c3dd830c",
      "title": "A legendary automotive dream, stalled by scandal and greed",
      "url": "https://www.bbc.co.uk/iplayer/episode/m000rqw8?at_mid=vO2HrMRESU&at_campaign=DeLorean_Back_from_the_Future&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m000vrth&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=DeLorean_Back_from_the_Future&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-07-29T22:41:04.000Z",
      "summary_90w": "",
      "raw": "John DeLorean's compelling story of corporate waste, fraud and an FBI sting",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d20c2ce25c13cec7ba044f41abd29d0618288f2e",
      "title": "Minister must apologise over Savile claim, says Farage",
      "url": "https://www.bbc.com/news/articles/cgery3eeqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T11:28:07.000Z",
      "summary_90w": "",
      "raw": "Minister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cc9359fecc24e9e22f350119da85d0276d2276e",
      "title": "Google launches new AI search feature in UK",
      "url": "https://www.bbc.com/news/articles/clyj4zky4zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T08:43:59.000Z",
      "summary_90w": "",
      "raw": "The new tool marks a significant change for the search giant but raises questions for advertisers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eae996235826ed15dcacb92d3f91925214082d88",
      "title": "Google failed to warn 10 million of Turkey earthquake severity",
      "url": "https://www.bbc.com/news/articles/c77v2kx304go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-27T23:16:50.000Z",
      "summary_90w": "",
      "raw": "The tech giant said only 469 serious warnings were sent out ahead of the 7.8 magnitude quake.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2918baae45081502be80f527615258dfc1e9622",
      "title": "EE says latest outage fixed after 'technical fault'",
      "url": "https://www.bbc.com/news/articles/cx2q8qw0q0go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-26T19:02:36.000Z",
      "summary_90w": "",
      "raw": "The mobile phone service provider says it carried out work overnight after customers reported problems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "278fde701c73890c407618dce62be561820d7e8a",
      "title": "Around 6,000 porn sites start checking ages in UK",
      "url": "https://www.bbc.com/news/articles/c24v4dl5r16o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-25T11:30:21.000Z",
      "summary_90w": "",
      "raw": "Despite the law some remain sceptical about the effectiveness of porn age checks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}