{
  "version": "1755627613284",
  "generatedAt": "2025-08-19T18:20:13.284Z",
  "items": [
    {
      "id": "b7de87ecb1b0ab1e6c98d0bde99c139e51c1e9e7",
      "title": "The new Nissan Leaf is still one of the cheapest EVs in America",
      "url": "https://www.theverge.com/nissan/761633/nissan-leaf-starting-price-cheap-ev",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T18:12:08.000Z",
      "summary_90w": "",
      "raw": "Nissan stunned us all when it released the specs for its refreshed Leaf: new crossover body; dual charging ports; and over 300 miles of range. Today, the Japanese released the starting price for the Leaf, and lo and behold, it’s still a hell of a bargain.\nWhen it reaches dealerships this fall, the 2026 Leaf S Plus will start at $29,990 — or $31,485 when you factor in the $1,495 destination charge. Still, Nissan describes as “the lowest starting MSRP for any new EV currently on sale in the US.” And the company isn’t relying on any gimmickry like federal incentives (because there won’t be any, thanks to President Trump) or fuel savings. Instead, the price is a reflection of Nissan’s commitment to “making EV mobility accessible to all.”\nNissan also said that the SV Plus trim, with a bigger battery and 18-inch alloy wheels, will start at $35,725 including the destination charge.\nThat’s especially low when you consider the average start price for a new EV according to Kelley’s Blue Book is $55,689, which is down 4.2 percent from a year ago. For comparison, gas-powered cars averaged about $48,800, which is up 1.5 percent year over year. Tesla, still the top player in the EV space, saw its average transaction price dip to about $52,900, down more than 9 percent from last year.\nWith the elimination of federal incentives, automakers are redoubling their efforts to produce truly affordable EVs. As competition from China heats up, Hyundai and Kia are both promising more low-cost models. Tesla says it will release a cheaper Model Y later this year. Volkswagen has a €20,000 electric hatchback that it has yet to commit to bringing to the US. And even Ford just released its grand plan to upend its whole manufacturing process to produce cheaper EVs, starting with a $30,000 truck in 2027.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ed2576ada550701f24fbc66d1dc985f86c2931f",
      "title": "White House considering Budapest for Putin-Zelenskyy bilateral, report suggests – live",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T18:09:46.000Z",
      "summary_90w": "",
      "raw": "Spokeswoman refuses to confirm possible location for talks, says Trump ‘definitively’ rules out US troops in Ukraine but remains open to air support\nVolodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February, which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough.\nIn his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports.\nA meeting between Zelenskyy and Putin ... could it finally happen?\nThe need for security guarantees agreed – but details unclear\nTrump believes he is very good at solving conflicts\nA potential boost for the US arms industry\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4d55179928a2a0c6300dc68e0ff2fce2079973a",
      "title": "Asylum seekers to be removed from Epping hotel after council wins High Court injunction",
      "url": "https://www.bbc.com/news/articles/cy98gdnrl7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T18:05:19.000Z",
      "summary_90w": "",
      "raw": "The ruling means all asylum seekers must be moved out of the The Bell Hotel by 12 September.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "946f29357c229c561037d0e8d349fec6477862e9",
      "title": "Apple is reportedly making more of its new iPhones in India instead of China",
      "url": "https://www.theverge.com/news/761582/apple-iphone-17-pro-max-air-india-china",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T18:02:51.000Z",
      "summary_90w": "",
      "raw": "Apple is manufacturing more of its iPhone 17 phones for the US in India instead of in China, and for the first time, the full lineup of new models will ship from India at launch, according to Bloomberg. The company is also working on a successor to the iPhone 16E that it plans to make in India, Bloomberg says.\nApple has increasingly been moving iPhone production to India to reduce its dependence on manufacturing in China. The company already expects to pay $1.1 billion in tariffs for the current quarter, but Bloomberg reports that currently, Apple’s exports of iPhones to the US from India are exempted from tariffs. That’s despite the Trump administration’s 50 percent tariff on many imports from India, and while analyst Patrick Moorhead says.the move “does dodge some tariffs,” he noted that iPhone subassemblies are still mostly produced in China then shipped to India for final assembly.\nEarlier this month, Apple announced a $100 billion investment in US manufacturing that builds on the $500 billion it announced earlier this year. Trump has claimed that companies committed to building products in the US would be exempt from future tariffs on imported chips.\nHowever, Treasury Secretary Scott Bessent told CNBC on Tuesday morning that the administration plans to increase tariffs on India, saying it’s a result of the country buying and selling Russian oil despite sanctions from the war in Ukraine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bae423d0b275192bd14741dba54b1b8cf6041f9a",
      "title": "Databricks CEO says fresh $1B will help him attack a new AI database market",
      "url": "https://techcrunch.com/2025/08/19/databricks-ceo-says-fresh-1b-will-help-him-attack-a-new-ai-database-market/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:48:35.000Z",
      "summary_90w": "",
      "raw": "The round, which pushes Databricks' valuation to $100B, was co-led by Insight Partners and Thrive. CEO Ali Ghodsi says he's found an enormous untapped AI agent market to spend the funds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b393113b1b7c87a3866f2ab08e483f30bf16080a",
      "title": "Hurricane Erin update: Forecast sees huge storm moving closer to U.S.",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507004/hurricane-erin-forecast-outer-banks-east-coast",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T17:38:53.000Z",
      "summary_90w": "",
      "raw": "Forecasts nudge Erin's likely path to the west, increasing the risks at U.S. beaches. Experts say the storm's massive size, rather than its windspeeds, is what makes it a threat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab455ff7404b184cefff89322a786e0e948577d9",
      "title": "Asus has the new world’s fastest OLED monitor at 720Hz, and it’s dripping with style",
      "url": "https://www.theverge.com/news/761481/asus-720hz-gaming-monitor-rog-swift-oled-pg27aqwp-w",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T17:31:13.000Z",
      "summary_90w": "",
      "raw": "We might have a new king of esports gaming monitors — one with fewer compromises than usual. Asus has just announced the ROG Swift OLED PG27AQWP-W at Gamescom 2025. Not only does it offer a 26.5-inch 2560 x 1440 QHD OLED screen at a blazing-fast 540Hz, it’s also a dual-mode panel that can switch to a practically unheard-of 720Hz refresh rate when you kick the graphics down to 1080p* resolution.\nAsus may not technically have the fastest monitor ever made, as both Koorui and HKC have announced 750Hz 1080p monitors, but both of those have TN panels that won’t even begin to compete on color, brightness, and viewing angles. They’re from brands we don’t typically see in western countries, and neither lets you switch to higher resolution when you don’t need all the speed. \nMeanwhile, the Asus isn’t just OLED — it’s a tandem OLED panel that should dramatically boost HDR brightness and allegedly improve lifespan. It’s also got a glossy coating that could make its colors even more vibrant and its blacks even blacker than OLED tech can already afford, assuming you’re not playing in a room with glare (though Asus claims the coating minimizes glare “even in bright rooms.”)\nHere’s the part where I’d normally say “who needs 540Hz let alone 720Hz? Have you done the math and seen the diminishing returns?” Instead, I’m too busy gaping at Asus’ stunning new silver and translucent plastic design. Clear gadgets are near and dear to my heart, after all, and the skeletal silver really makes it stand out in a sea of black-framed panels. \nUnfortunately, we don’t have pricing or a release date yet, and I suspect it’ll cost a pretty penny because Asus chose that groundbreaking panel and did all that work to set it apart. Seeing more OLED monitor prices come down to earth would excite me even more than a new flagship like this.\nAlso, I would prefer a smaller stand to the huge three-blade propeller, but unfortunately, Asus does make you compromise to get that. The company’s also introducing a new ROG Strix OLED XG27AQWMG today with the same tandem OLED tech, but as you can see in the one-pager below, it’s a 280Hz panel that still relies on either HDMI 2.1 or DisplayPort 1.4’s DSC compression, rather than the flagship’s new DisplayPort 2.1a which boasts 80Gbps of bandwidth.\nBoth have Asus’ “Neo Proximity Sensor,” a relatively new feature it’s been adding to OLED panels, “to accurately measure the user’s distance to the monitor and automatically switch to a black screen when the user is away,” as an extra protection against burn-in. Asus also tends to offer a three-year warranty against OLED burn-in these days, and both LG Display and Samsung Display’s newer panels have many protections against it; as long as those protections aren’t over-aggressive, burn-in is no longer a reason I’d personally steer away.\nJust know that other monitor makers will probably use the same 4th-gen WOLED tandem panel from LG Display, too. SDC has already announced one, and other brands might follow suit.\n*If you’ve heard of 720Hz before, it’s probably because LG Display already announced the dual-mode 720Hz panel that appears in this monitor. And if you’re wondering why we say 1080p rather than 720p as others are reporting, it’s because we fact-checked with both Asus’ JJ Guerrero and LG Display that the panel is 1080p at 720Hz. We’ll let you know if we hear different.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "878a734cf4cb0657d6445f7e1e51f6e9741dfb86",
      "title": "Meta rolls out AI-powered translations to creators globally, starting with English and Spanish",
      "url": "https://techcrunch.com/2025/08/19/meta-rolls-out-ai-powered-translations-to-creators-globally-starting-with-english-and-spanish/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:20:01.000Z",
      "summary_90w": "",
      "raw": "The new feature, which is available in any market where Meta AI is available, allows creators to translate content into other languages for a broader audience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5f1364ea9d19fe09b75a667fe82c336ae7dd7ae1",
      "title": "Dangerous seas forecast for US East Coast as Hurricane Erin grows",
      "url": "https://www.bbc.com/news/articles/c3r41zeqnexo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T17:11:02.000Z",
      "summary_90w": "",
      "raw": "The Category 3 storm threatens to bring life-threatening surf and rip currents to the US East Coast.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ff8d9ce68f981376604f7220b39befe1272871e",
      "title": "Constance Marten seeks to appeal against baby death conviction",
      "url": "https://www.bbc.com/news/articles/clyjg1q5y4qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T17:10:21.000Z",
      "summary_90w": "",
      "raw": "The body of baby Victoria was found decomposing in an allotment shed in Brighton in 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "French government demands answers over streamer's death",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T17:08:44.000Z",
      "summary_90w": "",
      "raw": "Livestreaming platform Kick said it is \"urgently reviewing\" the circumstances of Jean Pormanove's death.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d366f5c713c5a2a3905c2ed815b3aeb3cef9a343",
      "title": "Your next customer is on the TechCrunch Disrupt 2025 expo floor — will they find you or your competitor?",
      "url": "https://techcrunch.com/2025/08/19/your-next-customer-is-on-the-techcrunch-disrupt-2025-expo-floor-will-they-find-you-or-your-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:07:51.000Z",
      "summary_90w": "",
      "raw": "There’s still time to book your exhibit table, but space is disappearing fast. The brands that move now will be the ones getting the face time, the leads, and the traction that matters most.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1237a488c7fed6bba5b67688d94e11d570a1e3fc",
      "title": "Why Oval Office map has played crucial role in Trump's view of Ukraine war",
      "url": "https://www.bbc.com/news/articles/cjeynw8jppdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T17:06:59.000Z",
      "summary_90w": "",
      "raw": "Ukraine's leader has taken issue with the American map, because of the amount of control it gives Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1eace25e4d7ea92a3b06732ddbba121a0b0a13c8",
      "title": "All the news from Gamescom Opening Night Live 2025",
      "url": "https://www.theverge.com/news/760975/gamescom-opening-night-live-2025-news-trailers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T17:00:00.000Z",
      "summary_90w": "",
      "raw": "With Gamescom’s Opening Night Live, the summer of games comes to a close. Join Mr. Video Games himself, Geoff Keighley, on August 19th at 2PM ET as he emcees the last big video game livestream event before the kids go back to school and the adults break out the Halloween decorations.\nWe already know that we can expect news of Call of Duty: Black Ops 7, Ghost of Yōtei, Outer Worlds 2, and more. Outside of video games, we might also get a new trailer for Fallout season two and maybe an update on the Ghost of Tsushima movie. And out of all the video game events of the last few years, this one might actually, truly, be the one where we get actual news of a release date for Hollow Knight: Silksong. There will be a playable demo on the Gamescom floor, which has to mean something, right?\nFollow along below for all of our coverage of the news and announcements from Opening Night Live 2025.\n\n\n\t\t\t\t\t\nIt’s going to be a busy fall for shooters.\n\t\t\t\n“Silksong is real.”\n\t\t\t\nRoutine is still alive.\n\t\t\t\nDotemu’s new fantasy beat ’em launches on October 9th.\n\t\t\t\nSkate on a train.\n\t\t\t\nDotemu is making a Battlestar Galactica game.\n\t\t\t\nGamescom’s Opening Night Live pre-show is about to start.\n\t\t\t\nGet ready for Silksong’s ‘special announcement’ on Thursday\n\t\t\t\nHow to watch Gamescom Opening Night Live 2025",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80b26499aaa0757e5885820efc46160bf001ce07",
      "title": "How the MAGA goon squad became tech lobbyists",
      "url": "https://www.theverge.com/regulator-newsletter/761358/how-the-maga-goon-squad-became-tech-lobbyists",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Hello there, world! Welcome to the second issue of Regulator, a newsletter about the collision between Big Tech and Washington. If you enjoy this, consider subscribing to get this newsletter weekly and everything The Verge has to offer.\nLobbying might be a dubious industry, but lobbyists themselves are often some of the best sources in Washington reporting: generally speaking, they're professionals with lots of prior experience who are paid quite a bit of money to know what's happening and who's making it happen behind the scenes. \nIn normal times, they'd be glad-handling and nudging officials to codify their companies' objectives in the l …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49b80d5b2d6c72e6580f10f047f2363b3c15bd11",
      "title": "Ticket reseller sued for illegally buying over 2,000 Taylor Swift tickets",
      "url": "https://www.theverge.com/news/761476/taylor-swift-eras-tour-ftc-ticket-reseller-bots-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T16:58:07.000Z",
      "summary_90w": "",
      "raw": "Photo by Erika Goldring/TAS24/Getty Images for TAS Rights Management\t\n\nThe Federal Trade Commission is suing a ticket broker for allegedly using “illegal means” to buy up hundreds of thousands of live event tickets, including for Taylor Swift’s Eras tour. Key Investment Group, which also does business as Epic Seats, TotalTickets.com, and Totally Tix, is accused of violating the Better Online Ticket Sales (BOTS) Act by using virtual and traditional credit card numbers, along with spoofed IP addresses, fake accounts it paid real people to make, and banks of SIM cards used to receive verification texts to numbers it controlled,  to get around security protections.\nKey Investment Group then allegedly resold these tickets on secondary ticket-selling sites and Ticketmaster’s resale platform to people who couldn’t beat its alleged army of accounts to buy them directly. The FTC’s lawsuit is part of a broader clampdown on live event ticket sellers in the US.\nIn the lawsuit filed on Monday, the FTC claims Key Investment Group bought $57 million worth of tickets from Ticketmaster in just over one year, while reselling them at a “significant markup” for $64 million. The reseller allegedly purchased 2,280 of Swift’s Eras Tour tickets from March to August 2023 for nearly $745,000 and resold them for around $1.9 million. During this time, the FTC claims Key Investment Group used 49 accounts to buy 273 tickets to Taylor Swift’s March 25th concert at Allegiant Stadium in Las Vegas in 2023, “dramatically exceeding” the six-ticket limit.\nKey Investment Group refutes the lawsuit in a statement released on Monday, saying the FTC has “twisted the intent” of the BOTS Act and is using it as a “weapon” targeting business and consumers. “Under the FTC’s interpretation, anyone who purchases more than four tickets or uses more than one account could be deemed in violation of federal law,” Key Investment Group claims. “The FTC misleadingly characterizes KIG’s [Key Investment Group] use of standard internet browsers to purchase tickets as equivalent to deploying unlawful software.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a727e622bc4150663d2b08b0b5ccf16520e7119f",
      "title": "Trump rules out sending US troops to Ukraine as part of security guarantees",
      "url": "https://www.theguardian.com/world/2025/aug/19/european-leaders-ukraine-russia-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:49:24.000Z",
      "summary_90w": "",
      "raw": "US president suggests he may be willing to provide air power to help to enforce potential peace deal with Putin\nDonald Trump has ruled out sending US troops to Ukraine to enforce a potential peace deal with Vladimir Putin, tempering a promise to provide Kyiv with security guarantees that European allies had called a significant breakthrough towards halting the Kremlin’s invasion of Ukraine.\nAsked during a phone interview with Fox News whether he could assure listeners – including many members of his Maga base who support an isolationist America-first foreign policy – that the US would not put troops on the ground in Ukraine, he said: “You have my assurance, and I’m president.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc595540d80662f85fbc4697aadf01a3a421a495",
      "title": "Diphtheria cases spiralling in Somalia, health officials warn",
      "url": "https://www.theguardian.com/world/2025/aug/19/diphtheria-cases-spiralling-somalia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:46:12.000Z",
      "summary_90w": "",
      "raw": "MSF says low vaccination coverage and poor living conditions driving spread of deadly bacterial disease\nDiphtheria cases are rapidly increasing across Somalia, officials and humanitarians warn, with children accounting for more than 97% of the cases.\nDiphtheria, a highly contagious and deadly bacterial disease that mainly affects children, is preventable by a vaccine. While Somalia has improved vaccination rates in recent years, the medical charity Médecins Sans Frontières (MSF) blames the uptick in cases on persisting immunisation gaps.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d83408850b2dda18022c7e1b3eb20a61821a1364",
      "title": "Israel demands release of all Gaza hostages, casting doubt on ceasefire proposal",
      "url": "https://www.bbc.com/news/articles/cjeynvp409vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T16:40:01.000Z",
      "summary_90w": "",
      "raw": "It comes a day after Hamas said it accepted a proposal for a 60-day truce, during which around half of the 50 hostages would be freed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a69509bcd96ce8786a899f4a9734c85aef21c2ae",
      "title": "Brazil issues last-ditch plea for countries to submit climate plans ahead of Cop30",
      "url": "https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:38:38.000Z",
      "summary_90w": "",
      "raw": "Only 28 countries have submitted carbon-cutting proposals to the UN, with some of the biggest emitters yet to produce plans\nBrazil has issued an urgent call for all countries to come forward with strengthened national plans on the climate, in a last-ditch attempt to meet a key September deadline.\nOnly 28 countries have so far submitted carbon-cutting proposals to the UN, with some of the biggest emitters of greenhouse gases – including China and the EU – still to produce their plans.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7fffa1cb573a25ded7e0f560e3a38718a6b19674",
      "title": "Palestine was the problem with TikTok",
      "url": "https://www.theverge.com/features/761076/gaza-images-starvation-tiktok-ban",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T16:30:00.000Z",
      "summary_90w": "",
      "raw": "In the last month, the war in Gaza has become an inescapable facet of the public consciousness as a new surge of images of Palestinian children - their faces impossibly sunken, their limbs reduced to skin and bone - flooded the internet. As the pictures became ubiquitous, the outcry became louder than ever. \nThese conditions of extreme deprivation are not new: in November 2024, the International Criminal Court issued an arrest warrant for Israeli Prime Minister Benjamin Netanyahu for using starvation as a method of war. Nevertheless, the situation now is piercing the mainstream in a way that official charges of war crimes could not. Maybe i …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f6c0ab74708e204b5b2f28c0a6e9464b38e4d137",
      "title": "Sony just launched five new PC gaming peripherals, so I tried them all at once",
      "url": "https://www.theverge.com/hands-on/757680/sony-inzone-pc-gaming-headset-keyboard-mouse-hands-on",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T16:17:18.000Z",
      "summary_90w": "",
      "raw": "Are you in the zone? | Image: Sony\t\n\nSony is finally ready to take on the likes of SteelSeries, Razer, and Logitech with its InZone brand of PC gaming accessories. While InZone started with monitors and headsets in 2022, with a few new products since then (including its great InZone Buds and the sleek but pricey M10S OLED), Sony is making a concerted effort to take over your desk. It just launched two new headsets, a gaming keyboard, a wireless mouse, and even a couple of mousepads, all developed alongside esports organization Fnatic, and all available for preorder today.\nAs you might expect, Sony's not aiming for the bargain bin here. Each of these peripherals is made for com …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "243141d6d98663d5165ac1cfa4497eb49cd1eda2",
      "title": "Zelenskyy gave Ukraine war veteran’s golf club as gift to Trump",
      "url": "https://www.theguardian.com/world/2025/aug/19/zelenskyy-ukraine-war-veteran-golf-club-gift-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:17:02.000Z",
      "summary_90w": "",
      "raw": "US president handed Ukrainian leader symbolic keys to the White House in return during meeting in Washington\nVolodymyr Zelenskyy gave Donald Trump a golf club during his visit to Washington this week that had belonged to a serviceman fighting Russia’s invasion, Kyiv said on Tuesday.\nTrump, an avid golfer who owns several courses, accepted the gift and presented Zelenskyy with symbolic keys to the White House in return, the Ukrainian leader’s office said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5801bc55f37d8366086073d912cae6e6bbb5a006",
      "title": "The ‘big church move’: Swedish town begins to roll historic building 5km",
      "url": "https://www.theguardian.com/world/2025/aug/19/the-big-church-move-sweden-kiruna-kyrka",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:12:57.000Z",
      "summary_90w": "",
      "raw": "Kiruna Kyrka’s slow journey is part of effort to stop town being swallowed by Europe’s biggest underground mine\nAfter eight years of planning, a cost of more than 500m kronor (£39m) and an early morning blessing, a church in northern Sweden began a slow-motion 5km journey on Tuesday to make way for the expansion of Europe’s biggest underground mine.\nThe 672-tonne Kiruna Kyrka, a Swedish Lutheran church inaugurated in 1912, is to be slowly rolled to its new home over two days, at a pace of half-a-kilometre an hour.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38e3f5c352bfe719420641dd1978d8d1c0937c75",
      "title": "India’s government to propose blanket ban on real-money gaming",
      "url": "https://techcrunch.com/2025/08/19/indias-government-to-propose-blanket-ban-on-real-money-gaming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T16:03:34.000Z",
      "summary_90w": "",
      "raw": "The Indian government plans to ban real-money games — whether skill- or chance-based — under its proposed online gaming regulation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b7c0f48f774d1f52b5541babbcb3ad75cea8f29b",
      "title": "Family call for action after boy, 13, drowned in river",
      "url": "https://www.bbc.com/news/articles/cwy38nkd4jdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T16:03:22.000Z",
      "summary_90w": "",
      "raw": "Kane Edwards, 13, died while swimming in the River Tawe near Swansea Enterprise Park in May 2022.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a60993e44bb84506f13a10b433643a37e3fb10e",
      "title": "TechCrunch Mobility: Ford’s big bet",
      "url": "https://techcrunch.com/2025/08/19/techcrunch-mobility-fords-big-bet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T16:02:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility, your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a14344caf7151994169632bcfb6d0f9797a9d04d",
      "title": "Finnish politician dies in parliament in Helsinki",
      "url": "https://www.bbc.com/news/articles/cqxgde2gv31o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T16:01:42.000Z",
      "summary_90w": "",
      "raw": "Eemeli Peltonen's sudden death shocks Finland, with politicians on all sides expressing their sadness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "603a558ef8b746ef52bb8aacb58070246ebdc2cb",
      "title": "The Chromatic Game Boy is getting Tetris&#8217; best multiplayer mode",
      "url": "https://www.theverge.com/news/760100/modretro-chromatic-game-boy-tetris-update-battle-mode",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T16:00:00.000Z",
      "summary_90w": "",
      "raw": "One of the best ways to play Tetris is coming to ModRetro’s modernized version. | Image: ModRetro\t\n\nModRetro is bringing a new multiplayer mode to the modernized version of Tetris that has been shipping with its recreated Game Boy, the Chromatic, since its 2024 release. The game already features multiple head-to-head modes when two Chromatic handhelds are connected using an optional Link Cable, but the new Battle Mode is the first time that players can interact with each other.\nWhen one player clears lines and reduces their Tetris stack, their opponent’s stack grows even taller with “garbage lines” added to the bottom featuring random spaces that make them harder to clear. It was a gameplay mode included with the version of Tetris that shipped with the original Nintendo Game Boy, and some gamers have wondered why it wasn’t in ModRetro’s version already.\nThe free update is available today to every Chromatic owner, who will be able to upgrade their Tetris cartridges using the handheld’s Cart Clinic feature while it’s connected to a PC or Mac. Because it’s the cartridge itself being updated, and not the Chromatic, the new Battle Mode will also be available when using the game in other devices, like an original Game Boy Color.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fa6e916335e846ed0923f64a1715c2db2a1853d8",
      "title": "Get ready for Silksong’s ‘special announcement’ on Thursday",
      "url": "https://www.theverge.com/news/761451/hollow-knight-silksong-special-announcement-youtube",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T15:43:12.000Z",
      "summary_90w": "",
      "raw": "Prepare your best clown makeup: Team Cherry, the developers of Hollow Knight: Silksong, will be making a “special announcement” about the game on Thursday at 10:30AM ET. The announcement will be shown on Team Cherry’s YouTube channel, and the premiere link is already live.\nIt’s been a very long wait for solid Silksong news, so much so that the waiting spawned a clown meme. A release window announcement and subsequent delay didn’t help things. But Nintendo shared proof-of-life for Silksong earlier this year when it snuck a vague “2025” release date into its big Switch 2 Direct presentation.\nAnd as of late, there have been a lot of hints that some big Silksong news is imminent: the game will be shown at both Nintendo and Xbox’s Gamescom booths this week, and on Monday, Gamescom Opening Night Live host Geoff Keighley tweeted a picture of himself wearing a clown nose. However, the game’s release date won’t be announced during Tuesday’s Opening Night Live show, according to Bloomberg’s Jason Schreier.\nI’m unrealistically hoping that Silksong releases on Thursday. I’m on vacation next week, which would give me a perfect excuse to dive into the game. But if the release date is a little bit after, no biggie — maybe I’ll get lost in the original Hollow Knight one more time.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02fa26f9a58a25be4bc8498eabf66f2da509fd09",
      "title": "Release of retail sales data delayed over quality concerns",
      "url": "https://www.bbc.com/news/articles/cz71gl2v1g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T15:42:35.000Z",
      "summary_90w": "",
      "raw": "The delay raises fresh questions over the reliability of ONS data, which influences policy decisions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56aef5e2652c30568616e3f045aff7d2423ef362",
      "title": "Aalo Atomics raises $100M to build a microreactor and data center together",
      "url": "https://techcrunch.com/2025/08/19/aalo-atomics-raises-100m-to-build-a-microreactor-and-data-center-together/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T15:41:41.000Z",
      "summary_90w": "",
      "raw": "Nuclear startup Aalo Atomics plans to turn on its first power plant, the 50-megawatt Aalo-X, in the summer of 2026. It's an aggressive timeline that bucks nuclear industry trends.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c83215dd1b60362dbf7df75be0608a4595067a50",
      "title": "Air Canada says flights will resume Tuesday night after flight attendants strike ends",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507052/air-canada-flights-resume-flight-attendants-union-strike",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T15:25:59.000Z",
      "summary_90w": "",
      "raw": "Air Canada said it will gradually restart operations after reaching a deal with the flight attendants' union to end a strike that disrupted the travel plans of hundreds of thousands of travelers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2aa4a5e3ad1f186545972c6bc877dff8f101462f",
      "title": "Peruvian woman arrested in Bali for smuggling drugs in sex toy",
      "url": "https://www.bbc.com/news/articles/cn92eywlwjlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T15:22:09.000Z",
      "summary_90w": "",
      "raw": "The 42-year-old allegedly also concealed drugs in her underwear, police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b13624c583ed52759ace39b2f78a3aeed684ef08",
      "title": "Putin must tread carefully amid hyped up expectations of breakthrough",
      "url": "https://www.theguardian.com/world/2025/aug/19/white-house-meeting-european-leaders-russia-putin-trump-analysis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:19:01.000Z",
      "summary_90w": "",
      "raw": "Goal of European leaders at White House meeting was to try to push the Russian leader into a corner\n\nUkraine war – latest updates\n\nThe mood in the White House on Monday was strikingly upbeat.\nNato’s ever-cheerful secretary general, Mark Rutte, set the tone as he addressed Donald Trump, Volodymyr Zelenskyy and the gathered European leaders. “Let’s make the best out of today,” he said with a smile, before repeatedly thanking the US president for his attention to the war in Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "267dc77071083d12db91173e312a9f0de4142fe4",
      "title": "Conservative leader wins Canada byelection, regaining parliament seat",
      "url": "https://www.theguardian.com/world/2025/aug/19/pierre-poilievre-wins-canada-parliament",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:11:51.000Z",
      "summary_90w": "",
      "raw": "Pierre Poilievre returns to House of Commons after shock April loss and narrower margin in Tory stronghold\nCanada’s Conservative leader, Pierre Poilievre, has won a closely watched byelection in the province of Alberta, giving him a chance to return to parliament after suffering a shock defeat in April’s federal election.\nPoilievre finished with 80.4% of the vote after Monday’s election in the riding of Battle River-Crowfoot, in the deeply Conservative western province.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "51c4e1618b40aa5c726c9dc9c6fa775c157f5765",
      "title": "Spain battles record wildfires even as the end of a heat wave brings lower temperatures",
      "url": "https://www.npr.org/2025/08/19/g-s1-83505/spain-wildfires-record-heat-wave-galicia",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T15:02:45.000Z",
      "summary_90w": "",
      "raw": "The fires have ravaged small, sparsely populated towns in the country's northwest, forcing locals in many cases to act as firefighters. About 2,382 square miles have burned across Spain and Portugal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2872f15b58cfcc40392a56983394c1f38d70c8a",
      "title": "Watch: London Zoo's capybaras and tortoises on weigh-in day",
      "url": "https://www.bbc.com/news/videos/c6267d6ng02o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T15:01:59.000Z",
      "summary_90w": "",
      "raw": "London Zoo in Regent's Park holds its annual animal weigh-in, with zookeepers weighing and measuring over 10,000 animals to monitor their health and wellbeing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf84683750eaa74bc5c0b4d608477578c4856f0f",
      "title": "Four-day work week? Six weeks of holidays? Australians have a choice about how to bank productivity gains",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/four-day-work-week-six-weeks-holidays-vacation-australia-boost-improve-productivity",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:00:17.000Z",
      "summary_90w": "",
      "raw": "Business groups call it a ‘populist, anti-productivity thought bubble’, but a four-day week holds obvious appeal\n\nGet our breaking news email, free app or daily news podcast\n\nOne of the ideas that has captured many peoples’ attention amid the flurry of proposals ahead of the economic roundtable is the Australian Council of Trade Unions’ vision of a four-day working week.\nThe peak union body argued that working less could actually be productivity enhancing, although the studies behind those claims aren’t too rigorous.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e4cf71512908e6285853abaf891ba5c8f8b3755",
      "title": "Legal stoush between NSW and commonwealth halts crucial water flows into Murray-Darling",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/legal-stoush-between-nsw-and-commonwealth-halts-crucial-water-flows-into-murray-darling",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:00:16.000Z",
      "summary_90w": "",
      "raw": "One scientist warned long suspension poses potential risks to some wetland areas and native species of fish and birds\nEnvironmental flows in the Murray-Darling necessary to keep wetlands and fish healthy have come to an abrupt halt due to a legal stoush between the commonwealth and the New South Wales government.\nThe commonwealth environmental water holder, Simon Banks, announced on Monday that he would no longer be releasing water into the river system because “as a model licence holder” he was no longer confident he is complying with NSW law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c81796ba2c055c96e7e62b2fb135e71fbe31140",
      "title": "More than two-thirds of NSW public land suitable for housing sold to private developers",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/more-than-two-thirds-of-nsw-public-land-suitable-for-housing-sold-to-private-developers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:00:15.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Despite Labor policy to prioritise government land for public housing, Homes NSW has bought just three of 55 sites and expressed interest in further seven\n\nGet our breaking news email, free app or daily news podcast\n\nThe New South Wales government has sold more than two-thirds of publicly owned sites identified as surplus and suitable for housing to private developers as a result of its much-vaunted statewide property audit.\nMany sites are being sold without requirements for social or affordable housing.\nThe dive site for WestConnex at Camperdown will not have any social or affordable housing, although the project will earmark 230 units for essential worker homes out of a likely 600 units, because of its proximity to the Royal Prince Alfred hospital.\nA site at 164 Talavera Road, Marsfield, also owned by Roads and Maritime, was sold for $4.4m to a developer for high-density development. The agent on the sale, Ray White’s Peter Vines, said there was no requirement for social or affordable housing. The buyer intends to build student accommodation, he said.\nA major site at 870 Windsor Road, Rouse Hill, not far from the new metro station, is at the tender stage. The CBRE agent Ben Wicks said there were no firm requirements from the government about levels of social and affordable housing. Bidders had been invited to put in multiple proposals that included social and affordable housing as well as build-to-rent projects, he said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20cc52b47f1b8caa179cc7fbd9476a51f506abbb",
      "title": "Perth’s water supply at ‘high risk’ from Alcoa bauxite mining, expert study finds",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/perth-water-supply-risk-alcoa-bauxite-mining",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:00:15.000Z",
      "summary_90w": "",
      "raw": "Exclusive: GHD identified 22 pathways for Alcoa’s mining to contaminate dams inland of Perth\n\nGet our breaking news email, free app or daily news podcast\n\nAlcoa’s plan to vastly expand its strip mining of forest near Perth’s dams poses a high risk to the water supply for the city’s 2.3 million people, according to global engineering consultancy GHD.\nThe US aluminium producer commissioned the detailed analysis as part of its bid for approval to mine an additional 67 square kilometres of jarrah forest for bauxite – the source material for aluminium.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d2154624fe3f1c4fb172c13622a6d77c3857e86",
      "title": "Why Ukraine's first lady wrote Melania Trump a letter",
      "url": "https://www.bbc.com/news/articles/czd08nj08r3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T14:52:20.000Z",
      "summary_90w": "",
      "raw": "Ukraine's First Lady Olena Zelenska has thanked US First Lady Melania Trump for imploring Vladimir Putin to protect children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c04a9c70cf9322394e76a954210c2202a2866b92",
      "title": "Starmer hails breakthrough on Ukraine - but anxiety over its future remains",
      "url": "https://www.bbc.com/news/articles/cr5rl6y04z0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T14:46:44.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's commitment to Ukraine's security is key to a lasting peace, the UK prime minister says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0bac6130c5715b201281d8286649c5c959a85978",
      "title": "Millions warned of bank holiday travel disruption due to rail works and strikes",
      "url": "https://www.bbc.com/news/articles/c5y26gg371jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T14:44:25.000Z",
      "summary_90w": "",
      "raw": "Millions are told to prepare for disruption from traffic, rail engineering works and strikes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3664c144879e93267eb38274477272da8e929240",
      "title": "US spy chief says UK has dropped its Apple backdoor demand",
      "url": "https://techcrunch.com/2025/08/19/us-spy-chief-says-uk-has-dropped-its-apple-backdoor-demand/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T14:25:33.000Z",
      "summary_90w": "",
      "raw": "Tulsi Gabbard said that President Donald Trump and Vice President JD Vance also participated in the negotiations with the U.K. government over its once-secret demand to Apple.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f334c24ff184c7d64f76db3e500a3e3fa44e2b6b",
      "title": "Son of Norway's crown princess charged with rape and abuse",
      "url": "https://www.bbc.com/news/articles/cvg3ke05355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T14:18:52.000Z",
      "summary_90w": "",
      "raw": "Marius Borg Høiby is charged with 32 offences and could face up to 10 years in prison if found guilty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97f7fdde2d1b3b6f064f429e0e6ee1f92721a11b",
      "title": "Mediators optimistic Israel will accept ceasefire deal that is ‘almost identical’ to one they earlier agreed – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/aid-ship-food-gaza-cyprus-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T14:09:04.000Z",
      "summary_90w": "",
      "raw": "Qatar says no breakthrough has yet been made but Hamas has given ‘positive response’\nThe UN’s human rights office on Tuesday condemned a far-right Israeli minister for taunting a Palestinian prisoner in his cell and sharing the footage online, Reuters reports.\nNational security minister Itamar Ben-Gvir published a video on Friday last week showing him confronting Marwan Barghouti, the most high-profile Palestinian detainee in Israeli custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63e38b2b291f45efcd26bf53f0d79cbcd8a39d1b",
      "title": "CPG startup Keychain snags $30M to build in India, grow in the US",
      "url": "https://techcrunch.com/2025/08/19/cpg-startup-keychain-snags-30m-to-build-in-india-grow-in-the-u-s/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Keychain doesn't have a single customer in India — but the team helping it scale across North America and beyond is entirely based in Gurugram, a suburb of New Delhi.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76f7c791877dd96391ea7d2443d0f28f19c3cdc0",
      "title": "Air Canada flight attendants reach ‘tentative’ deal with airline to end strike",
      "url": "https://www.theguardian.com/world/2025/aug/19/air-canada-strike-tentative-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T13:31:37.000Z",
      "summary_90w": "",
      "raw": "Strike over wages and ground work has cancelled travel for 500,000 people worldwide\nAir Canada flight attendants say they have reached a “tentative” deal with the airline to end a strike over wages and ground work that has cancelled travel for half a million people worldwide.\nRoughly 10,000 flight attendants walked off the job after midnight Saturday, insisting Air Canada had failed to address their demands for higher pay and compensation for unpaid ground work, including during boarding.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfeb7da305893b01fa68da17c982770381812c1d",
      "title": "TikTok’s latest feature lets college students find and connect with classmates",
      "url": "https://techcrunch.com/2025/08/19/tiktoks-latest-feature-lets-college-students-find-and-connect-with-classmates/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T13:00:00.000Z",
      "summary_90w": "",
      "raw": "In a move reminiscent of Facebook's early days, TikTok is launching a new feature that allows college students to find and connect with others on their campus.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98d0a5e7929dee93e280ba9e8b0cad07817f2ad1",
      "title": "Nvidia said to be developing new, more powerful AI chip for sale in China",
      "url": "https://techcrunch.com/2025/08/19/nvidia-said-to-be-developing-new-more-powerful-ai-chip-for-sale-in-china/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T12:58:28.000Z",
      "summary_90w": "",
      "raw": "Nvidia is apparently putting together a new AI chip meant for sale in China that's half as powerful as its flagship B300 Blackwell GPU. The new chip would be more powerful than the H20 GPUs the company is currently allowed to sell in the country.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a43d3245a58c4a9f971d980091296e45bb0f598a",
      "title": "Israel to respond by Friday over Gaza truce plan accepted by Hamas",
      "url": "https://www.theguardian.com/world/2025/aug/19/israel-to-respond-by-friday-gaza-truce-plan-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T12:31:11.000Z",
      "summary_90w": "",
      "raw": "Israel under pressure to accept ceasefire proposal that is said to be almost identical to earlier US-backed plan\n\nMiddle East crisis – live updates\n\nIsrael has said it will deliver its response to international mediators by Friday over a new Gaza ceasefire plan accepted by Hamas amid mounting pressure for a truce in a war that has claimed more than 62,000 Palestinian lives.\nAfter mass protests in Israel demanding a deal to secure the release of the remaining 20 living Israeli hostages held in Gaza, it appeared that Hamas had reduced its demands over a prisoners-for-hostages exchange as well as over the scope of an Israeli-demanded “security buffer zone”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f3d3d3fbd1dcc544389f658763ba72cd5fab113",
      "title": "Women's Rugby World Cup final at Twickenham sells out with record crowd expected",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cwy597y87dxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T12:01:43.000Z",
      "summary_90w": "",
      "raw": "The Women's Rugby World Cup final at Twickenham has sold out making it likely to be the biggest ever crowd for a one-off women's rugby match.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ad9cce37649f67ceac439d2022ef548558d49b",
      "title": "Second man pleads guilty to stealing car that crashed into care home",
      "url": "https://www.bbc.com/news/articles/cx2x40gxjydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T11:43:13.000Z",
      "summary_90w": "",
      "raw": "The pair, who crashed a BMW into a Sunderland care home, are due to be sentenced next month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17b3227f6c508b8f7da3f56d97ed91c2481fee2a",
      "title": "Netanyahu lashes out at Albanese as ‘weak politician who betrayed Israel’ as diplomatic row escalates",
      "url": "https://www.theguardian.com/australia-news/2025/aug/19/netanyahu-criticises-albanese-social-media-jewish-groups-respond-to-australia-israel-dispute-over-visa-cancellations-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T11:40:17.000Z",
      "summary_90w": "",
      "raw": "Israel’s prime minister accuses Australian leader of ‘abandoning’ Jews as tension escalates over visa cancellation and Palestinian recognition\n\nGet our breaking news email, free app or daily news podcast\n\nBenjamin Netanyahu has launched an extraordinary broadside against Anthony Albanese, labelling Australia’s prime minister “weak” in a social media post, hours after local Jewish groups called for calm in diplomatic relations.\n“History will remember Albanese for what he is: A weak politician who betrayed Israel and abandoned Australia’s Jews,” read a post on X from the account of Israel’s prime minister, on Tuesday evening Australian time.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4b4289d6185268e2a44eec9b53b76a519daa4e4",
      "title": "Texas police hunt convict 'mistakenly' freed from jail",
      "url": "https://www.bbc.com/news/articles/cd0d32ezn17o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T11:39:01.000Z",
      "summary_90w": "",
      "raw": "Police say the man was sentenced to jail for assaulting a family member and evading arrest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cab4fe84a361c9bfe01b4231a2e98da21916d33d",
      "title": "Figure’s IPO filing marks Mike Cagney’s return to public markets",
      "url": "https://techcrunch.com/2025/08/19/figures-ipo-filing-marks-mike-cagneys-return-to-public-markets/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T11:23:41.000Z",
      "summary_90w": "",
      "raw": "Figure Technology, a 7-year-old blockchain-based lending company, has filed a registration statement with the SEC for an IPO of its Class A common stock. The filing offers a chance at vindication for Figure co-founder Mike Cagney.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c84ce3814e2075c88f8827781682a3b54c009d37",
      "title": "Putin and Zelenskyy could meet. And, Trump wants to stop voting by mail",
      "url": "https://www.npr.org/2025/08/19/g-s1-83374/up-first-briefing-putin-zelenskyy-may-meet-mail-in-votings-future",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T11:17:38.000Z",
      "summary_90w": "",
      "raw": "Trump says there are plans underway for Putin and Zelenskyy to meet to discuss an end to the war between Russia and Ukraine. And, Trump wants to stop states from voting by mail.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2828d7599b994dd9e868ce36f504a34445af270c",
      "title": "Here, together: Images of community from NPR station photographers",
      "url": "https://www.npr.org/sections/the-picture-show/2025/08/19/g-s1-82504/npr-station-photographer-images-world-photography-day",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T11:14:59.000Z",
      "summary_90w": "",
      "raw": "NPR marks World Photography Day with images of everyday moments of gathering from communities across the U.S. taken by photographers from the network's member stations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f39360be6cbd9d5dede725c2eef53f1637bc09e5",
      "title": "AI crawler Firecrawl raises $14.5M, is still looking to hire agents as employees",
      "url": "https://techcrunch.com/2025/08/19/ai-crawler-firecrawl-raises-14-5m-is-still-looking-to-hire-agents-as-employees/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Firecrawl nabbed Shopify’s CEO Tobias Lütke as an investor from a gutsy email after they discovered he was using the product.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "694c7cdc9da4d1f3f1a7ee2c18c01cc826fc7797",
      "title": "People buying less fast food as grocery prices remain high",
      "url": "https://www.bbc.com/news/articles/c5y042g11yvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T10:28:23.000Z",
      "summary_90w": "",
      "raw": "But shoppers were still buying branded groceries instead of opting for cheaper, own-brand alternatives.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75ec4997089f067bd2ee0c5b39e2044aca0a6fda",
      "title": "Eight Sleep raises $100M to expand its AI-powered sleep tech",
      "url": "https://techcrunch.com/2025/08/19/eight-sleep-grabs-100m-to-bring-ai-into-your-bed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "The sleep tech company raised  from HSG, Valor Equity Partners, Founders Fund, Y Combinator, and big F1 names like Charles Leclerc and Zak Brown.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c9a35fa0fca7617c0aaa78f64582f17977beb1f6",
      "title": "Spotify’s latest feature lets you add your own transitions to playlists",
      "url": "https://techcrunch.com/2025/08/19/spotifys-latest-feature-lets-you-add-your-own-transitions-to-playlists/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "The new options are designed to appeal to playlist experts and other music fans, who have collectively created nearly 9 billion playlists on Spotify's platform to date.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a1d6ea2b6fa95a21a386f3f951af2da024697dc",
      "title": "Little Mix star Perrie Edwards discusses trauma of losing baby at 24 weeks",
      "url": "https://www.bbc.com/news/articles/c4gmjedy35do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:57:14.000Z",
      "summary_90w": "",
      "raw": "Perrie Edwards says she suffered two miscarriages, with one at six months leaving her \"distraught\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d1a38055597df4ca5064b325168c5729923d9d3",
      "title": "Entire church begins two-day journey across Swedish city",
      "url": "https://www.bbc.com/news/articles/cde3xp4xlw9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T09:55:25.000Z",
      "summary_90w": "",
      "raw": "The landmark 113-year-old wooden building is at risk from subsidence and will be moved 5km on giant rolling platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d1a38055597df4ca5064b325168c5729923d9d3",
      "title": "The epic two-day operation to move an entire church across a Swedish city",
      "url": "https://www.bbc.com/news/articles/cde3xp4xlw9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:55:25.000Z",
      "summary_90w": "",
      "raw": "The landmark 113-year-old wooden building is at risk from subsidence and will be moved 5km on giant rolling platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d448965b2e787e058a8803fc50c1ef7e515792d",
      "title": "Tom Grennan says therapy helps with his body dysmorphia",
      "url": "https://www.bbc.com/news/articles/cj9w81meejxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:40:14.000Z",
      "summary_90w": "",
      "raw": "The singer opens up about how eating binges and gym training habits can affect his mental health.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d95b26375170b67026e0a2943112402cf398546",
      "title": "Two Oval Office encounters: How the tone changed from friction to smiles",
      "url": "https://www.bbc.com/news/videos/c74173p9nexo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:39:52.000Z",
      "summary_90w": "",
      "raw": "Onlookers gasped as Trump and Zelensky's meeting in Washington in February descended into chaos, but times have changed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c4dd89487e14038f0d6692c2b2472b307a2a0d1",
      "title": "Businesses face 'chaos' as EPA aims to repeal its authority over climate pollution",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5501576/climate-pollution-epa-regulation-endangerment-finding",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T09:39:04.000Z",
      "summary_90w": "",
      "raw": "A lot of companies want the EPA in charge of setting national climate regulations because it helps shield them from lawsuits and creates a predictable environment in which to make investments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd5c6cdadc640147453e7cef314d439c6d29c35a",
      "title": "Gun violence hits Black communities hardest. Trump is rolling back prevention efforts",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5501679/gun-violence-prevention-trump-black-communities",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T09:36:51.000Z",
      "summary_90w": "",
      "raw": "The suffering of America's gun violence crisis is concentrated in Black neighborhoods damaged by decades of disinvestment and racial discrimination. Trump is unravelling efforts to solve the problem.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cec432c01aaabe32942669f4ee9d1941606d9329",
      "title": "Toxicity is a good defense, until it isn't",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5500216/cardiotonic-steroid-toxic-poison-heart-attack",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T09:29:39.000Z",
      "summary_90w": "",
      "raw": "Imagine, you’re a toxic toad hanging around South America. No other animals are gonna mess with you, right? After all, you’re ~toxic~! So if anyone tries to eat you, they’ll be exposed to something called a cardiotonic steroid — and may die of a heart attack. Well, unfortunately, for you, some animals have developed adaptations to these toxic steroids. Evolutionary biologist Shabnam Mohammadi has spent her career studying how these adaptations work — and says even humans have used these toxins to their advantage since ancient Egypt. So today on Short Wave, we get a little… toxic (cue Brittney Spears). Host Regina G. Barber talks to Shabnam about how some predators can get away with eating toxic prey. \n\nCurious about biology? Email us at shortwave@npr.org.\n\nListen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9bfedf8359ac0d684ebf8bc1b53e0ee57822af4e",
      "title": "D.C.'s crime numbers are all the buzz. But how do we interpret them accurately?",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506208/dc-crime-trump-explained",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T09:29:34.000Z",
      "summary_90w": "",
      "raw": "A range of crime data has been going around to make the argument that Washington, D.C., is — or isn't — safe. We talk to crime experts to make sense of it all.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "45e3aad719354a1b72559e71e6236837923e252b",
      "title": "Harmful bacteria 'highest in summer' in Windermere",
      "url": "https://www.bbc.com/news/articles/cjr1q89qw8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:16:06.000Z",
      "summary_90w": "",
      "raw": "New data finds England's largest lake has \"poor\" water quality during its busiest months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4b304ec97ddee0271aafb9c95ae51ef6f9f7a35",
      "title": "Morecambe appoint first Sikh manager at professional football club",
      "url": "https://www.bbc.com/sport/football/articles/cwygp4y1e81o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T09:12:24.000Z",
      "summary_90w": "",
      "raw": "Former Wigan and Como Primavera assistant manager Ashvir Singh Johal is appointed Morecambe boss.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T09:05:13.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bc1af1f6442a5f2e3aeb052a80ae8ba3cb66383c",
      "title": "Canada's Conservative leader wins back parliament seat",
      "url": "https://www.bbc.com/news/articles/c0l6jz8xlplo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T09:02:40.000Z",
      "summary_90w": "",
      "raw": "Poilievre won an Alberta by-election with 80% of the vote after losing his seat in another riding in April's general election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b4148eacffb5ac59b2231d4d7a4a2e3736b45f7",
      "title": "A 'glorified exhibition'? - US Open's revamped mixed doubles divides opinion",
      "url": "https://www.bbc.com/sport/tennis/articles/c6270n44vk3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T08:57:53.000Z",
      "summary_90w": "",
      "raw": "With the revamped US Open mixed doubles starting on Tuesday, BBC Sport looks at the positives and negatives of the controversial change.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a9ced75ba463f4a8db6b47cc8c74e9bd88bd0b8",
      "title": "Scotland's prisons are filled with gangsters. Staff are battling to keep rivals apart",
      "url": "https://www.bbc.com/news/articles/c87er2e89dpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T08:07:20.000Z",
      "summary_90w": "",
      "raw": "Hundreds of gang members are being held in Scotland's jails, where violent incidents are on the increase.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ed11b139ede01cab3303c5306c30f82d04efbf3",
      "title": "China and India should be partners, not adversaries, says foreign minister Wang Yi",
      "url": "https://www.bbc.com/news/articles/c3v3ee0076no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T07:24:53.000Z",
      "summary_90w": "",
      "raw": "Yi's India visit comes days before PM Modi's trip to China, and signals a further thaw in relations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "605366d5f4a45811bb4207b90aa75c9622a1e7e0",
      "title": "How algorithms are changing the way we speak",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506168/how-algorithms-are-changing-the-way-we-speak",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Social media has birthed an entire lexicon replicated by millions online — even if these words don’t actually mean skibidi. On today’s show, we talk to author Adam Aleksic about how TikTok and Instagram's engagement metrics, and viral memes, are rewiring our brains and transforming language at warp speed.\nAdam Aleksic’s book is Algospeak: How Social Media is Transforming the Future of Language \nRelated episodes: \nWhat we’re reading on the beach this summer   \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.  \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ac25e85c67c9cf6b528e216edfecaaf56a96da99",
      "title": "Panjab Warriors 'feel blessed' after ending Morecambe takeover 'nightmare'",
      "url": "https://www.bbc.com/sport/football/articles/c8e15028k97o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T06:04:17.000Z",
      "summary_90w": "",
      "raw": "The BBC speaks with Morecambe's new owners, plus staff and fans, about the club's takeover chaos, sale, and future",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c4b3389c8503d4f1203d0787e649cc18ed3fd35",
      "title": "What results day is like when you're neurodivergent - and how parents can help",
      "url": "https://www.bbc.com/news/articles/c99mn51ny02o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T05:56:39.000Z",
      "summary_90w": "",
      "raw": "Three young people tell the BBC what support they would have liked during their recent results days.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d640e1f9f9f58b02ea920a08075c342215f40662",
      "title": "Watch: Zelensky's 'fabulous' suit and other moments from Trump meeting",
      "url": "https://www.bbc.com/news/videos/crlzey2j406o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T05:37:10.000Z",
      "summary_90w": "",
      "raw": "Ukraine's president and other European leaders met at the White House to talk peace.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f78fe991277ea32b2b910d5f0b56b7671f26ca76",
      "title": "I was sexually assaulted on a plane - now I'm fighting for compensation",
      "url": "https://www.bbc.com/news/articles/cly6g2j67rko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T05:10:28.000Z",
      "summary_90w": "",
      "raw": "The 24-year-old shares the impact of her ordeal on a flight from Qatar and being refused compensation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80f525ac3b1ec3a6fa314d13a2544a141c33db28",
      "title": "My eating disorder misdiagnosis left me with PTSD",
      "url": "https://www.bbc.com/news/articles/c8d114rz07qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T05:05:11.000Z",
      "summary_90w": "",
      "raw": "Charlotte Chapman-Hart tells of her experience of a lack of coordinated and informed care.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37ff07fb94be54078a814149115b2b01c491f174",
      "title": "OpenAI launches a sub-$5 ChatGPT plan in India",
      "url": "https://techcrunch.com/2025/08/18/openai-launches-a-sub-5-chatgpt-plan-in-india/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T03:57:15.000Z",
      "summary_90w": "",
      "raw": "This plan will offer 10x more messages and image generation than the free tier, among other benefits.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68659a11a0afbcb6649df87b23a50f32fbe42439",
      "title": "Japan chain stops rice ball sales after staff fake expiry dates",
      "url": "https://www.bbc.com/news/articles/c7vlj3njzlpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T03:55:47.000Z",
      "summary_90w": "",
      "raw": "Ministop has apologised for 'significant inconvenience' as it suspended deli sales in 1,600 outlets.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a71b9e903a167de0d6326f64ae6d3c96739e22a",
      "title": "Zelensky leaves White House unscathed as he buys more time",
      "url": "https://www.bbc.com/news/articles/c80djre5m5vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T03:09:59.000Z",
      "summary_90w": "",
      "raw": "Unlike February's row, Trump and Zelensky struck a more diplomatic tone despite their remaining differences.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b73820569f15be3b03831e14bc5c89997e3d438d",
      "title": "Four key takeaways from Ukraine talks in Washington",
      "url": "https://www.bbc.com/news/articles/c5yp4jggrj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T01:01:32.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky managed to avoid another disastrous Oval Office meeting with Donald Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e70e010ff1334f84b188010e850e6c3ecac625c",
      "title": "SoftBank makes $2B investment in Intel",
      "url": "https://techcrunch.com/2025/08/18/softbank-makes-2b-investment-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T00:23:55.000Z",
      "summary_90w": "",
      "raw": "SoftBank will pay $23 per share for Intel common stock.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b0323e285f2514b9889070e1eea4f3b299dda1df",
      "title": "Soldier found guilty of attempted espionage in New Zealand’s first spying conviction",
      "url": "https://www.theguardian.com/world/2025/aug/19/new-zealand-military-court-finds-soldier-guilty-of-attempted-espionage",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T00:06:24.000Z",
      "summary_90w": "",
      "raw": "Court martial heard soldier was caught offering to share military base maps and photographs to an undercover officer of an unnamed foreign nation\nA military court has convicted a New Zealand soldier of attempted espionage for a foreign power – the first spying conviction in the country’s history.\nThe soldier was caught offering to pass military base maps and photographs to an undercover officer posing as an agent for the foreign nation, the court martial heard.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a787455b581ae402daa6cad7eb1a0972450c28a7",
      "title": "Why scientists hope seabed mud could reveal Antarctic Ocean secrets",
      "url": "https://www.bbc.com/news/articles/cm2vz9jg8jzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-18T23:21:37.000Z",
      "summary_90w": "",
      "raw": "How long tubes of mud - drilled out of the Antarctic seafloor - could reveal how the frozen continent is changing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80ca96c00cbe5b2f4a68ec228d17e81ab4c5ef34",
      "title": "Allianz Life data breach affects 1.1 million customers",
      "url": "https://techcrunch.com/2025/08/18/allianz-life-data-breach-affects-1-1-million-customers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-18T22:26:54.000Z",
      "summary_90w": "",
      "raw": "Data breach notification site Have I Been Pwned notified 1.1 million customers of a July data breach, a number not previously reported.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ff38cd0bea88df8d5c6b29a0a1612692a7f7b505",
      "title": "'No-one comes for us': The women trapped in Afghanistan's mental health system",
      "url": "https://www.bbc.com/news/articles/c80dg700dego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-18T22:19:29.000Z",
      "summary_90w": "",
      "raw": "Accessing treatment in an Afghan mental health facility is difficult - but getting out can be harder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbdbe9a10fdb2d411a504212146ca7fc94e80027",
      "title": "X’s declining Android app installs are hurting subscription revenue",
      "url": "https://techcrunch.com/2025/08/18/xs-declining-android-app-installs-are-hurting-subscription-revenue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-18T20:49:36.000Z",
      "summary_90w": "",
      "raw": "X is struggling on Android with installs down by 49% year-over-year as of June 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d97caa4623f1eeef8d23be5edec308c858628351",
      "title": "'SNL' castmember Bowen Yang shares a piece of 'cultural contraband' from his youth",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5503406/bowen-yang-snl-wicked-las-culturistas",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T18:45:34.000Z",
      "summary_90w": "",
      "raw": "Growing up with immigrant parents, first in Canada and then in the U.S., Yang was \"obsessed\" with pop culture and Saturday Night Live. Now he's up for an Emmy for his performances on the venerated sketch series.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "289c5c0b6138ee73215d9a492709501622be6eaa",
      "title": "Texas attorney general accuses Meta, Character.AI of misleading kids with mental health claims",
      "url": "https://techcrunch.com/2025/08/18/texas-attorney-general-accuses-meta-character-ai-of-misleading-kids-with-mental-health-claims/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-18T17:59:29.000Z",
      "summary_90w": "",
      "raw": "Texas attorney general Ken Paxton is investigating Meta and CharacterAI over claims they deceptively market chatbots as mental health tools, raising concerns about child safety, data privacy, and targeted advertising.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e2f2cf4dc59303eb3e623bda9307732ab1cdc03",
      "title": "Flight attendant union leaders ‘ready to go to jail’ as Air Canada strike outlawed",
      "url": "https://www.theguardian.com/world/2025/aug/18/air-canada-flight-attendants-strike-illegal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:58:06.000Z",
      "summary_90w": "",
      "raw": "Arbitrator orders 10,000 striking staff back to work after government intervenes – unconstitutionally, union says\nUnion leaders representing 10,000 striking flight attendants have said they would be willing to go to jail rather than comply with an order to return to work, as Canada’s federal government seeks to end a bitter contract dispute that has halted hundreds of summer flights and stranded travellers around the world.\nSpeaking to reporters on Monday, the national president of the Canadian Union of Public Employees said members would remain on the picket lines as part of a work stoppage that has halted Air Canada’s national and international operations during its busiest season.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08ccd99774c3563781864bf5565d2da7215b123b",
      "title": "Zambian president’s feud with late rival continues over funeral plans",
      "url": "https://www.theguardian.com/world/2025/aug/18/zambian-presidents-feud-with-late-rival-continues-over-site-of-funeral",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:50:07.000Z",
      "summary_90w": "",
      "raw": "Family of Edgar Lungu trying to prevent repatriation of his body for state funeral presided over by his successor\nA furious row is raging over whether the Zambian president, Hakainde Hichilema, will preside over the funeral of his predecessor, Edgar Lungu, as the former president’s family wage a legal battle in South Africa to try to prevent his body from being repatriated.\nThe legal fight marks the latest twist in a feud between the two men that goes back at least a decade and has now outlasted the former president, who died in South Africa in June aged 68 while being treated for an undisclosed illness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "facc3062cf8edcf54b3e448d7a5c14915d4d29bc",
      "title": "Hamas tells mediators it approves latest Gaza ceasefire proposal – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/18/israel-protests-government-new-offensive-gaza-city-middle-east-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Hamas official tells Reuters news agency it has approved latest Gaza ceasefire proposal. This live blog is closed\n\nHamas says it accepts proposal for Gaza ceasefire and release of hostages\n\nNorway’s sovereign wealth fund, the world’s largest, said on Monday it had decided to exclude six companies with connections to the West Bank and Gaza from its portfolio, following a review of its Israeli investments.\nThe $2tn wealth fund did not name the companies it had decided to exclude, but said these would be made public once the divestment was completed, Reuters reports.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aeb8cda62bcc24e928b31557fd8617374a0c53b0",
      "title": "Hamas says it accepts proposal for Gaza ceasefire and release of hostages",
      "url": "https://www.theguardian.com/world/2025/aug/18/hamas-gaza-proposed-ceasefire-hostage-release-deal-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:44:24.000Z",
      "summary_90w": "",
      "raw": "Deal would include 60-day halt to violence and exchange of half of living Israeli hostages for Palestinian prisoners\nHamas officials say they have accepted a proposal for a Gaza ceasefire deal that would include the release of half of the approximately 20 remaining living Israeli hostages as part of a phased resolution to the war, as Gaza health officials said 62,000 Palestinians had died in the 22 months of war.\nThe proposed deal follows negotiations between Hamas and Egyptian and Qatari officials that have been taking place in Cairo in recent days, and comes after the Israeli prime minister, Benjamin Netanyahu, was confronted on Sunday by Israel’s biggest protests of the war, which called for a deal to secure the release of the hostages.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6acf10e9beea2f0e1a06397596a265b83989609a",
      "title": "Hank Green’s Focus Friend app is climbing the App Store charts — and it’s extremely cute",
      "url": "https://techcrunch.com/2025/08/18/hank-greens-focus-friend-app-is-climbing-the-app-store-charts-and-its-extremely-cute/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-18T17:36:19.000Z",
      "summary_90w": "",
      "raw": "If you fail to stay focused, you will make an anthropomorphic bean very sad, because its knitting project depends on your ability to stay on task.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "94858bd9a9da78f38ea9290ae97f6310aa984ad2",
      "title": "BBC at Rafah crossing as queues of aid trucks wait to enter Gaza",
      "url": "https://www.bbc.com/news/videos/cev2nmwxe1po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T16:11:47.000Z",
      "summary_90w": "",
      "raw": "The BBC's Chief International Correspondent Lyse Doucet is travelling with Palestinian Prime Minister Mohammad Mustafa and Egypt’s Foreign Minister Badr Abdelatty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ebeba55e5936b3ddf9dbaeab1d28216b860c4ac7",
      "title": "'No-one was expecting this': European leaders rush to US to help Ukraine avoid 'capitulation'",
      "url": "https://www.bbc.com/news/articles/c9d0v8ljw3no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T15:31:36.000Z",
      "summary_90w": "",
      "raw": "The heads of state hope to stop Trump from threatening long-term European security, writes James Landale.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "079041b58d30f4908f4f6031556788e3ed856dc0",
      "title": "Rescuers in Nigeria search for dozens missing after boat capsizes",
      "url": "https://www.bbc.com/news/articles/c4gzl0r5e7go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T15:26:04.000Z",
      "summary_90w": "",
      "raw": "Safety regulations are rarely enforced leading to a large number of accidents on the waterways.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d08c2013c058b0a1c8648a0a047268e25c67831",
      "title": "Two decades of leftwing dominance end in Bolivia as rightwingers head to election runoff",
      "url": "https://www.theguardian.com/world/2025/aug/18/bolivia-presidential-election-preliminary-results",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T15:06:53.000Z",
      "summary_90w": "",
      "raw": "Movimiento al Socialismo’s time runs out as economic crisis grips country\nBolivia’s presidential election will go to a runoff for the first time, with two rightwing candidates competing for the presidency – marking the end of nearly 20 years of dominance by the leftist Movimiento al Socialismo (Mas).\nThe candidate with the most votes, however, turned out to be a surprise: centre-right senator Rodrigo Paz Pereira, 57, who had started the campaign with just 3% support in opinion polls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8df0cdecbec83f45ba9c846e7fef2baa83c3362",
      "title": "Newsmax pays $67 million to settle defamation case linked to 2020 election coverage",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5506062/newsmax-pays-67-million-to-settle-defamation-case-linked-to-2020-election-coverage",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T14:37:16.000Z",
      "summary_90w": "",
      "raw": "The right-wing news channel Newsmax has agreed to pay $67 million to Dominion Voting Systems over its coverage of the 2020 presidential election. A trial had been scheduled for October.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bdbfa0c9fdb16e4002376c8a592da8973557bc1b",
      "title": "Netanyahu criticises protests in Israel against his handling of Gaza war",
      "url": "https://www.theguardian.com/world/2025/aug/18/netanyahu-criticises-protests-israel-handling-gaza-war-hostages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T14:34:44.000Z",
      "summary_90w": "",
      "raw": "Israeli PM suggests demonstrators are toughening Hamas’s stance and delaying the release of hostages\nBenjamin Netanyahu has criticised massive street protests against his handling of the Gaza war, and failure to secure the release of remaining Israeli hostages, suggesting demonstrators were giving comfort to Hamas’s position in negotiations.\nThe Israeli prime minister made his comments against the backdrop of the largest protests in almost two years of war, with estimates that upwards of 400,000 people joined marches across Israel on Sunday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b19157522d760620258a05b742b75af6f25adda7",
      "title": "Spain and Portugal fires kill two more as Spanish troops battle blazes",
      "url": "https://www.bbc.com/news/articles/cz60y7npl32o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T13:25:59.000Z",
      "summary_90w": "",
      "raw": "Spain has sent 500 more troops to wildfire-affected regions, bringing the total deployed to 1,900.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d91c7f44192f3bdf5878dae3145b62c6abf303",
      "title": "'The water had no mercy': Hundreds killed as floods ravage north Pakistan",
      "url": "https://www.bbc.com/news/articles/ce3jeed2798o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T11:00:34.000Z",
      "summary_90w": "",
      "raw": "BBC visited villages which were wiped out overnight by rains, flash floods and landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5bf6e0bf654b5561f10c6597c1800e318010409e",
      "title": "BBC witnesses Israeli settlers' attack on Palestinian farm in West Bank",
      "url": "https://www.bbc.com/news/articles/cewy88jle0eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T09:52:56.000Z",
      "summary_90w": "",
      "raw": "A BBC team was interviewing a Palestinian farmer when masked men charged towards them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2bec0a308338e4dd5679e1c881b2bc6e8bc8556",
      "title": "Swatch pulls ‘slanted eye’ ad after backlash in China",
      "url": "https://www.theguardian.com/world/2025/aug/18/swatch-slanted-eye-ad-backlash-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T08:50:48.000Z",
      "summary_90w": "",
      "raw": "Calls for boycott after Swiss watchmaker becomes latest western brand accused of racist imagery\nThe Swiss watchmaker Swatch has apologised and removed an advert featuring a model pulling the corners of his eyes, after the image prompted accusations of racism and calls for a boycott on Chinese social media.\nInternet users heavily criticised the “slanted eye” gesture made by the Asian male model as racist.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "270e6f0c00ff6a2cf15437100a9666efe2940c2d",
      "title": "War-torn Myanmar to hold first general election since 2021 coup",
      "url": "https://www.bbc.com/news/articles/cvg3pp4n952o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T07:27:02.000Z",
      "summary_90w": "",
      "raw": "Critics have denounced the vote as a sham that will be used to entrench the military government's power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0bb520a2088556ed41c7fa7a09337ded3ea3cfc1",
      "title": "Three innovations pushing the medical field forward",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5503741/three-innovations-pushing-the-medical-field-forward",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T07:05:01.000Z",
      "summary_90w": "",
      "raw": "Innovation is crucial for long-term economic prosperity. One area where that’s happening aplenty: medical technology. From a cancer vaccine to an Alzheimer’s blood test to a life-changing exoskeleton, we take you on a tour of the economics of health technology. \nRelated episodes: \nThe hidden costs of healthcare churn  (Apple / Spotify) \nMore for Palantir, less for mRNA, and a disaster database redemption arc (Apple / Spotify) \nIt's actually really hard to make a robot, guys (Apple / Spotify) \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Voice-over by Greg Hardes. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "374a4731ad36ab9ee387a0279be42c47e60dd8de",
      "title": "Qantas hit with record fine for illegal layoffs during pandemic",
      "url": "https://www.bbc.com/news/articles/cd0dy7mm0l7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T04:46:05.000Z",
      "summary_90w": "",
      "raw": "Australia's biggest airline was sued for firing ground staff in 2020 as aviation came to a standstill.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9ea0b3db72444e11d5cdf2211995869937725f6",
      "title": "Swatch sorry for 'slanted eyes' ad after China uproar",
      "url": "https://www.bbc.com/news/articles/cn02k9ykej5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T04:27:43.000Z",
      "summary_90w": "",
      "raw": "The image of a model pulling the corners of his eyes resembled a racist image, critics say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0ce3f0bfa69296240000967c49008e6b8697191",
      "title": "Bolivia set to elect first non-left wing president in two decades",
      "url": "https://www.bbc.com/news/articles/c4gzlp85432o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T02:51:39.000Z",
      "summary_90w": "",
      "raw": "The rightward turn by the Bolivian electorate can see changes in economic policies and closer US ties.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c795129215b6bb14b9a0488b096896ee13132b57",
      "title": "Health v heritage: Pigeon feeding ban sparks debate in India  ",
      "url": "https://www.bbc.com/news/articles/cvg3mj0vkzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T23:32:50.000Z",
      "summary_90w": "",
      "raw": "Feeding pigeons is common in Indian cities but is now controversial due to rising numbers and health risks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95b32f858b0c8cf5f1f237c30f558ab992f6eeef",
      "title": "Huge crowds gather in Israel calling for hostage deal and end to Gaza war",
      "url": "https://www.bbc.com/news/articles/ce93y2dxlg4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T21:21:43.000Z",
      "summary_90w": "",
      "raw": "Large crowds fill 'Hostages Square' in Tel Aviv to call for fighting to cease and the release of all remaining hostages by Hamas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ed07098c713b5cb859bf771414823048530fe7e",
      "title": "Air Canada suspends restart plans after union defies return to work order",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5505416/air-canada-suspends-restart-plans",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-17T18:38:41.000Z",
      "summary_90w": "",
      "raw": "Air Canada will resume flights Monday evening, claiming the union illegally directed flight attendants to defy a return-to-work order.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ef90686c9acbeff88433c1ac2feeb9e4bf52edbe",
      "title": "Sudan army torturing people to death, says rights group",
      "url": "https://www.bbc.com/news/articles/cy4dqp8eeedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T13:20:38.000Z",
      "summary_90w": "",
      "raw": "Emergency Lawyers group alleges the army is operating \"execution chambers\" in the capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b66f4e6b33091ae0ff5ff2a98c2b567008db1db5",
      "title": "Hollywood stuntman set on fire for Pink Floyd cover dies aged 88",
      "url": "https://www.bbc.com/news/articles/c05e0z9lj3mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T12:25:31.000Z",
      "summary_90w": "",
      "raw": "Ronnie Rondell Jr's decades-long career saw him appear in films and TV including Baywatch, Spartacus and The Matrix Reloaded.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d191fbff31ef74e1d13b123283e3cf04aa73f7c",
      "title": "More than 200 missing in flood-hit district in Pakistan, official says",
      "url": "https://www.bbc.com/news/articles/c8jp3y04jeyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T10:54:08.000Z",
      "summary_90w": "",
      "raw": "Hundreds are reported missing in Khyber Pakhtunkhwa province as a result of devastating floods.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "304d6ee1d5b04aea5df2df87bb2e56240dbe22a0",
      "title": "Washington's hydropower has created a data center boom. Some are concerned about its future.",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5501579/washington-hydropower-data-center-boom-sustainability-climate-change",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-17T09:00:59.000Z",
      "summary_90w": "",
      "raw": "In small town Washington — where hydropower is plentiful — data centers are creating jobs and funding amenities. But water and energy aren't unlimited — and some worry about long-term sustainability.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4ba79ae97f961f8540daf17a5a85ee98a072ac6d",
      "title": "Government forces Air Canada flight attendants back to work, into arbitration",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5504621/air-canada-suspends-operations-strike-flight-attendants",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T12:48:06.000Z",
      "summary_90w": "",
      "raw": "Canada's government forced Air Canada and its striking flight attendants back to work and into arbitration Saturday after a work stoppage stranded more than 100,000 travelers around the world.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "06584689c771fb2c359c14f49df8587c9d31b3c5",
      "title": "Opinion: Remembering Ted Clark, great colleague — better friend",
      "url": "https://www.npr.org/2025/08/16/nx-s1-5497210/opinion-remembering-ted-clark-great-colleague-better-friend",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Scott Simon remembers former longtime NPR colleague Ted Clark, who passed away last week at the age of 79.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b0c15b44269f9dcf7c772ff2a940869efa1aaa3a",
      "title": "New Zealand woman and six-year-old son released from US detention",
      "url": "https://www.theguardian.com/world/2025/aug/16/new-zealand-woman-and-six-year-old-son-released-from-us-detention",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T11:56:07.000Z",
      "summary_90w": "",
      "raw": "Sarah Shaw was detained by Ice owing to a problem with her ‘combo card’ visa as she tried to re-enter the US from Canada\n\nNew Zealand woman and son detained by Ice enduring ‘terrifying’ ordeal\n\nA New Zealand woman and her six-year-old son, who were held for more than three weeks at a US immigration centre after being detained crossing the Canada-US border, have been released.\nIn a short update on Saturday, the woman’s friend Victoria Besancon said Sarah Shaw and her son were safely home. The family would be taking some time to settle in before speaking about their experience, she added.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7241623fb6e169f633e3e3d4ce284aa5c499b100",
      "title": "Trump says Xi told him China will not invade Taiwan while he is in office",
      "url": "https://www.theguardian.com/world/2025/aug/16/donald-trump-xi-jinping-china-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-16T00:09:59.000Z",
      "summary_90w": "",
      "raw": "US president says Chinese counterpart told him ‘I am very patient and China is very patient’\nThe US president, Donald Trump, has said that his Chinese counterpart, Xi Jinping, told him China would not invade Taiwan while Trump is in office.\nTrump made the comments in an interview with Fox News on Friday, ahead of talks with the Russian president, Vladimir Putin, over Moscow’s invasion of Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d86f6c742a9dda9f394936c923deaa52d73e1ef9",
      "title": "Tuvalu considers pulling out of Pacific leaders’ summit amid China-linked power struggle",
      "url": "https://www.theguardian.com/world/2025/aug/16/tuvalu-considers-pulling-out-of-pacific-leaders-summit-amid-china-linked-power-struggle",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T23:30:45.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Prime minister Feletei Teo says Tuvalu may withdraw from crucial meeting after key countries such as Taiwan were barred from attending\nTuvalu’s prime minister Feletei Teo said his country may pull out of the region’s top political meeting next month, after host nation Solomon Islands moved to block all external partners – including China, US and Taiwan – from attending.\nThe Pacific Islands Forum leaders meeting will be held in Honiara in September. On 7 August, Solomon Islands prime minister Jeremiah Manele told parliament that no dialogue partners would be invited to the annual gathering.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d433daa9d7e7dc43ff5cf3e6f3cdfcd3b097486",
      "title": "Weather tracker: Typhoon Podul pounds southern Taiwan",
      "url": "https://www.theguardian.com/environment/2025/aug/15/weather-tracker-typhoon-podul-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T09:47:14.000Z",
      "summary_90w": "",
      "raw": "One person dies after storm whips up waves, while temperatures approach 50C as heatwave grips Middle East\nTyphoon Podul crossed southern Taiwan on Wednesday with wind speeds of up to 110mph (177km/h), equivalent to a category 2 hurricane.\nPodul had developed a week earlier, near the Northern Mariana Islands, and tracked west across the Philippine Sea, achieving typhoon status on Tuesday before making landfall in south-east Taiwan the following day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    }
  ]
}