{
  "version": "1757428526203",
  "generatedAt": "2025-09-09T14:35:26.204Z",
  "items": [
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows U.S. job growth likely far slower than we thought",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the twelve months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d74e0ada9cebd375fcd672731906973c4330d8ea",
      "title": "Google’s Veo 3 can now generate vertical AI videos",
      "url": "https://www.theverge.com/news/774352/google-veo-3-ai-vertical-video-1080p-support",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T14:23:51.000Z",
      "summary_90w": "",
      "raw": "These screenshots are two examples of vertical videos that Google generated using Veo 3’s updated features.\t\n\nGoogle has added support for 1080p resolution and vertical video formats to its Veo 3 AI video generator. According to the announcement on Google’s developer blog, both Veo 3 and Veo 3 Fast — a faster, and more affordable version of the video model that produces lower-quality results — now allow users to generate videos in a 9:16 aspect ratio that’s better suited for content displayed on mobile devices and social media apps.\nThe blog says that vertical video support can be enabled by setting the aspectRatio parameter in API requests to 9:16, meaning this feature is specific to developers who are building apps that support Veo 3 video generation. The update also allows developers to set the resolution of generated videos to 1080p, up from the previous 720p limitation, though Neowin reports that this is currently only supported for 16:9 aspect ratio videos.\nGoogle says it’s also making Veo 3 and Veo 3 Fast “stable and ready for scaled production use in the Gemini API,” and has made it more affordable for developers to generate videos using these tools. Generation through Veo 3 is now $0.40 per second, down from $0.75, and the Veo 3 Fast model has been cut to $0.15 per second, down from $0.40. Google showcased these updates in a couple of  example videos generated in Veo 3’s new vertical format, including a rock climber saying, “Veo 3 is now, like, 50 percent cheaper and higher quality, so go build.”\n\nThe support for vertical video formats isn’t entirely surprising, given Google announced in June that Veo 3 support will be added to YouTube Shorts “later this summer.” Giving developers access to support the format in their own apps means we will likely start seeing content generated through Veo 3 on more vertical video platforms like TikTok and Instagram Reels, however, putting yet more AI slop in front of our eyeballs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed74370aeb95f219027563819cf1d87d89157b3a",
      "title": "Israel targets top Hamas members in Qatar for Gaza ceasefire talks",
      "url": "https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:21:13.000Z",
      "summary_90w": "",
      "raw": "Israeli officials say US notified before attack, which Doha calls cowardly and a flagrant violation of international law\n\nMiddle East crisis – live updates\n\nIsrael has launched an attack on senior Hamas members meeting in Doha, reportedly including the group’s chief negotiator, making Qatar the latest Middle Eastern country to be targeted by an Israeli military operation.\nIsrael’s Channel 12, citing an Israeli official, claimed Donald Trump had given the green light for the attack, which\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0c422100f50c5b7296cd3a56b2078cb7846e313",
      "title": "Qatar condemns ‘criminal assault’ as Israel launches airstrikes against Hamas leaders in Doha – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:17:38.000Z",
      "summary_90w": "",
      "raw": "Ceasefire negotiators from militant group reportedly survive attacks\nDan Sabbagh is the Guardian’s defence and security editor\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dca2ecd0afbc054bf1d12216cba5a31ed1155838",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "url": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:16:54.000Z",
      "summary_90w": "",
      "raw": "ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery\nAn international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.\nThe ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.\nReuters and Agence France-Presse contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fec78d7cfba59c4d54e7fbb7d4cc556e573b63f",
      "title": "Motorola’s budget Razr is even more affordable now that it’s $100 off",
      "url": "https://www.theverge.com/tech/773288/motorola-razr-2025-superman-4k-ultra-hd-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T14:15:00.000Z",
      "summary_90w": "",
      "raw": "If you’ve been eyeing a flip phone but have been put off by the price, now’s your chance to snag one at a serious discount. Motorola’s latest Razr is currently matching its all-time low price of $599.99 ($100 off) at Amazon, Best Buy, and Motorola’s online storefront, making what was already an affordable flip phone even cheaper.\nMotorola Razr 2005\n\nWhere to Buy:\n\n $699.99 $599.99 at Amazon\n $699.99 $599.99 at Best Buy\n $699.99 $599.99 at Motorola\n\nThe 2025 Razr is a solid, relatively inexpensive entry point into the world of foldables. The clamshell-style device features a 3.6-inch cover screen that’s great for performing quick tasks, plus an internal OLED display that stretches to 6.9 inches when the phone is open. While neither display is quite as sharp or vibrant as the ones found in the pricier Razr Ultra, they stack up well considering the price.\nAdditionally, the latest Razr offers a titanium hinge and an IP48 rating, resulting in a more durable design compared to previous iterations. However, while the device is fully water-resistant, any dust or particle smaller than 1mm can potentially damage the hinge. It also features a midrange Mediatek Dimensity 7400X processor and a 4,500mAh battery, easily allowing for a full day of battery life.\nThe Razr won’t offer the same performance as something like the Google Pixel 9A, even if it typically costs $200 more, but that’s the tradeoff if you want a cheap(er) foldable. That said, it’s far more affordable than something like the newer Galaxy Z Flip 7 FE, which starts at $899. That makes the $100 discount on the Razr even sweeter, and a great option if you’re looking to save some money.\nOther deals worth checking out\nThe 8BitDo Micro Bluetooth Gamepad is on sale starting at $21.99 ($3 off) at Amazon. The tiny Bluetooth controller is an excellent option for gaming on the go, and it’s small enough to fit in your pockets between sessions. It’s compatible with Android, the Nintendo Switch, and Raspberry Pi; it also works as a multitasking controller on Android, Windows, and iOS.\nThis year’s excellent Superman movie is already available to own on your preferred digital platform; however, if you’d rather own a physical copy, the Blu-ray and 4K Ultra HD versions are up for grabs at Amazon ahead of their September 23rd release. Both versions are discounted, with the Blu-ray going for $24.95 (about $5 off) and the 4K release $29.95 (about $5 off). Read our review.\nRight now, you can get a two-pack of physical Brick keys for $106.20 (about $12 off) from Brick, encouraging you and a friend, partner, or family member to spend less time glued to your screen. Basically, the Brick uses a physical key and an app to block distracting apps, so you aren’t tempted to browse Instagram during a movie. In her review, our own Victoria Song noted that the Brick has some limitations, though she found it can make it easier to put your phone down, leading to healthier habits.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3dae5db8ecaa3c4d1cf2664358ae0f482b04fc10",
      "title": "Who could replace Angela Rayner as Labour deputy leader?",
      "url": "https://www.bbc.com/news/articles/c8jm9lk19v3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T14:08:09.000Z",
      "summary_90w": "",
      "raw": "The winning candidate - voted for by Labour members - will be announced on 25 October.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e00c3ad0cd32fdd94a1bab9b57be77b81c34ad5",
      "title": "Greta Thunberg says Gaza aid boat hit in ‘drone attack’ off Tunisia",
      "url": "https://www.theguardian.com/world/2025/sep/09/flotilla-carrying-aid-to-gaza-struck-by-flaming-object-video-shows-sidi-bou-said-port-tunisia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:06:19.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says one of its vessels was hit by drone at Sidi Bou Said port in Tunisia, sustaining fire damage\n\nIsrael issues large-scale evacuation order for Gaza City ahead of expanded offensive – Middle East crisis live\n\nA flotilla carrying aid for Gaza and pro-Palestinian activists including Greta Thunberg says one its boats has been struck in a drone attack while docked in Tunisia.\nThe Global Sumud Flotilla (GSF) shared a video showing one of its boats being hit by a flaming object at Sidi Bou Said port, near the Tunisian capital, Tunis. “One of the flotilla’s main boats … was struck by a drone in Tunisian waters,” GSF said. “The boat is sailing under the Portuguese flag and all six passengers and crew are a safe.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd32b6490e1052d8fca48f8c2ecfafd9e769a734",
      "title": "Premier League clubs seek clarity over Man City 'settlement'",
      "url": "https://www.bbc.com/sport/football/articles/cy859l0xw89o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T14:03:27.000Z",
      "summary_90w": "",
      "raw": "Premier League clubs want more clarity about the settlement of a legal dispute with Manchester City over the rules that govern commercial deals, BBC Sport has been told.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31bd01bf9c60501d44aa088c1b19295afecb7b55",
      "title": "France to get third PM in a year as Bayrou resigns after confidence vote – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:02:44.000Z",
      "summary_90w": "",
      "raw": "Emmanuel Macron to name successor ‘within days’ as political crisis grips France\n\nFrance to get third PM in a year\n\nLithuania has also said it will strengthen its borders with Belarus and Russia during the Zapad military exercise, the country’s border guard said today.\nThe authorities said they would carry “even more active border monitoring, patrols, and other border control measures,” looking for any potential border violations and provocations against Lithuania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b2ccbe619eb773df29b79a84dff8a8e8527486",
      "title": "Proposed ‘nation-leading’ NSW childcare reforms to include $500,000 fines",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/proposed-nation-leading-nsw-childcare-reforms-to-include-500000-fines",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Greens welcome Minns government’s ‘bare-minimum’ changes but say more work is needed to restore faith in the sector\n\nGet our breaking news email, free app or daily news podcast\n\nLarge childcare providers found in breach of safety directives will face $500,000 fines – a 900% increase – under new laws to be introduced by New South Wales parliament on Wednesday.\nThe proposed legislation will grant greater powers to the early childhood regulator to suspend educators and revoke quality ratings in a suite of measures addressing grave concerns about safety in the sector.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e373552cbb50380c26c40ae0a70848b1e2b83d4d",
      "title": "Apple iPhone 17 launch event: how to watch",
      "url": "https://www.theverge.com/news/773176/apple-iphone-17-launch-event-watch-time-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T14:00:00.000Z",
      "summary_90w": "",
      "raw": "It’s that time of year again: Apple is getting ready to reveal all of the changes coming to its latest generation of iPhones. This year’s “awe dropping” event is expected to include spec bumps across the iPhone 17 lineup, in addition to an ultra-thin iPhone 17 Air. Rumors suggest that we may even get a glimpse of Apple’s new smartwatches, along with an upgraded pair of AirPods Pro 3.\nThere’s still plenty of room for surprises, and if you’re curious about what Apple has in store, here’s how you can tune into the event live.\nWhen is Apple’s “awe dropping” event?\nApple’s iPhone 17 launch event kicks off on Tuesday, September 9th, at 1PM ET / 10AM PT. The company will stream the event live from Apple Park in Cupertino, California.\nWhere to watch the iPhone 17 launch event\nThere are a few different ways that you can watch Apple’s upcoming event. You can watch the event live from the video embedded near the top of this article or head to Apple’s livestream on YouTube. Apple will also air the event directly on its website, as well as on the Apple TV app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bbea9208e9d5e8c0563a938e565e9ff69238f913",
      "title": "Geothermal is too expensive, but Dig Energy’s impossibly small drill rig might fix that",
      "url": "https://techcrunch.com/2025/09/09/geothermal-is-too-expensive-but-dig-energys-impossibly-small-drill-rig-might-fix-that/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Dig Energy's water-jet drilling right promises to cut drilling costs by up to 80%, helping geothermal heating hit price parity with fossil fuel furnaces.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c0b3307c5d80781c363b668e89f276230266525",
      "title": "Pro-Palestine activists call for arrest of Israeli president during UK visit",
      "url": "https://www.theguardian.com/world/2025/sep/09/pro-palestine-activists-call-for-arrest-israeli-president-isaac-herzog-during-uk-visit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T13:57:59.000Z",
      "summary_90w": "",
      "raw": "Campaign group accuses Isaac Herzog, arriving in UK next week, of aiding and abetting indiscriminate killing in Gaza\n\nMiddle East crisis – live updates\n\nPro-Palestine activists have requested that an arrest warrant be issued against the Israeli president, Isaac Herzog, for alleged war crimes before his arrival in the UK this week.\nHerzog is accused of aiding and abetting the indiscriminate killing of civilians in Gaza in the request to the director of public prosecutions filed by the Friends of Al-Aqsa campaign group.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3eec95e140effec48e6ec538b87b4b8aa80a1b74",
      "title": "Macron under pressure to name new PM as France simmers ahead of protests",
      "url": "https://www.bbc.com/news/articles/c4gqx0zk72lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T13:57:55.000Z",
      "summary_90w": "",
      "raw": "François Bayrou has handed in his resignation, leaving France without a prime minister on the eve of nationwide protests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "365cd288398b5d86d04dbd8c81a918383729c3d8",
      "title": "Israel says it carried out a strike on Hamas' main political office in Qatar",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535210/israel-qatar-hamas-doha",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T13:47:50.000Z",
      "summary_90w": "",
      "raw": "The Israeli military says it has carried out an airstrike on Hamas political headquarters in Qatar. Television footage from Doha showed a huge cloud of gray smoke rising over the area of Doha where the bombing took place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bef72ba93e9f5f14c24ef3ccea966e320ec4a875",
      "title": "Plex urges users to change passwords after data breach",
      "url": "https://techcrunch.com/2025/09/09/plex-urges-users-to-change-passwords-after-data-breach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T13:47:22.000Z",
      "summary_90w": "",
      "raw": "Customers are urged to take action after a database containing scrambled passwords and authentication information was compromised.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68836586dc06a83f8bbbebe9c738b6b4e3d2e5a9",
      "title": "Boris Johnson secretly lobbied UAE for billion-dollar private venture, leak suggests",
      "url": "https://www.theguardian.com/uk-news/2025/sep/09/boris-johnson-secretly-lobbied-uae-business-venture-leak-suggests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T13:47:11.000Z",
      "summary_90w": "",
      "raw": "Former prime minister courted senior Abu Dhabi official he had hosted in No 10 in apparent breach of rules\nIn early 2024, a vape lobbyist, a Vote Leave campaigner and a Vienna banker set out to persuade the rulers of an oil-rich Gulf emirate to give them a billion dollars. For the plan to work, leaked files suggest, they needed a frontman who had some pull with the sheikhs. So they hired Boris Johnson.\nHis time as the UK’s prime minister had ended less than two years earlier and he had left parliament. But Johnson retained relationships cultivated during his time in power. The Boris Files, a cache of documents seen by the Guardian, suggest he has sought to harness these relationships for self-enrichment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Nepal anti-corruption protests explained",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T13:19:41.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned violent after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d9e07c2cfd930a031bca25057fb0fd33413a7fc",
      "title": "This Atari handheld with retro controls is finally available for preorder",
      "url": "https://www.theverge.com/news/774305/atari-gamestation-go-retro-handheld-trackball-paddle",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T13:18:10.000Z",
      "summary_90w": "",
      "raw": "The Atari Gamestation Go comes with over 200 retro games. | Image: Atari\t\n\nNearly two years after it was first announced at CES 2024, My Arcade’s Atari Gamestation Go handheld is finally available for preorder for $179.99 through the company’s website, with shipping expected to start in October 2025.\nThat’s a small price bump from the expected $149.99 pricing announced earlier this year during CES 2025, but the handheld comes with over 200 preinstalled retro games including titles from Atari and Jaleco, plus Pac-Man. The Gamestation Go is not only an accessible way for nostalgic gamers to enjoy retro titles, it also provides several ways to accurately play those older games with an unusual assortment of control options.\nIn addition to a standard D-pad and buttons, the Gamestation Go features a paddle controller, a trackball, and a numeric keypad, mirroring the unique controllers that were available for the earliest Atari consoles. The various controls even light up so you know which one you should be using for the game you’re playing. And although the handheld features a generous 7-inch screen, battery life is still estimated to be up to four or five hours.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a29f9f0508c07958be555bbf91fd9ef2f54ef96c",
      "title": "France to get third PM in a year as Bayrou resigns after confidence vote",
      "url": "https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T13:00:27.000Z",
      "summary_90w": "",
      "raw": "Prime minister hands in resignation after thousands of protesters gather to celebrate ousting and plan day of action\n\nThe French prime minister, François Bayrou, has handed in his resignation after losing a confidence vote that has plunged France into government collapse and political crisis.\nEmmanuel Macron has said he will appoint a new prime minister in the coming days, who would then have to form a new government. This will be the third French prime minister in a year, whose first task will be the major challenge of agreeing a budget among a divided parliament.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fc65be922428352ec21ba19ebf7ea4047db477c",
      "title": "Canon is bringing back a point-and-shoot from 2016 with fewer features and a higher price (it’s viral)",
      "url": "https://www.theverge.com/news/774095/canon-powershot-elph-360-hsa-kendall-jenner-reissue-price-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Don’t call it a comeback.\t\n\nCanon seems to be riding the TikTok digicam resurgence and is rereleasing a mid-2010s point-and-shoot — the PowerShot Elph 360 HS A. It’s mostly the same camera as the original Elph 360 HS, first launched in the very different world of 2016 and recently anointed the darling pocket camera of celebrities like Kendall Jenner and Dua Lipa. \nNow, in 2025, the “A” version of the PowerShot still has the same 20.2-megapixel CMOS sensor, Digic IV Plus processor, 12x optical zoom, 1080p video, and USB Mini port of the nine-year-old throwback. (Nope, no USB-C.) But the new model now costs $379 instead of the original’s $210, and it makes the switch to microSD cards instead of full-size SD.\nThe downsizing of features doesn’t end with storage formats. The new Elph incarnation doesn’t support Wi-Fi image transfers to a PC or direct printing via Wi-Fi like the original (though I’m skeptical many people were doing that). And there’s no longer a purple color, as the new Elph 360 HS A will only come in black or silver when it launches in late October.\nThe jump in price while downsizing in features sounds baffling at first. But the rising popularity of point-and-shoot cameras among younger folks and the trend of celebs being spotted using the original model has fueled a viral interest in the 360 HS. Canon never seemed to truly discontinue the original model, until now that the “A” is replacing it. The aging version can still occasionally be found at retailers, but often for hefty markups.\nAuthorized Canon dealer B&H Photo maintains a listing for it, priced at $359.99, though it’s currently “temporarily out of stock.” A live chat sales rep for B&H told me the store last received a shipment on August 14th, but much like with my colleague Allison Johnson’s efforts to procure a Canon PowerShot G7 X Mark III earlier this year, these “drops” get quickly snatched up.\nAs much as I find the digicam trend endearing (I think it’s fun for young people to explore new-old creative avenues and breathe fresh life into outdated tech), it will be interesting to see a big company like Canon try to meet this viral moment. I usually feel that once the suits catch wind of these things and want to cash in, it’s time to pack it up and move on to the next cool thing. The digicam trend may still last a while longer, but what happens if Canon makes enough of the new 360 HS A cameras that they’re readily available at MSRP? Will the interest remain if the camera is no longer a hard-to-get flex for online clout, like a Labubu?\nWhat’s an Elph? Does it have pointy ears?\nThe PowerShot Elph 360 HS was released as the Ixus 285 HS in Europe and Ixy 650 in Japan. Canon has often given its consumer cameras different names in different regions. For example, the older Canon EOS SLRs were branded EOS Rebel / Digital Rebel in the US, while they had just alphanumeric names in Europe and were known as Kiss / Kiss Digital in Japan.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcd51a78081f3c802dc52c5154e4807664ccecc3",
      "title": "Bridget Phillipson and Emily Thornberry join Labour deputy leader race",
      "url": "https://www.bbc.com/news/articles/c3rvqv9yg4eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:53:56.000Z",
      "summary_90w": "",
      "raw": "Hopefuls have until the end of Thursday to secure enough backing from Labour MPs to take part.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32db2407a94e414f83c0b83b96fc7c1cdc34389d",
      "title": "White House denies Trump's alleged birthday message to Epstein is authentic",
      "url": "https://www.bbc.com/news/articles/cvgqnn4ngvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:48:55.000Z",
      "summary_90w": "",
      "raw": "The message purportedly written by Trump is inside a 238-page book released by a House committee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2cbc52a60c278440b9feaacfd22134c511670f48",
      "title": "Twenty-three killed in Russian strike on pension queue, Ukraine says",
      "url": "https://www.bbc.com/news/articles/c1jz08j8313o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:46:22.000Z",
      "summary_90w": "",
      "raw": "The attack targeted the eastern village of Yarova, officials say, a few kilometres from the front line.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2531ba2b3c8c96d29255730ce230d95b05359ad1",
      "title": "Nuclearn gets $10.5M to help the nuclear industry embrace AI",
      "url": "https://techcrunch.com/2025/09/09/nuclearn-gets-10-5m-to-help-the-nuclear-industry-embrace-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T12:45:00.000Z",
      "summary_90w": "",
      "raw": "Nuclearn has developed AI tools to help reactor operators automate routine paperwork. \"Think of it as the junior employee,\" the company tells customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c611799b1dd712668936d7ffc4e6d15546ad851e",
      "title": "Postecoglou replaces Nuno as Forest manager",
      "url": "https://www.bbc.com/sport/football/articles/cvgq6495gd6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:31:37.000Z",
      "summary_90w": "",
      "raw": "Tactical analysis and fan opinion as Ange Postecoglou returns to the Premier League, three months after being sacked by Tottenham.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95627614571fb588759283ad7501be84a4e9a79b",
      "title": "England recall Curran for first South Africa T20",
      "url": "https://www.bbc.com/sport/cricket/articles/cy8rypk0739o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:29:27.000Z",
      "summary_90w": "",
      "raw": "All-rounder Sam Curran receives his first call-up under Brendon McCullum for the start of the three-match T20 series in Cardiff on Wednesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87e7e450610294f17c0de3619d30ab2671eb478e",
      "title": "Japan heatwave will be challenge for athletes - Coe",
      "url": "https://www.bbc.com/sport/athletics/articles/cx23vy582q6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T12:23:05.000Z",
      "summary_90w": "",
      "raw": "Japan has endured its hottest summer on record, with Saturday's opening day forecast to be 32C.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5995095ba214392cf4a6ff8e56c5f9a38cf629e",
      "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
      "url": "https://techcrunch.com/2025/09/09/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T12:15:00.000Z",
      "summary_90w": "",
      "raw": "Mistral AI, the French company that develops the AI chatbot, Le Chat, and several foundational large language models, is considered one of France’s most promising tech startups, and is arguably the only European company that could compete with OpenAI. “Go and download Le Chat, which is made by Mistral, rather than ChatGPT by OpenAI — […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b6c653830a09a7b83e60d235b433366ef9d4cb9",
      "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
      "url": "https://www.bbc.com/news/articles/cr4qx6377qgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T12:05:52.000Z",
      "summary_90w": "",
      "raw": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6bb5ffe52f6448fb206744d70d6281ddf8b6f36",
      "title": "Blackrock-backed Minute Media acquires Indian AI startup that extracts sports highlights",
      "url": "https://techcrunch.com/2025/09/09/blackrock-backed-minute-media-acquires-indian-ai-startup-that-extracts-sports-highlights/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T12:00:00.000Z",
      "summary_90w": "",
      "raw": "VideoVerse is an Indian AI startup that lets broadcasters extract highlights and create content from sports footage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1ddee3193d35aebddc871ca8fd431a8bacb6f2d2",
      "title": "Guillermo del Toro makes Frankenstein his own",
      "url": "https://www.theverge.com/toronto-international-film-festival/774035/tiff-2025-reviews-frankenstein-normal-eternity",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Frankenstein is one of those stories that's been retold countless times. And yet, Guillermo del Toro has managed to make a version that not only feels true to Mary Shelley's original, but is also imbued with the trademarks the director is known for.\nMaybe that shouldn't be too surprising - when presenting the film at its premiere at the Toronto International Film Festival this week, del Toro explained that he has been thinking about Frankenstein since he was seven years old, but it wasn't until he became a father that he truly understood how to tell the version of the story he wanted to. Well, all that time paid off.\nOn day 5 of TIFF I als …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "06379ae4354c76c42c9e014170ea16068c625eca",
      "title": "Kerry Stokes ordered to pay Ben Roberts-Smith’s $13.5m legal costs after failed defamation suit",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/kerry-stokes-ordered-to-pay-ben-roberts-smiths-135m-legal-costs-after-failed-defamation-suit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T11:52:30.000Z",
      "summary_90w": "",
      "raw": "Seven boss handed bill by federal court after backing the disgraced former soldier in action against Nine Newspapers\n\nGet our breaking news email, free app or daily news podcast\n\nSeven West Media’s chair, Kerry Stokes, has been ordered to pay $13.5m in legal costs to companies who were unsuccessfully sued for defamation by disgraced former soldier Ben Roberts-Smith.\nOn Tuesday, a federal court registrar ordered that Australian Capital Equity Pty Ltd (ACE), Stokes’ private company, pay costs fixed at almost $13.3m, and a further $225,000 in relation to the costs assessment, bringing the total bill to $13.5m.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3ad59564cda6227ea2788286b393cbd8eb1579d",
      "title": "Mandelson called Epstein 'best pal' in birthday message",
      "url": "https://www.bbc.com/news/articles/cwy9dwe50leo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T11:51:04.000Z",
      "summary_90w": "",
      "raw": "The description is contained an alleged 50th \"birthday book\" given to the disgraced financier that has been released by US lawmakers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "30bda016891affb84f7a24771d917d5eaaf323e7",
      "title": "Google pulls the Pixel 10’s Daily Hub to ‘enhance its performance’",
      "url": "https://www.theverge.com/news/774274/google-pulls-the-pixel-10s-daily-hub-to-enhance-its-performance",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T11:50:45.000Z",
      "summary_90w": "",
      "raw": "Daily Hub aims to combine useful info with curated recommendations, but only sometimes succeeds.\t\n\nWhen Google launched the Pixel 10 line last month, it gave as much attention to its AI-enabled software tricks as it did the hardware upgrades. But now, less than two weeks after the Pixel 10 series hit store shelves, its already pulled one of those AI features: Daily Hub, which collects the weather and your day’s calendar events, and recommends online content you might want to read, watch, or listen to.\nIn fairness to Google, Daily Hub was only ever in a “public preview,” rather than a full release, but that hadn’t stopped the company from advertising the phones with it. The company has now paused that preview, a spokesperson telling 9to5Google that it is “actively working to enhance its performance and refine the personalized experience.” Apparently Google will reintroduce “an improved Daily Hub when it’s ready.”\nThe public preview meant that Daily Hub hadn’t appeared on every Pixel 10 yet anyway — my 10 Pro XL press sample never got it. My colleague Allison did get to try Daily Hub, but going by her impressions it may be for the best that Google is pulling it for now:\nIf voice translation is halfway between a helpful feature and a gimmick, then Daily Hub leans even further into gimmick territory. It’s a lot like the Now Brief Samsung introduced on its S25 phones, and it’s supposed to act as a quick digest for your day as well as a place to find some inspiration based on your recent activity. It does the first part of that job just fine; it’s maybe a more longwinded version of Google’s At a Glance widget, which gives you a heads up on the weather and upcoming calendar events. But it also misconstrued some of my recent Google search history in puzzling and hilarious ways. I looked up the schedule for our recycling service, provided by Waste Management, and it took that to mean that I’m interested in learning more about waste management generally. Uh, not quite.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b3984b0d0eb2e510cdc51e291e349ccf3bdaca9",
      "title": "Israeli military orders all Gaza City residents to evacuate ahead of ground assault",
      "url": "https://www.bbc.com/news/articles/cvg47kvld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:48:49.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Netanyahu says recent strikes on high-rises are \"only the beginning of the main, intensive operation\" to capture the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd108b8d38083536704aaf2962a67aa8623601e1",
      "title": "Girl stabbed six times as she shielded sister from Southport attacker, inquiry hears",
      "url": "https://www.bbc.com/news/articles/c8exw9l1jxpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T11:42:38.000Z",
      "summary_90w": "",
      "raw": "An inquiry into the attacks hears the father of the girl fainted in shock when he saw his daughter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37bd6f92fab605d46fd7df9bbc18cce632af8f00",
      "title": "'No one is irreplaceable', says BBC chief after scandals",
      "url": "https://www.bbc.com/news/articles/cj07r78gg32o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T11:35:13.000Z",
      "summary_90w": "",
      "raw": "Tim Davie tells MPs he is \"not letting anything lie\" when it comes to rooting out abuses of power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec005248a3896bda17a53ced282d69a827255940",
      "title": "ICC hears war crimes case against Ugandan rebel leader",
      "url": "https://www.bbc.com/news/articles/c1kwe02vyvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:31:06.000Z",
      "summary_90w": "",
      "raw": "This is the court's first-ever confirmation of charges hearing without the accused present.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23860b3f9f961d5b7f8a07f1a387073adbdf2088",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "url": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T11:24:17.000Z",
      "summary_90w": "",
      "raw": "Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts\nEthiopia has officially inaugurated Africa’s largest hydroelectric dam, a project that will provide energy to millions of Ethiopians while deepening a rift with downstream Egypt that has unsettled the region.\nEthiopia, the continent’s second most populous nation with more than 120 million people, sees the $5bn (£3.7bn) Grand Ethiopian Renaissance dam (Gerd) on a tributary of the Nile River as central to its economic ambitions. The dam’s power has gradually increased since the first turbine was turned on in 2022, reaching its maximum capacity of 5,150MW on Tuesday. That puts it among the 20 biggest hydroelectric dams in the world – about one-quarter of the capacity of China’s Three Gorges dam.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What we know as 'birthday book' of messages to Epstein released",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T11:21:48.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7670773ff6a662e074e67b4f8c9b76ebc1af0af5",
      "title": "New Beats earbuds leak hours before Apple&#8217;s big event",
      "url": "https://www.theverge.com/news/774250/beats-powerbeats-fit-apple-wireless-earbuds-leak",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T11:00:20.000Z",
      "summary_90w": "",
      "raw": "Leaked images potentially give us a closer look at the Powerbeats Fit and its color-matched charging case.\t\n\nApple teased the upcoming Powerbeats Fit last month, and now renders and specifications for the sporty wireless earbuds have appeared online that give us a closer look at what to expect. According to trusted leaker Evan Blass, the new Beats earbuds will be available in four colorways — orange, gray, black, and pink — and provide up to 30 hours of battery life, or “7 hours per bud on one charge” without popping them back in the charging case.\nThe images of the Powerbeats Fit shared by Blass look similar to the $200 Beats Fit Pro earbuds that Apple launched in 2021, and they have several features in common. Both are powered by Apple’s H1 chip, have the same reported battery life, carry an IPX4 resistance to water splashes and sweat, and include a transparency mode and active noise cancellation. Leaks suggest that the Powerbeats Fit provides four ear customizable ear tip sizes instead of three, however.\n\n\n\n\nThe leaks don’t provide any information about price, wireless charging support, or case size. Apple is expected to announce some fitness-related upgrades for the AirPods Pro at today’s iPhone 17 event, according to Bloomberg’s Mark Gurman, so it would be odd for the Cupertino company to launch the Powerbeats Fit during the same show. The trailer that Apple released in August does say the new Beats will arrive in “Fall 2025” though, so we’ll have to wait and see.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1097d90ff1d8a06a7f69bf485cef26b33abb0a4a",
      "title": "Here's what happens when private equity buys homes in your neighborhood",
      "url": "https://www.npr.org/sections/planet-money/2025/09/09/g-s1-87699/private-equity-corporate-landlords",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T11:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes rents go down and neighborhood diversity go up? Corporate landlords. But they also make it harder to own for yourself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f98c627b1125d9bef41b5569afdb653d164a5dd",
      "title": "Inside Kyiv government building hit by missile strike",
      "url": "https://www.bbc.com/news/videos/cwyn3gnnvv3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:52:51.000Z",
      "summary_90w": "",
      "raw": "The BBC's Sarah Rainsford says Sunday's attack caused \"a huge amount of damage\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c63fc854760cd49ddbfdf29b8ca19ea8ccf6effb",
      "title": "Firefox launches ‘shake to summarize’ on iPhones",
      "url": "https://www.theverge.com/news/774129/firefox-shake-to-summarize-ios-ai-launch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T10:51:49.000Z",
      "summary_90w": "",
      "raw": "Firefox will soon let you shake your iPhone to get an AI-generated summary of the webpage you’re on. The feature rolls out this week, and will operate using Apple’s on-device AI model on the iPhone 15 Pro or newer once iOS 26 launches.\nOn older iOS versions, Mozilla will use its own cloud-based AI system to create summaries and insert them on top of the webpage. Along with shaking your phone, you can also access AI-generated summaries by tapping the “thunderbolt” icon in the address bar, or tapping the three dots at the bottom of your screen and selecting “Summarize page.”\nMozilla notes that you can turn off the feature at any time, in case you don’t want the browser to misinterpret a fumble of your phone as a summarization request. Shake to summarize will only work on webpages with fewer than 5,000 words.\nWith the launch, Firefox will become one of the first major third-party apps to roll out an integration with Apple Intelligence, which we may hear more about during today’s iPhone launch event. Shake to summarize is only available in the US and in English to start, but Mozilla plans on expanding it globally and to Android users in the future.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "884f0fdadc20fb40fb74d5521f0c61fd0ec3fece",
      "title": "Lachlan finally has control of Murdoch empire but deal is a win for sibling rivals",
      "url": "https://www.theguardian.com/media/2025/sep/09/lachlan-control-murdoch-empire-but-deal-win-sibling-rivals",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:49:06.000Z",
      "summary_90w": "",
      "raw": "Eldest son has succession Rupert craved after agreement for much higher payout to his brother and sisters\nAs a keen rock climber, Lachlan Murdoch knows a thing or two about the importance of clinging on to perilous terrain. After the toughest ascent of his life – rising to the top of his father’s business empire – he has finally ensured that his place at its summit is assured.\nThe deal Rupert Murdoch’s eldest son has struck with his oldest siblings, Prudence, Elisabeth and James, will mean they give up their shares in the family business, handing Lachlan the long-term control that he and his father craved.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a0679658bb58128631d353f76513f4692715ccf",
      "title": "SCOTUS lifts limits on LA raids. And, Nation's Report Card shows drops in scores",
      "url": "https://www.npr.org/2025/09/09/g-s1-87737/supreme-court-immigration-order-nations-report-card-jeffrey-epstein",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T10:45:19.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court on Monday issued an order clearing the way for agents to resume aggressive immigration sweeps in LA. And, a new Nation's Report Card shows drops in science, math and reading scores.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03800dcd45961592632aadf8171f7a8ad9e62f66",
      "title": "Mum of soldier who took her own life after sexual assault says army failing women",
      "url": "https://www.bbc.com/news/articles/cj9z079yedvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T10:34:45.000Z",
      "summary_90w": "",
      "raw": "Leighann McCready made the remarks after her daughter's superior pleaded guilty to sexual assault.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5283b72b4b3dc77b90e7a9179398fb64d74e4fff",
      "title": "Brittany Higgins ordered to pay 80% of Linda Reynolds’ legal costs after defamation ruling",
      "url": "https://www.theguardian.com/law/2025/sep/09/brittany-higgins-ordered-to-pay-80-per-cent-of-linda-reynolds-legal-costs-after-defamation-ruling-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:29:13.000Z",
      "summary_90w": "",
      "raw": "Total amount former Liberal staffer has been ordered to pay is not known but is expected to be in the order of hundreds of thousands of dollars\nBrittany Higgins has been ordered to pay 80% of her former boss Linda Reynold’s legal costs from their high-profile defamation fight.\nLast month, Western Australian supreme court judge Paul Tottle ruled the former defence minister’s reputation was damaged by a 2022 social media post from Higgins’ partner David Sharaz, which Higgins responded to, and an Instagram story published by Higgins in July 2023.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d49310a4774dd07c695df72f51a58c62721c752",
      "title": "Herald Sun failed to seek response from Victorian MP Sam Groth and wife before article that invaded privacy, court documents claim",
      "url": "https://www.theguardian.com/law/2025/sep/09/herald-sun-failed-to-seek-response-from-victorian-mp-sam-groth-and-wife-before-article-that-invaded-privacy-court-documents-claim",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:18:04.000Z",
      "summary_90w": "",
      "raw": "Groth and wife Brittany are suing a News Corp paper for defamation and breach of privacy over incorrect claims of inappropriate relationship\n\nGet our breaking news email, free app or daily news podcast\n\nThe Herald Sun failed to seek a response from Brittany Groth, the wife of Sam Groth, the Victorian Liberals deputy leader and former tennis star, before wrongly outing her as a victim of child sexual assault who was preyed upon by her now-husband when he was her coach, the couple allege in federal court documents.\nThe Herald and Weekly Times, along with reporter Stephen Drill, who wrote the articles, and his editor Sam Weir, are being sued in the federal court by Brittany Groth, in the first test of a new statutory tort for serious invasions of privacy, and by Sam Groth for defamation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drone, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:08:50.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says a fire was started but Tunisian authorities deny that a drone was involved.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f0fef5926ad08fac48daea9ee918216942349fa",
      "title": "Murdochs reach deal in succession battle over media empire",
      "url": "https://www.bbc.com/news/articles/cn825x71g4do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:01:36.000Z",
      "summary_90w": "",
      "raw": "Lachlan Murdoch will retain control of the conservative Fox and News Corp empire under the deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a886c17daaacd2076b3d1bab252074e492fd5504",
      "title": "Genki will pay Nintendo damages over 3D-printed Switch 2",
      "url": "https://www.theverge.com/news/774236/nintendo-switch-2-genki-lawsuit-settlement",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T09:50:10.000Z",
      "summary_90w": "",
      "raw": "The 3D-printed Switch 2 mockup that started Nintendo’s dispute with Genki.\t\n\nNintendo has settled the lawsuit it filed against accessory maker Genki over the Switch 2 mockup it showcased at CES before the console was officially revealed, and accessories it promoted using the Switch 2 name. Genki’s parent company, Human Things, will pay Nintendo an undisclosed amount of money in damages to close the case, according to a legal filing submitted on Monday, and has agreed to stop giving its products names that are “confusingly similar” to official Nintendo intellectual property.\nThe dispute began in January after Genki showed off an accurate 3D-printed Switch 2 mockup at CES, even including the console’s logo, days before it was officially launched by Nintendo. The company also began to promote its range of Switch 2 accessories before the console was announced. \nNintendo later filed a complaint against the accessory maker in May over alleged “trademark infringement, unfair competition, and false advertising.” Nintendo said it didn’t provide Genki with technical Switch 2 specifications, and alleged that Genki either “unlawfully or illicitly obtained an authentic Nintendo Switch 2” prior to the console’s public release, or “cannot claim compatibility with enough certainty to make its advertising claims in good faith.”\nThe financial terms of the settlement haven’t been disclosed. According to the settlement filing, Genki attests that it “did not obtain access to” a Switch 2 before the console’s launch announcement, and the origins of the 3D-printed dummy unit remain unclear.\nIn the original lawsuit filing, Nintendo said that Genki had also infringed its trademark by marketing third-party accessories and services using language that alluded to Nintendo’s IP, such as “Genki Direct,” and “Genki Glitch 2.” Nintendo accused Genki of “taking advantage of the trust and loyalty that Nintendo fans have for the Nintendo brand and mark and causing actionable harm.”\nGenki is still permitted to reference Nintendo branding in its own products in a “nominative fair use manner” under the new settlement agreement, but only when the company is making verified compatibility claims or to clarify its affiliation with Nintendo products as a third-party accessory producer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9378e09d87d3a68b88f425c5d0382e5eee98f44a",
      "title": "At least 10 dead after train crashes into bus in Mexico",
      "url": "https://www.bbc.com/news/articles/c98elewrepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T09:40:09.000Z",
      "summary_90w": "",
      "raw": "An investigation is under way after a freight train hit a bus as it tried to cross railway tracks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80cacd185f401482f16a89cf540cc816cf4c055e",
      "title": "England's NHS trust league tables revealed - find out where yours ranks",
      "url": "https://www.bbc.com/news/articles/cq8eqxlypv7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:31:06.000Z",
      "summary_90w": "",
      "raw": "The new league tables score trusts on measures including finances and patient access to care.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Plans to cool Arctic using geo-engineering are dangerous, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T09:06:36.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T09:06:36.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "883f4a246f561302b52cd8c0affb12da42603567",
      "title": "A new Nation's Report Card shows drops in science, math and reading scores",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5526918/nations-report-card-scores-reading-math-science-education-cuts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "It's the first Nation's Report Card since the Trump administration began making cuts to the U.S. Education Department. The scores reflect the state of student achievement in early 2024.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "162eb2b9071ee33cfd104f166bed1ac3bfedcc19",
      "title": "Here they are: The best student podcasts in America",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527245/npr-best-student-podcast-finalists-announced",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For the 2025 NPR Student Podcast Challenge, we've listened to nearly 2,000 entries from around the U.S., and narrowed them down to 11 middle school and 10 high school finalists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4b6d0cfc3efd3305fc212dd0f8fd6bb97946c69",
      "title": "The 2025 Student Podcast Challenge Honorable Mentions",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5530068/npr-student-podcast-honorable-mentions",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Here are the honorable mentions from this year's Student Podcast Challenge, chosen from nearly 2,000 entries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd7c758a34583ff078b17c7753f87703239c97ee",
      "title": "Trump's Medicaid cuts will hurt children's hospitals",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/09/nx-s1-5532133/medicaid-children-hospital-closure",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The GOP said its overhaul of Medicaid was aimed at reducing fraud and getting more adult beneficiaries to work. Among the likely side effects: fewer services and doctors for treating sick children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4908a9e47356afa8eac588b20a065e2900a7b343",
      "title": "Norway's left clinches vote win as populist right surges into second place",
      "url": "https://www.bbc.com/news/articles/cq65255l27qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T07:38:58.000Z",
      "summary_90w": "",
      "raw": "Labour has a chance of forming a narrow majority if it secures the support of four smaller parties on the centre left.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8d88eadd40bf7553df55ac7237b44d4b8733ff7",
      "title": "Thai court rules ex-PM Thaksin must serve one year in jail",
      "url": "https://www.bbc.com/news/articles/cly7k2g37g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:41:09.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court ruling is yet another blow to the influential Shinawatra political dynasty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2670574a8272c6c3c057ad7a3550b5a737ca7ad2",
      "title": "Mystery donor offers £100k to find student who went missing after house party",
      "url": "https://www.bbc.com/news/articles/c04qpd7y9k0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T06:26:49.000Z",
      "summary_90w": "",
      "raw": "Mother of Jack O’Sullivan, who disappeared in Bristol in March 2024, says she is \"overcome\" by the offer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9448aa73221d75321a7cae4cc340fbb464b4943",
      "title": "NZ 'suitcase murder': Anti-depressants found in children's bodies",
      "url": "https://www.bbc.com/news/articles/c1wgqpx3q1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:07:00.000Z",
      "summary_90w": "",
      "raw": "A jury heard Hakyung Lee killed her children in an attempted mass suicide after her husband's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a91ffb88860b2e5501809d16529913f88990ffa",
      "title": "OpenAI denies that it’s weighing a ‘last-ditch’ California exit amid regulatory pressure over its restructuring",
      "url": "https://techcrunch.com/2025/09/08/openai-denies-that-its-weighing-a-last-ditch-california-exit-amid-regulatory-pressure-over-its-restructuring/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T06:00:44.000Z",
      "summary_90w": "",
      "raw": "OpenAI executives are discussing a potential relocation out of California as increasing political resistance threatens the company's efforts to convert from nonprofit to for-profit status, according to The WSJ, but the company says it has no plans to leave.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "83f906f4662e83c5b37b257d2f6e27a91a64590c",
      "title": "Early deaths of people with learning disabilities 'shocking'",
      "url": "https://www.bbc.com/news/articles/c2ezpx1mjz8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T05:23:02.000Z",
      "summary_90w": "",
      "raw": "People with learning disabilities die 20 years younger than those without, data shows.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5d4822128c386a9f0c7261f8ddcc47754d22fe9",
      "title": "'Spotlight on Tuchel for Serbia test after drab displays'",
      "url": "https://www.bbc.com/sport/football/articles/c864wqezwgeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T05:17:26.000Z",
      "summary_90w": "",
      "raw": "Thomas Tuchel will face his toughest test as England coach against Serbia in the intimidating surroundings of Belgrade, says chief football writer Phil McNulty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "395a71d5756b62daffaf2437379978028d58fa54",
      "title": "Nepal's prime minister resigns after protests against corruption and social media ban",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5534953/nepal-social-media-ban-protests",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T05:15:16.000Z",
      "summary_90w": "",
      "raw": "Nepal's prime minister resigned Tuesday following violent protests against a ban on social media platforms and government corruption.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8b037c914d28c3309adcc2e0ab496280dae9501",
      "title": "Thailand's former PM Thaksin Shinawatra to serve one-year prison term",
      "url": "https://www.npr.org/2025/09/09/g-s1-87726/thailands-former-pm-to-serve-one-year-prison-term",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T05:11:37.000Z",
      "summary_90w": "",
      "raw": "Thailand's Supreme Court said former Prime Minister Thaksin Shinawatra must serve a one-year prison term for previous convictions on graft and abuse of power charges.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53f7cf59560f7117b1eaaa939e955ca17f5be1ee",
      "title": "'I'm angry. It's not right' - locals want asylum hotels shut, but are shared houses the answer?",
      "url": "https://www.bbc.com/news/articles/c07vn1y2jz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T05:05:09.000Z",
      "summary_90w": "",
      "raw": "The BBC's UK editor, Ed Thomas, meets local people and asylum seekers in two towns in north-west England.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2490d90ed4ec14bc10563301cb4cba1d28932c4",
      "title": "First photos of site where NZ bushman hid children released",
      "url": "https://www.bbc.com/news/articles/cj4y9ev2rw4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T04:32:15.000Z",
      "summary_90w": "",
      "raw": "Police also found a stash of firearms and ammunition at the campsite surrounded by dense vegetation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:30:18.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56bb7bae5d6fad8a89cc779a183e2d37e0cfa7c1",
      "title": "Images of Tom Phillips’ remote campsite revealed a day after fugitive father shot dead by New Zealand police",
      "url": "https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:06:31.000Z",
      "summary_90w": "",
      "raw": "After four years on the run with their father, Phillips’ three children have all been located and are ‘doing well under the circumstances’, say authorities\nPolice in New Zealand have released images and given details of the campsite where two of fugitive Tom Phillips’ children were found, after their father was shot and killed by police on Monday.\nPhillips had spent nearly four years hiding in the wilderness with his children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio. A police officer is recovering in hospital after being shot in the head by Phillips with a high-powered rifle in the standoff. About 11 hours after Phillips was killed, two of his children were found safe and well at the campsite in Waitomo. It is understood the third child was with Phillips at the time of the shooting.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23e35f7db1c283818bc5dea8bc387c31b4b3f939",
      "title": "Majority in EU’s biggest states believes bloc ‘sold out’ in US tariff deal, poll finds",
      "url": "https://www.theguardian.com/world/2025/sep/09/majority-in-eu-biggest-states-believes-bloc-sold-out-in-us-tariff-deal-poll-donald-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:00:04.000Z",
      "summary_90w": "",
      "raw": "Average of 77% of respondents across five countries thought agreement would benefit US economy above all\n\nWhere there’s a will there’s a whey: cheese producers lean into their craft as Trump tariffs bite\n\nA majority of people across the EU’s five biggest member states believe the European Commission sold citizens out when negotiating a “humiliating” tariff deal with Donald Trump that “benefits the US” far more than Europe, a survey has shown.\nThe poll, by Cluster17 for the European affairs debate platform Le Grand Continent, found 77% of respondents – ranging from 89% in France to 50% in Poland – thought the deal would benefit above all the US economy, with only 2% believing it would benefit Europe’s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b703755c4b7eabbcee3cd4468ade009c75fa330",
      "title": "ReOrbit lands record funding to take on Musk’s Starlink from Europe",
      "url": "https://techcrunch.com/2025/09/08/reorbit-lands-record-funding-to-take-on-musks-starlink-from-europe/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T04:00:00.000Z",
      "summary_90w": "",
      "raw": "Finnish startup ReOrbit, has raised a record €45 million Series A for the country to offer \"sovereign\" satellites.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e885b26374e2e1a7c2df2a7662a3102da62977e",
      "title": "Children's TV favourite Bagpuss to reawaken for new film",
      "url": "https://www.bbc.com/news/articles/crrjwlvxknko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T03:49:19.000Z",
      "summary_90w": "",
      "raw": "It will be the first new official Bagpuss production since the original beloved 1974 series.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9c3a0236f927641e6db05e0406c38080ddf720b",
      "title": "Nepal reverses social media ban as protests turn deadly",
      "url": "https://techcrunch.com/2025/09/08/nepal-reverses-social-media-ban-as-protests-turn-deadly/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T02:46:32.000Z",
      "summary_90w": "",
      "raw": "Nepal has reversed its social media ban following nationwide “Gen Z” protests and public backlash.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "147c78ae34acd5af2cea59dec8203925f78475c2",
      "title": "Snap breaks into ‘startup squads’ as ad revenue stalls",
      "url": "https://techcrunch.com/2025/09/08/snap-breaks-into-startup-squads-as-ad-revenue-stalls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T01:41:29.000Z",
      "summary_90w": "",
      "raw": "CEO Evan Spiegel just announced the company is restructuring around small \"startup squads\" of 10 to 15 people to regain agility against larger competitors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e419c27835ff71dba478ad124f9f55059b51218",
      "title": "Anastacia: Arnold Schwarzenegger made me sing Whatta Man 12 times",
      "url": "https://www.bbc.com/news/articles/cm2zmd2rmnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T00:34:21.000Z",
      "summary_90w": "",
      "raw": "As she celebrates 25 years in music, Anastacia reflects on the gigs she played on her way to the top.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d033bcc9ad5bb685bd656044f345a264761ab17",
      "title": "Ferrari chair to do community service over tax case",
      "url": "https://www.bbc.com/news/articles/c8d7q99yd06o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T23:36:20.000Z",
      "summary_90w": "",
      "raw": "John Elkann and two of his siblings will pay €183m to settle an Italian inheritance tax dispute.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "155df79d28b8da08f017e8949ccab6e6f964e23a",
      "title": "Intel’s chief executive of products departs among other leadership changes",
      "url": "https://techcrunch.com/2025/09/08/intels-chief-executive-of-products-departs-among-other-leadership-changes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T23:22:13.000Z",
      "summary_90w": "",
      "raw": "Intel also announced the creation of a central engineering group that will build custom chips for outside customers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "799f90d88d736597fd15a6f56375e5f9adac8607",
      "title": "Why monsoon rains have been so deadly in India this year",
      "url": "https://www.bbc.com/news/articles/c9wdr08wq2zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T23:02:59.000Z",
      "summary_90w": "",
      "raw": "Rains have caused landslides and severe floods in parts of the country and killed hundreds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b45f71bd0d4434e329f1a7582f49345f5ea27376",
      "title": "Netskope follows Rubrik as a rare cybersecurity IPO, both backed by Lightspeed",
      "url": "https://techcrunch.com/2025/09/08/netskope-follows-rubrik-as-a-rare-cybersecurity-ipo-both-backed-lightspeed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T22:35:58.000Z",
      "summary_90w": "",
      "raw": "The 13-year-old company could be valued up to $6.5, with Lightspeed's stake worth $1.1 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e7bdd6eaed851d83fad68838ffde10c22f82194",
      "title": "Sam Altman says that bots are making social media feel ‘fake’ ",
      "url": "https://techcrunch.com/2025/09/08/sam-altman-says-that-bots-are-making-social-media-feel-fake/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T22:24:42.000Z",
      "summary_90w": "",
      "raw": "After watching Reddit's OpenAI and Anthropic communities, Sam Altman thinks social media cannot be trusted. And bots are to blame.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "768a99f32c2e96d24ab1cbd17c348c89f1f24e96",
      "title": "He's accused of trying to assassinate Trump. At trial, he's going it alone",
      "url": "https://www.bbc.com/news/articles/ckgz1m43rrko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T22:20:42.000Z",
      "summary_90w": "",
      "raw": "The 59-year-old, charged with attempting to assassinate President Trump last September, is representing himself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09724871117da7d410f0dcdf709e3e32ed2b89fa",
      "title": "Japan is set to choose its fourth PM in five years - who could be next?",
      "url": "https://www.bbc.com/news/articles/c62l9488ljlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T22:00:24.000Z",
      "summary_90w": "",
      "raw": "Japan's next leader will face the challenge of steering a much weakened government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ff7d0ae6b0ad92379a6a92fb68a56e144619179",
      "title": "Graham Linehan: I don't regret my online posts",
      "url": "https://www.bbc.com/news/articles/c7v13v3z6lgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T21:50:24.000Z",
      "summary_90w": "",
      "raw": "The Father Ted writer tells the BBC he stands by his online posts which led to his arrest last week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9026360bcc7e6ed920a98c5f98da5555c22cc956",
      "title": "Norway’s Labour party wins election after seeing off populist surge",
      "url": "https://www.theguardian.com/world/2025/sep/08/norways-labour-party-holds-narrow-lead-in-early-election-results",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T21:48:16.000Z",
      "summary_90w": "",
      "raw": "Success for party of the prime minister, Jonas Gahr Støre, despite increased support for rightwing Progress party\nThe Norwegian Labour party has secured four more years in government after seeing off a surge of support for the populist right in a polarised election.\nSoon after the polls closed, the centre left was projected to win with 89 seats with the centre right taking 80 seats. A minimum of 85 seats are needed for a majority.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6dade64ae52995623a9e2f23eec4082f04e47baa",
      "title": "Supreme Court lifts limits on  LA immigration raids",
      "url": "https://www.bbc.com/news/articles/c784697j2v8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T21:41:45.000Z",
      "summary_90w": "",
      "raw": "US top court says that immigration agents can stop people based solely on their race, language or job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "cd7e90fb966332f5f805b60b07148863dc561793",
      "title": "As it happened: result of Norwegian election ‘very close’ but centre-left in lead – expert",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T21:00:40.000Z",
      "summary_90w": "",
      "raw": "Latest projection gives leftwing bloc 91 seats in the next parliament, with the rightwing bloc at 78 \nAnd over in Brussels, EU diplomats have been briefing journalists that the European Commission is expected to propose a 19th package of sanctions against Russia by Friday, Reuters said.\nThe EU has stepped up its listings and is no longer shying away from larger entities in third countries, and it could list banks in two central Asian countries too, they said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "183b8505fd7b8d0ed2a61c100453fb49e988cfde",
      "title": "Nuclear startup Deep Fission goes public in a curious SPAC",
      "url": "https://techcrunch.com/2025/09/08/nuclear-startup-deep-fission-goes-public-in-a-curious-spac/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T20:08:40.000Z",
      "summary_90w": "",
      "raw": "Deep Fission had been seeking to raise $15 million in a seed round as recently as April. The reverse merger will raise twice that amount.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4e59ecbb09ee262d68d28ba9381e230caf448a2",
      "title": "Bluesky adds private bookmarks",
      "url": "https://techcrunch.com/2025/09/08/bluesky-adds-private-bookmarks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:40:51.000Z",
      "summary_90w": "",
      "raw": "Bluesky adds bookmarks so users can privately save posts they want to reference later.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25f982df2e2580e919595928cf39a91343c5bbe1",
      "title": "Pinecone founder Edo Liberty discusses why the next big AI breakthrough starts with search, at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/08/pinecone-founder-edo-liberty-explores-the-real-missing-link-in-enterprise-ai-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:14:54.000Z",
      "summary_90w": "",
      "raw": "At TechCrunch Disrupt 2025, Pinecone founder and CEO Edo Liberty will explain why the next wave of AI-native apps won’t be driven by bigger models, but by smarter search.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b0234c13e045c72b51441218866187c608f46afa",
      "title": "Flexport’s Ryan Petersen on building through chaos at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/08/find-out-how-flexports-ceo-ryan-petersen-builds-when-the-rules-keep-changing-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Ryan Petersen, CEO of Flexport, joins the Builders Stage at TechCrunch Disrupt 2025, happening October 27–29 at Moscone West in San Francisco. Register to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "840fe00600871b36a43d4bf94b047982c8ad2543",
      "title": "Space DOTS raises $1.5M seed round to provide insights on orbital threats",
      "url": "https://techcrunch.com/2025/09/08/space-dots-raises-1-5m-seed-round-to-provide-insights-on-orbital-threats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Cefalo is the founder of Space DOTs, which launched in 2022 to detect space threats. She and her team have created a software platform for space tech manufacturers and operators to help them capture various data points, like radiation interference, as well as track any in-orbit anomalies, to help make space travel safer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a912e32943d6d8acd400c127c35db03a6fe6ed61",
      "title": "VC giant Insight Partners notifies staff and limited partners after data breach",
      "url": "https://techcrunch.com/2025/09/08/vc-giant-insight-partners-notifies-staff-and-limited-partners-after-data-breach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T18:56:04.000Z",
      "summary_90w": "",
      "raw": "The venture capital giant, behind cyber giants Wiz and Databricks, said it has notified current and former employees and the firm's limited partners of its January breach.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9e638cc06c9c11ca28a9c3d84978e1179a7a84aa",
      "title": "Cognition AI defies turbulence with a $400M raise at $10.2B valuation",
      "url": "https://techcrunch.com/2025/09/08/cognition-ai-defies-turbulence-with-a-400m-raise-at-10-2b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T18:49:04.000Z",
      "summary_90w": "",
      "raw": "Founders Fund, the Peter Thiel-backed VC, led Cognition’s latest round, with participation from existing investors like Lux Capital, Joe Lonsdale’s 8VC, Elad Gil, Definition Capital and Swish Ventures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dab73e39c5bb303e1b75e9c36bb838ce1c73e023",
      "title": "Google’s AI Mode adds 5 new languages including Hindi, Japanese, and Korean",
      "url": "https://techcrunch.com/2025/09/08/googles-ai-mode-adds-5-new-languages-including-hindi-japanese-and-korean/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T18:46:10.000Z",
      "summary_90w": "",
      "raw": "Google's AI Mode is rolling out in Hindi, Indonesian, Japanese, Korean, and Brazilian Portuguese.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e04a43f51845386c2aa2ce3b2add249a232808b5",
      "title": "Boris Johnson was paid £240,000 after Maduro meeting, invoice shows",
      "url": "https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:12:48.000Z",
      "summary_90w": "",
      "raw": "Johnson’s office sent invoice to hedge fund manager, which was paid, weeks after meeting Venezuelan leader last year\n\nRevealed: how Boris Johnson traded PM contacts for global business deals\n\nFrom a private jet somewhere over the Caribbean Sea in February last year, Boris Johnson called his old political adversary David Cameron, then the foreign secretary, to notify him of a visit.\nJohnson had taken a day out from a family holiday in the Dominican Republic for an unlikely meeting with the leftwing president of Venezuela, Nicolás Maduro, a man whom Johnson, when in office, had likened to a “dictator of an evil regime”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6704df640f109d4d73f3b7ac2af32314dac23f3f",
      "title": "When was the last enjoyable England World Cup qualifier?",
      "url": "https://www.bbc.com/sport/football/articles/ckgqzkx4x9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T18:10:13.000Z",
      "summary_90w": "",
      "raw": "As England prepare to face Serbia on Tuesday, BBC Sport's Phil McNulty looks at why there is often a lack of entertainment in World Cup qualifiers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cd7c4e39cfd0f683f4b2cf54a484029416907d1",
      "title": "Hamas discussing US 'ideas' for Gaza ceasefire after Trump's 'last warning'",
      "url": "https://www.bbc.com/news/articles/cn0rxl7jwwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T18:08:14.000Z",
      "summary_90w": "",
      "raw": "Hamas says it received \"some ideas\" from the US through mediators on how to reach a Gaza ceasefire deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "Why has the French PM had to go and what happens next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T17:18:52.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has lost a confidence vote, sending parliament into another period of chaos and uncertainty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8ffabc41a1ce9e91f468dc28e2cd39800eb6703",
      "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
      "url": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:44:16.000Z",
      "summary_90w": "",
      "raw": "President touted contest in Buenos Aires province – 40% of electorate – as ‘life or death battle’ but won only 34% of vote\nArgentina’s president, Javier Milei, has suffered his worst electoral defeat since taking office, as he faces his administration’s most serious corruption scandal and signs that the economy is slowing.\nIn local legislative elections on Sunday for Buenos Aires province – home to almost 40% of the country’s electorate – the coalition led by the self-styled anarcho-capitalist was beaten by the opposition by 47% to 34%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf8c157d26916af75c042b4ff5a1bc9aefc11af3",
      "title": "Six Israelis killed by Palestinian gunmen at Jerusalem bus stop",
      "url": "https://www.bbc.com/news/articles/cr70ny0l7vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:09:39.000Z",
      "summary_90w": "",
      "raw": "Israeli police say two gunmen were killed after the attack, which was one of the deadliest in the city in years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2bfa8a49cb354c3797aa48d4697c88c17ce4eb85",
      "title": "Lisbon funicular crash victim was 'transport enthusiast'",
      "url": "https://www.bbc.com/news/articles/cq8ev844egpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:08:20.000Z",
      "summary_90w": "",
      "raw": "Sixteen people died when the funicular crashed into a building in the Portuguese capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62ac98efb11351751752e1c7bd3ed059cc97c277",
      "title": "French doctor goes on trial for poisoning 30 patients, 12 fatally",
      "url": "https://www.bbc.com/news/articles/crl5ngj9zwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T11:00:18.000Z",
      "summary_90w": "",
      "raw": "Frédéric Péchier, considered by colleagues to be a highly-talented practitioner, maintains there is no proof of any poisoning.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8090bee0b7bbd41ad9c10cbe8d3aa6af2166b744",
      "title": "World Cup ticket sales are about to begin. Scoring them may not be easy — or cheap",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529273/fifa-world-cup-2026-ticket-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "FIFA is set to launch the first window of regular ticket sales for the 2026 World Cup on Wednesday. Brace yourself: because they may not be easy to get — or cheap.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "92c6e3934c891244053cede02b47ac3dd9bb0119",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:01:03.000Z",
      "summary_90w": "",
      "raw": "Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said\nA fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.\nThe whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2c05487bf4009e970ec540a06f48f1e758431b5",
      "title": "Fugitive father shot dead by police – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T06:17:21.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. Our full report is here: Tom Phillips shot dead after attempted burglary, NZ police confirm\nThe mayor of Waitomo, John Robertson, told the Guardian this morning’s events were the worst possible outcome for the community.\n“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.\nSo it’s just devastating news. Really the worst outcome we could have expected.\nNo day that goes by that I don’t think about all four of them.\nIt hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ddfbb3dc5f62c8ce222017e5bcb40503f190088",
      "title": "Huge drugs bust reveals battles on cocaine 'superhighway'",
      "url": "https://www.bbc.com/news/articles/c5yvplyrrwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T05:02:40.000Z",
      "summary_90w": "",
      "raw": "An audacious attempt to smuggle tonnes of cocaine was stopped, but pressure from drug cartels remains.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "560ce79c5ad9c75d0a13333406a1f6952e60334e",
      "title": "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533207/carlos-alcaraz-trump-us-open-tennis-rolex",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T00:37:01.000Z",
      "summary_90w": "",
      "raw": "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "eb321a5ec31ad66b516c657d96408e9d9bbd9c25",
      "title": "More than 90,000 Jeep Grand Cherokees recalled over potential loss of drive power",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533180/jeep-grand-cherokee-recall-plug-in-hybrid",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T23:24:34.000Z",
      "summary_90w": "",
      "raw": "Vehicles impacted by the recall include 2022 to 2026 plug-in hybrid electric models of the Jeep Grand Cherokee.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dbad04708a3dc7972c447fc4ea8545ac9955e61d",
      "title": "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "url": "https://www.bbc.com/news/articles/c5yqg0rln74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T23:14:55.000Z",
      "summary_90w": "",
      "raw": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fb66623af50785279079c5a85f4b29f2fddd222",
      "title": "Postal traffic to U.S. drops over 80% after trade exemption rule ends, U.N. agency says",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533121/postal-traffic-to-us-drops-more-than-80-after-trade-exemption-rule-ends-un-agency-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T17:54:41.000Z",
      "summary_90w": "",
      "raw": "The de minimis rule that allowed small packages worth less than $800 to be exempt from tariffs ended on Aug. 29.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "922661201adabb2ad3a56d0e6c944b1f248a80d3",
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:56:23.000Z",
      "summary_90w": "",
      "raw": "Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers\nThe Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.\n“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military strike against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0821bfdb2476b823c1947bf67d7f1ab6c7c26f63",
      "title": "Has Labour Just Moved Towards the Right?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1cyhy?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:54:00.000Z",
      "summary_90w": "",
      "raw": "With Angela Rayner out, is Keir Starmer’s government more right wing?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69ee372a67aefdd9ae7a23bc1be9ab19f8761145",
      "title": "LGBTQ+ Americans consider move to Canada to escape Trump: ‘I’m afraid of living here’",
      "url": "https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T10:00:17.000Z",
      "summary_90w": "",
      "raw": "LGBTQ+ people in the US contemplate heading north as they wrestle with the president’s assault on the community\nThe number of LGBTQ+ Americans inquiring about moving to Canada has soared since Donald Trump’s re-election, campaigners have said, as people across the US wrestle with the fallout of rising anti-gay rhetoric, anti-trans executive orders, and the more than 600 bills targeting LGBTQ+ rights.\n“So much is happening in the US right now and a lot of it is terrifying,” said Latoya Nugent of Rainbow Railroad, a North American charity that helps LGBTQI+ individuals escape violence and persecution in their home countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "febb535b7ba16857aa2cf831ebebac7cc2367a85",
      "title": "South Korea charters plane to fly home over 300 workers detained by ICE at Georgia Hyundai plant",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532604/hyundai-immigration-raid-georgia-south-korea",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T19:38:32.000Z",
      "summary_90w": "",
      "raw": "On Sunday, South Korean officials said they would send a plane to bring the detained workers home. Earlier, South Korea's Foreign Minister said his nation was \"deeply concerned\" by the arrests.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5dbb34225979e86522cc6f2fb9796eb6e48b92aa",
      "title": "The Global Story: The deal that broke Ukraine's trust",
      "url": "https://www.bbc.co.uk/programmes/w3ct714l?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "An exploration of the 1994 Budapest Memorandum, intended to enshrine Ukraine's security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "673bb3efe1c54a50e50b0d3cac69138b47323da5",
      "title": "From building dream careers to losing everything",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002d2kp/footballs-financial-shame-the-story-of-the-v11?at_mid=OgibwZ9HpE&at_campaign=Footballs_Financial_Shame_The_Story_of_the_V11&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002d2kp&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Footballs_Financial_Shame_The_Story_of_the_V11&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Unveiling a hidden scandal affecting a group of former players of the Premier League",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}