{
  "version": "1757626144039",
  "generatedAt": "2025-09-11T21:29:04.039Z",
  "items": [
    {
      "id": "06ab44a741158dfe19ee196c133e20e6f30358d0",
      "title": "Australia news live: Albanese faces tough Pacific talks on climate as North West Shelf gas decision looms",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T21:08:46.000Z",
      "summary_90w": "",
      "raw": "Australia urged to to start getting ‘serious’ about cutting its fossil fuel production. Follow the latest news updates live\n\nGet our breaking news email, free app or daily news podcast\n\nGood morning, and thanks to Martin Farrer for getting the blog rolling. Nick Visser here to take the reins. Let’s dive in.\nNSW wild weather ‘just the beginning’, says SES chief\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b47960ae22f59181545b136fe55825ca24993bd3",
      "title": "The music industry is broken. OpenWav’s new app aims to change that",
      "url": "https://techcrunch.com/2025/09/11/the-music-industry-is-broken-openwavs-new-app-aims-to-change-that/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T21:07:23.000Z",
      "summary_90w": "",
      "raw": "OpenWav is building a direct-to-fan platform for music artists which lets them keep more of the profits.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ab9f3d9084557de62008f0f64e4d305a606b5a2",
      "title": "Aligning those who align AI, one satirical website at a time",
      "url": "https://www.theverge.com/ai-artificial-intelligence/776752/center-for-the-alignment-of-ai-alignment-centers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T20:24:32.000Z",
      "summary_90w": "",
      "raw": "The work of creating artificial intelligence that holds to the guardrails of human values, known in the industry as alignment, has developed into its own (somewhat ambiguous) field of study rife with policy papers and benchmarks to rank models against each other. \nBut who aligns the alignment researchers? \nEnter the Center for the Alignment of AI Alignment Centers, an organization purporting to coordinate thousands of AI alignment researchers into “one final AI center singularity.”\nAt first glance, CAAAC seems legitimate. The aesthetics of the website are cool and calming, with a logo of converging arrows reminiscent of the idea of togetherness and sets of parallel lines swirling behind black font. \nBut stay on the page for 30 seconds and the swirls spell out “bullshit,” giving away that CAAAC is all one big joke. One second longer and you’ll notice the hidden gems tucked away in every sentence and page of the fantasy center’s website. \nCAAAC launched Tuesday from the same team that brought us The Box, a literal, physical box that women can wear on dates to avoid the threat of their image being turned into AI-generated deepfake slop. \n“This website is the most important thing that anyone will read about AI in this millenium or the next,” said CAAAC cofounder Louis Barclay, staying in character when talking to The Verge. (The second founder of CAAAC wished to remain anonymous, according to Barclay.) \nCAAAC’s vibe is so similar to AI alignment research labs — who are featured on the website’s homepage with working links to their own websites — that even those in the know initially thought it was real, including Kendra Albert, a machine learning researcher and technology attorney, who spoke with The Verge. \nCAAAC makes fun of the trend, according to Albert, of those who want to make AI safe drifting away from the “real problems happening in the real world” — such as bias in models, exacerbating the energy crisis, or replacing workers — to the “very, very theoretical” risks of AI taking over the world, Albert said in an interview with The Verge. \nTo fix the “AI alignment alignment crisis,” CAAAC will be recruiting its global workforce exclusively from the Bay Area. All are welcome to apply, “as long as you believe AGI will annihilate all humans in the next six months,” according to the jobs page. \nThose who are willing to take the dive to work with CAAAC — the website urges all readers to bring their own wet gear — need only comment on the LinkedIn post announcing the center to automatically become a fellow. CAAAC also offers a generative AI tool to create your own AI center, complete with an executive director, in “less than a minute, zero AI knowledge required.” \nThe more ambitious job seeker applying to the “AI Alignment Alignment Alignment Researcher” position will, after clicking through the website, eventually find themselves serenaded by Rick Astley’s “Never Gonna Give You Up.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0595bf256056c6f01d5bfec2089fcd7b04c3098d",
      "title": "Tesla’s robotaxi plans for Nevada move forward with testing permit",
      "url": "https://techcrunch.com/2025/09/11/teslas-robotaxi-plans-for-nevada-move-forward-with-testing-permit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T20:20:24.000Z",
      "summary_90w": "",
      "raw": "Tesla can now test its autonomous vehicle technology on public streets in Nevada, but it still has steps to take if it wants to offer paid rides like in Austin, Texas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67c75a7bf79565af92ac79e434d73cba209d663b",
      "title": "Bolsonaro's coup trial gripped Brazil - and his conviction will divide the country",
      "url": "https://www.bbc.com/news/articles/cj3yekj2xygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T20:18:21.000Z",
      "summary_90w": "",
      "raw": "The ex-president's conviction is a milestone critics will welcome, though his punishment remains unclear.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5089ba65629ea72f0e3c5789795210fd0ff96bf7",
      "title": "Archaeologists scramble to evacuate Gaza artefacts threatened by Israeli strike",
      "url": "https://www.theguardian.com/world/2025/sep/11/antiquities-evacuated-from-gaza-city-storehouse-ahead-of-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T20:17:31.000Z",
      "summary_90w": "",
      "raw": "Officials hurriedly remove nearly three decades of finds in ‘high-risk operation’\nAn official in charge of nearly three decades of archaeological finds in Gaza has described how the artefacts were hurriedly evacuated from a Gaza City building threatened by an Israeli strike.\n“This was a high-risk operation, carried out in an extremely dangerous context for everyone involved – a real last-minute rescue,” said Olivier Poquillon, director of the French Biblical and Archaeological School of Jerusalem (EBAF), which housed the relics.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48325f7c342267064f6620c68e99831f72873548",
      "title": "Sony’s InZone Buds are great for gaming, and right now they’re cheaper than ever",
      "url": "https://www.theverge.com/tech/776630/sony-inzone-buds-samsung-music-frame-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T20:08:31.000Z",
      "summary_90w": "",
      "raw": "The wireless earbuds can connect to everything from the PS5 to the Steam Deck and Nintendo Switch 2. | Image: The Verge\t\n\nA quality pair of headphones can make a huge difference in your gaming experience, and Sony’s InZone Buds are among the best wireless gaming earbuds available. They’re currently $143.98 ($86 off) at GameStop, dropping them to a new all-time low price. The Verge’s commerce editor, Cameron Faulkner, says they deliver excellent sound quality and versatility, with a USB-C audio transmitter that allows them to connect to everything from a PlayStation 5 to a Steam Deck and a Nintendo Switch 2.\nSony InZone Buds\nSony’s wireless gaming buds offer low latency, active noise cancellation, and support for both Bluetooth and USB-C.\n\nWhere to Buy:\n\n $229.99 $143.98 at GameStop\n $229.99 $198 at Best Buy\n\nSony’s InZone Buds offer many of the same features as the company’s flagship earbuds, the WF-1000XM5, which remain our favorite overall earbuds. They use the same drivers, and they borrow the XM5’s active noise cancellation and mic transparency capabilities. Additionally, they offer up to 12 hours of battery life on a single charge, or a total of 24 hours with the charging case (which can fit the USB-C transmitter).\nThe InZone Buds feature multiple sizes of silicone ear tips, and if you have a PC, Sony’s InZone app can perform a sound test to help you choose the right ear tip for your inner ear shape. If you struggle to find a comfortable fit, a feature like this can be seriously useful. The earbuds also include a microphone, plus touch gestures for muting the mic, adjusting the volume of your audio, and toggling between noise cancellation settings — all of which can be customized via the InZone app.\nOther deals worth checking out\nIf you’re looking for something to charge your phone, wireless earbuds, and smartwatch, the Anker MagGo Wireless Charging Station is down to $65.99 ($45 off) at Amazon. The Qi2 charger features a tree-like design, with three different charging areas. The main charging pad delivers up to 15W to a phone, while a second charging pad can quickly replenish the Apple Watch. Meanwhile, the base features a pad for wireless earbuds. The 3-in-1 charging station comes with a 40W USB-C PD wall charger and a USB-C cable, so you won’t need to buy any additional accessories to start charging your devices.\nPreorders for the upcoming Teenage Mutant Ninja Turtles Trilogy 4K release are now live, with a prelaunch discount of $70 ($30 off) at Amazon. The trilogy includes the original live-action Teenage Mutant Ninja Turtles, Teenage Mutant Ninja Turtles II: The Secret of the Ooze, and Teenage Mutant Ninja Turtles III. The first TMNT movie from 1990 is still the best one 35 years later, with turtle costumes from Jim Henson’s Creature Shop that still hold up. I remember watching it as a kid and being completely terrified by the building fire fight scene.\nThe Samsung Music Frame is currently down to an all-time low price of $127.99 ($260 off) at Amazon and B&H Photo. The 12.9 x 12.9-inch picture frame can connect to Bluetooth and Wi-Fi with support for surround sound when paired with one of Samsung’s new TVs or soundbars. It also boasts Dolby Atmos support for more immersive audio and a pair of woofers, tweeters, and midrange drivers. The Music Frame can be mounted on the wall or displayed on media furniture with a stand, and it can actually be customized with a physical photo, unlike the Sonos / Ikea Symfonisk frame speaker from a few years back.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd75f665c2ac14e894e863bc4f77160a90917bb7",
      "title": "Brazil's former President Bolsonaro found guilty of plotting coup",
      "url": "https://www.bbc.com/news/articles/c147n38k800o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T20:08:06.000Z",
      "summary_90w": "",
      "raw": "The right-wing former leader could be sentenced to decades in prison after he was convicted by Brazil's Supreme Court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d22323c121cf6d43c7ff132d183e8587bc4b776c",
      "title": "Are hotel rooms accessible for people who use wheelchairs? NPR wants to hear from you",
      "url": "https://www.npr.org/2025/09/11/g-s1-86969/hotel-safety-wheelchair-mobility",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T20:01:41.000Z",
      "summary_90w": "",
      "raw": "Hotels have accessible rooms for wheelchair users. If you or someone you know has experienced problems with those rooms, we'd like to hear about it.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "edef233579de1e0a258e940d0b75f35871772059",
      "title": "Canada: Carney unveils array of national projects to ‘turbocharge’ economy",
      "url": "https://www.theguardian.com/world/2025/sep/11/canada-mark-carney-national-projects-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T19:51:37.000Z",
      "summary_90w": "",
      "raw": "List leaves out oil pipelines and focuses on LNG expansion, mines and nuclear power as it fends off US trade war\nCanada’s Liberal government has said that a liquefied natural gas facility, critical mineral mines, a nuclear reactor and port expansion will mark the first wave of major national projects to “turbocharge” the country’s economy as it fends off a trade war with the United States.\nNotably, the list unveiled by the prime minster, Mark Carney, on Thursday does not include any new oil pipelines – projects which have proven to be deeply divisive and politically fractious in recent years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88d7f2d6ace2b4cc314a7a817707b84c7d01fe75",
      "title": "Amazon&#8217;s Thursday Night Football broadcasts add more AI to the NFL",
      "url": "https://www.theverge.com/news/776697/amazon-thursday-night-football-ai-games",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T19:49:56.000Z",
      "summary_90w": "",
      "raw": "The AI-powered “Pocket Health” feature shows whether the quarterback is at risk.\t\n\nAmazon’s Prime Video is bringing more AI to the football field with new features designed to give viewers more insight into Thursday Night Football games, as highlighted earlier by Deadline. One feature, called Pocket Health, uses AI to analyze “tens of thousands of data points” across the offensive line during a play, allowing Prime Video to display on-screen visuals indicating the threat level to a quarterback.\nAs Amazon gets ready to air its first game of the 2025 NFL season, it’s also debuting a new set of AI-powered End of Game tools. That includes one that gauges the potential possession scenarios for losing teams, and another that attempts to predict how much time a team would need for a comeback or victory.\n These features add to the AI tools Prime Video has already adopted for its Thursday Night Football streams, such as Defensive Alerts, which uses machine learning to identify players that could blitz during a play.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "602f9d86bd392e88fc4413cda4016d573a29a9d3",
      "title": "Charlie Kirk's assassination sparks grief and rage online",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537736/charlie-kirk-conservative-influencers-reaction",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T19:44:19.000Z",
      "summary_90w": "",
      "raw": "Some conservative influencers mourned Kirk's loss, even as others quickly blamed the left.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "786c79e38149c469eaa01d70f164fb21314efdab",
      "title": "Senators say US is complicit in Israel’s ethnic cleansing of Gaza",
      "url": "https://www.theguardian.com/us-news/2025/sep/11/democratic-senators-gaza-ethnic-cleansing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T19:39:44.000Z",
      "summary_90w": "",
      "raw": "Democrats Chris Van Hollen and Jeff Merkley reach ‘inescapable conclusion’ after fact-finding trip to region\nTwo Democratic senators claim they have reached the “inescapable conclusion” that Israel is acting on a systematic plan to destroy and ethnically cleanse Palestinians from Gaza to force locals to leave, and they say the US is complicit.\nChris Van Hollen of Maryland and Jeff Merkley of Oregon, both members of the Senate foreign relations committee, released their findings in a report on Thursday after returning from a congressional delegation to the Middle East where, they note, the destruction goes beyond bombs and bullets. They say they also found a systematic campaign to strangle humanitarian aid, which they call “using food as a weapon of war”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c027a0ebefc41c9dbf9194410e38d546298b7ae",
      "title": "Elon Musk’s Boring Company suspends work on Vegas airport tunnel after ‘crushing injury’",
      "url": "https://techcrunch.com/2025/09/11/elon-musks-boring-company-suspends-work-on-vegas-airport-tunnel-after-crushing-injury/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T19:28:23.000Z",
      "summary_90w": "",
      "raw": "A worker had to be rescued by the local fire department, but is reportedly stable. Dozens of Boring Company workers have been injured over the years in Vegas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b726fc8a8a12e64113fc3f6088adbca7630b8712",
      "title": "Starmer facing fresh questions after Mandelson sacking",
      "url": "https://www.bbc.com/news/articles/cy0v81zeggko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T19:18:41.000Z",
      "summary_90w": "",
      "raw": "The Tories urge the PM to \"come clean\" on what he knew about Lord Mandelson's links to convicted paedophile Jeffrey Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b638f7234c2d8893f8ece6b05551407293a8b5f",
      "title": "Brazil's Supreme Court votes to convict ex-President Bolsonaro of a coup plot",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5535658/bolsonaro-brazil-coup-trial",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T19:13:28.000Z",
      "summary_90w": "",
      "raw": "A historic conviction: Brazil's Supreme Court delivers a majority vote to convict former President Jair Bolsonaro over a plot to overthrow the government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ddb5be1c0d944b34b35b62c39a2c5df05016b8",
      "title": "What did Jair Bolsonaro’s trial reveal about an attempted coup in Brazil?",
      "url": "https://www.theguardian.com/world/2025/sep/11/jair-bolsonaro-conviction-attempted-coup-what-happens-next-explainer",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T19:04:05.000Z",
      "summary_90w": "",
      "raw": "Far-right ex-president was found to have led a ‘criminal organisation’ to try to stay in power\n\nBolsonaro found guilty of plotting military coup\n\nBrazil’s supreme court has made Jair Bolsonaro the first former president in the country’s history to be convicted for attempting a coup.\nThe 70-year-old far-right leader claims he is the victim of political persecution, but three out of five judges concluded on Thursday that it was sufficiently proven that Bolsonaro and his close allies attempted to overturn the 2022 election, which he lost to Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c27ebde242ff8301726af4a420239734f6f8cde0",
      "title": "Brazil’s supreme court finds Bolsonaro guilty of plotting military coup",
      "url": "https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T18:57:57.000Z",
      "summary_90w": "",
      "raw": "Former president faces decades-long jail sentence for seeking to forcibly cling to power after losing 2022 election\n\nExplainer: what did Bolsonaro’s trial reveal?\n\nA majority of Brazil’s supreme court judges have voted to convict the country’s former president Jair Bolsonaro of plotting a military coup, leaving the far-right populist facing a decades-long sentence for leading the criminal conspiracy.\nJustice Cármen Lúcia Antunes Rocha ruled on ​Thursday that Bolsonaro – a former paratrooper who was elected president in 2018 – was guilty of seeking to forcibly cling to power after losing the 2022 election, meaning three of the five judges involved in the trial had found Brazil’s former leader guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b26b9e6bac632655c366d8a237042b412e7cbba",
      "title": "Belarus frees political prisoners in exchange for easing of US sanctions ",
      "url": "https://www.bbc.com/news/articles/c740mezey41o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T18:55:36.000Z",
      "summary_90w": "",
      "raw": "Fifty-two prisoners have been released, but more than 1,000 political prisoners remain in jail.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1894911a63f2eb943ee27da3be64046c3dda7114",
      "title": "Nato strengthens defences after Russian drones shot down over Poland",
      "url": "https://www.bbc.com/news/articles/c0lkz2n34z6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T18:55:18.000Z",
      "summary_90w": "",
      "raw": "Germany, the Netherlands and the Czech Republic will be sending Poland more support to defend Nato's eastern flank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0e870894eaac1f55daec8a817f6d0b0147905dbf",
      "title": "NASA found clues of life on Mars, but budget cuts threaten future missions",
      "url": "https://www.theverge.com/nasa/776554/nasa-mars-jezero-crater-budget-cuts",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T18:47:01.000Z",
      "summary_90w": "",
      "raw": "NASA Headquarters in Washington, DC. | Photo: Anadolu Agency via Getty Images\t\n\nAn exciting discovery on Mars is being overshadowed by turmoil at NASA, with budget cuts threatening to destroy a scientific legacy that has been built over decades.\nYesterday, the agency shared a finding, published in Nature, of potential biosignatures identified by the Mars Perseverance rover in a 3.5 billion-year-old rock.\n\"This very well could be the clearest sign of life that we've ever found on Mars,\" said Transportation Secretary and Acting NASA Administrator Sean Duffy in a press conference.\nLeftover fossils\nScientists involved in the research were careful to emphasize that the findings - related to unusual textural features of r …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c0461e8861447ac00f85d2dc5575e3b027ee6c99",
      "title": "Justice Department sues Uber for allegedly discriminating against people with disabilities",
      "url": "https://techcrunch.com/2025/09/11/justice-department-sues-uber-for-allegedly-discriminating-against-people-with-disabilities/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T18:43:35.000Z",
      "summary_90w": "",
      "raw": "It's the latest in a long line of criticism — and action — against the company's treatment of people with physical disabilities.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8bc59221cf99fb0926535d0526041316a5b1eee",
      "title": "VC leaders from 01 Advisors take the Builders Stage at TechCrunch Disrupt 2025 to share the scaling playbook",
      "url": "https://techcrunch.com/2025/09/11/what-comes-after-twitter-and-meta-the-founders-of-01a-share-their-playbook-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T18:40:00.000Z",
      "summary_90w": "",
      "raw": "Adam Bain, Dick Costolo, and David Fischer — the operators behind Twitter and Meta’s growth — reunite at Disrupt 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dd4fbb26d0c42df39c776642a4d65e8b28ffd427",
      "title": "South Korean workers detained in immigration raid leave Atlanta and head home",
      "url": "https://www.npr.org/2025/09/11/g-s1-88213/south-korean-hyundai-workers-immigration-raid-atlanta-airport",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T18:37:03.000Z",
      "summary_90w": "",
      "raw": "A plane carrying more than 300 workers from South Korea who were detained during an immigration raid at a battery factory in Georgia last week left Atlanta around noon Thursday, bound for South Korea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "29cd90b73bfed9bfa7e70dbcc270493214e0623a",
      "title": "Jury trial of Ryan Routh, man accused of trying to kill Trump, begins in Florida",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537064/trump-attempted-assassination-trial-ryan-routh",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T18:28:57.000Z",
      "summary_90w": "",
      "raw": "Routh is charged with attempting to assassinate a presidential candidate. A conviction carries a maximum penalty of life in prison. Routh, who is not a lawyer, is representing himself in this case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cf6763a51f32443d8f5794bf1347948cfbae280",
      "title": "UK should work with Nato on new missile defence system to counter Russia, experts say",
      "url": "https://www.theguardian.com/politics/2025/sep/11/britain-should-work-with-nato-on-new-missile-defence-system-to-counter-russia-experts-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T18:19:52.000Z",
      "summary_90w": "",
      "raw": "After Russian drones entered Polish airspace, two authors of the UK strategic defence review said Europe would need to build up its defences\nBritain should work with Nato allies in developing an integrated air and missile defence system after the incursion of nearly 20 Russian drones into Poland, according to two authors of the UK strategic defence review.\nFiona Hill, a former White House adviser, said that Russia was “testing the limits” of Europe’s defences at a time when the military commitment of the US to Nato was uncertain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "110068a383d3a37ac44ef55fda6fd0cfd6e94fc2",
      "title": "Phillipson and Powell set for Labour deputy showdown",
      "url": "https://www.bbc.com/news/articles/c20v3l4qy11o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T18:15:46.000Z",
      "summary_90w": "",
      "raw": "The only other remaining candidate, Bell Riberio-Addy, failed to get enough support to progress in the contest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d6128e9b3e68d3a041d0fc222615b38e374423a",
      "title": "FTC launches inquiry into AI chatbot companions from Meta, OpenAI, and others",
      "url": "https://techcrunch.com/2025/09/11/ftc-launches-inquiry-into-ai-chatbot-companions-from-meta-openai-and-others/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T18:06:15.000Z",
      "summary_90w": "",
      "raw": "The federal consumer regulator seeks to learn about how AI companies evaluate the safety of their chatbots.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d5c0125c8ba9074f4b46f2049eccfd4fd222f992",
      "title": "Ryan Routh cut off by judge as trial in attempted Trump assassination begins",
      "url": "https://www.bbc.com/news/articles/c8d793z4mzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T18:03:19.000Z",
      "summary_90w": "",
      "raw": "Routh, who is defending himself, addressed jurors during opening remarks Thursday before the judge said he was off-topic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "362540713da40c7ac3b4cdf3f5e0c327e5183777",
      "title": "Baseus&#8217; solar-powered dash cam keeps an eye on your parked car for up to two weeks",
      "url": "https://www.theverge.com/news/776613/baseus-primetrip-vd1-pro-dashcam-solar-power-two-week-standby",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T18:01:09.000Z",
      "summary_90w": "",
      "raw": "The built-in solar panel extends the life of the dash cam’s rechargeable battery. | Image: Baseus\t\n\nBaseus has announced a new dash cam that can continue capturing incidents even while your vehicle is turned off. The PrimeTrip VD1 Pro includes both a rechargeable battery and a high-efficiency solar panel it uses to record incidents when motion or impacts are detected for up to 14 days while your car is parked, without draining your vehicle’s battery.\nIt’s available now through Amazon for $169.99 (discounted to $109.99 with a coupon that expires on October 1st) and while the VD1 Pro doesn’t need to be hardwired to your vehicle’s electrical system or fuse box during installation, it’s definitely not a wireless solution. While you’re driving the main unit draws power from your vehicle’s auxiliary outlet so its 4K camera with a 170-degree wide-angle field of view can record continually, ensuring the events leading up to an incident are captured. Another cable, which you’ll need to conceal in the seams of your car’s trim panels, connects the main unit to a second 1080p rear camera with a 120-degree field of view for capturing what’s happening behind your vehicle.\nThe VD1 Pro’s solar panel is about as small as those used on calculators so the unit remains unobtrusive, but it only generates enough power to extend the dash cam’s battery, not keep it charged indefinitely. As a result, you’ll only get up to 14 days of what Baseus calls “standby parking monitoring.” When motion around the vehicle or an impact is detected, the dash cam will wake and capture 30-second clips from the front and rear cameras up to a maximum of 20 incidents or 40 clips that are stored on a 32GB microSD card that can be upgraded. If you’re parking someplace like an underground garage where the available lighting is limited, you can expect the battery life to be reduced.\nOther features include continuous loop recording that will automatically overwrite the oldest videos when the microSD card gets full, and hands-free voice controls. The VD1 Pro connects to the Baseus mobile app over Wi-Fi 6 for wirelessly downloading videos from the dashcam or uploading firmware updates.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5ca5753778d66e1c0e5cfee6d4d40fbc3c3f7a88",
      "title": "Fiji ant study provides new evidence of insects’ decline on remote islands",
      "url": "https://www.theguardian.com/environment/2025/sep/11/fiji-ant-science-evidence-decline-insect-extinctions-remote-islands-aoe",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T18:00:13.000Z",
      "summary_90w": "",
      "raw": "DNA analysis of endemic specimens in museums finds 79% of ant populations in Pacific archipelago are shrinking\nIsland-dwelling insects have not been spared the ravages of humanity that have pushed so many of their invertebrate kin into freefall around the world, new research on Fijian ant populations has found.\nHundreds of thousands of insect species have been lost over the past 150 years and it is believed the world is now losing between 1% and 2.5% a year of its remaining insect biomass – a decline so steep that many entomologists say we are living through an “insect apocalypse”. Yet long-term data for individual insect populations is sparse and patchy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec313245262a91f387807cf9c970dfe86e5ee6ee",
      "title": "South Sudan vice-president charged with murder and treason  ",
      "url": "https://www.bbc.com/news/articles/c07vkln2ezro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T17:58:09.000Z",
      "summary_90w": "",
      "raw": "The roads leading to Riek Machar's house are blocked by tanks and soldiers, amid fears of renewed fighting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d551d59234d4b951baafaf466d284243ffdf2e58",
      "title": "You can now play Silksong on flagship Android phones — and pick up where you left off on PC",
      "url": "https://www.theverge.com/hands-on/776180/hollow-knight-silksong-android-phone-windows-emulation-gamehub",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T17:50:26.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight: Silksong, one of the hottest games of the year with a reported five million players in its first week, didn't launch on smartphones. But that won't stop you from playing it on Android - because a new leap in Windows to Android emulation means you can easily install and run the Steam version on flagship phones like my Galaxy S25.\nI'm talking about GameHub, the app from Chinese mobile gamepad manufacturer GameSir, which just launched version 5.0 with two key features that help it rise above the Windows-on-phone emulation scene.\n\n \n @verge \nSilksong on Android is now a reality, no port required! GameHub is finally making Windows  …\n\n\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d726604ce348753b5d46eda288662c4db3aceee",
      "title": "Emergency UN security council meeting convened after Russian drone incursion into Poland",
      "url": "https://www.theguardian.com/world/2025/sep/11/poland-says-un-will-hold-emergency-meeting-after-russian-drone-incursions",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T17:34:40.000Z",
      "summary_90w": "",
      "raw": "Numerous European countries offer support but some allies dispute whether incident was deliberate attack\nAn emergency session of the UN security council will convene on Friday at Poland’s request as Warsaw seeks to rally support after an incursion into the country by Russian drones on Wednesday.\nNumerous European allies pledged support for Poland, including a promise by Germany to strengthen its military presence on Nato’s eastern flank, but some disputed whether the incursion was a deliberate attack on Poland by Russia and Donald Trump offered little in the way of public support.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f49c50a76da8db27e8606abc4db703d23346f472",
      "title": "The best ereader to buy right now",
      "url": "https://www.theverge.com/23769068/best-ebook-readers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T17:33:26.000Z",
      "summary_90w": "",
      "raw": "Any ebook reader will let you cram a Beauty and the Beast-sized library’s worth of books in your pocket, but so will your phone. An ebook reader offers a more book-like reading experience, with fewer distractions and less eye strain, and many include extra features, like adjustable frontlighting. Some really are pocketable. Others are waterproof or offer physical page-turning buttons, while a few even let you take notes.\nI’ve been using ebook readers for nearly a decade, and I’ve gone hands-on with dozens, from the Kindle Paperwhite to lesser-known rivals like the PocketBook Era. Whether you want something your kid can throw against the wall or a waterproof, warm-glow Kindle that won’t ruin your spa ambiance, these are the best ebook readers for everyone. \nFeatured in this article\nBest Kindle: Kindle Paperwhite (2024)\nAmazon’s latest Paperwhite features a seven-inch display, quick performance, and IPX8 waterproofing. It’s cheaper than its rivals, though, while offering many of the same features.\n\nWhere to Buy:\n\n $159.99 at Amazon\n $159.99 at Best Buy\n $159.99 at Target\n\nBest cheap ebook reader: 2024 Kindle\nThe most pocketable Kindle offers many of the Paperwhite’s best features, only for less. It includes a 300ppi display and USB-C charging, but it lacks waterproofing and adjustable color temperature.\n\nWhere to Buy:\n\n $109.99 at Amazon\n $109.99 at Best Buy\n $109.99 at Target\n\n\n\n\n\n\nThe best Kindle\nThe best non-Amazon ebook reader\nThe best cheap ebook reader\nThe best ebook reader for taking notes\nOther ebook readers that didn’t make the cut\nWhat’s coming next\n\nThe best Kindle\nKindle Paperwhite (2024)\n\n\nScore: 8\n\nProsCons\n\n\nThe best-looking screen on any e-reader\nSlightly larger screen without a noticeably larger device\nFaster page turns, loading, and a more responsive UI\nA splash of color (without a color screen)\n\nUpgrades aren’t as significant as the last Paperwhite\nLacks stylus support and page turn buttons\nSignature Edition wireless charging is frustrating without magnets\nSignature Edition back panel feels less grippy\n\n\n\nWhere to Buy:\n\n $159.99 at Amazon (ad-supported)\n $159.99 at Best Buy (ad-supported)\n $159.99 at Target (ad-supported)\n\nDimensions: 7 x 5 x .3 inches / Weight: 211 grams / Screen area and resolution: 7-inch screen, 300ppi resolution / Storage: 16GB / Other features: IPX8 waterproofing, Bluetooth audio support \nIf you mostly buy ebooks from Amazon, you’ll want a Kindle, and the 12th-gen Kindle Paperwhite is the best choice for most people. Starting at $159.99, it’s cheaper than the Kobo Libra Colour — my top non-Amazon ebook reader, which I’ll dive into later — while offering many of the same features. Those include a spacious 7-inch 300pi display with rich contrast levels and an adjustable warm white frontlight, which make for a clear and enjoyable reading experience. The latter also conveniently improves sleep by cutting down on blue light that interrupts melatonin production. \nThat warm white frontlighting is an advantage over the cool white of the $109.99 base-model Kindle, and unlike the base Kindle, the Paperwhite has IPX8 water resistance. The $199.99 Signature Edition Paperwhite also has an auto-adjusting frontlight and no lockscreen ads. It has wireless charging, which is a rare feature to find in an e-reader.\nAmazon dominates the US ebook market, so Kindle owners have access to advantages owners of other ebook readers don’t. Much of Amazon’s hardware strategy depends on offering cut-rate discounts to pull you into its content ecosystem. If you have Prime and buy a lot of Kindle ebooks, the Paperwhite is the best choice because its ebooks and audiobooks are often on sale at Amazon, and Prime members get more free content through Prime Reading. Rivals like Kobo offer sales, too, but it’s hard for them to offer discounts as steep as Amazon.\nThere are downsides, though. The Paperwhite has lockscreen ads unless you pay $20 extra to get rid of them. It’s also too big to hold comfortably with one hand. Perhaps the Kindle Paperwhite’s biggest flaw, though — which it shares with all Kindles aside from Fire tablets — is that it’s not easy to read books purchased outside of Amazon’s store. Kindle ebook formats are proprietary and only work on Kindle. Unlike Kobo and other ebook readers, Kindles don’t support EPUB files, an open file format used by pretty much everyone except Amazon. So, for example, if you often shop from Kobo’s bookstore (or Barnes & Noble or Google Play Books or many other ebook stores), you can’t easily read those books on a Kindle without using a workaround. There are ways to convert and transfer file formats so you can read on the Kindle and vice versa, but it’ll take a couple of extra steps.\nHowever, if you don’t buy your books elsewhere or you don’t mind shopping from Amazon, you’ll be more than happy with the Kindle Paperwhite.\nRead our Kindle Paperwhite review.\nThe best non-Amazon ebook reader\nKobo Libra Colour (32GB, ad-free)\n\n\n\nProsCons\n\n\nNice color screen with sharp, 300ppi black-and-white resolution\nPhysical page-turning buttons\nBuilt-in stylus support\nCompatible with Overdrive \n\nGetting books from other stores onto the device can be tough\nMore expensive than the Kindle Paperwhite\nLacks the vibrancy of other color e-readers\nNo wireless charging\n\n\n\nWhere to Buy:\n\n $229.99 at Amazon\n $229.99 at Rakuten Kobo\n $229.99 at Target\n\nDimensions: 5.69 x 6.34 x 0.33 inches / Weight: 199.5 grams / Screen area and resolution: 7-inch screen, 300ppi  (black-and-white), 150ppi (color) / Storage: 32GB / Other features: Physical page-turning buttons, waterproofing, Kobo Stylus 2 support, Bluetooth audio support \nThe Kobo Libra Colour is an excellent alternative to Amazon’s ebook readers, especially for readers outside the US or anyone who doesn’t want to tap into Amazon’s ecosystem. Kobo’s latest slate offers many of the standout features found on the 12th-gen Kindle Paperwhite — including waterproofing, USB-C support, and a 300ppi display — along with a few perks that make it more helpful and enjoyable to use.\nThe color display is the most obvious. The Libra Colour uses E Ink’s latest Kaledio color screen technology, which provides soothing, pastel-like hues that still pop in direct sunlight. It’s not as sharp as reading in monochrome — the resolution drops to 150ppi when viewing content in color — but it’s a nice touch that makes viewing a wider range of content more pleasant. Book covers and comics, while still muted, have an added layer of depth, even if the colors are nowhere near as vivid as that of a traditional LED tablet or as vibrant as the Kindle Colorsoft Signature Edition.\nHowever, unlike the Kindle Colorsoft Signature Edition, the Libra Colour works with a digital pen — the Kobo Stylus 2 (sold separately) — which lets you highlight text in various colors or take notes using Kobo’s integrated notebooks. You can also take advantage of some of the more advanced capabilities found in the Kobo Elipsa 2E, allowing you to solve math equations, convert handwriting into typed text, and insert diagrams. This lets the Libra Colour function as a mini notebook of sorts, though I wouldn’t use it as a primary note-taking device since the seven-inch display can feel cramped to write on.\nThe color display is only part of the appeal, though. The Libra Colour doesn’t have the lockscreen ads on the base Paperwhite — and packs physical page-turning buttons, which feel more intuitive to use than tapping either side of the display as you have to do on Amazon’s modern e-readers. The speedy e-reader also supports more file formats, including EPUB files, and makes it much easier to borrow books from the Overdrive library system. Until recently, Kobo offered support for the bookmarking app Pocket, which was another big selling point as it let you read saved articles offline. While the app is no longer available, Kobo recently replaced Pocket with Instapaper, which you can download in a free update.\nHowever, at $229.99, the Libra Colour costs $70 more than the entry-level Paperwhite — and that’s without Kobo’s $69.99 stylus, which is required for performing certain tasks. That gap widens further when the Paperwhite is on sale, which happens more often than the Libra Colour. The Kobo can’t easily tap into Amazon’s vast library of ebooks, which can be frustrating if you’ve amassed a collection of Kindle titles over the years. It can be done, but you have to convert file formats using third-party apps, which is tricky and can take time.\nBut if those things don’t matter or apply to you, the Kobo Libra Colour will give you the best digital reading experience of all the e-readers on our list. It’s my personal favorite.\nRead our Kobo Libra Colour review.\nThe best cheap ebook reader\nKindle (2024)\n\n\n\nProsCons\n\n\nExcellent, high-resolution display\nEasy to hold with one hand\nFaster than its predecessor with improved battery life\nFun color options\n\nNo waterproofing\nLacks adjustable color temperature\nSlightly more expensive than its predecessor\n\n\n\nWhere to Buy:\n\n $109.99 at Amazon (with ads)\n $109.99 at Best Buy (with ads)\n $129.99 at Amazon (without ads)\n\nDimensions: 6.2 x 4.3 x 0.32 inches / Weight: 158 grams / Screen area and resolution: 6-inch screen, 300ppi resolution / Storage: 16GB / Other features: USB-C support, Bluetooth audio support \nThe base-model Kindle ($109.99 with ads) is the best cheap ebook reader. Its 300ppi resolution makes text clearer and easier to read than the lower-resolution screens on other ebook readers in its price range. Plus, it has USB-C for relatively fast charging. \nReading on its six-inch screen feels a little more cramped than it does on the larger displays of the Kindle Paperwhite and Kobo Libra Colour. However, the flip side is that its small size makes it pocketable, light, and easy for small hands to hold. Combined with its relatively affordable price, the Kindle is also the best ebook reader for kids — especially the Amazon Kindle Kids Edition which costs $20 more. The kid-friendly version shares the same specs but is ad-free with parental controls, a two-year extended replacement guarantee, and a case. It also comes with six months of Amazon Kids Plus, which grants kids access to thousands of children’s books and audiobooks for free. After that, though, you’ll have to $79 per year (or $48 with Amazon Prime).\nThe base Kindle doesn’t have extra conveniences like the waterproofing you’ll find in the entry-level Kobo Clara BW and Paperwhite. You also don’t get the physical page-turning buttons found on Barnes & Noble’s entry-level e-reader, the Nook GlowLight 4e (though the Kindle is a lot snappier than the Nook). And because it’s an Amazon ebook reader, you’re also locked into the Amazon ecosystem and have to pay extra to remove ads. But if you can do without that, the Kindle delivers the essentials for under $110.\nThe best ebook reader for taking notes\nKobo Elipsa 2E\n\n\n\nProsCons\n\n\nIntuitive note-taking features\nGreat e-reader\nAdjustable warm light\nUseful note-taking capabilities, including handwriting-to-text conversion\n\nLacks native support for Kindle books\n227ppi display isn’t as sharp as the competition\nNo note-summarization features\n\n\n\nWhere to Buy:\n\n $399.99 $398.41 at Walmart\n $399.99 at Target\n $399.99 at Rakuten Kobo\n\nDimensions: 7.6 x 8.94 x 0.30 inches / Weight: 390 grams / Screen area and resolution: 10.3-inches, 227ppi resolution / Storage: 32GB / Other features: Handwriting to text conversion, magnetic stylus, Bluetooth audio support \nOf all the large ebook readers I tested, the Kobo Elipsa 2E stood out the most because it’s a good e-reader with solid note-taking abilities. You can write directly on pages just as on a physical book. The Kindle Scribe lets you annotate book pages as well, but it’s complicated involving resizable text boxes that mess up the page formatting and prevent you from doing basic things like circling words. In contrast, taking notes on the Elipsa 2E feels far more intuitive and natural.\nThe Elipsa 2E offers other helpful note-taking tools and capabilities. Like the Kobo Libra Colour, it’s capable, for example, of solving math equations for you. You can also insert diagrams and drawings, and it’ll automatically snap them into something that looks cleaner and nicer. You can also sync your notes with Dropbox or view them online and convert handwriting to typed text. The Kindle Scribe offers the latter capability, too, but again, Kobo does it faster and better within the original notebook document as opposed to on a separate page. The only thing missing from the Elipsa 2E is the Scribe’s note-summarization feature, but that’s a trade-off I am okay with given how much easier it is to take notes.\nFinally, the Kobo Elipsa 2E comes with twice the storage (32GB) for the same price as the base Kindle Scribe. You can step up to the 32GB Kindle Scribe for $20 more or upgrade to 64GB for $40 extra. Yet given the Scribe’s limitations, I still recommend saving the money and buying the Kobo Elipsa 2E instead.\nNote-taking capabilities aside, the Kobo Elipsa 2E is also a good e-reader with the same strengths and weaknesses as other Kobo devices. There’s support for a wide range of file formats, but you can’t easily read Kindle books without converting them first. Its 227ppi display is also slightly less sharp than the 300ppi screen found on the Kindle Scribe and the Kobo Libra Colour. However, the 10.3-inch screen balances things out a bit and makes text easier to read, so it’s not a noticeable drawback. Plus, the Elipsa 2E comes with an adjustable warm light for nighttime reading.  That’s a feature rival e-readers with more advanced note-taking capabilities — including the $409.99 Onyx Boox Go 10.3, which lets you insert links to notes — lacks.\nOther ebook readers that didn’t make the cut\nThere are some other ebook readers my colleagues and I have tested that I didn’t feature above but are still worth highlighting. Here are the most notable:\nKindle Colorsoft Signature Edition\nThe Kindle Colorsoft Signature Edition is the first Kindle to feature E Ink’s color screen technology and it stands out from other color e-paper devices with customizations. It offers improved contrast, more vibrant colors, and faster screen refreshes. With a $279.99 price tag, it’s the most expensive Kindle model currently available that doesn’t support a stylus for note-taking, and it includes premium features like wireless charging that are convenient but not really necessary for a device with months of battery life. If you want a color screen and want to stick with Amazon, the Colorsoft Signature is your best option. – Andrew Liszewski, Senior Reporter \nKindle Colorsoft\nAmazon recently  introduced a more affordable alternative to the $279.99 Kindle Colorsoft Signature Edition above called the Kindle Colorsoft. It’s $30 cheaper and delivers a nearly identical reading experience. As expected, Amazon excluded some features to hit the lower price point. Let’s run through them. There’s no wireless charging, which I can live without. Storage is halved to 16GB, which is enough for me as I primarily read ebooks. But if you’re buying a color e-reader, chances are high that you’ll want excess storage space for graphic novels, and 16GB may not cut it. \nThe biggest drawback for me, as a bedtime bookworm, is the lack of an auto-adjusting front light that can make nighttime reading much easier (however, its brightness and color temperature can be manually adjusted). At this price, I expect it, especially since Kobo’s $159.99 Clara Color includes one. And, given that the Colorsoft Signature Edition costs just $30 more, complete with a front light that adjusts when the room gets dim, 32GB of storage, and wireless charging, I’d opt for that instead if you’re in Amazon’s ecosystem. Unless the standard Colorsoft goes on sale for less, it’s not a great value at its regular price.\nKobo Clara Colour\nIf you’re looking for a non-Amazon alternative that’s more affordable than the Kobo Libra Colour, the Kobo Clara Colour — the successor to the Kobo Clara 2E — is worth a look. At $159.99, the ad-free e-reader costs more than the Kobo Clara 2E, but I think it’s worth the extra $10. It continues to offer the same six-inch display and IPX8 waterproof design, but the e-reader now offers color. It’s also noticeably faster — something I was happy to see, considering the occasional lag on the Clara 2E sometimes got on my nerves. You don’t get the Clara Colour’s physical buttons or stylus support, but that’s a fair tradeoff at this price point. The company recently announced a white version with a slightly larger 1,900mAh battery compared to the black model’s 1,500mAh (notably, without a price increase), which Kobo says can last over a month on a single charge. It’ll be available on September 23rd, and you can preorder it now.\nNook Glowlight 4 Plus\nIn 2023, Barnes and Noble released the Nook Glowlight 4 Plus. If you own a lot of digital books from Barnes and Noble, this could be a good Kindle alternative. Otherwise, I’d still recommend the Kobo Libra Colour to everybody else. The $199.99 Nook Glowlight 4 Plus is a good e-reader with a lot to offer, including a lovely 300ppi screen, waterproofing, physical page-turning buttons, and even a headphone jack. However, it’s just not as snappy, which makes setting it up, buying books from the device itself, and navigating the interface a slow ordeal. It didn’t help that the screen sometimes froze, too, which meant I had to restart the device while in the middle of a book.\nBoox Palma 2\nDespite all the advantages of E Ink display technology, your smartphone is probably still a more convenient device for reading given how pocket-friendly it is. The Boox Palma 2 is a smartphone-sized E Ink device that’s just as easy to slip into a pocket, but with more capabilities than an e-reader. Its 6.3-inch E Ink display is great for reading books, but the $279.99 Palma 2 also runs Android 13 so you can install productivity apps like email and messaging — assuming you’ve got access to Wi-Fi, of course, because the compact e-reader lacks cellular connectivity. If you already have the original Palma, the sequel isn’t worth the upgrade. But if you’re looking for a smaller alternative to Kindles and Kobos, the Palma 2 could be worth the splurge. – Andrew Liszewski, Senior Reporter \nBoox Go 10.3\nThe $409.99 Onyx Boox Go 10.3 is another ad-free ebook reader you can use to take notes. It’s excellent as a note-taking device, and it offers an impressively wide range of writing tools and more prebuilt notebook templates than Kobo’s Elipsa 2E. Jotting down notes using the built-in notebook felt more akin to writing on paper as well, and its slim design makes the device feel more like a traditional notebook. Like all Boox devices, it also provides quick access to the Google Play Store, so you can download multiple reading apps — including both Kindle and Kobo apps. The slate’s crisp 300ppi display is sharper than that of the Kobo Elipsa 2E, too, which is a plus.\nHowever, in comparison to the easy-to-use Elipsa 2E, the Go 10.3 lacks a front light and comes with a steeper learning curve. Notes you take on a Kindle or Kobo device won’t transfer over (and vice versa), and you can’t annotate books in either app using the Boox. I also felt like access to Google Play can be a double-edged sword as it grants easy access to distracting apps, including games, streaming services, and TikTok. It’s too slow to use the latter, but it’s fast and comfortable enough that I found myself playing around with the Word Search app far too often. For me personally, I need my e-reader to be devoid of such distractions — it’s one of the biggest things that distinguishes it from a tablet, after all. But if you’ve got more self-control than I do, the Go 10.3 could be worth a look.\nBoox Go Color 7 Gen II\nIn April, Boox  introduced the Go Color 7 Gen II, which retails for $279.99. This water-resistant e-reader offers a 300ppi display that drops to 150ppi when displaying color content, much like its Kobo and Kindle rivals. However, similar to the Kobo Libra Colour, this ad-free model offers physical-page turning buttons and supports note-taking. A stylus isn’t included, so you’ll need to spend an extra $45.99 for Boox’s pressure-sensitive InkSense pen if you want to take notes. And, like other Boox devices, it runs on Android, giving you access to a wide range of apps and online bookstores through the Google Play Store.\nWhile I appreciated not having to sideload my Kindle and Kobo library, along with greater flexibility to fine-tune color settings, I ultimately prefer the Kobo Libra Colour. In my testing, the Go Color 7 Gen II felt frustratingly sluggish by comparison to the Libra Colour, which is disappointing given the Boox costs $50 more. Responsiveness is a core part of the reading experience for me, so I’d only recommend Boox’s model to readers who value having Android app flexibility over performance.\nWhat’s coming next\nBoox recently gave The Verge a brief look at its upcoming Palma e-reader that can double as a smartphone. While the company hasn’t shared specs or availability yet, the device features a color E Ink screen and support for an LTE connection.\nUpdate, September 11th: Adjusted pricing and availability. We included our thoughts on the 16GB Kindle Colorsoft. I also included details on the new white Kobo Clara Colour e-reader with a bigger battery than the black version, and highlighted that Kobo has replaced Pocket with Instapaper. We got an early look at the LTE-ready Boox Palma. Andrew Liszewski also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41d65e7ba810de79dadc5468f134738b3bbfeb0e",
      "title": "Rifle found but suspect still at large - what we know about Charlie Kirk shooting",
      "url": "https://www.bbc.com/news/articles/cy04p4x21e5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T17:29:15.000Z",
      "summary_90w": "",
      "raw": "The FBI releases new pictures of a \"person of interest\" as a large manhunt is under way for the suspect.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41d65e7ba810de79dadc5468f134738b3bbfeb0e",
      "title": "Rifle found but suspect still at large - what we know about Kirk shooting",
      "url": "https://www.bbc.com/news/articles/cy04p4x21e5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T17:29:15.000Z",
      "summary_90w": "",
      "raw": "The FBI releases new pictures of a \"person of interest\" as a large manhunt is under way for the suspect.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f85577bc0ea604fe12571895b197793b9f3704a",
      "title": "South African rapist in bid to block Netflix documentary about his life",
      "url": "https://www.bbc.com/news/articles/cz9je7j9k83o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T17:29:14.000Z",
      "summary_90w": "",
      "raw": "Thabo Bester, who allegedly faked his death in prison and escaped, says the documentary is defamatory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a003358b2712c6a1c04f1c961f37f4b97f44703d",
      "title": "Home mortgage demand surges as rates drop to 6.35%",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5538103/home-mortgage-rates-drop-september",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T17:28:29.000Z",
      "summary_90w": "",
      "raw": "Rates saw the biggest one-week drop in a year, spurring a spike in new purchase and refinance applications.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "21f6308d23b3a303bae6abbf6870101b10f8294c",
      "title": "Kenneth Branagh's 'year of exercise' to prepare for Royal Shakespeare Company return 30 years on",
      "url": "https://www.bbc.com/news/articles/c77djr44mnpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T17:27:45.000Z",
      "summary_90w": "",
      "raw": "The Oscar-winning actor and director will play Prospero in The Tempest for the first time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35f86d4b461eea08c89d2dc3f558bc9c8e7f9c36",
      "title": "Even killings are content",
      "url": "https://www.theverge.com/analysis/776497/charlie-kirk-shooting-utah-content-creators-influencers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T17:27:06.000Z",
      "summary_90w": "",
      "raw": "Minutes after news that right-wing influencer Charlie Kirk had been shot at a planned campus event at Utah Valley University, the wheels of social media engagement farming and clout chasing had already begun to grind to life. \nKirk, despite being in his 30s, was a mainstay on college campuses around the country, where student groups regularly invited him to hold \"debate me\"-style events. The classic format - vertical split-screen of Kirk on the bottom, a student speaker on the top - racked up millions of views as the right-wing influencer sparred with college kids challenging him on issues like immigration, abortion, and race in the US. The …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c39f92ae3b1115c47eff45497ea5a3f2ca24c2b5",
      "title": "NSA leaker Reality Winner is rebuilding her life -- and looking back at her past",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5530026/reality-winner-nsa-leaker-memoir",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T17:21:36.000Z",
      "summary_90w": "",
      "raw": "Winner was working at the NSA in 2017 when she leaked a classified document to the press. Soon after, the FBI showed up at her door. Winner's new memoir is I Am Not Your Enemy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6538699bb92da528493e23471880aaee54a49b21",
      "title": "Rome mayor’s claim of swimmable Tiber in five years met with scepticism",
      "url": "https://www.theguardian.com/world/2025/sep/11/rome-mayor-claim-swimmable-tiber-five-years-met-with-scepticism",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T17:07:33.000Z",
      "summary_90w": "",
      "raw": "Experts unconvinced by Roberto Gualtieri’s mooted timescale for river to be reopened for public bathing\nRome hopes to welcome swimmers back to the River Tiber within five years, the city’s mayor has announced, drawing inspiration from Paris, where the Seine was reopened for public bathing this summer for the first time in a century.\nDuring a visit on Thursday to the Osaka Expo in Japan, Roberto Gualtieri said a working group had been set up to study the feasibility of the clean-up project.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "15d0ffe943137d0aef72b3c66f5b9476033149a5",
      "title": "Netflix&#8217;s best movies deserve more time on the big screen",
      "url": "https://www.theverge.com/netflix/776477/netflix-movie-theaters-frankenstein-knives-out",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T17:00:00.000Z",
      "summary_90w": "",
      "raw": "A still from Frankenstein.\t\n\nLike the rest of the Knives Out movies, Wake Up Dead Man is full of extremely fun revelations - the kind that can turn the whodunit story on its head and, as was the case for many of those attending the film's premiere in Toronto, Canada, produce audible gasps. Those shared moments of surprise are part of what makes the movie such a great theatrical experience, so it sucks that most people won't get the opportunity to see it in a theater at all.\nWake Up Dead Man isn't alone. Netflix was very present at the Toronto International Film Festival this year, with films like Guillermo del Toro's Frankenstein, Edward Berger's Ballad of a Small Play …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "96f75bdfc38c414f726c4ffdb14a9b80d8105392",
      "title": "Ex-senator's wife sentenced to more than 4 years in bribery scheme",
      "url": "https://www.bbc.com/news/articles/c5yj6zn22n5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T16:59:47.000Z",
      "summary_90w": "",
      "raw": "Nadine Menendez, whose husband is already in prison, was convicted for her role in a bribery scheme involving gold bars, cash and a Mercedes-Benz",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Charlie Kirk: Conservative influencer who rallied a youth movement",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T16:58:07.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Conservative influencer who rallied a youth movement",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T16:58:07.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "52705ff50fdd7e752430de387f654fe7df9bdae2",
      "title": "FTC orders AI companies to hand over info about chatbots&#8217; impact on kids",
      "url": "https://www.theverge.com/policy/776545/ftc-ai-chatbot-companion-kids-teens-study",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T16:58:07.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission (FTC) is ordering seven AI chatbot companies to provide information about how they assess the effects of their virtual companions on kids and teens.\nOpenAI, Meta, its subsidiary Instagram, Snap, xAI, Google parent company Alphabet, and the maker of Character.AI all received orders to share information about how their AI companions make money, how they plan to maintain their user bases, and how they try to mitigate potential harm to users. The inquiry is part of a study, rather than an enforcement action, to learn more about how tech firms evaluate the safety of their AI chatbots. Amid a broader conversation about kids safety on the internet, the risks of AI chatbots have broken out as a particular cause for concern among many parents and policymakers because of the human-like way they can communicate with users.\n“For all their uncanny ability to simulate human cognition, these chatbots are products like any other, and those who make them available have a responsibility to comply with the consumer protection laws,” FTC Commissioner Mark Meador said in a statement. Chair Andrew Ferguson emphasized in a statement the need to “consider the effects chatbots can have on children, while also ensuring that the United States maintains its role as a global leader in this new and exciting industry.” The commission’s three Republicans all voted to approve the study, which requires the companies to respond within 45 days.\nIt comes after high-profile reports about teens who died by suicide after engaging with these technologies. A 16-year-old in California discussed his plans for suicide with ChatGPT, The New York Times reported last month, and the chatbot provided advice that appeared to assist him in his death. Last year, The Times also reported on the suicide death of a 14-year-old in Florida who died after engaging with a virtual companion from Character.AI. \nOutside of the FTC, lawmakers are also looking at new policies to safeguard kids and teens from potentially negative effects of AI companions. California’s state assembly recently passed a bill that would require safety standards for AI chatbots and impose liability on the companies that make them.\nWhile the orders to the seven companies aren’t connected to an enforcement action, the FTC could open such a probe if it finds reason to do so. “If the facts—as developed through subsequent and appropriately targeted law enforcement inquiries, if warranted—indicate that the law has been violated, the Commission should not hesitate to act to protect the most vulnerable among us,” Meador said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef593c9af3dbd15605156661b05c60d92c44c8bf",
      "title": "Albania puts AI-created ‘minister’ in charge of public procurement",
      "url": "https://www.theguardian.com/world/2025/sep/11/albania-diella-ai-minister-public-procurement",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T16:46:00.000Z",
      "summary_90w": "",
      "raw": "Edi Rama, PM, says digital assistant Diella will make Albania ‘a country where public tenders are 100% free of corruption’\nA digital assistant that helps people navigate government services online has become the first “virtually created” AI cabinet minister and put in charge of public procurement in an attempt to cut down on corruption, the Albanian prime minister has said.\nDiella, which means Sun in Albanian, has been advising users on the state’s e-Albania portal since January, helping them through voice commands with the full range of bureaucratic tasks they need to perform in order to access about 95% of citizen services digitally.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1e6fb8911a2b4985f5d8b71e0a460e70f94af8f",
      "title": "Ireland threatens to withdraw from Eurovision if Israel participates",
      "url": "https://www.bbc.com/news/articles/c5yvd8158ywo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T16:45:58.000Z",
      "summary_90w": "",
      "raw": "The Irish broadcaster said that Ireland's participation in the contest \"would be unconscionable given the ongoing and appalling loss of lives in Gaza\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1e6fb8911a2b4985f5d8b71e0a460e70f94af8f",
      "title": "Ireland threatens to withdraw from Eurovision if Israel participates ",
      "url": "https://www.bbc.com/news/articles/c5yvd8158ywo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T16:45:58.000Z",
      "summary_90w": "",
      "raw": "The Irish broadcaster said that Ireland's participation in the contest \"would be unconscionable given the ongoing and appalling loss of lives in Gaza\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77477d7dc276cd7d434ee6c90e555e4e8b5eb745",
      "title": "Farage faces questions over who funded £885,000 Clacton constituency home",
      "url": "https://www.bbc.com/news/articles/ce845w70g0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T16:41:13.000Z",
      "summary_90w": "",
      "raw": "A BBC investigation raises questions about how the Reform UK leader's partner paid for a home in his constituency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "155dbfa675c34b655a1ee191aa37512a81ee14c4",
      "title": "Belarus frees 52 political prisoners, including foreigners, after visit by US delegation",
      "url": "https://www.theguardian.com/world/2025/sep/11/belarus-frees-political-prisoners-foreigners-us-visit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T16:31:43.000Z",
      "summary_90w": "",
      "raw": "Move seen as effort to win US favour and sanctions relief, as crackdown on dissent continues\nBelarus has released 52 prisoners of various nationalities, after a visit by a US delegation to Minsk, in Alexander Lukashenko’s latest attempt to balance ties between Russia and the west.\nThursday’s prisoner release was one of the biggest of Lukashenko’s authoritarian rule, and was part of his effort to mend relations with Washington and secure sanctions relief after years of isolation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b56c8966f95c5c129b0b3964260941d77365c703",
      "title": "Gmail makes it easier to track upcoming package deliveries",
      "url": "https://techcrunch.com/2025/09/11/gmail-makes-it-easier-to-track-upcoming-package-deliveries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google also announced on that it's updating the Promotion category in Gmail to allow users to sort by \"most relevant\" promotion emails.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab7c1effdd1fedfb32492fe7ffb3efe4b45ea86f",
      "title": "Chelsea face 74 FA charges over payments to football agents",
      "url": "https://www.bbc.com/sport/football/articles/c8643dp5043o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:36:40.000Z",
      "summary_90w": "",
      "raw": "Chelsea are charged by the Football Association with 74 alleged rule breaches related to payments to agents when Roman Abramovich was owner.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c98904bc4d21c59b49d54e158e9903fde5e2bad",
      "title": "The killing of Charlie Kirk adds to a time of political upheaval and violence",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537908/political-violence-charlie-kirk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T15:32:30.000Z",
      "summary_90w": "",
      "raw": "The killing of conservative activist Charlie Kirk Wednesday at a college in Utah is the latest in a series of politically motivated violent acts just in recent months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f5b639f903c784e7bcfc4b8e410de412b524239",
      "title": "France says Apple notified victims of new spyware attacks",
      "url": "https://techcrunch.com/2025/09/11/france-says-apple-notified-victims-of-new-spyware-attacks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:32:05.000Z",
      "summary_90w": "",
      "raw": "The French government says Apple sent out threat notifications to customers alerting them to spyware attacks earlier in September.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3ac6e9b683542989bc3c364ef893cc185f390341",
      "title": "UK could see first named storm of the season amid weather warnings",
      "url": "https://www.bbc.com/weather/articles/cpd9x525653o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:18:56.000Z",
      "summary_90w": "",
      "raw": "Heavy rain and strong winds will affect the UK on Sunday and Monday bringing a risk of some disruption.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df1c6e02fda152fafb9404dab89f66e4aa68e84a",
      "title": "Google is shutting down Tables, its Airtable rival",
      "url": "https://techcrunch.com/2025/09/11/google-is-shutting-down-tables-its-airtable-rival/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:15:23.000Z",
      "summary_90w": "",
      "raw": "Google Tables, a work-tracking tool and competitor to the popular spreadsheet-database hybrid Airtable, is shutting down. The app will not be supported after December 16, 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11f56be1571eab8454cca26e36461f80f8151887",
      "title": "TB is the #1 killer among infectious diseases. A new study says its toll could mount",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/11/nx-s1-5534234/tuberculosis-tb-deaths-aid-cuts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T15:09:43.000Z",
      "summary_90w": "",
      "raw": "New research estimates that as many as 2.2 million more people could die of tuberculosis if U.S. cuts to foreign aid become permanent.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf54c8e6986a21b0c9a565cfdce4bc13ec14a30e",
      "title": "Humanoids, AVs, and what’s next in AI hardware with Waabi and Apptronik at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/11/humanoids-avs-and-whats-next-in-ai-hardware-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:02:50.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 is bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "28c74441addce30061b2988f344a5e0c65beeeee",
      "title": "Chris Mason: Starmer is losing senior figures at the rate of one a week",
      "url": "https://www.bbc.com/news/articles/cvgvexelmkgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:01:12.000Z",
      "summary_90w": "",
      "raw": "Lord Mandelson's departure follows a similar pattern to that of deputy prime minister Angela Rayner.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6efb3e564c002dd579e77ce57476f6961b5fe2a8",
      "title": "‘Grave concerns’ from states over Labor plan to move autism services off NDIS",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/states-react-to-labor-ndis-changes-autism-services-thriving-kids",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:00:11.000Z",
      "summary_90w": "",
      "raw": "Federal health minister last month announced surprise move to shift child foundational supports to new Thriving Kids program from July 2027\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nLabor is facing a growing revolt by the states over plans to provide early intervention autism services through a new $2bn national scheme, with Victoria’s disability minister warning children’s rights must not be traded away “for 30 pieces of silver”.\nStates and territories were blind-sided by last month’s announcement from the health minister, Mark Butler, that the federal government had scrapped plans for locally provided services for children with mild autism and other developmental issues, as part of efforts to ease pressure on the rapidly growing NDIS budget.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53016a35083afb00d067f015197394637fbe058f",
      "title": "Victorian Liberal party shapes up for ‘nastiest, most toxic’ state council in years amid leaks and infighting",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/victorian-liberal-party-nastiest-most-toxic-state-council-years-leaks-infighting-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:00:10.000Z",
      "summary_90w": "",
      "raw": "State party’s deep divisions on show as sexist messages force resignation of director days before annual meeting\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nTiming is everything in politics. It’s a principle worth recalling when nine-month-old messages are made public just two days before the Victorian Liberals’ annual state council meeting.\nThe messages, taken from a WhatsApp group involving a small handful of party headquarters staff, are undeniably sexist and inappropriate. In them, Victorian Liberal party director Stuart Smith mocked the party’s women’s council, saying it could only make decisions at a meeting “after two men told them they had to”, and joked that upper house MP Bev McArthur had dementia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87d37ed2e6e9d0ae2a11665706cb845a28936372",
      "title": "Jessica has 77 half-brothers and sisters through the same sperm donor. She wonders how many more there could be",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/jessica-has-77-half-brothers-and-sisters-through-the-same-sperm-donor-she-wonders-how-many-more-there-could-be-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:00:09.000Z",
      "summary_90w": "",
      "raw": "Queensland woman says its time for clinic to destroy 30-year-old samples as state and federal health ministers meet to push for reform\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland woman Jessica Hamilton has 77 half-brothers and sisters. But this week she learned that number could grow even further – swelled by new births.\nIn 1995, the year she was born, Queensland Fertility Group told Hamilton’s mother that she could expect to have between three and five siblings to other families.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0168340090b269a173adf995b4f8817c1ffdbaee",
      "title": "HBO Max is going to get more expensive, Warner Bros. Discovery CEO says",
      "url": "https://techcrunch.com/2025/09/11/hbo-max-is-going-to-get-more-expensive-warner-bros-discovery-ceo-says/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:59:02.000Z",
      "summary_90w": "",
      "raw": "Zaslav also said that the streaming service's crackdown on passwords will be coming in the future.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2a08d46a69740d7448a3d14e0546cba40ad716e2",
      "title": "Man arrested over fire at Labour MP's office",
      "url": "https://www.bbc.com/news/articles/cp3qwpe93yzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T14:54:21.000Z",
      "summary_90w": "",
      "raw": "A spokesperson for Sharon Hodgson says the MP \"will not be deterred\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "738e1ad01919d21230b7d89153f5f8374034406b",
      "title": "Kids in the UK are hacking their own schools for dares and notoriety",
      "url": "https://techcrunch.com/2025/09/11/kids-in-the-uk-are-hacking-their-own-schools-for-dares-and-notoriety/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:42:14.000Z",
      "summary_90w": "",
      "raw": "Kids are making a mark in the U.K.'s cybersecurity arena, and not in the way their parents want them to.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d0781e20d908495e2b221e24156542f9ad354063",
      "title": "Box CEO Aaron Levie on AI’s ‘era of context’",
      "url": "https://techcrunch.com/2025/09/11/box-ceo-aaron-levie-on-ais-era-of-context/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:36:31.000Z",
      "summary_90w": "",
      "raw": "Box released a new set of AI tools at its Boxworks conference on Thursday, filling out CEO Aaron Levie's vision for an AI-led transformation of the enterprise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26729002e1e5dd88918f78e60c92523080673ab5",
      "title": "See Kathmandu's destroyed and barricaded streets after violence",
      "url": "https://www.bbc.com/news/videos/cwy9jrdg4qro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T14:32:18.000Z",
      "summary_90w": "",
      "raw": "There's an intense military presence on the Nepali capital's streets, says the BBC's Samira Hussain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26729002e1e5dd88918f78e60c92523080673ab5",
      "title": "Watch: See Nepal capital's destroyed and barricaded streets after violence",
      "url": "https://www.bbc.com/news/videos/cwy9jrdg4qro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T14:32:18.000Z",
      "summary_90w": "",
      "raw": "There's an intense military presence on the Nepali capital's streets, says the BBC's Samira Hussain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d5cc6f6575996d78c10f8014bcd73c40c1765571",
      "title": "South African court rules that men can take wife's surname",
      "url": "https://www.bbc.com/news/articles/cm2z351l6jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T13:52:14.000Z",
      "summary_90w": "",
      "raw": "The highest court rules that a law barring men from taking the surnames of their wives is a \"colonial import\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bfa75b4d29d10ea67aa0504577b94aced12588f",
      "title": "Why did Starmer take the risk of appointing Peter Mandelson?",
      "url": "https://www.bbc.com/news/articles/cjd1egrlj0mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:16:37.000Z",
      "summary_90w": "",
      "raw": "Many Labour MPs think the prime minister should have seen the Mandelson scandal coming a mile off, writes Joe Pike.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fe2417ad71c0b41f0e0f72386beccf674277209",
      "title": "A rooftop figure, gunfire, then panic - how Charlie Kirk shooting unfolded",
      "url": "https://www.bbc.com/news/videos/ckg3xp9g9zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:11:35.000Z",
      "summary_90w": "",
      "raw": "The conservative activist and influential Trump ally was shot and killed while speaking at Utah Valley University.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5837b6e2da8ebbc9d781e2aded9558316c9cff90",
      "title": "Festival axes German orchestra over concerns about Israeli conductor",
      "url": "https://www.theguardian.com/world/2025/sep/11/festival-axes-german-orchestra-over-concerns-about-israeli-conductor",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T13:04:06.000Z",
      "summary_90w": "",
      "raw": "Belgian organisers are accused of ‘naked antisemitism’ after cancelling performance by Lahav Shani\nA Belgian classical music festival has axed a leading German orchestra from its programme over concerns about its Israeli conductor, drawing accusations of antisemitism from Berlin.\nFlanders Festival Ghent announced it had cancelled a concert by the Munich Philharmonic scheduled for 18 September, citing insufficient clarity over Lahav Shani’s attitude to the Israeli government.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93f9e4e35c079cc81f9ed79d1a766024accb6f63",
      "title": "Doctors warn hospitals under pressure as NHS waiting lists rise",
      "url": "https://www.bbc.com/news/articles/c3dr52l1j3yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:01:27.000Z",
      "summary_90w": "",
      "raw": "The waiting list for planned hospital treatment in England rose for the second month in a row in July to its highest level since March.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0343f569d8a34eefaf497a0bce755d17c32ea4b1",
      "title": "How Bill Gates’s fellowship program is adapting to global uncertainty",
      "url": "https://techcrunch.com/2025/09/11/how-bill-gatess-fellowship-program-is-adapting-to-global-uncertainty/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T13:00:00.000Z",
      "summary_90w": "",
      "raw": "As Breakthrough Energy Fellows welcomes a new cohort of 22 startups, it is also diversifying its portfolio to include more global founders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b464178e670e89ba3af772e61b1aa82cf19364f5",
      "title": "Inflation climbs in August as grocery and gas prices jump",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537074/inflation-economy-grocery-gas-federal-reserve",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T12:58:18.000Z",
      "summary_90w": "",
      "raw": "Inflation accelerated in August as Americans paid more for gasoline and groceries. Over the last 12 months, consumer prices have risen 2.9%.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e396c6973341565876f3f45646fe39cdb6842ca4",
      "title": "Apple’s new live translation feature for AirPods won’t be available in the EU at launch",
      "url": "https://techcrunch.com/2025/09/11/apples-new-live-translation-feature-for-airpods-wont-be-available-in-the-eu-at-launch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T12:53:03.000Z",
      "summary_90w": "",
      "raw": "On its official page detailing the features available on iOS 26, the company said EU residents or those with EU Apple IDs won't be able to use live translation, which is powered by Apple Intelligence and will also be coming to AirPods 4 and AirPods Pro 2.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e6a1ad8093d6d1b87a9f7f68b8c9f80e681ad468",
      "title": "Zambia presses China for more compensation over toxic mine spill",
      "url": "https://www.bbc.com/news/articles/cwy9j8xqq2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T12:45:39.000Z",
      "summary_90w": "",
      "raw": "Zambia's Vice-President Mutale Nalumango says the compensation offered to communities \"may not be all\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d65d4b64c9de1829f4f49c0e1b4e893a5716ee6",
      "title": "NPR's next news chief built an international career at CNN",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5536569/npr-thomas-evans-news-editor-in-chief",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T12:31:09.000Z",
      "summary_90w": "",
      "raw": "NPR has promoted Thomas Evans, its editorial review chief, to lead the newsroom through a period of change, following Congress' decision to end federal funding of public media.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "86dc765b650a7b118c8207debe68282841d06125",
      "title": "John Lewis losses nearly triple to £88m",
      "url": "https://www.bbc.com/news/articles/cx2jm4pgejjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T12:12:21.000Z",
      "summary_90w": "",
      "raw": "The owner of the eponymous department store and Waitrose expects the business to return to profit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "100b5151ee8f0d9dba9021960fc6985a2d0f9510",
      "title": "France suspects foreign intelligence over pigs heads left outside mosques",
      "url": "https://www.bbc.com/news/articles/cx25414vg7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T11:53:28.000Z",
      "summary_90w": "",
      "raw": "Foreign nationals are blamed for the incident, which has striking similarities with other recent provocations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea0ce9e7fc0ac37a3179f63f5a6f72cb960f9fbd",
      "title": "Hundreds of South Koreans arrested in a U.S. immigration raid are being sent home",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537811/south-koreans-arrested-immigration-us-raid-sent-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T11:50:19.000Z",
      "summary_90w": "",
      "raw": "U.S. immigration authorities are preparing to send more than 300 South Korean workers home on a chartered flight from Atlanta, a week after detaining them for allegedly working illegally.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9e925106ef910af1d2ba971b8ab041833153c09a",
      "title": "Southport killer didn't look human, says teenager stabbed in attack",
      "url": "https://www.bbc.com/news/articles/cn0ry8dy320o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T11:49:09.000Z",
      "summary_90w": "",
      "raw": "A 14-year-old girl who survived the attacks tells an inquiry the memories are \"like a horror film\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fe8e1e2ed8a5fc2a45ce74be7321706be6531d0",
      "title": "Israeli strikes in Yemen kill 35 people, Houthis say",
      "url": "https://www.bbc.com/news/articles/c179e5v552ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T11:00:49.000Z",
      "summary_90w": "",
      "raw": "The Israeli military says it hit military targets, but the Houthis say only civilian sites were targeted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2f43dbb8fe07397a438f6fdbff379942aa2485bd",
      "title": "Nasa bans Chinese nationals from working on its space programmes",
      "url": "https://www.bbc.com/news/articles/c9wd5qpekkvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T10:34:01.000Z",
      "summary_90w": "",
      "raw": "Earlier this month, Chinese nationals working with Nasa suddenly found themselves denied access.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d32b258091a54f2e05acf348fc1d85fb96bfa600",
      "title": "'Everyone hit the deck and scattered': Witnesses describe moment of Utah shooting",
      "url": "https://www.bbc.com/news/articles/c8d7900yl3zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T10:09:04.000Z",
      "summary_90w": "",
      "raw": "Witnesses describe screaming and running to flee the scene after hearing the fatal gunshot that killed Kirk.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Lab results confusing? Some patients use AI to interpret them, for better or worse",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80e4723e4b6d67c498758a596bc2382c16d543ae",
      "title": "Bali's worst floods in a decade kill 14",
      "url": "https://www.bbc.com/news/articles/c9dx5jyqz97o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T09:01:07.000Z",
      "summary_90w": "",
      "raw": "Authorities say the flash floods on the popular island were caused by heavy rainfall.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02e1f5a7f25678fb6dd1f6dcc569528ad3d1cabc",
      "title": "After crafting quiet Florida life, Shah of Iran’s alleged ‘chief torturer’ must now face trial",
      "url": "https://www.theguardian.com/world/2025/sep/11/parviz-sabeti-shah-iran-lawsuit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T09:00:32.000Z",
      "summary_90w": "",
      "raw": "Parviz Sabeti crafted an anonymous new life for his family – but now he faces a $225m lawsuit for atrocities committed in prisons in Tehran and elsewhere\nNeighbors in the upscale Florida community of Windermere know them as Peter and Nancy, the seemingly friendly retired couple they wave to on morning walks, and who always appear to enjoy visits from their two high-flying grown daughters, one a respected professor of science at Harvard University.\nYet behind the high walls of their $3.6m lakefront mansion lies a darker, more closely guarded reality: “Peter” is actually Parviz Sabeti, the alleged head of secret police and chief torturer of the former Shah of Iran’s pre-revolutionary government, now facing a $225m lawsuit in Florida for atrocities committed in prisons in Tehran and elsewhere.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "139f262bc3987c2dbd95b84f9ffd659df4b52187",
      "title": "6 ways college students can get a better handle on their money",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5519357/the-broke-college-students-guide-to-managing-money",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For college students who don't have a lot of money, it can be tough to wrap your head around student loans, credit cards and a tight budget. A financial educator offers advice for first-year students.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "716d90a7a686c8315680cf405edb9d142faa4ecf",
      "title": "Tasmanian museum kept and displayed 177 human remains without families’ knowledge, report finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/tasmanian-museum-kept-and-displayed-177-human-remains-without-the-families-knowing-report-finds-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T08:14:26.000Z",
      "summary_90w": "",
      "raw": "University of Tasmania apologises, saying staff have met with families and will consider coroner’s findings\n\nGet our breaking news email, free app or daily news podcast\n\nHuman specimens were collected, and in some cases publicly displayed, by a museum for decades without the knowledge or consent of families.\nThe University of Tasmania’s RA Rodda Museum collected remains from coronial autopsies from 1966 to 1991 for teaching and research purposes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4943cd65aaf6185ec871a259d73404af9f1aaa36",
      "title": "Ghana agrees to accept West Africans deported from US ",
      "url": "https://www.bbc.com/news/articles/c9v7m0pgv8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T07:12:28.000Z",
      "summary_90w": "",
      "raw": "Fourteen deportees including nationals of Nigeria and The Gambia have already arrived, President Mahama says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32d0450fd1ecf0a66e3dcf89d08614901ee10a35",
      "title": "Hong Kong criticised for rejecting bill giving ‘bare minimum’ rights to same-sex couples",
      "url": "https://www.theguardian.com/world/2025/sep/11/hong-kong-same-sex-couples-rights-bill-rejected",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T06:16:01.000Z",
      "summary_90w": "",
      "raw": "Legislative council voted down a bill that was introduced to comply with an order from the city’s top court\nHuman rights groups have accused the Hong Kong government of failing to provide the “bare minimum” of rights to same-sex couples after it rejected a bill that was introduced to comply with an order by the city’s top court.\nThe city’s unicameral legislative council (LegCo), on Wednesday rejected the bill by a vote of 71-14 after the second reading, following months of debate in the city between opponents who said it threatened family values and advocates who said the government was out of line with the majority of residents who supported same-sex relationships.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3e57be78ca1afae15e412add71be651d57c9302",
      "title": "Killing of Trump ally lays bare America's bloody and broken politics",
      "url": "https://www.bbc.com/news/articles/cm2z9z4m22ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T05:40:57.000Z",
      "summary_90w": "",
      "raw": "Charlie Kirk's killing is another episode of gun violence in America and the latest in a line of recent political violence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb9b2667cd236c606a32badb5c3fa63755fb13ef",
      "title": "A California bill that would regulate AI companion chatbots is close to becoming law",
      "url": "https://techcrunch.com/2025/09/10/a-california-bill-that-would-regulate-ai-companion-chatbots-is-close-to-becoming-law/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T05:10:51.000Z",
      "summary_90w": "",
      "raw": "If SB 243 is enacted, California would become the first state to require operators to implement safety protocols for AI companions and hold companies legally accountable if their chatbots fail to meet those standards.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "296a657b87f1ee95a0f736fc1fbabffe59032c1d",
      "title": "How Hodgkinson found strength in 'most challenging year'",
      "url": "https://www.bbc.com/sport/athletics/articles/c4g6z1kggrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T05:08:36.000Z",
      "summary_90w": "",
      "raw": "Britain's Keely Hodgkinson aims to add the world 800m title to her Olympic gold in Tokyo.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7100762668b4d825976c57ac1afba991545e01b8",
      "title": "The Muslim women who defied tradition and changed lives with exercise",
      "url": "https://www.bbc.com/news/articles/ce397wpy338o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T05:05:35.000Z",
      "summary_90w": "",
      "raw": "Women from the Asian community describe how they are overcoming barriers to exercise.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e566eb7c4722f8556cd32601c0b0046354e9170",
      "title": "Flash floods in Indonesia leave at least 15 people dead and 10 missing",
      "url": "https://www.theguardian.com/world/2025/sep/11/flash-floods-indonesia-bali-deaths",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:58:57.000Z",
      "summary_90w": "",
      "raw": "Torrential rains cause flooding and landslides in East Nusa Tenggara province and on the tourist island of Bali\n\nFlooding in Bali, Indonesia – in pictures\n\nRescuers have recovered the bodies of 15 people who have died in flash flooding in two Indonesian provinces, while authorities said 10 others were missing.\nTorrential rains beginning on Monday caused flooding and landslides in East Nusa Tenggara province and on the island of Bali.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T04:42:58.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6255592ca0aa0b4c83b6393db826697a383395e0",
      "title": "Firms will hesitate to invest in US after raid - S Korea president",
      "url": "https://www.bbc.com/news/articles/cly0e4k750go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T04:32:01.000Z",
      "summary_90w": "",
      "raw": "More than 300 South Koreans who were arrested in the raid are due to return home on Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f62af97d9abdf6233d42244078b83c0e10cf8777",
      "title": "Perplexity reportedly raised $200M at $20B valuation",
      "url": "https://techcrunch.com/2025/09/10/perplexity-reportedly-raised-200m-at-20b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T03:59:10.000Z",
      "summary_90w": "",
      "raw": "The AI-powered search startup's valuation jumped from $18 billion two months earlier.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "025c8fc1c8160fbb07c6aeb2868cce25a0feae69",
      "title": "Feeling stressed? Here's five ways to manage it better",
      "url": "https://www.bbc.com/news/articles/cg42zq7nqxwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T00:30:06.000Z",
      "summary_90w": "",
      "raw": "Stress, in small doses, can be good for us. Here are five simple, science-backed ways to manage it better.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2508002d85ec34011ad48a2f2bad50d7eef8261",
      "title": "Fatal dam collapse: 'How do you restart from nothing?'",
      "url": "https://www.bbc.com/news/articles/c1kwepevkzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T00:10:25.000Z",
      "summary_90w": "",
      "raw": "Survivors of the flood tell the BBC they are still in need of government support.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4c0b57ef0ba4ad83b1ad673b9a082c5acc10855",
      "title": "TV cooking shows are dying out - the cronut holds the secret to why",
      "url": "https://www.bbc.com/news/articles/c0jq1d63l7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T23:17:52.000Z",
      "summary_90w": "",
      "raw": "The curious case of why the UK has fallen out of love with once-beloved 'chop and chat' food shows.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9434232e262d9b16fcaf7399776bb45549356463",
      "title": "How Syria's dictatorship used a global child welfare charity to 'disappear' children",
      "url": "https://www.bbc.com/news/articles/c4g53e4zdjpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T23:15:51.000Z",
      "summary_90w": "",
      "raw": "The Assad regime used an international charity to hide children of detainees from their families.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c5b9307d5b2cc39fe1973214edd71809a14c28",
      "title": "Mystery of dancing spiders' DNA could explain how they develop into new species",
      "url": "https://www.bbc.com/news/articles/c4gzl2zj72jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T23:00:20.000Z",
      "summary_90w": "",
      "raw": "There are many more species of peacock spider than other animals, scientists think they may know why.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57ce8bf756e4f328ac6e32ad22b8e1e712b2e460",
      "title": "Thinking Machines Lab wants to make AI models more consistent",
      "url": "https://techcrunch.com/2025/09/10/thinking-machines-lab-wants-to-make-ai-models-more-consistent/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T21:30:11.000Z",
      "summary_90w": "",
      "raw": "In a blog post shared Wednesday, Mira Murati's startup offered a rare glimpse into some of work its doing to improve AI models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef68cf68717ca35f3a60f509f239c9b4dc7cb4b5",
      "title": "Students flee as Charlie Kirk shot in front of crowd of hundreds",
      "url": "https://www.bbc.com/news/videos/c2ejgzyggpmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T21:20:58.000Z",
      "summary_90w": "",
      "raw": "Video from the campus in Utah shows how the event turned to chaos after a single shot rang out.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ef311f97f5ed8090c474813cb132b42592f748",
      "title": "How to turn off autoplay on your social media feeds",
      "url": "https://techcrunch.com/2025/09/10/how-to-turn-off-autoplay-on-your-social-media-feeds/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T21:02:52.000Z",
      "summary_90w": "",
      "raw": "Here's how you can turn off autoplaying videos and GIFs on Facebook, Instagram, X, Twitter, and Threads.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f685ce70e92f92303d88958421fbbea0ad357920",
      "title": "Putin and Netanyahu present twin challenges to Trump's diplomacy",
      "url": "https://www.bbc.com/news/articles/cvg9pnpqm2jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T19:44:52.000Z",
      "summary_90w": "",
      "raw": "Israel's strikes in Doha and the Russian drone incursion could present major affronts to his authority.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f669446916e1e964d117b5e69b0d08621f116518",
      "title": "Israeli airstrikes ‘killed any hope’ for hostages in Gaza, says Qatari prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:27:05.000Z",
      "summary_90w": "",
      "raw": "Mohammed bin Abdulrahman bin Jassim al-Thani calls for Benjamin Netanyahu to be ‘brought to justice’\nQatar’s prime minister has said that Benjamin Netanyahu “killed any hope” for the remaining hostages in Gaza following Israel’s extraordinary strike on Hamas negotiators in Doha on Tuesday.\nIn an interview with CNN on Wednesday, Mohammed bin Abdulrahman bin Jassim al-Thani called the deadly strike in the Qatari capital an act of “state terror”. Israel’s attack the previous day killed six members of Hamas who were negotiating a ceasefire deal brokered by the US and other Gulf countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4af0c3e7688c3503f00f63cc20194a1017b9ed51",
      "title": "While US stalls, Australia and Anduril move to put XL undersea vehicle into service",
      "url": "https://techcrunch.com/2025/09/10/while-u-s-stalls-australia-and-anduril-move-to-put-xl-undersea-vehicle-into-service/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:12:11.000Z",
      "summary_90w": "",
      "raw": "Anduril has landed a lucrative contract and is bringing its uncrewed undersea vehicle Ghost Shark to Australian waters next year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ea132f7941d86ace33277764e7c4ce89ca3e0e8",
      "title": "'Netanyahu, we're not leaving': Defiance in Gaza City as Israel shows aid sites planned for evacuees",
      "url": "https://www.bbc.com/news/articles/c0lkz0l4x51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T19:05:25.000Z",
      "summary_90w": "",
      "raw": "As Israel insists the whole population of Gaza City must leave, the BBC visits new aid sites the army claims will help them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13ea08e07d8c36122cf44bf22c52cea93e421323",
      "title": "Accidental or deliberate? Russia's drone incursion into Poland is a test for Nato",
      "url": "https://www.bbc.com/news/articles/clydk8821nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T18:56:48.000Z",
      "summary_90w": "",
      "raw": "Whether the drone incursion was deliberate or accidental, Moscow will be watching Nato's response to it closely.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0f76ad215c1560219d8cc3921d269f7ef3a8809e",
      "title": "Cuba hit with fifth blackout in less than a year with 10m people in the dark",
      "url": "https://www.theguardian.com/world/2025/sep/10/cuba-electricity-power-blackout",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:28:09.000Z",
      "summary_90w": "",
      "raw": "Grid failure follows string of nationwide blackouts that plunged antiquated power system into near-total disarray\nEmergency crews were working to restore power to 10 million people on Wednesday as Cuba suffered its fifth nationwide blackout in under a year, the energy ministry announced.\n“There has been a total disconnection of the electric system,” the energy ministry and National Electric Union said early on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fdcf43bd41e1462082cf51354af827b1fd0ebe6",
      "title": "Trump asks EU to impose tariffs of up to 100% on India and China",
      "url": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:59:45.000Z",
      "summary_90w": "",
      "raw": "In effort to end Russia’s war in Ukraine, US president proposes tariffs targeting Putin allies and trade partners\n\nBusiness live – latest updates\n\nEurope live – latest updates\n\nDonald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine.\nThe US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to a White House official.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b70e8456a1017fae26d04b586fb5d56937d0a0",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:56:42.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice\nA court in South Korea has acquitted a woman convicted six decades ago for biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.\nChoi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae. He pinned her to the ground and repeatedly forced his tongue into her mouth, at one point blocking her nose to stop her from breathing, according to court records.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef95c7eba627dce8e41fef5eb513669ce3ed052e",
      "title": "James McAvoy reportedly assaulted  in Toronto bar",
      "url": "https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:12:49.000Z",
      "summary_90w": "",
      "raw": "Actor promoting his directorial debut California Schemin’ at the city’s film festival is reported to have been punched by another drinker\nThe actor James McAvoy was assaulted in a bar in Toronto, it has been reported.\nAccording to People magazine, McAvoy was “sucker punched” by another visitor to Charlotte’s Room bar on Monday evening, two days after the premiere of his directorial debut, California Schemin’, at the Toronto film festival.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5f7bd78ca39fa302ac879fc431ad2a1235ae06",
      "title": "Who is Lachlan Murdoch, the anointed media tycoon?",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535569/lachlan-murdoch-rupert-news-corp-fox",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T09:01:00.000Z",
      "summary_90w": "",
      "raw": "His position in leading News Corp. and Fox is now secure, as his father ends a dramatic succession battle. Lachlan grew up in New York City but has lived in Australia for much of his adult life.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7314c5d1c78502f4efe20b8d90ba421798102985",
      "title": "Federal judge blocks Trump from firing Fed Governor Lisa Cook, for now",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5529281/appeals-court-lisa-cook-federal-reserve-independence-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T03:29:38.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve Governor Lisa Cook won a round in federal court in her bid to keep her job despite President Trump's effort to fire her.  On Wednesday, the Justice Department said Trump would appeal.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "147efeea67aea93f276f37a14b2d4fea1b8c886f",
      "title": "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535813/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:47:28.000Z",
      "summary_90w": "",
      "raw": "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    }
  ]
}