{
  "version": "1755207931849",
  "generatedAt": "2025-08-14T21:45:31.849Z",
  "items": [
    {
      "id": "31fb568606621785f97b875c5080ad0715321823",
      "title": "Australia news live: UTS to ‘suspend’ 140 courses over six faculties; business council proposes plan to cut $110bn red tape",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/15/australia-news-live-business-council-regulation-red-tape-reform-productivity-summit-anthony-albanese-jim-chalmers-pacific-war-anniversary-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T21:35:38.000Z",
      "summary_90w": "",
      "raw": "Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nMike Huckabee ‘disgusted’ by Australia’s recognition of Palestinian state\nThe US Ambassador to Israel, Mike Huckabee, says he is disgusted by Australia joining other key allies in committing to the recognition of a Palestinian state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9bd4eb2fe094595e4db05bcf16f1ce9a09f3a0cc",
      "title": "Four Years after Taliban's Return to Power in Afghanistan, Life for Many has Worsened",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5502836/four-years-after-talibans-return-to-power-in-afghanistan-life-for-many-has-worsened",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T21:31:45.000Z",
      "summary_90w": "",
      "raw": "It's been four years since the U.S. withdrawal from Afghanistan and the\nTaliban's return to power. Life for certain groups has deteriorated\nsignificantly. But the Trump administration says Afghanistan’s conditions have\nimproved in recent years to the point where sending Afghan nationals BACK\ndoes not pose a threat to their safety.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b3d27308930d3de9d890495425ffb65f29ccf7a",
      "title": "King says VJ Day heroes will 'never be forgotten'",
      "url": "https://www.bbc.com/news/articles/cz93j78ed87o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T21:31:12.000Z",
      "summary_90w": "",
      "raw": "A service of remembrance on Friday will mark the 80th anniversary of Victory over Japan Day.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bbe613a476e17138cd63b6a0148c9a93934c307",
      "title": "Supreme Court opens door to social media age-gating in US",
      "url": "https://www.theverge.com/news/759769/supreme-court-mississippi-age-gating-social-media-ruling",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T21:17:19.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court will let Mississippi’s social media age verification law take effect while the case is being argued in court. In an unsigned ruling on Thursday, the court declined to block the law after an emergency petition from trade association NetChoice. The order offers no explanation, but in a concurring opinion, Justice Brett Kavanaugh wrote that the law was “likely unconstitutional” — but that NetChoice hadn’t“sufficiently demonstrated” a risk of harm.\nThe law, HB 1126, requires social media platforms to verify the age of the person creating the account, while blocking users under 18 unless they have permission from a parent. It also states that social media sites must protect underage users from “harmful material” — such as sexual content and material related to self-harm  — as well as restrict data collection. \nNetChoice, which is backed by tech giants like Meta, Google, Amazon, Reddit, and Discord, argues that age verification laws for general-purpose social media violate the First Amendment. Though the trade association won an injunction to block the law last year, the Fifth Circuit Court of Appeals vacated it in April, allowing the law to go into effect. As Justice Kavanaugh noted, however, numerous district courts have blocked similar laws in other states.\n“To be clear, NetChoice has, in my view, demonstrated that it is likely to succeed on the merits — namely, that enforcement of the Mississippi law would likely violate its members’ First Amendment rights.”\nDespite this setback, NetChoice is still confident that it will prevail. “Although we’re disappointed with the Court’s decision, Justice Kavanaugh’s concurrence makes clear that NetChoice will ultimately succeed in defending the First Amendment — not just in this case but across all NetChoice’s ID-for-Speech lawsuits,” Paul Taske, co-director of the NetChoice Litigation Center, said in a statement. “This is merely an unfortunate procedural delay.”\nThe decision comes as lawmakers across the US — and around the world — push age verification mandates designed to protect children from harmful content on the internet. In June, the Supreme Court upheld a Texas law that requires users to verify their ages before accessing porn sites, paving the way for similar laws to take effect — but specifically for platforms focused on adult content. Meanwhile, the UK has begun to enforce a broader online age-gating requirement that asks users to verify their age with a government ID, a face scan, or by entering credit card information on certain websites.\nJennifer Huddleston, a senior fellow at the Cato Institute, said in a statement that age verification laws have “significant impacts on privacy and speech rights of both adult and teen users.” Huddleston notes that today’s decision doesn’t mean the court “will automatically uphold this law as constitutional should it reach it through the full appeals process.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4bb102c0a659a0419f5866ed22013729676d514e",
      "title": "Why one doctor says we're 'walking blind' in the mpox emergency",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/14/g-s1-82460/mpox-virus-emergency",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T21:03:06.000Z",
      "summary_90w": "",
      "raw": "A year ago, on August 14, 2024, the World Health Organization declared mpox a Public Health Emergency of International Concern. Why are health experts so frustrated by the world's response?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efb53e34c0c0115f5bc19bc8b3b76f4757d86fc1",
      "title": "Trump turns up the heat on CEOs and private companies",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5499368/trump-turns-up-the-heat-on-ceos-and-private-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T20:54:02.000Z",
      "summary_90w": "",
      "raw": "Corporate America doesn't want to fight with President Trump in public. But as a result, it's ceding him an unprecedented amount of control over the shape — and future — of U.S. business.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "58317c20d65f7e97b048b1aed22731c6d41f755b",
      "title": "US government is reportedly in discussions to take stake in Intel",
      "url": "https://techcrunch.com/2025/08/14/u-s-government-is-reportedly-in-discussions-to-take-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T20:38:20.000Z",
      "summary_90w": "",
      "raw": "This deal would be meant to help Intel bulk up its U.S. chip manufacturing, including its much-delayed Ohio factory.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a47ea8058ed32c7c351150ab317464755d5a7df3",
      "title": "D.C. clergy slam federal takeover: 'Fear is not a strategy for safety'",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5502749/d-c-clergy-slam-federal-takeover",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T20:36:49.000Z",
      "summary_90w": "",
      "raw": "A group of religious leaders in Washington, D.C. is criticizing President Donald Trump's federal takeover of the District's police force, saying his rhetoric is dehumanizing and counterproductive.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a510821bddac3e95088f59b4be4b6cebe158182",
      "title": "The best Xbox controller to buy right now",
      "url": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T20:30:00.000Z",
      "summary_90w": "",
      "raw": "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing between several high-quality controllers from Microsoft as well as a plethora of great options from the likes of 8BitDo, PowerA, Razer, Scuf, Nacon, and Turtle Beach. Some of them have drift-resistant Hall effect or TMR-based joysticks for improved longevity, yet all of them are good for one reason or another. The days of the cheap “little sibling” controller that looked cool, but barely worked, are over.\nWe’ve spent a ton of time playing all kinds of games (first-person shooters, fighters, third-person action-adventure, racing, indie roguelikes, etc.) to test a wide swath of Xbox controllers, and it may not be a surprise that the standard, Xbox Wireless Controller is the best option for most folks. It makes for a great PC and Steam Deck controller, too. The default Xbox gamepad strikes the right balance of quality, comfort, versatility, and price, but there are several alternatives worth considering.\nFeatured in this article\nBest overall: Xbox Wireless Controller\nThe official Xbox Wireless Controller has a dedicated share button for saving clips and screenshots and sharing them online, Bluetooth support, and a USB-C port for charging up Microsoft’s play-and-charge rechargeable battery.\n\nWhere to Buy:\n\n $64.99 $50.58 at Amazon\n $64.99 $50.58 at Walmart\n $64.99 $54.99 at GameStop\n\nBest budget option: 8BitDo Ultimate Wired Controller for Xbox\nThe latest 8BitDo Ultimate Wired Controller for Xbox includes Hall effect analog sticks and triggers, plus two rear buttons, customizable mapping and sensitivity, and compatibility with PC and mobile devices.\n\nWhere to Buy:\n\n $44.99 $29.99 at 8BitDo\n $44.99 $40.99 at Amazon (at checkout)\n $44.99 at Best Buy\n\n\n\n\n\n\nThe best Xbox controller for most people\nThe best cheap Xbox controller\nThe best “pro” Xbox controller\nA formidable alternative to the Elite\nOther Xbox controllers we tested\nWhat’s coming next?\n\nThe best Xbox controller for most people\nXbox Wireless Controller\n\n\n\nProsCons\n\n\nIncredible value for Xbox Wireless support\nGreat ergonomic design\nSatisfying buttons and triggers\n\nLacks customization\nRequires AA batteries (or an optional rechargeable cell)\n\n\n\nWhere to Buy:\n\n $64.99 $50.58 at Amazon\n $64.99 $50.58 at Walmart\n $64.99 $54.99 at GameStop\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Power: AA batteries or add-on rechargeable\nOkay, I already know what you’re thinking. “The best controller for Xbox is the one that comes with the Xbox?” That may seem like a no-brainer, but this standard controller truly does earn this title as the best. It lacks some extras found on pricier options, but this controller is the distillation of all that has made the last 20 years of Xbox gamepads great, and it shows.\nThanks to Microsoft’s proprietary wireless protocol, this is the only affordable wireless Xbox controller out there. (Third-party wireless options have been trickling out in recent years, but they’re mostly at the high end.) While some hate the standard Xbox wireless controller for its use of AA batteries instead of a built-in rechargeable cell, that also means it’s flexible, allowing for rechargeable AAs or a battery pack. And user-replaceable batteries mean you’re not stuck with a controller that doesn’t hold its charge after years of use. It also works over a USB-C wired connection.\nBut the standard-issue Xbox pad isn’t just great because of its varied connectivity. The hardware itself is excellent for the controller’s $65 (and often less) asking price. The sticks, buttons, triggers, and the sunken dish-shaped D-pad all feel impeccably tight, with the latter having a satisfying clickiness to it. If you’re a hardcore fighting game fan, you’ll probably be best served by a dedicated fight stick or a controller geared toward that genre — one with a superb D-pad like Hori’s Horipad Pro — but the Xbox Wireless Controller is otherwise an extraordinary jack-of-all-trades.\nThe only things it really lacks compared to pricier options are extra, customizable buttons and software tuning for things like stick sensitivity (button remapping is available), though Microsoft does offer cosmetic customization through its Xbox Design Lab, which bumps the price from $79.99 to $116.95 depending on the configuration. There’s a lot to love about these controllers, whether you make your own or pick one from the many colors that Microsoft offers.\nThe best cheap Xbox controller\n8BitDo Ultimate Wired Controller for Xbox\n\n\n\nProsCons\n\n\nInexpensive\nLightweight and comfortable\nSatisfying buttons and Hall effect components\nProgrammable back buttons are easy to press\n\nLacks trigger stops\n\n\n\nWhere to Buy:\n\n $44.99 $29.99 at 8BitDo\n $44.99 $40.49 at Amazon (at checkout)\n $44.99 at Best Buy\n\nConnectivity: Wired / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Wired\nThe 8BitDo Ultimate Wired Controller for Xbox is a fantastic budget model that typically retails for $44.99 but can often be found for as little as $29.99. The shape is reminiscent of Nintendo’s Switch Pro Controller, only a bit smaller, with hints of Xbox influence and a curvaceous design that feels great to hold.\nOn the hardware front, the Ultimate Wired Controller features Hall effect sticks with satisfying tension. It also uses Hall effect triggers with dedicated vibration motors, though it lacks trigger stops, unlike our previous budget pick, the PowerA Advantage Wired. Its D-pad, face buttons, and bumpers are nice and clicky, too, despite being smaller than we’d typically like. It has two rear paddles, remappable buttons, and the ability to save up to three profiles, which you can switch between on the fly using a dedicated button. There’s even a built-in mute switch for audio, which isn’t common on cheaper controllers. You can download the 8BitDo Ultimate Software X app on PC or Xbox to fully customize this controller.\nThe 8BitDo Ultimate Wired works as a wired controller with your PC, but if you prefer wireless connectivity, the company also makes a three-mode wireless version for $69.99 with support for both Bluetooth and 2.4GHz wireless (via a dongle). The wireless version is a bit more expensive, however, and it’s still limited to wired connectivity on Xbox consoles. \nThe best “pro” Xbox controller\nXbox Elite Wireless Controller Series 2\n\n\nScore: 8.5\n\nProsCons\n\n\nExtensive modular customization\nPremium look and feel\nRechargeable battery lasts an incredible 40 hours\n\nPricey\nQuestionable quality control\nNo Hall effect components\n\n\n\nWhere to Buy:\n\n $179.99 $159 at Walmart\n $199.99 at Best Buy\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Up to four / Software customization: Yes / Power: Built-in rechargeable\nThe Xbox Elite Wireless Controller Series 2 is Microsoft’s fanciest controller, and it’s got a lot of nice extras, like better build quality, extra buttons, user-swappable sticks and D-pad, a built-in rechargeable battery, and loads of software customization. Where the standard Xbox controller is constructed entirely of unassuming plastic, the Elite mixes higher quality soft-touch plastic, rubberized grips, and metallic touches for a superior fit and finish. This makes it heftier than the stock controller, and as a result, it just feels nicer in your hands. It also comes with a charging dock and zip-up case with passthrough charging, completing a really nice package for $199.99 (or sometimes less, if it’s on sale). \nThere’s also the stripped-down Elite Series 2 “Core” version with an MSRP of $149.99, which ditches the add-ons but is equally customizable. You can buy them separately in a $59.99 accessories pack, but you’ll end up paying more that way, barring sales or discounts.\nA pricey controller like an Xbox Elite is a bit of a splurge purchase. Most of us are not competing at e-sports levels that require its high-end features. Nevertheless, it’s fun to use something that feels nicer, offers ways to custom-tailor it to your liking, and maybe gives you a slight competitive edge thanks to features like hair triggers and removable rear paddles. In theory, you may be able to get shots off faster in an online shooter with the hair triggers, and you can map the paddles to functions like jump, crouch, reload, etc., while keeping your thumb on the right stick. You could teach yourself claw grip to accomplish the latter with even a cheap wired controller, sure, but it just won’t feel as cool or easy as when using an Elite.\nWhile the Elite is still a great controller in 2025, you should keep in mind that it’s been around since 2019 and a Series 3 revision is feeling long overdue. The Series 2 also has a bit of a reputation for lackluster quality control — with horror stories from users about going through multiple replacements under warranty. Microsoft extended the controller’s warranty from 90 days to a year in late 2020 to help address concerns, but buying an Elite Series 2 may still feel like a slightly risky proposition. It also predates the current-gen implementation of a dedicated Share button, and its potentiometer-based sticks run the risk of stick drift after long-term use (something third parties are addressing with controllers that use drift-free Hall effect sticks, unlike all three big console manufacturers). \nEven so, the Elite 2 remains by far the most well-rounded option for a step-up Xbox controller — thanks in large part to its impressive build and expansive software experience. If all these caveats give you pause, though, there is another promising option.\nRead our Xbox Elite Wireless Controller Series 2 review.\nA formidable alternative to the Elite\nRazer Wolverine V3 Pro\n\n\n\nProsCons\n\n\nSupports Xbox Wireless protocol\nHall effect sticks use replaceable tops\nFour rear buttons smartly positioned for comfort\nTwo extra shoulder buttons add unique versatility\nTrigger stops and back buttons offer a satisfying mouse-like click\n\nExpensive\nRequires a USB dongle\nRazer Synapse software needs work\n\n\n\nWhere to Buy:\n\n $199.99 $171.99 at Amazon\n $199.99 $171.99 at Best Buy\n $199.99 at GameStop\n\nConnectivity: Wireless USB dongle (Xbox / PC), wired / Connector type: USB-C / Mappable rear buttons: Four / Software customization: Yes / Power: Built-in rechargeable\nAt $199.99, Razer’s Wolverine V3 Pro controller is as expensive (or more, depending on available deals) than the Elite Series 2, but it’s worth the cost if you want a high-end controller with drift-free sticks. Not only is the V3 Pro Razer’s first foray into using Hall effect sticks, it’s the company’s first fully wireless Xbox gamepad. It also sports some of the best hair-trigger lockouts around, yielding a mouse-like click usually found on even pricier Scuf controllers (a previous high-ranking pick of ours). \nOther than that, the V3 Pro is similar to the previous V2 Pro, with six remappable buttons — four rear paddles in new, angled orientations and two extra shoulder buttons — and some RGB lighting. The buttons and D-pad still have that satisfying micro-switch tactility and audible clickiness like the previous-gen V2 Pro, but the RGB lighting is more subtle this time around.\nThe Wolverine V3 Pro’s biggest shortcomings compared to Microsoft’s Elite Series 2 are its more basic software customization, its lack of Bluetooth, and the fact that it needs a USB dongle to work wirelessly. The V3 Pro is otherwise the better pick if you can justify its high price, which, unlike the Series 2, is rarely subjected to discounts. Luckily, if you can’t, there’s also the $99.99 Wolverine V3 Pro Tournament Edition that has a nearly identical set of features in a wired configuration.\nOther Xbox controllers we tested\nThe Scuf Valor Pro is the company’s first Xbox controller with Hall effect sticks, as well as its cheapest at $109.99. It’s wired but otherwise builds admirably on the foundation laid by the Scuf Instinct Pro, which retails for $239.99 and was once our top third-party pro-style controller. Scuf emulates Microsoft’s winning ergonomics while implementing redesigned remappable rear buttons (two are removable) and shoulder bumpers that are more comfortable to reach. It also has trigger stops that produce a satisfying click with next to no travel when pressed. The D-pad produces a similarly satisfying click, one we prefer over the softer tactile feel of the Instinct. The Valor Pro is not the most exciting controller on paper, but it’s a solid option for Scuf faithful or anyone who wants more durable analog sticks. Read our hands-on impressions.\nIf you’re a fan of competitive shooters, Turtle Beach controllers like the Recon ($59.99) and React-R ($39.99) have several audio features that might come in handy. The company’s fanciest option, the Stealth Ultra, is a $219.99 wireless model with Hall effect sticks that’s an excellent choice overall. That being said, we still prefer the Razer Wolverine V3 Pro, as the built-in customization screen on the Stealth Ultra is clunky to use and the ergonomics don’t feel nearly as nice as that of the V3 Pro.\nTurtle Beach also offers the Stealth Pivot ($139.99), which lets you quickly swap the analog sticks for extra face buttons by swiveling the plates around. It’s neat but ultimately niche, as it’s primarily meant for fighting games and retro titles. That feature necessitates a chassis that’s noticeably bigger than most controllers, too, which may be a downer if you already struggle with wrapping your digits around standard-sized controllers.\nWe tested PowerA’s latest pro-style Xbox controllers, including the Fusion Pro 4 Wired ($74.99) and PowerA Fusion Pro Wireless ($159.99). They’re standard fare for pro-style controllers these days, with height-adjustable Hall effect sticks, four remappable rear buttons, three-way trigger locks, and onboard volume controls. They’re similar, but the Pro Wireless has four trippy Lumectra lighting zones that respond to your button presses. Both controllers are satisfying to use and a clear step up from PowerA’s older products in terms of overall quality, but they ultimately don’t stand out much at these price points.\nNacon’s Revolution X ($25.90) remains one of the most customizable wired controllers you can get (it even has removable weights in its handles), and its software is nearly as expansive as Microsoft’s first-party app.\nAs mentioned above, the Horipad Pro ($49.99) has one of the best D-pads around. It also offers a lot of software customization at an affordable price, but its shoulder buttons are a bit stiff.\nIf you’re the nostalgic type, the Hyperkin Duke ($89.99), DuchesS ($49.99), and Xenon ($49.99) are faithful wired recreations of Xbox gamepads from Microsoft’s first two console generations. They’re kind of dumb but endearing (especially the chunky Duke), but they’re unique collector pieces you can also use on modern games.\nThe wired GameSir G7 SE is another budget pick with drift-resistant Hall effect sticks and USB-C connectivity, one that can typically be found for $44.99. Like 8BitDo’s controllers, it neglects trigger stops, but it’s one of the only options with dedicated switches for disabling the rear buttons. GameSir has also since introduced the $49.99 G7 HE, which features more durable buttons and a tactile switch D-pad.\nWhat’s coming next?\nWe’re testing GameSir’s G7 Pro, a $79.99 controller that’s compatible with Xbox (wired), PC (wired and wireless via an included 2.4GHz dongle), and Android (wireless via Bluetooth).  The G7 Pro has drift-resistant TMR joysticks, Hall effect analog triggers, four customizable buttons, four rumble motors, and a 3.5mm audio jack. The controller comes with a charging dock, a three meter-long USB-C to USB-A cable, and two swappable D-pads.\nHyperkin Competitor was at announced at CES in January and is scheduled to arrive later in 2025. The wired gamepad’s design is unashamedly inspired by the PlayStation 5’s DualSense controllers, complete with glassy buttons and a non-contiguous D-pad.\nUpdate, August 14th: Updated to reflect current pricing / availability, and to note we’ll be testing GameSir’s G7 Pro. Brandt Ranj also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0dd3f49325b8f29acc7f0340cf4eacb3e8ceb8e",
      "title": "What do Putin and Trump each want from the Alaska summit?",
      "url": "https://www.bbc.com/news/articles/c776ddjer8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T20:16:44.000Z",
      "summary_90w": "",
      "raw": "BBC Russia editor Steve Rosenberg and North America correspondent Anthony Zurcher consider the leaders' contrasting priorities as they prepare for talks on Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0697fe82ad54f5d15966fc7ba7f881e11248f1a",
      "title": "Failed New Mexico candidate gets 80 years in shootings at rivals' homes",
      "url": "https://www.npr.org/2025/08/14/g-s1-82637/failed-new-mexico-candidate-gets-80-years-in-shootings-at-rivals-homes",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T20:13:20.000Z",
      "summary_90w": "",
      "raw": "A jury convicted former Republican candidate Solomon Peña of conspiracy, weapons and other charges in the shootings in 2022 and 2023 on the homes of four Democratic officials in Albuquerque, including the current state House speaker.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a1cf0d3ba0c3e1d8fc90c3aeae10aba9799884f",
      "title": "China is about to launch SSDs so small you insert them like a SIM card",
      "url": "https://www.theverge.com/news/759624/china-is-about-to-launch-ssds-so-small-you-insert-them-like-a-sim-card",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T19:41:23.000Z",
      "summary_90w": "",
      "raw": "MicroSD cards are tiny but slow; the M.2 storage sticks in your PC are blazing fast but bigger and fully enclosed. Now, a new type of SSD out of China could be the best of both worlds — and it’s already set to appear in two cutting-edge gaming portables.\nChinese storage manufacturer Biwin is calling it the “Mini SSD,” though another manufacturer refers to it as the “1517”; it measures just 15mm x 17mm x 1.4mm thick, smaller than a U.S. penny and just slightly larger than MicroSD. Despite that, it offers maximum sequential read speeds of 3,700 megabytes per second (or 3,400MB/s writes) over a PCIe 4×2 connection, and offers 512GB, 1TB and 2TB capacities.\n\n\n\n\nTo put that in context, the new MicroSD Express cards that work with the Nintendo Switch 2 top out at a theoretical 985MB/s, less than a third the speed. And while a full-size SD Express card could theoretically beat Mini SSD at 3,940MB/s, it would be nearly twice the size of Biwin’s creation. \nThe nano-SIMs used in recent smartphones are still smaller, though, and M.2 drives are still faster. I whipped up a quick chart so you can easily compare various storage cards and SIMs:\n\nTypeLengthWidthHeightTheoretical max speed\n\nMini SSD15mm17mm1.4mm3,700MB/s\nMicroSD11mm15mm1mm985MB/s\nSD24mm32mm~2mm (varies)3,940MB/s\nM.2 223022mm30mm~2mm (varies)~8,000MB/s\nM.2 228022mm80mm~2mm (varies)~14,000MB/s\nNano-SIM8.8mm12.3mm0.67mmN/A\nMicro-SIM12mm15mm0.76mmN/A\nMini-SIM15mm25mm0.76mmN/A\n\n\n\nIt’s not clear if Biwin’s Mini SSD is a true standard that other storage makers can easily adopt. But the company’s marketing it for laptops, tablets, phones, cameras and more, with its own dedicated slot that works exactly like smartphone SIM card slots: stick in a pin to remove the tray.\nThe company claims IP68 water and dust resistance, which could be handy for phones in particular, and three-meter drop resistance.\nTwo cutting-edge Chinese gaming portables already appear to be customers, both of which made announcements at ChinaJoy this past week. There’s the GPD Win 5, the monster battery backpack wielding Strix Halo handheld we told you about in July, which you can see with the new SSD in the video atop this story. \nOneNetbook’s upcoming OneXPlayer Super X hybrid laptop/tablet, which has the same Strix Halo chip, is also now advertising a dedicated “card slot” for a mini SSD.\nWe don’t have any idea of pricing on these new SSDs, and have seen no product listings for them yet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8de5706d62e1695f8815e2a6a51f4dcaf3caba30",
      "title": "Israeli settlement plans will 'bury' idea of Palestinian state, minister says",
      "url": "https://www.bbc.com/news/articles/ckgdzxpkdd7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T19:36:37.000Z",
      "summary_90w": "",
      "raw": "Far-right Israeli minister Bezalel Smotrich announced approval for 3,401 new homes in the controversial E1 area project in the occupied West Bank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8bd9a7320a4ff7c1d89496e895977e102901f9cc",
      "title": "Nanoleaf&#8217;s smart lights are cheaper than ever in its back-to-school sale",
      "url": "https://www.theverge.com/tech/759620/nanoleaf-back-to-school-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T19:04:28.000Z",
      "summary_90w": "",
      "raw": "Nanoleaf’s Lines let you unleash your creativity as you can arrange them in all kinds of fun patterns.\t\n\nSome cool decor can help a new dorm or apartment feel like home, which is why Nanoleaf’s back-to-school sale is worth checking out.  The company’s offering all-time low prices on a wide range of its modular smart light gear, from skylights to smart light display cases. Some of our favorite deals include Nanoleaf’s Blocks Combo XL, which Amazon, Nanoleaf, and Best Buy are selling for $179.99 ($20 off). The Nanoleaf Lines is another highlight that’s down $20 to $139.99 (Amazon, Nanoleaf, Best Buy). For those on tighter budgets, Nanoleaf’s Essentials Matter smart bulbs are $23.99 ($6 off) at Amazon and directly from Nanoleaf. Below, we’ll dive into the unique characteristics of each pick.\nIf you’re looking for a stylish way to keep your space organized, Nanoleaf’s Blocks Combo XL include nine square color-changing LED panels with a pegboard, shelf, and a hook, perfect for showing off wall art and for storing things like headphones and small plants. The panels can be rearranged to fit your wall, though bear in mind you’ll need to drill into your wall to use the pegboards and shelves. A physical light controller comes included, but the Blocks also connect over Wi-Fi and can be controlled via Apple Home, Google Home, Amazon Alexa, and Samsung SmartThings.\nNanoleaf Blocks Combo XL Smarter Kit\nNanoleaf’s Blocks Combo XL kit can elevate any gaming setup or productivity space. It comes with nine square color-changing LED panels, along with an accent board with a hook for headphones. You can slot the included shelf into the pegboard to hold faux plants or your latest Funko Pops, and like most Nanoleaf wares, you can always pick up more modular components at Nanoleaf’s website.\n\nWhere to Buy:\n\n $249.99 $199.99 at Amazon\n $249.99 $199.99 at Best Buy\n $249.99 $199.99 at Nanoleaf\n\nThe Nanoleaf Lines let you get creative with nine colorful LED squares you can hang up on your wall and arrange in a variety of patterns. The lights can also sync and pulse to the beat of your music, and mimic the colors on your monitor or TV screen, creating a more immersive experience when you’re gaming or streaming. Nanoleaf additionally includes dynamic 19 pre-loaded scenes in its companion app, which includes modes that offer warm sunset glows, a festive vibe for during the holidays, and energetic party effects. And like the Block, the Lines work with Amazon Alexa, Apple HomeKit, and Google Assistant while adding support for Thread, so they can integrate with Matter. \nNanoleaf Lines Smarter Kit (60 degrees, nine-light kit)\nThe Nanoleaf Lines Smarter Kit comes with an adapter and nine LED light bars, allowing you to add color to your wall in a variety of patterns. The lights can also sync with your music, mirror the colors on your display, or make use of an assortment of preloaded scenes via a companion app.\n\nWhere to Buy:\n\n $159.99 $139.99 at Amazon\n $159.99 $139.99 at Best Buy\n $159.99 $139.99 at Nanoleaf\n\nFor something simpler and more budget-friendly, you can buy a pair of Nanoleaf Essentials Matter smart bulbs. They radiate 1,100 lumens of brightness and display over 16 millions colors, while Matter support means they can work with a wide range of smart home platforms. And, like the Block and Lines, they can change colors and come with all kinds of scenes to set the mood.\nNanoleal Essentials Matter smart bulbs\nNanoleaf’s color-changing Essentials Matter smart bulbs offer 1,100 lumens of brightness and support for Matter support, so you can connect them to a wide a range of smart home platforms.\n\nWhere to Buy:\n\n $29.99 $23.99 at Amazon\n $29.99 $23.99 at Nanoleaf\n\nRead our reviews of the Nanoleaf Lines and Nanoleaf Essentials Matter Smart Bulbs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7aede92d1e15898007a7f143782191fed36fefef",
      "title": "Minns unveils plan to fight anti-Muslim hate: ‘Naked racism and Islamophobia have no place in our state’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/15/minns-unveils-plan-to-fight-anti-muslim-hate-naked-racism-and-islamophobia-have-no-place-in-our-state-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T19:00:10.000Z",
      "summary_90w": "",
      "raw": "Exclusive: $1m grant comes after reports of rising Islamophobia and a huge turnout for the Sydney Harbour Bridge march\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Minns government will establish a $1m program to combat anti-Muslim hate, including establishing a support hotline for victims and a program to build awareness of Islamophobia.\nThe initiative will fund a support hotline for those experiencing Islamophobia and a case management system for victims of abuse so authorities and the community have better information about what behaviours are being experienced.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac88ecf9b5a258cc857a8607c52aa853dcc28554",
      "title": "Countries urged to ‘hold the line’ in Geneva plastics treaty negotiations",
      "url": "https://www.theguardian.com/environment/2025/aug/14/geneva-plastics-treaty-negotiations-un-final-day",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T18:59:41.000Z",
      "summary_90w": "",
      "raw": "Talks continue amid warnings from environmental groups over being ‘sold out’ without meaningful or legally binding measures\nTalks between nations to hammer out a plastics treaty to end plastic pollution continued behind closed doors in Geneva on Thursday, the final day of negotiations, as civil society groups urged countries to “hold the line” to secure a strong agreement.\nWith time running out to seal a deal between 184 countries, environmental groups expressed concern that frontline communities, Indigenous people and others suffering the worst impacts of the world’s growing plastic crisis were being “sold out” in an effort to secure a treaty, without meaningful or legally binding measures that would address the scale of the problem, “at any cost”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b496f6ddb830a6861f17c48a354336ffcc3871a",
      "title": "What is Bluesky? Everything to know about the X competitor",
      "url": "https://techcrunch.com/2025/08/14/what-is-bluesky-everything-to-know-about-the-x-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:59.000Z",
      "summary_90w": "",
      "raw": "We’ve compiled the answers to some of the most common questions users have about Bluesky.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7cedea8287c90818e33157aacce663554f41001",
      "title": "The wait is almost over: The 2025 Startup Battlefield 200 list drops August 27",
      "url": "https://techcrunch.com/2025/08/14/the-wait-is-almost-over-the-2025-startup-battlefield-200-list-drops-august-27/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:46.000Z",
      "summary_90w": "",
      "raw": "After reviewing thousands of groundbreaking applications from around the globe, TechCrunch is just days away from announcing the 2025 Startup Battlefield 200.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "467fd47571f03b8203e74e00039e862ea2b2abf4",
      "title": "Bluesky rolls out massive revamp to policies and Community Guidelines",
      "url": "https://techcrunch.com/2025/08/14/bluesky-rolls-out-massive-revamp-to-policies-and-community-guidelines/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:49:58.000Z",
      "summary_90w": "",
      "raw": "Some of the changes represent an effort by Bluesky to purposefully shape its community and the behavior of its users, nudging them to be nicer and more respectful of others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d53ac6e1fa73f42b9d3f0263f6f070159b7b806",
      "title": "Trump and Putin have history. That adds to the intrigue for Anchorage summit",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5499354/trump-putin-alaska-summit-helsinki",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T18:43:50.000Z",
      "summary_90w": "",
      "raw": "President Trump says he'll know \"probably in the first two minutes\" whether Vladimir Putin is serious about ending the war in Ukraine, touting his past relationship with the Russian leader.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5efca020d82fc2b5297a191f193e823c3a41f7e6",
      "title": "Airbnb now lets you ‘pay later’ on vacation rentals",
      "url": "https://www.theverge.com/news/759637/airbnb-reserve-now-pay-later-stays",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T18:33:14.000Z",
      "summary_90w": "",
      "raw": "Airbnb has introduced a new “reserve now, pay later” option that lets users in the US book a reservation without paying right away. Instead, users can put off their payment to a later date before check-in.\nAirbnb says it will require payment before the end of a stay’s free cancellation period, ensuring “hosts have time to secure another booking even if a guest cancels.” The option is only available for stays in the US with a moderate or flexible cancellation policy. Airbnb also notes that it will still charge upfront for travel insurance, climate contribution, or other optional add-ons.\nWhile Airbnb already offers a “pay part now, pay later” option, which allows users to pay part of their bill at checkout and the rest before check-in, this new method means users don’t have to make a payment at the time of booking at all. Airbnb offers payments with the buy now pay later service, Klarna, as well.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e26e1583258bda8942994aff606848d94e37766c",
      "title": "Norway spy chief blames Russian hackers for hijacking dam",
      "url": "https://techcrunch.com/2025/08/14/norway-spy-chief-blames-russian-hackers-for-hijacking-dam/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:32:02.000Z",
      "summary_90w": "",
      "raw": "The Russian hackers used their access to the dam's computer systems to open a floodgate that spilled millions of gallons of water.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b0903a26d20204e5bf70303db8f770be896e51e",
      "title": "Supreme Court allows Mississippi social media law to go into effect",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5482925/scotus-netchoice",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T18:19:09.000Z",
      "summary_90w": "",
      "raw": "The law requires all users to verify their ages before using common social media sites ranging from Facebook to Nextdoor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9659248ad6b59c307405ffedee8747dd5d2eb16",
      "title": "Teenager arrested after death of 13-year-old girl in Huddersfield",
      "url": "https://www.bbc.com/news/articles/cj9w7y1rz4jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:48:33.000Z",
      "summary_90w": "",
      "raw": "The girl was found unresponsive at a flat in Huddersfield and died in hospital, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82b57a913289c290a26d37e4da0d32d75821fc3f",
      "title": "Israel appears set to approve highly controversial 3,400-home West Bank settlement",
      "url": "https://www.theguardian.com/world/2025/aug/14/israel-appears-set-to-approve-controversial-settlement-of-3400-homes-in-west-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T17:48:03.000Z",
      "summary_90w": "",
      "raw": "Finance minister Bezalel Smotrich has said he believes E1 plan will ‘bury the idea of a Palestinian state’\nIsrael appears set to give formal planning approval to a highly controversial settlement project for more than 3,400 new homes that has been frozen for decades and which critics say would split the occupied West Bank in half.\nStrongly opposed by the international community, the so-called E1 plan would extend the existing Jewish settlement of Ma’ale Adumim towards Jerusalem, further cutting occupied east Jerusalem from the West Bank, and further separating the north and south of the territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "421e772239efc79b6bf7f88def1109151bef74df",
      "title": "Cohere hits a $6.8B valuation as investors AMD, Nvidia, and Salesforce double down",
      "url": "https://techcrunch.com/2025/08/14/cohere-hits-a-6-8b-valuation-as-investors-amd-nvidia-and-salesforce-double-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T17:40:27.000Z",
      "summary_90w": "",
      "raw": "Cohere's market proposition has always been to offer secure LLMs specifically geared for enterprise use, not for consumers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a82cb30f0bb98c93b2ba78daa934988fd2339794",
      "title": "Consumer safety groups are demanding an FTC investigation into Grok’s ‘Spicy’ mode",
      "url": "https://www.theverge.com/x-ai/759554/consumer-safety-groups-are-demanding-an-ftc-investigation-into-groks-spicy-mode-elon-musk-grok-imagine-xai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T17:37:01.000Z",
      "summary_90w": "",
      "raw": "A new letter to the Federal Trade Commission, and US attorneys general for all 50 states and the District of Columbia, calls for an urgent investigation into Elon Musk's Grok - especially its new \"Imagine\" tool for AI-generated image and video. \nThe tool, released by xAI earlier this month, encourages users to create NSFW content via a \"Spicy\" mode, and the first time The Verge tested it, the tool created topless deepfake videos of Taylor Swift, even without being asked to do so.\nToday's letter was spearheaded by the Consumer Federation of America (CFA) and signed by 14 other consumer protection organizations, including the Tech Oversight  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "876703761007f455fac31cbdce6504a4496550fe",
      "title": "Watch: How Trump's drive to his golf course shaped homeless crackdown",
      "url": "https://www.bbc.com/news/videos/czd0r0ej76ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:36:26.000Z",
      "summary_90w": "",
      "raw": "What the president sees on his journey out of Washington DC helps explain this week's push to clean up the capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4d10ba1a47be233a7ef79397817a6a6a5bf3801",
      "title": "Why did boys outperform girls at top A-level grades?",
      "url": "https://www.bbc.com/news/articles/c62707l4lwvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:33:42.000Z",
      "summary_90w": "",
      "raw": "The percentage of boys' grades that were A* or A was 28.4%, narrowly beating the 28.2% achieved by girls.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "468787c88e3acddce5b9038c057ce4eff79d5d68",
      "title": "Pupil who invented device to help homeless named among 'girls of the year'",
      "url": "https://www.bbc.com/news/articles/c9wyv1r0yjeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:32:33.000Z",
      "summary_90w": "",
      "raw": "Rebecca Young, 12, was recognised for designing a solar-powered backpack with an electric blanket inside.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2deef6e45599cc3630640a2ba9dbdb673997e6a",
      "title": "Melania Trump threatens to sue Hunter Biden for $1bn over Epstein claim",
      "url": "https://www.bbc.com/news/articles/cqjyw0l9d82o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T17:21:01.000Z",
      "summary_90w": "",
      "raw": "The first lady's lawyer has demanded that Joe Biden's son retract claims he made about how she met her husband.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6f36d488f8fadfe5f0baab838fb5d1543b2e89ad",
      "title": "Meta’s AI policies let chatbots get romantic with minors",
      "url": "https://www.theverge.com/news/759562/meta-ai-rules-chatbots-romantic-minors",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T17:10:21.000Z",
      "summary_90w": "",
      "raw": "In an internal document, Meta included policies that allowed its AI chatbots to flirt and speak with children using romantic language, according to a report from Reuters. \nQuotes from the document highlighted by Reuters include letting Meta’s AI chatbots “engage a child in conversations that are romantic or sensual,” “describe a child in terms that evidence their attractiveness,” and say to a shirtless eight-year-old that “every inch of you is a masterpiece – a treasure I cherish deeply.” Some lines were drawn, though. The document says it is not okay for a chatbot to “describe a child under 13 years old in terms that indicate they are sexually desirable.”\nFollowing questions from Reuters, Meta confirmed the veracity of the document but then revised and removed parts of it. “We have clear policies on what kind of responses AI characters can offer, and those policies prohibit content that sexualizes children and sexualized role play between adults and minors,” spokesperson Andy Stone tells The Verge. “Separate from the policies, there are hundreds of examples, notes, and annotations that reflect teams grappling with different hypothetical scenarios. The examples and notes in question were and are erroneous and inconsistent with our policies, and have been removed.”\nStone did not explain who added the notes or how long they were in the document.\nReuters also highlighted other parts of Meta’s AI policies, including that it can’t use hate speech but is allowed to “to create statements that demean people on the basis of their protected characteristics.” Meta AI is allowed to generate content that is false as long as, Reuters writes, “there’s an explicit acknowledgement that the material is untrue.” And Meta AI can also create images of violence as long as they don’t include death or gore.\nReuters published a separate report about how a man died after falling while trying to meet up with one of Meta’s AI chatbots, which had told the man it was a real person and had romantic conversations with him.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "17869ae56d5f28d47c5baaa85e7dd9d125214732",
      "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/14/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T17:05:41.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ec87f585049392af30a0bf135748b80d3c51daf7",
      "title": "EU sends wildfire help to Spain as death toll rises",
      "url": "https://www.bbc.com/news/articles/ckg4k7ppmnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:05:13.000Z",
      "summary_90w": "",
      "raw": "Spain has activated an EU disaster assistance mechanism for the first time in response to the fires.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f77fbda874bd5cec3e85029dda4d994227efeae4",
      "title": "Teenager's death after hospital failings is ruled unlawful",
      "url": "https://www.bbc.com/news/articles/c17np9vly51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:04:48.000Z",
      "summary_90w": "",
      "raw": "An inquest jury finds 14-year-old Ruth Szymankiewicz was unlawfully killed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5929122a00c455ed899f0ea4f47e368f8ef1889a",
      "title": "Stop using these ESR power banks that have been recalled for fire and explosion risks",
      "url": "https://www.theverge.com/news/759512/recall-esr-halolock-wireless-power-bank-2g520-2g505b-2g512b",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T17:01:42.000Z",
      "summary_90w": "",
      "raw": "Two of the recalled power bank models featured built-in kickstands. | Image: ESR\t\n\nESR has issued a recall for 33,000 HaloLock wireless power banks, in 6,000mAh and 10,000mAh versions, because their lithium-ion batteries can “overheat and ignite, posing fire and burn hazards to consumers.” The power banks were cheaper alternatives to Apple’s MagSafe accessories (priced between $32 and $40) but offered slower 7.5W wireless charging speeds when used with an iPhone. Other Qi2 compatible chargers offer at least 15W speeds.\nThe company has received nine reports of the power banks catching fire and exploding, causing around $20,000 of property damage, but no injuries, according to the US Consumer Product Safety Commission (CPSC). Although the exact model number wasn’t revealed, seven months ago, a Reddit user shared images of the aftermath of a power bank exploding and catching fire in their home, which they later identified as an “ESR 10000 mah wireless portable charger.”\nApproximately 24,000 power banks were sold in the US through Amazon, Home Depot, and ESR’s online stores between September 2023 and July 2025, plus an additional 9,000 in Canada.\nCPSC:\nThis recall involves ESR HaloLock wireless power banks with model numbers 2G520, 2G505B and 2G512B. “ESR” is printed on the back and the model number is printed on the right side of the pocket-size power banks. They were sold in dark blue, light blue, gray, white and black. All recalled models have five circular LED display lights on one side.\nConsumers are urged to stop using the recalled power banks immediately, even if they seem to be functioning properly, but before properly disposing of them, they can contact ESR for a full refund. The company is asking owners to send a photo of the power bank showing its model number and the word “recalled” written on it in permanent marker to support@esrtech.com.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed026e761056442c26c35650e325af8bee395a29",
      "title": "Watch: Every angle of largest cooling tower collapse",
      "url": "https://www.bbc.com/news/videos/cqle96yxd1vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:00:01.000Z",
      "summary_90w": "",
      "raw": "Contractors say the flattening of eight structures was the largest ever simultaneous demolition of cooling towers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6af0aeed4570ffd0882db1fb202801ed41d4abbe",
      "title": "Acura’s RSX prototype is a taste of what’s to come with Honda Zero",
      "url": "https://www.theverge.com/honda/759331/acura-rsx-prototype-monterey-honda-zero-asimo",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Acura is bringing back the RSX sedan as a premium, dramatic-looking, all-wheel drive electric crossover that’s also the first model engineered in-house on Honda’s new global EV Platform. This is the same platform that will eventually underpin the automaker’s Zero series, which is expected to go into production next year along with the RSX. So suffice it to say, the resurrected RSX is a big deal for Acura and its parent company. \nThe RSX Prototype is making its global debut this week at two Monterey Car Week events: The Quail Motorsports Gathering and Pebble Beach Concours d’Elegance. Acura says it will assemble the RSX at Honda’s EV Hub in Ohio, on same production line as Acura Integra, starting in the second half of 2026. \nWhen it arrives, the all-electric SUV will help kick off what Honda anticipates will be a new era of software-defined vehicles. That’s because the RSK will debut the proprietary, in-house-developed Asimo operating system that Honda announced CES earlier this year. Asimo will control the vehicle’s core functions and receive updates over the air, so it theoretically can improve over time. Asimo will also underpin the automaker’s new Honda Zero vehicles, with the first being the Honda 0 SUV. So far, Acura’s only EV in the market is the ZDX, which, like Honda’s Prologue, is built on GM’s Ultium EV platform.\nThe RSX Prototype is based on the Performance EV concept that was revealed at last year’s Monterey Car Week. The Prototype retains a lot of the sharp angles that gave the concept an almost boat-like appearance. But while it certainly isn’t as wild-looking as the concept, the Prototype’s front end is assertive and in your face, with slit-like daytime running lights that offset the Acura logo in the middle. Acura says that the full-width rear taillight are meant as a homage to the second generation NSX, complemented by a new “ACURA” logo splashed across the tailgate. (In other NSX news, Honda has said to expect a new “NSX-type” electric sports car in the works for 2027 or 2028.)\nAcura isn’t releasing any of the key specs yet, which makes sense since this is still just a prototype. So we’ll have to wait a little longer to learn about the range, battery size, acceleration, and price. The Prototype rides on multi-spoke 21-inch rims, with the bright red calipers of the large front Brembo brakes peaking through. A coupe-like silhouette and a fastback roofline is sure to be an indication of impressive performance capabilities. \nIn another first for Acura and Honda, the RSX Prototype can serve as a mobile energy unit that can power other appliances, including a whole house. Bidirectional charging is increasingly becoming a highly sought after feature in new EVs, so Acura is trying to get ahead of that trend with the RSX.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "85b1d0d31edbcd7c53ecb9e8d80c8edefab1e42b",
      "title": "HyperX&#8217;s new gaming headset claims to last 250 hours on a single charge",
      "url": "https://www.theverge.com/news/759290/hyperxs-new-gaming-headset-claims-to-last-250-hours-on-a-single-charge",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-14T17:00:00.000Z",
      "summary_90w": "",
      "raw": "What’s black and white and RGB all over?\t\n\nHP-owned HyperX is announcing a slew of new gaming headsets and streaming-friendly microphones. The HyperX Cloud Alpha 2 is the new flagship at $299.99. It uses 53mm drivers and 2.4GHz wireless lasting up to 250 hours —  an impressive 10+ days of continuous use — though it drops to half that when simultaneously connected to Bluetooth. Its showiest feature is its included base station, with six customizable light-up buttons and a big old rotary volume knob.\nThere’s also a cheaper Cloud Flight 2 with RGB side panels that will cost $129.99 for PlayStation / PC or $139.99 for Xbox. For mics, there’s the $59.99 SoloCast 2 side-address desktop mic and $229.99 HyperX FlipCast “broadcast quality” podcast / streaming mic. The FlipCast looks a bit like Shure’s MV7 mic with RGB lighting. And like an MV7, it has both USB and XLR ports.\nThe new headsets and mics are due out this month, except the Cloud Flight 2 which is expected in October.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd8c53cabfe9ae1d5cfba3fe397e824816a71ec5",
      "title": "Putin ready to make Ukraine deal, Trump says before Alaska summit",
      "url": "https://www.theguardian.com/world/2025/aug/14/keir-starmer-to-meet-volodymyr-zelenskyy-in-downing-street",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:56:50.000Z",
      "summary_90w": "",
      "raw": "US president’s comment that Russian and Ukrainian leaders may have to ‘divvy’ things up likely to raise alarm\nDonald Trump has said he believes Vladimir Putin is ready to make a deal on the war in Ukraine as the two leaders prepare for their summit in Alaska on Friday, but his suggestion the Russian leader and Volodymyr Zelenskyy could “divvy things up” may alarm some in Kyiv.\nThe US president implied there was a 75% chance of the Alaska meeting succeeding, and that the threat of economic sanctions may have made Putin more willing to seek an end to the war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5782abee4feef22bf79db80afbc62e77940a236e",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/14/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T16:55:27.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3b0ee50ccd8695834633a0b3dacf0b18a59c00ba",
      "title": "Trump says Putin ‘wants to get it done’ at tomorrow’s Alaska summit, as he floats idea of second meeting with Zelenskyy – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/14/europe-weather-extreme-temperatures-wildfires-trump-putin-talks-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:55:15.000Z",
      "summary_90w": "",
      "raw": "US president indicates in interview that any deal would not be made without Zelenskyy ahead of Friday’s meeting in Alaska\nin Berlin\nGerman chancellor Friedrich Merz’s stab at heading up Ukraine diplomacy has received measured praise at home, with a perception that Donald Trump’s declarations after Wednesday’s video conference sounded slightly less alarming to European ears than before.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54306786e0cd75f7e259757a553948a106321a15",
      "title": "Burial 'fat tax' on wider plots at council cemetery criticised",
      "url": "https://www.bbc.com/news/articles/c4gzx347z4vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T16:51:50.000Z",
      "summary_90w": "",
      "raw": "Following a BBC investigation, the council has decided \"not to proceed with the plans\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac81e819fdbbce9fe24979a413939d1dde4327e0",
      "title": "Kodak denies it’s shutting down amid media reports of financial struggles",
      "url": "https://techcrunch.com/2025/08/14/kodak-denies-its-shutting-down-amid-media-reports-of-financial-struggles/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T16:39:11.000Z",
      "summary_90w": "",
      "raw": "Kodak strikes back at media reports suggesting it may go out of business or file for bankruptcy (again).",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe366ce4bd1507659f73b8b7ea24e811c914b683",
      "title": "'The culmination of a lot of hard work': Joy, relief and worry as students get results",
      "url": "https://www.bbc.com/news/articles/c987n7605dwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T16:36:52.000Z",
      "summary_90w": "",
      "raw": "After a nerve-wracking wait, students react to their results and share what they plan to do next.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23a28f3450ca1c70cb17232462a974b72ecca35a",
      "title": "Cost of weight-loss drug Mounjaro could rise significantly",
      "url": "https://www.bbc.com/news/articles/c5ylppp2vj9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T16:36:24.000Z",
      "summary_90w": "",
      "raw": "The recommended UK price will rise by up to 170%, although the impact on consumers could be more limited.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0710312571eb130a9136651bd7f50b3a1f358afa",
      "title": "Takeaways from Taylor Swift's podcast appearance: her new album, romance and more",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5502415/taylor-swift-podcast-new-album-life-showgirl-kelce",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T16:22:56.000Z",
      "summary_90w": "",
      "raw": "Swift revealed the release date, cover art and track list for The Life of a Showgirl. She also discussed her romance with Travis Kelce, buying back her masters and recovering from the Eras Tour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bb7fbbf22261c69523d382527bfb7191ed2fb96",
      "title": "Blackwater founder Erik Prince to send hundreds of fighters to strife-torn Haiti",
      "url": "https://www.theguardian.com/world/2025/aug/14/erik-prince-blackwater-haiti",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:19:48.000Z",
      "summary_90w": "",
      "raw": "Critics say Vectus Global’s presence – including snipers – will undermine Haiti’s police and UN security force\nHundreds of combatants from the US, Europe and El Salvador will reportedly be deployed to Haiti in the coming weeks to battle the country’s gangs as part of a mission led by the controversial Blackwater founder and Donald Trump backer Erik Prince.\nAccording to Reuters, Prince’s new security firm, Vectus Global – which has been operating in the violence-ravaged Caribbean country since March – is preparing to intensify its activities there to help authorities win key roads and territories back from heavily armed criminal groups.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c36f42600eaca1d03b637db5d408ffe645c1036d",
      "title": "‘Why would you take away a parking place?’: the city where anyone can build an urban oasis",
      "url": "https://www.theguardian.com/environment/2025/aug/14/why-would-you-take-away-a-parking-place-the-city-where-anyone-can-build-an-urban-oasis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:07:45.000Z",
      "summary_90w": "",
      "raw": "Grätzloasen – low-cost, urban ‘parklets’ built by volunteers – are on the rise in Vienna as sceptics are being won over by the splash of welcome greenery and boost to community spirits\nIn a quiet corner of Vienna’s well-to-do 18th district, Jana is explaining how her assembly of wooden decking and planters is bringing a bit of greenery to the area. “There’s not a single tree on this whole street – it’s just parking spaces on both sides.”\nThis is a grätzloase, or neighbourhood oasis – a miniature park tucked into the side of the road. With the blessing of the city hall, more than 100 of them have sprung up across Vienna. The scheme has been growing since 2015, and its proponents say it’s struck a rare balance for urban projects: cheap, community-driven and appreciated by local people.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb7740c574fe5c26e6a4a4f6088a00a2dd90b12a",
      "title": "FBI returns stolen document signed by conquistador Hernán Cortés to Mexico",
      "url": "https://www.theguardian.com/world/2025/aug/14/hernan-cortes-document-mexico",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:04:07.000Z",
      "summary_90w": "",
      "raw": "US officials did not say who had the 16th-century page that was missing from Mexico’s archives for decades\nNearly five centuries after Spanish conquistador Hernán Cortés signed it and decades after someone swiped it from national archives, a priceless manuscript page has been returned by the FBI to Mexico.\nThe document contains a detailed accounting of the logistics related to Cortés’s journey to what eventually became New Spain – a territory that stretched from Central America to modern-day Washington state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "842075cde3148f507dddd4131ee10a3908ff9bf1",
      "title": "Left out of Alaska talks, exhausted Ukrainians fear an unjust peace",
      "url": "https://www.bbc.com/news/articles/cly7kl7e469o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T16:00:14.000Z",
      "summary_90w": "",
      "raw": "No matter what happens between Trump and Putin, Ukrainians think Russia has no plan to stop the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485dd8c97d4d21800407f31d344b8464f3ae05e5",
      "title": "ChatGPT: Everything you need to know about the AI-powered chatbot",
      "url": "https://techcrunch.com/2025/08/14/chatgpt-everything-to-know-about-the-ai-chatbot/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:50:05.000Z",
      "summary_90w": "",
      "raw": "A timeline of ChatGPT product updates and releases, starting with the latest, which we’ve been updating throughout the year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf9aaee140b942b6845614beb29f9de1f706dcad",
      "title": "Lovable projects $1B in ARR within next 12 months",
      "url": "https://techcrunch.com/2025/08/14/lovable-projects-1b-in-arr-within-next-12-months/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:48:52.000Z",
      "summary_90w": "",
      "raw": "Lovable is a vibe coding startup growing phenomenally quickly, according to new sales projections from CEO Anton Osika.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b0dd86dcb4203b5eac37e1550259b5fc8bc5eac",
      "title": "Leaked Meta AI rules show chatbots were allowed to have romantic chats with kids",
      "url": "https://techcrunch.com/2025/08/14/leaked-meta-ai-rules-show-chatbots-were-allowed-to-have-romantic-chats-with-kids/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:48:19.000Z",
      "summary_90w": "",
      "raw": "The standards also allow the bots to make \"statements that demean people on the basis of their protected characteristics,\" such as \"black people are dumber than white people.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f2894c096f718eff4c1c02f6665b4af584c0cc69",
      "title": "Middle East crisis: Bezalel Smotrich outlines plan for 3,000 new housing units in controversial West Bank settlement, reports say – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/14/gaza-starvation-deaths-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T15:14:17.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. You can read all our coverage of the conflicts in the Middle East here\nThe health ministry in Gaza has just issued a statement, saying four more people have died from famine and malnutrition in the past 24 hours.\nThis brings the total to 239 since the start of the war, including 106 children, according to the health ministry.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b864c4c7935eaa41b031da711162ec26940d0280",
      "title": "AI invents new antibiotics that could kill superbugs gonorrhoea and MRSA",
      "url": "https://www.bbc.com/news/articles/cgr94xxye2lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T15:03:49.000Z",
      "summary_90w": "",
      "raw": "Two new potential drugs have been designed by an artificial intelligence model to kill drug-resistant bacteria, researchers have revealed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04ba049ad58d1095b6aacfdb2b144dce7e374976",
      "title": "Five key takeaways from 2025's A-level results",
      "url": "https://www.bbc.com/news/articles/cz931kvldg4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T15:00:48.000Z",
      "summary_90w": "",
      "raw": "Top A-level results have risen again. Here's what you need to know.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fd9d295e79a5055e871f6f81dba4b0a0bf5315e",
      "title": "Plan to extend Queensland coalmine would bulldoze ‘critical’ koala habitat",
      "url": "https://www.theguardian.com/australia-news/2025/aug/15/plan-to-extend-queensland-coalmine-would-bulldoze-critical-koala-habitat",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T15:00:07.000Z",
      "summary_90w": "",
      "raw": "Glencore says it is working with state and federal governments to minimise the impact of flora and fauna in the 680ha area west of Mackay\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nHabitat for threatened koalas that are part of a population described by one expert as nationally significant would be bulldozed under plans to extend a Queensland coalmine.\nThe campaign group Lock the Gate used drones with thermal imaging cameras to find 13 koalas in one night in trees earmarked for clearing by mining company Glencore.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2039cb5d958d7192c44c5367294b58a017bc559f",
      "title": "Australian property investors squeezing out first-time buyers as record borrowing and rate cuts drive purchases",
      "url": "https://www.theguardian.com/australia-news/2025/aug/15/australian-property-investors-squeezing-out-first-time-buyers-as-record-borrowing-and-rate-cuts-drive-purchases",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T15:00:06.000Z",
      "summary_90w": "",
      "raw": "Pressure on first home buyers heightens as investors target lower-priced homes and more affordable regions\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nProperty investors borrowed a record sum, nearly $130bn, to buy homes over the year to June, supported by interest rate cuts but squeezing out first-time buyers.\nBanks made almost 200,000 new loans to landlords over the year, the most since 2022, while the number of new first-home mortgages slipped to 116,000.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efe34b8bed88aa24e8684896630d9137e4f3e8c4",
      "title": "Buzzy AI startup Multiverse creates two of the smallest high-performing models ever",
      "url": "https://techcrunch.com/2025/08/14/buzzy-ai-startup-multiverse-creates-two-of-the-smallest-high-performing-models-ever/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:00:00.000Z",
      "summary_90w": "",
      "raw": "It humorously calls this family the Model Zoo because one is like the size of a fly's brain and the other the size of a chicken's.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "523cbf7f4fc222ce1c9d6dd56478b94a50635fbc",
      "title": "Putin must 'prove he is serious about peace,' says Starmer",
      "url": "https://www.bbc.com/news/articles/cp37vg34g8jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T14:50:53.000Z",
      "summary_90w": "",
      "raw": "Sir Keir Starmer staged a show of unity with the Ukrainian president ahead of Friday's summit between Donald Trump and Vladimir Putin.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d80d40cdbfdf1fc446695ae2e401af402c254815",
      "title": "Google pushes AI into flight deals as antitrust scrutiny, competition heat up",
      "url": "https://techcrunch.com/2025/08/14/google-pushes-ai-into-flight-deals-as-antitrust-scrutiny-competition-heat-up/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T14:46:09.000Z",
      "summary_90w": "",
      "raw": "Google has launched Flight Deals as its AI tool within Google Flights to help travelers find cheaper fares.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4bea98069ccdb244fad79ff1d9d66566107cc1a",
      "title": "AI translation tech Palabra gets backing from Reddit co-founder’s venture firm",
      "url": "https://techcrunch.com/2025/08/14/ai-translation-tech-palabra-gets-backing-from-reddit-co-founders-venture-firm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T14:41:17.000Z",
      "summary_90w": "",
      "raw": "Alexis Ohanian and his firm Seven Seven Six are backing Palabra, which is working on a translation engine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c2d9224b6ca6047f8f2928a0a2f5111ffe70707e",
      "title": "Mayors of Democratic cities beyond D.C. decry Trump's takeover threats",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501273/trump-dc-takeover-cities-mayors-police-national-guard",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T14:37:50.000Z",
      "summary_90w": "",
      "raw": "When Trump announced his law enforcement actions in D.C., he also singled out a slew of other Democratic cities. The mayors of Baltimore, LA, Chicago, New York and Oakland, Calif., say crime is down.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e48ae59632c9a0b2556a51ef30df83c860244986",
      "title": "Ice deported boy with cancer and two other US citizen children to Honduras, suit alleges",
      "url": "https://www.theguardian.com/us-news/2025/aug/14/ice-lawsuit-louisiana-immigration-deportation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T14:22:55.000Z",
      "summary_90w": "",
      "raw": "Suit filed in Louisiana says agency didn’t give parents choice as to whether children should be deported with them\nA lawsuit filed in Louisiana on behalf of two mothers and their four minor children, including one with cancer, claims the two families were unlawfully denied due process and deported by US Immigration and Customs Enforcement (Ice) to Honduras in April 2025.\nThe lawsuit, which names the attorney general, Pam Bondi, Department of Homeland Security secretary, Kristi Noem, and various Ice officials as defendants, alleges Ice violated its own policies, and multiple federal laws, when officers secretly detained the families, denied access to counsel and swiftly deported them to Honduras, ignoring legal filings.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a5e987b1ef60a3e75f99b6671bbfdedab244afe",
      "title": "Dozens injured in Serbia as protesters clash with pro-government supporters",
      "url": "https://www.theguardian.com/world/2025/aug/14/serbia-protesters-clash-government-supporters-belgrade-novi-sad",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T14:14:44.000Z",
      "summary_90w": "",
      "raw": "Second night of street violence in several cities after months of anti-government demonstrations boil over\n\nEurope live – latest updates\n\nClashes between rival groups of protesters in Serbia left dozens injured overnight, police said on Thursday, as months of anti-government demonstrations boiled over into street violence for a second night.\nA wave of anti-corruption protests has gripped Serbia since November, when the collapse of the Novi Sad railway station roof killed 16 people, a tragedy widely blamed on entrenched corruption.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5404f3286ee4e15260e2884f0abc7b19baaa3dee",
      "title": "Cohere hires long-time Meta research head Joelle Pineau as its chief AI officer",
      "url": "https://techcrunch.com/2025/08/14/cohere-hires-long-time-meta-research-head-joelle-pineau-as-its-chief-ai-officer/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Cohere has hired Joelle Pineau, Meta's former VP of AI research who previously oversaw the tech giant's fundamental AI research (FAIR) lab. In her newly created Chief AI Officer role, Pineau will oversee AI strategy across Cohere's research, product, and policy teams.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f7517f72e0cb11362e3fe5aaaa45de080ec298",
      "title": "Inside the Box: Aaron Levie on reinvention at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/14/inside-the-box-aaron-levie-on-reinvention-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Aaron Levie of Box joins the Disrupt Stage at TechCrunch Disrupt 2025 in October.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5b4d61ff08235af637369184838d47801ebb4876",
      "title": "Apple’s blood oxygen monitoring returns to its latest Apple Watches",
      "url": "https://techcrunch.com/2025/08/14/apples-blood-oxygen-monitoring-returns-to-its-latest-apple-watches/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T13:51:23.000Z",
      "summary_90w": "",
      "raw": "The change doesn’t affect previously sold models with the original version of the feature or units bought outside the U.S.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e6befc5e77a703e2b37e89f0330b9cb6c5d85306",
      "title": "Ancient manuscripts return to Timbuktu 13 years after jihadist takeover",
      "url": "https://www.theguardian.com/world/2025/aug/14/timbuktu-manuscripts-taken-to-bamako-to-protect-them-from-jihadist-militants-returned",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T13:37:28.000Z",
      "summary_90w": "",
      "raw": "Malian city welcomes return of hundreds of crates of treasures after more than a decade stored in capital Bamako\nPolitical and religious figures in Malian city of Timbuktu have welcomed the return of ancient manuscripts that were removed to the capital, Bamako, more than a decade ago to prevent them from falling into the hands of militants linked to al-Qaida.\nAccording to a UN expert mission, jihadists destroyed more than 4,000 manuscripts and as many as nine mausoleums after occupying the desert city in 2012. Workers at the state-run Ahmed Baba Institute used rice sacks to smuggle the remaining documents out of the city a number of ways, including by donkey cart and motorcycle.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07e2fb3d7a071addf5c174da282f45b453e95695",
      "title": "BBC defends investigation of Kenya child-sex trafficking after 'hoax' claims",
      "url": "https://www.bbc.com/news/articles/cvgnkdpl49ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T13:16:46.000Z",
      "summary_90w": "",
      "raw": "The exposé was in the \"public interest\", the BBC says, following criticism from senior Kenyan politicians.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d184278a21edb9eae4e329ce0977f61fc47cf50e",
      "title": "Airbnb will allow US users to book stays without paying up front",
      "url": "https://techcrunch.com/2025/08/14/airbnb-will-allow-us-users-to-book-stays-without-paying-up-front/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Airbnb has launched a new feature called \"Reserve Now, Pay Later\" that lets users in the U.S. reserve a property without paying up front, potentially allowing people to cancel their bookings with less hassle if their plans change.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "053ff63f1757981ceff6df959b55d139d127bfe4",
      "title": "Baby Shark: South Korean court rejects US composer’s claim song was plagiarised",
      "url": "https://www.theguardian.com/world/2025/aug/14/baby-shark-song-south-korean-court-rejects-us-composers-claim-catchy-tune-was-plagiarised",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T12:41:28.000Z",
      "summary_90w": "",
      "raw": "Ruling upheld that there was insufficient evidence of copyright infringement on song that is YouTube’s most viewed video\nSouth Korea’s supreme court has rejected a US composer’s allegation that the producers of the catchy children’s song Baby Shark plagiarised his work, ending a six-year-long legal battle.\nThe court upheld two lower court verdicts in favour of Pinkfong, the South Korean company behind the tune with the famous “doo doo doo doo doo doo” refrain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4e3e58bd561c652fd2e8e440073bce9726c9df4",
      "title": "Coalition compares Labor’s economic summit to Willy Wonka’s golden tickets as it criticises ‘privileged talkfest’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/14/coalition-ted-obrien-criticise-economic-summit-privileged-talkfest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T12:30:44.000Z",
      "summary_90w": "",
      "raw": "The shadow treasurer will liken the gathering to Charlie and the Chocolate Factory and urge government to reject a number of reform proposals\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Coalition has likened next week’s economic reform roundtable to Charlie and the Chocolate Factory, as it challenges Labor to reject proposals which would increase taxes or make it harder to run a business.\nThe shadow treasurer, Ted O’Brien, the opposition’s sole representative at the event, will use a speech to a Liberal-aligned thinktank to dub the treasurer, Jim Chalmers, “Australia’s candy man” – a reference to Willy Wonka, Roald Dahl’s famous character who awards golden tickets for a visit to his factory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02c8b9846b6b67c2880fe9633ac2545b069a0c65",
      "title": "Aid groups say Israel’s new registration rules are ‘weaponising aid’",
      "url": "https://www.theguardian.com/world/2025/aug/14/aid-groups-say-israel-new-registration-rules-are-weaponising-aid",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T12:15:51.000Z",
      "summary_90w": "",
      "raw": "Lifesaving goods for starved people in Gaza blocked by vague rules on anti-Israeli activity, say humanitarian bodies\nMore than 100 aid organisations working in the Gaza Strip and the West Bank have accused Israel of dangerously “weaponising aid” in its application of new rules for registering groups involved in delivering humanitarian assistance.\nThe letter represents the latest broadside from the international aid community against Israel after the EU, Britain and Japan on Tuesday called for urgent action to stop “famine” spreading in the Gaza Strip.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c19d1107b518d3c57194b06c746dec10c2fa9ead",
      "title": "Second MasterChef contestant edited out of scandal-hit series",
      "url": "https://www.bbc.com/news/articles/c62n985gp3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T12:13:24.000Z",
      "summary_90w": "",
      "raw": "The show's production company says another chef decided not to be included \"given recent events\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dba6e9b6821eb59f2e6b93bdeb9c9cb9209b4843",
      "title": "Sudan cholera outbreak kills 40 in a week as health centres overwhelmed",
      "url": "https://www.theguardian.com/global-development/2025/aug/14/sudan-cholera-outbreak-water-health-medecins-sans-frontieres-msf-war-refugees",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T12:09:56.000Z",
      "summary_90w": "",
      "raw": "MSF charity calls situation ‘beyond urgent’ as thousands seeking refuge from war rely on contaminated water\nThe “worst cholera outbreak in years” has killed at least 40 people in the last week in Sudan, according to the medical charity Médecins Sans Frontières.\nOverwhelmed medical centres are resorting to treating patients on mattresses on the floor, MSF said, as the country’s two-year civil war aids the spread of the disease.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "224b50802de1a128f1f05c12f0535f3eeae00035",
      "title": "Clara Amfo says depression played a part in Radio 1 exit",
      "url": "https://www.bbc.com/news/articles/c93dx90ldkzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T12:04:46.000Z",
      "summary_90w": "",
      "raw": "The DJ says she made the decision to leave after being \"in the trenches\" with depression in 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5750ac01b96245a9f42548e3e781065c9b345c0",
      "title": "Hundreds of retired air force officers protest Israel's war in Gaza",
      "url": "https://www.npr.org/2025/08/14/g-s1-82385/hundreds-of-retired-air-force-officers-protest-israels-war-in-gaza",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-14T11:44:10.000Z",
      "summary_90w": "",
      "raw": "Hundreds of former air force reservists and pilots join a chorus of defense establishment figures calling for an immediate end to the war in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9093c9befd92251109fe4c6f025a855d65160412",
      "title": "Man City reveal weather-inspired kit for club 'that plays in the rain'",
      "url": "https://www.bbc.com/sport/football/articles/czr61yprr51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T11:39:53.000Z",
      "summary_90w": "",
      "raw": "Manchester City's jersey features a raindrop graphic over a grey background, taking inspiration from the city's wet weather.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e87aeed5a8a783ccc4be108fd24916852bf869e",
      "title": "Hospitals not treating enough patients to meet demand, experts warn",
      "url": "https://www.bbc.com/news/articles/cx2x7jj865no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T11:20:33.000Z",
      "summary_90w": "",
      "raw": "A small rise in the NHS backlog prompts questions about how well ministers are doing on improving waits.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47d042641809b37e01d39fb4dd03cf37b92adfda",
      "title": "Sheinbaum’s expulsion of criminals is more about placating Trump than keeping Mexico safe",
      "url": "https://www.theguardian.com/world/2025/aug/14/mexico-sheinbaum-cartel-extradition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T11:00:43.000Z",
      "summary_90w": "",
      "raw": "Perhaps not coincidentally, the timing of tariff discussions was closely followed by the transfer of wanted criminals\nMexico’s president, Claudia Sheinbaum, has denied that the transfer of 26 alleged cartel members to the United States was part of any kind of deal with Washington and was instead about her country’s own security priorities.\nThis week’s expulsion marked the second time Mexico had sent top criminals to the US this year: in February, Mexican authorities handed over 29 cartel members, including druglord Rafael Caro Quintero, who was responsible for the murder of a DEA agent in 1985. The latest transfers took place after US authorities vowed that prosecutors would not seek the death penalty in any of the cases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32fd75a9e5b0814bcb0ab21569b3a58fb3271b60",
      "title": "Dozens of migrants killed after boats capsize off Italian coast ",
      "url": "https://www.bbc.com/news/articles/cn02g5w39jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T10:31:48.000Z",
      "summary_90w": "",
      "raw": "More than 700 have died crossing the central Mediterranean in 2025, according to the UN reugee agency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4796041832013b5d0fe7fa3385656f2c716fe654",
      "title": "Man accused of driving car into Liverpool FC parade crowd faces 24 new charges",
      "url": "https://www.bbc.com/news/articles/cn47wq93vn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T10:21:35.000Z",
      "summary_90w": "",
      "raw": "Paul Doyle became tearful as he was asked to confirm his identity at Liverpool Crown Court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d7757533dd2bc31431248516af6c24d995427c5",
      "title": "Watch: David Jason reveals the extra line he slipped into iconic chandelier scene",
      "url": "https://www.bbc.com/news/videos/ce93dv90k9ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T10:08:20.000Z",
      "summary_90w": "",
      "raw": "The British actor, who portrayed Del Boy in TV show Only Fools and Horses, tells BBC Breakfast how the backstage audience reacted to the show's famous scene.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a488f310d7c27a78662cdbe9036113e1e860d0a",
      "title": "Argentina rocked as contaminated medical fentanyl kills up to 96 patients",
      "url": "https://www.theguardian.com/world/2025/aug/14/argentina-contaminated-fentanyl",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T10:00:41.000Z",
      "summary_90w": "",
      "raw": "Dozens of hospital patients treated with opioid for unrelated conditions suffered serious bacterial infections\nAs many as 96 people are now thought to have died in Argentina after being treated with medical-use fentanyl that was tainted with bacteria.\nThe official death toll stands at 87, and a judicial source has told the Buenos Aires Herald that nine further deaths are under investigation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d74173ac4dedcc6ec276776ac7d1b12b0dc33c84",
      "title": "Faisal Islam: Are latest UK growth figures good or bad news for the economy?",
      "url": "https://www.bbc.com/news/articles/c5yp48jprg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T09:54:25.000Z",
      "summary_90w": "",
      "raw": "Depending on the timeframe you look at, the GDP figures can be seen as glass half full or half empty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "446014e63d6f5af3726d2c5bd66e68553431539a",
      "title": "FBI returns stolen conquistador document to Mexico",
      "url": "https://www.bbc.com/news/articles/c62we83d1lno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:53:45.000Z",
      "summary_90w": "",
      "raw": "The document, signed by Hernán Cortés in 1527, is thought to have been taken over three decades ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e8843b0baa539760fd10984836e3f8ccfbaa73a",
      "title": "Relationship and new album - what we learned from Taylor Swift on Travis Kelce's podcast",
      "url": "https://www.bbc.com/news/articles/cedv5dy9v8lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:27:37.000Z",
      "summary_90w": "",
      "raw": "The pop superstar gives a rare insight into their life together and reveals details of her new album.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e8843b0baa539760fd10984836e3f8ccfbaa73a",
      "title": "Relationship insights and Easter eggs - Taylor Swift's appearance on Travis Kelce podcast",
      "url": "https://www.bbc.com/news/articles/cedv5dy9v8lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T09:27:37.000Z",
      "summary_90w": "",
      "raw": "The pop superstar gives a rare insight into their life together and reveals details of her new album.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "137a8e7adcf9d66b044b04039eaa11c281b3165f",
      "title": "German states debate who invented Bratwurst sausages",
      "url": "https://www.bbc.com/news/articles/cq8735exn80o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:26:36.000Z",
      "summary_90w": "",
      "raw": "The German states of Bavaria and Thuringia are embroiled in a row over who can lay claim to inventing the Bratwurst.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3fd322f5902f1da2878d9d8806202af274ecc77",
      "title": "'Our children are dying': Rare footage shows plight of civilians in besieged Sudan city",
      "url": "https://www.bbc.com/news/articles/czxp0qyn6dqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T09:16:38.000Z",
      "summary_90w": "",
      "raw": "Parents are struggling to feed their children in war-hit Sudan's Darfur region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed04f77081b68c78ccd53fd7d85a9352a74c1786",
      "title": "Why every A-lister also has a side hustle",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501492/why-every-a-lister-also-has-a-side-hustle",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T07:00:03.000Z",
      "summary_90w": "",
      "raw": "Seemingly every celebrity has their own brand these days, whether it’s booze (Cameron Diaz, Matthew McConaughey) or cosmetics (Selena Gomez, Lady Gaga) or squeezy food pouches (Jennifer Garner). Today on the show, what is fueling the celebrity business bonanza? We hear from two legendary singers, Lisa Loeb AND John Legend, who are pursuing ventures outside of show business. \nRelated episodes: \nThe celebrity crypto nexus \nThe Olympian to influencer pipeline (Apple / Spotify)\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "60ef19ca2852e9f60dc3882df7aa7d376cad06bd",
      "title": "US warns of additional tariffs on India if Trump-Putin peace talks fail",
      "url": "https://www.bbc.com/news/articles/c776zrmy5jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T06:27:29.000Z",
      "summary_90w": "",
      "raw": "US Treasury chief says Washington could increase secondary tariffs on India if talks don't go well in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd91b6ad0a508fa16832d99ab52a55ab917483f4",
      "title": "Israeli airstrikes on Tehran killed inmates in ‘apparent war crime’ – report",
      "url": "https://www.theguardian.com/world/2025/aug/14/israeli-airstrikes-tehran-war-crime",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T05:57:27.000Z",
      "summary_90w": "",
      "raw": "Human Rights Watch also finds that Iran abused survivors of June attack, which killed 80 people\nIsraeli airstrikes on Tehran’s Evin prison in June killed scores of detainees, visitors and staff in what Human Rights Watch (HRW) has called an “apparent war crime”. Iranian authorities have since subjected survivors to abuse, enforced disappearances and inhumane detention conditions, the rights group said.\nHRW’s investigation, based on satellite imagery, videos and witness accounts, found the 23 June Israeli airstrikes destroyed visitation halls, prison wards, the central kitchen, the medical clinic and administrative offices. No evident military targets were identified in the facility, which held more than 1,500 prisoners at the time, many of whom had been jailed for peaceful activism.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fca9eb83e0d1fd735d26f9945b6a8c1b139cb420",
      "title": "New Israeli rules stopping critical aid getting into Gaza, charities say",
      "url": "https://www.bbc.com/news/articles/cj6ynz22871o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T05:42:41.000Z",
      "summary_90w": "",
      "raw": "More than 100 aid organisations say they are increasingly being told they are \"not authorised\" to deliver supplies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ddf3f07141824d5c77f8a22e05a264cb73dad3ba",
      "title": "What is an apprenticeship and how much are apprentices paid?",
      "url": "https://www.bbc.com/news/articles/c51xenx7pvqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T05:32:33.000Z",
      "summary_90w": "",
      "raw": "Going to school, college or university five days a week is not the only way to get a qualification.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a4ac716757578ddcf8d6a987b1ece45630cb593",
      "title": "Thursday briefing: ​How the colonial legacy has created a toxic beauty industry",
      "url": "https://www.theguardian.com/world/2025/aug/14/thursday-briefing-how-the-colonial-legacy-has-created-a-toxic-beauty-industry",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T05:30:26.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: Doctors are sounding the alarm over a surge in cancers and irreversible skin damage linked to bleaching creams, as colourism continues to shape beauty ideals from Africa to Asia\nGood morning. The slogan “black is beautiful” rang out from civil rights marches in the US and UK during the 1960s and echoed through liberation struggles across the global south. It became a rallying cry against racist beauty standards that had long cast Black skin, facial features and hair as undesirable.\nThese movements urged pride in what had been denigrated for centuries, and their message was not limited to people of African or Caribbean heritage. Calls to embrace natural beauty resonated across Asia and much of the global south, directly challenging the colonial belief that lighter skin conferred greater worth.\nUkraine | Donald Trump told European leaders on Wednesday he would be seeking a ceasefire in Ukraine at his summit with Vladimir Putin on Friday and gave reassurances that he would not make any territorial concessions without Kyiv’s full involvement.\nUK news | David Lammy has referred himself to the environment watchdog after going fishing with JD Vance without the required licence during the US vice-president’s trip to the UK.\nImmigration | At least 20 people have died after a boat capsized off the southern Italian island of Lampedusa, a United Nations agency and local media reported on Wednesday.\nUK politics | Keir Starmer is to formally revive Northern Powerhouse Rail this autumn with an announcement expected before the Labour conference.\nPalestine | The United Nations special rapporteur for the occupied territories has warned that moves to recognise a Palestinian state should not distract member states from stopping mass death and starvation in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e2d083c4d49fa0610f8d1eca1bd6a7e5371e7c1",
      "title": "What does university cost, and is it worth it?",
      "url": "https://www.bbc.com/news/articles/cwyegp0dnq9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T05:16:24.000Z",
      "summary_90w": "",
      "raw": "Tuition fees have risen, while maintenance loans have also gone up to help students with rising living costs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc5c635f23dd7c8492770a063028ecbeaa677b80",
      "title": "Unexpected A-level or BTec results? Use our interactive guide on what to do next",
      "url": "https://www.bbc.com/news/articles/c0rwz07jlz0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T05:16:07.000Z",
      "summary_90w": "",
      "raw": "If you're opening your A-level or BTec results and didn't get the grades you were expecting, we've got an interactive guide to help you navigate the next steps from clearing to apprenticeships.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b53d96f00cb804b8f5af847ec59dd4437beddc1",
      "title": "Europe expresses hope after call with Trump on Putin summit",
      "url": "https://www.bbc.com/news/articles/cpv0l9e187yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T05:00:25.000Z",
      "summary_90w": "",
      "raw": "Trump, who described the call as \"a ten\", was urged to keep Ukraine's interests at the forefront when he meets Putin on Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbe2e6ae385bea955639e5b28e07f9b69e03fd6e",
      "title": "Rain warning delays landmark trial of Hong Kong's rebel mogul Jimmy Lai",
      "url": "https://www.bbc.com/news/articles/cgm2z7497yko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T02:49:05.000Z",
      "summary_90w": "",
      "raw": "Lai is accused of colluding with foreign forces under a Beijing-imposed national security law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e27391e914dd318cba50abade217b579e7f0d90",
      "title": "National Guard troops appear in Washington DC as mayor rejects Trump's 'authoritarian push'",
      "url": "https://www.bbc.com/news/articles/cy7ypm6zxp2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T01:24:16.000Z",
      "summary_90w": "",
      "raw": "Armoured vehicles were spotted at urban centres and tourist sites around the US capital on Tuesday evening.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4eef0749e5758fa85b6029c1237063dc7ecae1a",
      "title": "Australia and Vanuatu agree to $328m security and business deal ",
      "url": "https://www.bbc.com/news/articles/c8ry0l045myo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T01:13:36.000Z",
      "summary_90w": "",
      "raw": "Australia is trying to grow its influence in the Pacific region, to counter China's increased power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f10ce5fccc20e79a3cbf72c94bfa611a116ff4b",
      "title": "N Korea denies removing propaganda loudspeakers at border",
      "url": "https://www.bbc.com/news/articles/cn927xyv7l7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T00:47:29.000Z",
      "summary_90w": "",
      "raw": "Kim Jong Un's sister added that the country had 'no will' to improve relations with South Korea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cb7c206284f9d9097dfd1ca27e8741a341349f3",
      "title": "Jimmy Lai trial: closing arguments in Hong Kong delayed by aftermath of Typhoon Podul",
      "url": "https://www.theguardian.com/world/2025/aug/14/jimmy-lai-trial-hong-kong-closing-arguments",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T23:33:52.000Z",
      "summary_90w": "",
      "raw": "Lai has been detained since December 2020, with western nations and rights groups calling for his release\nThe closing arguments in the national security trial against jailed Hong Kong media mogul Jimmy Lai were postponed on Thursday after the Asian financial hub issued its highest-level “black” weather warning, stemming from ex-typhoon Podul.\nQueues had formed outside the court for the public gallery, but torrential rain saw the closing arguments in the trial, which began in late 2023, delayed. Proceedings are expected to resume on Friday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "483e5821172ae9808f7c75fce7f51f2ce251ce5f",
      "title": "After mass arrests, what happens next with Palestine Action ban?",
      "url": "https://www.bbc.com/news/articles/c3wn5gdv0wgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T23:00:55.000Z",
      "summary_90w": "",
      "raw": "Since the Palestine Action ban, the clash ahead now feels as much about politics and PR as about the law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce9c645aa5237ae777274b57a046486105f6d716",
      "title": "Co-founder of Elon Musk’s xAI departs the company",
      "url": "https://techcrunch.com/2025/08/13/co-founder-of-elon-musks-xai-departs-the-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T21:53:30.000Z",
      "summary_90w": "",
      "raw": "Igor Babuschkin is leaving xAI less than three years after he co-founded the startup with Elon Musk, following a series of scandals at company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf58767402e72f72fd0baa8c979c57722aafac07",
      "title": "Chemistry on trial: How a professor tried to convince a court she didn’t kill her husband",
      "url": "https://www.bbc.com/news/articles/c0r77qezg09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T21:21:44.000Z",
      "summary_90w": "",
      "raw": "While the accused mounted a self-argued defence using science, the court found her guilty of murder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a24e70a6f25b62b7f525c228687acf9bdf744cb1",
      "title": "Peru president issues amnesty for hundreds accused of atrocities",
      "url": "https://www.bbc.com/news/articles/cr5rend0ngeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T20:34:25.000Z",
      "summary_90w": "",
      "raw": "Dina Boluarte rejects criticism of law giving immunity to hundreds accused of committing atrocities during Maoist insurgency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bac6edb8e262810c3e0a130841a6e1efbd346af0",
      "title": "France acknowledges role in repression of Cameroon independence movements",
      "url": "https://www.theguardian.com/world/2025/aug/13/france-acknowledges-role-in-repression-of-cameroon-independence-movements",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T17:11:08.000Z",
      "summary_90w": "",
      "raw": "Emmanuel Macron writes to Cameroonian president with findings of joint commission on country’s colonial past\nFrance has acknowledged its role in decades of violent repression of independence movements in Cameroon, the latest stage in a slow process of reckoning with its brutal colonial past.\nIn a letter to the Cameroonian president, Paul Biya, dated 30 July, Emmanuel Macron said it was “up to me today to assume the role and responsibility of France in these events”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4106dc65521c3ec88052a2e68475b9b666a45e5",
      "title": "US warships patrol South China Sea after two Chinese ships collide",
      "url": "https://www.theguardian.com/world/2025/aug/13/us-warships-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T17:00:03.000Z",
      "summary_90w": "",
      "raw": "USS Higgins and USS Cincinnati sailed near Scarborough Shoal after Chinese tried to drive away Philippine vessel\nThe US has briefly deployed two warships in a disputed South China Sea shoal where two Chinese ships collided earlier in the week while trying to drive away a smaller Philippine ship in a high-seas accident that raised alarms about maritime safety.\nBoth China and the Philippines claim Scarborough Shoal and other outcroppings in the South China Sea. Vietnam, Malaysia, Brunei and Taiwan also lay overlapping claims in the contested waters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a6c4565740cea489d8be97d249c1a14588628f1",
      "title": "In maps: The war-ravaged Ukrainian territories at the heart of the Trump-Putin summit",
      "url": "https://www.bbc.com/news/articles/cgkrn433lk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T16:35:33.000Z",
      "summary_90w": "",
      "raw": "Kyiv has rejected ceding territory seized by Russia to secure a ceasefire.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "311eb770f5842fe90d1f52caa039bd0f96f4f575",
      "title": "Wildfire menaces major Greek city as heatwave grips Europe",
      "url": "https://www.bbc.com/news/articles/cwy5dqxd0z1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T16:18:47.000Z",
      "summary_90w": "",
      "raw": "Heatwave blanketing southern Europe are sparking blazes from Portugal to the Balkans with a major fire in Greece.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a1118fcc49a824bad4711e34f14b91ff188a8da",
      "title": "Three Colombian soldiers killed in drone attack",
      "url": "https://www.bbc.com/news/articles/cwypn46k1l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T13:00:48.000Z",
      "summary_90w": "",
      "raw": "Drones are being increasingly used by illegal armed groups to attack Colombia's security forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5bfb1501311036d4c5c1a9177981e47bae48a937",
      "title": "Gaza talks to focus on releasing hostages all in one go, Netanyahu hints",
      "url": "https://www.bbc.com/news/articles/c9vd734vv0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T12:42:49.000Z",
      "summary_90w": "",
      "raw": "Mediators say a deal can be pushed through in the weeks before Israel's planned expansion of the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a69f375c19dcd018d9932f61ff71fb5a776a244",
      "title": "Evacuations in Alaska after glacial melt raises fears of record flooding",
      "url": "https://www.bbc.com/news/articles/c4gejyg8l7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T12:32:13.000Z",
      "summary_90w": "",
      "raw": "Meltwater is escaping from a basin that is dammed by a glacier - prompting fears of a deluge in state capital Juneau.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5afe8fca2392793511814e22a61bf4bf13ce7ac1",
      "title": "Why Trump's spending bill could close your grocery store",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500298/why-trumps-spending-bill-could-close-your-grocery-store",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T11:29:48.000Z",
      "summary_90w": "",
      "raw": "Trump’s tax and spending law makes the largest cut in history to one of the nation’s biggest safety net programs. Today on the show, we explore how cuts to the Supplemental Nutrition Assistance Program, also known as SNAP, impacts families and grocery stores alike. \nBased on the digital story: Independent grocery stores have had a tough five years. SNAP cuts will make it harder\nRelated episodes:\nDo work requirements help SNAP people out of government aid? \nWhen SNAP Gets Squeezed \nThe trouble with water discounts\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "22595981de416f1c6cbe64eff5523098cb63438c",
      "title": "UK, France and Germany ready to reimpose sanctions on Iran over nuclear programme",
      "url": "https://www.bbc.com/news/articles/ce352drkvdro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T10:04:31.000Z",
      "summary_90w": "",
      "raw": "If Iran does not re-engage in talks by the end of the month, sanctions will be reinstated, the E3 says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "831dc4e23ab51fc8b0f4c6a5d4f858d41c59b4de",
      "title": "Recognising Palestinian state must not distract from ending Gaza mass deaths, UN expert says",
      "url": "https://www.theguardian.com/world/2025/aug/13/palestinian-statehood-israel-gaza-francesca-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T09:00:48.000Z",
      "summary_90w": "",
      "raw": "Francesca Albanese, UN special rapporteur for the occupied territories, calls for practical actions and warns against distracting ‘attention from where it should be: the genocide’\nThe United Nations special rapporteur for the occupied territories has warned that moves to recognise a Palestinian state should not distract member states from stopping mass death and starvation in Gaza.\n“Of course it’s important to recognize the state of Palestine,” Francesca Albanese told the Guardian after several more countries responded to the mounting starvation in Gaza by announcing plans to recognize an independent Palestine. “It’s incoherent that they’ve not done it already.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6afe7d4b00182efad1b74d65abbe4519acb4d2a0",
      "title": "Is Kari Lake a CEO? Her agency said so. The law suggests not",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500554/kari-lake-ceo-agency-usagm-voice-of-america",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Kari Lake has sought to dismantle Voice of America and its federal parent, the U.S. Agency for Global Media. The agency has recently called her its acting CEO. But the law suggests she's not eligible for the job.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "829ac3fbd98d53cfadf9e76a9cccdd391cf6a96a",
      "title": "What it was like for one NPR newscaster to go on an AI date",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500249/what-it-was-like-for-one-npr-newscaster-to-go-on-an-ai-date",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T08:58:28.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bcfc01eaa8b9fcf0b14e02698a43874bdab8e7b1",
      "title": "Govt 6: When the markets need fixing (Market Design)",
      "url": "https://www.npr.org/sections/money/2025/08/06/1255336594/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers interact to exchange goods or services.  Economists love markets. It's like all of our supply and demand graphs have come to life. Everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix. \nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. \nToday's episode: Market Design. \nCheck out our Summer School video cheat sheet on the origins of money at the Planet Money TikTok. \nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\n\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "550cbb0043a4815fa0fbc84190208549c046c78e",
      "title": "Summer School 6: When the markets need a designer",
      "url": "https://www.npr.org/sections/money/2025/08/06/1257189367/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers meet to exchange goods or services. Economists love markets. It's like all of our supply and demand graphs have come to life. Almost everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix.\nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. Today's episode: Market Design.\nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed225e364e1f5be28861fb71e7b1a1bb7aae4095",
      "title": "The row over 'vote theft' that has shaken Indian politics",
      "url": "https://www.bbc.com/news/articles/c0l6kg80de5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T05:53:42.000Z",
      "summary_90w": "",
      "raw": "Opposition parties have made allegations of electoral irregularities, which the India's poll body has denied.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11fbe8231f61d261b9f4fb96bdd8fca8b5e7e692",
      "title": "Putin reaffirms 'friendship' with North Korea before Trump talks",
      "url": "https://www.bbc.com/news/articles/ckge2kr85wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T01:18:36.000Z",
      "summary_90w": "",
      "raw": "Kim Jong Un provides Moscow with artillery, missiles - and as a BBC investigation shows, labourers working in 'slave-like' condition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b86798da5b79a5ef177016abcc4d619e8459803",
      "title": "Wife of South Korea's jailed ex-president arrested",
      "url": "https://www.bbc.com/news/articles/cz71rp7yn05o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T00:55:22.000Z",
      "summary_90w": "",
      "raw": "This is the first time in the country's history that a former first couple is in jail at the same time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d6251dc719a9f263851c5e4fa3eb8f0ba073081",
      "title": "China’s crackdown on lavish civil servant perks will ‘harm’ the economy, experts warn",
      "url": "https://www.theguardian.com/world/2025/aug/13/china-civil-servant-public-employee-austerity-drive-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T00:40:35.000Z",
      "summary_90w": "",
      "raw": "Updated regulations ban the country’s 40 million civil servants from lavish banquets, and restrict them from overseas travel for ‘personal leisure’\nAdjacent to a municipal government building in Beijing, a normally bustling restaurant is now eerily quiet, at lunchtime most of its seats are empty.\nThe recent crackdown on civil servants frequenting restaurants – part of a government austerity drive intended to crack down on corruption – has likely affected business and caused liquor sales to plummet, admits one waitress who works in the opulent establishment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "011af3f7b044fb0610cd786612919dcf3cde5c21",
      "title": "Crime in DC: What do the figures say and how safe do people feel?",
      "url": "https://www.bbc.com/news/videos/cewynn7krj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T23:18:28.000Z",
      "summary_90w": "",
      "raw": "National Guard troops have been seen reporting for duty in Washington DC as President Trump takes over the city’s police force.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02276312a840489fa9d3e8789b519b27af74aead",
      "title": "Ford and the promise of cheaper EVs",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498788/ford-and-the-promise-of-cheaper-evs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T21:03:51.000Z",
      "summary_90w": "",
      "raw": "Ford announced they're putting billions into a Kentucky automotive plant to retool it to make EVs, starting with a midsize pickup that they say will be in the $30k price range.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "756a9d4979bc1da44723aa7e4468e978107d5955",
      "title": "Trump’s China trade truce extension spurs market rally",
      "url": "https://www.theguardian.com/us-news/2025/aug/12/trumps-china-trade-truce-extension-spurs-market-rally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:25:42.000Z",
      "summary_90w": "",
      "raw": "Bourses in Australia and Japan hit record highs as hopes grow of trade deal within latest 90-day pause\n\nBusiness live – latest updates\n\nGeorge Magus: Why Peak China may finally have arrived\n\nDonald Trump’s decision to extend a truce in the trade war with China for another 90 days triggered a stock market rally across the globe on Tuesday.\nThe US president signed an executive order on Monday night extending the deadline for higher tariffs on China until 10 November and avoiding a rates cliff edge. Beijing responded the following morning that it would suspend additional tariffs on US goods for a further 90 days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e53a85740850c3cdef1f74663b088f72b823bb06",
      "title": "The hidden costs of cutting Medicaid",
      "url": "https://www.npr.org/sections/planet-money/2025/08/12/g-s1-82221/medicaid-cuts-big-beautiful-bill-uninsured",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T14:18:21.000Z",
      "summary_90w": "",
      "raw": "Cutting Medicaid can seem like an easy way to slash the budget. But, the costs can spread to all of us.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1989. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "df9e0ad64148d9121fe65b8cbbcc9d9adc4d767c",
      "title": "Migrants swim from Morocco to Ceuta as officials say enclave ‘overwhelmed’",
      "url": "https://www.theguardian.com/global-development/2025/aug/12/migrants-swim-from-morocco-to-ceuta-as-officials-say-enclave-overwhelmed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T04:00:12.000Z",
      "summary_90w": "",
      "raw": "Seven children reach shore as dozens of people intercepted on risky route, which authorities say is now used more often\nAbout 100 people, including several children, risked their lives by trying to swim from Morocco into Spain’s north African enclave of Ceuta early on Saturday morning, as the territory’s authorities warned that its overwhelmed reception system was close to collapse.\nRecent weeks have seen a rise in the number of people trying to reach Ceuta, with more than 50 children swimming across from Morocco on 26 July alone.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}