{
  "version": "1756942187789",
  "generatedAt": "2025-09-03T23:29:47.789Z",
  "items": [
    {
      "id": "f804c14fc24feb1b8ba11269a64e53b49a1d108c",
      "title": "Rayner 'clings on' as she 'fights for political survival'",
      "url": "https://www.bbc.com/news/articles/cn0x25kwqrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:14:23.000Z",
      "summary_90w": "",
      "raw": "Angela Rayner's admission that she underpaid stamp duty on her flat in Hove dominates Thursday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cfc09d6ab9a52c9395b11757d33eee114660204",
      "title": "'My son's constipation wasn't taken seriously until he reached crisis point'",
      "url": "https://www.bbc.com/news/articles/cgr9zg17n5yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:11:04.000Z",
      "summary_90w": "",
      "raw": "The number of children being admitted to hospital with constipation is at a 10-year high.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ac6cbb192b3f120995526f31174f98d5eeb174c",
      "title": "Epstein accusers say they are compiling list of his associates",
      "url": "https://www.bbc.com/news/articles/c5yvpgyjed8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:00:50.000Z",
      "summary_90w": "",
      "raw": "Victims of the disgraced financier give emotional accounts of abuse in a news conference on the steps of the US Capitol.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7066acc7c5ce39f5f1ce120c5e9791411fce232",
      "title": "30,000 homes fitted with botched insulation under government schemes, ministers admit",
      "url": "https://www.bbc.com/news/articles/c8606gp4711o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:00:20.000Z",
      "summary_90w": "",
      "raw": "The government has documented the number of homes blighted by sub-standard work for the first time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4db75cbe58602f55def216965c64bd0e950ab0f",
      "title": "Australia politics live: Nationals cross floor to back Pauline Hanson motion on immigration; Bob Carr defends China visit",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T22:56:35.000Z",
      "summary_90w": "",
      "raw": "Bridget McKenzie and Ross Cadell, and the Liberal backbencher Sarah Henderson, crossed the floor. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nSenator continues calls to criminalise burning Australian flag\nJacinta Nampijinpa Price is tripling down on her call for the burning of the Australian flag to be criminalised, and has called for Anthony Albanese to only stand in front of the Australian flag.\nI think in recent times, a lot of Australians have been vilified and the suggestion is that they’re somehow racist if they take pride in who we are as a country and in our flag that represents us as a country. I find that our prime minister standing in front of three flags divides us.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d0cc80fb967f85718dbc34c33ba731b730bdabd5",
      "title": "Judge overturns Trump administration funding cuts to Harvard",
      "url": "https://www.bbc.com/news/articles/c4g2x7x03gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T22:40:56.000Z",
      "summary_90w": "",
      "raw": "A judge ruled the government violated the Ivy League college's free speech rights when it froze $2.6bn.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59bc4ea3464d1b0a8ae8def2aef19d4d865ae76c",
      "title": "At least 15 people killed after funicular railway in Lisbon derails",
      "url": "https://www.theguardian.com/world/2025/sep/03/at-least-three-people-killed-many-injured-in-lisbon-funicular-crash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T22:19:17.000Z",
      "summary_90w": "",
      "raw": "President laments accident on railway that carries passengers up and down hillside in Portugal’s capital \nAt least 15 people have been killed after Lisbon’s Gloria funicular railway car derailed and crashed on Wednesday, an emergency medical service spokesperson has said.\nAuthorities would not identify the victims or disclose their nationalities, but said some foreign nationals were among the dead. At least 18 people were also injured.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b53717c5c6cdde27c9160090f2d00c6d1e7cc50",
      "title": "Mistral, the French AI giant, is reportedly on the cusp of securing a $14B valuation",
      "url": "https://techcrunch.com/2025/09/03/mistral-the-french-ai-giant-is-reportedly-on-the-cusp-of-securing-a-14-billion-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T22:13:51.000Z",
      "summary_90w": "",
      "raw": "The two-year-old OpenAI rival, founded by former DeepMind and Meta researchers, develops open source language models and Le Chat, its AI chatbot built for European audiences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4bfdf6b689455733b823eb4fa509859b22f9075c",
      "title": "The best robot vacuum and mop to buy right now",
      "url": "https://www.theverge.com/tech/625409/best-robot-vacuum-mops",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T22:03:47.000Z",
      "summary_90w": "",
      "raw": "Robot vacuums that can both mop and sweep your floors have improved significantly in recent years. While they are still not as effective as good ol’ manual labor, if you run them regularly, they will help keep your floors cleaner with much less effort on your part.\nThe difference is that newer “combo” robot vacuum and mop models are designed to actually scrub your floors. The first robot vacuums that could also “mop” simply slapped a thin, flat microfiber pad on the bot that kind of Swiffer-ed your floor. Basically, all this was good for was getting up fine dirt that the vacuum left behind.\n\nA robot vacuum with a real mopping system will make your life easier \n\n\nNewer models now come with vibrating or oscillating mop pads, and some even have roller mops. Most models have onboard water tanks to keep the mops wet while in use, and many can wash and dry their mops in their charging docks, which also automatically empty and refill their water tanks, meaning less work for you.\nWhile most robot vacuums today come with some sort of mopping feature, this guide focuses on those that excel at mopping. If you’re more interested in the best vacuum, check out my guide to floor sweeping bots. \nThe downside to these combo bots with serious mopping chops is that they tend to be bigger and heavier and need more frequent intervention than regular vacuum bots. Water equals gunk, and cleaning their giant multifunction docks, even the self-cleaning ones, can be an icky job. You also have to empty and refill their tanks about once a week. \nMopping bots also need to return to their docks more frequently than robot vacuums in order to refill their onboard water tanks. This means they’ll take longer to clean your floors than a dedicated vacuuming model, but they are doing two jobs at once. Robot mops with roller mops will self-clean as they work, negating this issue, but these models are also the largest and bulkiest, as they carry a bigger water tank on board. \nCombo bots can mop and vacuum simultaneously, but for especially dirty floors, it’s best to have the option to vacuum first and then mop. A mop-only mode is also good, as you can send the bot to clean up a wet spill without it sucking up water — something they’re not designed to do, yet.\nIf you have a lot of hardwood or tile floors and constantly struggle with muddy paw prints or the general dirtiness of life with multiple pets, people, and kids, a good robot vacuum and mop combo will definitely make your life easier. \nFeatured in this article\nBest overall: Deebot X8 Pro Omni\nThe Deebot X8 Pro Omni is an excellent roller mopping bot that extends to clean along backboards and furniture. It’s also a powerful vacuum with great obstacle avoidance, a small dock, and a convenient self-cleaning brush system.\n\nWhere to Buy:\n\n $1399.99 $899.99 at Amazon\n $1399.99 $899.99 at Ecovacs\n $1399.99 $1099.99 at Best Buy\n\nBest on a budget: Roborock S8 Plus\nRoborock’s S8 robot vacuum / mop offers a host of high-end features at an affordable price, including 6,000Pa of suction,  AI-powered obstacle detection, and dual rubber roller brushes that perform well on carpet.\n\nWhere to Buy:\n\n $399.99 $349.99 at Amazon (without auto-empty dock)\n $399.99 $349.99 at Walmart (without auto-empty dock)\n\n\n\n\n\n\nBest robot vacuum and mop\nBest budget robot vacuum and mop\nBest midrange robot vacuum and mop\nBest robot vacuum and mop for a mix of hard floors and rugs\nBest robot vacuum and mop for hardwood floors\nBest robot vacuum and mop for tile floors\nBest robot vacuum and mop with a plumbing hookup\nWhat I’m currently testing and what’s coming next\n\nBest robot vacuum and mop\nDeebot X8 Pro Omni\n\n\nScore: 8\n\nProsCons\n\n\nSelf-cleaning roller mop\nExtendable mop\nExcellent obstacle avoidance\nSmaller dock\n\nLimited mop lift\nHeavy, struggles with transitions\nSingle roller brush\n\n\n\n\nWhere to Buy:\n\n $1399.99 $899.99 at Amazon\n $1399.99 $899.99 at Ecovacs\n $1399.99 $1099.99 at Best Buy\n\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4L clean) / Mop style: Roller / Mop washing: Yes, hot water and hot air drying / Mop pressure: 4,000Pa at 200 RPM / Mop lift: Yes, 10mm /  Edge cleaning: Yes, mop extension / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 18,000Pa / Vacuum brush style: Single rubber/bristle / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Matter support promised\nEcovacs’ Deebot X8 Pro Omni is a welcome return to form for Ecovacs’ flagship line. Its new tower-less lidar navigation system did a much better job of mapping and navigating than the previous flagship, the Deebot X2 Omni, which was constantly getting lost in my tests. However, the most notable thing about the X8 is the Ozmo Roller Mop. \nThis is the best roller mopping bot I’ve tested, thanks mostly to the Ozmo’s ability to extend outwards to clean along baseboards and furniture. This is a unique feature on a roller mop (for now) that makes up for the mop’s relatively short length (both the Eufy S1 and Switchbot S10 have longer roller mops). At $1,299, the X8 is also one of the less expensive flagship models (though the new X9 Pro Omni retails for $1599.99).\n\n\n\n\nThe X8 did an excellent job on my milk, OJ, and dried ketchup tests, absorbing the small spills with one or two passes. It covered the floors evenly, without leaving any streaks or gaps, something that I’ve seen happen with spinning mop pads. When it comes across an edge — be it a baseboard, furniture like a chair or table leg, or any obstacle — it extends out its mop to the right to clean as close as possible. It did an excellent job getting the grime up from the stools around my kitchen counter, something most other bots struggle to do.\n\nThis is the best roller mopping bot I’ve tested\n\n\nThe self-cleaning brush system kept the bot from smearing any spills it encountered. As it’s cleaning, a scraper squeegees off the dirty water and 16 nozzles spray it with fresh water and solution, if you use it. As with most high-end mopping bots, the dock has the option of auto-dispensing cleaning solution.\nThe X8 was the best vacuuming robot among the serious combo bots I tested, outperforming my Cheerio and oatmeal tests and doing a good job on rugs (when it could reach them). However, its vacuum has a relatively small, single rubber roller brush, which is less effective than Roborock’s and Roomba’s dual roller brush models (which include the S8 MaxV Ultra and the 10 Max).\n\n\n\n\nThe X8 uses lidar and a 3D camera for mapping; the latter also facilitates its obstacle detection, which is very good — it easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios. It’s much better at navigating than the X2, but it did occasionally get itself trapped, including when it went under a chair that was too low for it to get out from. The top of the robot was fairly scratched up after just one week of use. (Worth noting, Ecovacs suffered a hack last year in which bad actors could access the camera and microphone on the X2)\nThe X8’s multifunction dock is much smaller than the X2’s and has some nice rose gold accents. Its water tanks are integrated into the dock and supereasy to remove to empty and refill — there’s no lid to mess with, you just lift up and go. The X8 doesn’t self-clean its washboard, however, and while it’s removable to make it easier to clean, I still had to get on my knees and scrub its base station after just a week of use.\n\nIt easily navigated fake dog turds and cables while sucking up oatmeal and Cheerios\n\n\nThe downside of roller mop bots is that they are big and heavy: the X8 weighs a whopping 12 pounds. Despite an ability to lift itself up to clear thresholds, the X8 isn’t as agile as smaller, lighter robot vacs. It struggled with the combo challenge of a large, tasseled, high-pile rug and spindly chair leg. Very few robot vacs tackle that one well, but it got stuck on the chair leg and sucked up the rug tassels. I ended up setting a keep-out zone so it could complete its job.\nThe integrated nature of the roller mop means the bot can’t remove it when it goes to vacuum carpet, as some mopping bots with pads can. It can lift it, but only 10mm, which isn’t going to work for the fluffiest rugs. The X8 does have carpet sensors, and you can choose to avoid them automatically, pass over them, or vacuum only. But its best carpet feature is the option to have it vacuum the carpets first, then mop everywhere else. \nOverall, the Deebot X8 is a stellar vacuum mop combo for anyone seeking a robot that will thoroughly scrub and sweep their floors. With high-end features at a decent price, the X8’s roller mop, slick navigation, and excellent obstacle avoidance will get the job done.\nBest budget robot vacuum and mop\nRoborock S8 Plus\n\n\nScore: 8\n\nProsCons\n\n\nSonic-mopping\nAuto-mop lift\nAI-powered obstacle avoidance\nDual-rubber roller brushes\nCarpet detection\n\nVery large and wide\nHave to wash the mop manually\nHave to refill the water tank manually\nNo heated drying\nLimited mop lift\n\n\n\nWhere to Buy:\n\n $399.99 $349.99 at Amazon (without auto-empty dock)\n $399.99 $349.99 at Walmart (without auto-empty dock)\n\nMultifunction Dock: No – just auto empty / Mop style: Vibrating pad / Mop washing: No / Mop pressure: 6N pressure, vibrates 3000 times a minute / Mop lift: Yes, 5mm / Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,000Pa / Vacuum brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Roborock S8 is a great vacuum featuring AI-powered obstacle detection, dual rubber roller brushes, and 6,000Pa of suction. These are all features you won’t find on most budget bots, and combined, they mean the S8 does a good job vacuuming hard floors and carpets. Then, its flat mop, which vibrates 3,000 times a second, is very effective at scrubbing hard floors. \nUnlike most robot vacuums in this guide, the S8 won’t automatically fill its water tank or wash its mop; you will have to do that work manually. However, it does have an extra-large onboard water tank, again a feature you won’t find on cheaper mopping bots, which means the mop gets sufficiently wet to be effective.\nThe S8 wasn’t designed as a budget bot; in fact, it was Roborock’s flagship model in 2023, but buying an older model like this can save you a lot of money while still doing a good job. Once $750 for the robot alone, now you can often find it for well under $500, and that’s with its auto-empty dock.\nOne of my favorite features of the S8 is that it can be set to mop only, and it does an excellent job, moving in a tighter “Z” pattern and going over the floors twice. It also has a slow option for a more thorough cleaning. I liked to send it out to vacuum everywhere first, then recharge and go out again to mop, which resulted in sparklingly clean floors. It does take a long time, though, and it doesn’t have any edge cleaning options, so it won’t mop as well along baseboards or under low furniture as the more expensive models.\nAnother great feature at this price is carpet sensing — the S8 can raise its mops a few millimeters to avoid dampening your carpets. Most other budget mopping bots require you to remove the mop pads when vacuuming carpet or set keep-out zones around your rugs. However, the mop-raising feature can only clear low-pile rugs, so I had to set no-mopping zones around my plush floor coverings.\nThe S8 requires a fair amount of hands-on time since you have to refill its reservoir manually and wash the mopping pads (you can throw them in the washing machine). But if you’re good with a little more manual labor in exchange for cleaner floors, the S8 is a great option.\nRead more of my Roborock S8 review.\nBest midrange robot vacuum and mop\nEufy X10 Pro Omni\n\n\nScore: 7\n\nProsCons\n\n\nGood AI-powered obstacle detection\nEffective mopping\nExcellent value\nNice dock\n\nSingle rubber / bristle brush\nLower suction power \nNo heated mop washing\nSome navigation issues\n\n\n\nWhere to Buy:\n\n $799.99 $549.99 at Amazon\n $799.99 $549.99 at Eufy (with code WS24T2351)\n $799.99 $699.99 at Walmart\n\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2.7L dirty, 3L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot air drying / Mop pressure: 2.2 lbs at 180 RPM / Mop lift: Yes, 12 mm / Edge cleaning: Yes, swinging motion / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Eufy X10 Pro Omni is an excellent mop vacuum hybrid with a full multifunction dock. Unlike the Roborock S8, it can wash its mop, drain, and refill its water tank. It’s also the cheapest model to offer dual spinning mop pads, and it has very good obstacle detection for this price range. \nHowever, the X10 has just 8,000Pa suction, no hot water washing, and smaller water tanks. While it has most of the same functions as the top-of-the-line mopping bots, it’s not quite as effective at any of them. Which is sort of the definition of “midrange.”\nAn edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges, but this is less effective than mop extension found on the more expensive models. With its squarish shape, it gets into corners better than most of the round bots, but its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.\nThe Eufy performed very well in my mopping tests, eradicating dried stains with its 2.2 pounds of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. \nThe X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.\nRead more of my Eufy X10 review.\nBest robot vacuum and mop for a mix of hard floors and rugs\nDreame X40 Ultra\n\n\nScore: 8\n\nProsCons\n\n\nSelf-removing mop pads \nMop extension reaches under edges\nSelf-cleaning washboard\nDirt detection tech\n\nMiddling AI obstacle detection \nSingle rubber roller brush\nApp can be flaky\n\n\n\n\nWhere to Buy:\n\n $1499.99 $849.99 at Dreame (with code X40U650)\n $1499.99 $899.99 at Amazon (with Prime)\n $1499.99 $899.99 at Walmart\n\nMultifunction Dock: Yes, auto empty (3L) and drain/refill (4L dirty, 4.5L clean) / Mop style: Dual spinning pads / Mop washing: Yes, hot water and hot air drying / Mop pressure: Unknown  / Mop lift: Yes, 10.5 mm / Edge cleaning: Yes, mop extension Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have a lot of fluffy rugs or carpets as well as hard floors, the Dreame X40 Ultra is the best robot vacuum for you. It’s not quite as effective as a mop or vacuum as the Ecovacs Deebot X8, but it’s better suited for high-pile carpet and rugs because it can automatically drop and reattach its mopping pads during vacuuming, eliminating the risk of getting your rugs wet or stained. The Ecovacs X8 can only raise its mop 10mm, not remove it, so it struggles on high-pile carpets.\nAlong with dropping its pads, the X40 can also extend and swing them to get under your cabinets and consoles. The X8 can extend to an edge, but won’t get under those low cabinets or furniture. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it.\nHowever, because the X40 features dual spinning mop pads rather than a self-cleaning roller mop, it requires more frequent returns to clean the mops, which means it takes longer to clean your home. The X40’s spinning pads are effective at scrubbing your floors, but I found the X8’s roller mop to be better overall and more consistent.\nThe X40 can clean its washboard and features AI-powered smart dirt detection, which uses its cameras to identify spills, such as milk, or particularly dirty areas. When it spots something, it slows down and performs a more thorough cleaning. It also has an option to just mop. These are features the Ecovacs X8 doesn’t offer.\nDreame recently released the X50 Ultra, which adds 20,000Pa suction power and the ability to climb over higher thresholds. I’m currently testing this model.\nRead more of my Dream X40 Ultra review.\nBest robot vacuum and mop for hardwood floors\nEufy Omni S1 Pro\n\n\nScore: 7\n\nProsCons\n\n\nLong roller mop\nSleek, futuristic design\nDual side brushes\nSquare shape helps with corners\n\nMiddling vacuum performance\nNo self-cleaning base\nNo mop extension\n\n\n\nWhere to Buy:\n\n $1299.99 $799.99 at Eufy (with code WS24T2071111)\n $1299.99 $999.99 at Amazon\n $1499.99 $999.99 at Best Buy\n\nMultifunction Dock: Yes, auto empty (2.5L) and drain/refill (2L dirty, 3L clean) / Mop style: Roller / Mop washing: Yes, warm water and hot air drying / Mop pressure: 10N, 170 RPM / Mop lift: Yes, 12mm /  Edge cleaning: No Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Vacuum brush style: Rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nIf you have mostly hardwood floors, the Eufy Omni S1 Pro is an excellent option. With its sleek, high-tech design and a long 11.4-inch roller mop, this product did an excellent job of keeping the hardwood floors of my main living area spotless. \nI found the Eufy’s longer roller mop to be slightly more effective than the Deebot X8’s, mopping evenly and getting up more dirt on its first pass. While there is no mop extension of edge mopping, its square shape does help it get into corners, and its dual spinning side brushes help pull in debris.\nHowever, its vacuuming prowess is middling; this really is a dedicated mopping robot. With just 8,000Pa suction power and a small rubber brush, it did a decent job of getting up debris, but left several flakes of oatmeal, thanks to its side brushes spinning the debris out beyond the bot’s reach. Its obstacle avoidance is also fairly average; it dodged larger items but struggled with cables. \nThe S1’s omni station is quite eye-catching, with a tall, futuristic design, and clear water tanks with glowing lights inside — although it might be considered an eyesore, depending on your style. Usefully, everything you need to interact with is located at the top, so there’s no need to bend down: a touchscreen display provides controls and the clean and dirty water tanks are easy to remove. \n\nIf you have tile or scraped wood floors, a bot with oscillating mop pads will be better at getting into the crevices\n\n\nWhile it has a mop lift of 12mm (which is higher than the X8’s), it really struggled on my high-pile carpets, to the point where I had to set keep-out zones around them. \nLike the X8, the S1 self-cleans the mop with water jets as it’s working, and you can set how frequently it returns to the base station for a thorough clean with warm water before continuing to mop. It will also dry the mop with hot air, which is effective, if noisy.\n\n\n\n\nNeither the X8 nor the S1 have self-cleaning washboards, something Dreame offers. This is where the dock automatically washes the mopping tray in the dock – Dreame’s uses little wipers that go back and forth. It still needs to be cleaned eventually, but it does help keep the ick at bay for longer. \nThe S1 station’s debris filter got grungy fast and required manual cleaning, although this is fairly straightforward. After a month of use, I also had to disassemble the scraper and filter inside the bot, as well as remove the roller mop. This is something you’ll need to do for all mopping bots, but the Eufy’s was the most involved process, requiring me to disassemble multiple parts.\nIn my testing, I found that roller mops are great for most hardwood floors, but if you have lots of tile or scraped wood floors with grooves and nooks and crannies, a bot with oscillating mop pads will be better, as these do a better job of getting into crevices such as grout lines. \nBest robot vacuum and mop for tile floors\nNarwal Freo Z Ultra\n\n\nScore: 8\n\nProsCons\n\n\nSuperb mopping\nGreat obstacle avoidance\nExcellent dirt detection\nSelf-cleans its washboard\nVery quiet\n\nMinimal mop lift\nEdge cleaning just okay\nUses a lot of water\nApp is unreliable\n\n\n\n\nWhere to Buy:\n\n $1499.99 $949.99 at Costco (with Accessory Pack Bundle)\n $1499.99 $949.99 at Amazon (for Prime members only)\n $1499.99 $949.99 at Narwal (with code FRZU)\n\nMultifunction Dock: Yes, auto, empty (2.5L) and drain/refill (4.1L dirty, 4.5L clean) / Mop style: Dual triangular spinning pads / Mop washing: Yes, hot air drying / Mop Pressure: 2.6lbs at 180 RPM / Mop lift: Yes, 12mm / Edge cleaning: Yes, robot swing and fluffer / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Vacuum brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut\nNarwal’s latest flagship mopping bot, the Freo Z Ultra, combines everything I loved about the Freo X Ultra, and adds better vacuuming, better object avoidance, an auto-empty dock (a first for Narwal), and a fluffy side brush to polish your baseboards. It also now comes in gray (white robot vacuums are not a good idea, unless you like cleaning your robot vacuum).\nWith its dual, triangular spinning mop pads (the unique shape helps avoid missing spots), the Freo Z is a great choice for homes with lots of hard floors, and especially tile. The oscillating mop pads are slightly better than roller mops at getting into grout lines and other crevices found on natural surfaces. The Freo Z’s downward pressure of 2.6 lbs meant it did a great job of scrubbing up dried-on debris, excelling in my dried ketchup test, even getting the red gunk up from tile grout.\n\n\n\n\nLike the Deebot X8, the Freo Z can recognize various floor materials, including tile, hardwood, and marble, and clean in the direction of the flooring, such as along the wood grain. Unlike the X8, it automatically adjusts pressure and “mopping humidity” based on the floor type, using higher humidity on tile floors than on wood floors, which can be impacted by excessive moisture. The Freo Z also self-cleans its station and has a removable tray, making maintenance easier.\n\nThe Freo Z is remarkably quiet, making it a great option for running in a bedroom\n\n\nVacuuming is much better than the Freo X, with the Z boasting 12,000Pa. While that’s not as high as the X8, the Freo Z is remarkably quiet, making it a great option for running in a primary bedroom suite where you may have a tile bathroom combined with carpet. \nAs with the X8, the Narwal doesn’t deal well with high-pile rugs, as there’s still only a 12 mm mop lift and no automatic mop removal. However, you can set it to perform one of four actions when it encounters a carpet: sidestep, cross it without cleaning, power boost to clean the carpet more effectively, or regular cleaning.\nThe obstacle detection is vastly improved and very good. A dual camera system allows the bot to not only see objects but uses AI to identify what they are and “decide” how to clean them. The best use of this I saw in testing is when there was a large puddle of water and it automatically switched to mop-only so as not to suck up liquid.\nSimilarly, Narwal’s dirt detect feature is very good. The bot goes back and forth over a stain or dirty area to ensure it’s clean. \n\n\n\n\nMy two biggest gripes with the Freo Z are that it uses a lot of water; it doesn’t have an onboard water tank, so it has to return frequently to refill — and could only clean my 800 square foot area once before I needed to refill the main tank in the dock. By comparison, the X8’s tank only needed refilling after three runs.  \nAdditionally, its app can be frustrating. It’s not easy to navigate, gets hung up between screens, and frequently disconnects from the robot. However, unlike the X8, the Narwal has controls on top of the station to start a clean, and once I had programmed a schedule, I didn’t find myself needing to use the app much at all. \nThe fluffy sidebrush feels more of a novelty than a necessity and doesn’t really seem to do much. Also, at this price, it would be nice if the Narwal offered a self-cleaning washboard. However, its washboard is removable, which makes it easier to clean manually.\nBest robot vacuum and mop with a plumbing hookup\nSwitchBot S10\n\n\nScore: 7\n\nProsCons\n\n\nAlmost hands-free\nExcellent roller mop\nSelf-cleans\nBattery-powered water station\nSupports Matter\n\nBig and wide\nCan’t mop a second floor; it will only vacuum\nShort battery life\nLow suction power\n\n\n\nWhere to Buy:\n\n $1199.99 $399.99 at Switchbot (with code SLOD800)\n $1199.99 $474.99 at Amazon\n\nMultifunction Dock: Yes, auto, empty (4L) and drain/refill (two separate devices) / Mop style: Roller / Mop washing: Yes (during use), hot air drying / Mop Pressure: 2.2lbs at 300 RPM / Mop lift: Yes, 7mm /  Edge cleaning: No / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 6,500Pa / Vacuum brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcut, Matter\nThe SwitchBot S10 is a multitasking robot that hooks into your plumbing for a virtually hands-free sweeping and mopping experience. It’s one of the best robot mops I’ve tested, thanks to its self-cleaning roller mop and the fact that I never had to empty or fill its water tanks. These two features meant I could set it and forget it and have clean floors for weeks.\nMy other favorite feature of the S10 is its dual docking system. Its main dock is a charging / auto-empty dock, and there’s a separate battery-powered dock water station that you can put in a different room. This battery-powered dock is what makes the S10 the best plumbing hookup option, as it gives you much more flexibility with placement. Roborock, Dreame, and Narwal also have plumbing hookup docks, but they require power (I’ve not tested either of those yet).\nWhile the SwitchBot is a decent vacuum, it’s not the best. Its relatively paltry 6,500Pa of suction power is low compared to the competition, but the bot’s weight did help the rubber roller brush dig into the carpet and get up most of the cat hair.\n\nS10 frequently got stuck on clothes left on my floor and bath mats — which are the bane of most mopping bots\n\n\nOther downsides include the AI obstacle avoidance, which isn’t great. The S10 frequently got stuck on clothes left on my floor and bath mats, its battery life is short, and it lacks high-end features like dirt detection. There is also no edge cleaning function, meaning it didn’t do a great job along baseboards and around furniture.\nSwitchBot recently released the Switchbot S20 ($799.99), which looks like the Pro model that made its debut at CES. The upgrade addresses some of my issues with the S10, including adding an extendable roller mop and side brush to add edge cleaning, as well as 15,000Pa. It also comes with the option of two all-in-one auto-empty base stations: one with a regular water tank you manually refill, or one that can hook into your plumbing. But it will also work with the battery-powered water station. I plan on testing this soon.\nRead my full SwitchBot S10 review.\nWhat I’m currently testing and what’s coming next\nAs mentioned before, Ecovacs recently released a successor to the Deebot X8 Pro Omni, aptly called the X9 Pro Omni ($1,299.99). It sports a roller mop like the X8 Pro, but the big difference is that the new model is designed to optimize airflow from intake to exhaust rather than relying solely on suction power. The upgrade could lead to better deep-cleaning, though we haven’t put it through its paces yet.\nRoborock’s Saros 10 ($1,299.99 $1,599.99) and Saros 10R ($1,299.99 $1,599.99) are upgrades to my pick for the best overall robot vacuum, the S8 MaxV Ultra. Both can automatically remove their mop pads when not needed, which is a new option for Roborock. One uses dual spinning mops, the other a flat vibrating pad.\nRoborock also recently released the Saros Z70 ($1,599 $2,599), the first mass-produced robovac to feature a robotic arm that can pick up light objects — including socks, tissues, and sandals. The arm isn’t the most reliable, and the vacuum occasionally struggles with correctly identifying items, but it’s otherwise an excellent model with 22,000Pa of suction power and dual spinning mop pads that it can remove on its own. Read our review.\nRoborock’s cheaper Qrevo Curv ($1,099.99 $1,599.99) also has dual spinning mop pads (which you have to remove) and can raise itself to clear thresholds up to 40mm. The company’s Qrevo Slim ($899.98 $1,399.99) offers similar functions but features a new navigation system and lacks a lidar tower, allowing it to fit under low furniture.\niRobot’s new Roomba lineup features two models with dual spinning mopping pads and auto-wash docks. The new Roomba Plus 505 Combo Robot Plus AutoWash Dock ($599.99 $999.99) also offers heated mop drying, a feature the higher-end Roomba Combo 10 Max lacks.\niRobot also recently introduced an upgraded version of the Roomba Max 705, the Roomba Max 705 Combo, which will be available for preorder in North America “later this year” for around $1,272 (€1099). Like the Max 705, it features dual rubber roller brushes that are resistant to tangling, along with AI-powered obstacle detection. It also comes with a unique roller mop cover that automatically deploys as it cleans, as well as a design that allows the mop to extend into corners and clean along wall edges.\nPriced at $999.99, Eufy’s new Robot Vacuum Omni E28 is a self-emptying, self-refilling, and self-washing robot vacuum with a rolling mop that can go over tough stains a second time if needed. The charging dock also includes a built-in deep cleaner that sprays water to tackle stains before sucking the mess into a separate wastewater tank.\nThe recently launched Narwal Flow costs $1,299.99 ($200 off) with code NFLOW, and features the company’s first roller mop which can also extend. We haven’t spent any time with it yet, but Narwal claims it can easily tackle thick, fluffy carpets thanks to its deep carpet boost mode.\nThe Matic is a $1,095 robot vacuum that doesn’t need a cloud connection to work and can suck up wet spills as well as dry ones. Here’s some video of it in action.\nThe $1,099.99 Eureka J20 features a very wide roller mop but only 8,000Pa suction, but it is no longer available on Eureka’s website. The new J15 Max Ultra ($1,299) can accurately spot liquids and automatically rotate its body to tackle wet spills with its dual spinning mopping pads. It’s an upgrade to the J15 Pro Ultra ($779.87 $999.99), which can identify colored liquids but not clear or white ones.\nThe Dreame X50 Ultra ($1,259.99 $1,699.99) features a “motorized swing arm” that functions like a leg, enabling the robovac to climb over transitions up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra in this guide, only with higher suction power and a retractable lidar tower.\nThe Switchbot S20 ($799.99), which resembles the Pro model announced at CES earlier this year, is now available. It’s essentially the successor to our previous pick for the best mopping vacuum, the Switchbot S10, with an extendable roller mop / side brush and 15,000Pa of suction power.\nSharkNinja’s PowerDetect NeverTouch Pro 2-in-1 robot vacuum mop ($699.99 $999.99) can lift itself up as high as 20mm to get over rugs and transitions. Its automatic empty /wash / dry cleaning station doesn’t require bags, either.\nPhotography by Jennifer Pattison Tuohy / The Verge\nUpdate, September 3rd: Adjusted pricing / availability and updated copy to reflect Eureka J15 Max Ultra, Narwal Flow, and Switchbot S20 are all now available. Sheena Vasani also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b72ad38efe78e755fca9889d2957a89466b9c50c",
      "title": "Israel intensifies Gaza City attacks as UN warns of 'horrific' consequences for displaced families",
      "url": "https://www.bbc.com/news/articles/c740lm33wyeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T22:03:18.000Z",
      "summary_90w": "",
      "raw": "Strikes reportedly kill 31 people in the city, home to a million people and where a famine was declared last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4070ff02d20c46991e438a56aa7c5a1ea10dbccd",
      "title": "Six charged with terrorism offences over support for Palestine Action ",
      "url": "https://www.bbc.com/news/articles/ckgy215pml2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T22:00:12.000Z",
      "summary_90w": "",
      "raw": "The group allegedly organised meetings over Zoom and planned demonstrations in support of Palestine Action",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f61aed1703a5b195742bd5a56276a97cfbaad8fc",
      "title": "At least 15 dead after Lisbon's historic funicular derails",
      "url": "https://www.bbc.com/news/articles/c1jzlgj915no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:52:01.000Z",
      "summary_90w": "",
      "raw": "Lisbon's mayor says the capital is in mourning, adding it was a \"tragic moment for the city\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71be41d628708f3f42f9d38a1947ce29b4544cc7",
      "title": "Was US strike on 'Venezuela drug boat' legal and what do we know?",
      "url": "https://www.bbc.com/news/articles/cdjzw3gplv7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:34:15.000Z",
      "summary_90w": "",
      "raw": "Experts suggest the strike - which killed 11 alleged cartel members - may be illegal under international law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "What we know about fatal Lisbon funicular derailment",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:33:06.000Z",
      "summary_90w": "",
      "raw": "At least 15 people have been killed and 20 more injured after a carriage on the Gloria funicular derailed and crashed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c699e70ea35239222c9c4bfa861a7fb5a238bbd9",
      "title": "Scale AI is suing a former employee and rival Mercor, alleging they tried to steal its biggest customers  ",
      "url": "https://techcrunch.com/2025/09/03/scale-ai-is-suing-a-former-employee-and-rival-mercor-alleging-they-tried-to-steal-its-biggest-customers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T21:21:30.000Z",
      "summary_90w": "",
      "raw": "Scale is clearly concerned enough about the threat of Mercor, and the poaching of one of its employees, to pursue legal action.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e20eef030daea95215be8ec0de8ff2718dbb5f96",
      "title": "Rayner admits underpaying tax on £800,000 Hove flat as Starmer backs her",
      "url": "https://www.bbc.com/news/articles/cy50446rq73o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:10:28.000Z",
      "summary_90w": "",
      "raw": "The deputy prime minister says she has referred herself for an ethics probe by the PM's adviser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "845c205ad87dbceeefb8ecdd1cee091f223a3b85",
      "title": "The best deals on 4K TVs",
      "url": "https://www.theverge.com/22371561/best-4k-tv-deals-sale-lg-samsung-sony-tcl",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T21:01:01.000Z",
      "summary_90w": "",
      "raw": "Hisense’s U65QF is currently on sale at Amazon starting at a cool $596.99 ($403 off). | Image: Sony\t\n\nThings are looking bright for those who want to nab a great TV in 2025 at a substantial discount. There’s usually a great deal happening on a mid- or high-end TV from LG, Sony, TCL, Hisense, or Amazon’s own Fire TV brand — even if the biggest discounts remain reserved for Black Friday, Cyber Monday, Amazon Prime Day, and during the lead-up to the Super Bowl.\nRight now, there are a number of discounted 4K TVs to choose from, spanning a wide variety of prices, sizes, and feature sets. Whether you want a secondary screen for the bedroom or a high-end OLED that’s built to provide the ultimate gaming or cinematic experience, we’ve picked out the best TV deals.\n\nThe best 4K TV deals for most people\nThe best 4K TV deals for those on a budget\nThe best deals on high-end 4K TVs\n\nThe best 4K TV deals for most people\nSamsung Q8F \nSamsung’s Q8F is available for an all-time low of $599.99 ($150 off) at Amazon and Best Buy for the 55-inch model, which is a solid value for a QLED 4K TV. Its quantum dot LED panel boasts great contrast (especially in HDR content). The Q8F has a 120Hz panel and four HDMI 2.0 ports. This means you can play in 4K at up to 60Hz with a Nintendo Switch 2, Xbox Series S/X, or a PlayStation 5 Pro, or at a faster 120Hz refresh rate bumped down to 1440p resolution. Samsung is also including two free months of Xbox Game Pass Ultimate with purchase, which will allow you to stream games directly to your TV through the cloud, eliminating the need for a console.\nThe TV is powered by Samsung’s Q4 AI processor, which is used to upscale HD video to 4K when necessary, to optimize the picture in real-time, and make navigating its interface feel snappy. Samsung also touts the Q8F’s audio system, which adjusts the EQ and boost dialogue volume when needed. If you’ve cut the cord with cable, you can watch over 2,700 free channels of TV (over 400 of which are exclusive to Samsung TVs) in addition to streaming services. You can save $402 by jumping up to the 85-inch model, which is on sale for around $1,597.99 at Amazon and Best Buy.\nSamsung Q8F\n\nWhere to Buy:\n\n $747.99 $599.99 at Amazon (55-Inch)\n $749.99 $599.99 at Best Buy (55-Inch)\n $2297.99 $1597.99 at Amazon (85-Inch)\n\nIf you’re looking for a 65-inch TV for watching sports, TV shows, movies, or playing video games, Hisense’s U65QF is a great choice, one you can currently purchase at Amazon and Best Buy for an all-time low of around $596.99 ($403 off). The TV features a native 144Hz refresh rate and two HDMI 2.1 ports, both of which can take full advantage of the high-speed display. It also sports a pair of HDMI 2.0 ports — which can carry a 4K signal at up to 60Hz — and a port assortment that makes it a good choice for current-gen consoles, 4K Blu-ray players, and streaming devices. If you connect a gaming PC with an AMD graphics card, you can even take advantage of the TV’s support for AMD FreeSync Premium Pro, which reduces graphical glitches such as screen tearing. \nThe U65QF has an LED screen, which means it can’t match the black levels or per-pixel brightness control you’d get with an OLED display. However, its full array lighting panel offers 300 local dimming zones. The TV can control the brightness of each zone to reduce blooming, which is what happens when the area around a bright object (think a lit torch in a cave) looks unnaturally bright. Additionally, the TV has a maximum brightness of 1,000 nits, so the image it produces should look good even in a room with some light interference. The U65QF also supports Dolby Vision, HLG, and HDR10 Plus for better color reproduction, and it features a Hi-View AI chip that automatically processes the image on screen so that it appears sharper. \nAs for its operating system, Hisense’s U65QF runs on Amazon’s Fire OS and features Amazon Alexa built in. You can use the smart assistant to control the TV’s many functions, search for content, control compatible smart home accessories, and look up answers to various questions with your voice. If you want an even larger screen, you can also pick up a 75-inch model for around $797.99 ($502 off) at Amazon and Best Buy.\nHisense U65QF TV (2025)\n\nWhere to Buy:\n\n $999.99 $596.99 at Amazon (65-inch)\n $999.99 $599.99 at Best Buy (65-inch)\n $1299.99 $797.99 at Amazon (75-inch)\n\nThe best 4K TV deals for those on a budget\nAmazon Fire TV 4-Series\nAmazon’s Fire TV 4-Series is an affordable option if you want to upgrade a smaller HDTV to a 4K model. The 50-inch model is currently on sale for $289.99 ($110 off) at Amazon. The TV features an LED panel with a 60Hz refresh rate and support for HDR10 / HLG, which is totally sufficient for casual TV viewing or watching movies and TV shows. It runs Fire OS, and comes with a remote that allows you to summon Amazon Alexa with the push of a button for a query or command. You can step up to a 55-inch model for $359.99 ($100 off) if you like its modest feature set but want a slightly larger screen.\nAmazon Fire TV 4-Series\n\nWhere to Buy:\n\n $399.99 $289.99 at Amazon (50-Inch)\n $459.99 $359.99 at Amazon (55-Inch)\n\nHisense QD7\nIf your budget is under $500, the 55-inch Hisense QD7 has a lot to offer, especially now that it’s on sale for an all-time low of around $357.99 ($132 off) at Amazon and Best Buy. It features a QLED panel that can deliver more contrast and brightness than a typical LED TV, with support for HDR10 Plus and Dolby Vision, with a peak brightness of 600 nits. The 4K set features a processor capable of AI upscaling and full array local dimming with 160 local dimming zones. A panel with full array local dimming offers better control of brightness and contrast than direct- or edge-lit LED panels (this video from LG shows how it works), providing a more consistent picture across the entire screen. The QD7’s obvious weak point is gaming, due to its 60Hz refresh rate, but if that’s not important to you, it remains a superb value. If you want a larger TV, you can get a 65-inch model for around $467.99 ($132 off) at Amazon and Best Buy.\nHisense QD7\n\nWhere to Buy:\n\n $499.99 $357.99 at Amazon (55-Inch)\n $499.99 $359.99 at Best Buy (55-Inch)\n $599.99 $467.99 at Amazon (65-Inch)\n\nThe best deals on high-end 4K TVs\nSony Bravia 8 II OLED\nIf you want a TV that produces reference-quality images, Sony’s Bravia 8 II (K65XR80M2) is the best choice. It was recently selected as the top TV in Valve Electronics’ 10th annual TV Shootout based on objective and subjective tests conducted by a panel of experts comparing each set to the image on a $43,000 reference monitor. Disclosure: Verge editor-in-chief Nilay Patel was one of the judges. The 55-inch model also recently received a substantial price cut, dropping it to $2,198.99 ($801 off) at Amazon.\nSony’s premium set has a 120Hz refresh rate panel, with two HDMI 2.1 ports that support 4K at 120Hz, and two HDMI 2.0 ports that top out at 4K / 60Hz. It doesn’t support Nvidia’s G-Sync or AMD’s FreeSync Pro, so there aren’t any specific features on this TV that PC gamers can take advantage of. Sony calls the Bravia 8 II its brightest OLED screen yet, and testing conducted by Hometheaterreview found its maximum brightness was 1,880 nits when viewing HDR content. Its predecessor topped out at 1,300 nits HDR video, or roughly 44 percent dimmer. \nThe TV runs on Sony’s XR processor, which uses AI to adjust the color, contrast, and clarity of whatever you’re watching in real time to look better. The judges in the aforementioned TV Shootout chose Sony’s set as the best model for SDR (Standard Dynamic Range) processing, but third of four models compared for HDR (High Dynamic Range) processing. Any OLED TV can show true black, but judges agreed that the Bravia 8 II pulled ahead in grayscale and contrast when viewing SDR video.\nSony says its TV has modes calibrated for Netflix, Prime Video, and its own Sony Pictures Core streaming services, too. Sony Picture Core is a streaming service that’s available on select Bravia TVs and Sony gaming consoles, and allows you to stream or download 4K movies at far higher bitrates than competing services. The Bravia 8 II comes with 10 credits, which you can use to download movies for offline viewing, and two years of unlimited streaming for films in its catalogue.\nIf you want this TV in a larger size, Amazon and B&H Photo are offering the 65-inch model for around $2,998 ($501 off).\nSony Bravia 8 II\n\nWhere to Buy:\n\n $2999.99 $2198 at Amazon (55-inch)\n $2999.99 $2299.99 at Best Buy (55-inch)\n $3499.99 $2998 at Amazon (65-inch)\n\nLG C4 OLED\nThe last-gen LG C4 remains one of the best OLED TVs you can buy, and the 65-inch model is currently on sale for around $1,396.99 ($1,303 off) at Amazon, B&H Photo, and Best Buy. Like LG’s newer C5 OLED, it has a 120Hz panel with support for VRR, Nvidia G-Sync, and AMD FreeSync Premium (the option exists to enable a 144Hz mode if you dig in the TV’s options). Its embedded A9 AI Processor Gen7 offers higher-quality video upscaling and image optimization compared to the C3. The biggest difference between the C4 and C5 is their maximum brightness. The C4 tops out at an advertised 1,000 nits, while the C5 tops out at around 1,165 according to tests conducted by Tom’s Guide.\nAdditionally, the C4 features a three-channel audio system, which might sound impressive compared to other TVs, but still can’t compete with a soundbar. When you’re not watching videos or playing games, you can also enable the C4’s Gallery Mode to display art. Basically, the LG C4 offers many of the same features as the C5, but retails for nearly $400 less. You can also save on the 77-inch model, which is on sale for around $1,799.96 ($1,900 off) at Best Buy and Amazon. \nLG C4\n\nWhere to Buy:\n\n $1596.99 $1396.99 at B&H Photo (65-Inch)\n $1599.99 $1396.99 at Amazon (65-Inch)\n $3699.99 $1799 at Amazon (77-inch)\n\nSony A90K\nSony’s 42-inch A90K is a premium OLED TV that it claims is specially optimized with features for gaming on a PlayStation 5, but realistically, all of the TVs in this list work great with the PS5 — not to mention all other modern consoles. It’s currently on sale for around $1,198 ($102 off) at Amazon, B&H Photo, and Best Buy. The TV has a 120Hz panel, with two HDMI 2.0 ports and HDMI 2.1 ports.\nAbout the special PS5 features, if you connect the console to the A90K, the TV will automatically enable Auto HDR Tone Mapping for more accurate colors, along with an Auto Genre Picture Mode that will adjust its settings based on the game you’re playing. Sony’s Cognitive Processor XR automatically adjusts the TV’s contrast, brightness, and colors.\nThe A90K can access Sony Pictures Core, a movie streaming platform exclusive to higher-end Sony TVs that allows you to watch uncompressed 4K movies. Sony includes 10 credits to build your Sony Pictures Core library, plus 24 months of streaming access. The aforementioned library is more limited than other streaming services, but it’s the closest you’ll get to watching a 4K Blu-ray without having to pop in a disc. Sony also offers the A90K in a 48-inch size, and you can pick one up at Amazon and Best Buy for around $1,298 ($102 off).\nSony A90K\n\nWhere to Buy:\n\n $1298 $1198 at Amazon (42-Inch)\n $1299.99 $1199.99 at Best Buy (42-Inch)\n $1399 $1298 at Amazon (48-Inch)\n\nSony A95L\nSony’s 55-inch A95L is a premium TV with features that should appeal to gamers and cinephiles alike, and you can get it for around $2,198 ($601 off) at Amazon, B&H Photo, and Best Buy. The TV has a 120Hz panel and two HDMI 2.1 ports (four HDMI ports total), so you can play games in 4K at up to 120 frames per second. Its two HDMI 2.0 ports are fine for last-gen consoles like the original Nintendo Switch. If you connect a PS5, the TV will adjust its video settings based on the genre of game you’re playing, which is a nice touch, but games on that console will look incredible on any OLED set.\nSony’s Cognitive Processor XR powers the A95L, which enables better motion processing so sports and games look less blurry. It also claims to improve the contrast and colors compared to previous generation Sony TVs. It has a peak brightness of 1,300 nits according to lab tests by Tom’s Guide, which is higher than most of the other OLED TVs we found on sale.\nThe A95L is a Bravia-series TV, which means it can access Sony’s Picture Core. This video on demand service has the highest-bitrate (aka video quality) of any streaming platform, which means what you watch will look closer to an uncompressed 4K Blu-ray than a 4K stream from Netflix. Its library is limited, but Sony includes 10 credits with A95L, so you can download movies to keep forever, and a 24-month subscription that lets you stream videos from the library.\nIf you want a higher-end OLED TV, Sony’s A95L is a great choice and has features you won’t find on non-Sony TVs. You can also get the 65-inch model on sale for around $2,898 ($601 off) at Amazon, Best Buy, and B&H Photo.\nSony A95L\n\nWhere to Buy:\n\n $2799 $2198 at Amazon (55-Inch)\n $3499.99 $2898 at Amazon (65-Inch)\n\nUpdate, September 3rd: Updated pricing / availability and added newer deals for Samsung’s Q8F and Hisense’s U65QF.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98b5084e74c414dfa3446f027f4d8bb72c4b3660",
      "title": "Migrant crisis: How Europe went from Merkel's 'We can do it' ten years ago to pulling up the drawbridge",
      "url": "https://www.bbc.com/news/articles/cn5e5q7w41eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:00:06.000Z",
      "summary_90w": "",
      "raw": "A number of European governments are proposing restrictive measures on migrants in response to public concern",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89f59d31c354d6e17539bc89780fa6ae073b4b09",
      "title": "Apple’s Siri upgrade could reportedly be powered by Google Gemini",
      "url": "https://techcrunch.com/2025/09/03/apples-siri-upgrade-could-reportedly-be-powered-by-google-gemini/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:50:38.000Z",
      "summary_90w": "",
      "raw": "An AI Siri is in the works and it could be running Gemini under the hood.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20eb2ef62bd42eaea6cc83f99facf1ca08a5458a",
      "title": "Apple&#8217;s rumored AI search tool for Siri could rely on Google",
      "url": "https://www.theverge.com/news/770712/apple-ai-search-tool-siri-google-gemini",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T20:47:46.000Z",
      "summary_90w": "",
      "raw": "Apple is working on an AI-powered search feature for Siri – but it might need Google’s help to make it happen, according to a report from Bloomberg’s Mark Gurman. As noted by Gurman, Google is currently in the lead to help Apple revamp its voice assistant, which could involve using a custom Gemini model running on the iPhone maker’s servers.\nThe new feature, reportedly called “World Knowledge Answers” internally, will allow users to search for information and receive AI-generated summaries based on results from the web. Its interface will also incorporate text, photos, videos, and points of interest, allowing it to challenge the AI-powered search features from companies like OpenAI and Perplexity.\nPutting AI search into Siri is part of Apple’s delayed plans to upgrade the voice assistant with new features that will let it tap into your personal data and perform actions based on the content on your screen. The new Siri will reportedly work by leveraging a planner, which helps interpret voice or text prompts, a search system to scan user data or the internet, and a summarizer to package all of this information for users.\nThis week, Apple and Google reached a “formal agreement” for Apple to test a Google-designed AI model for Siri’s summaries, according to Bloomberg. Apple reportedly plans to use its own AI models to search user data, but it’s still evaluating Anthropic’s Claude and Gemini for Siri’s planning function.\nEven though Apple’s set to take the wraps off its iPhone 17 lineup next week, the company is expected to launch the AI-upgraded Siri alongside iOS 26.4 as early as next March.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5e7999c594df3a870c920f621776137372017b78",
      "title": "I tried Jsaux’s new anti-glare Switch 2 screen protector, and it revealed a glaring bug",
      "url": "https://www.theverge.com/games/770667/i-tried-jsauxs-new-anti-glare-switch-2-screen-protector-and-it-revealed-a-glaring-bug",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T20:39:00.000Z",
      "summary_90w": "",
      "raw": "Testing this anti-glare screen protector revealed a very dead cockroach in my ceiling.\t\n\nI have a dead cockroach in my ceiling, and I only noticed it thanks to a Switch 2 screen protector that, ironically, is supposed to tame reflections. The protector in question is a pre-production sample of the Jsaux Obsidian AR screen protector, which is coming in October for $21.99.\nThe company claims it's better than standard screen protectors because it features a similar physical vapor deposition (PVD) coating found in the Apple Studio Display. It's supposed to reduce glare while retaining a glossy appearance - an ideal combination for gamers, since you can't always choose where you'll play games.\nIn reality, this pre-production screen …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f2d277de90aedf7f7e5b1351125c8e71ab5fba1",
      "title": "Switzerland releases its own AI model trained on public data",
      "url": "https://www.theverge.com/ai-artificial-intelligence/770646/switzerland-ai-model-llm-open-apertus",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T20:32:37.000Z",
      "summary_90w": "",
      "raw": "Switzerland launched an open-source model called Apertus on Monday as an alternative to proprietary models like OpenAI’s ChatGPT or Anthropic’s Claude, reports SWI as spotted by Engadget. The model’s source code, training data, model weights, and detailed development process are available on the AI model platform HuggingFace. \nApertus, which is Latin for “open,” was designed to “set a new baseline for trustworthy and globally relevant open models,” according to the developers. The model was trained on over 1,800 languages and comes in two sizes with either 8 billion or 70 billion parameters. Apertus is comparable to the 2024 Llama 3 model from Meta, according to SWI.  \nThe model was built to adhere to the European Union’s copyright laws and voluntary AI code of practice, which some US-based AI companies have said reluctantly signed while claiming that the regulations will curb AI innovation and deployment. Apertus’ training data was restricted to public sources, while adhering to the AI crawler opt-out requests on certain websites, according to the developers. (No “stealth-crawling.”)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "608102d1cdc7f5e8b6c4110e029582303678f921",
      "title": "xAI’s CFO is the latest executive to leave Elon Musk’s AI firm",
      "url": "https://techcrunch.com/2025/09/03/xais-cfo-is-the-latest-executive-to-leave-elon-musks-ai-firm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:27:06.000Z",
      "summary_90w": "",
      "raw": "While at xAI, Mike Liberatore helped orchestrate the company's $5 billion debt raise, alongside another $5 billion in equity — almost half of which came from SpaceX.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf98919d51795ddc07cb82891d7d5cfa15d71007",
      "title": "FirstClub bucks India’s speed obsession, quickly triples valuation to $120M with premium approach",
      "url": "https://techcrunch.com/2025/09/03/firstclub-bucks-indias-speed-obsession-quickly-triples-valuation-to-120m-with-premium-approach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:21:08.000Z",
      "summary_90w": "",
      "raw": "FirstClub has raised $23 million in a Series A round co-led by Accel and RTP Global to expand its premium quick commerce platform.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f3dd8389ae2770124a285eedfef8bc7a4b2dd51",
      "title": "Putin says Russia will achieve all aims militarily if Ukraine does not agree deal",
      "url": "https://www.bbc.com/news/articles/c4g7dze5n1vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T20:15:02.000Z",
      "summary_90w": "",
      "raw": "The Russian leader has rejected calls for a ceasefire as his troops advance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8b771c6ebed60f2170cedca352d4f0352bcf630",
      "title": "A spine-tingling discovery: This dinosaur had spiked body armor",
      "url": "https://www.npr.org/2025/09/03/g-s1-86846/spiked-dinosaur-discovered-spicomellus",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T20:05:07.000Z",
      "summary_90w": "",
      "raw": "In a new paper, researchers describe a bizarre dinosaur with thorny spines along its neck and back that made its home in Africa more than 165 million years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b29b32e907a9d6b45db1825de457cbb16f4aea0",
      "title": "Farage to speak to council leader over press ban ",
      "url": "https://www.bbc.com/news/articles/cgknyjkvmzlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T19:46:28.000Z",
      "summary_90w": "",
      "raw": "Nigel Farage says he will look to be a peacemaker between Mick Barton and Nottinghamshire Live.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60f63920bc1218b34be171af49182de80b50c614",
      "title": "Angela Rayner Admits Underpaying Tax",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0p6d8?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T19:46:00.000Z",
      "summary_90w": "",
      "raw": "How did the housing secretary pay the wrong amount of stamp duty?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c70923c675b74837f6096d78a5bef59430d9d8de",
      "title": "CoreWeave acquires agent-training startup OpenPipe",
      "url": "https://techcrunch.com/2025/09/03/coreweave-acquires-agent-training-startup-openpipe/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T19:38:36.000Z",
      "summary_90w": "",
      "raw": "CoreWeave hopes the YC-backed startup will help it expand up the stack and cash in on enterprises developing AI agents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "295d2c34a4380cee11e95a8ab2f5dbc49137757e",
      "title": "How Trump's latest crypto launch enriches his family",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527047/trump-crypto-family-world-liberty-financial",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T19:36:02.000Z",
      "summary_90w": "",
      "raw": "The president and his sons made $5 billion on paper as their cryptocurrency started trading — highlighting the extraordinary degree to which they are personally profiting from Trump's return to the Oval Office.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc68d0fda0013c3c40d46032dde62b65ba53ca31",
      "title": "Florida working to end vaccine mandates",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527093/florida-working-to-end-vaccine-mandates",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T19:16:08.000Z",
      "summary_90w": "",
      "raw": "Florida lawmakers will vote whether to repeal a law that requires children to receive vaccines for polio, diphtheria, measles, and mumps before entering school.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "504d59613f855e48e5ce80ec000e9a074b317637",
      "title": "Epstein survivors join with lawmakers in calling for full release of government files",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527055/epstein-survivors-press-conference",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T19:05:40.000Z",
      "summary_90w": "",
      "raw": "Standing in front of the U.S. Capitol, a group of eight survivors shared emotional stories of abuse and demanded more transparency from Congress on the government's investigation into Jeffrey Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef49b6da6156c80702ef838a8acebdbc6556424e",
      "title": "007 First Light looks like a hit, man",
      "url": "https://www.theverge.com/news/770509/007-first-light-state-of-play-september-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T18:59:54.000Z",
      "summary_90w": "",
      "raw": "IO Interactive, developers of the much-beloved Hitman series, showed off its latest title, 007 First Light during a special September State of Play. In it, instead of a bald Agent 47, you play a youthful and immaculately coiffed James Bond — and that’s pretty much the biggest distinction between the two games. Watch the thirty minute stream here.\n\nAs in Hitman, First Light’s gameplay demo featured a fancy party at a luxurious estate, lots of slow walking to blend in with the crowd, listening to ambient conversation for clues, and, of course, lots of fancy cars to drive and inevitably wreck. Basically, what IO showed of First Light makes the game look like Hitman with a fancy 007 skin. Which, honestly, probably suits a lot of players just fine.\nWith the success of Teenage Mutant Ninja Turtles: Shredders Revenge and Indiana Jones and the Great Circle, licensed games are making a big comeback. And while IO continues to update Hitman: World of Assassination with new missions and fancy new targets, it’s been four years since the last full Hitman release. 007 First Light seems like it’ll be a new way to scratch that spy thriller assassination itch and you won’t have to wait too long for it either. 007 First Light launches on March 27th on Xbox, PlayStation, Switch 2, and PC.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9a34fb40907479b89130d9441396279060faf843",
      "title": "SpaceX gets a green light to more than double its Florida launches",
      "url": "https://techcrunch.com/2025/09/03/spacex-gets-the-green-light-to-more-than-double-its-florida-launches/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:36:59.000Z",
      "summary_90w": "",
      "raw": "SpaceX is one step closer to nearly tripling the number of Falcon 9 launches from Florida.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a67922731a4d2f341e0bc3fa19ee0e08803c518",
      "title": "Scotland bans arms companies that supply IDF from receiving financial aid",
      "url": "https://www.theguardian.com/uk-news/2025/sep/03/scotland-government-defence-israel-military-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:35:28.000Z",
      "summary_90w": "",
      "raw": "Devolved government says contractors seeking support must prove products will not be used by Israeli military \nThe Scottish government has banned arms companies which supply the IDF from getting grants and investment support, and will freeze support for trade with Israel.\nJohn Swinney, the first minister, said on Wednesday any defence contractors who wanted financial help in Scotland would have to prove their products would not be used by the Israel Defense Forces.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9855fd9603f3aa45f4f5efd5a662d51d0d9a0692",
      "title": "Trump says ‘you’ll see things happen’ if US is unhappy with Putin’s decisions – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:28:03.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. For the latest on the Trump-Nawrocki meeting, you can read our full report here:\n\nTrump pledges to ‘stand with Warsaw’ in meeting with Polish president\n\nPutin was also asked about the prospect of more EU sanctions against Russia or its allies, including China and India.\nHe said the leaders did not discuss this during their recent conversations.\n“I think there’s a light at the end of the tunnel. We will see.\nOtherwise, we will be forced to resolve all our objective objectives through military means.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90927607a19b0632a293197ee3232c5d55ed741b",
      "title": "President Trump floats deploying National Guard troops to New Orleans",
      "url": "https://www.npr.org/2025/09/03/g-s1-86813/trump-national-guard-new-orleans",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T18:20:15.000Z",
      "summary_90w": "",
      "raw": "President Trump said the White House is considering whether to deploy National Guard troops to Chicago or a place with a governor who would welcome them, like New Orleans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3802f6fd2bee9d8ee61c711ac7fde5acd34e24f6",
      "title": "Kim Jong-un promises to do ‘everything to assist’ Moscow after Putin meeting",
      "url": "https://www.theguardian.com/world/2025/sep/03/kim-jong-un-promises-to-do-everything-to-assist-moscow-vladimir-putin-russia-north-korea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:19:19.000Z",
      "summary_90w": "",
      "raw": "North Korean leader invited to visit Russia as Zelenskyy says Putin is displaying ‘impunity’ with new Ukraine strikes \n\nEurope live – latest updates\n\nVladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nNorth Korea has supported Russia in its war against Ukraine with weapons and troops, and the Russian president praised North Korean fighters for acting “courageously and heroically”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af68edbf9f6bb8ab4fa969df7a091068a361887a",
      "title": "In a brawl over right-wing TV, Newsmax sues Fox News",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527077/newsmax-sues-fox-news",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T18:14:43.000Z",
      "summary_90w": "",
      "raw": "Right-wing TV news outlet Newsmax sued Fox News on antitrust grounds, alleging the conservative media powerhouse had illegally sought to suppress its smaller rival's growth in cable news.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6023382567017df0bca69e13add09e70cf8b7a0b",
      "title": "Pornhub owner pays $5M settlement to FTC over historic failure to block abusive content",
      "url": "https://techcrunch.com/2025/09/03/pornhub-owner-pays-5m-settlement-to-ftc-over-historic-failure-to-block-abusive-content/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:12:21.000Z",
      "summary_90w": "",
      "raw": "Pornhub owner Aylo will pay a $5 million settlement to the FTC and Utah over allegations that the company knowingly profited off of illegal materials.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3d994c765228816211cbc80839266e1cc87a2fc5",
      "title": "Hurricane Katrina had a silver-lining for some: Post-traumatic growth",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/03/nx-s1-5525985/hurricane-katrina-20-years-ptsd-post-traumatic-growth",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T18:10:40.000Z",
      "summary_90w": "",
      "raw": "The mental health effects of Hurricane Katrina have been studied for more than a decade, and that research found that post-traumatic growth can co-exist with post-traumatic stress.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ebaaa97b2b29a838f5450d7aecfa1509451b290",
      "title": "Anker&#8217;s power bank with built-in USB-C cables is a great deal at $25 off",
      "url": "https://www.theverge.com/tech/770332/anker-laptop-charger-samsung-galaxy-buds-3-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T18:08:45.000Z",
      "summary_90w": "",
      "raw": "The Anker Laptop Power Bank can charge four devices at once.\t\n\nAnker’s Laptop Power Bank came to the rescue of my laptop and smartphone during a recent power outage. They were on the verge of dying, but its pair of built-in USB-C cables powered up my devices so I could keep working remotely. Since then, I carry it with me wherever I go, and it’s bailed me out time and again. If you need a powerful, portable charger, you can buy it for $94.49 ($25 off) at Amazon, Best Buy, and directly from Anker with code WS7DV2RO9DEU, which is about $7 shy of its all-time low.\nAnker 25,000mAh Laptop Power Bank\nAnker’s latest power bank sports three USB-C ports, plus one USB-A port. It tops out at 165W when charging two devices simultaneously, or 130W when charging three or four.\n\nWhere to Buy:\n\n $119.99 $94.49 at Amazon\n $119.99 $94.49 at Best Buy\n $119.99 $94.49 at Anker (with code WS7DV2JSRCFW)\n\nThis power bank is equipped with three USB-C ports, each capable of delivering up to 100 watts of power when only one 100W-ready device is plugged in. It can provide up to 165W of power when two devices are plugged in via USB-C, or up to 130W when you’ve got up to four devices plugged in. Anker also includes a USB-A port, which is handy for those who own older devices. During the aforementioned power outage, it simultaneously powered my MacBook, smartphone, and even a USB-C-powered flashlight, bringing my tech back to life in just a couple of minutes. \nWhat I also liked is that Anker includes a useful digital display that helps you keep tabs of remaining charge, battery health, and per-port power output. And, while the 25,000mAh / 90Wh power bank is a bit on the heavier side, it’s compliant with airline carry-on regulations, meaning you can safely take it to top up your gadgets during a flight. It’s a helpful gadget to have on hand, whether you’re working from a cafe, traveling, or stuck in the middle of a blackout.\nA couple more ways to save\nWoot’s selling the Samsung’s Galaxy 3 Buds for $74.99, down from $179.99. Samsung’s entry-level earbuds reminded us of the AirPods Pro with their angular stemmed design and gesture-based controls. The open-style earbuds also offer solid noise cancellation along with an IP57 rating and wireless charging support. Read our hands-on impressions.\nYou can buy Metaphor: ReFantazio for Xbox Series X from Woot for $21.99, down from $69.99. The medieval-era, turn-based RPG from the creators of Persona delivers a well-written story that explores themes of discrimination with nuance, while offering beautiful visuals and engaging combat. Like some of Woot’s other deals, this title includes a 90-day warranty instead of a one-year warranty. Read our review.\nGovee’s Outdoor UpDown Wall Light is on sale for $109.99 ($20 off) at Amazon exclusively for Prime members. The color-changing smart wall lamp provides up and down illumination coverage of up to 12m, while Govee lets you choose from over 64 preset scenes. It also boasts an IP66 waterproof rating and is compatible with Matter, so you can connect it to a wide range of major smart home platforms.\nCorrection, September 3rd: An earlier version of this article misstated in the headline that Anker’s Laptop Power Bank features a pair of retractable USB-C cables. It only features one.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e6cbb96dc149ad762d5baa2b8b164817e5025ac",
      "title": "Google brings Material 3 Expressive to Pixel 6 and newer devices, along with other features",
      "url": "https://techcrunch.com/2025/09/03/google-brings-material-3-expressive-to-pixel-6-and-newer-devices-along-with-other-features/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Google announced on Wednesday that it's bringing a slew of new features to the Android ecosystem and Pixel devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "39afffa0a40bc309bf493eac5f85175c24b07ce2",
      "title": "More Pixel phones are getting Google’s new look for Android",
      "url": "https://www.theverge.com/news/770174/google-pixel-drop-september-2025-material-3-expressive",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T18:00:00.000Z",
      "summary_90w": "",
      "raw": "This month’s Google Pixel drop includes a broader rollout of the company’s splashy UI revamp. Starting today, Google will bring its Material 3 Expressive design language to Pixel 6 devices and newer, in addition to the Pixel Tablet.\nGoogle first revealed the youthful new design language in May before launching it with its Android 16-equipped Pixel 10 phones last month. Along with a more colorful, bubbly look, Material 3 Expressive introduces more personalization options, like iPhone-like calling cards that allow you to create custom call screens for your contacts.\nIn addition to this rollout, Google is bringing a bunch of new features to the Pixel Buds Pro 2, which it previewed during its Made by Google event last month. That includes Adaptive Audio, a feature that automatically adjusts volume based on the sounds in your environment, as well as a new capability that automatically dampens sudden loud noises to protect your hearing. The update adds background noise reduction when interacting with Gemini as well, and the ability to accept or ignore calls by nodding or shaking your head.\nGoogle will also start automatically displaying Maps on your Pixel Watch or WearOS device when you start walking or biking navigation on your phone, allowing you to easily see where you’re going without taking out your phone. These Pixel-specific updates are rolling out now, and “will continue over the next few weeks.”\nSome other tweaks are coming to a wider range of Android devices, too, including the ability to share Bluetooth audio with friends, access AI-powered writing suggestions in Gboard, and favorite your creations in Emoji Kitchen. There’s a redesigned Quick Share menu that lets you toggle between sending and receiving files, and a new Androidify app that uses AI to create your own Android bot using a selfie and a prompt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "18eaab8c752488243624eb4f0ee46524ae57f54e",
      "title": "Pixel phones can now stream music for you and a friend at the same time",
      "url": "https://www.theverge.com/news/770233/google-android-bluetooth-audio-le-multiple-headphones",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Pixel phones will now be able to stream audio to multiple headphones at once thanks to expanded Bluetooth LE Audio and Auracast support. If you have a Pixel 8 or newer, you’ll now be able to pair two headphones at a time. That means you can make your friend listen to the new Nourished by Time single with you on the bus, or catch up on Alien Earth with your significant other on a plane. \nYou’ll be able to create a private broadcast and share it to multiple headphones with a QR code or using Fast Pair — perfect for those times when you’re insisting to a room full of people that they absolutely have to listen to Disintegration Loops on headphones to appreciate it. \nOf course, if you want to host a depressing silent disco, your friends will need headphones that also support LE Audio. Google is expanding Android support to multiple Sony models, including the LinkBuds S, WF-1000XM5, InZone Buds, LinkBuds Open, LinkBuds Fit, WH-1000XM6, and InZone H9 II. That’s in addition to existing support for hearing aids, Samsung’s Galaxy phones, and certain Xiaomi devices.\nIn addition to LE Audio support, Google is also updating the Pixel Buds Pro 2 with Adaptive Audio. That means you can take advantage of active noise cancellation, but still stay aware of your surroundings. So, you won’t hear the constant din of traffic while out for a walk, but if someone honks their horn as you’re about to step out into the street, it’ll cut through. It will also include Loud Noise Protection, which will save your precious eardrums in case a firetruck goes screaming by, sirens blaring.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2828415b2d08604b8b9b58b9845d40d572bf1f6",
      "title": "Scale AI still exists and it’s suing an ex-employee over corporate espionage",
      "url": "https://www.theverge.com/ai-artificial-intelligence/770410/scale-ai-corporate-espionage-data-labeling-mercor-meta",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T17:54:27.000Z",
      "summary_90w": "",
      "raw": "It's been a tumultuous summer for Scale AI: Meta took a multibillion-dollar stake in the company, Mark Zuckerberg hired Scale CEO Alexandr Wang and other top staff, and Scale laid off 14 percent of its workforce. Now the latest development is a lawsuit over corporate espionage in the AI industry. \nThe AI data labeling company, which has provided training data to fuel many of the industry's leading AI models, filed a lawsuit Wednesday against a former employee, Eugene Ling, and his current employer, Mercor, which is one of Scale's key competitors.\nScale alleged that Ling, who was its head of engagement management, stole more than 100 confid …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "46738b286eaed4ae5ffbc04ea33dc6bf97adaa64",
      "title": "What we know about Rayner's tax admission - and the unanswered questions",
      "url": "https://www.bbc.com/news/articles/c62n366q306o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T17:46:33.000Z",
      "summary_90w": "",
      "raw": "The deputy PM has admitted underpaying stamp duty on her £800,000 flat in Hove, East Sussex.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b03a6f42c87eca5c5f6dc673184f446bbf81f1a",
      "title": "SNL announces 5 new cast members, including one from 'Please Don't Destroy'",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526869/snl-new-cast-veronika-slowikowska-ben-marshall-kam-patterson",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T17:40:27.000Z",
      "summary_90w": "",
      "raw": "Ben Marshall of \"Please Don't Destroy\" will join the cast alongside comedians Tommy Brennan, Jeremy Culhane, Kam Patterson and Veronika Slowikowska. Here's what to know about them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6c76c9fa8c25599370709761d12d6d63e95f5d7",
      "title": "Trump pledges to ‘stand with Warsaw’ in meeting with Polish president",
      "url": "https://www.theguardian.com/world/2025/sep/03/polish-president-karol-nawrocki-meeting-trump-tensions-tusk",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T17:40:17.000Z",
      "summary_90w": "",
      "raw": "US president praises Karol Nawrocki for election win and says he was not considering pulling troops from Poland\n\nEurope live – latest updates\n\nThe US president, Donald Trump, has said he was not considering pulling US troops out of Poland and pledged to stand with Warsaw “all the way” during a meeting with the country’s conservative nationalist president, Karol Nawrocki, at the White House.\nBacked by the populist rightwing opposition Law and Justice party, which ruled Poland between 2015 and 2023, Karol Nawrocki unexpectedly won Poland’s presidential election after running a campaign under a Trumpesque slogan of “Poland first, Poles first”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe4623dd6dfdd273b3a458c2fd443e30d7d549fd",
      "title": "Nuclear triad and ‘robot wolves’: parade shows off array of Chinese weapons",
      "url": "https://www.theguardian.com/world/2025/sep/03/nuclear-triad-robot-wolves-china-weapons-parade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T17:38:40.000Z",
      "summary_90w": "",
      "raw": "On display in Beijing were nuclear weapons launched by air, sea and land, laser weapons and four-legged drones\nIt was hardly a subtle attempt to project power. China showed off air-, sea- and land-launched nuclear weapons in its parade on Wednesday, a triad intended to demonstrate that Beijing’s long-term aspiration is to match US military might.\nAlso on display were large underwater torpedo-like drones, intended to threaten western warships, as well as anti-drone lasers and four-legged “robot wolves”, all designed to be noticed, regardless of their actual military effectiveness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f83daf3a017ddf3a870df3eeb4aa2aeb745d116c",
      "title": "Orchard Robotics, founded by a Thiel fellow Cornell dropout, raises $22M for farm vision AI ",
      "url": "https://techcrunch.com/2025/09/03/orchard-robotics-founded-by-a-thiel-fellow-cornell-dropout-raises-22m-for-farm-vision-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:30:00.000Z",
      "summary_90w": "",
      "raw": "The startup uses truck-mounted cameras to collect and analyze data about crop health.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "920eef3436c861dd0f375411b60299a89e501522",
      "title": "Google’s NotebookLM now lets you customize the tone of its AI podcasts",
      "url": "https://techcrunch.com/2025/09/03/googles-notebooklm-now-lets-you-customize-the-tone-of-its-ai-podcasts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:29:03.000Z",
      "summary_90w": "",
      "raw": "When generating an Audio Overview, users can now choose whether they want their AI podcasts to be formatted like a \"Deep Dive,\" \"Brief,\" \"Critique,\" or \"Debate.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "319a7a22278147fae972cf96226ea85b3d806c65",
      "title": "'Ketamine Queen' pleads guilty in Matthew Perry overdose case",
      "url": "https://www.bbc.com/news/articles/c2dng3rrzjdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T17:25:21.000Z",
      "summary_90w": "",
      "raw": "Jasveen Sangha, 42, pleads guilty to five charges relating to the actor's death in Los Angeles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a499eae392f4d396704b69a6569ce912fb3eeca",
      "title": "FAQ: Why were 76 Guatemalan children pulled off deportation flights in the middle of the night?",
      "url": "https://www.npr.org/2025/09/03/g-s1-86788/faq-why-were-76-guatemalan-children-pulled-off-deportation-flights-in-the-middle-of-the-night",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T17:25:11.000Z",
      "summary_90w": "",
      "raw": "A federal judge's emergency order stopped planes carrying Guatemalan migrant children. Attorneys said the rushed deportation effort violated the minors' due process rights.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d7d4cab6cd224eda81d86cf85677224e5a528ed",
      "title": "King jokes about getting older on hospital visit ",
      "url": "https://www.bbc.com/news/articles/c39rk0ey0ljo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T17:23:39.000Z",
      "summary_90w": "",
      "raw": "King Charles talks to hospital patients in Birmingham on his first visit of the autumn.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13c94be78189f3935cdbfbe670647f55244e2071",
      "title": "Why the US government is taking a stake in Intel",
      "url": "https://techcrunch.com/2025/09/03/why-the-us-government-is-taking-a-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:22:36.000Z",
      "summary_90w": "",
      "raw": "The U.S. government's recent stake in Intel comes after a long period of floundering at the company's foundry business.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "83ebd1a8968a0a81a97fea4ffbb71ca0cdc6bfc6",
      "title": "Greece passes draconian legislation with prison terms for rejected asylum seekers",
      "url": "https://www.theguardian.com/world/2025/sep/03/greece-passes-draconian-legislation-with-prison-terms-for-rejected-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T17:03:55.000Z",
      "summary_90w": "",
      "raw": "Those who have asylum claims rejected and do not leave within 14 days will face prison terms of two to five years\nGreece has passed draconian legislation that could mean rejected asylum seekers receiving prison terms, fines and orders to wear ankle tags, in a move that reflects the centre-right government’s continued attempts to deter undocumented migrants from arriving on its soil.\nThe tough penalties usher in an unprecedented era of zero tolerance for people who remain in the country if their asylum claims are denied. As a frontier state, long viewed as a gateway to Europe, Greece has had a surge in migrant arrivals this year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca1a9bd132dfcab4c1d668d788de3497074edcd1",
      "title": "A bipartisan bill to ban lawmakers from trading stocks is unveiled in the House",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5485340/congress-stock-trading-bill",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Efforts to ban congressional stock trading have stalled for years. But a group of bipartisan lawmakers has a new consensus plan and wants a vote to show lawmakers aren't profiting from their roles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e522c8e1944c7e70b54db83e6a5aee0da4483ba",
      "title": "Pilot aims to set round-the-world age record – and get home for 16th birthday",
      "url": "https://www.theguardian.com/world/2025/sep/03/teenage-pilot-byron-waller-round-the-world-record",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:59:59.000Z",
      "summary_90w": "",
      "raw": "Byron Waller, accompanied by instructor but doing all the flying, stops off in England on way round back to Australia\nAt 15 years and 10 months of age, Byron Waller can’t order a pint and has never driven a car, but on Wednesday afternoon he landed his small plane at an airport in Brighton, on England’s south coast. It was the 16th or so stop (he can’t quite remember) of a remarkable airborne odyssey that he hopes will make him the youngest supported pilot to fly around the world.\nThe adventure began at his home in Brisbane, Australia, four weeks ago and has taken the teenager across the Indian Ocean and through the Middle East to Europe, from where he will venture around the other half of the globe back home. Though he is accompanied by an instructor – global aviation rules not easily permitting children to fly around the world on their own – Byron does all the flying of their tiny single-engined Sling TSi aircraft.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4647493f99a07420a1ef4cfae23d16464abeb4",
      "title": "Search for painting looted by Nazis may have found more stolen art",
      "url": "https://www.bbc.com/news/articles/cdx26z142vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:56:22.000Z",
      "summary_90w": "",
      "raw": "The search of property in Argentina linked to the daughters of a fugitive Nazi may have unearthed more stolen artworks, say investigators.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "847cdf520201641f774d1f1a7dc23443011f151a",
      "title": "Democrats blast state department for lack of ‘basic oversight’ of controversial Gaza food organization",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-democrats-gaza-humanitarian-foundation-letter",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:55:29.000Z",
      "summary_90w": "",
      "raw": "Letter by senior Democrats asks state department to reveal details behind financing of Gaza Humanitarian Foundation\nSenior Democratic senators have called on the US secretary of state, Marco Rubio, and the US ambassador to Israel, Mike Huckabee, to reveal details behind the financing and oversight of the Gaza Humanitarian Foundation (GHF) amid concerns over rising death tolls near aid sites, the group’s apparent coordination with the Israeli army and its reported use of private military contractors linked to intelligence operations.\nThe letter, co-signed by senators Elizabeth Warren, Chris Van Hollen and Peter Welch, accuses the state department of an “inability to answer basic questions about GHF in a timely manner” and said that the department’s “overriding of internal protocol and staff warnings is particularly concerning given it is unlikely to be able to conduct basic oversight of the funds it provided to GHF”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "120d64af2dfb7dfb6fb4a3fc8eb9b9309b435b54",
      "title": "Hot mic catches Xi and Putin discussing organ transplants and immortality",
      "url": "https://www.bbc.com/news/articles/cr70rvrd41ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:51:50.000Z",
      "summary_90w": "",
      "raw": "The Chinese and Russian leaders have been in power for 13 and 25 years respectively, with neither expressing any intention of stepping down.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98d024e06fb98ebf0f6fe23522c10d3e006427ef",
      "title": "Charges against Brazil's Bolsonaro are political, says lawyer",
      "url": "https://www.bbc.com/news/articles/ce83881001eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T16:44:00.000Z",
      "summary_90w": "",
      "raw": "The former Brazilian president denies conspiring to overturn his 2022 election loss to his left-wing rival, Luiz Inácio Lula da Silva.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5ec774211d5e8c3171f2dda0016d398b822f70c",
      "title": "Top Obama-era Latin American expert warns of ‘disastrous’ US intervention in Venezuela",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-military-venezuela-strike-guerrilla-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:39:43.000Z",
      "summary_90w": "",
      "raw": "US military buildup and attack on alleged narco boat spark fears of protracted guerrilla war in South America\n\nTrump’s Venezuela gunboat diplomacy: sabre-rattling or prelude to invasion?\n\nThe White House’s former top Latin America official has said he fears the US could stumble into a protracted guerrilla war in Venezuela after Donald Trump ordered a military strike on a boat in the Caribbean Sea, killing 11 alleged drug traffickers.\nTuesday’s controversial strike off the Venezuelan coast – which was reportedly carried out by an attack helicopter or Reaper drone – came after the US president ordered a major naval deployment to the region, ostensibly to combat South American drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb3eb7b94623fc51ae1c08c10752296a5d7e4fc",
      "title": "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade",
      "url": "https://www.theguardian.com/world/2025/sep/03/china-military-parade-xi-jinping-appears-with-vladimir-putin-kim-jong-un",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:30:18.000Z",
      "summary_90w": "",
      "raw": "Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to the west\nXi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance to the west.\nPutin and Kim, the authoritarian leaders of Russia and North Korea, were among dozens of world leaders who attended the parade, a massive display of military hardware and personnel, orchestrated to mark the 80th anniversary of the end of the second world war, which China calls the War of Resistance against Japanese Aggression.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4faf372ef14ce0458581ba779fffd0f15ef82fa1",
      "title": "Roblox expands use of age-estimation tech and introduces standardized ratings",
      "url": "https://techcrunch.com/2025/09/03/roblox-expands-use-of-age-estimation-tech-and-introduces-standardized-ratings/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:27:08.000Z",
      "summary_90w": "",
      "raw": "Roblox says it's expanding its use of age-estimation technology and entering a partnership with the IARC to standardize its game ratings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "44e20053e8af3095361e86cdceca817ee1005727",
      "title": "Hot mic catches Putin and Xi discussing organ transplants and immortality",
      "url": "https://www.theguardian.com/world/2025/sep/03/hot-mic-catches-vladimir-putin-xi-jinping-discussing-organ-transplants-immortality",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:21:25.000Z",
      "summary_90w": "",
      "raw": "Live footage of private conversation between Russian president and Chinese leader aired at Beijing military parade\nThe authoritarian strongmen Vladimir Putin and Xi Jinping have mused on how organ transplants might lead to immortality, during a brief exchange of small talk caught on a hot mic at a military parade.\nThe Russian president was in Beijing on Wednesday with the Chinese leader, who hosted allies for a ceremony to mark the 80th anniversary of the end of the second world war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07b20dacd4f4be4cacb4cf05c83178072854c802",
      "title": "Met chief calls for law change after Graham Linehan arrest",
      "url": "https://www.bbc.com/news/articles/c1mx09l5297o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:16:02.000Z",
      "summary_90w": "",
      "raw": "Sir Mark Rowley says officers are in an \"impossible position\" when policing online speech.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10587fbf7ffd4ee0dec75ed68a9b8396edcf704e",
      "title": "Netflix CPO Eunice Kim joins TechCrunch Disrupt 2025 to talk scaling product and reimagining entertainment",
      "url": "https://techcrunch.com/2025/09/03/netflix-cpo-eunice-kim-is-coming-to-techcrunch-disrupt-2025-to-talk-tech-tools-and-yes-its-password-sharing-strategy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:15:00.000Z",
      "summary_90w": "",
      "raw": "At TechCrunch Disrupt 2025, Netflix chief product officer Eunice Kim will be joining the Disrupt Stage to share Netflix's evolving story and what's to come.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "62b2bbe3af99c2294af8dbea947ae719898013d9",
      "title": "Faisal Islam: Reeves has a bumpy road up to the Budget",
      "url": "https://www.bbc.com/news/articles/cn76ly476x6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:00:57.000Z",
      "summary_90w": "",
      "raw": "The chancellor hits back at speculation over tax rises, but will need to find the money from somewhere.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76db61ca2aab9ea9206f6c937ff185ef2831d74e",
      "title": "Instagram is finally launching an iPad app",
      "url": "https://techcrunch.com/2025/09/03/instagram-is-finally-launching-an-ipad-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Until now, Instagram on iPad was just a blown-up iOS app, which wasn't pleasant to look at. The company said that it has now revamped the experience to suit the big screen.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b19907959fae91b037286af0c679b1c96289fded",
      "title": "Xi, Putin and Kim: behind the choreographed image that could symbolise a shift in the global balance of power",
      "url": "https://www.theguardian.com/world/2025/sep/03/xi-putin-kim-choreographed-image-that-could-symbolise-shift-global-balance-power",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T15:59:48.000Z",
      "summary_90w": "",
      "raw": "In an unprecedented spectacle the leaders of Russia, China and North Korea led a group of more than 20 world leaders at a victory day parade in Beijing\n\nFull report: Xi Jinping appears with Vladimir Putin and Kim Jong-un at China military parade\n\nIt is an image that, had it been published just a few years ago, would have been dismissed as a piece of mischievous photo-shopping: the leaders of Russia and China, accompanied by the head of a pariah regime whose mission to arm his country with nuclear weapons had been opposed at the United Nations by his two companions.\nBut dramatic shifts in the geopolitical landscape – Russia’s invasion of Ukraine and, crucially, the re-election of Donald Trump – have combined to bring Xi Jinping, Vladimir Putin and North Korean leader Kim Jong-un together in what many observers are calling a dramatic redrawing of the global balance of power.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7782a9740391ba664ec1d8c06d9568db34f0627a",
      "title": "Venezuela’s president thinks American spies can’t hack Huawei phones",
      "url": "https://techcrunch.com/2025/09/03/venezuelas-president-thinks-american-spies-cant-hack-huawei-phones/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:44:20.000Z",
      "summary_90w": "",
      "raw": "Huawei phones, given their custom hardware and operating system, may actually be easier to hack than other brands.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1416ef0c89ba604e38a7502a56771d6f0c565655",
      "title": "How to watch Apple announce the iPhone 17",
      "url": "https://techcrunch.com/2025/09/03/how-to-watch-apple-announce-the-iphone-17/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:27:01.000Z",
      "summary_90w": "",
      "raw": "Apple is debuting the iPhone 17 at its annual hardware event on September 9.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "78845bb166ba25e7cd36ac79eea70ab4480b058a",
      "title": "These 20- and 22-year-olds raised $5M from YC, General Catalyst to study online behavior using vision AI",
      "url": "https://techcrunch.com/2025/09/03/these-20-and-22-year-olds-raised-5m-from-yc-general-catalyst-to-study-online-behavior-using-vision-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:03:32.000Z",
      "summary_90w": "",
      "raw": "Founded by a 20-year-old and two 22-year-olds, Human Behavior uses vision AI to give companies a real understanding of how people use their products.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e70cfe0aefb978ed2fa6bb3574bd9a40d9edfadd",
      "title": "Warp brings new diff-tracking tools to the AI coding arms race",
      "url": "https://techcrunch.com/2025/09/03/warp-brings-new-diff-tracking-tools-to-the-ai-coding-arms-race/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The AI coding tool Warp is releasing a new set of features designed to give users more oversight over command-line coding agents, with more extensive difference tracking and a clearer view of what the coding agent is doing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6916ea357676c8ff13a9dbc324345a10b7097328",
      "title": "Radiohead to tour for first time in seven years",
      "url": "https://www.bbc.com/news/articles/cedvddjnd08o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:35:03.000Z",
      "summary_90w": "",
      "raw": "The revered band will play four nights at London's O2 Arena in November as part of a European tour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4143ea5ced0cb43e6c2f5996452803c6cef67896",
      "title": "3 days left to lock in your exhibit table at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/03/3-days-left-to-lock-in-your-table-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Time is running out to showcase your startup in front of the most influential eyes in tech. In just 3 days, the exhibitor table deadline closes for TechCrunch Disrupt 2025 in San Francisco. And with only 10 tables still available (or fewer by the time you read this), every minute matters. If you’ve been on […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20734de9be72d9662dfcda04a60d7fdca24067c1",
      "title": "Middle East crisis: at least 21,000 children disabled in Gaza during war, says UN committee – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:55:30.000Z",
      "summary_90w": "",
      "raw": "More than 40,000 have suffered ‘new war-related injuries’ with more than half left disabled, says UN Committee on the Rights of Persons with Disabilities\nYemen’s Houthis have claimed responsibility for a missile launched at Israel (see 8.17am BST), saying they fired two ballistic missiles at Tel Aviv in what they said was an initial response to Israeli attacks on Yemen.\nThe Israeli military moved deeper into Gaza City on Wednesday, with soldiers and tanks pushing into Sheikh Radwan, one of the urban centre’s largest and most crowded neighbourhoods, reports Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d644e189ccfca378169b39abe9c5397dc4cdc763",
      "title": "China's Xi steals the limelight in a defiant push against US-led world order",
      "url": "https://www.bbc.com/news/articles/cn0rllxld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:20:11.000Z",
      "summary_90w": "",
      "raw": "President Xi shows off his power and influence in an open challenge to US supremacy and the world order.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e5d8d8f83ccae0fd3ac291eec9f7d4f8cbbb7b9",
      "title": "How 'teddy bear' coach is helping Osaka find mojo",
      "url": "https://www.bbc.com/sport/tennis/articles/cy9892qlx5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:16:40.000Z",
      "summary_90w": "",
      "raw": "How two-time US Open champion Naomi Osaka has rediscovered her form in New York, two months after a dispiriting Wimbledon exit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75e1422f024bad2abd2fabd20d5a7ae477e5601d",
      "title": "Henry Zeffman: Rayner's political future under threat after stamp duty admission",
      "url": "https://www.bbc.com/news/articles/c2lx1999ez8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:11:58.000Z",
      "summary_90w": "",
      "raw": "The deputy prime minister has referred herself for an ethics probe by the PM's adviser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4b320d7c559404ee6a9e86f76846ac5cc80f3b5",
      "title": "Xi, Putin and Kim show united front at huge Chinese military parade",
      "url": "https://www.bbc.com/news/articles/cp8z83np4xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:00:42.000Z",
      "summary_90w": "",
      "raw": "Speaking during the spectacle in Beijing, China's President Xi Jinping said the world faced a choice between peace and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06aa1975d4538ca33b10208bfacf5a7f5dcd9730",
      "title": "Race to find survivors after Sudan landslide kills hundreds",
      "url": "https://www.bbc.com/news/articles/cdj2jygzzk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T12:24:51.000Z",
      "summary_90w": "",
      "raw": "Sunday's landslide followed heavy rain and \"levelled\" a remote village, a local armed group says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba0eaca95165227d0d96eda644426c5cdcaeca1",
      "title": "Israeli drones dropped grenades near peacekeepers in south Lebanon, UN says",
      "url": "https://www.theguardian.com/world/2025/sep/03/israeli-drones-drop-grenades-near-peacekeepers-in-south-lebanon-un-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T12:17:48.000Z",
      "summary_90w": "",
      "raw": "Unifil condemns ‘serious attack’ on Tuesday morning as it was clearing a road and adds that no one was hurt \nIsraeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nThe UN peacekeeping force in Lebanon, Unifil, said the Tuesday morning attack came as it was clearing a road to a UN position close to the Israeli border, adding that no one was hurt.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca88188114a1190628367f04f5c933d17d2d9e15",
      "title": "Husic rebukes PM’s assertion ‘good people’ went to March for Australia rallies as Nampijinpa Price walks back immigration claim",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/ed-husic-anthony-albanese-jacinta-nampijinpa-price-march-for-australia-immigration-comments-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T10:51:01.000Z",
      "summary_90w": "",
      "raw": "Concern at anti-immigration sentiment targeting Indian community as Coalition politicians cross floor to support defeated Pauline Hanson motion\n\nGet our breaking news email, free app or daily news podcast\n\nThe former Labor minister Ed Husic has rebuked Anthony Albanese’s assertion that “good people” attended last weekend’s anti-immigration rallies, saying “I haven’t seen a good fascist yet”.\nAsked on Wednesday if he agreed with the prime minister’s suggestion that among the neo-Nazis and far-right activists at Sunday’s rallies would have been “good people” concerned about immigration, the now Labor backbencher pushed back.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9122eaec0d3c3caa2eb5e06cd8a21774dc756b3",
      "title": "Hitler's bunker is now just a parking lot. But it's a 'dark tourism' attraction anyway",
      "url": "https://www.npr.org/sections/planet-money/2025/09/03/g-s1-86572/hitlers-bunker-is-now-just-a-parking-lot-but-its-a-dark-tourism-attraction-anyway",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Why evil histories sell. A visit to Hitler's bunker, and a deep dive into the economics and ethical quandaries of \"dark tourism.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "681204107cb37a5031873434f19107c94ec4bd3e",
      "title": "Jamaicans head to polls for election as ruling party faces corruption concerns",
      "url": "https://www.theguardian.com/world/2025/sep/03/jamaican-general-election",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:45:19.000Z",
      "summary_90w": "",
      "raw": "Polls point to ‘very close election’ between the Jamaica Labour party and the opposition People’s National party\nJamaicans head to the polls on Wednesday for a closely fought general election which has been overshadowed by an investigation into potential corruption in the ruling Jamaica Labour party (JLP) which is seeking a third term in office.\nThe latest local poll put the opposition People’s National party (PNP) 3.1% lead over the JLP, but political analyst Damion Gordon cautioned that the lead was barely larger than the margin of error.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31591fc0835ac37803c4c9adbfd4f535de6d2219",
      "title": "Neo-nazi Thomas Sewell will continue to commit violent offences that could lead to death, police tell court",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/neo-nazi-thomas-sewell-will-continue-to-commit-violent-offences-that-could-lead-to-death-police-tell-court-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:35:05.000Z",
      "summary_90w": "",
      "raw": "Sewell, who has been charged over alleged attack on Indigenous protest site, described in court as having ‘at his disposal a large group of followers’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-nazi Thomas Sewell – who allegedly led an attack on a First Nations encampment in Melbourne over the weekend – will continue to commit violent offences that could lead to death, a court heard.\nSewell, 32, applied to be freed on bail on Wednesday after being charged over an alleged attack on Melbourne’s Camp Sovereignty on Sunday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a079a9294ea0636a9ae4517446356559accf6f7b",
      "title": "Four Chinese carmakers enter Australian top 10 for first time, while Tesla sales slump",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/chinese-car-makers-byd-gwm-chery-mg-australian-top-10-sales-tesla-slump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:32:23.000Z",
      "summary_90w": "",
      "raw": "BYD overtakes Mitsubishi after nearly quadrupling sales in past year, according to official figures, as GWM, MG and Chery also surge\n\nGet our breaking news email, free app or daily news podcast\n\nAustralians bought more than 20,000 Chinese-made vehicles in August, putting four Chinese brands into the top 10 for the first time, while Tesla sales have slumped by more than a third.\nBYD came in sixth for the month, overtaking Mitsubishi, after its sales nearly quadrupled compared with August 2024, while GWM, MG and Chery each outsold Isuzu Ute in the month to round out the top 10.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on drug-carrying vessel from Venezuela",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:10:59.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e86b9f97448a1099fc747a1f3156f8d5dca8a0d1",
      "title": "What new weapons on show at huge parade say about China's military strength",
      "url": "https://www.bbc.com/news/articles/cjr1reyr059o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:07:04.000Z",
      "summary_90w": "",
      "raw": "Beijing has unveiled a range of military hardware in a show of might to Western powers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded1eba6568cb83acb1b0db7a34aa4a6154c7d25",
      "title": "Food giant Kraft Heinz to split into two companies",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525657/food-giant-kraft-heinz-to-split-into-two-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T09:02:02.000Z",
      "summary_90w": "",
      "raw": "Food giant Kraft Heinz is splitting up into two companies a decade after the merger that was arranged by billionaire investor Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5debd60595c533c7f34df6227b2e6380f4d5af44",
      "title": "Hundreds of women with brooms join protests as Indonesia leader flies to China",
      "url": "https://www.bbc.com/news/articles/c7vlv2gpvvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:48.000Z",
      "summary_90w": "",
      "raw": "Hundreds of women brandishing broomsticks marched to parliament during fierce nationwide rallies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9dcf43076631b3c2c6573bfa4a1ac5edbdb782d9",
      "title": "Putin thanks Kim for North Koreans fighting in Ukraine",
      "url": "https://www.bbc.com/news/articles/cj9w9m1xz1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:14:39.000Z",
      "summary_90w": "",
      "raw": "Thousands of North Korean soldiers are thought to have died while fighting for Russia during its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de0e062ec6e6aede6d5bbe684aaeb1a28f8eaef8",
      "title": "Floods kill 30 and submerge 1,400 villages in Indian state",
      "url": "https://www.bbc.com/news/articles/cvg4g95y7pjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T06:23:23.000Z",
      "summary_90w": "",
      "raw": "More than 354,000 people have been affected by the worst floods since 1988, as rescue efforts continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d27437f91defdbeae26dc28641c69c54124a40a",
      "title": "'A clear message to Trump': BBC correspondents react to China's military parade",
      "url": "https://www.bbc.com/news/articles/c7545p2px5no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T06:21:08.000Z",
      "summary_90w": "",
      "raw": "The display of might comes as Beijing positions itself as a global counterweight to the United States.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T04:45:44.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ace766178d2ad238f44e43eb9ee36a2d98145e72",
      "title": "Trump accuses Xi of conspiring against US with Putin and Kim",
      "url": "https://www.bbc.com/news/articles/c1dxd9eyy71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T03:45:58.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df6292318cff9f48c879b31767d4a501c2af5851",
      "title": "Indonesia embassy official’s shooting in Lima probably a ‘contract killing’, says Peru government",
      "url": "https://www.theguardian.com/world/2025/sep/03/indonesian-embassy-official-shooting-lima-likely-contract-killing-says-peru-government-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T02:11:57.000Z",
      "summary_90w": "",
      "raw": "Interior minister says ‘they were waiting for’ official who was shot at point-blank range outside his home in killing that has shocked Peru\nPeru’s government has said the fatal shooting of an Indonesian embassy official in Lima on Monday night was likely a “contract killing”.\nZetro Leonardo Purba, 40, an official at the Indonesian embassy in Peru, was shot dead outside his block of flats in Lima’s Lince neighbourhood while riding a bicycle home from work on Monday evening.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19748ab56d2566a698991b9886df485db53e89a0",
      "title": "US House panel releases 33,000 pages of Epstein files",
      "url": "https://www.bbc.com/news/articles/cp949lrj373o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T01:12:07.000Z",
      "summary_90w": "",
      "raw": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd9711cb196a8a00d95830cc9302c67960583c10",
      "title": "Jury clears Cardi B of assault on security guard in Los Angeles",
      "url": "https://www.bbc.com/news/articles/cgjyj0dp3ego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T00:19:19.000Z",
      "summary_90w": "",
      "raw": "A number of viral moments thrust the civil case into the spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3530436b320d6ff4c37d98a45ea7d27948abcda5",
      "title": "'A bullet went through my skull': Tanzania abduction survivor",
      "url": "https://www.bbc.com/news/articles/c78zdzvgw90o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:32:11.000Z",
      "summary_90w": "",
      "raw": "Activist Edgar Mwakabela describes his ordeal after he says he was kidnapped and shot by suspected state agents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7a68a331a49b9b4892ef7c9ad493a7664760f13",
      "title": "Captain Scott’s famous polar shipwreck as never seen before",
      "url": "https://www.bbc.com/news/articles/cpwyvyqkx9yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:27.000Z",
      "summary_90w": "",
      "raw": "The Terra Nova carried Captain Scott and his men on their doomed expedition to the South Pole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b48d6aa7902484f6161edb09926a7623411adc51",
      "title": "Compassion v fear: Delhi divided over feeding stray dogs",
      "url": "https://www.bbc.com/news/articles/c0kzkzvx848o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:04:26.000Z",
      "summary_90w": "",
      "raw": "Activists are pushing for the welfare of stray dogs, while anxious residents cite safety risks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "464e9fe0d3287700f5827f0ab6d4850271d64bf9",
      "title": "Why is Trump targeting America's most powerful bank?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0fw7d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:01:00.000Z",
      "summary_90w": "",
      "raw": "Can he take control of the Federal Reserve?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1a85b2cd28ef41b47c910e085725e38a0071bb1",
      "title": "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T22:16:18.000Z",
      "summary_90w": "",
      "raw": "Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions \nThe US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between Washington and Caracas.\nTrump trailed the announcement during an address at the White House on Tuesday afternoon, telling reporters the US had “just, over the last few minutes, literally shot out … a drug-carrying boat”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a56676df663ab832e550668815ce2b54c1b2d91",
      "title": "Australia-Israel relations have hit a low point. Behind the scenes, it's business as usual",
      "url": "https://www.bbc.com/news/articles/cdd31vnygemo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T22:02:46.000Z",
      "summary_90w": "",
      "raw": "The two democratic allies have had a spectacular falling out - but what has actually changed?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4c08b57592134ecabac0d1d7637ad82c99b5e603",
      "title": "How three businesses are coping with tariff limbo",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525791/how-three-businesses-are-coping-with-tariff-limbo",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:08:39.000Z",
      "summary_90w": "",
      "raw": "US importers are in a kind of tariff limbo. A federal appeals court has struck down most of President Trump's import taxes. But the tariffs are still being collected, for now, until there's a final decision from the Supreme Court.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "fe3ea0609a814b72cff681d5788c7defd3c9a0b2",
      "title": "Electric vehicle sales increase as federal tax credits for them come to an end",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650-e1/electric-vehicle-sales-increase-as-federal-tax-credits-for-them-come-to-an-end",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T20:52:12.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c762575c02c0050e081f400ca742b4cdd720504",
      "title": "What do we know about Kim Jong Un's daughter - and potential successor?",
      "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:07.000Z",
      "summary_90w": "",
      "raw": "Kim Ju Ae's visit to China with her father is likely to further fuel speculation she may succeed him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40a3d29eca31a80068ccb02d3c0a0b95fb653582",
      "title": "Argentina couple under house arrest amid search for painting stolen by Nazis",
      "url": "https://www.theguardian.com/world/2025/sep/02/argentina-painting-nazis-house-arrest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:20:35.000Z",
      "summary_90w": "",
      "raw": "Daughter of former Nazi official and her husband to be questioned after raid on home failed to find masterpiece\nA federal court in Argentina has ordered house arrest for the daughter of a former Nazi official and her husband after a raid failed to locate a painting stolen from a Jewish art dealer in Amsterdam.\nAuthorities raided a home in the coastal city of Mar del Plata last week after a Dutch newspaper identified a painting seen in a real estate photo as an Italian masterpiece registered on a database of lost wartime art.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2ea109f825065079513d3bc6892866ac98ffb56",
      "title": "Vogue promotes Chloe Malle to top editor spot",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525663/vogue-chloe-malle-anna-wintour",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T16:38:09.000Z",
      "summary_90w": "",
      "raw": "Malle takes over as the leader of American Vogue immediately. Malle, who has been with the publication since 2011, will still report to Anna Wintour who remains Condé Nast's chief content officer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ae0e1ce7630b5acd0f10dcc27910a2cdc730112",
      "title": "Five children in Gaza among those killed by Israeli strike while fetching water",
      "url": "https://www.theguardian.com/world/2025/sep/02/children-among-those-killed-in-gaza-while-fetching-water-by-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:32:50.000Z",
      "summary_90w": "",
      "raw": "Latest attack comes as Israel’s military urges people to leave Gaza City with 60,000 more reservists to be called up\nAt least nine people, including five children, have been killed in an Israeli strike while fetching water in al-Mawasi, an area of southern Gaza which Israel has designated as a safe zone, health officials said.\nA doctor from al-Nasser hospital shared a picture of the children’s bodies in the hospital, as well as a picture of water jugs left in a pool of blood at the site of the attack on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24cd045a7276ab858581db6792ace812b83c0436",
      "title": "Kraft Heinz is splitting up, separating hot dogs from ketchup",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5464951/kraft-heinz-split-breakup",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T11:26:42.000Z",
      "summary_90w": "",
      "raw": "One of the world's largest food brands is splitting apart a decade after a messy megamerger staged by Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "412aa03368e77abdc17146130a428eacb10acfcf",
      "title": "Federal tax credits for electric vehicles are ending, leading to spike in sales",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650/federal-tax-credits-for-electric-vehicles-are-ending-leading-to-spike-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T08:59:57.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "673bb3efe1c54a50e50b0d3cac69138b47323da5",
      "title": "From building dream careers to losing everything",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002d2kp/footballs-financial-shame-the-story-of-the-v11?at_mid=OgibwZ9HpE&at_campaign=Footballs_Financial_Shame_The_Story_of_the_V11&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002d2kp&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Footballs_Financial_Shame_The_Story_of_the_V11&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Unveiling a hidden scandal affecting a group of former Premier League players.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a3e022afdd2256a34c3a6e280d1c8816a7b3554",
      "title": "Body seen in secret mortuary could solve 50-year mystery of vanished religious leader",
      "url": "https://www.bbc.com/news/articles/clyr1qr529xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T00:18:28.000Z",
      "summary_90w": "",
      "raw": "Compelling evidence to suggest Lebanese Shia leader Musa al-Sadr was killed in Libya is uncovered by BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68105a770ce0bbb71d9718bdd33c6fe1ec26154f",
      "title": "How the death of a delivery driver ignited Indonesia",
      "url": "https://www.bbc.com/news/articles/c2dj9w306wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:08:13.000Z",
      "summary_90w": "",
      "raw": "Protests over corruption and inequality have spiralled into violence, arson and deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95a8c83c019e1d53f2cde83b3510e1c354708b55",
      "title": "A psychological thriller directed by Christopher Nolan",
      "url": "https://www.bbc.co.uk/iplayer/episode/b00z0f1d/the-prestige?at_mid=3GtaP6hiAK&at_campaign=The_Prestige&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=b00z0f1d&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Prestige&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T00:05:47.000Z",
      "summary_90w": "",
      "raw": "A magician tries to uncover the secret of how his rival performs the ultimate trick.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}