{
  "version": "1757093528457",
  "generatedAt": "2025-09-05T17:32:08.457Z",
  "items": [
    {
      "id": "b163cba03be477c514c241d0963303189072c087",
      "title": "Roblox announces short-form video feed for gameplay clips, new AI tools for creators, and more",
      "url": "https://techcrunch.com/2025/09/05/roblox-announces-short-form-video-feed-for-gameplay-clips-new-ai-tools-for-creators-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:30:00.000Z",
      "summary_90w": "",
      "raw": "Users can scroll through a feed of gameplay moments shared by the Roblox community and react to the clips using emojis, and jump into an experience right from a video.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04d7ce45de8818b190c95a60d421eac1792d5750",
      "title": "Hundreds of South Koreans detained in massive ICE raid at Hyundai plant ",
      "url": "https://www.bbc.com/news/articles/cj6xe5d6103o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T17:28:52.000Z",
      "summary_90w": "",
      "raw": "Most of the 475 arrested were from South Korea, leading the country to express concern about the rights of those in custody.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2141ca0516074b1169f7531b3a03deabdd76ee76",
      "title": "Trump sends 10 stealth fighter planes to Puerto Rico amid war on Caribbean drug cartels",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/trump-fighter-planes-puerto-rico-venezuela-drug-cartel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T17:11:58.000Z",
      "summary_90w": "",
      "raw": "Move comes after accusing Venezuela of buzzing US warship and a deadly US missile strike in Caribbean Sea\nDonald Trump is sending 10 F-35 fighter jets to Puerto Rico to bolster US military operations against drug cartels in the Caribbean region, it was reported on Friday.\nIf follows a deadly US missile strike on Tuesday on a boat in the Caribbean Sea that the Trump administration insisted was carrying 11 Venezuelan drug traffickers, and comments by the secretary of state, Marco Rubio, on Wednesday that such attacks “will happen again”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4854f71847587db2cef559ce77c8c302f54900ff",
      "title": "'I missed Lisbon funicular commute that killed my friend'",
      "url": "https://www.bbc.com/news/articles/c98eyp69018o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T17:10:26.000Z",
      "summary_90w": "",
      "raw": "By the time Sonia Silva arrived at the stop, the funicular had crashed and her friend was dead.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5860d07d2d1b4f3975218eeb1f387b3af447276d",
      "title": "The best Nintendo Switch controllers to buy right now",
      "url": "https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T17:08:29.000Z",
      "summary_90w": "",
      "raw": "The Nintendo Switch 2 is here, but we’re not going to forget about the original Switch. We’ve still got love for the console and its many millions of owners, so we’ll keep recommending the best controllers for the Switch right here. If you’re considering getting a Switch 2 in the future, all of the controllers below will work on the newer console.\nNow, you may have already realized long ago that the best Switch controllers aren’t the ones that come with the console. The removable Joy-Cons included with all non-Lite Switch consoles are convenient, given they can be detached for wireless use for up to two players with a pair, but their tiny shape doesn’t do them many favors. They aren’t comfortable to hold for long gaming sessions — especially if you have large hands. And, you’re definitely not alone if you’ve experienced Joy-Con drift.\nIn this buying guide, we’ll focus on wireless controllers that are both comfortable and reliable, as well as a few options that come with unique features designed that may match your unique play style. We’re not covering wired controllers that plug into the Switch’s dock here, as they’re mostly similar to each other and the savings aren’t worth giving up wireless freedom for.\nThere are some things that are worth knowing if you buy a third-party wireless controller (as in, one not made by Nintendo), it may not support HD rumble, motion controls, NFC for Amiibo, or be able to wake the Switch remotely. However, there are some exceptions, which we feature below.\nIf you’re playing your Switch while docked, it’s hard to go wrong with the official Nintendo Switch Pro Controller (even though its recent $10 price increase hurts). It’s one of very few gamepads to include every feature mentioned above, and it’s one of the most satisfying controllers to use that we’ve tested. The GuliKit KingKong 3 Pro and Max, meanwhile, offer more exhaustive customization, while the Hori Split Pad Compact is a Joy-Con upgrade for those who prefer to play in handheld mode. Then there’s 8BitDo’s Ultimate 2 Bluetooth Controller and DualShock-esque Pro 3 controller, both of which are worth checking out.\nFeatured in this article\nBest for TV mode: Nintendo Switch Pro Controller\nThe Switch Pro Controller remains tough to beat, even to this day. It offers an unmatched set of features — including motion controls, NFC, and HD rumble — and is one of the most comfy gamepads available.\n\nWhere to Buy:\n\n $79.99 at GameStop\n $79.99 at Best Buy\n $79.99 at Target\n\nBest for handheld mode: Hori Split Pad Compact\nMuch like the Split Pad Pro, the Compact version is bigger than the standard Joy-Con, making the Switch more comfortable to hold. The Compact, however, is smaller and more colorful.\n\nWhere to Buy:\n\n $49.99 $45.99 at Amazon\n $49.99 at Hori\n\n\n\n\n\n\nThe best Nintendo Switch controller for TV mode\nThe best Switch controller for handheld mode\nThe best Xbox-style controller for the Switch\nThe best Switch controller that’s also great for PC and Steam Deck\nA well-rounded Switch controller that looks like a DualShock\nAn adapter that lets you use your own controllers\nOther Switch controllers we tested\nWhat’s coming next?\n\nThe best Nintendo Switch controller for TV mode\nNintendo Switch Pro Controller\n\n\n\nProsCons\n\n\nHigh quality, sturdy build\nSupports HD rumble, gyro motion, and NFC\nLong battery life\nMobile and PC compatibility\n\nOn the pricier side\n\n\n\nWhere to Buy:\n\n $79.99 at GameStop\n $79.99 at Best Buy\n $79.99 at Target\n\nSupported platforms: Nintendo Switch 2, Nintendo Switch, PC, Steam Deck, mobile, Apple TV / Connectivity: Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Rumble: Yes, HD / NFC: Yes / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes (but not the Switch 2)\nEver since the Switch launched, Nintendo’s first-party Pro controller has been the best gamepad for the console. In many ways, it rivals the standard models from Sony and Microsoft in terms of comfort and build quality. And, it’s compatible with the Switch 2 (although it can’t wake the new console from sleep — you’ll need a Switch 2 Pro Controller for that).\nAside from the Joy-Cons, the Switch Pro Controller is one of an elite few wireless options that includes good rumble, gyroscopic movement support, and an NFC reader for Amiibo cards and figurines. It’s also one of a few controllers we’ve tested that can remotely turn on the Switch without being plugged into it. The gamepad is built like a tank, and its battery life is so good that it sometimes seems like it’ll never run out. Nintendo says that it lasts around 40 hours per charge, so it’ll likely take casual gamers a long time to run down the battery.\nThe buttons and triggers have a satisfying bounce, while its directional pad is responsive and clicky enough to satisfy retro gamers. The controller charges via USB-C, just like the Switch, and it’s compatible with a slew of other platforms you might game on, aside from Xbox and PlayStation.\nGiven the high price — which went up another $10 when Nintendo recently increased Switch prices  — we wish that it had other features, like programmable buttons or a 3.5mm headphone jack for audio, even if wireless audio transmission from the Switch to a controller isn’t possible. If you really want the ability to listen via wired headphones without connecting your controller with a wire, you’ll need to get the Switch 2 and its Switch 2 Pro controller.\nThe best Switch controller for handheld mode\nHori Split Pad Compact (Pokémon Gengar)\nHori’s Joy-Con alternatives offer a roomier, comfier grip for your Nintendo Switch in handheld mode without the added bulk of its Split Pad Pro version. They also feature two customizable rear buttons and are offered in multiple colors and designs but do not support rumble or Amiibo figures.\n\nWhere to Buy:\n\n $59.99 at Amazon\n $59.99 at Walmart\n $49.99 at Hori (plain blue)\n\nSupported Platforms: Switch, Switch OLED / Connectivity: Wired / Connector type: Joy-Con slots / Mappable rear buttons: Yes / Software customization: No / Rumble: No / NFC: No / Motion: No / Power: via Joy-Con slots / Console Wakeup: No\nI’m sure there are some people who enjoy using Joy-Con controllers, but kids and small-handed folks aside, most people probably wouldn’t say they’re very comfortable. If you struggle with hand pain when you use the Switch, that’s where the Hori Split Pad Compact can help out.\nThe Split Pad Compact is a — you guessed it — a more compact alternative to the Split Pad Pro, which has unfortunately become tougher to find. Similarly, it comes in a variety of colorways, and it adds comfort to using the Switch in handheld mode. One half slides into each side of the Switch console like Joy-Cons, but unlike Nintendo’s default controllers, Hori’s gamepad features big, easy-to-reach buttons and generously sized triggers and analog sticks, all of which feel great in play. It also provides more grip than Joy-Con do, which is particularly useful for people who need to get a better handle on the console for fast-paced gameplay, or to stay comfy over longer play sessions.\nThe Split Pad Compact doesn’t have batteries or sensors — or support for rumble, motion, IR, or NFC — so it’s completely useless when detached from the Switch. It’s only for handheld mode unless you purchase the Split Pad Compact Attachment that turns it into a wired controller. We don’t recommend most people go that route since the attachment usually (but not always) costs more than a Switch Pro Controller, which is a shame considering it doesn’t add any of the aforementioned features. It does add a 3.5mm headphone jack, however.\nRead our Hori Split Pad Compact impressions.\nThe best Xbox-style controller for the Switch\nGuliKit KingKong 3\n\n\n\nProsCons\n\n\nGreat ergonomics with Xbox-style shape\nDeep customization options\nHall effect sticks and triggers\nSupports HD rumble, NFC, and motion\nWide platform compatibility\n\nLacks companion app for customizations\n\n\n\nWhere to Buy:\n\n $59.99 $44.99 at Amazon (Pro, save 10% at checkout)\n $79.99 $71.99 at Amazon (Max, save 10% at checkout)\n\nSupported Platforms: Switch, PC, Steam Deck, mobile, Apple TV / Connectivity: Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Yes / Software customization: No / Rumble: Yes / NFC: Yes (only in KK3 Max) / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes\nOn the surface, the GuliKit KingKong 3 Pro and KingKong 3 Max are similar to the last-gen models they replaced, which took design cues from Microsoft’s standard Xbox controller but rivaled the Switch Pro Controller in terms of build quality and features. We tested them on the Nintendo Switch, PC, and mobile, but you can also use them with other Bluetooth devices, including the Steam Deck and Apple TV 4K.\nBut there are several notable improvements and additions if you scratch deeper. They each have Hall effect dual-mode triggers (both can switch between analog and digital, but the KK3 Max exclusively adds physical trigger stops), in addition to RGB LED-surrounded Hall effect analog sticks. It should make them virtually impervious to drifting and waning responsiveness, as iFixit explains here. They each have GuliKit’s powerful magnetic vibration motors with two intensity levels and three distinct modes (including the Switch’s HD rumble). You can even customize the hot-swappable face buttons to match your preferred platform, and to the delight of tournament players, you can play with a 1,000Hz polling rate for reduced input lag on PC (wired or wireless via a dongle).\nAdditionally, both controllers feature detachable rear-facing paddles. You get two metal moon-shaped paddles with the KK3 Pro that protrude further from the controller than the extra four you get with the KK3 Max, which are longer and curved to match the contour of the controllers’ rear grips. The latter are similar to the paddles on the Xbox Elite Series 2 and even borrow the same installation technique — just push them into the designated holes on the back. They require a lot more force, though they won’t easily dislodge. \nThe longer paddles are comfortably reachable once installed, but if you have larger hands, you may need to make adjustments for the shorter variety. They only need a light tap, but since they occupy the space where your fingers usually rest, it can lead to increased misfires while gaming. You can map each back button to emulate any other button on the controller — including the rear triggers — but you can’t configure them to execute combo presses or macros.\nIn summary, the KK3 Pro and KK3 Max offer a lot for the money. In fact, there may be no better option for interoperability and value in a single multiplatform controller right now. If we’re nitpicking, our biggest gripe is that GuliKit still hasn’t created an app to manage all of its settings more easily.\nThe best Switch controller that’s also great for PC and Steam Deck\n8Bitdo Ultimate 2 Bluetooth Controller\nFor something cheaper — and in some ways better — than Nintendo’s official Pro controller, there’s 8BitDo’s Ultimate 2, which works with the original Switch and Switch 2. It features TMR joysticks with trigger switches for adjusting the feel, as well as vibration and motion control support.\n\n\n\nProsCons\n\n\nErgonomically similar to the Switch Pro controller\nUses durable TMR sticks\nWirelessly compatible with mobile and PC\nShake to wake Switch\n\nLacks NFC\nRumble feels lousy\n\n\n\nWhere to Buy:\n\n $69.99 $62.99 at Amazon (black, with coupon)\n $69.99 $59.99 at Amazon (white)\n\nSupported Platforms: Switch, Switch 2, PC, Steam Deck, mobile, Apple TV, Android, macOS, Apple devices / Connectivity: 2.4GHz, Bluetooth, wired / Connector type: USB-C / Mappable buttons: Yes, four / Software customization: Yes / Rumble: Yes / NFC: No / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes, but not Switch 2\n8BitDo’s Ultimate 2 Bluetooth Controller is a minor step forward compared to the first iteration, but it comes with new features you might care about. It still feels like a Switch Pro Controller in shape, with a similarly short grip profile that larger hands may not prefer. As for what’s changed internally, you’re getting more durable TMR joysticks, plus two new mappable buttons near the triggers (totaling four customizable buttons). Speaking of the triggers, they’re adjustable thanks to new switches that can alter how much you have to pull them to register an input. It’s particularly great for first-person shooters or action games where speed is paramount. \nIts haptics are decent in some games, but not nearly as good as Nintendo’s HD Rumble, and it’s missing Amiibo support, though it does feature motion controls — along with a hidden trick that allows you to wake a docked Switch by giving the controller a little shake. It’s a nice value compared to the Switch Pro, as well as most other third-party options because it also includes a charging dock with an integrated 2.4GHz transmitter.\nThe Ultimate 2 controller comes in two variants, but we recommend the Bluetooth model for Switch owners because it’s the only version that’s compatible. Additionally, it’s compatible with the Switch 2, the Steam Deck, PC, macOS computers, and a slew of other Bluetooth-ready devices. Plus, it includes both 2.4GHz connectivity, in case you need a more reliable connection for compatible devices. \nAs for any control scheme tweaks you may want to make, you can customize button mapping profiles, macros, vibration intensity, and stick and trigger sensitivity using the Ultimate Software V2 app on PC. The controller has a dedicated button that lets you swap between three profiles on the fly, plus an extra turbo button you can either reconfigure or remap. When it comes to Switch controllers, 8BitDo sets the standard for great third-party controllers, and this is one of its best.\nA well-rounded Switch controller that looks like a DualShock\n8BitDo Pro 3 controller\n\n\nScore: 7\n\nProsCons\n\n\nIncludes charging dock and 2.4GHz dongle\nHighly customizable\nParticularly comfortable for small-handed gamers\n\nRumble isn’t great\n\n\n\nWhere to Buy:\n\n $69.99 $63 at Amazon (via on-page coupon)\n $69.99 at 8BitDo\n\nSupported Platforms: Switch, Switch 2, PC, Steam Deck, mobile, Apple TV, and more / Connectivity: Bluetooth, 2.4GHz, wired / Connector type: USB-C / Mappable buttons: Yes, four / Software customization: Yes / Rumble: Yes / NFC: No / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes, but not Switch 2\nThe 8BitDo Pro 3 is the company’s latest high-end controller. On its face, the biggest difference between it and the similarly-priced Ultimate 2 is its PlayStation DualShock-esque stick layout, which alone might enough to convince some gamers to get it. The Pro 3 improves on its predecessor by featuring swappable buttons that can be detached with its included magnetic suction tool. With it, you can go from the Nintendo layout to the Xbox layout. Otherwise, this model’s internal specs and compatibility are very similar to that of the Ultimate 2. \nThe Pro 3 features TMR joysticks, plus Hall effect triggers with switches that toggle between full pulls or shorter clicks for either trigger. Just like the Ultimate 2, the Pro 3 has four customizable buttons that can be assigned almost any other button, or combination of buttons, through the company’s Ultimate V2 app on PC or by pressing certain buttons together, as listed in the manual. Additionally, the controller supports turbo mode.\nCompared to most other Switch controllers, the Pro 3 stands out due to its PlayStation-style layout of D-pad and sticks. You may prefer this model if you play a lot of retro games that prioritize the D-pad, which is more easily accessible than on most other Switch controllers. One other fun perk of the Pro 3 is its swappable joystick caps. Two arcade stick-like knobs are included that make certain games feel more rewarding to play, such as fighting games.\nIt has rumble support (though not HD rumble) and motion control for games like The Legend of Zelda: Tears of the Kingdom and Overwatch 2, both of which allow for gyroscopic aiming. \nOn its rear, there’s a switch that lets it toggle between Nintendo Switch, X-input for PC, and DirectInput, each of which offers its own control customizations and Bluetooth profile. One new addition for the Pro 3 is a charging dock that lets the controller recharge via contact pins. The dock also contains a 2.4GHz USB-C transmitter, letting you connect to some devices that route instead of Bluetooth. \nRead our 8BitDo Pro 3 review.\nAn adapter that lets you use your own controllers\n8BitDo Wireless Bluetooth USB Adapter 2\n\n\n\nProsCons\n\n\nInexpensive\nAllows you to use nearly any Bluetooth controller\n\nRequires sourcing your own controller\n\n\n\n\nWhere to Buy:\n\n $19.99 $16.99 at Amazon\n $19.99 $17.99 at 8BitDo\n $19.99 $16.99 at Best Buy\n\nThere are a few other devices that allow you to use third-party controllers, but 8BitDo’s is the best value. Instead of spending $70 on a Switch Pro controller, the $19.99 8BitDo Wireless Bluetooth USB Adapter 2 lets you turn most Bluetooth controllers you already own into a wireless Switch controller. It plugs into your Switch dock (or directly into the console if you have a USB-A to USB-C adapter) and supports a wide variety of models, from the latest Xbox and DualSense controllers to last-gen gamepads for the Wii and PlayStation 3. (Note: the first-gen model can’t connect to most Xbox Bluetooth controllers due to a Bluetooth incompatibility, so make sure you get the latest model we’ve linked to.)\nTo our delight, the PS5 DualSense controller we tested it with worked incredibly well, with better-than-average rumble and more responsive motion controls than many dedicated Switch controllers offer. What’s more, so long as you’re using one of the newer Xbox Series X or S controllers, an Xbox One Bluetooth controller, a DualSense, a DualShock 4, or the Switch Pro Controller, you can customize their button mapping, analog stick sensitivity, and more within 8BitDo’s computer and mobile app. \n8BitDo has an extensive support page that lists the steps required to set up your specific controller, as well as which features of those controllers it supports. That said, it’s best if you know the Switch’s button layout by heart if you plan to use either a PlayStation or Xbox controller with this adapter, as the layout on your controller will not match the on-screen prompts in games.\nIf you already have a controller you really like and don’t mind jumping through a few small hoops to connect it, 8BitDo’s affordable adapter deserves a spot in your entertainment center. If you plan to use more than one third-party controller at a time, you’ll need an adapter for each controller (and a USB hub), but if you have a lot of controllers sitting around, it might be worth it.\nOther Switch controllers we tested\nNitro Deck / Nitro Deck Plus\nWe like CRKD’s Nitro Deck around here. It’s a cradle-style controller that holds the Switch between a pair of Hall effect sticks, outfitting it with a standard array of face buttons, four programmable back buttons, turbo functionality, gyro motion controls, and rumble. It has passthrough charging, though not passthrough video, which would allow it to double as a dock for TV gameplay. The step-up Nitro Deck Plus adds said functionality (with a USB-C to HDMI adapter), along with Bluetooth connectivity and adjustable vibration intensity / analog sensitivity. We’ve found these to be notable improvements, but we wish the passthrough solution was more elegant and that CRKD could solve the ergonomics (particularly on the right side, where the analog and button placement can cause discomfort).\nGameSir T4 Cyclone Pro\nWe recently tested the GameSir T4 Cyclone Pro ($49.99) for consideration. It offers a few of the same functions as the GuliKit KingKong 3 — including remappable buttons, Hall effect sticks, and two distinct macro buttons — along with dedicated vibration motors in the triggers, which is something the GuliKit doesn’t match. That said, it falls just short due to mushy-feeling buttons. GameSir considers the extra padding under the buttons a feature that makes the impact softer, but we felt it takes away from the experience. Also, although it’s perfectly usable with the Switch, the Pro’s button labeling takes after Microsoft’s, which may not be ideal for those who have trouble memorizing inputs. We also found resyncing with the Switch to be a chore after switching from a mobile device or a Windows PC.\nPowerA GameCube Style Wireless Controller\nWe also recently tried several wireless PowerA controllers, including the GameCube Style Wireless Controller ($59.99) and a Pikachu-themed version of the standard PowerA Enhanced Wireless ($44.99). We like the fun design of PowerA’s controllers, but they don’t live up to the quality of the models we recommend above, which is a shame considering some cost nearly as much. The GameCube-style wireless controller is a pretty faithful recreation of the original if you fancy a pure Super Smash Bros. experience, but it’s barebones with no rumble, NFC, or IR. It’s an easy way to get the old-school feeling back if you don’t already have a Bluetooth-based alternative to use with 8BitDo’s USB Adapter 2.\nWhat’s coming next?\nWe’ll be doing more testing on the EasySMX S10 controller, as well as the GameSir Super Nova and GuliKit’s Elves 2 and ES Pro controllers for consideration.\nUpdate, September 5th: Updated to reflect current pricing and availability. Nintendo’s Switch Pro controller went up $10, as part of the company’s recent price increases on last-gen hardware and accessories.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "494ed2a119c67ec6821db377e6d05760cc0a7976",
      "title": "Tesla’s ad spend on X has shrunk to almost nothing",
      "url": "https://techcrunch.com/2025/09/05/teslas-ad-spend-on-x-has-shrunk-to-almost-nothing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:00:46.000Z",
      "summary_90w": "",
      "raw": "Tesla spent a fraction on X in early 2025 compared to 2024. It also paid $300,000 to Kimbal Musk's drone company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe09fd1792e192d31390cd893c39ed2afe4e402e",
      "title": "Hamas releases video of two Israeli hostages held in Gaza",
      "url": "https://www.bbc.com/news/articles/cy0vly9zyl2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T17:00:21.000Z",
      "summary_90w": "",
      "raw": "The video claims to show the hostages in Gaza City, where Israel has begun a planned military takeover.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f700046314679d7e8d3d08b68565cd1e2551341c",
      "title": "Warner Bros. sues Midjourney for AI images of Superman, Batman, and other characters",
      "url": "https://techcrunch.com/2025/09/05/warner-bros-sues-midjourney-for-ai-images-of-superman-batman-and-other-characters/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:56:38.000Z",
      "summary_90w": "",
      "raw": "Warner Bros. says that Midjourney knowingly engaged in wrongful conduct, noting that the company previously restricted subscribers from generating content based on infringing images but recently lifted those protections.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T16:56:21.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c01b684e7079a252cd69920d3308a370b72e42db",
      "title": "The Lenovo Legion Go 2 will get Xbox-flavored Windows in spring 2026",
      "url": "https://www.theverge.com/news/772853/the-lenovo-legion-go-2-will-get-xbox-flavored-windows-in-spring-2026",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T16:54:30.000Z",
      "summary_90w": "",
      "raw": "The just-fully-announced Legion Go 2 will be the first handheld outside of Asus that’s confirmed to get the new Xbox full-screen experience (FSE). \nLenovo spokesperson Jeff Witt tells me buyers will be able to manually switch the handheld to Xbox FSE after it’s ready in the spring 2026 time frame, months after the Legion Go 2’s launch next month. Asus will get the Xbox FSE far sooner on October 16th when it co-launches the Xbox Ally and Xbox Ally X with Microsoft, and then Microsoft’s “next focus” will be bringing it to the original Asus ROG Ally and Ally X. \nFingers crossed that a far lighter version of Windows will improve performance, like we’ve seen when running SteamOS on the same hardware as Windows, and let these handhelds intelligently wake and sleep. We’ve already seen the Xbox FSE can save memory and is easier to navigate with a gamepad, but Microsoft’s only given us very limited time with it. \n\n\n  \n \n  \n \n\n\n \n\n View this post on Instagram\n\n \n \n \n \n\n \n \n\n \n \n \n\n \n \n \n\nA post shared by The Verge (@verge)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4cc29527e066921d32d462acfd588cc4a8da90ce",
      "title": "Google fined $3.5 billion by EU for ad tech abuse",
      "url": "https://www.theverge.com/news/772848/google-ad-tech-eu-antitrust-fine",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T16:51:29.000Z",
      "summary_90w": "",
      "raw": "The European Commission has waged a €2.95 billion (~$3.5 billion) fine against Google for “abusing its dominant position” in advertising technology. In its announcement, the Commission claims that Google’s alleged anticompetitive practices have increased costs for advertisers and publishers, potentially raising prices for consumers as a result.\nThe Commission has ordered Google to come up with a plan to stop its anticompetitive practices that it must submit within 60 days. “If it fails to propose a viable plan, the Commission will not hesitate to impose an appropriate remedy,” the Commission states, adding that the solution may involve forcing Google to sell off parts of its ad tech business.\nThe European Commission opened an investigation into Google’s advertising technology business in June 2021, and later brought up the possibility of divestiture in 2023. The US Department of Justice similarly asked a federal judge to break up Google’s ad tech business after determining that it violates antitrust laws.\nIn an emailed statement to The Verge, Lee-Anne Mulholland, Google’s vice president and global head of regulatory affairs, called the decision about its ad tech services “wrong” and said that the company plans to appeal. “It imposes an unjustified fine and requires changes that will hurt thousands of European businesses by making it harder for them to make money,” Mulholland said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b470a237ca409bf5fcaa9504c826e08dbcc9cbc0",
      "title": "Lisbon funicular worker among those killed in crash",
      "url": "https://www.bbc.com/news/articles/cnvryg271ymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T16:49:12.000Z",
      "summary_90w": "",
      "raw": "Four employees of a non-profit organisation and a transport worker are among those who died.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6c45181f431ba5810b73d3ee028009adce0f9e6",
      "title": "Angela Rayner resigns after underpaying tax on Hove flat",
      "url": "https://www.bbc.com/news/articles/c80gr5emk43o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T16:46:05.000Z",
      "summary_90w": "",
      "raw": "Her departure comes after the PM's ethics adviser concludes that she breached ministerial rules.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485a8951c5e4bec493b022f082d9100fc235375a",
      "title": "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/05/volodymyr-zelenskyy-ukraine-robert-fico-slovakia-vladimir-putin-russia-energy-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T16:46:04.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. You can read all our coverage of the conflict in Ukraine here.\n\nMacron says 26 countries ready to supply postwar military backing for Ukraine\n\n\nUS president Donald Trump has just posted on his Truth Social account, saying:\n“Looks like we’ve lost India and Russia to deepest, darkest, China. May they have a long and prosperous future together! President Donald J. Trump”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ed149a78a349e8a3a6b24c61d70bf442baf9757",
      "title": "Linehan tells court trans activists made his life 'hell'",
      "url": "https://www.bbc.com/news/articles/cpw152kq80wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T16:40:17.000Z",
      "summary_90w": "",
      "raw": "The Father Ted creator gives evidence after going on trial for alleged harassment and criminal damage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "508535a2188535659fd3b5553ee7417c0ee7cbc5",
      "title": "Do Reform's economic plans add up?",
      "url": "https://www.bbc.com/news/articles/clyx4v44438o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T16:39:15.000Z",
      "summary_90w": "",
      "raw": "The party has pledged to boost spending, but some have questioned how the party intends to pay for its plans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57c0ec9fc89e6f5bd4f3a963bf08497ddf441980",
      "title": "Crowds gather outside Giorgio Armani’s Milan HQ to pay respects before funeral",
      "url": "https://www.theguardian.com/fashion/2025/sep/05/crowds-gather-giorgio-armani-milan-hq-pay-respects-before-funeral",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T16:39:10.000Z",
      "summary_90w": "",
      "raw": "Funeral chamber to be set up at Teatro Armani where people can view casket before a private service on Monday\n\nGiorgio Armani obituary\n\nElegant, determined, a little unknowable: Giorgio Armani is gone but will never be forgotten\n\nA life in pictures\n\nTwice a year, the usually calm Via Bergognone in Milan shuts down due to excited fashion week crowds descending on Teatro Armani. Home to the Giorgio Armani headquarters since 2000, the sprawling space includes a purpose-built theatre where each show season a catwalk is constructed.\nOn Friday, crowds again began to gather outside, but this time the mood was much more sombre. They had come to pay their final respects to the visionary Italian fashion designer Giorgio Armani, who died on Thursday at the age of 91.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f47cf51ec49080f15aaf9f3e920a4ee733deec97",
      "title": "Natron’s liquidation shows why the US isn’t ready to make its own batteries",
      "url": "https://techcrunch.com/2025/09/05/natrons-liquidation-shows-why-the-us-isnt-ready-to-make-its-own-batteries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:37:48.000Z",
      "summary_90w": "",
      "raw": "The sodium-ion battery startup went from announcing a $1.4 billion factory to filing for liquidation in just over a year. Natron's troubled journey illustrates the challenges in making batteries in the U.S.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8c5be60233881dbccea566fa3227409bf9f14ed6",
      "title": "The best stuff announced at IFA so far",
      "url": "https://www.theverge.com/news/769573/ifa-2025-smart-home-lights-power-bank-robot-vacuum-ai-headphones",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T16:32:44.000Z",
      "summary_90w": "",
      "raw": "The doors to IFA 2025 in Berlin, Germany, have officially opened and new gadgets, tech, features, and upgrades continue to pour out of Europe's largest consumer tech show.\nThere's a lot of news to stay on top of, and if you're struggling to ingest it all, here are some of the best announcements from the show so far including innovative new robovacs, more affordable smart home devices, and even a portable home theater on wheels. You can catch up on all of The Verge's IFA 2025 coverage right here.\nLenovo ThinkBook VertiFlex Concept\nLenovo is no stranger to creating laptops with screens that offer unique functionality, such as the ThinkBook  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "be7b4d65224ae28968b104e38d73c3e0b28daf6f",
      "title": "Planet Money TikToks inspired one of the year&#8217;s most brilliant animated movies",
      "url": "https://www.theverge.com/entertainment/771889/boys-go-to-jupiter-julian-glander-interview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T16:30:00.000Z",
      "summary_90w": "",
      "raw": "In writer / director Julian Glander's new animated sci-fi feature Boys Go to Jupiter, a young gig worker named Billy 5000 (Planet Money's Jack Corbett) hoverboards his way through life in Florida with only one thing on his mind: he needs $5,000 and is willing to deliver as much food as it takes to make the cash. At first, the delivery guy's semi-magical, \"let's get this bread\" style of thinking seems to stem from his fixation on a hustlebro streamer's videos. But as Boys go to Jupiter's story unfolds, it becomes clear that all of the movie's characters have odd and somewhat dysfunctional relationships with money.\nBoys Go to Jupiter bears th …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "44e9de0e6f838fea94e454f959428e09eeba9eb5",
      "title": "The Nothing Ear Open headphones are below $100 for the first time",
      "url": "https://www.theverge.com/tech/772636/nothing-ear-open-gulikit-es-pro-switch-2-controller-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T16:16:13.000Z",
      "summary_90w": "",
      "raw": "If you want to stay alert while running or biking, the Nothing Ear Open are a worthwhile alternative to classic in-ear cans. That’s because the company’s first pair of open-style earbuds — which are now on sale at Nothing’s online storefront or Amazon for an all-time low $99 ($50 off) with a Prime membership — let you listen to music and podcasts while keeping tabs on traffic, pedestrians, and other potential hazards.\nNothing Ear Open\n\nWhere to Buy:\n\n $149 $99 at Amazon (with Prime)\n $149 $99 at Nothing\n\nNothing’s water-resistant earbuds use an over-the-ear hook to help them sit firmly in place, allowing them to securely rest just inside your ear instead of directly within the canal like a traditional pair of in-ears. Overall, they deliver solid audio quality thanks to a robust set of EQ options, and while bass performance can’t match that of modern in-ear models, their unique design helps reduce sound leakage. Each bud also comes with a pair of microphones and noise-canceling tech, so your calls come through clearer and less muddled.\nIn terms of battery life, the Ear Open charge via USB-C and deliver up to eight hours of playback, which is relatively good given their larger 14.2-millimeter drivers. They also support multipoint Bluetooth connectivity, allowing you to connect to two devices simultaneously, and offer a “Low Lag Mode” for gaming via Nothing’s companion app. And, if you’re a Nothing Phone owner, you get some nice extras, including ChatGPT integration.\nThree more deals worth a look\nIf you’re looking for an alternative to Nintendo’s Switch 2 Pro Controller, the GuliKit ES Pro is on sale at Amazon for an all-time low of $25.49 (about $5 off). You can use the wireless gamepad to wake the Switch 2—  a rare feature for a third-party controller — but it also works with both Windows and Android devices. It features anti-drift TMR joysticks, too, along with adjustable sensitivity settings and a swappable button layout for PC and Switch. Plus, its D-pad can toggle between four and eight-direction modes.\nYou can grab a copy of Assassin’s Creed Shadows for the PlayStation 5 and Xbox Series X for $49.99 ($20 off) at Amazon, which matches its best price to date. Our reviewer Ash Parris isn’t usually into open-world games, but the latest title from Ubisoft won her over with its engaging characters, strong story, and stunning visuals of feudal Japan. This limited edition copy comes with both the game and some minor DLC, specifically extra weapons and gear for one of the game’s main protagonists. Read our review.\nYou can currently buy Epicka’s Universal Travel Adapter at Amazon in multiple colors for $17.99 ($5 off), which is its best price to date. The versatile adapter comes with four plug types, so you can use it in over 200 countries, including the UK, Japan, Italy, and more. It offers four USB-A ports, a single USB-C port, and one AC socket, letting you charge six devices simultaneously.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6589b86f63f97d2296cea28ce113319a02fee6f0",
      "title": "US imposes sanctions on Palestinians for requesting war crimes inquiry",
      "url": "https://www.theguardian.com/world/2025/sep/04/us-sanctions-palestinian-human-rights",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T16:15:14.000Z",
      "summary_90w": "",
      "raw": "Rights groups in Gaza and Ramallah had asked international criminal court to investigate Israel over genocide claims\nThe US has imposed sanctions against three Palestinian human rights groups that asked the international criminal court (ICC) to investigate Israel over allegations of genocide in Gaza, according to a notice posted to the US treasury department’s website.\nThe three groups – the Gaza-based Palestinian Centre for Human Rights and Al Mezan Center for Human Rights, and the Ramallah-based Al-Haq – were listed under what the treasury department said were ICC-related designations.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77712dc1834f78041cf8c012fe49d03465a117ee",
      "title": "X is now offering me end-to-end encrypted chat — you probably shouldn’t trust it yet",
      "url": "https://techcrunch.com/2025/09/05/x-is-now-offering-me-end-to-end-encrypted-chat-you-probably-shouldnt-trust-it-yet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:04:03.000Z",
      "summary_90w": "",
      "raw": "X's new encrypted messaging feature, XChat, has some red flags.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "680fb5c1c8c43a8869ea4add3fbbfe1972eeba38",
      "title": "We must be ready for early election, Nigel Farage tells party",
      "url": "https://www.bbc.com/news/articles/c4g75we8jk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T15:54:41.000Z",
      "summary_90w": "",
      "raw": "NIgel Farage announces he is setting up a department to prepare for government at the Reform conference.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0dc4b161a22a4ce26084b21907072287272be39",
      "title": "Samsung&#8217;s Galaxy S26 Edge might look like an iPhone 17 Pro",
      "url": "https://www.theverge.com/news/772769/samsung-galaxy-s26-edge-render-leak-iphone-17-pro",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T15:52:29.000Z",
      "summary_90w": "",
      "raw": "The rumor mill just churned up a purported render of Samsung’s Galaxy S26 Edge, and it only adds to speculation that the super-slim phone will look like the upcoming iPhone 17 Pro. The renders, shared with Android Headlines by reliable leaker OnLeaks, show a device with slim bezels and a prominent rear camera bar housing a pair of lenses.\nBased on the renders, the Galaxy S26 Edge may look much different than the Galaxy S25 Edge, which features three vertically-aligned rear cameras on the left side of the device. Instead, the Galaxy S26 Edge renders more closely resemble what appear to be iPhone 17 Pro leaks and dummy models spotted on the IFA 2025 showfloor. The difference is that the iPhone 17 Pro is rumored to come with three cameras on the back, not just two.\nThe Galaxy S26 Edge is rumored to take the place of the S26 Plus and may also feature built-in magnets for Qi2 charging, bringing it in line with newer iPhones and the entire Pixel 10 lineup. Additionally, Android Headlines claims that the Galaxy S26 Edge will be even thinner than its predecessor, measuring 5.5mm thick (or 10.8mm with the camera bump), as opposed to 5.8mm with the S25 Edge.\nWe’ll likely have to wait until January to see if Samsung adopts the boxy camera island shown in the renders — but in just a few days, we’ll find out if Apple beats it to the punch.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fab7859884487c07c3936e9977fa459f1b08ec5",
      "title": "Tech leaders take turns flattering Trump at White House dinner",
      "url": "https://www.theverge.com/policy/772760/tech-ceos-ai-trump-white-house-dinner",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T15:50:07.000Z",
      "summary_90w": "",
      "raw": "Several of the most powerful business leaders in the country gathered around a table last night to fawn over President Donald Trump for his AI policies.\n“You and your policies are really helping a lot,” Microsoft CEO Satya Nadella told the president. AMD CEO Lisa Su praised “the amount of acceleration that we’ve seen just in the few short months that the administration has been in place.” Oracle CEO Safra Catz struck a note of adoration at “the fact that you are our president” and that Trump quickly recognized the importance of AI. “You’ve unleashed American innovation and creativity — all the work you’re doing in basically every cabinet post in addition to what’s coming out of the White House is making it possible for America to win.” \n“Thank you for being such a pro-business and pro-innovation president,” OpenAI CEO Sam Altman lauded. “It’s a very refreshing change. We’re very excited to see what you’re doing to make all of our companies and our entire country so successful.” He added that his company would “invest a ton in the United States.”\nThe round of flattery came during the public portion of a dinner Trump hosted at the White House Thursday with CEOs from many of the top tech companies working in AI, which also included those from Apple, Google, and Meta. Trump made a point of asking several of the CEOs how much they’re spending in the US in the next few years, and seemed pleased after they threw out numbers in the hundreds of billions. Earlier on Thursday, First Lady Melania Trump hosted a task force meeting on AI education where many of those companies pledged investments to educate the youth and workforce on how to use the new technology.\n\nEach of the CEOs stand to gain — or lose — from Trump and his policies\n\n\nTech leaders’ presence at the White House has become a relatively commonplace occurrence during this administration. Many of the CEOs who attended Thursday’s dinner also showed up for Trump’s inauguration and donated to his inaugural fund. Zuckerberg had met with Trump in the West Wing shortly before the government’s antitrust trial against his company began. On Thursday, Zuckerberg — whom prior to their recent closeness, Trump has previously threatened to jail — sat right next to the president, who teased Zuckerberg at one point of having the opportunity to launch his own political career with a response to a reporter’s question.\n\nEach of the CEOs stand to gain — or lose — from Trump and his policies. Those include everything from tariffs on semiconductors and other products, permits, access to resources like electricity to power energy-intensive AI, and more. Many of them are already engaged in legal battles with the administration over other parts of their businesses. Trump acknowledged Google’s “very good day” Wednesday when a judge denied Trump’s DOJ the most aggressive antitrust remedies it had asked for in its monopoly search case against the company. “Biden was the one that prosecuted that lawsuit,” Trump said, leaving out that his first administration had brought the complaint, and his second administration litigated the remedies trial. “It’s a long process,” Google CEO Sundar Pichai said. “Appreciate that your administration had a constructive dialogue and we were able to get it to some resolution.” One or both sides could still appeal the ruling.\nApple CEO Tim Cook, whose products are largely assembled in China and who seemed to be the rare business leader in Trump’s first term who managed to walk a fine line of staying on his good side, seemed eager to maintain his good will while seated across the table from Trump Thursday. “It’s incredible to be among everyone here, particularly you and the First Lady,” Cook told Trump. “I’ve always enjoyed having dinner and interacting.” He thanked Trump for “setting the tone such that we could make a major investment in the United States” and added that it “says a lot about your focus and your leadership.”\nLater, when a reporter asked about Trump’s plans to tariff semiconductors, Trump reiterated his idea that he’d deploy a “fairly substantial tariff” that could be waived if a company was planning to build in the US. “I’d say Tim Cook would be in pretty good shape,” Trump said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11ca906604db28f1fc5bfcb465072906f0ad3433",
      "title": "The best Sonos speakers to buy in 2025",
      "url": "https://www.theverge.com/tech/652171/best-sonos-speakers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T15:43:35.000Z",
      "summary_90w": "",
      "raw": "After the recent self-induced tumult that Sonos has been through, I can understand why some people are reluctant to spend money on the company’s products. But newly appointed CEO Tom Conrad has shown that he’s determined to get back on track and revitalize Sonos as the leading whole-home audio brand. The contentious mobile app is in a much better place now than it was last year, though some customers still encounter bugs and the frustration of speakers randomly vanishing from their system. It’s not all roses, but the situation is moving in the right direction — and I took Sonos’ decision to cancel its video player as a promising sign of renewed focus. \nI’m not about to sell any of my Sonos gear. For one, the company’s whole-home platform offers conveniences that competitors don’t match — at least not without hassle. Most of the time, I’m streaming from Apple Music, Spotify, or YouTube Music. But if I’m watching a sports game on my TV, I can pipe the audio from my Sonos soundbar to a speaker in a different room to follow the action. Playing something over Bluetooth? With most of the company’s recent speakers, it’s possible to do the same thing and spread that music across your entire Sonos system.\nWhy you should trust my Sonos recommendations\nI’ve covered Sonos extensively for several years at The Verge. This has included reporting on the company’s latest news, reviewing a lengthy list of Sonos products, and bringing attention to the app fiasco, which eventually led to the ouster of former CEO Patrick Spence. Audio and home theater are two of my primary focus areas in product reviews, so I’m well-versed when it comes to determining whether a speaker or soundbar is great — or just another also-ran product.\nI wouldn’t fault anyone for waiting to see where Sonos and its app go from here. But keep in mind that Sonos recently confirmed that it will raise prices on “certain products” later this year as a result of President Trump’s tariffs. Putting the software misstep aside, this company makes some genuinely excellent hardware, so if you don’t want to risk paying more, now might be the time to buy. And if you’re wondering which are the true standouts, I’ve got you covered.\nFeatured in this article\nBest overall: Sonos Five\n\nWhere to Buy:\n\n $549 at Amazon\n $549 at Sonos\n $549.99 at Best Buy\n\nBest to start with: Sonos Era 100\n\nWhere to Buy:\n\n $199 at Amazon\n $199 at Best Buy\n $199 at Sonos\n\nThe best Sonos speaker to start with\nSonos Era 100\n\n\nScore: 8\n\nProsCons\n\n\nImproved sound (now in stereo)\nBluetooth and line-in support\nPrivacy-conscious microphone controls\n\nNo more Google Assistant\nRejiggered controls have a learning curve\nLine-in requires USB-C dongle\n\n\n\nWhere to Buy:\n\n $199 at Amazon\n $199 at Best Buy\n $199 at Sonos\n\nIf you’re looking for a decent-sounding, compact speaker to put in the kitchen, office, or really anywhere in your home, the Era 100 is your best option. Sonos improved upon this speaker’s predecessors, the Play:1 and Sonos One, by upgrading to stereo drivers for richer, wider audio. Bluetooth playback is now supported, along with line-in audio (with a separate dongle). And the Era 100 also has reworked physical controls, including a volume bar you can slide your finger across and, finally, dedicated track controls. \nThe speaker has an elegant design, and you can use hands-free voice controls to summon Amazon Alexa or Sonos Voice Control to skip tracks or switch to a different playlist. Sonos dropped the Era 100’s price to $199 in April, which is more than fair for what you’re getting. I’d buy now and avoid risking the cost going up again, thanks to tariffs.\nRead our full Sonos Era 100 review.\nThe best overall Sonos speaker\nSonos Five\n\n\n\nProsCons\n\n\nPowerful audio with impressive stereo separation\nCan crank loud without distorting\nRegular 3.5mm line-in: no adapter required\n\nLacks smart speaker functionality\nEasily collects dust\nYou’ll end up wanting two, which gets very expensive\n\n\n\nWhere to Buy:\n\n $549 at Amazon\n $549 at Sonos\n $549.99 at Best Buy\n\nThe Sonos Five isn’t just Sonos’ best-sounding speaker; it’s at the top of the pack compared to all competitors. From an audio quality perspective, it beats the HomePod, Echo Studio, Nest Audio, and other mass market speakers — both those that are smart and not. Can you find better hi-fi bookshelf speakers? Absolutely, but those aren’t natively tied into music services like Sonos gear is. The Five is a hefty unit and takes up a decent amount of desk space. But once you throw some music on, its powerful stereo output is enough to handle any dinner party or weekend get-together. \nThere’s nothing “smart” about the Five. It lacks microphones and voice assistant functionality. But that simplicity is appealing in its own right: you’re getting a damn good speaker that ties into the Sonos platform. The Five also features a 3.5mm aux input, making it a good turntable companion — especially if you spring for a stereo pair. \nThe best portable Sonos speaker\nSonos Move 2\n\n\nScore: 9\n\nProsCons\n\n\nImproved stereo sound\nMuch longer battery life\nSupports line-in playback\n\nNo more Google Assistant\nCan’t be used as a speakerphone\nHefty for a portable speaker\n\n\n\nWhere to Buy:\n\n $449 at Amazon\n $449 at Best Buy\n $449 at Sonos\n\nWhen it comes to portable speakers, the Move 2 is in a whole different league than Sonos’ much smaller Roam 2. It’s bigger and heavier, but a built-in handle makes it easier to lug the Move 2 around your home or out to the backyard. There’s no comparison between the two when it comes to audio: the Move 2 smokes the far more compact Roam 2. Like the Era 100, it has a stereo driver arrangement, whereas the Roam mixes everything down to mono and sounds more muffled.\nThe Move’s larger size gives it a clear advantage in terms of bass punch, and aside from playing music wirelessly, you’ve got the option of plugging in other devices over USB-C for line-in audio. I also continue to appreciate that the battery in the Move 2 is user-replaceable, which can’t be said of many Bluetooth speakers. You’ll be able to keep enjoying your investment for long, long into the future. And with a dust / water resistance rating of IP56, it can handle rain and splashes of water without problems; just don’t drop it into a pool.\nI prefer the Move 2 over traditional portable speakers since, at least whenever I’m home, the Sonos lets me play music over Wi-Fi at a higher fidelity than Bluetooth can offer. Plus, the Move 2 also supports Apple AirPlay and Spotify Connect, so it’s easy to just skip the Sonos app altogether if you wish.\nRead our full Sonos Move 2 review.\nThe best Sonos soundbar for home theater enthusiasts\nSonos Arc Ultra\nThe Arc Ultra surpasses the original Arc soundbar with more immersive Dolby Atmos surround sound, much better bass, and the ability to play music over Bluetooth.\n\n\nScore: 8\n\nProsCons\n\n\nMore immersive sound than original Arc\nBass gains are substantial enough to make this a viable standalone option\nNow supports Bluetooth audio\n\nSonos app remains buggy for some\nPlay:1 and Play:3 no longer supported as surrounds\nStill no DTS:X\nFull surround setup skyrockets the cost\n\n\n\nWhere to Buy:\n\n $999 $899 at Amazon\n $999 $899 at Best Buy\n $999 $899 at Sonos\n\nIntroduced in late 2024, the Arc Ultra improves on the original Arc with significantly more powerful bass response. That’s largely thanks to the inclusion of Sonos’ newer SoundMotion technology, which manages to get a better low-end wallop from a soundbar that’s not much larger than the model it replaces. This means some buyers can get away with buying the Arc Ultra on its own without adding a subwoofer. \nThe Arc Ultra delivers Dolby Atmos surround sound that’s more convincing and immersive than any other Sonos soundbar to date, and it’s up there with the very best you can find from a single-enclosure speaker. Vocal clarity has also improved substantially thanks to better center channel performance. Another upgrade over the first Arc is the addition of Bluetooth audio support.\nRead our full review of the Sonos Arc Ultra.\nThe best Sonos soundbar for smaller rooms\nSonos Beam (Gen 2)\nThe Beam isn’t as powerful as the Sonos Arc, nor can it match the flagship soundbar’s Dolby Atmos immersion bubble. But you still get room-filling surround sound for less money — and the Beam ties into the Sonos ecosystem for added convenience.\n\n\nScore: 8\n\nProsCons\n\n\nWider, more expansive sound\nHDMI eARC brings better performance\nSleeker design than first Beam\n\nNo up-facing Atmos speakers\nDoesn’t have automatic Trueplay\nSame acoustic architecture as prior model\n\n\n\nWhere to Buy:\n\n $499 $399 at Amazon\n $499 $399 at Best Buy\n $499 $399 at Sonos\n\nThere are plenty of scenarios and TV rooms where the Arc Ultra might be too powerful. If you’re in a smaller space or don’t need the absolute best surround sound, the Beam (Gen 2) starts to make more sense. It still has Atmos, but the effect is virtualized since the Beam lacks the Arc Ultra’s upward-firing speakers. Even so, the home theater experience you’ll get from the Beam will blow away any speakers built into a TV. \nRead our full Sonos Beam (Gen 2) review.\nThe best Sonos subwoofer for most people\nSonos Sub Mini\n\n\nScore: 7\n\nProsCons\n\n\nSleek, unique design\nGood bass presence for its size\nEasy setup process\n\nNot suitable for large living rooms\nStill not cheap\nTrueplay tuning only works on iOS\n\n\n\nWhere to Buy:\n\n $429 $343 at Amazon\n $429 $343 at Best Buy\n $429 $343 at Sonos\n\nIn the same vein, unless you’re hell bent on rumbling your walls, the $429 Sub Mini subwoofer is more than enough for layering some extra oomph and growl onto Hollywood blockbusters and your favorite TV shows. The $799 Sub 4 is Sonos’ flagship subwoofer, but plenty of people have saved hundreds of dollars by pairing the Sub Mini with any of the company’s soundbars — and they’ve been ecstatic with the results. \nAs its name suggests, the Sub Mini is more compact than the Sub 4, which makes it easier to find an inconspicuous spot to place it. Even if you’re the type to do a sub crawl and put it somewhere in plain sight, I’d argue it looks more stylish than the blocky Sub 4. \nRead my full Sonos Sub Mini review.\nThe best budget Sonos speaker\nIkea Symfonisk Bookshelf Speaker (Gen 2)\n\n\nScore: 7\n\nProsCons\n\n\nAffordable way into Sonos ecosystem\nCan be mounted as a shelf\nSatisfactory sound for the size\nGood option for Sonos surround sound\n\nNo built-in mic for voice assistants\nYou’ll want two for the best audio experience\nNo 3.5mm aux input\n\n\n\nWhere to Buy:\n\n $179.99 at Ikea\n\nSonos and Ikea might be winding down their partnership, but that doesn’t mean you should sleep on the existing Symfonisk products before they’re completely phased out. The Symfonisk Bookshelf Speaker (Gen 2), in particular, remains the most affordable gateway into the Sonos ecosystem, even with its recent price hike. Sound-wise, it’s not far off from the old Sonos One / Play:1 and is a very enjoyable speaker. Plus, the lower price tag makes it easier to convince yourself to scoop up two for a stereo pair. These — or the Symfonisk Picture Frame Speaker — make excellent rear surround speakers if you’re on a budget. \nRead our full Ikea Symfonisk Bookshelf Speaker review.\nThe Sonos product worthy of a second chance\nSonos Ace\n\n\nScore: 7\n\nProsCons\n\n\nStylish design and excellent comfort\nSound, ANC, and transparency are all good\nTV Audio Swap is convenient, versatile, and suitable for gaming\n\nTV Audio Swap handoff can be glitchy\nHeadphones can’t be grouped with Sonos speakers\n\n\n\nWhere to Buy:\n\n $399 $299 at Amazon\n $399 $299 at Best Buy\n $399 $299 at Sonos\n\nBoy oh boy, did Sonos’ wireless headphones come right at the worst possible moment. The company’s app crisis completely sidelined the Ace headphones. Some customers were also disappointed that the Ace can’t play music over Wi-Fi or be grouped with the company’s in-home speakers.\nBut here’s the thing: the Ace headphones are still fantastic. They’re comfortable, have a gorgeous design (with easily swappable ear pads), and sound detailed, powerful, and expressive. They support wired audio over USB-C in addition to Bluetooth. And the TV Audio Swap feature is a useful perk that I still often use late at night when my Arc Ultra would disturb others. You can route any audio that would normally come through the soundbar — from your TV, gaming console, or streaming device — through two pairs of headphones and listen privately (with spatial audio surround sound). Sonos’ new TrueCinema mode even lets you fine-tune the latter to better reflect the acoustics of your space.\nNo, the Ace headphones aren’t what I’d consider the ideal of a wearable product from Sonos. But they remain a wholly impressive debut that fell victim to the company’s poor software decisions. \nRead our full Sonos Ace review.\nPhotography by Chris Welch / The Verge\nUpdate, September 5th: Adjusted pricing and availability. Brandon Widder also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42ec47acf811dc291938e4c7335f881a84c8677b",
      "title": "London's Burning star John Alford guilty of sexually assaulting girls",
      "url": "https://www.bbc.com/news/articles/c5ypy3rl83vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T15:40:03.000Z",
      "summary_90w": "",
      "raw": "The jury returns its verdict on the London's Burning actor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3737bfb0a026b834a26e79098155d31a8cc2715c",
      "title": "Western troops in Ukraine would be ‘legitimate targets’, Putin says",
      "url": "https://www.theguardian.com/world/2025/sep/05/western-troops-ukraine-legitimate-targets-vladimir-putin-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T15:32:14.000Z",
      "summary_90w": "",
      "raw": "Russian president’s threat follows French proposal for postwar support for Kyiv that would include presence of Nato countries’ forces\nVladimir Putin has said any western troops placed in Ukraine would be “legitimate targets” for Russian strikes, upping the stakes as Kyiv’s allies scramble to come up with a convincing offer of postwar support to Ukraine.\nSpeaking a day after the French president, Emmanuel Macron, announced still-vague plans for a package of support for Ukraine backed by 26 nations, Putin on Friday said any guarantees that involved boots on the ground would violate Moscow’s longstanding objections to Nato troops in Ukraine.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a13b923b53a1a420cd9cbd412ba83b72957b13c",
      "title": "The Exit 8 movie is even scarier than the game",
      "url": "https://www.theverge.com/film/769133/tiff-2025-nouvelle-vague-exit-8-reviews",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T15:30:00.000Z",
      "summary_90w": "",
      "raw": "Exit 8.\t\n\nGreetings from Toronto, Canada! I'm braving long lines and busy streets for the next week or so to attend the Toronto International Film Festival, better known as TIFF, and I'm planning to take you all along with me. Each day I'll be publishing a dispatch covering my time at the festival, including thoughts on every single movie I watch. As of now, I have more than 20 different features on my schedule so, uh, expect a lot of thoughts.\nTIFF is historically a nice preview of the fall and holiday film slate, featuring a mix of awards contenders, indie flicks, and blockbuster-adjacent movies from big-name directors. In recent years, that has in …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "48230ed337f7af0c59ef5765c6e45ff52ddbd6d7",
      "title": "US and UN discuss Gaza reconstruction plan before general assembly",
      "url": "https://www.theguardian.com/world/2025/sep/05/us-and-un-discuss-gaza-reconstruction-plan-before-general-assembly",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T15:27:59.000Z",
      "summary_90w": "",
      "raw": "Talks aimed at preventing row at UN conference, where several countries plan to recognise state of Palestine \nA potential UN-endorsed reconstruction plan for Gaza, including a one-year technocratic government, an international stabilisation force, disarmament of Hamas and a rejection of mass deportation of Palestinians, is being discussed with the US to prevent the UN general assembly descending into a bitter row about the symbolic recognition of Palestine as a state.\nIt is almost certain that the UK, France, Canada, Belgium and Malta will recognise the state of Palestine at a UN conference on 22 September to be held on the sidelines of the general assembly, in the week when world leaders deliver major speeches.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0608597bf2089979b32b598482cb69daa3b36d1",
      "title": "Labour's working-class warrior who fell from power",
      "url": "https://www.bbc.com/news/articles/cqlz3p0ryylo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T15:24:45.000Z",
      "summary_90w": "",
      "raw": "Her against-the-odds story and personality gave her a special status in Labour and put a target on her back.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb00e3214b8eb22fd219eb421edb49cb31813126",
      "title": "‘Humanity is facing a reckoning’: Venice shrugs off the glamour to take aim at politics",
      "url": "https://www.theguardian.com/film/2025/sep/05/humanity-facing-reckoning-venice-film-festival-glamour-politics",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T15:23:58.000Z",
      "summary_90w": "",
      "raw": "Stars waved as usual from the city’s water taxis, but there was a repeated focus on films that help audiences interpret a chaotic world\nFor most of its 82 years, Venice has been perceived as the world’s most glamorous film festival. This year was no exception: stars including Julia Roberts, Cate Blanchett, Jude Law and George Clooney dutifully waved from canals and trooped down red carpets (although Law tripped while on a water taxi and Clooney got ill).\nBut the films themselves struck a different note. Jury president Alexander Payne may have rebutted questions about current affairs during his opening press conference, declaring himself concerned only with discussing cinema, but cinema at Venice this year was concerned largely, it turned out, with discussing current events.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6ef36e92b8c5b2b4416577faa67ff4cf8c11812",
      "title": "Aid workers use donkeys to reach remote Sudan landslide site where hundreds feared dead",
      "url": "https://www.bbc.com/news/articles/cly7zr0lzx0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T15:18:39.000Z",
      "summary_90w": "",
      "raw": "It remains unclear how many people died - figures range from two to 1,000.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7bd4774966feda91d70fb06331f988c2b0dc8537",
      "title": "Tesla proposes $1tn award for Musk if he hits targets",
      "url": "https://www.bbc.com/news/articles/cdx29qv4nvvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T15:06:00.000Z",
      "summary_90w": "",
      "raw": "The car firm boss's enormous pay package depends on him hitting sky-high targets.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f858d8da54211474d9c9ac1d5573c08e93fdb434",
      "title": "Australia’s Ukrainian community calls for Oscar Jenkins to be included in prisoner swaps or risk being ‘forgotten’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/06/oscar-jenkins-ukraine-russia-prisoner-swap-request",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T15:00:30.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Local group calls on Penny Wong to push Russia for Jenkins’ priority inclusion in ongoing prisoner swaps program with Ukraine\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s Ukrainian community is urging the Albanese government to intervene to have captured soldier Oscar Jenkins included in planned prisoner swaps, warning he risks becoming a “forgotten” prisoner of Russia’s war.\nJenkins, a 33-year-old former teacher and Australian citizen, travelled to Ukraine and enlisted to fight with the country’s military following Russia’s 2022 invasion. After being captured by Russian forces in December 2024, he was jailed for 13 years on the charge of being a “mercenary”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f275cd7994e3f995e147aadc7fe3d572b839cb61",
      "title": "Scale AI’s former CTO launches AI agent that could solve big data’s biggest problem",
      "url": "https://techcrunch.com/2025/09/05/scale-ais-former-cto-launches-ai-agent-that-could-solve-big-datas-biggest-problem/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Isotopes, co-founded by Arun Murthy, launched a sophisticated analytics agent. Arun was one of the creators of Hadoop who later joined Scale AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35bf2b855838e48b64ea6075760c9c0d0a0ce811",
      "title": "Hundreds of South Koreans are among 475 detained in a Georgia immigration raid",
      "url": "https://www.npr.org/2025/09/05/g-s1-87208/georgia-hyundai-immigration-raid-bryan-county-south-korea-response",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T14:58:37.000Z",
      "summary_90w": "",
      "raw": "\"The business activities of our investors and the rights of our nationals must not be unjustly infringed,\" a foreign ministry spokesman said after about 300 South Koreans were detained.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad49db7f8332d8ca744433b7d55edfb5a9e2b198",
      "title": "OpenAI hires the team behind Xcode coding assistant Alex",
      "url": "https://techcrunch.com/2025/09/05/openai-hires-the-team-behind-xcode-coding-assistant-alex-codes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:58:32.000Z",
      "summary_90w": "",
      "raw": "The team behind Alex, which built a popular tool that let devs use AI models within Apple's development suite Xcode, is joining OpenAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1d5eb62efb5776fe25ef469fafbc4246d6d4768a",
      "title": "Post Malone postpones London shows over Tube strikes",
      "url": "https://www.bbc.com/news/articles/c1l84mz7j1mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T14:43:43.000Z",
      "summary_90w": "",
      "raw": "The US rapper and singer reschedules Sunday and Monday's concerts at the Tottenham Hotspur stadium.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b26267a91853e2982910e025ade885f2fa875813",
      "title": "The blueprint for lasting companies and communities with Discord’s Jason Citron and Campuswire’s Tade Oyerinde at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/creating-communities-and-companies-that-last-with-discords-founder-jason-citron-and-campuswires-tade-oyerinde-only-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:30:00.000Z",
      "summary_90w": "",
      "raw": "When you design for people instead of institutions, you don’t just build a product. You build a movement. That’s the idea behind this Builders Stage session called “Creating Communities and Companies That Last.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bdd651a181fbc9653e0414eba2867220af20072",
      "title": "US Navy Seals killed North Korean civilians in botched 2019 mission, report says",
      "url": "https://www.theguardian.com/world/2025/sep/05/commando-team-north-korea-civilians-2019-mission",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T14:28:18.000Z",
      "summary_90w": "",
      "raw": "New York Times says Trump authorized mission to plant listening device; team killed fishers they encountered\nUS Navy Seals shot and killed a number of North Korean civilians during a botched covert mission to plant a listening device in the nuclear-armed country during high-stakes diplomatic negotiations in 2019, the New York Times reported on Friday.\nCiting unidentified sources, including current and former military officials with knowledge of the still-classified details, the newspaper said Donald Trump approved the operation during his first administration, as he was involved in historic talks with the North Korean leader, Kim Jong-un.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c3c2b0ef412931850e1f6c36456cf66acb0c4dd",
      "title": "Israel destroys dozens of buildings in Gaza City as new offensive intensifies",
      "url": "https://www.bbc.com/news/articles/czx0d71gryzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T14:25:09.000Z",
      "summary_90w": "",
      "raw": "The images come as the Israeli military says it has established control over 40% of Gaza City.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59bb0bcffeb7d76521ca5a33a168e6a3d6584905",
      "title": "Tesla shareholders to vote on investing in Musk’s AI startup xAI",
      "url": "https://techcrunch.com/2025/09/05/tesla-shareholders-to-vote-on-investing-in-musks-ai-startup-xai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:23:20.000Z",
      "summary_90w": "",
      "raw": "A shareholder proposal would allow Tesla to invest in Elon Musk's rival AI firm, xAI if approved. Tesla's board didn't recommend one way or another.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4616b0cd5d89e34f3091a3ad52f34beadc5d64f5",
      "title": "Trump set for first US Open final since 2015",
      "url": "https://www.bbc.com/sport/tennis/articles/c20zr0ve6y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T14:13:44.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump will attend the US Open for Sunday's men's singles final - his first visit to the event since 2015.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6355c7cd28ec2984076658faa252fc85cfcf5aba",
      "title": "Four Democratic senators urge Smithsonian to resist White House attempts to 'bully the institution'",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529369/smithsonian-trump-senators",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T14:12:15.000Z",
      "summary_90w": "",
      "raw": "Sen. Alex Padilla of California and three other Democrats are reminding the Smithsonian's secretary that the institution \"is the responsibility of Congress.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c34bc307d72f561937c2fb07f88b7b22af4ac8ca",
      "title": "Today is your last chance to exhibit your brand in front of 10K tech leaders at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/today-is-your-last-chance-to-exhibit-your-brand-in-front-of-10k-tech-leaders-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:00:00.000Z",
      "summary_90w": "",
      "raw": "If you want to get in front of more than 10,000 startup and VC leaders, connect with media, and generate a nonstop pipeline this October, you need to act now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e0e273284c8e128d5334df58c52098b7664215a",
      "title": "Greetings from Guhagar, India, where newly hatched turtles get some help into the sea",
      "url": "https://www.npr.org/2025/09/05/g-s1-86640/sea-turtles-olive-ridley-india-conservation",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T13:53:43.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "15e8b21e58482e13dcdfe555ca4eee980d476678",
      "title": "‘Standing up for Palestinians’: why Greta Thunberg wears a Bohemian FC shirt",
      "url": "https://www.theguardian.com/world/2025/sep/05/bohemian-fc-thank-greta-thunberg-for-wearing-their-kit-during-aid-mission",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T13:50:36.000Z",
      "summary_90w": "",
      "raw": "The Swede has has not necessarily become a fan of Irish football, as she sports a club jersey made with help from Fontaines DC\nThe humanitarian aid flotilla to Gaza is a serious mission with an incongruous detail: Greta Thunberg sporting a jersey of the Dublin football club Bohemians.\nThe Swedish activist wore the pale blue shirt during an earlier flotilla in June and again this week as vessels prepared to leave Barcelona.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6633cbb68a528d082d9cc975cc3ad1e9cad2567b",
      "title": "Israel is blasting through Gaza City neighborhoods, but people have nowhere to go",
      "url": "https://www.npr.org/2025/09/05/g-s1-86628/gaza-city-israel-offensive",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T13:39:34.000Z",
      "summary_90w": "",
      "raw": "Israel's military says it has gained \"operational control\" of 40% of Gaza City and plans to intensify its attacks in a large-scale ground offensive to fully occupy the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b52e21c992b1776cae6ea411d43b133686be8fe",
      "title": "Tycoon who led push to decriminalise cannabis becomes Thai PM",
      "url": "https://www.theguardian.com/world/2025/sep/05/tycoon-anutin-charnvirakul-thai-pm-cannabis-campaign",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T13:37:44.000Z",
      "summary_90w": "",
      "raw": "Anutin Charnvirakul voted in by parliament after promising election in four months, as Thaksin Shinawatra jets out\nAnutin Charnvirakul, a staunch royalist, has been appointed by lawmakers as Thailand’s next prime minister after days of heated negotiations and political drama.\nThe 58-year-old tycoon turned politician is considered a conservative, though he made a name for himself for leading a campaign to decriminalise cannabis. He was voted in after a chaotic scramble by parties to gain enough support to replace the ousted PM, Paetongtarn Shinawatra, who was removed from office by a court ruling.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1aa039824c9dc63b0bbd1d66eed9084d79488ebd",
      "title": "Troubled beauty chain Bodycare to close 32 stores",
      "url": "https://www.bbc.com/news/articles/cpd9qezjej1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T13:21:48.000Z",
      "summary_90w": "",
      "raw": "About 450 jobs will also go after the value chain said it was making losses as costs continue to rise.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a30b994ca2023fccde9d0e9102f549054ea40358",
      "title": "The U.S. added only 22,000 jobs last month, showing cracks in the labor market",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529937/economy-jobs-trump-bls",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T12:51:43.000Z",
      "summary_90w": "",
      "raw": "The U.S. job market showed more signs of weakness Friday, as the Labor Department reported just 22,000 jobs added in August. Revised figures show the economy lost jobs in June, and the unemployment rate inched up to 4.3%.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "918e38b1d100eda5abff24196c9cd9ee73a2e17a",
      "title": "Three Britons among 16 people killed in Lisbon funicular crash, police confirm",
      "url": "https://www.theguardian.com/world/2025/sep/05/initial-report-into-lisbon-funicular-crash-due-after-16-killed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T12:06:51.000Z",
      "summary_90w": "",
      "raw": "Portuguese investigators find no evidence of sabotage, with mechanical or maintenance issues among possible causes\n\n‘Someone needs to answer for what happened’: Lisbon reacts to streetcar crash that killed 16\n\nPortuguese police have confirmed that three Britons were among the 16 people killed in Lisbon on Wednesday evening when one of the city’s funicular streetcars derailed and hurtled down a hill and into a building.\nThe accident, described by Portugal’s prime minister, Luís Montenegro, as “one of the biggest tragedies in our recent history”, also left 21 people injured, five of whom are in a serious condition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "320b9102aac3d76445f56c6236bd521e53c318f6",
      "title": "Snapchat’s new Lens lets you create AI images using text prompts",
      "url": "https://techcrunch.com/2025/09/05/snapchats-new-lens-lets-you-create-ai-images-using-text-prompts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T12:00:00.000Z",
      "summary_90w": "",
      "raw": "While Snapchat already has numerous generative AI Lenses, the company notes that Imagine Lens is its first open prompt image-generation Lens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2b871250a505c095c98ee40ce64d5e2bae7058de",
      "title": "Watch: Key moments from Rayner's political career",
      "url": "https://www.bbc.com/news/videos/cq5jezg8v3jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T11:59:32.000Z",
      "summary_90w": "",
      "raw": "Deputy Prime Minister Angela Rayner has resigned after failing to pay enough tax on a flat in Hove.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "addce90caa05c144bffb77b6cb73238d816b7429",
      "title": "The letters written by Rayner, the PM and the ethics adviser - in full",
      "url": "https://www.bbc.com/news/articles/ckgyn051990o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T11:53:02.000Z",
      "summary_90w": "",
      "raw": "Rayner says she \"deeply regrets\" her conduct over Hove property, while PM says he's \"very sad\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09ec3748c69ce69619e4ed7ed80ef59d1d44212c",
      "title": "Japanese man becomes oldest person to reach Mount Fuji summit at 102",
      "url": "https://www.theguardian.com/world/2025/sep/05/japanese-man-becomes-oldest-person-to-reach-summit-of-mount-fuji-at-102",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T11:49:24.000Z",
      "summary_90w": "",
      "raw": "Kokichi Akuzawa climbed with 70-year-old daughter to break record for oldest person to make ascent – a second time\nKokichi Akuzawa has become the oldest person to climb to the top of Mount Fuji at the age of 102 – despite almost giving up during his trek.\n“I was really tempted to give up halfway through,” Akuzawa said. “Reaching the summit was tough, but my friends encouraged me, and it turned out well. I managed to get through it because so many people supported me.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33d4959c1cf5cb80b03fb318e8dc80a65f557e3a",
      "title": "RFK Jr. pressed on vaccine accessibility. And, a plan for Ukraine's post-war safety",
      "url": "https://www.npr.org/2025/09/05/g-s1-87198/up-first-newsletter-robert-f-kennedy-national-guard-washington-dc-coalition-of-the-willing",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T11:21:30.000Z",
      "summary_90w": "",
      "raw": "Robert F. Kennedy Jr. tries to defend his actions regarding vaccines in a Senate hearing. And, a European coalition announces a plan for Ukraine's post-war security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37fc9572af448c05a03a9544fff471b0df0ee41a",
      "title": "Jaguar Land Rover staff to stay at home in cyber attack fallout",
      "url": "https://www.bbc.com/news/articles/c1jzl1lw4y1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T11:17:11.000Z",
      "summary_90w": "",
      "raw": "The company continues the complex work of restoring its systems after the cyber attack at the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5d2a1e2868f6c9d5f4ba9074d325ec1188896e5",
      "title": "Errors by machines leave 55,000 diabetes patients needing new tests",
      "url": "https://www.bbc.com/news/articles/c4g7d3w7gdlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T11:17:05.000Z",
      "summary_90w": "",
      "raw": "Errors by diabetes analysis machines mean at least 55,000 people in England will need further hospital tests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b624cef156b4eeb6ac53106bfe9211ecc57aa86",
      "title": "Tesla proposes new pay package for Elon Musk worth up to $1T",
      "url": "https://techcrunch.com/2025/09/05/tesla-proposes-new-pay-package-for-elon-musk-worth-up-to-1t/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T11:11:09.000Z",
      "summary_90w": "",
      "raw": "Tesla has proposed a new 10-year compensation plan for CEO Elon Musk that could be worth as much as $1 trillion even as the EV maker's car business stumbles and it sets its sights on humanoid robotics and AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104301c7f0feac24d81538f7035c4994f5c94fdf",
      "title": "Health Secretary RFK Jr. grilled on vaccines and more during Senate hearing",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529371/health-secretary-rfk-jr-grilled-on-vaccines-and-more-during-senate-hearing",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T11:03:54.000Z",
      "summary_90w": "",
      "raw": "Robert F. Kennedy Jr. was questioned by senators from both parties on Thursday about vaccine access and more. NPR analyzes the health secretary's nearly three-hour appearance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64c9d34f2608e4c0532d8cf7e9afa87cfb21e479",
      "title": "Three British nationals among 16 killed in Lisbon crash",
      "url": "https://www.bbc.com/news/articles/c62lmed42p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T11:03:40.000Z",
      "summary_90w": "",
      "raw": "Authorities have confirmed three Brits are among 16 people who were killed in Wednesday's accident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "301614ae45f82202de3eca84657c8aaa79366120",
      "title": "The music-loving royal who became a teacher - Duchess of Kent dies at 92",
      "url": "https://www.bbc.com/news/articles/c3gjyl7xvymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T11:01:57.000Z",
      "summary_90w": "",
      "raw": "The life of the Duchess of Kent, who stepped away from royal life and became a primary school teacher.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ebab5c6011edf250a46822033f8fae2e77f21263",
      "title": "Why solar flares are way hotter than researchers thought",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529330/solar-flares-even-hotter",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T11:00:00.000Z",
      "summary_90w": "",
      "raw": "The hottest parts of the sun are its solar flares, and a new study suggests these flares could be more than six times hotter than scientists used to believe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e20c64a504efbc8f9d7027bd5342a7a4b9d4d751",
      "title": "WSL predictions 2025-26: BBC Sport pundits pick their top three",
      "url": "https://www.bbc.com/sport/football/articles/cy4rllnv1g1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T10:53:04.000Z",
      "summary_90w": "",
      "raw": "We asked our BBC Sport pundits and presenters who will finish first, second and third in the Women's Super League this season.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "What we know about Lisbon's deadly funicular crash",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T10:35:38.000Z",
      "summary_90w": "",
      "raw": "At least 16 people died after a carriage on the city's famous Glória hillside railway derailed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c0aa5acd681d9b94d769afa7a5c79c9fa1d70a7",
      "title": "Chinese public is divided over whether to seek global dominance or share leadership",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528578/china-poll-foreign-affairs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T10:33:10.000Z",
      "summary_90w": "",
      "raw": "A new poll shows a majority of Chinese people see competition with the U.S. as a threat, but there is a split on what role Beijing should take on in the world stage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b188204caaaeca2dcddb05c2b25f2f4e35951d",
      "title": "Rubio says US will 'blow up' foreign crime groups if needed",
      "url": "https://www.bbc.com/news/articles/cx23nzwjnwwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T10:23:23.000Z",
      "summary_90w": "",
      "raw": "The secretary of state made the comments during a trip to Ecuador, where he announced new measures targeting criminal gangs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48b53295575ea5d03e753000e59a99fa14ced446",
      "title": "Indian farmer gives up home so village children can have a school",
      "url": "https://www.bbc.com/news/articles/cn4lzm784n8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T10:22:59.000Z",
      "summary_90w": "",
      "raw": "Mor Singh’s residence now operates as an upper primary school attended by 50-60 students in his village",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b6d3adb35ae1da835b90341e8935e6cdc0f9485",
      "title": "Weather tracker: British Columbia breaks Canada’s September heat record",
      "url": "https://www.theguardian.com/environment/2025/sep/05/weather-tracker-record-heat-british-columbia-canada-september-record-temperature-kansas-oklahoma-hail",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T10:20:29.000Z",
      "summary_90w": "",
      "raw": "Temperatures climb above 40C, while a powerful hailstorm in the US lashes Kansas and Oklahoma\nA spate of extremely hot weather in British Columbia has broken Canada’s national maximum temperature record for September.\nOn Tuesday, it reached 40C (104F) in Lytton, matching the previous all-time high. That was only the third time that temperature has been recorded in the country in September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfa4987de490585c54831e95e2df8d4599fe063f",
      "title": "'One and done' dose of LSD keeps anxiety at bay",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/05/nx-s1-5529325/one-dose-lsd-generalized-anxiety-disorder-psychedelics",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-05T10:00:00.000Z",
      "summary_90w": "",
      "raw": "People with generalized anxiety disorder improved significantly after they got a single dose of LSD powerful enough to induce a psychedelic trip.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc4aafcd604b1f392f982da07551a1e248261761",
      "title": "Putin rejects Western security in Ukraine, warning troops would be target",
      "url": "https://www.bbc.com/news/articles/czxwl15w2qko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T09:32:21.000Z",
      "summary_90w": "",
      "raw": "The Russian leader's refusal comes after 26 countries pledged to deploy troops to Ukraine in the event of a ceasefire.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b62e0ae99f4392389aa544d3da745d6e25279d7f",
      "title": "Starmer must not meet Israeli president during UK visit, say Labour MPs",
      "url": "https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T09:17:19.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Isaac Herzog to visit London for expected talks with ministers, with UK on brink of recognising Palestinian statehood\n\nUK politics live – latest updates\n\nThe president of Israel will travel to London next week amid outcry from Labour MPs who have urged Keir Starmer not to meet the visiting delegation.\nThe arrival of Isaac Herzog is fraught with complication for ministers, with the UK government on the brink of recognising the state of Palestine at the UN general assembly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c1a1cadea41b9ddfdb82ff53732f95f732f2418",
      "title": "Why the end of the de minimus tariff exemption is causing shipping chaos worldwide",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5518283/why-the-end-of-the-de-minimus-tariff-exemption-is-causing-shipping-chaos-worldwide",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:11:05.000Z",
      "summary_90w": "",
      "raw": "Planet Money looks at what the de minimis tariff exemption is, who wins and loses with the end of this policy and why ending it has resulting in shipping chaos worldwide.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6cc48c7eb011636e7455cf12aed5c68a0ebfe147",
      "title": "Wong responds to Andrews photo; proposed Harbour Bridge march headed to court – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T09:09:31.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nNeo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community\n\nGet our breaking news email, free app or daily news podcast\n\nCoalition of the willing meeting a ‘positive sign’ for Ukraine, former ambassador says\nThe former Australian ambassador to Russia, Peter Tesch, has appeared on ABC News Breakfast after Anthony Albanese joined a virtual meeting with world leaders signed up to the coalition of the willing for Ukraine on Thursday night.\nThe issue is that we are still no closer to a credible and durable peace settlement, because Moscow keeps walking both sides of the street, and that is provoking a degree of frustration. But in the absence of serious, additional pressure upon Moscow, it’s difficult to see a near-term solution here - notwithstanding Ukraine’s clear willingness to engage seriously in discussions.\nAnd importantly, although the details are vague … President Trump at least remains engaged in that dialogue and that’s very important.\nOur case for a 35% pay increase over three years will begin in the NSW Industrial Relations Commission later this month. As part of this case, which is one of the biggest industrial cases this state has seen, we will present evidence around the gendered undervaluation of nurses and midwives’ work and the work value changes our professions have seen over the past 16 years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "453a8bf46ea2f979e193f4ef69370999876a955f",
      "title": "Nike's nearly 40-year-old slogan gets an update",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528897/nikes-nearly-40-year-old-slogan-gets-an-update",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:07:52.000Z",
      "summary_90w": "",
      "raw": "NPR's A Martinez speaks with AdWeek's Brittaney Kiefer about Nike's update to their iconic \"Just Do It\" slogan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b7dd982c89f9a15b4f02eb24874da987293b8801",
      "title": "Etsy sellers are being hit hard by tariffs and the end of the de minimis rule",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5522054/etsy-sellers-de-minimus-canada-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For years, the U.S. was essentially \"an extension of our domestic market,\" says an Etsy seller in Canada. But now the rules and costs are far more imposing.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e0afda5ab1eb8a4cc8fc1993d245bec0de9dc5d8",
      "title": "Have questions about homeownership or renting? NPR wants to know",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529253/homeownership-renting-questions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Your input will help shape a new NPR series on renting, homeownership and everything that comes with it.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f4b9d33994ffeb80d7e3fee87995208d21732e91",
      "title": "Trump seeks to rebrand Department of Defense as Department of War ",
      "url": "https://www.bbc.com/news/articles/cgr9r4qr0ppo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T08:59:03.000Z",
      "summary_90w": "",
      "raw": "The US president has sought to refocus the department on \"warfighting\" and a \"warrior ethos\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc75229a503f700540aff2f119496dc4f239e3dc",
      "title": "Thailand names third prime minister in two years",
      "url": "https://www.bbc.com/news/articles/cr4q051zxgyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T08:56:04.000Z",
      "summary_90w": "",
      "raw": "Multiple administrations have been deposed by court interventions and military coups in recent years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f095e20299a00098215b0da803a329436c94fac",
      "title": "How to see Sunday's 'Blood Moon' total lunar eclipse",
      "url": "https://www.bbc.com/news/articles/c8739rrez23o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T07:36:36.000Z",
      "summary_90w": "",
      "raw": "A total lunar eclipse will be visible from parts of the UK on Sunday evening, weather permitting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a0198bdd0ecf09dca65578e461a72fbc3c330a4",
      "title": "Hollow Knight: Silksong launch crashes online gaming stores",
      "url": "https://www.theguardian.com/games/2025/sep/05/hollow-knight-silksong-launch-crashes-online-gaming-stores-popularity-demand-australian-game",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T07:19:01.000Z",
      "summary_90w": "",
      "raw": "Steam, the Nintendo eShop and Playstation Store among those that crashed on Friday, unable to cope with demand for the Australian-made game\n\nGet our breaking news email, free app or daily news podcast\n\nAn enigmatic three-member game developing team from Adelaide has created chaos on global online gaming platforms.\nSteam and other major storefronts including Nintendo’s eShop, PlayStation Store and Microsoft Store crashed on Friday, unable to cope with the demand for Hollow Knight: Silksong, the long-awaited sequel to the critically acclaimed 2017 indie hit Hollow Knight.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5aaf469182b42fe77c09d60b8af502b43e71ba0a",
      "title": "Joe Biden undergoes skin cancer surgery",
      "url": "https://www.bbc.com/news/articles/c80grled59do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T07:01:58.000Z",
      "summary_90w": "",
      "raw": "The former US president had been spotted with a wound on the right side of his head in recent days.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18b6591a45e631e96d03eced0892df7e665ff365",
      "title": "'I feared I'd find her dead in bed' - teens harmed by spice-laced vapes",
      "url": "https://www.bbc.com/news/articles/cj3l231xz5ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T05:04:09.000Z",
      "summary_90w": "",
      "raw": "Parents speak of horrific experiences after their school-aged children bought the vape liquid via Snapchat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T04:41:52.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a505f84a2e764acdef73231da781295262dc0609",
      "title": "PBS cuts 15% of jobs in wake of federal funding cut",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5529431/pbs-cuts-15-of-jobs-in-wake-of-federal-funding-cut",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T03:40:27.000Z",
      "summary_90w": "",
      "raw": "After Congress clawed back public media funding, PBS says it's cutting 15% of its staff, or more than 100 jobs.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dfb6ba7762df09ceaafd583fee84b75298e7844f",
      "title": "'I'll try to kick his ass' - Sabalenka wants 'battle of the sexes' game against Kyrgios",
      "url": "https://www.bbc.com/sport/tennis/articles/c0m40npwezko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T03:37:46.000Z",
      "summary_90w": "",
      "raw": "World number one Aryna Sabalenka says 'I'll try my best to kick his ass' if a proposed 'Battle of the Sexes'-style match with Nick Kyrgios goes ahead.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f70a23334599664583f44c589d2f962148db15f",
      "title": "Don Dale detainee isolated for 84 hours and denied food as coercion technique, investigation finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/05/don-dale-detention-centre-84-hours-isolation-denied-food-coercion-technique-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T03:19:08.000Z",
      "summary_90w": "",
      "raw": "Children’s commissioner says young Indigenous person kept in isolation for 12 hours longer than permitted under NT youth justice laws because they refused to move cell blocks\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA young Aboriginal person detained at the Don Dale detention centre was kept in isolation for 84 hours, unable to leave their cell or make contact with any support person, and was denied food for some of that time as a coercion tactic by officers, an investigation by the Northern Territory’s Office of the Children’s Commissioner has found.\nThe investigation examined an incident that took place in April 2024 at the notorious youth detention facility in Berrimah in the NT, which saw a young detainee held in a cell after refusing to move from one cell block to another.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a5c5505ffd6c667b37e1ba7684b5bc00eb7f9aa",
      "title": "Neo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community",
      "url": "https://www.theguardian.com/australia-news/2025/sep/05/neo-nazi-thomas-sewell-refused-bail-melbourne-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T02:50:34.000Z",
      "summary_90w": "",
      "raw": "Sewell, who allegedly led an attack on the sacred Indigenous burial site in Melbourne known as Camp Sovereignty, was returned to custody following his court appearance\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-Nazi Thomas Sewell, who allegedly led an attack on a sacred Indigenous burial site in Melbourne, has been refused bail.\nSewell, 32, appeared in the Melbourne magistrates court on Friday morning, with a magistrate saying she was satisfied he would endanger the safety of others if released into the community.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76f6fc0d1ff17b4f1046b2f40bff9d5d5bc04332",
      "title": "'Alligator Alcatraz' immigration centre can stay open, appeals court rules",
      "url": "https://www.bbc.com/news/articles/crl5ry3rgzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T23:34:59.000Z",
      "summary_90w": "",
      "raw": "Florida Governor Ron DeSantis welcomes the ruling and declares the Everglades site \"open for business\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de05b21beb83efc24dd2eba5cd6a151663e1a65e",
      "title": "Bret Taylor’s Sierra raises $350M at a $10B valuation",
      "url": "https://techcrunch.com/2025/09/04/bret-taylors-sierra-raises-350m-at-a-10b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T23:33:40.000Z",
      "summary_90w": "",
      "raw": "Customer service AI agent startup Sierra claims to have hundreds of customers, including SoFi, Ramp, and Brex, among others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a3a5aa109e1013886001d54e97964b4c78d95b7",
      "title": "Sir John Curtice: How Reform's capture of the Brexit vote could be enough to win an election",
      "url": "https://www.bbc.com/news/articles/cwy853rj2kzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T23:31:21.000Z",
      "summary_90w": "",
      "raw": "The party has now been ahead in the polls for five months, but can it keep the momentum?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3093303bed3cba5c0debebac8b29cfe438f9a504",
      "title": "David Bowie’s secret final project discovered locked in his study ",
      "url": "https://www.bbc.com/news/articles/c3dpdpvj083o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T23:27:15.000Z",
      "summary_90w": "",
      "raw": "Shortly before his death, the star wrote dozens of notes for a musical set in 18th Century London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02f504e5ea738c87577a6a427f99746592866cf3",
      "title": "Rivian makes its second small workforce cut of the year ahead of R2 SUV launch",
      "url": "https://techcrunch.com/2025/09/04/rivian-makes-its-second-small-workforce-cut-of-the-year-ahead-of-r2-suv-launch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T23:03:34.000Z",
      "summary_90w": "",
      "raw": "The company previously laid off around 140 workers in its manufacturing division in June.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ff2cfd45348d73727073e95ca44b2167af9e3a17",
      "title": "'My mother was my shelter and storm': Arundhati Roy on her fierce new memoir",
      "url": "https://www.bbc.com/news/articles/c4gzdnp43l8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T22:47:37.000Z",
      "summary_90w": "",
      "raw": "Mother Mary comes to me is a raw, bruising, yet life-affirming portrait of Arundhati Roy's mother.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a3fef5aea4042dc7da688fdd5b05ff2ff8cc54cf",
      "title": "The U.S. government is taking a stake in Intel. It's rare — but not unprecedented",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5520753/the-u-s-government-is-taking-a-stake-in-intel-its-rare-but-not-unprecedented",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T21:44:11.000Z",
      "summary_90w": "",
      "raw": "The Trump administration last month took a 10% stake in chipmaker Intel. It's not the first time the government has taken a stake in a U.S. firm, but the circumstances are unusual and the desired outcome -- renewed American prowess in chipmaking -- is far from guaranteed.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "454d2a32626faced17e80613b1e5084dd98ce897",
      "title": "Teen killed and seven injured in mass stabbing in Canada",
      "url": "https://www.bbc.com/news/articles/cp8jnrrlvqvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T21:37:32.000Z",
      "summary_90w": "",
      "raw": "Investigators said the 18-year-old killed was the sister of the suspect, who was known to police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b853897f31ba5fe4e0af82ca0525e82d24016ec",
      "title": "Facebook is trying to make ‘pokes’ happen again",
      "url": "https://techcrunch.com/2025/09/04/facebook-is-trying-to-make-pokes-happen-again/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T21:32:52.000Z",
      "summary_90w": "",
      "raw": "The poke-tracking feature is largely designed to appeal to younger users who have grown up with gamification elements built into their social apps, like Snapchat and TikTok Streaks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d7a3e2584327f1df22c6e1ef2ed6915d7b46d228",
      "title": "Sweden accuses Russia of GPS jamming over Baltic Sea ",
      "url": "https://www.bbc.com/news/articles/clyx3ly54veo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T21:28:08.000Z",
      "summary_90w": "",
      "raw": "Interferences to satellite navigational systems occur almost daily, aviation officials say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cdd00e6d49216477eb35801be6d1c96d79adccb0",
      "title": "Stripe enlists a who’s who, including Anthropic, OpenAI, and Paradigm, to build a new blockchain",
      "url": "https://techcrunch.com/2025/09/04/stripe-enlists-a-whos-who-including-anthropic-openai-and-paradigm-to-build-a-new-blockchain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T21:07:34.000Z",
      "summary_90w": "",
      "raw": "Stripe is funding a new blockchain called Tempo to process stablecoins faster. And many big names are joining the effort.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f7914065cdd26d64f9bbe6a34411f4ee306b0c13",
      "title": "Mark Zuckerberg sues Mark Zuckerberg",
      "url": "https://techcrunch.com/2025/09/04/mark-zuckerberg-sues-mark-zuckerberg/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T20:59:30.000Z",
      "summary_90w": "",
      "raw": "Mark S. Zuckerberg, an attorney, says that he's losing business because his Facebook business profile keeps getting disabled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb4a8d2ff0c31ad1488c282f03a8abd30f0927df",
      "title": "TED leader’s $300M ‘valley of death’ fund might be just what later-stage climate tech needs",
      "url": "https://techcrunch.com/2025/09/04/ted-leaders-300m-valley-of-death-fund-might-be-just-what-later-stage-climate-tech-needs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T20:42:26.000Z",
      "summary_90w": "",
      "raw": "The new fund hopes to send a \"Seqouia-like\" signal to other investors that there are promising later-stage climate tech startups waiting to be funded.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49ed059d5bd95c74f4a8af76f83470e4c62b7956",
      "title": "Fashion retailers partner to offer personalized AI styling tool ‘Ella’",
      "url": "https://techcrunch.com/2025/09/04/fashion-retailers-partner-to-offer-personalized-ai-styling-tool-ella/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:45:00.000Z",
      "summary_90w": "",
      "raw": "Ella provides recommendations to customers across the three retailers on what to purchase or rent to make an outfit come to life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "40111d6d8cd7428b30ff467dc1d0a15782ed6d34",
      "title": "X’s encrypted DM feature, XChat, is rolling out more broadly",
      "url": "https://techcrunch.com/2025/09/04/xs-encrypted-dm-feature-xchat-is-rolling-out-more-broadly/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T19:32:34.000Z",
      "summary_90w": "",
      "raw": "Though the feature shipped in beta in May, XChat is now accessible for more users, including those who do not subscribe to X Premium.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6befdfab880fac294aa6d9b0be1b1aa80a8f0b7b",
      "title": "Canada’s Mark Carney signals austerity measures as government shifts focus from Trump to economy",
      "url": "https://www.theguardian.com/world/2025/sep/04/canada-carney-budget-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T18:42:20.000Z",
      "summary_90w": "",
      "raw": "Prime minister cautions Canadians as Ottawa moves to curb spending to balance near-record military expenditures\nMark Carney has told Canadians to prepare for austerity measures and his finance minister warned of “tough choices” in the coming months, as the government attempts to balance near-record defence spending, cuts to government programs and a trade war with the United States.\nCarney, the former central banker and economist turned politician, has been meeting senior ministers before the fall budget, and hinted cuts were coming to the federal bureaucracy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8bc9772ebd965ac7a2363fa840da72859a2e7f2",
      "title": "Canada: one person killed and six injured in stabbing in remote First Nation community",
      "url": "https://www.theguardian.com/world/2025/sep/04/canada-hollow-water-first-nation-stabbing-manitoba",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T18:35:39.000Z",
      "summary_90w": "",
      "raw": "Royal Canadian Mounted Police said the suspect who attacked Hollow Water First Nation has also died \nOne person has been killed and six others injured in a mass stabbing in an Indigenous community in central Canada, according to federal police who said that the the suspect also died in the incident.\nThe violence occurred in Hollow Water First Nation, a remote community with about 1,000 residents, 217km (135 miles) north of Manitoba’s provincial capital, Winnipeg, the Royal Canadian Mounted Police told AFP.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40375c780e803886b45d66a3673f9fdee4626d28",
      "title": "Senators grill Trump's nominee for Fed amid alarms over central bank independence",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526956/senate-federal-reserve-trump-stephen-miran",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T18:03:09.000Z",
      "summary_90w": "",
      "raw": "White House economist Stephen Miran was quizzed by senators about whether he could make decisions independently of President Trump, if he's confirmed to a seat on the Federal Reserve's governing board.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dcbb4efe5d35c3fda1211fcb5447fd9d369538dc",
      "title": "Weekly quiz: Which name topped the new list of storms?",
      "url": "https://www.bbc.com/news/articles/c1mx0yv8lkmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T17:42:05.000Z",
      "summary_90w": "",
      "raw": "How much attention did you pay to what happened in the world over the past seven days?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17129a985f001cee9525be88fe8470c3cb44d00e",
      "title": "Palestine recognition: the principle the EU has been stuck on for decades",
      "url": "https://www.theguardian.com/world/2025/sep/04/palestine-recognition-eu-european-union-stuck-gaza-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T16:25:59.000Z",
      "summary_90w": "",
      "raw": "Europe’s ability to help bring peace to the Middle East has long come under question, with Spain’s PM this week saying it had failed on Gaza\n\nEurope live – latest updates\n\nIn 1980 when Leonid Brezhnev ruled the Soviet Union and Donald Trump was a property developer, the nine leaders of the then European Community made their first major foray into joint diplomacy. The cause: the Middle East, including a Palestinian state.\n“The time has come to promote the recognition and implementation of two principles universally accepted by the international community: the right to existence and to security of all states in the region, including Israel … [and] recognition of the legitimate rights of the Palestinian people,” stated the Venice declaration calling for Palestinian self-determination.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37717927149ef790c7c9fe61b17aa60e2d92c5f1",
      "title": "Ebola outbreak kills 15 in DR Congo",
      "url": "https://www.bbc.com/news/articles/cjed2pg0wy7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T16:18:22.000Z",
      "summary_90w": "",
      "raw": "Health officials urge people to take preventive measures following a new outbreak of the deadly virus.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7896771baba030fd9b7e6154ba782ac31ae12691",
      "title": "'Out of control': Witnesses describe fatal Lisbon funicular crash",
      "url": "https://www.bbc.com/news/articles/c20v4g71zrpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T15:40:03.000Z",
      "summary_90w": "",
      "raw": "At least 16 people were killed and 20 more injured, some critically, Portuguese authorities say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "75ed96a81e5cc0351814d74dd60cf08e448ac8c2",
      "title": "Fashion designer Giorgio Armani, whose name became synonymous with luxury, dies at 91",
      "url": "https://www.npr.org/2025/09/04/1110320559/giorgio-armani-dead",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-04T14:38:19.000Z",
      "summary_90w": "",
      "raw": "Armani's clothes highlight the body as an object of art. Celebrities have flaunted his fashion on red carpets for decades. He revolutionized the suit jacket, with casual silhouettes and softer colors.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1256381fdd1333af836314df1d1981a959ad8a70",
      "title": "New ‘golden triangle’ of fentanyl and guns spans US-Mexico border",
      "url": "https://www.theguardian.com/society/2025/sep/04/fentanyl-guns-us-mexico-border-arizona-california",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T13:25:49.000Z",
      "summary_90w": "",
      "raw": "Report links Arizona-Sonora smuggling to rising homicide and overdose deaths in both countries\nA new “golden triangle” of fentanyl and gun trafficking between Mexico and the US ties together the homicide and overdose crises of the two countries, according to a a new study.\nThe triangle spans Baja California, Sinaloa and Sonora – the three states where almost all fentanyl seizures in Mexico take place – and connects to Arizona through a quieter part of the US-Mexico border that has become a hotspot for trafficking in both directions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ed2c336d6f1a08e6c518ba26b7d8851ac648f32",
      "title": "Organ transplants for immortality: Might Xi and Putin be onto something?",
      "url": "https://www.bbc.com/news/articles/cly1w9z72r6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T12:25:33.000Z",
      "summary_90w": "",
      "raw": "The presidents of China and Russia were overheard discussing transplants as a way to prolong life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6638864850982cfec3c9b5774280c2b25e122377",
      "title": "Taiwan accuses China of breaching international law over drilling",
      "url": "https://www.theguardian.com/world/2025/sep/04/taiwan-china-oil-gas-drilling-exclusive-economic-zone-pratas-islands",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T10:41:07.000Z",
      "summary_90w": "",
      "raw": "Island’s government demands halt to Chinese oil and gas operations in its exclusive economic zone\nTaiwan’s government has accused China of breaching international law by drilling for oil and gas inside Taiwan’s exclusive economic zone (EEZ) and immediately demanded it halt the activity.\nThe statement from the office of Taiwan’s president, Lai Ching-te, came after revelations first reported by the Guardian that several Chinese oil rigs and associated vessels had been detected inside Taiwan’s EEZ, near the disputed Pratas Islands, which are under Taiwanese control.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2dc4a23203b167ada39bc244f57145586a4421c9",
      "title": "All you need to know about next week's Tube strike",
      "url": "https://www.bbc.com/news/articles/c33rnnvmgkyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T08:56:31.000Z",
      "summary_90w": "",
      "raw": "London Underground services are set to face disruption from Sunday to Thursday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "694b253e92d177568d4c78ce03686c245a440282",
      "title": "Thursday briefing: China flexes its muscle in the tussle for global dominance",
      "url": "https://www.theguardian.com/world/2025/sep/04/thursday-briefing-china-flexes-its-muscle-in-the-tussle-for-global-dominance",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:37:32.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: In hosting anti-western leaders at its largest ever military parade, Beijing sent a defiant message that will be heard loud and clear across the world\n\nGood morning. All eyes have been on China this week as the second biggest global economy flexed its muscles.\nDozens of world leaders, including from the global south, authoritarian pariah states and the EU, attended China’s largest ever military parade on Wednesday to mark the 80th anniversary of the end of the second world war, which China calls the war of resistance against Japanese aggression.\nUK news | Deputy PM Angela Rayner has admitted she underpaid stamp duty on her £800,000 seaside flat, after coming under intense pressure to be more transparent about her property arrangements.\nRussia | Vladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nPolice | The Metropolitan police have declined to drop their investigation into the comedy writer Graham Linehan for tweets about trans issues, and said that the law used by officers to detain him needs reviewing.\nIsrael | Israeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nPortugal | A day of national mourning has been declared in Portugal after at least 15 people were killed when Lisbon’s well-known Gloria funicular railway car derailed and crashed on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb25f13a2d2684e7e10ed48fbc222bc31eecabd3",
      "title": "China spectacle shows dangers of Trump's high-risk trade policy",
      "url": "https://www.bbc.com/news/articles/c98d5gplj52o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T03:31:55.000Z",
      "summary_90w": "",
      "raw": "Beijing's military parade shows how Trump has created new international bedfellows in just months, writes Anthony Zurcher.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a577c40318caccf450a6d84e21b750da2e09a3fa",
      "title": "They're eligible for asylum in Canada. So why are they stuck in ICE jail?",
      "url": "https://www.bbc.com/news/articles/c206vj3826lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:19:53.000Z",
      "summary_90w": "",
      "raw": "A man who worked for the US in Afghanistan and his son and daughter are stuck in bureaucratic limbo but hope to be reunited with family in Canada.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98b7072e63f65cb8f8e5db7a287fbfb6be2cb18f",
      "title": "It's 4,000 miles from Ukraine - but even this Asian city is part of Russia's war",
      "url": "https://www.bbc.com/news/articles/cvg0e54z7x8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:18:55.000Z",
      "summary_90w": "",
      "raw": "In Vladivostok, a city on China's and North Korea's border, Russia's war on Ukraine looms large.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e30ac63c5ded5f6739856896686adebb199c1db4",
      "title": "Can India retaliate against Trump's 50% tariffs?",
      "url": "https://www.bbc.com/news/articles/cn76llny57zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T22:31:49.000Z",
      "summary_90w": "",
      "raw": "Prolonged 50% tariffs could shave off as much as 0.8% of India's GDP - so what are Delhi's options?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98b5084e74c414dfa3446f027f4d8bb72c4b3660",
      "title": "Migrant crisis: How Europe went from Merkel's 'We can do it' to pulling up the drawbridge",
      "url": "https://www.bbc.com/news/articles/cn5e5q7w41eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T21:00:06.000Z",
      "summary_90w": "",
      "raw": "A number of European governments are proposing restrictive measures on migrants in response to public concern",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e86b9f97448a1099fc747a1f3156f8d5dca8a0d1",
      "title": "What new weapons on show at huge parade say about China's military strength",
      "url": "https://www.bbc.com/news/articles/cjr1reyr059o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:07:04.000Z",
      "summary_90w": "",
      "raw": "Beijing has unveiled a range of military hardware in a show of might to Western powers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d27437f91defdbeae26dc28641c69c54124a40a",
      "title": "'A clear message to Trump': BBC correspondents react to China's military parade",
      "url": "https://www.bbc.com/news/articles/c7545p2px5no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T06:21:08.000Z",
      "summary_90w": "",
      "raw": "The display of might comes as Beijing positions itself as a global counterweight to the United States.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3530436b320d6ff4c37d98a45ea7d27948abcda5",
      "title": "'A bullet went through my skull': Tanzania abduction survivor",
      "url": "https://www.bbc.com/news/articles/c78zdzvgw90o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:32:11.000Z",
      "summary_90w": "",
      "raw": "Activist Edgar Mwakabela describes his ordeal after he says he was kidnapped and shot by suspected state agents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c762575c02c0050e081f400ca742b4cdd720504",
      "title": "What do we know about Kim Jong Un's daughter - and potential successor?",
      "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:07.000Z",
      "summary_90w": "",
      "raw": "Kim Ju Ae's visit to China with her father is likely to further fuel speculation she may succeed him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    }
  ]
}