{
  "version": "1755688463643",
  "generatedAt": "2025-08-20T11:14:23.643Z",
  "items": [
    {
      "id": "1824cba5956b22ecce6497829fe987671ffc4d02",
      "title": "Ticks are migrating, but scant surveillance may leave doctors in the dark on patient treatment",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5507076/ticks-are-migrating-but-scant-surveillance-may-leave-doctors-in-the-dark-on-patient-treatment",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Health departments struggle to adequately survey for ticks to warn doctors about new species and the diseases they carry.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c45e3dad08b1850ee88a3deb7540c4dc4953fd7a",
      "title": "Made by Google: How to watch the Pixel 10 launch",
      "url": "https://www.theverge.com/news/762138/made-by-google-how-to-watch-pixel-10-watch-4-buds-2a",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T10:52:43.000Z",
      "summary_90w": "",
      "raw": "Google is set to reveal its new flagship Pixel hardware at a Made by Google event today at 1PM ET / 10AM PT, when we’ll find out exactly what the company has in store with its expected Pixel 10 phones, Pixel Watch 4, and Pixel Buds 2A.\nWill they include Qi2 magnetic charging? Is the 10 Pro Fold going to be the first IP68-rated foldable phone? And why on Earth has Google seemingly changed the Pixel Watch 4 to charge on its side?\nI’ve already run through everything we expect Google to launch at the event, along with a deep dive on the most convincing leaks and rumors about the Pixel 10 phones. My colleague Allison has argued that Google has to convince us to actually care about all the AI appearing on our phones. All that’s left is to watch the show.\nThanks to a recent ad, we know the event will feature appearances from celebrity guests, including Jimmy Fallon, Steph Curry, Lando Norris, and the Jonas Brothers, so it sounds like Google won’t just be rattling through hardware specs the whole time.\nWe’ve embedded the stream right at the top of the page, though you can always watch it directly on YouTube. Google is also providing official streams in German, Spanish, and American Sign Language.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d51c75a7157c829460273751683710475ed025d8",
      "title": "More asylum hotels face legal challenge after court ruling",
      "url": "https://www.bbc.com/news/articles/cp3e221qgeeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T10:42:22.000Z",
      "summary_90w": "",
      "raw": "Nigel Farage says Reform UK-controlled councils will do everything in their power to close the hotels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f2c110295670e37b339adc6640f775382379c04",
      "title": "Air fares and food prices push up inflation to 3.8% in July",
      "url": "https://www.bbc.com/news/articles/c741wkngndqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T10:39:21.000Z",
      "summary_90w": "",
      "raw": "Prices are now rising slightly quicker than expected and at their fastest pace since January 2024.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f17517b5cfea53dae9bfc30952d6fa1d4d55222",
      "title": "Trump says US may provide air support to Ukraine as Nato military leaders prepare to meet – Ukraine war live",
      "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T10:33:26.000Z",
      "summary_90w": "",
      "raw": "US president rules out putting troops on the ground to back Ukraine peace deal, as military leaders set to meet to discuss further support for country\nAn object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine.\n“...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67680591a96c3ff08966d158a96e67e1a067a961",
      "title": "Kneecap rapper arrives in court over terror charge",
      "url": "https://www.bbc.com/news/articles/c939v4kw2l4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T10:23:52.000Z",
      "summary_90w": "",
      "raw": "Liam Óg Ó hAnnaidh was charged with a terror offence after allegedly displaying a flag in support of proscribed organisation Hezbollah.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "077e03855e9857b79ecf1348f63a3806eaa4c572",
      "title": "Australia’s peak Jewish group condemns Netanyahu’s ‘clumsy’ attack on Albanese and calls for end to ‘spat’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/ecaj-letters-to-benjamin-netanyahu-anthony-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T10:11:32.000Z",
      "summary_90w": "",
      "raw": "Executive Council of Australian Jewry says Australian and Israeli governments should use ‘diplomacy rather than public posturing’\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s peak Jewish group has lambasted Benjamin Netanyahu’s attack on Anthony Albanese as “inflammatory and provocative”, adding that the “clumsy intervention” showed a “woeful lack of understanding of social and political conditions in Australia” – notwithstanding what the group describes as “unseemly” conduct from Australia’s leader.\nThe concerned intervention by the Executive Council of Australian Jewry (ECAJ) came as Australia and Israel entered the third day of a diplomatic tit-for-tat prompted by Australia’s visa cancellation of far-right Israeli politician Simcha Rothman on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffd3f610b15a0112184339ff6b7aea13ec0cc707",
      "title": "Actress Aubrey Plaza says grief is a 'giant ocean of awfulness'",
      "url": "https://www.bbc.com/news/articles/c30z944q42do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T09:47:33.000Z",
      "summary_90w": "",
      "raw": "The US actress says life is \"a daily struggle\", seven months after husband Jeff Baena's suicide.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a4a4a6e2dee7bd6ee98a1eb4343a1bd916b150c",
      "title": "Prices leak for the rest of Google’s new Pixel products",
      "url": "https://www.theverge.com/news/762115/google-pixel-10-watch-4-buds-2a-price-leak",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T09:45:41.000Z",
      "summary_90w": "",
      "raw": "At this rate, nothing announced at Google’s Pixel event will be a suprise.\t\n\nMore prices have leaked for Google’s new lineup of Pixel phones and watches, this time joined by prices for the new accessories and Pixel Buds 2A. Prices posted by leaker Evan Blass on X for the Pixel 10 family — including the 10, 10 Pro, 10 Pro XL, and 10 Pro Fold — line up with previous pricing rumors that were shared last month, as do those for the new Watch 4 models.\nThis leak also gives us a $129 price for the Pixel Buds 2A, up a little from the original $99 Buds A-Series, but those launched four years ago. There are some product names and prices for various charging accessories too, including the “PixelSnap” wireless charging line that’s speculated to be Google’s Qi2 alternative to Apple’s MagSafe. You can see the full pricing leaks and product names below, ahead of everything being officially announced at Google’s Pixel event today.\nPixel 10\n128GB: $799\n256GB: $899\nPixel 10 Pro\n128GB: $999\n256GB: $1,099\n512GB: $1,219\n1TB: $1,449\nPixel 10 Pro XL\n256GB: $1,199\n512GB: $1,319\n1TB: $1,549\nPixel 10 Pro Fold\n256GB: $1,799\n512GB: $1,919\n1TB: $2,149\nPixel Watch 4\n41mm Wi-Fi: $349\n41mm LTE: $449\n45mm Wi-Fi: $399\n45mm LTE: $499\nPixel Buds 2A: $129\nPixelsnap Ring Stand: $29.99\nPixelsnap Charger: $39.99\nPixel Flex 67W Charger: $59.99\nPixelsnap Charger with Stand: $69.99",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e1cb30a04afeed0dc4c9e53072e8408221e46eb8",
      "title": "DR Congo rebels killed 140 civilians despite peace process, rights group says",
      "url": "https://www.bbc.com/news/articles/c8x5y2zvzk0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T09:40:44.000Z",
      "summary_90w": "",
      "raw": "Attacks were carried out in more than a dozen villages last month, Human Rights Watch says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f73c18ffbaa888ae0398867adf0818360640af4",
      "title": "Kremlin plays down Zelensky talks as Trump warns Putin may not want to make deal",
      "url": "https://www.bbc.com/news/articles/cn92e52rpjxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T09:35:05.000Z",
      "summary_90w": "",
      "raw": "The US president conceded the war in Ukraine was \"tough to solve\" after several days of high-level talks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33608c51b45b57a766acec6d31039aa5ed38f1c1",
      "title": "Trump administration wants government to have an equity stake in chipmaker Intel",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507038/trump-administration-wants-government-to-have-an-equity-stake-in-chipmaker-intel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-20T09:15:33.000Z",
      "summary_90w": "",
      "raw": "The Trump administration is pursuing an unusual deal that would make the U.S. government a major stakeholder in chipmaker Intel. NPR unpacks the proposal with Bloomberg reporter Mackenzie Hawkins.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "76a26502b7d85fb5f1fb1b9d78cfd1ad0f72ff97",
      "title": "Josh Willie named new Tasmanian Labor leader after party officially concedes election defeat",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/josh-willie-tasmania-labor-leader-dean-winter-state-election",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T09:03:49.000Z",
      "summary_90w": "",
      "raw": "Leadership spill comes day after Dean Winter bid to form government via no-confidence motion in parliament fell flat\n\nGet our breaking news email, free app or daily news podcast\n\nTasmanian Labor has replaced Dean Winter as parliamentary leader, with Josh Willie elected unopposed to serve as the state’s new opposition leader.\nThe party, which has been in opposition for 11 years, met for more than seven hours on Wednesday before announcing Willie’s appointment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "755e0f3e6e179a8177331fcec7cdaec8ff431f18",
      "title": "Dramatic rise in whale and dolphin strandings in Scotland",
      "url": "https://www.theguardian.com/environment/2025/aug/20/rise-whale-marine-mammal-strandings-scotland",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T09:00:17.000Z",
      "summary_90w": "",
      "raw": "Research shows steep increases over past 30 years, after summer of strandings across Europe\nThe number of marine mammals stranded in Scotland has risen dramatically in the past 30 years, a study has found.\nFrom 1992 to 2022, 5,147 cetaceans died on Scottish shores, and a new paper shows steep increases in the rate of strandings of up to 800% in some species, continuing exponentially every year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e769f2c4c58f008818c8f564819fbe3160dc716",
      "title": "Nerd! How the word popularized by Dr. Seuss went from geeky insult to mainstream",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507053/nerd-dr-seuss-word-of-week",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Nerd has been part of our lexicon for three-quarters of a century, its geeky meaning embodied by some of the most recognizable characters in film and TV, but its origin story is a bit murky.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "937f2d77bff0f2c0f5a08b715f8047ef5d84bbe6",
      "title": "Trump's return to 'law and order' highlights a sore spot for Democrats: crime policy",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507218/trump-dc-crime-democrats",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Democrats have struggled to counter GOP efforts to frame itself as the party of \"law and order.\" Some see it as a problem of messaging, while others think past and current policies may be to blame.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d684443c64b6fc80649eb3228f580bc3330cdbb8",
      "title": "Voting officials are leaving their jobs at the highest rate in decades",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5503954/turnover-election-officials-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Some 2 in 5 of all the local officials who administered the 2020 election left their jobs before the 2024 cycle, new research has found.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea88f622219d5c5046ad96cb50dd939125654e4c",
      "title": "Family of NZ fugitive on the run with children pleads for return",
      "url": "https://www.bbc.com/news/articles/c3v37ye0l0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T08:44:20.000Z",
      "summary_90w": "",
      "raw": "Tom Phillips and his children have been missing since 2021, in a case that has gripped New Zealand.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d9952e1216c64f9d5467cb4e53f40d49e5c74fee",
      "title": "Ikea’s most Ikea product ever",
      "url": "https://www.theverge.com/news/762106/ikea-gustaf-westman-meatball-plate-collection",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T08:35:21.000Z",
      "summary_90w": "",
      "raw": "You can certainly use this for other things besides meatballs too, but it does present them beautifully.\t\n\nIkea is teaming up with a Swedish designer for its latest collection, and the first product being teased is a dedicated plate for Ikea’s greatest product: meatballs. The 12-piece Gustaf Westman collection that’s launching on September 9th includes a chunky blue serving dish that is shaped to fit exactly 11 of the delicious morsels “in a celebratory row.”\n“I love designing objects for a specific function – it brings a touch of humor and makes them instantly easy to grasp. In Sweden, meatballs mean Christmas, and this plate is my way of honoring that tradition,” says Westman. “The design is simple, lining up the meatballs so each one is visible, like they’re sitting on little thrones. And while it was created with meatballs in mind, it works just as well for many other dishes.”\nI’m already a big fan of Westman’s signature playful style, and I think it pairs beautifully with Ikea’s brand aesthetic. Even the five-step instruction manual for this meatball plate is equal parts amusing and charming. I’m going to try (and likely fail) to convince myself that I don’t need a dish for displaying meatballs at whatever price tag it gets upon release.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "81d48bac771ff4897bce370e79ce48fcf0b2eb82",
      "title": "Dozens of Afghan deportees from Iran killed in bus crash",
      "url": "https://www.bbc.com/news/articles/c336jj5xkvko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T08:31:53.000Z",
      "summary_90w": "",
      "raw": "At least 17 children were among those killed after the bus crashed and caught fire on its way to Kabul.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bbb864b1c9224f9f9069cc8a9faa1a3ec12993b8",
      "title": "One third of Queensland public servants have witnessed corruption and over half didn’t report it, watchdog finds",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/one-third-of-queensland-public-servants-have-witnessed-corruption-and-over-half-didnt-report-it-watchdog-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T08:29:49.000Z",
      "summary_90w": "",
      "raw": "State’s Crime and Corruption Commission investigated fewer than 1% of complaints referred to it\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA third of Queensland public servants say they have witnessed corruption in their workplace in the last five years, according to a survey by the state’s anti-corruption watchdog.\nHowever, the state’s Crime and Corruption Commission (CCC) investigated fewer than 1% of complaints referred to it, and has only charged a single person with a corruption offence in a year, it revealed in parliament this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b5338da1d5d552cfaa1964d142d3c040a148f9b",
      "title": "Why is UK inflation still rising?",
      "url": "https://www.bbc.com/news/articles/c17rgd8e9gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T08:25:43.000Z",
      "summary_90w": "",
      "raw": "UK Inflation has fallen from record highs but remains above the Bank of England's 2% target.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a21595e5dca2c4f00850d2032e4eb040d2a72ead",
      "title": "Details of Monash IVF review to remain secret – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/20/australia-news-live-bruce-lehrmann-federal-court-appeal-network-10-lisa-wilkinson-brittany-higgins-parliament-productivity-economic-reform-roundtable-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T08:23:31.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nGet our breaking news email, free app or daily news podcast\n\nAs I noted in my hello earlier, rain is on the brain in Sydney, with a deluge set to continue for days.\nMelbourne is cold, but lovely, and Adelaide and Hobart are both expecting sunshine today. Brisbane, Perth and Canberra are in for rain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d1276875310896003db93303bd06ec3bb1b4ce44",
      "title": "Fireball lights up sky over western Japan",
      "url": "https://www.theguardian.com/science/2025/aug/20/fireball-lights-up-sky-japan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T08:21:21.000Z",
      "summary_90w": "",
      "raw": "Flashing light visible for hundreds of miles was an exceptionally bright meteor, say experts\nA flashing fireball dashed across the skies of western Japan, shocking residents and dazzling stargazers, though experts said it was a natural phenomenon and not an alien invasion.\nVideos and photos emerged online of the extremely bright ball of light visible for hundreds of miles shortly after 11.00pm local time (1400 BST) on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9a38921645648618f681f62192d31da807839d9",
      "title": "Israeli military will call up 50,000 reservists as it plans new phase of war in Gaza",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507976/israel-palestinians-reservists-war-gaza",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T08:07:14.000Z",
      "summary_90w": "",
      "raw": "An Israeli official said that the military will be operating in parts of Gaza City where the Israeli military has not yet operated and where Hamas is still active.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5c12995498abbc14463f10f04dfe4793ec0eb2",
      "title": "University of Melbourne breached students’ privacy by using wifi network to monitor pro-Palestine protest",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/university-of-melbourne-surveilled-students-pro-palestine-protest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T07:47:07.000Z",
      "summary_90w": "",
      "raw": "Victoria’s deputy information commissioner finds university did not give adequate notice or justification for how location data would be used\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe University of Melbourne (UoM) breached Victoria’s Privacy and Data Protection Act when it used its wifi network to surveil students and staff holding a pro-Palestine protest last May, which could have resulted in a “significant breach of trust”, the state’s deputy information commissioner has found.\nThe investigation, released on Wednesday, was prompted by media reports alleging UoM digitally tracked people at the sit-in to uncover potential misconduct.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ea7a6266cfe54fa3efff6d58c56ff2ac2debd6f",
      "title": "Vienna announced as host city for Eurovision song contest 2026",
      "url": "https://www.theguardian.com/tv-and-radio/2025/aug/20/vienna-host-city-eurovision-song-contest-2026",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T07:42:45.000Z",
      "summary_90w": "",
      "raw": "Final of 70th edition of competition to be held on 16 May at the Wiener Stadthalle, Austria’s largest indoor arena\nVienna has been chosen to host the Eurovision song contest 2026, the world’s biggest live televised music event, Austria’s public broadcaster announced, with the final set for 16 May.\nAustria’s JJ won this year’s competition, held in Basel in Switzerland, with his song Wasted Love, which blends techno beats with operatic vocals – making his home country the 2026 host.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27ca658b5c0fbd4a1731de6a8ee774f584d04e91",
      "title": "Jewellery, cash or first cars: Do rewards boost exam grades?",
      "url": "https://www.bbc.com/news/articles/cgqnzy9ej0do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T07:38:42.000Z",
      "summary_90w": "",
      "raw": "Some parents offer money and gifts ahead of exams results - but does the promise of a reward work?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04db18b87d76094d258a82f259429021b0443846",
      "title": "Hyperkin’s DualSense-inspired Xbox controller is finally launching this fall",
      "url": "https://www.theverge.com/news/761638/hyperkin-competitor-xbox-wired-controller-sony-ps5-dualsense",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T07:30:00.000Z",
      "summary_90w": "",
      "raw": "You don’t have to worry about battery life with the Hyperkin Competitor since it’s a wired-only Xbox controller. | Image: Hyperkin\t\n\nThere’s good news if you’re an Xbox gamer who’s longingly stared at the sleeker design of Sony’s DualSense controller for the PlayStation 5. After revealing the final form of its Competitor gamepad at CES 2025, Hyperkin has announced it will be available sometime in October for $49.99 in black and white color options for North America, and red, blue, and gold for Europe and Australia – although the company says those colors will also launch here at a later date.\nThe Competitor was first teased as far back as 2019, and while Hyperkin revealed a blander design in 2023, it’s now fully embracing comparisons to PlayStation controllers, given that the Competitor features a symmetrical, side-by-side joystick arrangement. The Competitor’s features remain in line with what was revealed earlier this year at CES, including anti-drift Hall effect joysticks and impulse triggers, separated D-pad buttons, a pair of back buttons with locks, and a mic mute button.\nIt’s far from being an exact clone of the DualSense, and it lacks the advanced haptic feedback and adaptive triggers of Sony’s controller. And don’t worry about battery life, the Competitor is a wired-only Xbox controller.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e01092f21a6dd0a7ac3b46d3103bc76d86f761cb",
      "title": "'He fixes what needs fixing' - why Raducanu turned to Nadal's ex-coach ",
      "url": "https://www.bbc.com/sport/tennis/articles/c5ypke1n361o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T07:06:58.000Z",
      "summary_90w": "",
      "raw": "Emma Raducanu recently appointed another full-time coach in Spaniard Francisco Roig - BBC Sport speaks to those who know him best.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b068be79169c021d22fd4f56a4209607806c347d",
      "title": "Cobalt-free batteries reign in Chinese EVs. Why not the US?",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507156/cobalt-free-batteries-reign-in-chinese-evs-why-not-the-us",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T07:05:00.000Z",
      "summary_90w": "",
      "raw": "There’s been an era-defining race underway between two types of batteries used in electric vehicles: lithium batteries that use cobalt, and ones that use iron phosphate. Cobalt, a metal with a checkered human rights record, has been in the lead. Until recently. \nHenry Sanderson’s book on the elements that build electric vehicles is Volt Rush: The Winners and Losers in the Race to Go Green.\nRelated episodes: \nThe race to produce lithium \nHow batteries are already changing the grid \nHow batteries are riding the free market rodeo in Texas \nHow EV batteries tore apart Michigan (Update) \nBatteries are catching fire at sea \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ac412824f00d6550e1b20bf9bb9f96d23ad0ffe",
      "title": "Pine nuts and goat's milk among foods that should have allergy labels, experts say",
      "url": "https://www.bbc.com/news/articles/c5ypgrzxx9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T07:04:57.000Z",
      "summary_90w": "",
      "raw": "Warnings for some 'emerging' food allergens should be added to food packaging, researchers suggest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "963d88895edad278515bd03c3e28b994b4f4bf11",
      "title": "What is the legacy of Yellowstone wolves 30 years after their reintroduction?",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507229/wolves-elk-predator-yellowstone-national-park-ecosystem",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Thirty years ago, park rangers reintroduced grey wolves into Yellowstone National Park. They wanted to restore the ecosystem and get the elk population, which had decimated the plant community, in check. And it worked – or so the popular narrative suggests. But is it really so simple? Today on the show, we explore how the Yellowstone ecosystem has changed since wolves returned and whether those changes can really be pinned solely on wolves. Plus, how the narrative of the Yellowstone wolf legacy could affect wolf reintroduction elsewhere.\nCurious about other science controversies? Email us at shortwave@npr.org.\nListen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e9ecebfef7217ccba8f71dbe87236cd4c6a308d",
      "title": "Heavy rain paralyses India's financial capital Mumbai",
      "url": "https://www.bbc.com/news/articles/cx29jw7488go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T06:52:13.000Z",
      "summary_90w": "",
      "raw": "Nearly 600 people were rescued from a stalled monorail system and 350 others have been shifted to shelters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d878abc47011950c1db1e8d6d11ffdf056ecf28c",
      "title": "US in talks over 10% Intel stake, White House confirms",
      "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T06:37:52.000Z",
      "summary_90w": "",
      "raw": "The potential deal could involve swapping government grants for shares in the chip making giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a514fd4c22ec5d4d16f261b9fc20ba8948c418b",
      "title": "Fluminense keeper Fabio breaks Shilton appearance record",
      "url": "https://www.bbc.com/sport/football/articles/cm21x8mzdnxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T06:32:48.000Z",
      "summary_90w": "",
      "raw": "Brazilian goalkeeper Fabio breaks former England international Peter Shilton's record for most competitive appearances in world football, say his club Fluminense.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a768fc767ed38e299fe3d1771a01b695845d41ce",
      "title": "Walmart recalls possibly radioactive shrimp after public warned not to eat",
      "url": "https://www.bbc.com/news/articles/c5ypg4rgnrno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T06:05:55.000Z",
      "summary_90w": "",
      "raw": "US consumers are being advised to throw away shrimp with the supermarket's Great Value label.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc3ed04036b3539e666dfbc3cfe221574abfb68c",
      "title": "US strikes deportation deals with Honduras and Uganda",
      "url": "https://www.bbc.com/news/articles/cn02eezlykdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T05:53:37.000Z",
      "summary_90w": "",
      "raw": "Uganda and Honduras have agreed to accept migrants of other nationalities who have been deported from the US, CBS reports.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6c56987f3e126fa2a83dce39a13901930115a36",
      "title": "Malaysian state threatens to jail Muslim men who skip Friday prayers",
      "url": "https://www.theguardian.com/world/2025/aug/20/malaysian-state-threatens-to-jail-muslim-men-who-skip-friday-prayers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T05:50:34.000Z",
      "summary_90w": "",
      "raw": "Under the new laws in Malaysia’s Terengganu state, first-time offenders could be imprisoned for up to two years and fined\nThe Malaysian state of Terengganu has threatened to jail men who skip Friday prayers without a valid reason for up to two years.\nUnder sharia law in the Malaysian province, first-time offenders could be imprisoned for up to two years, and fined 3,000 ringgit (£527), or both, according to new rules that came into effect this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4ba1e658887c50df9642cf490b109f962d033b",
      "title": "Walmart recalls frozen shrimp over potential radioactive contamination",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507971/walmart-recall-frozen-shrimp-radioactive",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T05:18:08.000Z",
      "summary_90w": "",
      "raw": "The risk from the recalled shrimp is \"quite low,\" said Donald Schaffner, a food safety expert at Rutgers University. Cesium-137 is a byproduct of nuclear reactions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f8732ad6cd12eb2d55b54ed5de31902d79bfc82",
      "title": "Watch: Moment fireball lights up night sky in Japan",
      "url": "https://www.bbc.com/news/videos/cwy0x2dngj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T05:12:32.000Z",
      "summary_90w": "",
      "raw": "The skies above southern Japan were illuminated late on Tuesday evening after dust or asteroid fragments burnt up in the atmosphere.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a0930daaa97f3bd477195d43b7b464b83604931",
      "title": "Netanyahu accuses Australian PM of 'betraying' Israel",
      "url": "https://www.bbc.com/news/articles/c5ylkpp77qxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T05:05:40.000Z",
      "summary_90w": "",
      "raw": "Relations between the countries have frayed since Australia said it planned to recognise a Palestinian state.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0d9d08fbb28f5ab988c8aa27173b98eb7a7e66a",
      "title": "Leaked report shows 10,000 shortfall in probation staff to manage offenders",
      "url": "https://www.bbc.com/news/articles/cy7yj0gkl3zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T05:00:14.000Z",
      "summary_90w": "",
      "raw": "There is a shortage of probation staff to manage offenders serving sentences in the community, a report shows.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92cf5d79f3ae674aaf360b42b7f84bb21c2fd7e1",
      "title": "MND left her without a voice. Eight seconds of scratchy audio gave it back to her",
      "url": "https://www.bbc.com/news/articles/c1ejvxne7elo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T04:51:38.000Z",
      "summary_90w": "",
      "raw": "Sarah Ezekiel was 34 with two children when motor neurone disease took away her ability to speak.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Is Bristol cooler than Berlin? Play BBC Weather’s new guessing game Cooler Than Me?",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T04:24:40.000Z",
      "summary_90w": "",
      "raw": "The new guessing game from BBC Weather",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54cd80a183ed6d003ccff740ac131232e71678f3",
      "title": "Chinese man jailed in US for sending weapons to North Korea",
      "url": "https://www.bbc.com/news/articles/cg4xg0dlzwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T04:12:21.000Z",
      "summary_90w": "",
      "raw": "Shenghua Wen received around $2m (£1.5m) from North Korean officials to ship weapons from California.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aff6864bbdf844e6c7f19b75ac25ebf5c6268100",
      "title": "‘It would be a terrible loss’: Ukrainian frontline troops sceptical of ceding land",
      "url": "https://www.theguardian.com/world/2025/aug/20/ukraine-frontline-troops-drones-dobropillia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T04:00:32.000Z",
      "summary_90w": "",
      "raw": "Near Dobropillia new trenches are visible, drone attacks continue and there is no sign of the fighting easing\nOver dinner on Monday, a simple barbecue of meat and roasted vegetables, the soldiers of Ukraine’s 150th reconnaissance and strike battalion have other things on their mind. Volodymyr Zelenskyy is in the White House and Donald Trump has just promised to give Ukraine “very good protection”.\nWhen this development is passed on to the group around, one of the soldiers pipes up “From who?” and laughs, such is the uncertainty about who the US really supports. But in reality the troops are not following the news closely. After three and half years, the war has its own momentum, technology and schedule.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f1364ea9d19fe09b75a667fe82c336ae7dd7ae1",
      "title": "Hurricane Erin leaves some US East Coast beaches off limits",
      "url": "https://www.bbc.com/news/articles/c3r41zeqnexo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T02:47:20.000Z",
      "summary_90w": "",
      "raw": "The category two storm threatens to bring life-threatening surf and rip currents to the region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "897cd5a949e85f1ba5853a425cd114d7c6fb6fe4",
      "title": "Family of New Zealand fugitive on the run for almost four years with his children plead for his return",
      "url": "https://www.theguardian.com/world/2025/aug/20/new-zealand-fugitive-tom-phillips-children-hiding-nearly-four-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T02:41:25.000Z",
      "summary_90w": "",
      "raw": "In a New Zealand television interview, relatives spoke of their anguish since Tom Phillips disappeared with his three children in late 2021\nThe family of a fugitive father who has been hiding for more than three years in New Zealand’s rugged wilderness with his three children has pleaded with the man to come home, in some of their first public comments since he vanished.\nJust before Christmas 2021, Tom Phillips fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a dispute with their mother. Phillips does not have legal custody of his children.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75d1b11f3fcd0f00e3a49339ab49acd70716fc73",
      "title": "The White House just joined TikTok",
      "url": "https://www.theverge.com/politics/762031/trump-white-house-tiktok-account",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T01:21:13.000Z",
      "summary_90w": "",
      "raw": "While it was President Joe Biden who signed the law that would force  ByteDance to sell its stake in TikTok or face a ban, it’s his successor, Donald Trump, who has yet to fulfill his promise of arranging a deal to keep TikTok running, legally, in the United States. The current deadline for a deal is September 17th. Still, it hasn’t stopped Trump’s administration from creating @WhiteHouse on TikTok, which published its first post on Tuesday night: a video celebrating Trump’s accomplishments. \nThe ban has only seen TikTok shut down in the US for one day, and its impact has been delayed three times. The first time was in January, when Trump took office and signed an executive order delaying enforcement of the ban for 75 days; then there was another delay in April, after a potential deal fell through due to Trump’s harsh tariffs against China, and then in June, when he stated that he believed Chinese President Xi Jinping was open to a deal if a buyer emerged. \nWhile Trump tried to ban TikTok in 2020, his stance softened during his re-election campaign once his team learned how many supporters Trump had on the platform. In 2024, the Trump campaign launched its own official account, @TeamTrump, and quickly dominated the platform, getting more followers and views on their content than former Vice President Kamala Harris’s now-dormant campaign account — 2.8 billion to 2.2 billion, according to journalist Kyle Tharp.  A Republican digital operative close to the campaign heavily credited Trump, a former reality TV star, for his ability to generate attention-grabbing moments that could be transformed into viral content. “TikTok is primarily an entertainment app,” he previously told The Verge, “and our usage of it was just significantly more savvy than [the Democrats].”\nAlthough the legality of and ulterior motives behind a TikTok ban remain a serious question, the Trump administration, for now, appears to find utility in maintaining an account on the platform. “Why would I want to get rid of TikTok?” Trump said on Truth Social in January, sharing a post about the billions of views his campaign account continued to rack up. White House press secretary Karoline Leavitt repeated this stance after the government account was launched. “President Trump’s message dominated TikTok during his presidential campaign,” she said in a statement to The Verge, “and we’re excited to build upon those successes and communicate in a way no other administration has before.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bc84a3a9589c12ec2420c2c92b1f2c2db48fb3",
      "title": "Six severed heads found on road in Mexico",
      "url": "https://www.bbc.com/news/articles/c8ry1m202nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T01:07:45.000Z",
      "summary_90w": "",
      "raw": "Police have not given a motive for the killings in a large peaceful region of central Mexico.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4f166f7805dbd3ca59a9053767eb0c5eb4866d1",
      "title": "Final £1 coins featuring late Queen enter circulation",
      "url": "https://www.bbc.com/news/articles/cvgn3nv6g69o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:58:35.000Z",
      "summary_90w": "",
      "raw": "More than 23 million coins are being released, alongside 7.5 million new King Charles III coins.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea2636275147e7463fad5a4731f7732d719f693d",
      "title": "More weight-loss drugs could be offered as part of new diabetes care",
      "url": "https://www.bbc.com/news/articles/cgkr2g3e5p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:51:07.000Z",
      "summary_90w": "",
      "raw": "Diabetes patients should have better and more equal access to newer medicines, says official healthcare body.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8341063f1396bd26cc493552f6cec2506a70adf6",
      "title": "UK independent space agency scrapped to cut costs",
      "url": "https://www.bbc.com/news/articles/c4gmjm8z47jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T00:35:23.000Z",
      "summary_90w": "",
      "raw": "Britain's space agency is set to be scrapped - a scientist fears the UK space sector could fall behind as a result",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2c4b20647cb325fadf763f7517d9f1ee9502c2c3",
      "title": "How many wars has President Trump really ended?",
      "url": "https://www.bbc.com/news/articles/c5y3599gx4qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:49:04.000Z",
      "summary_90w": "",
      "raw": "US President Donald Trump claims to have ended seven wars - is that true?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7813fa3007349ce9f6a82f8d388fe02aaf2edd5",
      "title": "A growing number of 20-somethings are getting what's known as 'baby Botox'",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507247/a-growing-number-of-20-somethings-are-getting-whats-known-as-baby-botox",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-19T23:39:13.000Z",
      "summary_90w": "",
      "raw": "A growing number of 20-somethings are trying to stop wrinkles from forming on their face with a preventative treatment known as \"baby Botox,\" which freezes facial muscles to limit movement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "22005cf334469873df510be2ee6d1c2c7753393b",
      "title": "Here are the best Apple Watch deals available right now",
      "url": "https://www.theverge.com/21289209/best-apple-watch-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T23:38:41.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch Ultra 2 is currently on sale in select configurations starting at $649, which remains one of its best prices to date. | Photo: Amelia Holowaty Krales / The Verge\t\n\nIn September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now more Apple Watch models on the market than ever before — and a lot more deals to be had.\n \n\nThe best Apple Watch Series 10 deals\nThe best Apple Watch SE deals\nThe best Apple Watch Ultra 2 deals\nA note on the more premium models\n\nBut with all of those options, which one should you pick? Generally speaking, you want to buy the newest watch you can afford so that it continues to receive software updates from Apple. The latest update, watchOS 11, launched in September on the Series 6 and newer models, ultimately leaving those still using an older Series 4 or 5 behind. Fortunately, the next iteration of watchOS will continue to support the same devices when it arrives in the fall, even if Apple is revamping its naming convention in a bid to standardize its operating system names.\nAll that being said, picking up a watch from the latest (or a recent) generation ensures you’re getting a smartwatch with an updated design, a robust number of features, and plenty of sensors.\nNow, let’s get to the deals.\nThe best Apple Watch Series 10 deals\nApple Watch Series 10 (42mm, GPS)\n\nWhere to Buy:\n\n $399 $298 at Amazon\n $399 $298 at Walmart\n $399 $299 at Best Buy\n\n\nApple Watch Series 10 (46mm, GPS)\n\nWhere to Buy:\n\n $429 $329 at Amazon\n $429 $329 at Walmart\n $429 $329 at Best Buy\n\nThe Apple Watch Series 10 represents the latest wearable in Apple’s flagship Series lineup. It features the new S10 SiP chip, faster charging, and a wide-angle OLED display that’s brighter, larger, and easier to read than that of previous models. It weighs half as much as the Ultra, too, and is about 30 percent thinner despite its 42mm and 46mm sizing. Other upgrades include an added depth and water temperature sensor, as well as a new FDA-cleared sleep apnea detection feature, the latter of which is also available on the last-gen Series 9 and Ultra 2.\nWhile the improvements are welcome, the Series 10 isn’t a vast departure from the prior model, the Series 9. That said, it’s currently on sale at Amazon, Walmart, and Best Buy right now in the 42mm sizing with GPS starting at $298 ($101 off), which is just $19 shy of its recent Prime Day low. The 46mm variant, meanwhile, is on sale at Amazon, Walmart, and Best Buy starting at $329 ($100 off) — which is the second-best price we’ve seen on the larger configuration — while the LTE models can be had at Amazon, Walmart, and Best Buy starting at around $399 ($100 off).\nRead our Apple Watch Series 10 review.\nThe best Apple Watch SE deals\n2022 Apple Watch SE (40mm, GPS)\n\nWhere to Buy:\n\n $249 $169 at Amazon\n $249 $169 at Walmart\n $249 $169 at Best Buy\n\n\n2022 Apple Watch SE (44mm, GPS)\n\nWhere to Buy:\n\n $279 $199 at Amazon\n $279 $199 at Walmart\n $279 $199 at Best Buy\n\nThe Apple Watch SE received a refresh in late 2022. It has the same chipset as the Series 8, which is great, but with fewer sensors, no always-on display, and a slightly outdated design compared to the Series 8, 9, and 10. Those omissions might take this out of the running for some people, but it still may be exactly what you’re after. Best of all, it starts at $249 for the 40mm Wi-Fi / GPS model, which is $30 less than the previous generation’s baseline cost. Opting for cellular connectivity increases the starting price to $299 for the 40mm size (the 44mm size adds $20 to each configuration).\nRight now, the best deal on the latest SE can be found at Amazon, Walmart, and Best Buy, where you can pick up the 40mm model with GPS starting at $169 ($80 off). The 44mm / GPS configuration, meanwhile, is available from the same retailers (Amazon, Walmart, Best Buy) starting at $199 ($80 off). If you want the LTE configuration, the 40mm model is on sale at Amazon, Walmart, and Best Buy starting at $219 (also $80 off), which is about $20 shy of the best price we’ve seen on the entry-level LTE configuration.\nRead our Apple Watch SE (second-gen) review.\nThe best Apple Watch Ultra 2 deals\nApple Watch Ultra 2\n\nWhere to Buy:\n\n $799 $649.99 at Amazon (with Alpine Loop)\n $799 $649.99 at Amazon (with Trail Loop)\n $799 $649.99 at Amazon (with Ocean Band)\n\nThe latest Apple Watch Ultra launched at $799 in September with GPS and LTE support, much like the original model. The ultra-capable smartwatch has the most features, sensors, and ruggedness of any Apple Watch model available thus far, along with a display that’s 50 percent brighter than the first Ultra. The 49mm smartwatch also packs Apple’s S9 SiP and second-gen ultra wideband chips, just like the Apple Watch Series 9, while maintaining long-lasting battery life, precise GPS tracking, and a bevy of diving-friendly sensors.\nThanks to Amazon Prime Day, we recently saw the Apple Watch Ultra 2 dip to its lowest price to date in select configurations. Thankfully, it’s still on sale at Amazon with a Trail Loop, an Alpine Loop, or an Ocean Band starting at around $649.99 ($150 off). You can also pick it up in various configurations at Best Buy starting at $649, if you prefer an alternative retailer.\nRead our Apple Watch Ultra 2 review.\nA note on the more premium models\nWhile all of the Apple Watch models and colorways covered here are encased in aluminum (except the Ultra 2, which has a titanium build), Apple does make a more premium range built out of stainless steel and titanium. These offerings are functionally and aesthetically similar to their aluminum counterparts, with slightly refined colors and finishings — polished for the stainless steel and brushed for the titanium. However, they start at much steeper prices of $699 and above. They, too, can often be found on sale, but they’re never discounted as low as the standard base models, so we don’t include them here.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e9baf53e9d82931d7b2996c993a7ce09093b708c",
      "title": "US military vets are helping Afghans fight deportation",
      "url": "https://www.bbc.com/news/articles/cq68zq24vg5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:10:18.000Z",
      "summary_90w": "",
      "raw": "Afghan refugees in the US say they fear what would happen if they return to their country, which is now controlled by the Taliban.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bad964bc7a725c6f3fe915cfbc371b2230581b55",
      "title": "Empty homes are on the rise. So why aren't they being used to solve the housing shortage?",
      "url": "https://www.bbc.com/news/articles/c3r413l5n57o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:08:39.000Z",
      "summary_90w": "",
      "raw": "There are almost 720,000 empty homes in England. And many more on social housing waiting lists - so why aren't we better using one to help solve the other, and is it a case of a missed opportunity?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93e5c4b97fa991c092f6d9f61052fb2748ae28b2",
      "title": "Sanex shower gel ad banned over racial stereotype",
      "url": "https://www.bbc.com/news/articles/cn92znzx8zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:05:29.000Z",
      "summary_90w": "",
      "raw": "The TV ad depicted two black models with skin problems and a white model without.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7232bc2e7e7a17fb60bcc1210438887801698dd0",
      "title": "Deel scores a lawsuit win, but not against Rippling",
      "url": "https://techcrunch.com/2025/08/19/deel-scores-a-lawsuit-win-but-not-against-rippling/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T22:47:51.000Z",
      "summary_90w": "",
      "raw": "While Deel is calling this a \"Rippling-aligned\" suit, it's not the lawsuit filed by Rippling involving an alleged corporate spy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b1af5801edaeffa9d5d3570dd5d4d4641b60a2d",
      "title": "'Life comes quickly at Martin as Rangers humbled'",
      "url": "https://www.bbc.com/sport/football/articles/cwyekw4x1gno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T22:24:53.000Z",
      "summary_90w": "",
      "raw": "Doubts surrounding Russell Martin's ability to turn Rangers' fortunes around intensify after a \"mortifying\" night at Ibrox, writes Tom English.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6eacfeebbe184b7f37a5785b98c3bab0f95390b7",
      "title": "Google Gemini can now read your Docs aloud",
      "url": "https://www.theverge.com/news/761920/google-docs-gemini-ai-read-aloud",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T21:48:21.000Z",
      "summary_90w": "",
      "raw": "Google Docs will now let you generate an audio version of your documents using AI. In a post announcing the rollout, Google says you can customize Gemini’s AI audio output with different voices and playback speeds.\nThis feature isn’t just for a document’s creator, as Google says readers can access a shared document’s AI-generated audio by selecting the Tool dropdown menu and selecting Audio  > Listen to this tab. Authors can also add a customizable audio button directly in a document by choosing Insert > Audio, which readers can click to start listening.\nGoogle announced plans to let you turn your documents into AI podcasts in April, but this feature seems a lot handier if you just want to listen to what you’ve written. You can only generate audio versions of documents in English and on desktop devices for now.\nGoogle is rolling out audio in Docs to Workspace users with business, enterprise, or education plans, as well as users who have AI Pro and Ultra subscriptions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31c42fc1f7c2d64ab21a64a2b7239c9cc9774d99",
      "title": "Asylum hotel ruling leaves ministers with major headache",
      "url": "https://www.bbc.com/news/articles/cy40wx73mwzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T21:19:08.000Z",
      "summary_90w": "",
      "raw": "The government will now have to find new places to house asylum seekers, while hoping other areas don't take similar legal action.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ed2576ada550701f24fbc66d1dc985f86c2931f",
      "title": "White House considering Budapest for Putin-Zelenskyy bilateral, report suggests – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T21:10:48.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. You can read our latest full report here:\n\nTrump rules out sending US troops to Ukraine as part of security guarantees\n\nVolodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February, which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough.\nIn his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports.\nA meeting between Zelenskyy and Putin ... could it finally happen?\nThe need for security guarantees agreed – but details unclear\nTrump believes he is very good at solving conflicts\nA potential boost for the US arms industry\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b2ad3bdacc5dc1dd0b032cae42d844bc8d3c82c",
      "title": "Trump under pressure as obstacles to progress on Ukraine persist",
      "url": "https://www.bbc.com/news/articles/c776edpr10eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T20:48:56.000Z",
      "summary_90w": "",
      "raw": "Meetings in Alaska and Washington were high on pomp and low on breakthroughs, but there were two potentially significant developments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d88bdc7a97987da39cc5b362451a5d3b29e3d645",
      "title": "Google announced the next step in its nuclear energy plans ",
      "url": "https://www.theverge.com/news/761809/nuclear-energy-google-ai-advanced-reactor-kairos-tva-electricity-utility",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T20:45:58.000Z",
      "summary_90w": "",
      "raw": "Google is one step closer to reaching its nuclear ambitions now that it’s working with public power utility Tennessee Valley Authority (TVA) to purchase electricity from a next-generation reactor. It’s the first power purchase agreement for technology this advanced that a US utility has made, according to the companies. \nThe plan is for TVA to buy electricity from a reactor being developed by engineering company Kairos Power in Oak Ridge, Tennessee. Once the reactor is up and running, expected in 2030, it should start supplying electricity to the local grid that serves Google data centers in Tennessee and Alabama. \n\nIf they manage to pull this all off, it could help jumpstart a whole new era for nuclear energy\n\n\nIf they manage to pull this all off, it could help jumpstart a whole new era for nuclear energy in the US. The nation’s current fleet of nuclear reactors uses decades-old technology that has struggled to compete with cheap electricity from gas-fired power plants and solar and wind farms. Kairos Power is building one of the first reactors that proponents hope can usher in a resurgence of nuclear energy, and meet rising electricity demand from Big Tech and AI.\nThe announcement follows news that Google would purchase electricity from “multiple” small modular reactors designed by Kairos Power. The Hermes 2 demonstration plant is the first reactor being developed under that agreement. It expands on the first Hermes demonstration reactor that Kairos broke ground on in July of last year after receiving the first construction permit from the Nuclear Regulatory Commission for a non-water-cooled reactor in more than half a century. \nUnlike conventional reactors that use water, Kairos’ technology uses molten fluoride salt as a coolant. Since the reactor’s molten salt coolant has a much higher boiling point than water and doesn’t reach a boil, the reactor can operate at relatively low pressure. A low-pressure reactor like Kairos’ technology is supposed to cut costs for nuclear energy by getting rid of the need to build big high-pressure containment structures. \nOak Ridge, Tennessee — where Kairos is building Hermes 2 — was once the headquarters for the Manhattan Project. Now, instead of housing facilities enriching uranium for the first atomic bombs, Oak Ridge has become a hub for nuclear energy projects and research. \nEventually, Google aims to help Kairos deploy 500 megawatts of new nuclear capacity in the US by 2035. For context, America’s 94 operating nuclear reactors had a combined capacity of 97,000MW in 2024 and accounted for just under 20 percent of the US electricity mix. Hermes 2 is supposed to reach a capacity of 50MW. \nCompanies that generate carbon pollution-free electricity, like nuclear energy and renewables, can make money by selling the electricity they provide to the power grid and by selling so-called clean energy attributes that are like separate certificates representing the environmental benefits of avoiding fossil fuel emissions. Google will receive clean energy attributes from the Hermes 2 plant through TVA.\nTech companies with climate goals often buy clean energy attributes to try to cancel out the pollution caused by their electricity use. By matching its electricity use with those certificates, a company might claim that it runs on clean energy even if it’s plugged into a power grid that still runs on dirty energy. Extra income from clean energy attributes is supposed to help developers add more carbon pollution-free power to the grid (although research has shown that the environmental benefits are often overestimated). Google’s carbon emissions rose again last year as it ramps up its AI offerings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1eace25e4d7ea92a3b06732ddbba121a0b0a13c8",
      "title": "All the news from Gamescom Opening Night Live 2025",
      "url": "https://www.theverge.com/news/760975/gamescom-opening-night-live-2025-news-trailers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T20:26:19.000Z",
      "summary_90w": "",
      "raw": "North Rhine-Westphalia, Cologne: Presenter Geoff Keighley at Gamescom Opening Night Live 2023 | Photo Sascha Thelen / picture alliance via Getty Images\t\n\nWhile it didn’t feature much of Silksong outside of a brief tease — though there’s plenty more coming very soon — the main event for Gamescom, Opening Night Live, did have plenty to show off during its two hour runtime.\nMuch of it was expected and teased ahead of time, including fresh looks at Call of Duty: Black Ops 7, Ghost of Yōtei, and the second season of the Fallout TV series. There was also a solid dose of horror with games like Resident Evil Requiem, Silent Hill F, and Cronos: The New Dawn.\nThese were joined by a handful of fun surprises like a roguelike about doomscrolling from Monkey Island creator Ron Gilbert and a hand-drawn anime based on Sekiro.\nIf you couldn’t watch the whole thing live, here are the highlights. (And be warned, another Geoff Keighley-hosted event isn’t too far off: this year’s edition of The Game Awards is happening on December 11th.)\n\n\n\t\t\t\t\t\nRequiem for a scream.\n\t\t\t\nMore Legends.\n\t\t\t\nRemember the Sunwell.\n\t\t\t\nSome more horrors.\n\t\t\t\nWhat the (Silent Hill) F.\n\t\t\t\nRon Gilbert is making a roguelike.\n\t\t\t\nDispense some Wasteland Justice this December.\n\t\t\t\nWant to get nuts? Let’s get nuts.\n\t\t\t\nMonster Hunter rides (a chocobo).\n\t\t\t\nSekiro comes to the small screen.\n\t\t\t\nIt’s going to be a busy fall for shooters.\n\t\t\t\n“Silksong is real.”\n\t\t\t\nRoutine is still alive.\n\t\t\t\nDotemu’s new fantasy beat ’em launches on October 9th.\n\t\t\t\nSkate on a train.\n\t\t\t\nDotemu is making a Battlestar Galactica game.\n\t\t\t\nGamescom’s Opening Night Live pre-show is about to start.\n\t\t\t\nGet ready for Silksong’s ‘special announcement’ on Thursday\n\t\t\t\nHow to watch Gamescom Opening Night Live 2025",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3e3506841de89996b28a16a09ebb9c8ddce57669",
      "title": "Microsoft employees occupy headquarters in protest of Israel contracts",
      "url": "https://www.theverge.com/ai-artificial-intelligence/761731/pro-palestinian-protests-microsoft-headquarters-redmond-washington-no-azure-tech-for-apartheid",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-19T20:22:39.000Z",
      "summary_90w": "",
      "raw": "On Tuesday, a group of current and former Microsoft employees, as well as community members, took over a plaza at Microsoft's headquarters in Redmond, Washington, as part of a No Azure for Apartheid protest. They declared the area a \"Liberated Zone\" encampment and said they had changed its name from East Campus Plaza to \"The Martyred Palestinian Children's Plaza.\" The organization, which announced and distributed pictures of the takeover in a press release, said around 50 people were in attendance at the start of the event.\nThe protesters set up tents and artistic homages to the losses in Gaza, including shrouds and a large plate that reads …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "07ae72a57aca8d210e3bfb2fbe31cab2c31739ed",
      "title": "Chili's has staged a remarkable revival in sales",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506272/chilis-has-staged-a-remarkable-revival-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T20:21:58.000Z",
      "summary_90w": "",
      "raw": "The 50-year-old casual dining chain Chili's has posted five straight quarters of double digit sales increases. NPR's Mary Louise Kelly talks with Slate's Dan Kois about what's behind the brand's turnaround.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5a14aaaf1c9c88ffb62e369b8c2b9191826b4a3f",
      "title": "'Broken promises' - the full story of what's going on with Isak, Newcastle and Liverpool",
      "url": "https://www.bbc.com/sport/football/articles/ce934rgyg57o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T20:21:56.000Z",
      "summary_90w": "",
      "raw": "Alexander Isak says promises have been \"broken\" by Newcastle United and \"the relationship can't continue\" as he looks to force through an exit this summer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a14aaaf1c9c88ffb62e369b8c2b9191826b4a3f",
      "title": "'Broken promises' - what's going on with Isak, Newcastle and Liverpool?",
      "url": "https://www.bbc.com/sport/football/articles/ce934rgyg57o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T20:21:56.000Z",
      "summary_90w": "",
      "raw": "Alexander Isak says promises have been \"broken\" by Newcastle United and \"the relationship can't continue\" as he looks to force through an exit this summer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "078f4ee105358c0200b970baadd4ab1b5a835f7e",
      "title": "Watch: Moment debris skyrockets after gas line explosion",
      "url": "https://www.bbc.com/news/videos/c9qy51xwxwqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T19:49:19.000Z",
      "summary_90w": "",
      "raw": "Three firefighters were injured in the North Carolina explosion, which resulted from a car crashing into a building's gas line.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T19:37:56.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jeanpormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d83408850b2dda18022c7e1b3eb20a61821a1364",
      "title": "Israel demands release of all Gaza hostages, casting doubt on ceasefire proposal",
      "url": "https://www.bbc.com/news/articles/cjeynvp409vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T19:28:51.000Z",
      "summary_90w": "",
      "raw": "It comes a day after Hamas said it accepted a proposal for a 60-day truce, during which around half of the 50 hostages would be freed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64df78f5090ce56ea6dd913e4fb069f1138b44fb",
      "title": "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more",
      "url": "https://techcrunch.com/2025/08/19/made-by-google-2025-how-to-watch-google-debut-the-pixel-10-pixel-watch-4-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T19:27:23.000Z",
      "summary_90w": "",
      "raw": "Google is hosting its Pixel 10 event next week. Learn how to watch the tech giant reveal its new mobile devices and what else you can expect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "93e6d03c7c4e4531f649edf86d10c6cdf123c005",
      "title": "Peruvian woman accused of trying to smuggle cocaine into Bali using sex toy",
      "url": "https://www.theguardian.com/world/2025/aug/19/peruvian-woman-bali-cocaine-smuggling",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T19:23:25.000Z",
      "summary_90w": "",
      "raw": "Officers say they found 1.4kg of drug inside toy in woman’s underwear and also accused her of hiding ecstasy pills\nA Peruvian woman has been arrested in Bali after allegedly trying to smuggle cocaine into the Indonesian resort island using a sex toy and hiding drugs in her underwear, police said.\nThe 42-year-old, identified only by her initials NS, arrived at Bali’s international airport from Qatar on 12 August when authorities became suspicious.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31046a93207dc6182e4b89c97d3727c63f49655e",
      "title": "Appeals court says NLRB structure unconstitutional, in a win for SpaceX",
      "url": "https://techcrunch.com/2025/08/19/appeals-court-says-nlrb-structure-unconstitutional-in-a-win-for-spacex/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:42:59.000Z",
      "summary_90w": "",
      "raw": "SpaceX scored a win in a decision from the Fifth Circuit over the labor board's structure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "05652f0296eef23ac43f283c2f5203c0500df8e0",
      "title": "Home Depot keeps quiet on immigration raids outside its doors",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5504124/home-depot-earnings-immigration-raids-day-laborers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T18:32:19.000Z",
      "summary_90w": "",
      "raw": "The home-improvement chain is now one of the companies most caught up in Trump's immigration crackdown. The retailer's history with day laborers is long. So far, it's choosing to keep its distance.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7047171e0b158abbe3dbac478a52fd09ae3601af",
      "title": "Google pays $30M to settle lawsuit over children’s YouTube data",
      "url": "https://techcrunch.com/2025/08/19/google-pays-30m-to-settle-lawsuit-over-childrens-youtube-data/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:28:12.000Z",
      "summary_90w": "",
      "raw": "Google has agreed to pay $30M to settle a lawsuit over children's data collection, though the company denies wrongdoing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25ec24a5a71103448129c27b82f07522bb934683",
      "title": "Meta is shaking up its AI org, again",
      "url": "https://techcrunch.com/2025/08/19/meta-is-shaking-up-its-ai-org-again/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:27:37.000Z",
      "summary_90w": "",
      "raw": "On Friday, The Information reported that Meta was preparing to tear down its existing AI org and reorganize it into four new groups. Four days later, the change has been made official with an internal memo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "58735733ad9aafeacf9afa93d36ad2d28a4337bf",
      "title": "Discover how developer tools are shifting fast with Lauri Moore and David Cramer at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/19/discover-how-developer-tools-are-shifting-fast-with-lauri-moore-and-david-cramer-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T18:21:34.000Z",
      "summary_90w": "",
      "raw": "From no-code to AI-assisted dev environments, “vibe coding” is changing how early-stage startups build — and who they need to hire. The once-standard idea of landing a “10x engineer” as your first critical hire is getting a serious reality check with Lauri Moore (Bessemer) and David Cramer (Sentry) on the Builder Stage at TechCrunch Disrupt 2025 in October at San Francisco's Moscone West.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bae423d0b275192bd14741dba54b1b8cf6041f9a",
      "title": "Databricks CEO says fresh $1B will help him attack a new AI database market",
      "url": "https://techcrunch.com/2025/08/19/databricks-ceo-says-fresh-1b-will-help-him-attack-a-new-ai-database-market/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:48:35.000Z",
      "summary_90w": "",
      "raw": "The round, which pushes Databricks' valuation to $100B, was co-led by Insight Partners and Thrive. CEO Ali Ghodsi says he's found an enormous untapped AI agent market to spend the funds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "878a734cf4cb0657d6445f7e1e51f6e9741dfb86",
      "title": "Meta rolls out AI-powered translations to creators globally, starting with English and Spanish",
      "url": "https://techcrunch.com/2025/08/19/meta-rolls-out-ai-powered-translations-to-creators-globally-starting-with-english-and-spanish/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:20:01.000Z",
      "summary_90w": "",
      "raw": "The new feature, which is available in any market where Meta AI is available, allows creators to translate content into other languages for a broader audience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d366f5c713c5a2a3905c2ed815b3aeb3cef9a343",
      "title": "Your next customer is on the TechCrunch Disrupt 2025 expo floor — will they find you or your competitor?",
      "url": "https://techcrunch.com/2025/08/19/your-next-customer-is-on-the-techcrunch-disrupt-2025-expo-floor-will-they-find-you-or-your-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T17:07:51.000Z",
      "summary_90w": "",
      "raw": "There’s still time to book your exhibit table, but space is disappearing fast. The brands that move now will be the ones getting the face time, the leads, and the traction that matters most.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1237a488c7fed6bba5b67688d94e11d570a1e3fc",
      "title": "Why Oval Office map has played crucial role in Trump's view of Ukraine war",
      "url": "https://www.bbc.com/news/articles/cjeynw8jppdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T17:06:59.000Z",
      "summary_90w": "",
      "raw": "Ukraine's leader has taken issue with the American map, because of the amount of control it gives Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc595540d80662f85fbc4697aadf01a3a421a495",
      "title": "Diphtheria cases spiralling in Somalia, health officials warn",
      "url": "https://www.theguardian.com/world/2025/aug/19/diphtheria-cases-spiralling-somalia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:46:12.000Z",
      "summary_90w": "",
      "raw": "MSF says low vaccination coverage and poor living conditions driving spread of deadly bacterial disease\nDiphtheria cases are rapidly increasing across Somalia, officials and humanitarians warn, with children accounting for more than 97% of the cases.\nDiphtheria, a highly contagious and deadly bacterial disease that mainly affects children, is preventable by a vaccine. While Somalia has improved vaccination rates in recent years, the medical charity Médecins Sans Frontières (MSF) blames the uptick in cases on persisting immunisation gaps.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a69509bcd96ce8786a899f4a9734c85aef21c2ae",
      "title": "Brazil issues last-ditch plea for countries to submit climate plans ahead of Cop30",
      "url": "https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:38:38.000Z",
      "summary_90w": "",
      "raw": "Only 28 countries have submitted carbon-cutting proposals to the UN, with some of the biggest emitters yet to produce plans\nBrazil has issued an urgent call for all countries to come forward with strengthened national plans on the climate, in a last-ditch attempt to meet a key September deadline.\nOnly 28 countries have so far submitted carbon-cutting proposals to the UN, with some of the biggest emitters of greenhouse gases – including China and the EU – still to produce their plans.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38e3f5c352bfe719420641dd1978d8d1c0937c75",
      "title": "India’s government to propose blanket ban on real-money gaming",
      "url": "https://techcrunch.com/2025/08/19/indias-government-to-propose-blanket-ban-on-real-money-gaming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T16:03:34.000Z",
      "summary_90w": "",
      "raw": "The Indian government plans to ban real-money games — whether skill- or chance-based — under its proposed online gaming regulation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a60993e44bb84506f13a10b433643a37e3fb10e",
      "title": "TechCrunch Mobility: Ford’s big bet",
      "url": "https://techcrunch.com/2025/08/19/techcrunch-mobility-fords-big-bet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T16:02:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility, your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a14344caf7151994169632bcfb6d0f9797a9d04d",
      "title": "Finnish politician dies in parliament in Helsinki",
      "url": "https://www.bbc.com/news/articles/cqxgde2gv31o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T16:01:42.000Z",
      "summary_90w": "",
      "raw": "Eemeli Peltonen's sudden death shocks Finland, with politicians on all sides expressing their sadness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56aef5e2652c30568616e3f045aff7d2423ef362",
      "title": "Aalo Atomics raises $100M to build a microreactor and data center together",
      "url": "https://techcrunch.com/2025/08/19/aalo-atomics-raises-100m-to-build-a-microreactor-and-data-center-together/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T15:41:41.000Z",
      "summary_90w": "",
      "raw": "Nuclear startup Aalo Atomics plans to turn on its first power plant, the 50-megawatt Aalo-X, in the summer of 2026. It's an aggressive timeline that bucks nuclear industry trends.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c83215dd1b60362dbf7df75be0608a4595067a50",
      "title": "Air Canada flights slowly resume after flight attendants agree to end their strike",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507052/air-canada-flights-resume-flight-attendants-union-strike",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T15:25:59.000Z",
      "summary_90w": "",
      "raw": "The flight attendants' union said a new agreement guarantees members will be paid for work performed while planes are on the ground, resolving one of the major issues that drove the strike.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2aa4a5e3ad1f186545972c6bc877dff8f101462f",
      "title": "Peruvian woman accused of smuggling drugs in sex toy in Bali",
      "url": "https://www.bbc.com/news/articles/cn92eywlwjlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T15:22:09.000Z",
      "summary_90w": "",
      "raw": "The 42-year-old allegedly also concealed drugs in her underwear, police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "267dc77071083d12db91173e312a9f0de4142fe4",
      "title": "Conservative leader wins Canada byelection, regaining parliament seat",
      "url": "https://www.theguardian.com/world/2025/aug/19/pierre-poilievre-wins-canada-parliament",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:11:51.000Z",
      "summary_90w": "",
      "raw": "Pierre Poilievre returns to House of Commons after shock April loss and narrower margin in Tory stronghold\nCanada’s Conservative leader, Pierre Poilievre, has won a closely watched byelection in the province of Alberta, giving him a chance to return to parliament after suffering a shock defeat in April’s federal election.\nPoilievre finished with 80.4% of the vote after Monday’s election in the riding of Battle River-Crowfoot, in the deeply Conservative western province.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d2154624fe3f1c4fb172c13622a6d77c3857e86",
      "title": "Why Ukraine's first lady wrote Melania Trump a letter",
      "url": "https://www.bbc.com/news/articles/czd08nj08r3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T14:52:20.000Z",
      "summary_90w": "",
      "raw": "Ukraine's First Lady Olena Zelenska has thanked US First Lady Melania Trump for imploring Vladimir Putin to protect children.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3664c144879e93267eb38274477272da8e929240",
      "title": "US spy chief says UK has dropped its Apple backdoor demand",
      "url": "https://techcrunch.com/2025/08/19/us-spy-chief-says-uk-has-dropped-its-apple-backdoor-demand/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T14:25:33.000Z",
      "summary_90w": "",
      "raw": "Tulsi Gabbard said that President Donald Trump and Vice President JD Vance also participated in the negotiations with the U.K. government over its once-secret demand to Apple.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f334c24ff184c7d64f76db3e500a3e3fa44e2b6b",
      "title": "Son of Norway's crown princess charged with rape and abuse",
      "url": "https://www.bbc.com/news/articles/cvg3ke05355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T14:18:52.000Z",
      "summary_90w": "",
      "raw": "Marius Borg Høiby is charged with 32 offences and could face up to 10 years in prison if found guilty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97f7fdde2d1b3b6f064f429e0e6ee1f92721a11b",
      "title": "Mediators optimistic Israel will accept ceasefire deal that is ‘almost identical’ to one they earlier agreed – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/aid-ship-food-gaza-cyprus-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T14:09:04.000Z",
      "summary_90w": "",
      "raw": "Qatar says no breakthrough has yet been made but Hamas has given ‘positive response’\nThe UN’s human rights office on Tuesday condemned a far-right Israeli minister for taunting a Palestinian prisoner in his cell and sharing the footage online, Reuters reports.\nNational security minister Itamar Ben-Gvir published a video on Friday last week showing him confronting Marwan Barghouti, the most high-profile Palestinian detainee in Israeli custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63e38b2b291f45efcd26bf53f0d79cbcd8a39d1b",
      "title": "CPG startup Keychain snags $30M to build in India, grow in the US",
      "url": "https://techcrunch.com/2025/08/19/cpg-startup-keychain-snags-30m-to-build-in-india-grow-in-the-u-s/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Keychain doesn't have a single customer in India — but the team helping it scale across North America and beyond is entirely based in Gurugram, a suburb of New Delhi.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76f7c791877dd96391ea7d2443d0f28f19c3cdc0",
      "title": "Air Canada flight attendants reach ‘tentative’ deal with airline to end strike",
      "url": "https://www.theguardian.com/world/2025/aug/19/air-canada-strike-tentative-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T13:31:37.000Z",
      "summary_90w": "",
      "raw": "Strike over wages and ground work has cancelled travel for 500,000 people worldwide\nAir Canada flight attendants say they have reached a “tentative” deal with the airline to end a strike over wages and ground work that has cancelled travel for half a million people worldwide.\nRoughly 10,000 flight attendants walked off the job after midnight Saturday, insisting Air Canada had failed to address their demands for higher pay and compensation for unpaid ground work, including during boarding.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfeb7da305893b01fa68da17c982770381812c1d",
      "title": "TikTok’s latest feature lets college students find and connect with classmates",
      "url": "https://techcrunch.com/2025/08/19/tiktoks-latest-feature-lets-college-students-find-and-connect-with-classmates/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T13:00:00.000Z",
      "summary_90w": "",
      "raw": "In a move reminiscent of Facebook's early days, TikTok is launching a new feature that allows college students to find and connect with others on their campus.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98d0a5e7929dee93e280ba9e8b0cad07817f2ad1",
      "title": "Nvidia said to be developing new, more powerful AI chip for sale in China",
      "url": "https://techcrunch.com/2025/08/19/nvidia-said-to-be-developing-new-more-powerful-ai-chip-for-sale-in-china/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T12:58:28.000Z",
      "summary_90w": "",
      "raw": "Nvidia is apparently putting together a new AI chip meant for sale in China that's half as powerful as its flagship B300 Blackwell GPU. The new chip would be more powerful than the H20 GPUs the company is currently allowed to sell in the country.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a43d3245a58c4a9f971d980091296e45bb0f598a",
      "title": "Israel to respond by Friday over Gaza truce plan accepted by Hamas",
      "url": "https://www.theguardian.com/world/2025/aug/19/israel-to-respond-by-friday-gaza-truce-plan-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T12:31:11.000Z",
      "summary_90w": "",
      "raw": "Israel under pressure to accept ceasefire proposal that is said to be almost identical to earlier US-backed plan\n\nMiddle East crisis – live updates\n\nIsrael has said it will deliver its response to international mediators by Friday over a new Gaza ceasefire plan accepted by Hamas amid mounting pressure for a truce in a war that has claimed more than 62,000 Palestinian lives.\nAfter mass protests in Israel demanding a deal to secure the release of the remaining 20 living Israeli hostages held in Gaza, it appeared that Hamas had reduced its demands over a prisoners-for-hostages exchange as well as over the scope of an Israeli-demanded “security buffer zone”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4b4289d6185268e2a44eec9b53b76a519daa4e4",
      "title": "Texas police hunt convict 'mistakenly' freed from jail",
      "url": "https://www.bbc.com/news/articles/cd0d32ezn17o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T11:39:01.000Z",
      "summary_90w": "",
      "raw": "Police say the man was sentenced to jail for assaulting a family member and evading arrest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cab4fe84a361c9bfe01b4231a2e98da21916d33d",
      "title": "Figure’s IPO filing marks Mike Cagney’s return to public markets",
      "url": "https://techcrunch.com/2025/08/19/figures-ipo-filing-marks-mike-cagneys-return-to-public-markets/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T11:23:41.000Z",
      "summary_90w": "",
      "raw": "Figure Technology, a 7-year-old blockchain-based lending company, has filed a registration statement with the SEC for an IPO of its Class A common stock. The filing offers a chance at vindication for Figure co-founder Mike Cagney.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f39360be6cbd9d5dede725c2eef53f1637bc09e5",
      "title": "AI crawler Firecrawl raises $14.5M, is still looking to hire agents as employees",
      "url": "https://techcrunch.com/2025/08/19/ai-crawler-firecrawl-raises-14-5m-is-still-looking-to-hire-agents-as-employees/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Firecrawl nabbed Shopify’s CEO Tobias Lütke as an investor from a gutsy email after they discovered he was using the product.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "75ec4997089f067bd2ee0c5b39e2044aca0a6fda",
      "title": "Eight Sleep raises $100M to expand its AI-powered sleep tech",
      "url": "https://techcrunch.com/2025/08/19/eight-sleep-grabs-100m-to-bring-ai-into-your-bed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "The sleep tech company raised  from HSG, Valor Equity Partners, Founders Fund, Y Combinator, and big F1 names like Charles Leclerc and Zak Brown.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c9a35fa0fca7617c0aaa78f64582f17977beb1f6",
      "title": "Spotify’s latest feature lets you add your own transitions to playlists",
      "url": "https://techcrunch.com/2025/08/19/spotifys-latest-feature-lets-you-add-your-own-transitions-to-playlists/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-19T10:00:00.000Z",
      "summary_90w": "",
      "raw": "The new options are designed to appeal to playlist experts and other music fans, who have collectively created nearly 9 billion playlists on Spotify's platform to date.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c4dd89487e14038f0d6692c2b2472b307a2a0d1",
      "title": "Businesses face 'chaos' as EPA aims to repeal its authority over climate pollution",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5501576/climate-pollution-epa-regulation-endangerment-finding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T09:39:04.000Z",
      "summary_90w": "",
      "raw": "A lot of companies want the EPA in charge of setting national climate regulations because it helps shield them from lawsuits and creates a predictable environment in which to make investments.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bc1af1f6442a5f2e3aeb052a80ae8ba3cb66383c",
      "title": "Canada's Conservative leader wins back parliament seat",
      "url": "https://www.bbc.com/news/articles/c0l6jz8xlplo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T09:02:40.000Z",
      "summary_90w": "",
      "raw": "Poilievre won an Alberta by-election with 80% of the vote after losing his seat in another riding in April's general election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "605366d5f4a45811bb4207b90aa75c9622a1e7e0",
      "title": "How algorithms are changing the way we speak",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506168/how-algorithms-are-changing-the-way-we-speak",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Social media has birthed an entire lexicon replicated by millions online — even if these words don’t actually mean skibidi. On today’s show, we talk to author Adam Aleksic about how TikTok and Instagram's engagement metrics, and viral memes, are rewiring our brains and transforming language at warp speed.\nAdam Aleksic’s book is Algospeak: How Social Media is Transforming the Future of Language \nRelated episodes: \nWhat we’re reading on the beach this summer   \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.  \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b73820569f15be3b03831e14bc5c89997e3d438d",
      "title": "Four key takeaways from Ukraine talks in Washington",
      "url": "https://www.bbc.com/news/articles/c5yp4jggrj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T01:01:32.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky managed to avoid another disastrous Oval Office meeting with Donald Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0323e285f2514b9889070e1eea4f3b299dda1df",
      "title": "Soldier found guilty of attempted espionage in New Zealand’s first spying conviction",
      "url": "https://www.theguardian.com/world/2025/aug/19/new-zealand-military-court-finds-soldier-guilty-of-attempted-espionage",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T00:06:24.000Z",
      "summary_90w": "",
      "raw": "Court martial heard soldier was caught offering to share military base maps and photographs to an undercover officer of an unnamed foreign nation\nA military court has convicted a New Zealand soldier of attempted espionage for a foreign power – the first spying conviction in the country’s history.\nThe soldier was caught offering to pass military base maps and photographs to an undercover officer posing as an agent for the foreign nation, the court martial heard.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62103f76e3604615beb5a2edb0f1a55719d63a89",
      "title": "Has Trump convinced Zelensky to meet Putin?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lxq70r?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-18T23:57:00.000Z",
      "summary_90w": "",
      "raw": "And can Trump convince Putin to meet Zelensky?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ff38cd0bea88df8d5c6b29a0a1612692a7f7b505",
      "title": "'No-one comes for us': The women trapped in Afghanistan's mental health system",
      "url": "https://www.bbc.com/news/articles/c80dg700dego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T22:19:29.000Z",
      "summary_90w": "",
      "raw": "Accessing treatment in an Afghan mental health facility is difficult - but getting out can be harder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d97caa4623f1eeef8d23be5edec308c858628351",
      "title": "'SNL' castmember Bowen Yang shares a piece of 'cultural contraband' from his youth",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5503406/bowen-yang-snl-wicked-las-culturistas",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T18:45:34.000Z",
      "summary_90w": "",
      "raw": "Growing up with immigrant parents, first in Canada and then in the U.S., Yang was \"obsessed\" with pop culture and Saturday Night Live. Now he's up for an Emmy for his performances on the venerated sketch series.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2e2f2cf4dc59303eb3e623bda9307732ab1cdc03",
      "title": "Flight attendant union leaders ‘ready to go to jail’ as Air Canada strike outlawed",
      "url": "https://www.theguardian.com/world/2025/aug/18/air-canada-flight-attendants-strike-illegal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:58:06.000Z",
      "summary_90w": "",
      "raw": "Arbitrator orders 10,000 striking staff back to work after government intervenes – unconstitutionally, union says\nUnion leaders representing 10,000 striking flight attendants have said they would be willing to go to jail rather than comply with an order to return to work, as Canada’s federal government seeks to end a bitter contract dispute that has halted hundreds of summer flights and stranded travellers around the world.\nSpeaking to reporters on Monday, the national president of the Canadian Union of Public Employees said members would remain on the picket lines as part of a work stoppage that has halted Air Canada’s national and international operations during its busiest season.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08ccd99774c3563781864bf5565d2da7215b123b",
      "title": "Zambian president’s feud with late rival continues over funeral plans",
      "url": "https://www.theguardian.com/world/2025/aug/18/zambian-presidents-feud-with-late-rival-continues-over-site-of-funeral",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:50:07.000Z",
      "summary_90w": "",
      "raw": "Family of Edgar Lungu trying to prevent repatriation of his body for state funeral presided over by his successor\nA furious row is raging over whether the Zambian president, Hakainde Hichilema, will preside over the funeral of his predecessor, Edgar Lungu, as the former president’s family wage a legal battle in South Africa to try to prevent his body from being repatriated.\nThe legal fight marks the latest twist in a feud between the two men that goes back at least a decade and has now outlasted the former president, who died in South Africa in June aged 68 while being treated for an undisclosed illness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "facc3062cf8edcf54b3e448d7a5c14915d4d29bc",
      "title": "Hamas tells mediators it approves latest Gaza ceasefire proposal – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/18/israel-protests-government-new-offensive-gaza-city-middle-east-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Hamas official tells Reuters news agency it has approved latest Gaza ceasefire proposal. This live blog is closed\n\nHamas says it accepts proposal for Gaza ceasefire and release of hostages\n\nNorway’s sovereign wealth fund, the world’s largest, said on Monday it had decided to exclude six companies with connections to the West Bank and Gaza from its portfolio, following a review of its Israeli investments.\nThe $2tn wealth fund did not name the companies it had decided to exclude, but said these would be made public once the divestment was completed, Reuters reports.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aeb8cda62bcc24e928b31557fd8617374a0c53b0",
      "title": "Hamas says it accepts proposal for Gaza ceasefire and release of hostages",
      "url": "https://www.theguardian.com/world/2025/aug/18/hamas-gaza-proposed-ceasefire-hostage-release-deal-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:44:24.000Z",
      "summary_90w": "",
      "raw": "Deal would include 60-day halt to violence and exchange of half of living Israeli hostages for Palestinian prisoners\nHamas officials say they have accepted a proposal for a Gaza ceasefire deal that would include the release of half of the approximately 20 remaining living Israeli hostages as part of a phased resolution to the war, as Gaza health officials said 62,000 Palestinians had died in the 22 months of war.\nThe proposed deal follows negotiations between Hamas and Egyptian and Qatari officials that have been taking place in Cairo in recent days, and comes after the Israeli prime minister, Benjamin Netanyahu, was confronted on Sunday by Israel’s biggest protests of the war, which called for a deal to secure the release of the hostages.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ebeba55e5936b3ddf9dbaeab1d28216b860c4ac7",
      "title": "'No-one was expecting this': European leaders rush to US to help Ukraine avoid 'capitulation'",
      "url": "https://www.bbc.com/news/articles/c9d0v8ljw3no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T15:31:36.000Z",
      "summary_90w": "",
      "raw": "The heads of state hope to stop Trump from threatening long-term European security, writes James Landale.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8df0cdecbec83f45ba9c846e7fef2baa83c3362",
      "title": "Newsmax pays $67 million to settle defamation case linked to 2020 election coverage",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5506062/newsmax-pays-67-million-to-settle-defamation-case-linked-to-2020-election-coverage",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T14:37:16.000Z",
      "summary_90w": "",
      "raw": "The right-wing news channel Newsmax has agreed to pay $67 million to Dominion Voting Systems over its coverage of the 2020 presidential election. A trial had been scheduled for October.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bdbfa0c9fdb16e4002376c8a592da8973557bc1b",
      "title": "Netanyahu criticises protests in Israel against his handling of Gaza war",
      "url": "https://www.theguardian.com/world/2025/aug/18/netanyahu-criticises-protests-israel-handling-gaza-war-hostages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T14:34:44.000Z",
      "summary_90w": "",
      "raw": "Israeli PM suggests demonstrators are toughening Hamas’s stance and delaying the release of hostages\nBenjamin Netanyahu has criticised massive street protests against his handling of the Gaza war, and failure to secure the release of remaining Israeli hostages, suggesting demonstrators were giving comfort to Hamas’s position in negotiations.\nThe Israeli prime minister made his comments against the backdrop of the largest protests in almost two years of war, with estimates that upwards of 400,000 people joined marches across Israel on Sunday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d91c7f44192f3bdf5878dae3145b62c6abf303",
      "title": "'The water had no mercy': Hundreds killed as floods ravage north Pakistan",
      "url": "https://www.bbc.com/news/articles/ce3jeed2798o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T11:00:34.000Z",
      "summary_90w": "",
      "raw": "BBC visited villages which were wiped out overnight by rains, flash floods and landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2bec0a308338e4dd5679e1c881b2bc6e8bc8556",
      "title": "Swatch pulls ‘slanted eye’ ad after backlash in China",
      "url": "https://www.theguardian.com/world/2025/aug/18/swatch-slanted-eye-ad-backlash-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T08:50:48.000Z",
      "summary_90w": "",
      "raw": "Calls for boycott after Swiss watchmaker becomes latest western brand accused of racist imagery\nThe Swiss watchmaker Swatch has apologised and removed an advert featuring a model pulling the corners of his eyes, after the image prompted accusations of racism and calls for a boycott on Chinese social media.\nInternet users heavily criticised the “slanted eye” gesture made by the Asian male model as racist.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a87e9a4149f60348f9dee0c7be2b854467e25df6",
      "title": "I saw a kaleidoscopic light before going blind, says survivor of Laos methanol poisoning",
      "url": "https://www.bbc.com/news/articles/czd0qlmjl05o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T05:00:45.000Z",
      "summary_90w": "",
      "raw": "Calum Macdonald and the families of three people who died in South East Asia call on the Foreign Office for clearer travel advice.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e57146890e6bf6d8e15e4e8490858f60be279f0b",
      "title": "Bindi Irwin says she was made to feel 'ashamed' of endometriosis pain",
      "url": "https://www.bbc.com/news/articles/c209dz1yd22o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T02:59:35.000Z",
      "summary_90w": "",
      "raw": "Her story has reignited conversations about the condition that affects about one in ten women.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cdb6f651677c52190e7a5e619b86d8c220462109",
      "title": "Croatian ultra-nationalist mega-gig exposes divided society",
      "url": "https://www.bbc.com/news/articles/cz60nyp3714o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-17T23:00:29.000Z",
      "summary_90w": "",
      "raw": "Half a million people bought tickets to singer Thompson's July concert in Zagreb.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d433daa9d7e7dc43ff5cf3e6f3cdfcd3b097486",
      "title": "Weather tracker: Typhoon Podul pounds southern Taiwan",
      "url": "https://www.theguardian.com/environment/2025/aug/15/weather-tracker-typhoon-podul-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T09:47:14.000Z",
      "summary_90w": "",
      "raw": "One person dies after storm whips up waves, while temperatures approach 50C as heatwave grips Middle East\nTyphoon Podul crossed southern Taiwan on Wednesday with wind speeds of up to 110mph (177km/h), equivalent to a category 2 hurricane.\nPodul had developed a week earlier, near the Northern Mariana Islands, and tracked west across the Philippine Sea, achieving typhoon status on Tuesday before making landfall in south-east Taiwan the following day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "28e0f3dca2f926cc4a3a67bf07740f555d5790a2",
      "title": "The con that tricked dozens into working for a fake company",
      "url": "https://www.bbc.co.uk/iplayer/episode/m0014sbz/jobfished?at_mid=W7tKuetXFs&at_campaign=Jobfished&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0014sbz&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Jobfished&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2024-02-21T06:00:00.000Z",
      "summary_90w": "",
      "raw": "Catrin Nye investigates the glamorous company that faked its own existence.",
      "topics": [
        "World"
      ]
    }
  ]
}