{
  "version": "1756141973171",
  "generatedAt": "2025-08-25T17:12:53.171Z",
  "items": [
    {
      "id": "dc701d33b9af4c894215026515cfe9b282caf283",
      "title": "Tech founder throws hat in California governor’s race",
      "url": "https://techcrunch.com/2025/08/25/tech-founder-throws-hat-in-california-governors-race/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T17:05:22.000Z",
      "summary_90w": "",
      "raw": "A Bay Area tech founder, Ethan Agarwal, says he's running for California governor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b46df32e07fb51b674c581af6db064327df1f870",
      "title": "How chatbot design choices are fueling AI delusions",
      "url": "https://techcrunch.com/2025/08/25/how-chatbot-design-choices-are-fueling-ai-delusions-meta-chatbot-rogue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T16:50:09.000Z",
      "summary_90w": "",
      "raw": "Experts say that many of the AI industry’s design decisions are likely to fuel episodes of AI psychosis. Many raised concerns about several tendencies that are unrelated to underlying capability, including models’ habit of praising and affirming the user’s question (often called sycophancy), issue constant follow-up questions, and use of “I,” “me” and “you” pronouns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d43b035188e48294251af91dcc7414515a70cd13",
      "title": "Israel’s attack on hospital in Gaza may constitute a war crime on many fronts",
      "url": "https://www.theguardian.com/world/2025/aug/25/israel-attack-gaza-hospital-may-constitute-war-on-many-fronts",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T16:49:02.000Z",
      "summary_90w": "",
      "raw": "Double-tap strike suggests killing of civilians, rescue workers and journalists deliberate and not a mistake\nIsrael’s twin strike on the Nasser hospital in Gaza, which killed five journalists including staff working for the Associated Press, Reuters, NBC and Al Jazeera, is a potential violation of international law writ large.\nThe attack targeted a civilian building, specifically a hospital, in a reckless double-tap strike that killed civilians, rescue workers and journalists among them. All categories that should be protected under international law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adb2ab4a2eeb3f2f056e5ca66b1f6b289de5497e",
      "title": "Five journalists among 20 killed in Israeli strike on hospital, Gaza officials say",
      "url": "https://www.bbc.com/news/articles/cp89rp48246o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T16:40:01.000Z",
      "summary_90w": "",
      "raw": "The Israeli military says it hit Nasser Hospital in Khan Younis and is investigating,  adding \"it does not target journalists as such\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a67396626937ea3760feecd8f0129569c6d7e8f",
      "title": "Our favorite smart lock is on sale for the first time today",
      "url": "https://www.theverge.com/smart-home/765121/kwikset-halo-select-smart-lock-sonos-era-300-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T16:38:42.000Z",
      "summary_90w": "",
      "raw": "Kwikset’s Halo Select smart lock is $20 off at multiple retailers.\t\n\nSetting up a smart home security system is important, even if you never want to think about having to use it. Thankfully, Kwikset’s Halo Select — the best smart lock we’ve ever tested — is currently down to $259 ($20 off) at Amazon, Lowe’s, and The Home Depot, marking the first time the lock has been on sale since its launch late last year. \nKwikset Halo Select\n\nWhere to Buy:\n\n $279 $259 at Amazon\n $279 $259 at Home Depot\n $279 $259 at Lowes\n\nIn her review, Verge reviewer Jennifer Pattison Tuohy praised the Halo Select for supporting four entry methods: a physical key, Kwikset’s app, a location-based auto-unlock feature, and a pin code. The lock was also easy to install thanks to the detailed instructions Kwikset provided, along with its intuitive mobile app. Out of the box, the Halo Select works with Amazon Alexa, Google Home, and Kwikset’s app via the cloud. If you have a Matter controller and Thread border router — such as a current-gen Apple TV, a recent Echo speaker, or an Eero router — you can connect to those platforms locally, and gain the ability to control the lock using Apple Home or Samsung SmartThings. \nIn our tests, using the Halo Select over Matter significantly improved its battery life. However, using the Halo Select via Matter meant giving up its auto-unlock feature, which worked reliably. Having your door unlock itself as you’re walking up to it is very convenient, but Matter doesn’t currently support auto-unlock, door sensing, fingerprint access, or facial recognition. The auto-unlock feature also requires you to have Kwikset’s app open on your phone in the background. Still, if you want a futureproof smart lock that can do almost everything (even if you have to make a tough choice about which features to prioritize), it’s our top pick.\nThree more great deals\nIf you need a basic tablet for streaming TV shows and reading books, Amazon’s latest Fire HD 10 is a great choice, one you can pick up for $89.99 ($50 off) at Amazon, Best Buy, and Target. It has a 10.1-inch 1080p display, 32GB of storage (which you can expand with a microSD card), and an eight-core processor. The tablet is compatible with the Made for Amazon Stylus Pen and Made for Amazon Bluetooth Keyboard Case, too, if you’d like to use it for sketching or long-form writing projects.  \nUsing the wrong gaming mouse can put you at a disadvantage when playing fast-paced online games where every millisecond counts. Luckily, Razer’s DeathAdder V3 Pro is down to $84.99 ($65 off) at Amazon and Best Buy, matching its Prime Day price. Razer says the optical mouse can be clicked up to 90 million times, lasts up to 90 hours per charge, and has been designed ergonomically to reduce hand fatigue. The wireless mouse features eight programmable buttons and a 30K optical sensor, which allows you to use it on most surfaces — including glass — without a reduction in tracking accuracy. You can also connect the V3 Pro to your PC wirelessly via a 2.4Ghz USB dongle (included) or with a USB-C cable.\nThe Sonos Era 300, my go-to smart speaker, is on sale at Amazon, Best Buy, and Walmart for $359 ($90 off), which matches its all-time low. It’s one of the few that can convincingly play Dolby Atmos surround sound music with perceptible depth (provided it’s mixed properly). The wireless speaker sounds great whether it’s connected to your devices via Bluetooth or Wi-Fi, and you can hook it up to a wired source (including a turntable) using an optional $19 dongle. You can also pair two together for better stereo and Dolby Atmos separation, or use them as rear channels with a Sonos soundbar for a more effective home theater system. Read our review.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcb496dfd72d4d36bf496ffbe41ccb2ba9c967a3",
      "title": "South African women warned about viral Russian job videos",
      "url": "https://www.bbc.com/news/articles/c9qy2r19e75o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T16:36:02.000Z",
      "summary_90w": "",
      "raw": "A large number of young South Africans are jobless and attracted by social media offers of work abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "652ab4ef1b5f749b113648d4054fa8842313efd0",
      "title": "Bank holiday delivers record temperatures for parts of UK",
      "url": "https://www.bbc.com/news/articles/cj6yp0j7znxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T16:31:29.000Z",
      "summary_90w": "",
      "raw": "The heat will be short-lived, with wet and windy weather expected for most by mid week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b05952023b1bb6aa3657d60f566ef555e2de1c38",
      "title": "Kneecap cancel all US tour dates over clash with court hearing in London",
      "url": "https://www.theguardian.com/music/2025/aug/25/kneecap-us-tour-cancelled",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T16:29:18.000Z",
      "summary_90w": "",
      "raw": "Band member Liam Óg Ó hAnnaidh faces terrorism charge in UK for alleged display of Hezbollah flag mid-performance\nThe Irish hip-hop trio Kneecap have cancelled their scheduled US tour dates in October, citing the proximity to a court hearing in London involving band member Liam Óg Ó hAnnaidh’s alleged mid-performance display of a Hezbollah flag.\nÓ hAnnaidh, who performs under the stage name Mo Chara, was charged with a terrorism offence in the UK in May after being accused of displaying a flag in support of Hezbollah during a concert in London last November.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2feb109ebab05dc69c12430382294891800312f",
      "title": "Scotland is known for its rain. So why are experts worried about water supplies?",
      "url": "https://www.bbc.com/news/articles/c0qly7g9pepo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T16:20:01.000Z",
      "summary_90w": "",
      "raw": "Restrictions are being introduced on water use by businesses near two rivers where the levels are low.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ea045bcb1ce0673b8aad323bc88c785ee6eca65",
      "title": "Elon Musk&#8217;s xAI is suing OpenAI and Apple",
      "url": "https://www.theverge.com/news/765171/elon-musk-apple-openai-antitrust-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T16:15:50.000Z",
      "summary_90w": "",
      "raw": "Elon Musk is suing Apple and OpenAI over claims that their deal to build ChatGPT into the iPhone is stifling competition in the AI industry. In a lawsuit filed on Monday, the Musk-owned X Corp. and xAI also accuse Apple’s Apple Store of “deprioritizing” rival chatbots and “super” apps, including Grok and X.\nMusk’s companies claim that iPhone users “have no reason” to download third-party AI apps because the company “force[s]” users to use ChatGPT as their default chatbot app when enabling Apple Intelligence. “Apple and OpenAI have locked up markets to maintain their monopolies and prevent innovators like X and xAI from competing,” the companies allege.\nMusk threatened Apple with legal action earlier this month after accusing the company of rigging App Store rankings in favor of OpenAI. “Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation,” Musk said at the time.\nThe lawsuit adds that though the X and Grok apps have received high rankings, neither appears in the App Store’s “Must-Have Apps” section, where ChatGPT was allegedly the “only” AI chatbot in the section on August 24th, 2025.\nX and xAI also accuse Apple’s partnership with OpenAI of creating a “moat” that protects the AI giant due to “Apple’s monopoly in smartphones.” It notes that the iPhone’s ChatGPT integration gives OpenAI access to “potentially billions of user prompts originating from hundreds of millions of iPhones,” allegedly giving it an unfair advantage.\n“This latest filing is consistent with Mr Musk’s ongoing pattern of harassment,” OpenAI spokesperson Kayla Wood said in an emailed statement to The Verge. Apple told Bloomberg earlier this month that its store is “designed to be fair and free of bias” in response to Musk’s claims.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c63eec511161853b6d0e141f14ffa05cfab437b4",
      "title": "Kneecap cancel US tour dates amid court case",
      "url": "https://www.bbc.com/news/articles/c99m2zne0y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T16:12:37.000Z",
      "summary_90w": "",
      "raw": "The trio said they have cancelled all upcoming US tour dates because of the \"proximity of our next court hearing in London\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d5fc24c5ad416d79ab27344a67dbeb62c75afb1f",
      "title": "'That is fantastic!' - Dean takes 'brilliant' one-handed catch",
      "url": "https://www.bbc.com/sport/cricket/videos/cp94lgljp7zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T16:12:16.000Z",
      "summary_90w": "",
      "raw": "Charlie Dean takes a brilliant one-handed catch at extra cover to dismiss Marizanne Kapp as London Spirit face Oval Invincibles in the Hundred at the Oval.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1532fd0e891e7d961fbd9f60ef4aab61af037774",
      "title": "Israel bombed Gaza hospital a second time, killing rescuers, say health officials",
      "url": "https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T16:06:04.000Z",
      "summary_90w": "",
      "raw": "At least 20 people, including five journalists, died as they rushed to help those wounded in the first strike\nIsrael bombed the main hospital in southern Gaza on Monday and then struck the same spot again as rescuers and journalists rushed to help the wounded, killing at least 20 people including five journalists, health officials said.\nThe first strike hit the top floor of a building at the Nasser hospital, killing the Reuters journalist Hussam al-Masri and others. Journalists and rescuers then rushed to the scene to help the wounded, when a second bomb struck the same spot 15 minutes later.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a3b3e9c2311ccba592539a6706409ed84a49b75c",
      "title": "This new delivery robot will bring the entire grocery store to you",
      "url": "https://www.theverge.com/news/765167/robomart-autonomous-food-delivery-locker-rm5",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T16:04:25.000Z",
      "summary_90w": "",
      "raw": "Robomart’s RM5 is a level-four autonomous delivery vehicle comprised of 10 individual lockers. | Image: Robomart\t\n\nA new company aims to take the idea of sidewalk delivery robots and supersize it. \nLos Angeles-based Robomart unveiled its new delivery robot Monday, with the goal of making “on‑demand delivery work economically.” The level-four autonomous vehicle is the size of a shuttle bus and can carry up to 500 lbs of payload. With no space for a human driver, the company’s RM5 vehicle is comprised of 10 individual lockers for customer orders, allowing it to make multiple deliveries on a single run.\n“Robomart exists to deliver autonomy in a way that finally makes on‑demand delivery work economically,” said Emad Suhail Rahim, co‑founder and chief strategy officer of Robomart, in a press release. “With RM5, retailers get a profitable channel for on-demand delivery and consumers get everyday essentials delivered at affordable prices. That’s the future we’re building—an autonomous Instacart that’s actually profitable.” \nLike Instacart or Uber Eats, the company aims to launch its own app where customers can browse options from a variety of retailers, restaurants, and grocery stores. And Robomarts says customers will only have to pay a flat delivery rate of $3 per order, promising “no markups, no service fees, no tips.”\nThe setup will result in “70 percent lower fulfillment costs than human couriers,” the company claims – thought it doesn’t explain how it arrives at that figure. Most food delivery services are not profitable, though companies like DoorDash and Uber Eats have made significant gains in revenue over the years. Robot delivery, in particular, faces a lot of hurdles, including initial costs in developing robotic hardware and AI software. \n“By carrying 50x more than sidewalk bots or drones, the RM5 platform enables us to serve many more customers per hour without the labor and capacity bottlenecks of legacy approaches,” Tigran Shahverdyan, co-founder and CTO of Robomart, said in the announcement.\nThe RM5 vehicle is relatively unique among autonomous vehicles today. Rather than opt for a small, for-wheeled robot that can carry one order and travel on the sidewalk, Robomart decided to go big. In addition to its multi-locker design, the vehicle is engineered to only travel at low speeds, with a maximum speed of 25 mph. The fully electric vehicle has a range of 112 miles and a curb weight of 2,205 lbs. There are a total of 10 climate-controlled lockers that can hold about 50 lbs each. \nAfter an order is placed, Robomart says it will dispatch its vehicle to the retailer for pickup, after which it can visit a number of other shops before heading out for deliveries. The RM5 vehicles are able to create a dynamic, multi stop route depending on the number of orders. Upon arrival, the customer uses the app to unlock their assigned locker and retrieve their order — much like with a sidewalk delivery robot. \nThe company has been trialing its service for a few years now. A video from four years ago shows them using Mercedes minivans to fulfill customer orders. Robomart says it “has partnered” with a number of retailers, including Ahold Delhaize, Unilever, Mars, Avery Dennison, and Yamaha Motors. The venture-backed company has received a modest amount of funding from Hustle Fund, Wasabi Ventures, W Ventures, Entrepreneur Ventures, Capital Factory, and HAX. According to TechCrunch, the company has raised less than $5 million since its founding in 2018. \nRobomart says it is looking to collaborate with local businesses ahead of its planned launch in Austin, Texas later this year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c8edd414503c3ec4336502850174d5ca19bbc2e1",
      "title": "Wolves reject £50m Newcastle bid for Strand Larsen",
      "url": "https://www.bbc.com/sport/football/articles/cgr9k81yz8do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T15:56:11.000Z",
      "summary_90w": "",
      "raw": "Newcastle United have a £50m bid for striker Jorgen Strand Larsen rejected by Wolves as they look to sign a striker before the transfer deadline.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d34d8891d21cd39f51df77cd30f6929f4e438ac7",
      "title": "Trump told a major offshore wind project to stop construction just before it reached the finish line",
      "url": "https://www.theverge.com/news/765175/trump-offshore-wind-farm-revolution-orsted-halt",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T15:45:45.000Z",
      "summary_90w": "",
      "raw": "Attendees during a media tour of the Revolution Wind construction hub at the Port of Providence in Providence, Rhode Island, on Thursday, June 13th, 2024. | Photo: Getty Images\t\n\nThe Revolution Wind farm was already 80 percent complete before the US Bureau of Ocean Energy Management sent it a letter Friday to “halt all ongoing activities” to address purported national security concerns and “interference” with other potential uses for the area.  \nThe move comes as data centers, domestic manufacturing, and electric vehicles are raising electricity demand, putting more pressure on power grids across the US. Nevertheless, President Donald Trump has waged his war against wind farms, attempting to eliminate competition to the fossil fuel industry that backed Trump’s campaign. \nThe Trump administration similarly paused construction of the Empire Wind farm off the coast of New York state earlier this year, which reportedly cost its developers $50 million a week before it was allowed to start work again. \nRevolution Wind is supposed to provide enough electricity for more than 350,000 homes in Rhode Island and Connecticut after coming online next year. It has already received federal and state permits to operate. Ørsted, one of the project’s developers, says it’s evaluating its legal options.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5921fa6dc9197bd056f030a7ce24856051a3a982",
      "title": "Is Edinburgh's Fringe still fringe, or has it — gasp — gone mainstream?",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5496463/is-edinburghs-fringe-still-fringe-or-has-it-gasp-gone-mainstream",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T15:42:35.000Z",
      "summary_90w": "",
      "raw": "It began on the edgy margins of a mainstream festival — which it's now eclipsed. But nearly 80 years on, performers and spectators say rising costs threaten the Fringe's alternative vibe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c8906d6ec9d44697cc9ffeaa361c9e9740fe8cda",
      "title": "What we noticed from the Premier League weekend",
      "url": "https://www.bbc.com/sport/football/articles/c2djywy3754o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T15:39:14.000Z",
      "summary_90w": "",
      "raw": "The second weekend of the Premier League season brought with it numerous interesting tactical tweaks and the clever use of certain players - here is what BBC Sport learned.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "406ec736827d333cc9d2d7eb34fa8b18eac8c779",
      "title": "The new Fi Mini pet tracker has GPS, and it&#8217;s barely bigger than an AirTag",
      "url": "https://www.theverge.com/news/765132/fi-mini-gps-pet-lost-dog-cat-location-tracking",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T15:13:14.000Z",
      "summary_90w": "",
      "raw": "Fi, the pet tech company known for its smart dog collar, has launched a clip-on GPS tracker that it says is the perfect size for your feline friend or small dog. The Fi Mini weighs just 0.56 ounces (16 grams), allowing you to keep tabs on your pet with real-time escape alerts and live tracking from the accompanying app.\nAs with its smart collar, the Fi Mini is also available as a subscription, but it’s a bit cheaper at $129 per year. You can attach the Fi Mini to any collar or harness that’s 3/8 to 1 inch wide, and Fi says it’s suitable for “dogs and cats of any size.” At 42mm long and 30mm wide, the Fi Mini is slightly larger than an Apple AirTag. The Fi Mini is still lighter than the Cat Mini tracker offered by Tractive, which recently acquired Whistle and is shutting down its tracking platform.\nOnce you clip the Fi Mini onto your dog’s or cat’s collar, you can expect up to three weeks of battery life (or up to three months with the Fi base, which helps reduce power consumption) and support for USB-C charging. Like the Series 3 Plus smart collar, the Fi Mini has an IP68 rating, making it dust-tight and protected against submersion in water. The compact tracker uses Verizon’s LTE-M cellular network to share your pet’s location and track their walking history.\nThe Fi Mini also offers the same activity and sleep tracking capabilities as the smart collar, with additional features, including AI-powered behavior detection to alert you of barking, scratching, eating, drinking, and licking, this fall. Fi also plans on rolling out an Apple Watch integration, bringing it in line with its Series 3 Plus counterpart. \nThe Fi Mini is available to purchase now and will begin shipping on September 1st.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d5ba2bcbb0981c9f61e5d2acc2becb505f4a1ef",
      "title": "Silicon Valley is pouring millions into pro-AI PACs to sway midterms",
      "url": "https://techcrunch.com/2025/08/25/silicon-valley-is-pouring-millions-into-pro-ai-pacs-to-sway-midterms/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T15:11:43.000Z",
      "summary_90w": "",
      "raw": "The new pro-AI super-PAC network dubbed Leading the Future aims to use campaign donations and digital ads to advocate for favorable AI regulation and oppose candidates that the group thinks will stifle the industry.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "001e09c9387a06556e7b9365ab53aa05d58635b3",
      "title": "Colourful Notting Hill Carnival revellers party in the streets",
      "url": "https://www.bbc.com/news/articles/c4gjyyd2320o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T15:06:52.000Z",
      "summary_90w": "",
      "raw": "The celebrations continue with the adult's parade, sound systems and live performances on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "724873253c3acb8c056a179ac0314408814683a3",
      "title": "Dinner or a shower? Elderly people fear tough choices when Australia’s new aged care changes are rolled out",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/dinner-or-a-shower-elderly-people-fear-tough-choices-when-australias-new-aged-care-changes-are-rolled-out",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T15:00:06.000Z",
      "summary_90w": "",
      "raw": "Advocates warn increased costs for basic assistance like showers and wound cleaning will push older people into aged care or hospital\nMargaret Duckett is scared for her friends.\nThe 77-year-old pensioner is the recipient of a home care package – which allows her to get support with cleaning, gardening, transport, physiotherapy and podiatry – and some personal care, so she can continue living independently at her home in Sydney’s Riverview.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43622398fddbe54f9ce4817eb3df8ed6dc80702e",
      "title": "Victorian couple sue TikTok for blocking account after allegedly competing in live battles against banned users",
      "url": "https://www.theguardian.com/australia-news/2025/aug/25/victorian-couple-sue-tiktok-for-blocking-account-after-allegedly-competing-in-live-battles-against-banned-users-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T15:00:05.000Z",
      "summary_90w": "",
      "raw": "Pair allege platform breached failed to provide them with procedural fairness, claiming firm has ‘permanently removed’ their livelihood\n\nGet our breaking news email, free app or daily news podcast\n\nA Victorian couple is suing TikTok after their account was banned from the social media platform, allegedly for competing in TikTok live battles against banned users.\nSelim Ozgan and his wife, Inci Guven, have sued TikTok and its Singaporean subsidiary in the federal court of Australia, alleging the ByteDance-owned company had unfair contract terms under Australian Consumer Law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c384263408a1adffbc4e7bc18f71c5df4cb6bcb",
      "title": "Robomart unveils new delivery robot with $3 flat fee to challenge DoorDash, Uber Eats",
      "url": "https://techcrunch.com/2025/08/25/robomart-unveils-new-delivery-robot-with-3-flat-fee-to-challenge-doordash-uber-eats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Robomart's RM5 autonomous delivery robot can carry up to 50 pounds and deliver multiple customer orders at once.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "592a3d35178184b020520ce535c24f06d700c967",
      "title": "Volunteer opportunities still open for TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/25/want-to-attend-techcrunch-disrupt-2025-for-free-volunteer-but-the-clocks-ticking/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Whether you want to launch your own startup, build your event chops, or get inspired by real traction stories, volunteering at TechCrunch Disrupt 2025 is your backstage pass to see how a world-class tech conference comes to life. Apply before September 30.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bac805cbe62083c90db2b7c5859b88650b7bd69",
      "title": "First human case of flesh-eating screwworm parasite confirmed in US",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/new-world-screwworm-flesh-eating-parasite-case-us",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T14:32:35.000Z",
      "summary_90w": "",
      "raw": "HHS told Reuters patient had returned from El Salvador but beef industry said person had traveled from Guatemala\nThe US Department of Health and Human Services (HHS) on Sunday reported the first human case in the US of travel-associated New World screwworm, a flesh-eating parasite, from an outbreak-affected country.\nThe case, investigated by the Maryland department of health and the US Centers for Disease Control and Prevention (CDC), was confirmed by the CDC as New World screwworm on 4 August – and involved a patient who returned from travel to El Salvador, an HHS spokesperson, Andrew G Nixon, said in an email to Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eba47cd086459ef674fa3aeb30aec05503c77cf",
      "title": "Here’s where you can buy microSD Express cards for the Switch 2",
      "url": "https://www.theverge.com/tech/676075/switch-2-microsd-express-cards-where-to-buy",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T14:30:02.000Z",
      "summary_90w": "",
      "raw": "Don’t buy one unless you can see the “EX” label on the card and package. | Image: Cameron Faulkner / The Verge\t\n\nThe Nintendo Switch 2 was tough to find in stock during its first two months on shelves, but that’s no longer the case. If you own one, or are considering buying one soon, you understandably may want a microSD card to store more games than the console’s 256GB storage can fit. And, you may already know that only microSD Express cards will work on the Switch 2 for storing and playing games. The card you used in your original Switch or Switch Lite will only offer very limited functionality in a Switch 2, letting you view screenshots or video clips you captured previously — that’s it.\nThe significantly faster microSD Express card boasts an advertised 4.4x improvement in terms of transfer speeds over the microSD cards you might already have lying around. That improvement is signified by a small, easy-to-miss “EX” emblem etched onto the front of the card.\nNot only is the Switch 2 easy to find in stock these days, microSD Express cards are, too. However, Express cards aren’t cheap, with some costing more than $50 for just 256GB of storage. The Switch 2 supports microSD Express cards up to 2TB in size, although 1TB is the largest capacity available, with some cards selling for up to $200 a pop. Walmart’s Onn model is a beacon of light, as its 512GB model costing $65.88 — when it’s in stock.\nIf you’re in the market for one of these storage expansion cards, we’ve listed the available options below.\nSamsung microSD Express Card (256GB)\n\nWhere to Buy:\n\n $59.99 at Amazon (256GB)\n $59.99 at Best Buy (256GB)\n $59 at Walmart (256GB)\n\nPNY microSD Express card\n\nWhere to Buy:\n\n $58.99 $53.45 at Amazon (256GB)\n $58.99 $57.99 at B&H Photo (256GB)\n $58.99 at PNY (256GB)\n\nonn microSD Express card\n\nWhere to Buy:\n\n $35.88 at Walmart (256GB)\n $65.88 at Walmart (512GB)\n\nSandisk microSD Express card\n\nWhere to Buy:\n\n $53.99 at Amazon (128GB)\n $71.99 at Amazon (256GB)\n $119.99 at Amazon (512GB)\n\nGameStop microSD Express card\n\nWhere to Buy:\n\n $54.99 at GameStop (256GB)\n\nLexar microSD Express card\n\nWhere to Buy:\n\n $56 at Amazon (256GB)\n $119.99 at Amazon (512GB)\n $219.99 at Adorama (1TB)\n\nUpdate, August 25th: Updated prices, and tweaked copy to indicate that both the Switch 2 and many microSD Express card models are easier to find in stock.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eba4c03d28ee90bf12ade82f7e83ef67516f036d",
      "title": "AI doesn’t belong in journaling",
      "url": "https://www.theverge.com/analysis/764519/ai-gemini-pixel-journal-app",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T14:30:00.000Z",
      "summary_90w": "",
      "raw": "A blank page is supposed to be ‘inconvenient.’ | Image: The Verge, Getty Images\t\n\nIn July 2023, I deleted the Day One journaling app from my phone and laptop. It was perhaps the best thing I've done as a lifelong diarist. \nThe decision was prompted by Apple announcing its Journal app at WWDC that year. In that keynote, Apple said it would use \"on-device machine learning\" to provide prompts based on the content in your iPhone - things like contacts, photos, music, workouts, podcasts, and location data. The idea gave me the ick. Mainly because the app was described as a riff on the Memories feature in the Photos app, which at the time had \"intelligently\" resurfaced a photo of my mother's open casket.\nI had flashbacks to t …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "264413356188e5262c7ee5b3e225a2e06cf7bb6d",
      "title": "Yottar wants to help energy users find capacity on the electrical grid",
      "url": "https://techcrunch.com/2025/08/25/yottar-wants-to-help-energy-users-find-capacity-on-the-electrical-grid/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T14:27:08.000Z",
      "summary_90w": "",
      "raw": "The startup maps utility assets and collects data on electricity demand, which helps customers find locations ripe for upgrades or new equipment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a80fad7240ad0f5432f9fc0ba0c880943c06e35f",
      "title": "Apple might opt for a curved glass design for 20th anniversary iPhone",
      "url": "https://techcrunch.com/2025/08/25/apple-might-opt-for-a-curved-glassed-design-for-20th-anniversary-iphone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T14:18:39.000Z",
      "summary_90w": "",
      "raw": "Apple is likely to debut a new curved glass design for the 20th anniversary iPhone in 2027.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7349ce04ada105638136c4aafe70574d9873dd69",
      "title": "Major Australian environmental law overhaul to be put to parliament this year as Watt warns delays risk ‘destruction’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/26/environment-law-overhaul-to-be-put-to-australian-parliament-in-2025-minister-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T14:05:01.000Z",
      "summary_90w": "",
      "raw": "Labor will seek to legislate national standards and federal EPA in one package rather than multiple stages, as it tried and failed to do last term\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nA major overhaul of the federal environmental protection regime will be put to parliament this year, the minister, Murray Watt, has promised, as he warns further delays risk causing more “environmental destruction” and stalled investment.\nAfter last week’s economic reform roundtable agreed to fast-track the original 18-month timeframe, Watt will on Tuesday confirm that legislation to re-write the Environment Protection and Biodiversity Conservation Act (EPBC) will be introduced before parliament rises for the year in late November.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eec683059d981808e2214891a51c6ac634f4f494",
      "title": "‘For Russians, Nato is next to Satan’: Finnish guards on alert at Russia border",
      "url": "https://www.theguardian.com/world/2025/aug/25/finland-fence-nato-border-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T14:02:55.000Z",
      "summary_90w": "",
      "raw": "North Karelia force says fence dividing Finland and Russia is no Berlin Wall – but it is now a key geopolitical faultline\nAmong the serene lakes, thick forest and summer houses of North Karelia’s border zone, the line between Finland and Russia is almost invisible. Walking along the border path in Meriinaho, part of the Finnish border guard station of Ilomantsi, we are closer to St Petersburg than to Helsinki. This is the most easterly point of the continental European Union.\nEvery now and then a discreet pair of matching striped fibreglass posts pop up from the blueberry patches on either side of the frontier. One is painted blue and white to indicate Finland, the other green and red to mark Russia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cf8408cc16d866cad1b4fc9343ce5af847d6e9f",
      "title": "Next set of VC judges locked in for Startup Battlefield 200 at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/25/next-batch-of-startup-battlefield-200-judges-revealed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-25T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The Startup Battlefield 2025 judging panel is getting even stronger. Our first wave of VCs brought serious firepower, and now we’re adding more top investors who will grill founders, unpack the big questions, and help crown this year’s $100,000 champion at TechCrunch Disrupt, October 27–29 in San Francisco’s Moscone West.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b2023f898f2bc350074e3b6ce7f067ae85fa5fb",
      "title": "Apple&#8217;s three-year iPhone plan is a break from the boring",
      "url": "https://www.theverge.com/news/765063/apple-iphone-air-redesign-three-year-plan",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T13:53:14.000Z",
      "summary_90w": "",
      "raw": "Next month, Apple is rumored to debut a slimmed-down iPhone Air, breaking from the small design tweaks and spec bumps that have become routine at its launch events. The three-year plan will see its hardware change to mesh with the new Liquid Glass design in its next iOS update, as Bloomberg’s Mark Gurman highlighted in his latest newsletter over the weekend. \nIt also includes the launch of the book-style foldable iPhone in 2026 that’s been rumored for months, and Apple is reportedly planning to launch an iPhone with curved glass around the entire device and very thin bezels in celebration of the device’s 20th anniversary in 2027.\nThe main iPhone 17 lineup this fall isn’t expected to come with significant design tweaks other than a Pixel-like camera bar on the back. But the iPhone Air could inject some variation for anyone bored by the look and feel of the existing options, even if it does come with some tradeoffs, like shorter battery life and a higher price.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76b0f53e4f07653e50ad7f21b44dcc4b3f658488",
      "title": "Fleetwood's PGA Tour triumph can open 'floodgates'",
      "url": "https://www.bbc.com/sport/golf/articles/cn85qe6l4gqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T13:42:49.000Z",
      "summary_90w": "",
      "raw": "Tommy Fleetwood's first coach believes the \"floodgates can open\" after the Englishman lands his first American tournament victory at the Tour Championship in Atlanta.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1bf754152144b39b028767943b2251e06474b9af",
      "title": "Black cab rapist John Worboys investigated over alleged 1990s sex attack",
      "url": "https://www.bbc.com/news/articles/cg503962q79o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T13:18:37.000Z",
      "summary_90w": "",
      "raw": "Lancashire Police say the probe comes after a report of a sex attack in the town decades ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a8de38db89b69b31b4288a0303af562116619a4",
      "title": "Kilmar Abrego Garcia detained by ICE during Baltimore check-in",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515422/kilmar-abrego-garcia-detained-ice",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T13:15:15.000Z",
      "summary_90w": "",
      "raw": "The detention, which was expected, happened after Abrego Garcia walked into the Immigration and Customs Enforcement building in Baltimore for a check-in after being released from custody on Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea02c9d7a3c225db1dc5bd53527322f555a0a731",
      "title": "Trump&#8217;s immigration crackdown could be slowing the hunt for child predators online",
      "url": "https://www.theverge.com/policy/764602/online-child-exploitation-investigations-hsi-immigration",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T13:10:49.000Z",
      "summary_90w": "",
      "raw": "As President Donald Trump pushes federal law enforcement toward an immigration crackdown, agents and prosecutors fear he's drawing resources from one of the most vulnerable groups: victims of child sexual exploitation online.\nCurrent and former government employees tell The Verge that the Trump administration's laser focus on border security threatens to strain investigations into online crimes against children. Agents, including in departments that work on child safety, are being reassigned or given extra caseloads. Prosecutors are finding themselves spread thin. One former agent at Homeland Security Investigations (HSI), who like others i …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d6789ae6eeac4d165284f3687bea7b3dc8de276",
      "title": "Man mistakenly deported to El Salvador set to be removed from US again",
      "url": "https://www.bbc.com/news/articles/c04ryk6ed5lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T13:03:16.000Z",
      "summary_90w": "",
      "raw": "Kilmar Abrego Garcia is taken into custody in Baltimore as his lawyers say he may be sent to Uganda.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d41cdaca6414166cbe08219f6957c95cfe44321d",
      "title": "EcoFlow’s Rapid power bank is the fastest yet",
      "url": "https://www.theverge.com/reviews/764829/fastest-power-bank-review-ecoflow-rapid",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-25T13:00:00.000Z",
      "summary_90w": "",
      "raw": "EcoFlow’s Rapid Pro Power Bank fast charging at 320W on top of EcoFlow’s Rapid Pro Desktop Charger.\t\n\nIt's now possible to charge a large 99Wh (27,650mAh) power bank - the largest you can easily take on an airplane - from zero to 80 percent in about 20 minutes. But only if you own EcoFlow's new power bank and desktop charger combo, launching in the US today.\nThe $179.99 / €169.99 Rapid Pro Power Bank 27k can take a powerful 320W charge when placed onto the pogo-pin connector on top of the company's $199.99 / €159.99 Rapid Pro Desktop Charger. Both devices can simultaneously charge two power-hungry laptops at up to 140W each over USB-C, and you can plug two 140W USB-C PD 3.1 chargers into the power bank to charge its battery from zero to 80  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "961b0413ff86fb17f69e9075bba001608cb10359",
      "title": "ScotRail to replace controversial AI voice on trains",
      "url": "https://www.bbc.com/news/articles/c5ypzzyjgego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T12:58:42.000Z",
      "summary_90w": "",
      "raw": "Voiceover artist Gayanne Potter said a \"dreadful\" robotic version of her voice was being used on trains",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43635f5c1e43e0b8ae59d8c5b23abfd6ba995a81",
      "title": "Ørsted shares at all-time low after Trump halts work on US windfarm",
      "url": "https://www.theguardian.com/environment/2025/aug/25/rsted-shares-at-all-time-low-after-trump-halts-work-on-us-windfarm",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T12:28:04.000Z",
      "summary_90w": "",
      "raw": "Shares drop by 17% after stop-work order on $1.5bn project off Rhode Island, which was 80% complete\nShares in Ørsted hit an all-time low on Monday after the Trump administration ordered Europe’s largest wind power company to stop work on a near complete windfarm.\nØrsted’s shares plunged 17%, after it was forced to stop construction on its $1.5bn (£741m) Revolution Wind project off the coast of Rhode Island.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6ae4b176647b86ee871f56548448885b538286a",
      "title": "'It's terrifying': Thousands evacuate as typhoon batters Vietnam",
      "url": "https://www.bbc.com/news/articles/cwy0kqgxwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T12:21:50.000Z",
      "summary_90w": "",
      "raw": "It comes less than a year after Vietnam was hit by Typhoon Yagi, which killed 300 people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed2a2127dec83dccc6882f943ec0464c3575622f",
      "title": "Postal services in Europe suspend parcel shipments to US amid uncertainty over tariffs",
      "url": "https://www.theguardian.com/business/2025/aug/25/postal-services-in-europe-suspend-parcel-shipments-to-us-amid-uncertainty-over-tariffs",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T12:13:44.000Z",
      "summary_90w": "",
      "raw": "Donald Trump’s late announcement left operators with ‘extremely limited timeframe to get prepared’\nPostal services across Europe have suspended most parcel shipments to the US, citing widespread uncertainty about the impact of new import tariffs announced by Donald Trump.\nFrance’s La Poste on Monday joined other operators, including Germany’s Deutsche Post, Spain’s Correos, Poste Italiane and the Belgian, Swedish and Danish postal services, which all halted a majority of US-bound shipments over the weekend.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d68de55b78d0091d66343a28cfcf0f7cef3a25e",
      "title": "Trump threatens Chicago with National Guard. And, lessons from Katrina, 20 years later",
      "url": "https://www.npr.org/2025/08/25/g-s1-85037/up-first-newsletter-chicago-national-guard-john-bolton-ghislaine-maxwell-south-korea",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T11:29:53.000Z",
      "summary_90w": "",
      "raw": "Trump threatens to send National Guard troops to Chicago, similarly to what he has done in the nation's capital. And, Trump and South Korean President Lee will meet today in Washington.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7dcb8769e9f9bd5844f95264635f48433c418f7a",
      "title": "Hospitality hit by half of all UK job losses since Budget, industry leaders warn",
      "url": "https://www.bbc.com/news/articles/c05ey2ypp92o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T11:03:22.000Z",
      "summary_90w": "",
      "raw": "Lobby group calls for urgent action to lower taxes, but the government says it is helping establishments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "586913310afae0f3335c8321c3b50433685f227a",
      "title": "Whatever happened to ... the race to cure HIV? There's promising news",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/25/g-s1-84393/whatever-happened-to-the-race-to-cure-hiv-theres-promising-news",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T10:48:00.000Z",
      "summary_90w": "",
      "raw": "At the International AIDS Society meeting this year, a young woman from South Africa spoke. She is the first Black woman from Africa to be potentially cured of HIV.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d0ab17593ab4d8ae01ffdb7c0627e72ba94dab5",
      "title": "ABC defence correspondent Andrew Greene quits after failure to disclose junket",
      "url": "https://www.theguardian.com/media/2025/aug/25/abc-defence-correspondent-andrew-greene-quits-after-failure-to-disclose-junket",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T10:47:29.000Z",
      "summary_90w": "",
      "raw": "Resignation comes after Media Watch revealed a German defence company bidding for an Australian contract paid for him to visit its shipyards\n\nGet our breaking news email, free app or daily news podcast\n\nA senior journalist at the ABC has tendered his resignation two months after the public broadcaster’s Media Watch program raised potential conflict-of-interest concerns over a press junket.\nAndrew Greene has been defence correspondent for the past 10 years since joining the ABC in 2010.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb8dd541e1fcbc4d43d8602e04022fa2af252ec0",
      "title": "Jai Kalani Wright: video of Indigenous teen’s fatal collision with police car prompts family walkout of Sydney court",
      "url": "https://www.theguardian.com/australia-news/2025/aug/25/jai-kalani-wright-family-court-footage-motorbike-hitting-police-car-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T10:18:05.000Z",
      "summary_90w": "",
      "raw": "Benedict Bryant has pleaded not guilty to a charge of dangerous driving occasioning death\n\nGet our breaking news email, free app or daily news podcast\n\nHarrowing footage has been aired in court of the moment an Indigenous teenager riding a trail bike crashed into a police vehicle, as a battle erupts over the relevance of an earlier collision.\nSgt Benedict Bryant, 47, was behind the wheel when Jai Kalani Wright rode the motorbike into his unmarked police vehicle in inner-city Sydney on 19 February 2022.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "698fa7376648634dc85adf8f3992ffe0a47bb73a",
      "title": "These fish may feel pleasure while being groomed by other fish",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5508851/fish-pleasure-pain-cleaning",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T10:00:00.000Z",
      "summary_90w": "",
      "raw": "An experiment with threadfin butterflyfish finds that these fish may experience pleasure while being cleaned by bluestreak cleaner wrasse — suggesting this capacity goes far back in animal evolution.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25a9d64f27e52a7ee9600d11578fac714258d240",
      "title": "'A man's body' - Draper returns to US Open transformed",
      "url": "https://www.bbc.com/sport/tennis/articles/ckgj4j4k42mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T09:57:15.000Z",
      "summary_90w": "",
      "raw": "Twelve months on from his breakout Grand Slam run, Jack Draper returns to the US Open feeling stronger - and looking beefed up.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a54cf198a490aa3d6eb1663a671a41cef7de9a31",
      "title": "South Korean President Lee to meet with Trump in Washington on Monday",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5508133/south-korean-president-lee-to-meet-with-trump-in-washington-on-monday",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T09:00:44.000Z",
      "summary_90w": "",
      "raw": "At a summit meeting in Washington, D.C., on Monday, the U.S. and South Korean presidents will discuss modernizing their 71-year-old alliance and fleshing out a trade deal reached last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb3d912ab1d303b17eb53397e7fc9eee19036a32",
      "title": "20 years after Katrina, New Orleans schools are still 'a work in progress'",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5435783/education-hurricane-katrina-anniversary-charter-schools",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The city's school system looks almost nothing like it did 20 years ago. People in New Orleans have strong opinions about whether that's good or bad, but the data is hard to argue with.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4697bbf05e2a1934592decee0d138ab0a3f59010",
      "title": "A retired general recalls Hurricane Katrina's chaos and lessons still unlearned",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5500576/hurricane-katrina-recovery-response-russel-honore",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Twenty years after Hurricane Katrina, retired Lt. Gen. Russel Honoré, who led recovery efforts as commander of Joint Task Force Katrina, urges people to be prepared for future disasters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0a2efed530d1ed8e6beb32d00d55036090001f6",
      "title": "Are weighted vests good for bones and muscle? Fact-checking a fitness trend",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5503969/fitness-bone-muscle-trends-weighted-vest",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T09:00:00.000Z",
      "summary_90w": "",
      "raw": "It's a growing fitness trend. People say wearing a weighted vest when you exercise builds bones, strengthens muscles and improves cardiovascular health. But does research back up these claims?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0dc4dec84eb6bcb028fb34c5f7b550a28952ee71",
      "title": "How a nurse's call eased a daughter's burden",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5511240/unsung-hero-nurse-dnr-death",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-25T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Ashley Ludlow's mother passed away in the hospital in 2005. She had followed her mother's wishes and asked that she not be resuscitated. That decision weighed heavy on her until a nurse reassured her.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d48e25e0f2145de3e698f404762e2ccca843f88d",
      "title": "Virginia Giuffre memoir to be published months after death",
      "url": "https://www.bbc.com/news/articles/c2djy7048pdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T07:49:33.000Z",
      "summary_90w": "",
      "raw": "She had finished working on the \"intimate\" and \"heartbreaking\" book before she took her own life in April, her publisher says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7047b6c83f93a9458f99065ea6163b881713531f",
      "title": "'Half alive': Toxic mushroom lunch survivor tells court of murders' impact",
      "url": "https://www.bbc.com/news/articles/cp8zr04wzz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T07:21:36.000Z",
      "summary_90w": "",
      "raw": "Family members of the three people Erin Patterson murdered with toxic mushrooms have confronted her in court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7047b6c83f93a9458f99065ea6163b881713531f",
      "title": "Mushroom murderer left me half alive, only survivor of toxic lunch tells court",
      "url": "https://www.bbc.com/news/articles/cp8zr04wzz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T07:21:36.000Z",
      "summary_90w": "",
      "raw": "Family members of the three people Erin Patterson murdered with toxic mushrooms have confronted her in court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0fd0559ed1106a918b56120383b59e8d3037d1c1",
      "title": "Medvedev beaten after photographer enters court",
      "url": "https://www.bbc.com/sport/tennis/articles/c0qly4k97q0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T07:06:27.000Z",
      "summary_90w": "",
      "raw": "Daniil Medvedev is out of the US Open after a remarkable defeat by Benjamin Bonzi, where a photographer walking on to the court changed the course of the match.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0fd0559ed1106a918b56120383b59e8d3037d1c1",
      "title": "Medvedev has US Open meltdown after photographer interrupts play",
      "url": "https://www.bbc.com/sport/tennis/articles/c0qly4k97q0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T07:06:27.000Z",
      "summary_90w": "",
      "raw": "Daniil Medvedev is out of the US Open after a remarkable defeat by Benjamin Bonzi, where a photographer walking on to the court changed the course of the match.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d45fe7e54f0d0d4933f179025a324722ef5d34be",
      "title": "'We're the UK's last piano builders - but it's not a dying art'",
      "url": "https://www.bbc.com/news/articles/cgqng5zpx71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T06:10:37.000Z",
      "summary_90w": "",
      "raw": "Craftsmen at Yorkshire Pianos hope to be the \"first of a new age of piano building\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f13c7823bcc01c06a3bbfddf0320f476fd372b3a",
      "title": "Isak saga sets tone for 'absolutely huge' match",
      "url": "https://www.bbc.com/sport/football/articles/cgerpn2z483o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T05:45:58.000Z",
      "summary_90w": "",
      "raw": "Newcastle United needed no added motivation for the visit of Liverpool, but the Alexander Isak saga has nevertheless added spice to the occasion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f13c7823bcc01c06a3bbfddf0320f476fd372b3a",
      "title": "Newcastle striker Isak's transfer saga adds spice to Liverpool tie",
      "url": "https://www.bbc.com/sport/football/articles/cgerpn2z483o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T05:45:58.000Z",
      "summary_90w": "",
      "raw": "Newcastle United needed no added motivation for the visit of Liverpool, but the Alexander Isak saga has nevertheless added spice to the occasion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f6a1f68665c4762ad21fa14c3372676cb375940",
      "title": "Lives torn apart by fatal crashes on one of UK's longest roads",
      "url": "https://www.bbc.com/news/articles/c70xn6pnx0go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T05:07:24.000Z",
      "summary_90w": "",
      "raw": "The family of an American woman who died in a crash on the A9 with her brother and mother talk about the impact.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a89e92afeb4329e4cd0510f13ab33228c6b3cfff",
      "title": "Get ready for fracking, Reform UK tells energy firms",
      "url": "https://www.bbc.com/news/articles/c74172wlezwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T05:03:53.000Z",
      "summary_90w": "",
      "raw": "The party is serious about going after shale gas - but critics argue it's too difficult and costly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-25T04:22:11.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fef6b76f015e59efb9a62ddeeffe47529e20fa2",
      "title": "‘I can’t sleep, I can’t get on with my life’: how Europe’s tougher rules are keeping families apart",
      "url": "https://www.theguardian.com/world/2025/aug/25/how-strict-reunification-rules-europe-keeping-families-apart",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T04:00:49.000Z",
      "summary_90w": "",
      "raw": "Tighter family reunification laws are causing long separations, traumatising children, and can push people towards traffickers, campaigners say\nStanding outside Germany’s parliament in June, Ahmad Shikh Ali fought back tears as he held up a blurry photo of his three-year-old son. Since fleeing Aleppo more than two years ago, Shikh Ali had done all he could to secure his son a safe future: moving to Hanover, getting full-time employment and wading through endless paperwork so that his wife and son could join him.\nHe was close to reuniting with his family, with just two cases in front of his in the queue. That was, until Germany’s lower house of parliament passed a bill in June to suspend family reunifications for migrants like him for at least two years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33638615ee5a7d640d1b8731c6fb89766c9aa401",
      "title": "Jerry Adler, who starred in The Sopranos, dies aged 96",
      "url": "https://www.bbc.com/news/articles/c36jyp6w32go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T02:46:58.000Z",
      "summary_90w": "",
      "raw": "Adler started acting in his early 60s, after some 30 years working behind the scenes on Broadway.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da15ba58ea49119d72bffaf4e120d89ad747e6fe",
      "title": "Chinese property giant Evergrande delisted after spectacular fall",
      "url": "https://www.bbc.com/news/articles/c14g7r44566o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T01:03:35.000Z",
      "summary_90w": "",
      "raw": "The embattled property giant's shares were taken off the Hong Kong stock market on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a4d86aea6b0adb621b5b2441704f7fa4cbb94f5",
      "title": "France summons US envoy over antisemitism claims ",
      "url": "https://www.bbc.com/news/articles/cq58102wz47o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-25T00:13:00.000Z",
      "summary_90w": "",
      "raw": "France denies allegations it is failing to tackle a surge in antisemitism since the Gaza war began.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a7280fbcbb2b351a81ccceda4e1ad93e73baa11",
      "title": "What is behind the passion of Love Island USA's Nigerian fanbase?",
      "url": "https://www.bbc.com/news/articles/cx2qnwlkrx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T23:44:25.000Z",
      "summary_90w": "",
      "raw": "Nigerians made their mark during this year's Love Island USA - but it caused tensions within the fanbase.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ee12cd4dbd91597a5bf21b0e81ace5163d94a1a",
      "title": "How Russia is quietly trying to win over the world beyond the West",
      "url": "https://www.bbc.com/news/articles/cm2vr37yd4no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-24T23:06:41.000Z",
      "summary_90w": "",
      "raw": "Over the past three years, Russian state-backed news channel RT has expanded its international presence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c8f11f200dd9a6776f7bb052cc7a9c1bff36c88",
      "title": "A cut-off finger ended her comfortable family life. Now she's hiding from US officials",
      "url": "https://www.bbc.com/news/articles/cvg4kd385e4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-24T23:00:35.000Z",
      "summary_90w": "",
      "raw": "Donald Trump declared some cartels to be terrorist organisations. So why are the victims of cartels in hiding?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce3aa915d317ce962f7e426940cc4e8a9e0d6d6b",
      "title": "Monsoon rains happen every year. So why do so many die in Pakistan?",
      "url": "https://www.bbc.com/news/articles/c860e6d4dyqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T22:07:45.000Z",
      "summary_90w": "",
      "raw": "Since June of this year alone, monsoon rains have killed at least 750 people across the country.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17c1d0cb397b63a8a58faea6a92907e9bdf892ba",
      "title": "Pintarnya raises $16.7M to power jobs and financial services in Indonesia",
      "url": "https://techcrunch.com/2025/08/24/pintarnya-raises-16-7m-to-power-jobs-and-financial-services-in-indonesia/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T22:00:00.000Z",
      "summary_90w": "",
      "raw": "The Indonesian startup, now backed by $16.7M in Series A funding, helps workers find full-time and side gigs while offering financial solutions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f51708a44d29bd0ba7d00bb5c5c0937611cac5a",
      "title": "Trump threatens to deploy troops to Baltimore to 'clean up' crime",
      "url": "https://www.bbc.com/news/articles/c78mymx7mpko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T21:58:09.000Z",
      "summary_90w": "",
      "raw": "The deployment of military for domestic law enforcement has drawn backlash from Democrats, with one governor calling it an \"abuse of power\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8bd5dece6874316ca38670fb1c3d739c9b851183",
      "title": "Inside Donetsk as residents flee attacks on Ukrainian region Putin wants to control",
      "url": "https://www.bbc.com/news/articles/c209yn1ygz6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-24T21:04:11.000Z",
      "summary_90w": "",
      "raw": "Quentin Sommerville follows volunteers carrying out evacuations in eastern Ukraine as drone attacks rage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df58e36bbb17334ac3d8e0b65363293e390ac5c4",
      "title": "Bluesky blocks service in Mississippi over age assurance law",
      "url": "https://techcrunch.com/2025/08/24/bluesky-blocks-service-in-mississippi-over-age-assurance-law/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T20:40:32.000Z",
      "summary_90w": "",
      "raw": "In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30cb66f8a022f5217cd90c0abd0f50b5669c52d8",
      "title": "‘No place is safe’: families flee Gaza City as Israel vows to press on with offensive",
      "url": "https://www.theguardian.com/world/2025/aug/24/families-flee-gaza-city-as-israel-vows-to-press-on-with-offensive",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T20:34:21.000Z",
      "summary_90w": "",
      "raw": "Others refuse to leave as aircraft and tanks bomb outskirts of city where about half of Gaza’s 2m people now live\nIsraeli aircraft and tanks have pounded the eastern and northern outskirts of Gaza City, destroying buildings and homes, as Israeli leaders vowed to press on with an expanded large-scale offensive on the city.\nWitnesses reported the sound of continuous explosions overnight from Saturday night into Sunday morning in the areas of Zeitoun and Shejaia. Meanwhile, tanks shelled houses and roads in the nearby Sabra neighbourhood and several buildings were blown up in the northern area of Jabaliya.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d1090963af2e1786e42f7adc3aa5dcf0215da30",
      "title": "Israeli strikes hit Yemen’s capital in retaliation for earlier Houthi attacks",
      "url": "https://www.theguardian.com/world/2025/aug/24/israeli-strikes-hit-yemen-capital-in-retaliation-for-earlier-missile-attacks",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T20:33:51.000Z",
      "summary_90w": "",
      "raw": "Health officials report dozens of casualties in Sana’a, including six deaths\nIsraeli strikes have hit the Yemeni capital, Sana’a, in retaliation for Houthi missiles fired towards Israel, with Houthi health officials saying the attack had killed six people.\nThe strikes on Sunday were the latest in more than a year of direct attacks and counterstrikes between Israel and Houthi militants in Yemen, part of a spillover from the war in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75f29ceb46f81178add54873b91287f1000f7617",
      "title": "Former Meta exec Nick Clegg offers careful criticism of ‘cloyingly conformist’ Silicon Valley",
      "url": "https://techcrunch.com/2025/08/24/former-meta-exec-nick-clegg-offers-careful-criticism-of-cloyingly-conformist-silicon-valley/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T20:32:56.000Z",
      "summary_90w": "",
      "raw": "Meta’s former policy chief Nick Clegg seems to be walking a tightrope as he promotes his upcoming book, “How to Save the Internet.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc0f3de2121be64e6162b8b1456ff89c521803e7",
      "title": "Israel hits Yemen's Houthis after reports group used cluster bomb",
      "url": "https://www.bbc.com/news/articles/c0kzy7r8pl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T20:07:58.000Z",
      "summary_90w": "",
      "raw": "The strikes come after Israel said the Houthis used cluster munitions in a missile fired at Israel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bdf8a958b9e9af38a8b042d4d2740d4074138e76",
      "title": "Netflix’s ‘KPop Demon Hunters’ is probably the biggest movie in theaters",
      "url": "https://techcrunch.com/2025/08/24/netflixs-kpop-demon-hunters-is-probably-the-biggest-movie-in-theaters/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T19:59:29.000Z",
      "summary_90w": "",
      "raw": "This is Netflix's first time winning the domestic box office.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c2c0499d96f79fbac33436146400c56e194d041",
      "title": "Zelensky vows to continue fighting as Ukraine marks independence day",
      "url": "https://www.bbc.com/news/articles/czxy2v9dzgxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T18:42:54.000Z",
      "summary_90w": "",
      "raw": "Russia said power and energy facilities had been targeted by Ukraine, which accused Russia of \"spreading manipulations\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "846f7295dc0b0ee26b648b0acf24b9607560992f",
      "title": "TechCrunch Mobility: Waymo’s Big Apple score and Nvidia backs Nuro",
      "url": "https://techcrunch.com/2025/08/24/techcrunch-mobility-waymos-big-apple-score-and-nvidia-backs-nuro/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T18:05:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility, your hub for news, analysis, and scoops around the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5910a0246075b9f5e5c884cb781d0d0f8a528486",
      "title": "UK's Chagos Islands deal 'significant victory', says Pope",
      "url": "https://www.bbc.com/news/articles/cx2p1k1r2glo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T17:56:10.000Z",
      "summary_90w": "",
      "raw": "Pope Leo XIV said he hoped Mauritian authorities would ensure the refugees are able to return home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a255297527200c2500343b1f49d7ceb503d6bc0",
      "title": "More than 30 jihadists killed in air strikes, Nigerian military says",
      "url": "https://www.bbc.com/news/articles/cq58123z814o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:38:15.000Z",
      "summary_90w": "",
      "raw": "Concern is mounting about \"war-time levels of slaughter\" in Nigeria, including a resurgence of jihadist activity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "915159ad7a01a9d27496a3e64d3ddc11bc2fb0fe",
      "title": "More than 500,000 ordered to evacuate as typhoon heads for Vietnam",
      "url": "https://www.bbc.com/news/articles/cx2pw5ypwqeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:34:38.000Z",
      "summary_90w": "",
      "raw": "Typhoon Kajiki is brushing past Hainan in China before heading for Vietnam, forecasters say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "375e731d410021cae7f576bcb0656c8fab38d147",
      "title": "Three sisters drown in migrant boat in Mediterranean, rescuers say",
      "url": "https://www.bbc.com/news/articles/cp89rqgjq1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T14:26:21.000Z",
      "summary_90w": "",
      "raw": "There was \"sheer horror\" when survivors realised that the girls aged nine, 11 and 17 had died, a rescuer says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a146fa6b0f20aa3b1962f135774851fd288ae6b9",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/24/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T14:14:00.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35c35b12dd08530ca6e5c6caefb9daab525abe03",
      "title": "Elon Musk says xAI has open sourced Grok 2.5",
      "url": "https://techcrunch.com/2025/08/24/elon-musk-says-xai-has-open-sourced-grok-2-5/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-24T14:00:35.000Z",
      "summary_90w": "",
      "raw": "Elon Musk’s xAI has made an older version of its AI model Grok — specifically, the model weights used to shape Grok 2.5 —  available on the open source platform Hugging Face.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8b96070861800207cfbc7f605b3e993a93b59a2",
      "title": "Canada's retaliatory tariffs have left the U.S. wine industry reeling",
      "url": "https://www.npr.org/2025/08/24/nx-s1-5502688/canadas-retaliatory-tariffs-have-left-the-u-s-wine-industry-reeling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-24T12:51:55.000Z",
      "summary_90w": "",
      "raw": "NPR's Ayesha Rascoe talks to Joan Kautz of Ironstone Vineyards, a winery in California, about the impact of Canadian tariffs on the U.S. alcohol industry.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ccf43e57e6760a9a854e93fad8d0c5364d8d4493",
      "title": "Israel pounds Gaza City in preparation for planned offensive",
      "url": "https://www.bbc.com/news/articles/cvg478y8l09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T12:18:44.000Z",
      "summary_90w": "",
      "raw": "Sixty-four people were killed in Israeli attacks across Gaza in the past 24 hours, the territory's Hamas-run health ministry said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485fe0041f0b8a9016a6932f304d00b93508ea5a",
      "title": "Declaration of famine in Gaza lays bare Israel’s disregard for humanitarian duty",
      "url": "https://www.theguardian.com/world/2025/aug/24/gaza-famine-declaration-israel-humanitarian-duty-analysis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T09:00:27.000Z",
      "summary_90w": "",
      "raw": "The IPC’s findings that a quarter of Palestinians in Gaza are starving should mark an urgent turning point in this war\nThe declaration on Friday of widespread famine in Gaza by the Integrated Food Security Phase Classification (IPC) should mark a turning point in the war. The IPC, which represents a fastidious survey of available data, is regarded as the international gold standard in nutritional crises.\nLong-criticised by humanitarians in other emergencies for its overabundance of caution, the IPC’s declaration of Level 5 – “catastrophic” hunger – in Gaza is a significant moment. Famine, under the IPC’s exacting criteria, requires three critical thresholds to be passed: extreme food deprivation, acute malnutrition and starvation-related deaths, all of which are now visible in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9e1b95c4e9adaa421f7ce65ae9c39bf3f048cec",
      "title": "My trip to North Korea's 'Benidorm' - flanked by guards and full of rules",
      "url": "https://www.bbc.com/news/articles/c707d1ez0kno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-24T07:36:33.000Z",
      "summary_90w": "",
      "raw": "Anastasia, one of the first Russian visitors to North Korea's new resort, tells of \"immaculate\" beaches, meaty meals and strict rules.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5795c618e230224998fd210f35a94a572ac3085",
      "title": "Taiwan referendum on reopening last nuclear plant fails",
      "url": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T05:17:03.000Z",
      "summary_90w": "",
      "raw": "Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe\nA referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved.\nThe plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ced74bc046c44a55cb8bc5d3898f2cddeb8562ba",
      "title": "North Korean leader oversees new missile test, state media says",
      "url": "https://www.bbc.com/news/articles/cj3lp47nxdjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T23:51:33.000Z",
      "summary_90w": "",
      "raw": "Two new air defence missiles with \"superior combat capability\" have been fired in a test observed by Kim Jong Un.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a06a17b45576aba1d545f922a7ee74b9bc40633",
      "title": "Boxed in by shifting tariff rules, European shippers pause some U.S.-bound parcels",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513936/dhl-parcel-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-23T22:21:20.000Z",
      "summary_90w": "",
      "raw": "New customs regulations take effect August 29, and many European postal agencies and companies say until new systems are set up they can't ship some goods. Gifts worth less than $100 are not affected.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b9920e3d1c6a4ec77905356ceff0d85fb4bdac1",
      "title": "Turkish first lady appeals to Melania Trump over Gaza children",
      "url": "https://www.bbc.com/news/articles/cn47ppy382wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T21:13:56.000Z",
      "summary_90w": "",
      "raw": "In a letter, Turkey's first lady asks Mrs Trump to appeal to Israel to end the war in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "176cd8861ff38a96a26c3e6f4bf8756921b6b905",
      "title": "US government wants to deport Kilmar Ábrego García to Uganda",
      "url": "https://www.bbc.com/news/articles/cewyppww09jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T20:32:30.000Z",
      "summary_90w": "",
      "raw": "His lawyers accuse the government of trying to \"coerce\" him to plead guilty by threatening to deport him \"halfway across the world\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9845e64197622b7aaeec3639acfc59b979bb340c",
      "title": "OpenAI warns against SPVs and other ‘unauthorized’ investments",
      "url": "https://techcrunch.com/2025/08/23/openai-warns-against-spvs-and-other-unauthorized-investments/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-23T20:26:46.000Z",
      "summary_90w": "",
      "raw": "OpenAI isn't the only AI company looking to crack down on SPVs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "efbfe2e90e6af4b69dccfad4a51002d5ac218782",
      "title": "Ghislaine Maxwell denies seeing 'inappropriate' conduct by Trump",
      "url": "https://www.bbc.com/news/articles/cdd3pe6189go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T20:24:11.000Z",
      "summary_90w": "",
      "raw": "Maxwell was interviewed after pressure on Trump to release information about whether prominent figures were involved in Jeffrey Epstein's crimes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2cf8d0e158c5b1da78ea857ddc929af645519087",
      "title": "Amazon AGI Labs chief defends his reverse acquihire",
      "url": "https://techcrunch.com/2025/08/23/amazon-agi-labs-chief-defends-his-reverse-acquihire/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-23T20:01:04.000Z",
      "summary_90w": "",
      "raw": "The former Adept CEO said he hopes to be \"remembered more as \"an AI research innovator\" than a \"a deal structure innovator.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8e6575dd0308f9f931cf4375d96a87e4d375f2b",
      "title": "Pentagon fires intelligence agency chief after Iran attack assessment",
      "url": "https://www.bbc.com/news/articles/c2dj217z2w6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T16:24:47.000Z",
      "summary_90w": "",
      "raw": "The firing comes just weeks after a White House rebuke of a leaked intelligence report assessing the impact of US strikes on Iran.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55e29957a5eb3bc49b955bb79cafdb1a75ff1337",
      "title": "The Trump administration’s big Intel investment comes from already awarded grants",
      "url": "https://techcrunch.com/2025/08/23/the-trump-administrations-big-intel-investment-comes-from-already-awarded-grants/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-23T16:07:30.000Z",
      "summary_90w": "",
      "raw": "While Intel says the government is making an “$8.9 billion investment in Intel common stock,” the administration does not appear to be committing new funds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf9b5982589166623a19906f5fb5dd66ad1ac94c",
      "title": "Trump administration halts work on an almost-finished wind farm",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5513919/trump-stops-offshore-wind-renewable-energy",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-23T15:38:19.000Z",
      "summary_90w": "",
      "raw": "The Revolution Wind farm was slated to start sending power to homes and businesses in Rhode Island and Connecticut starting next year.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "666a5bb9def055631917536bc63ca6369e33b62d",
      "title": "Prison conduct, remorse and contraband: What we learned from Menendez parole hearings ",
      "url": "https://www.bbc.com/news/articles/c3ez2j3jzgjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T13:03:06.000Z",
      "summary_90w": "",
      "raw": "Phones, candles and behaviour by the long-term US inmates factored into the refusal of their release.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "219a1700dbfa71a6f9ccb5049c6ec186ae6086d6",
      "title": "Man who alleged hundreds were raped and buried in Indian temple town arrested",
      "url": "https://www.bbc.com/news/articles/cgm2z9zjgx7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-23T09:31:01.000Z",
      "summary_90w": "",
      "raw": "The former temple cleaner's startling claims threw the town of Dharmasthala in Karnataka into turmoil.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43a134db32c1cca53b9d6a814b8d2951936b74e0",
      "title": "North Korea accuses South Korea of ‘deliberate provocation’ after warning shots fired at soldiers on border",
      "url": "https://www.theguardian.com/world/2025/aug/23/north-korea-accuses-south-korea-of-deliberate-provocation-after-warning-shots-fired-at-soldiers-on-border",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-23T04:09:47.000Z",
      "summary_90w": "",
      "raw": "Seoul says military fired warning shots on Tuesday after troops from the North briefly crossed border\nSouth Korea fired warning shots at North Korean soldiers who briefly crossed the heavily fortified border earlier this week, Seoul said on Saturday, after Pyongyang accused it of a “deliberate provocation” that risks “uncontrollable” tensions.\nSouth Korea’s new leader Lee Jae Myung has sought warmer ties with the nuclear-armed North and vowed to build “military trust”, but Pyongyang has said it has no interest in improving relations with Seoul.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f87870a407dbf9a8df29bc574cc3e09744c0ae9b",
      "title": "Meta partners with Midjourney on AI image and video models",
      "url": "https://techcrunch.com/2025/08/22/meta-partners-with-midjourney-on-ai-image-and-video-models/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T21:41:31.000Z",
      "summary_90w": "",
      "raw": "Meta's chief AI officer said that the company is partnering with Midjourney to license its AI image and video model technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91eb6435967d44c0bafb0d147e05ee5b7fa42eb6",
      "title": "Coinbase CEO explains why he fired engineers who didn’t try AI immediately",
      "url": "https://techcrunch.com/2025/08/22/coinbase-ceo-explains-why-he-fired-engineers-who-didnt-try-ai-immediately/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T21:07:21.000Z",
      "summary_90w": "",
      "raw": "After getting licenses to cover every engineer, some at the cryptocurrency exchange warned Armstrong that adoption would be slow, predicting it would take months to get even half the engineers using AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d9b7f31f0f519de117855cb4577e107879ca18e1",
      "title": "How Israel's policies created famine in Gaza",
      "url": "https://www.bbc.com/news/articles/ckg4p90z1kxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-22T19:55:47.000Z",
      "summary_90w": "",
      "raw": "Israel has systematically obstructed food entering Gaza, aid agencies say, as a UN-backed body confirms a famine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8b1b4859f7ef18fa8de8df0b2a07aca08701eb0",
      "title": "The EV tax credit ends soon — but there's a little bit of wiggle room for car buyers",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511244/ev-tax-credit-deadline-irs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T19:12:24.000Z",
      "summary_90w": "",
      "raw": "A federal EV tax credit worth up to $7,500 ends Sept. 30. But the IRS has just clarified that shoppers don't need to actually have the keys in hand by the deadline to get the credit.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "41871fdc131ac2dcc651ea909ada9228a26bcafb",
      "title": "Trump says 'We want to be very good to Canada,' as its leader drops some tariffs",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5511357/canada-carney-tariffs-us",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T18:08:47.000Z",
      "summary_90w": "",
      "raw": "After Canadian Prime Minister Mark Carney announced he would lower tariffs, President Trump said \"We want to be very good to Canada. I like Carney a lot. I think he's a very good person.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4e85a38f37708c91cd8de79467d795f433ad1bb1",
      "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump",
      "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T18:02:17.000Z",
      "summary_90w": "",
      "raw": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain\nCanada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States.\nFrom 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abba3e8df4d89d1a4f89f8e5d34dd56135785fbc",
      "title": "Fed Chair Jerome Powell signals possible rate cut, sending stocks sharply higher",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509941/jerome-powell-federal-reserve-interest-rates-jackson-hole",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T16:05:33.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve chairman Jerome Powell signaled a possible interest rate cut in the months to come, sending stocks sharply higher.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "229e5ba5d2982b5f1832044ba1d34d963fb76fa9",
      "title": "Thousands face deportation to danger as Trump targets temporary protections",
      "url": "https://www.theguardian.com/us-news/2025/aug/22/temporary-protected-status-tps-immigration-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T14:00:34.000Z",
      "summary_90w": "",
      "raw": "People with temporary protected status face possible deportation even though their home countries – including Afghanistan and Haiti – remain unsafe\nMany thousands of immigrants living in the US who came from certain countries regarded as risky or dangerous are at the mercy of US judges and the Trump administration’s agenda to slash their work authorization and protection from deportation.\nSince taking office, the Trump administration has announced the termination of temporary protected status (TPS) for citizens of seven of the 15 countries previously designated for shelter under this legal umbrella – with the Department of Homeland Security (DHS) controversially citing improved conditions in some of those places.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d2e50777871c1c54187d67c71ed62e025909adf",
      "title": "Home sales are ticking up — and more are coming to market",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5510058/housing-market-mortgage-rates-homebuilding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T09:00:00.000Z",
      "summary_90w": "",
      "raw": "High mortgage rates cooled home sales over the last few years. But data released this week shows signs that things may be thawing a bit.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3d1e7b78075c22105d4b0bf1e730c6af6090527e",
      "title": "She's cared for America's elderly for decades. Trump wants her gone by Sept. 8",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5502439/trump-immigration-tps-health-care",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-22T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has moved to end temporary protected status for immigrants from Honduras and other countries. Among them are health care workers tending to older and disabled people.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "df32adc48d8de520c7f8e3beb96fc3a33dc37bf4",
      "title": "Thailand former PM cleared of royal insult charge but Shinawatra dynasty’s fate still hangs in balance",
      "url": "https://www.theguardian.com/world/2025/aug/22/thailand-former-pm-thaksin-shinawatra-royal-insult-lese-majesty-court-case",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T04:38:30.000Z",
      "summary_90w": "",
      "raw": "Lese-majesty case against Thaksin Shinawatra is dismissed, but his daughter Paetongtarn will hear next week if she will be removed as prime minster\nA criminal court in Thailand has dismissed a case accusing former prime minister Thaksin Shinawatra of defaming the monarchy, the first of three court cases that could decide the fate of one of the country’s prominent political families.\nThaksin was accused of insulting the monarchy during an interview with South Korean newspaper Chosun Ilbo in 2015.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e7b9d354350303b743edc7e9ec3cd2d754f96ce0",
      "title": "Indonesia working on details of plan to treat 2,000 people from Gaza amid concerns about right to return",
      "url": "https://www.theguardian.com/world/2025/aug/22/indonesia-plans-details-treat-2000-injured-palestinians-galang-island",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:17:11.000Z",
      "summary_90w": "",
      "raw": "Security ministry and the ministries of health and foreign affairs have met to discuss how the controversial proposal to treat Palestinians would work\nThe Indonesian government is working on plans to treat 2,000 people from war-ravaged Gaza, holding a series of inter-ministerial discussions to discuss logistics, legality and foreign policy implications relating to the highly sensitive proposal, according to a senior government official.\nIndonesia announced earlier this month that it would provide temporary medical assistance to 2,000 Palestinians from Gaza, with the uninhabited island of Galang identified as one possible site. Located just south of Singapore, the island was once home to a former camp for Vietnamese refugees and most recently the site of a pandemic hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7571ab87fd83998490d50825567d17e7746dbe56",
      "title": "Bolsonaro given 48 hours to explain alleged plans to flee to Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/21/bolsonaro-given-48-hours-to-explain-alleged-plans-to-flee-to-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T14:16:57.000Z",
      "summary_90w": "",
      "raw": "Brazilian supreme court judge sets ultimatum after police claim far-right populist sought to flee to avoid punishment over failed coup\nA supreme court judge has given Brazil’s ex-president, Jair Bolsonaro, 48 hours to explain police claims he was planning to flee to Argentina to avoid punishment for allegedly masterminding a failed coup after losing the 2022 election.\nBolsonaro’s trial for the alleged attempt to seize power is scheduled to conclude early next month. The far-right populist faces more than four decades in prison if found guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11e67f16b6483a2a58e306c44d5eb711909cb5c7",
      "title": "New Zealand to spend $3bn upgrading helicopters and ‘embarrassing’ defence planes",
      "url": "https://www.theguardian.com/world/2025/aug/21/new-zealand-seahawk-helicopters-defence-spending-planes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T03:06:28.000Z",
      "summary_90w": "",
      "raw": "Government says country will buy five Seahawk helicopters and two Airbus A321XLR aircraft\nNew Zealand will spend nearly NZ$3bn ($1.7bn) upgrading its ageing defence fleet, including replacing its “embarrassing” planes that have left multiple prime ministers grounded during international travel, the government has announced.\nThe defence minister, Judith Collins, said NZ$2bn would be spent buying five MH-60R Seahawk helicopters and another NZ$700m to buy two Airbus A321XLR aircraft.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1631129ec82de30e58c1bb8da79989ecae1ad5a0",
      "title": "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum",
      "url": "https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T01:56:35.000Z",
      "summary_90w": "",
      "raw": "Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges\nBrazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead of his judgment for allegedly plotting a military coup.\nThe far-right populist is facing a jail term of over 40 years when Brazil’s supreme court convenes next month to decide whether he is guilty of conspiring to overturn the result of the 2022 presidential election, which Bolsonaro lost to his leftwing opponent Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "34813e0f1f26d76786862ca068e099b13644362d",
      "title": "Human rights regulator criticises Met's use of facial recognition cameras",
      "url": "https://www.bbc.com/news/articles/c1kzgx4v2pko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:18:42.000Z",
      "summary_90w": "",
      "raw": "The Equality and Human Rights Commission says it believes the Met's use of the tech is unlawful.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b2c5d6d0908d4a6f91069746af4fa65f34b8ddc",
      "title": "South African minister investigated for historical racial slurs on social media",
      "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:15:35.000Z",
      "summary_90w": "",
      "raw": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts \nSouth Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid.\nMcKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts, which were still online at the time of publication.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca9dc3e79708726084045a1b585cddef480086c2",
      "title": "Uganda denies reports that it has struck deal with Trump to take in US deportees",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/uganda-trump-deal-immigration",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T13:01:24.000Z",
      "summary_90w": "",
      "raw": "Ugandan official said the east African country does not have the capability to take in undocumented immigrants\nUganda said it has not reached any agreement with the US to take in undocumented immigrants, contradicting reports that the east African country had struck a deal with the Trump administration to do so.\nHenry Oryem Okello, Uganda’s state minister for foreign affairs, told Reuters the country does not have the capability to take in immigrants. It comes as the US has deported migrants convicted of crimes in the US to non-native countries including South Sudan and Eswatini.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}