{
  "version": "1756917637618",
  "generatedAt": "2025-09-03T16:40:37.618Z",
  "items": [
    {
      "id": "4faf372ef14ce0458581ba779fffd0f15ef82fa1",
      "title": "Roblox expands use of age estimation tech and introduces standardized ratings",
      "url": "https://techcrunch.com/2025/09/03/roblox-expands-use-of-age-estimation-tech-and-introduces-standardized-ratings/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:27:08.000Z",
      "summary_90w": "",
      "raw": "Roblox says it's expanding its use of age estimation technology and entering a partnership with the International Age Rating Coalition (IARC) to standardize its game ratings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65802c583bab4f64f4913196d7747fb7e3dcb77a",
      "title": "Sports streaming hub Streameast ‘shut down’ in sting",
      "url": "https://www.theverge.com/news/770275/sports-streaming-hub-streameast-shut-down-in-sting",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T16:25:43.000Z",
      "summary_90w": "",
      "raw": "Some Streameast sites still appear to be live.\t\n\nStreameast, one of the largest sports piracy platforms in the world, has been shut down according to the Alliance for Creativity and Entertainment (ACE), an antipiracy group that counts NBC Universal, Netflix, and Disney among its members.\nACE announced in a statement that it worked alongside Egyptian authorities to shut down the “notorious” platform, and The Athletic reports that after a year-long investigation Egyptian law enforcement carried out a sting on August 24th which disrupted the platform’s streaming infrastructure. ACE claims that Streameast drew more than 1.6 billion visits across 80 domains over the past year, making it “the largest illicit live sports streaming operation in the world.”\nThe outage has already been noticed by fans over the past week, timed as it was to coincide with the new soccer season in Europe, not that I would know anything about hunting down streams for Premier League games that don’t get televised in the UK. It’s probably also no coincidence that today’s announcement comes the same week the NFL season starts.\nIt’s not clear how effective the bust has been though — at the time of writing you can find plenty of Streameast sites seemingly alive and well, listing streams for today’s MLB fixtures. ACE told The Athletic that it’s aware of these “copycat” sites and is investigating whether they’re related, or made by Streameast impersonators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5e5f1fb55e4fe00f84089fb1cc23cc890d0f7e7c",
      "title": "New Jersey Democrat faces House censure vote and removal from key committee",
      "url": "https://www.npr.org/2025/09/03/g-s1-86782/lamonica-mciver-censure-house",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T16:23:29.000Z",
      "summary_90w": "",
      "raw": "New Jersey Democrat LaMonica McIver is facing a censure vote in the House of Representatives over her arrest earlier this year at an immigration detention facility.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9855fd9603f3aa45f4f5efd5a662d51d0d9a0692",
      "title": "Trump says ‘you’ll see things happen’ if US is unhappy with Putin’s decisions – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:18:52.000Z",
      "summary_90w": "",
      "raw": "Trump makes comments while meeting Polish president Karol Nawrocki after Putin warns Russia will use ‘military means’ to achieve objectives if diplomacy fails\nPutin was also asked about the prospect of more EU sanctions against Russia or its allies, including China and India.\nHe said the leaders did not discuss this during their recent conversations.\n“I think there’s a light at the end of the tunnel. We will see.\nOtherwise, we will be forced to resolve all our objective objectives through military means.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07b20dacd4f4be4cacb4cf05c83178072854c802",
      "title": "Met chief calls for law change after Graham Linehan arrest",
      "url": "https://www.bbc.com/news/articles/c1mx09l5297o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:16:02.000Z",
      "summary_90w": "",
      "raw": "Sir Mark Rowley says officers are in an \"impossible position\" when policing online speech.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10587fbf7ffd4ee0dec75ed68a9b8396edcf704e",
      "title": "Netflix CPO Eunice Kim joins TechCrunch Disrupt 2025 to talk scaling product and reimagining entertainment",
      "url": "https://techcrunch.com/2025/09/03/netflix-cpo-eunice-kim-is-coming-to-techcrunch-disrupt-2025-to-talk-tech-tools-and-yes-its-password-sharing-strategy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:15:00.000Z",
      "summary_90w": "",
      "raw": "At TechCrunch Disrupt 2025, Netflix chief product officer Eunice Kim will be joining the Disrupt Stage to share Netflix's evolving story and what's to come.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3e9ee068b038580462aaf8c9f25520b1c7a62d4d",
      "title": "Budget compromise needed if PM ousted, says French finance minister",
      "url": "https://www.theguardian.com/world/2025/sep/03/france-budget-eric-lombard-francois-bayrou",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:07:06.000Z",
      "summary_90w": "",
      "raw": "Éric Lombard says he hopes François Bayrou will survive vote and dismisses talk of looming debt crisis\nThe French finance minister, Éric Lombard, has said the government would have to compromise on plans to cut the budget deficit if the prime minister, François Bayrou, is toppled in a confidence vote next week.\nLombard told the Financial Times that fresh negotiations would require the government to make concessions to the left to reduce the size of the fiscal package if the government falls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb3eb7b94623fc51ae1c08c10752296a5d7e4fc",
      "title": "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade",
      "url": "https://www.theguardian.com/world/2025/sep/03/china-military-parade-xi-jinping-appears-with-vladimir-putin-kim-jong-un",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:05:59.000Z",
      "summary_90w": "",
      "raw": "Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to the west\nXi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance to the west.\nPutin and Kim, the authoritarian leaders of Russia and North Korea, were among dozens of world leaders who attended the parade, a massive display of military hardware and personnel, orchestrated to mark the 80th anniversary of the end of the second world war, which China calls the War of Resistance against Japanese Aggression.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a114631059ba51302f1b10d63c5b6666689f113d",
      "title": "Trans row tribunal nurse raises new NHS legal action",
      "url": "https://www.bbc.com/news/articles/cgrqjyxzwnro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:01:05.000Z",
      "summary_90w": "",
      "raw": "The nurse intends to pursue further claims of harassment and victimisation against both the health board and specific employees.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62b2bbe3af99c2294af8dbea947ae719898013d9",
      "title": "Faisal Islam: Reeves will need her hard hat for the next three months",
      "url": "https://www.bbc.com/news/articles/cn76ly476x6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:00:57.000Z",
      "summary_90w": "",
      "raw": "The chancellor hits back at speculation over tax rises, but will need to find the money from somewhere.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9fd807b3195deb13941d9a9d6ffd1d75e43c66e",
      "title": "Reeves rejects £50bn 'black hole' in UK finances but pressure grows over Budget",
      "url": "https://www.bbc.com/news/articles/cx27nm2mn5po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T16:00:44.000Z",
      "summary_90w": "",
      "raw": "The chancellor hit back at the idea that the government faces so large a gap between spending and tax income.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c88a8bf5b4305c2abed71edf4545677e839bffe5",
      "title": "Instagram is coming to iPad, 15 years later",
      "url": "https://www.theverge.com/news/769460/instagram-ipad-app-launch-reels",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T16:00:00.000Z",
      "summary_90w": "",
      "raw": "After years of requests from users, Instagram will finally have a dedicated app for iPad. Beginning Wednesday, September 3rd, users will be able to download the new app built specifically for Apple’s tablet. But it will be slightly different than the mobile app users are accustomed to.\nMost significantly, the iPad app will open directly to a feed of Reels, the company’s TikTok competitor — perhaps a sign of the short-form-video times. Back in April, reporting indicated that Meta was working on an iPad app for Instagram after years of dragging its feet, in part prompted by the legally and politically iffy spot TikTok found itself in. For years, Instagram for iPad was something to tackle “at some point” — until its biggest competitor was facing what would effectively be a ban in the US. From this perspective, opening the app straight to Reels makes perfect sense.\nOther features will be available on iPad: Stories will still line the top of the homepage, and users will be able to switch to a “Following” tab where they’ll be able to swipe between feeds that more resemble the mobile Instagram experience (including a chronological option). The bigger screen means more space and fewer clicks: comments on Reels will appear next to full-size videos, and the DMs page will have your inbox alongside chats, similar to what Messenger looks like on desktop.\nInstagram head Adam Mosseri has said in the past that the group of people wanting an iPad app just wasn’t big enough for it to be a top priority. So what’s changed in the last few years? Perhaps the number of kids using tablets has changed the calculus, or TikTok’s regulatory vulnerability bumped this up on the to-do list. One thing that’s obvious from this is that Instagram is not letting up on Reels: it’s extended the length of clips, added the ability to repost and fast-forward them, and earlier this year was trying to recruit popular TikTokers. The company sees a future for Instagram on tablets — and it’s short-form video all the way down.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76db61ca2aab9ea9206f6c937ff185ef2831d74e",
      "title": "Instagram is finally launching an iPad app",
      "url": "https://techcrunch.com/2025/09/03/instagram-is-finally-launching-an-ipad-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Instagram is finally launching an iPad app after years of users asking the company to make one.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b19907959fae91b037286af0c679b1c96289fded",
      "title": "Xi, Putin and Kim: behind the choreographed image that could symbolise a shift in the global balance of power",
      "url": "https://www.theguardian.com/world/2025/sep/03/xi-putin-kim-choreographed-image-that-could-symbolise-shift-global-balance-power",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T15:59:48.000Z",
      "summary_90w": "",
      "raw": "In an unprecedented spectacle the leaders of Russia, China and North Korea led a group of more than 20 world leaders at a victory day parade in Beijing\n\nFull report: Xi Jinping appears with Vladimir Putin and Kim Jong-un at China military parade\n\nIt is an image that, had it been published just a few years ago, would have been dismissed as a piece of mischievous photo-shopping: the leaders of Russia and China, accompanied by the head of a pariah regime whose mission to arm his country with nuclear weapons had been opposed at the United Nations by his two companions.\nBut dramatic shifts in the geopolitical landscape – Russia’s invasion of Ukraine and, crucially, the re-election of Donald Trump – have combined to bring Xi Jinping, Vladimir Putin and North Korean leader Kim Jong-un together in what many observers are calling a dramatic redrawing of the global balance of power.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a210e9afd6743b747adc3308cc4bedee753f9de",
      "title": "Manneken Pis gets new uniform to honour soldiers who liberated Brussels",
      "url": "https://www.theguardian.com/world/2025/sep/03/manneken-pis-gets-new-uniform-to-honour-soldiers-who-liberated-brussels",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T15:58:59.000Z",
      "summary_90w": "",
      "raw": "Gift comes 8o years after Welsh guards first left replica uniform for famous statue to commemorate end of Nazi occupation\nWhen British forces commemorated the liberation of Brussels for the first time in 1945, they left a unique gift – a replica Welsh guards uniform for the Belgian city’s emblematic “peeing boy” statue, the Manneken Pis.\nNow 81 years after the Welsh guards freed Brussels from Nazi occupation, the gift has been renewed: the Manneken Pis has a new regimental uniform, including scarlet jacket embroidered with gold lace, gleaming white belt and authentic bearskin hat.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "847cdf520201641f774d1f1a7dc23443011f151a",
      "title": "US Democrats warn that controversial Gaza food organisation may be cover for intelligence operations",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-democrats-gaza-humanitarian-foundation-letter",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T15:57:46.000Z",
      "summary_90w": "",
      "raw": "Letter by senior Democrats asks state department to reveal details behind financing of Gaza Humanitarian Foundation\nSenior Democratic senators have called on secretary of state, Marco Rubio, and US ambassador to Israel, Mike Huckabee, to reveal details behind the financing and oversight of the Gaza Humanitarian Foundation as concerns grow that the organization is acting as a front for intelligence and political operations.\nThe letter, co-signed by Senators Elizabeth Warren, Chris Van Hollen and Peter Welch, accuses the state department of an “inability to answer basic questions about GHF in a timely manner” and said that the department’s “overriding of internal protocol and staff warnings is particularly concerning given it is unlikely to be able to conduct basic oversight of the funds it provided to GHF”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7782a9740391ba664ec1d8c06d9568db34f0627a",
      "title": "Venezuela’s president thinks American spies can’t hack Huawei phones",
      "url": "https://techcrunch.com/2025/09/03/venezuelas-president-thinks-american-spies-cant-hack-huawei-phones/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:44:20.000Z",
      "summary_90w": "",
      "raw": "Huawei phones, given their custom hardware and operating system, may actually be easier to hack than other brands.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e7669c02074eca8540327b6ba4738b29e76ff0a3",
      "title": "Democrats push Homeland Security Department on DACA recipients",
      "url": "https://www.npr.org/2025/09/03/g-s1-86764/daca-democrats-homeland-security",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T15:30:00.000Z",
      "summary_90w": "",
      "raw": "After the agency called on DACA recipients to self-deport, Democrats are asking for answers on how mass deportations are affecting the group of immigrants also known as 'DREAMers.'",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5bd366244456218db788c070b356081dc71af1d0",
      "title": "The Paper doesn&#8217;t hit its stride until it&#8217;s out of the office",
      "url": "https://www.theverge.com/tv-reviews/769607/peacock-the-paper-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T15:30:00.000Z",
      "summary_90w": "",
      "raw": "When NBC's adaptation of The Office first debuted in 2005, the series was panned for being a pale and uninspired imitation of its English predecessor. It took an entire season for showrunner Greg Daniels to figure out how to infuse his take on The Office with a quirky, satirical energy calibrated to appeal to American audiences. But once he did, the comedy became a ratings juggernaut for the network, which put Daniels in a position to tackle slightly more original projects.\nUnlike Parks and Rec - another Daniels series that was stylistically similar to The Office, but stood on its own -  Peacock's The Paper is a true spinoff that's working  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4aa8a87365f9d88b681837a200c2466852961b34",
      "title": "People banished to Nauru by Australia face hostile reception as $2.5bn cost of deal revealed",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/nzyq-cohort-potentially-hostile-reception-nauru",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T15:27:14.000Z",
      "summary_90w": "",
      "raw": "Home affairs department reveals just-signed transfer deal, worth $408m upfront to Nauru, forecast to cost Australia $2.5bn over 30 years\n\nGet our breaking news email, free app or daily news podcast\n\nThe group of noncitizens set to be banished by Australia to Nauru for 30 years face a potentially hostile reception because they have been described as “violent” and “appalling” by the Australian government.\nThe forcible transfer of the so-called NZYQ group – and potentially thousands more under legislation currently before parliament – to the tiny island is being quietly resented by Nauruans, sources on the island have told Guardian Australia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d7a3ae9c2f0b48c347db40bf9978d0720514565d",
      "title": "Here are the best Kindle deals right now",
      "url": "https://www.theverge.com/21539047/best-amazon-kindle-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T15:27:11.000Z",
      "summary_90w": "",
      "raw": "When it comes to finding a device to read ebooks, you have a few options to choose from. You can always buy a tablet or use your phone, but those devices are multipurpose and can be used for a ton of things, like surfing the web or doom-scrolling on X or Bluesky. If you are looking for something to strictly read books, e-readers, while niche, are designed to store all of your books in a virtual library with limited functionality.\n \n\nThe best Kindle (2024) deals\nThe best Kindle Kids (2024) deals\nThe best Kindle Paperwhite (2024) deals\nThe best Kindle Paperwhite Kids (2024) deals\nThe best Kindle Scribe (2024) deals\nThe best Kindle Colorsoft Signature Edition deals\nThe best Kindle Colorsoft Kids deals\n\nAmazon, one of the pioneers of the e-reader, has dominated the space for years with its ever-expanding Kindle lineup, which consists of several unique models with their own pros and cons. The bulk of the devices function as simple ebook readers; however, with the Kindle Scribe, Amazon is moving beyond books and into the realm of writing — something that should make future Kindles function more akin to physical paper.\nBelow, we’ve listed each model currently available. Sometimes there isn’t a deal for one or even any of the products, but in those cases, we’ve listed the most recent sale price. \nThe best Kindle (2024) deals\nWhat does it mean when a Kindle is “ad-supported”?\nAmazon Kindle e-readers come in different storage configurations, but there is also an additional option that allows you to buy the e-reader with or without ads. Ad-supported Kindles will display personalized advertisements on the lock screen when it is in sleep mode or at the bottom of the homescreen when the device is connected to Wi-Fi. Typically, you save about $20 by buying the ad-supported version, but if you decide to remove ads later, you can make a one-time payment to cover the difference and remove the ads.\nIn case you missed it, Amazon announced a new entry-level Kindle in October of last year, one that was designed to replace the outgoing 2022 model. The latest Kindle — which starts at $109.99 — boasts a brighter 94-nit display, improved contrast levels, and slightly faster page turns. It also comes in a “matcha” green instead of “denim,” just in case you’re not a fan of the default black color. Otherwise, though, it’s nearly identical to its predecessor, with the same six-inch 300ppi screen, support for USB-C, and 16GB of base storage.\nIn the past, Amazon’s newest ad-supported Kindle has dropped to as low as $84.99 ($25 off) with three months of Kindle Unlimited. Right now, however, you can only buy the base Kindle at Amazon, Best Buy, and Target for its full retail price of $109.99.\nKindle (2024)\nAmazon’s most recent entry-level Kindle features a 6-inch, 300ppi display, support for USB-C charging, and up to six weeks of battery life. It’s also brighter than previous models and offers noticeably faster performance.\n\n\nWhere to Buy:\n\n $109.99 at Amazon\n $109.99 at Best Buy\n $109.99 at Target\n\nThe best Kindle Kids (2024) deals\nAmazon also updated its kid-friendly Kindle in late 2024. The new Kindle Kids is identical to the standard model but comes with several accessories and provides age-appropriate content for younger readers who prefer digital books. Like the last-gen Kindle Kids, the latest model retails for $20 more than the base model, bringing the MSRP to $129.99.\nIn terms of add-ons, the newest Kindle Kids edition consists of four items: the device, a protective case, a two-year extended replacement guarantee (in the event the device breaks), and six months of Amazon Kids Plus. The last feature is the biggest selling point of the device aside from the kid-friendly patterns and lack of ads, as it allows parents to grant their child access to games, videos, and books — including those in the Percy Jackson and Harry Potter series — at no additional cost.\nPreviously, we’ve seen the latest Kindle Kids sell for as low as $94.99 ($35 off). Right now, however, you can only pick it up at Amazon, Best Buy, and Target at its full price of $129.99.\nKindle Kids (2024)\nAmazon’s Kindle Kids is identical to the standard Kindle — meaning it packs a 300ppi display and support for USB-C charging — but comes with a case, an extended two-year warranty, and six months of Amazon Kids Plus.\n\nWhere to Buy:\n\n $129.99 at Amazon\n $129.99 at Best Buy\n $129.99 at Target\n\n\nThe best Kindle Paperwhite (2024) deals\nThe latest Kindle Paperwhite, which launched last year, is Amazon’s 12th-gen model. Considering it’s one of the company’s higher-end configurations, it offers all the features found in the entry-level Kindle, including USB-C charging and a crisp 300ppi display. It’s noticeably faster than Amazon’s base ebook reader and features IPX8 waterproofing, a larger seven-inch display, and longer battery life.\nDuring events like Black Friday and Cyber Monday, we’ve seen the standard Paperwhite drop to as low as $129.99. Sadly, the standalone model is currently only available at Amazon, Best Buy, and Target starting at $159.99 (its full retail price). If you’re okay with purchasing a bundle, you can grab it at Amazon with a power adapter and either a green, pink, or black fabric cover for $196.97 ($20 off); it’s also available at Amazon with a plant-based leather cover in green, pink, or black for $202.97 (also $20 off).\nRead our Kindle Paperwhite (2024) review.\nKindle Paperwhite (2024)\nAmazon’s latest Paperwhite features a larger seven-inch display and noticeably faster performance. It also boasts longer battery life than the previous model, retains IPX8 waterproofing, and includes a USB-C port. Read our review.\n\nWhere to Buy:\n\n $159.99 at Amazon (ad-supported)\n $159.99 at Best Buy (ad-supported)\n $159.99 at Target (ad-supported)\n\n\n2024 Kindle Paperwhite Essentials Bundle (with ads)\nThe seven-inch Kindle Paperwhite features a larger display and faster performance than Amazon’s entry-level ebook reader. You can also buy it in a bundle with a cover and a USB-C charger. \n\nWhere to Buy:\n\n $216.97 $196.97 at Amazon (fabric cover)\n $222.97 $202.97 at Amazon (leather cover)\n\nLike other Kindles, the new Paperwhite is available in a few different configurations — including an ad-free Signature Edition that’s identical to the standard model but comes with 32GB of storage, Qi wireless charging, and a backlight that will automatically adjust when needed. \nIn the past, the Signature Edition has been discounted to $149.99 ($50 off). Currently, however, it is only available at Amazon, Best Buy, and Target for its usual price of $199.99. You can also pick it up at Amazon with a wireless charging dock and a black, green, or pink fabric cover starting at $251.97 ($25 off). It’s also available at Amazon with a plant-based leather cover in black, green, or pink for $257.97 ($25 off).\nKindle Paperwhite Signature Edition (2024)\nThe premium Kindle Paperwhite Signature Edition offers the same design and performance as the standard model but with more storage and support for wireless charging.\n\nWhere to Buy:\n\n $199.99 at Amazon\n $199.99 at Best Buy \n $199.99 at Target\n\n\nKindle Paperwhite Signature Edition Essentials Bundle\nAmazon’s step-up Kindle Paperwhite bundle includes a Kindle Paperwhite Signature Edition, a wireless charging dock, and your choice of either a fabric or plant-based cover.\n\nWhere to Buy:\n\n $276.97 $251.97 at Amazon (fabric cover)\n $282.97 $257.97 at Amazon (leather cover)\n\nThe best Kindle Paperwhite Kids (2024) deals\nAmazon also rolled out a Kindle Paperwhite Kids for $179.99 in 2024. It’s identical to the standard Kindle Paperwhite, with the same waterproof design and sharp, seven-inch display. However, like the Kindle Kids, the e-reader is free of ads and offers optional parental controls. It also comes bundled with a kid-friendly cover, a two-year extended replacement guarantee, and six months of Amazon Kids Plus.\nAlthough the Kindle Paperwhite Kids has been known to occasionally drop to $129.99 ($50 off) during special sales events, it’s currently only available for its usual price of $179.99 at Amazon, Best Buy, and Target.\nKindle Paperwhite Kids (2024)\nAmazon’s kid-friendly Paperwhite is the same as the standard Paperwhite, but it’s ad-free and comes with the added benefits of a two-year hardware protection plan, six months of Amazon Kids Plus, and a choice of three kid-friendly covers. \n\nWhere to Buy:\n\n $179.99 at Amazon\n $179.99 at Best Buy\n $179.99 at Target\n\n\nThe best Kindle Scribe (2024) deals\nLike its predecessor, the second-gen Kindle Scribe is Amazon’s biggest e-reader. It packs a 10.2-inch display with 300ppi resolution, along with the same great battery life for which Kindles are known. What separates the Scribe from other Kindles, however, is that it comes with a stylus, which can be used to jot down notes or doodle in the ebook reader’s built-in notebook. With the latest Scribe, Amazon also introduced a new Active Canvas feature, so you can scribble notes directly on ebook pages, as well as a suite of AI-powered features that can summarize your notes and refine your handwriting.\nAlthough we recently saw the standard Kindle Scribe go for an impressive $259.99 ($140 off), it’s currently only available for its usual $399.99 at Amazon, Best Buy, and Target. You can also pick up the base Scribe at Amazon as a part of a bundle with a 9W power adapter, a Premium Pen, and either a plant-based leather cover starting at $444.97 ($55 off) or a “premium” leather cover starting at $459.97 ($60 off). Alternatively, the 64GB version is available at Amazon with the same accessories and a premium leather cover for $504.97 ($65 off).\nRead our Kindle Scribe (2024) review.\nKindle Scribe (2024)\nThe latest Kindle Scribe is a 10.2-inch e-reader with a stylus for taking notes. It’s faster than its predecessor and offers a host of new features, including one that lets you jot notes directly in your book.\n\nWhere to Buy:\n\n $399.99 at Amazon (16GB)\n $399.99 at Best Buy (16GB)\n $449.99 at Amazon (64GB)\n\n\nKindle Scribe Essentials Bundle\nAmazon’s base Kindle Scribe Essentials Bundle comes with a 16GB Kindle Scribe, a Premium Pen, a power adapter, and a cover in the color of your choice.\n\n\nWhere to Buy:\n\n $489.97 $444.97 at Amazon (with plant-based leather cover)\n $519.97 $459.97 at Amazon (with premium leather cover)\n\n\nThe best Kindle Colorsoft Signature Edition deals\nNearly a year ago, in October 2024, Amazon announced its first color e-reader, the Kindle Colorsoft Signature Edition. Like the Kindle Paperwhite Signature Edition, it boasts a seven-inch display with a crisp 300ppi resolution, IPX8 water resistance, wireless charging, and 32GB of storage. However, unlike the Paperwhite, the e-reader offers a color mode, which cuts the resolution in half. Thankfully, it’s still vibrant for a color E-Ink screen despite the lower resolution, rendering it particularly ideal for reading comic books and manga.\nMore recently, Amazon introduced a cheaper Colorsoft, one that retails for $249.99 and comes with only 16GB of storage. It lacks wireless charging and an auto-adjusting front light, but it’s otherwise identical to the first-gen model. \nThe 16GB model has yet to receive a discount, and while the 32GB Signature Edition has gone on sale for as low as $179.99 (100 off) previously, it can now only be found at its usual $279.99 price at Amazon, Best Buy, and Target. However, you can save some money at Amazon if you buy it as a part of a bundle for $327.97 ($53 off), which nets you a wireless charging dock and plant-based leather cover in black, pink, or green. If you want a more premium experience, Amazon even sells it with a leather cover in red or black for $349.97 ($35 off).\nRead our Kindle Colorsoft review.\nKindle Colorsoft Signature Edition\nThe Kindle Colorsoft Signature Edition is Amazon’s first e-reader with a color display. It also boasts 32GB of storage, waterproofing, and support for wireless charging.\n\nWhere to Buy:\n\n $279.99 at Amazon\n $279.99 at Best Buy\n $279.99 at Target\n\n\nKindle Colorsoft Signature Edition Essentials Bundle\nThe Kindle Colorsoft Signature Edition is Amazon’s first color e-reader. It comes with wireless charging, IPX8 water resistance, and 32GB of storage. It retails for $279.99 by itself, but Amazon also sells it as part of a bundle that contains a wireless charging dock and one of two covers.\n\nWhere to Buy:\n\n $362.97 $327.97 at Amazon (with plant-based cover)\n\nThe best Kindle Colorsoft Kids deals\nLast month, Amazon announced a kid-friendly version of the Colorsoft with 16GB of storage and an MSRP of $269.99. Like the Signature Edition, the Kindle Colorsoft Kids offers a seven-inch color display and IPX8 water resistance, but it lacks wireless charging. The ad-free ebook reader also comes with one of two covers, a one-year subscription to Amazon Kids Plus, an extended two-year warranty, and optional parental controls.\nGiven how recently it launched, there are currently no deals available on the Colorsoft Kids; however, you can still buy it at Amazon, Best Buy, and Target for its full retail price of $269.99.\nKindle Colorsoft Kids\nLike the standard model, Amazon’s kid-friendly Colorsoft comes with a seven-inch color display and waterproofing. The 16GB e-reader also offers parental controls, a two-year warranty, a protective cover, and a year of Amazon Kids Plus.\n\nWhere to Buy:\n\n $269.99 $239.99 at Amazon\n $269.99 $239.99 at Best Buy\n $269.99 $239.99 at Target",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1416ef0c89ba604e38a7502a56771d6f0c565655",
      "title": "How to watch Apple announce the iPhone 17",
      "url": "https://techcrunch.com/2025/09/03/how-to-watch-apple-announce-the-iphone-17/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:27:01.000Z",
      "summary_90w": "",
      "raw": "Apple is debuting the iPhone 17 at its annual hardware event on September 9.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "efc922011ec0d9005c785343f75d83faa233bba6",
      "title": "Impatience in Madrid as Pedro Sánchez puts Europe’s inaction on Gaza in the spotlight",
      "url": "https://www.theguardian.com/world/2025/sep/03/impatience-in-madrid-as-pedro-sanchez-puts-europes-double-standards-in-the-spotlight",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T15:17:18.000Z",
      "summary_90w": "",
      "raw": "In an exclusive interview with the Guardian, Spain’s prime minister admitted that the EU’s refusal to hold Israel to account amounts to failure. Plus, Russia’s ‘undeniable interference’\nAgainst the scale of civilian slaughter, famine and mounting evidence of war crimes in Gaza, Europe’s political leaders have been passive to the point of complicity, argue many human rights advocates and even former high-ranking EU officials.\nNow the Spanish prime minister has come close to acknowledging as much. In an interview with the Guardian, Pedro Sánchez characterised Europe’s refusal to act against the Israeli government as a moral and political failure that would damage its global credibility for years to come. Sánchez warned that Europe’s response to “one of the darkest episodes of the 21st century” has been “a failure, absolutely”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "194bd88b0d975061cdf8143d28e14ed6320cf100",
      "title": "Google&#8217;s best-ever 4K streamer is within $1 of its lowest price",
      "url": "https://www.theverge.com/tech/769978/google-tv-streamer-4k-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T15:16:20.000Z",
      "summary_90w": "",
      "raw": "Google’s TV Streamer 4K is on sale for $79.99 ($20 off).\t\n\nIt’s rare to find a gadget that can handle two totally separate tasks very well, but Google’s TV Streamer 4K pulls it off. The 4K set top box allows you to stream your favorite TV shows and movies, and is also an impressive smart home hub, with support for Matter and a built-in Thread radio. It’s currently on sale for $79.99 ($20 off) at Amazon, Best Buy, and Walmart, which is its lowest price since May, and a dollar shy of its lowest price to date.\nGoogle TV Streamer (4K)\nGoogle’s terrific TV Streamer (4K) is the company’s best attempt at a streaming device yet, with built-in ethernet, an excellent interface, and smart home compatibility with both Matter and Thread. Read our review.\n\nWhere to Buy:\n\n $99.99 $79.99 at Amazon\n $99.99 $79.99 at Walmart\n $99.99 $79.99 at Best Buy\n\nThe TV Streamer 4K is bigger than a streaming dongle like the Fire TV Stick, but won’t take up much room on top of your TV stand. It has a gigabit ethernet port for wired networking and a HDMI 2.1 port to send a 4K 60Hz signal to your TV or projector. It supports multiple HDR (High Dynamic Range) and surround sound audio formats, including Dolby Vision and Dolby Atmos. In our tests, the TV Streamer 4K took about 10 minutes to set up — including downloading and installing a software update — when using the Google Home app on a smartphone. The TV Streamer asks whether you’d like to set up a child’s profile during setup, which is helpful if you have kids. \nThe Google TV Streamer 4K runs on Android TV, which we found easy to navigate using buttons on the remote or our voice via the remote’s built-in mic and Google Assistant. Google Assistant recognized our voice requests, and took us directly to the shows we wanted to watch (most of the time). Android TV has apps for every major streaming service, and popping in and out of them constantly can get tedious, which is why it’s nice to have reliable on-board voice controls. \nIf you want a Google Home Hub to control your smart home gadgets, the TV Streamer 4K is a great choice. You can use it to connect smart lights, locks, and thermostats to Google Home, and once these devices are configured, you can control them from the TV Streamer 4K by using Google Assistant or navigating to a Home panel. It only took a few seconds to run a scene controlling multiple smart home devices simultaneously. If your TV’s built-in streaming apps are feeling sluggish, or you want to expand your smart home into the living room, the Google TV Streamer 4K is a great choice — especially now that it’s on sale. \nRead our Google TV Streamer review",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "71be41d628708f3f42f9d38a1947ce29b4544cc7",
      "title": "US strike on 'Venezuela drug boat': What do we know, and was it legal?",
      "url": "https://www.bbc.com/news/articles/cdjzw3gplv7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T15:06:27.000Z",
      "summary_90w": "",
      "raw": "Experts suggest the strike - which killed 11 alleged cartel members - may be illegal under international law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "78845bb166ba25e7cd36ac79eea70ab4480b058a",
      "title": "These 20- and 22-year-olds raised $5M from YC, General Catalyst to study online behavior using vision AI",
      "url": "https://techcrunch.com/2025/09/03/these-20-and-22-year-olds-raised-5m-from-yc-general-catalyst-to-study-online-behavior-using-vision-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:03:32.000Z",
      "summary_90w": "",
      "raw": "Founded by a 20-year-old and two 22-year-olds, Human Behavior uses vision AI to give companies a real understanding of how people use their products.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e70cfe0aefb978ed2fa6bb3574bd9a40d9edfadd",
      "title": "Warp brings new diff-tracking tools to the AI coding arms race",
      "url": "https://techcrunch.com/2025/09/03/warp-brings-new-diff-tracking-tools-to-the-ai-coding-arms-race/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The AI coding tool Warp is releasing a new set of features designed to give users more oversight over command-line coding agents, with more extensive difference tracking and a clearer view of what the coding agent is doing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3483b3ab416c1898284c912ebde6f4f2c84b1430",
      "title": "Georgian MP who accused west of ‘blackmail’ appointed security chief as report warns of autocratic takeover",
      "url": "https://www.theguardian.com/world/2025/sep/03/mamuka-mdinaradze-to-be-georgia-security-chief-as-report-warns-of-descent-into-authoritarianism",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T14:53:04.000Z",
      "summary_90w": "",
      "raw": "Mamuka Mdinaradze appointed as study says his Georgian Dream party has consolidated control\nA Georgian Dream MP who criticised the west over a “policy of blackmail and threats” has been appointed to lead the country’s security services as an authoritative report warned of an autocratic takeover.\nMamuka Mdinaradze, who was the parliamentary majority leader for the ruling party, was confirmed on Wednesday as head of the country’s powerful state security service.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44e20053e8af3095361e86cdceca817ee1005727",
      "title": "Hot mic catches Putin and Xi discussing organ transplants and immortality",
      "url": "https://www.theguardian.com/world/2025/sep/03/hot-mic-catches-vladimir-putin-xi-jinping-discussing-organ-transplants-immortality",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T14:50:19.000Z",
      "summary_90w": "",
      "raw": "Live footage of private conversation between Russian president and Chinese leader aired at Beijing military parade\nThe authoritarian strongmen Vladimir Putin and Xi Jinping have mused on how organ transplants might lead to immortality, during a brief exchange of small talk caught on a hot mic at a military parade.\nThe Russian president was in Beijing on Wednesday with the Chinese leader, who hosted allies for a ceremony to mark the 80th anniversary of the end of the second world war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6916ea357676c8ff13a9dbc324345a10b7097328",
      "title": "Radiohead to tour for first time in seven years",
      "url": "https://www.bbc.com/news/articles/cedvddjnd08o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:35:03.000Z",
      "summary_90w": "",
      "raw": "The revered band will play four nights at London's O2 Arena in November as part of a European tour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b0d650f1c508c066636a6f130ff80912efa4130",
      "title": "'Hero' plumber's firm breached multiple fundraising rules, report finds",
      "url": "https://www.bbc.com/news/articles/cly0ww5zz50o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:34:23.000Z",
      "summary_90w": "",
      "raw": "A year-long investigation found James Anderson's firm committed eight breaches of fundraising rules.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "22d054bb0a98dd08e70128fbd2b02b3322e0f3b4",
      "title": "Watch: Fountains of lava shoot into the air as Kilauea erupts",
      "url": "https://www.bbc.com/news/videos/czdjp583dg2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:30:04.000Z",
      "summary_90w": "",
      "raw": "The molten magma streamed down one of the world’s most active volcanoes and put on another fiery show on the Island of Hawaii.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4143ea5ced0cb43e6c2f5996452803c6cef67896",
      "title": "3 days left to lock in your exhibit table at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/03/3-days-left-to-lock-in-your-table-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Time is running out to showcase your startup in front of the most influential eyes in tech. In just 3 days, the exhibitor table deadline closes for TechCrunch Disrupt 2025 in San Francisco. And with only 10 tables still available (or fewer by the time you read this), every minute matters. If you’ve been on […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c68782b8e38de10056cfb32abea8cb9f10e8628",
      "title": "Jenrick criticised by judge for X post during murder trial  ",
      "url": "https://www.bbc.com/news/articles/crkjmd51807o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:27:09.000Z",
      "summary_90w": "",
      "raw": "The High Court judge described the shadow justice secretary's message as \"ill thought through\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "439e19291d1e9ebe18cd716a7dc9b3b63af3028b",
      "title": "Topshop will return to High Street in 2026",
      "url": "https://www.bbc.com/news/articles/c1l854prl9vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:25:06.000Z",
      "summary_90w": "",
      "raw": "The comeback in February 2026 will come five years after the chain closed its stores.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c61b3c44e7d3652e61fb5fe07e84b4bbd6211ebd",
      "title": "Why I love my Kenmore canister vacuum",
      "url": "https://www.theverge.com/tech/769451/why-i-love-my-kenmore-canister-vacuum",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T14:01:12.000Z",
      "summary_90w": "",
      "raw": "Emma Roth is a news writer here at The Verge, “and for me,” she explains, “that means every day is different. During the four years I’ve been here, I’ve covered breaking news and written about basically everything in the realm of tech, whether it’s streaming price hikes, the latest in AI chatbots, privacy issues surrounding age verification, and a whole lot more.”\nAlthough she covers the latest tech news and products, it turns out that one of Emma’s favorite home appliances is a decades-old vacuum cleaner. I asked her about it.\nWhen (and why) did you get the vacuum cleaner? \nI purchased this Kenmore Progressive 116 vacuum for just $7 while browsing my local Savers thrift store several years ago. I was in need of a vacuum, and it instantly caught my eye because my parents used to have one just like it. I have fond childhood memories of going to Sears to pick up new vacuum bags.\nHow well does it work?\nDespite being around a couple of decades old, this thing works just as well as any new vacuum. It may not be cordless, bagless, or ultra lightweight, but it has impressive suction that can pick up anything from crumbs to more stubborn pet hair. (I don’t have any furry pets now, but growing up with several cats and dogs, this thing ripped.)\nIt also comes with a number of attachments, including a brush, crevice cleaner, and a hard floor tool. I use it in between my robovac’s cleanings, which unfortunately doesn’t pick up half as much as the Kenmore. It’s great for just about everything in the house, including rugs, tiled floors, on the couch, and cobwebby corners.\nIs there anything you don’t like about it, or that you’d improve if you could?\nAs you can see, this isn’t the prettiest-looking vacuum around — the white plastic has completely yellowed over the years. It can also be a pain to lug around the house. I’d be lying if I said that I didn’t violently yank the hose every so often to get this thing rolling around the house.\nEvery time I accidentally rip its plug out of the wall, I’m tempted to get a cordless Dyson. But I know it just wouldn’t be the same.\nIs there anything I should have asked that I didn’t?\nI just want to mention that I love the availability of replacement parts for this vacuum and just how straightforward it is to open up to clean the roller. Definitely a plus!",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a4b28dd0077c976090baa524ec514589c3a8a66",
      "title": "TechCrunch Disrupt 2025 finalizes the Builders Stage agenda with top scaling voices",
      "url": "https://techcrunch.com/2025/09/03/techcrunch-disrupt-2025-adds-new-leading-voices-to-the-builders-stage-agenda/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The Builders Stage at TechCrunch Disrupt 2025 is where founders, operators, and investors get real about what it takes to turn an idea into a business that works.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15b90c9dadc2485bdc1792f84f156ce1e072b20f",
      "title": "An ancient disease makes yet another comeback",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/03/g-s1-86671/cholera-diarrhea-disease-africa",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T13:56:37.000Z",
      "summary_90w": "",
      "raw": "Why cholera is striking in Africa. It's a disease that's easy to control with proper treatment. But without medical care, patients can perish quickly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20734de9be72d9662dfcda04a60d7fdca24067c1",
      "title": "Middle East crisis: at least 21,000 children disabled in Gaza during war, says UN committee – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:55:30.000Z",
      "summary_90w": "",
      "raw": "More than 40,000 have suffered ‘new war-related injuries’ with more than half left disabled, says UN Committee on the Rights of Persons with Disabilities\nYemen’s Houthis have claimed responsibility for a missile launched at Israel (see 8.17am BST), saying they fired two ballistic missiles at Tel Aviv in what they said was an initial response to Israeli attacks on Yemen.\nThe Israeli military moved deeper into Gaza City on Wednesday, with soldiers and tanks pushing into Sheikh Radwan, one of the urban centre’s largest and most crowded neighbourhoods, reports Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e28bc2866e67c80a963a60985a20dcbe15a6b520",
      "title": "Garmin’s Fenix 8 Pro series finally lets you leave your phone at home — sort of",
      "url": "https://www.theverge.com/news/770034/garmin-fenix-8-pro-satellite-lte-microled-price",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T13:42:49.000Z",
      "summary_90w": "",
      "raw": "There are a few caveats to the cellular and satellite connectivity, however.\t\n\nGarmin just announced its Fenix 8 Pro series of smartwatches, which adds both cellular and satellite connectivity via the company’s InReach tech. The Fenix 8 Pro series also adds a MicroLED display version that gets a maximum brightness of 4,500 nits. The catch is the watches will start at $1,199.99, with the MicroLED version going for an eye-watering $1,999.99.\nThe big news here is adding cellular and satellite connectivity means Fenix 8 Pro users won’t need to carry their phones. There are, however, a few caveats as Garmin will be utilizing LTE-M networks. According to its website, that means these watches will have “a data connection but not a phone number, and cannot make traditional voice calls or send SMS messages.” For those capabilities, you’ll have to either call other Fenix 8 Pro users or people who have downloaded the Garmin Messenger app, which was introduced last year. \nThat said, cellular connectivity does let you send 30-second voice messages via the Messenger app, allow users to send LiveTrack location sharing, and access real-time weather forecasts. Similarly, satellite connectivity will allow users to send and receive text messages via Garmin Messenger and location check-ins. SOS requests can be sent over both satellite and cellular via the Garmin Response center, which will then forward that information to emergency services, search and rescue organizations, and emergency contacts.\nAnd of course, cellular and satellite connectivity will require an active subscription, which will start at $7.99 per month. Garmin spokesperson Natalie Miller told The Verge that the InReach activation fee would be waived for Fenix 8 Pro owners, and there will be a free 30-day trial for first-time users. But LTE network access and satellite coverage aren’t available in all countries. (You can check where coverage is available here.)\nSmartwatch connectivity has been one area where Garmin has struggled to compete with competitors like the Apple Watch Ultra or Samsung Galaxy Watch Ultra. While Garmin has the better reputation among athletes for durability, training features, and battery life, Apple and Samsung could offer phone-free experiences and safety assurances thanks to cellular. Garmin’s implementation here isn’t perfect, but it makes sense given the difficulty smaller companies experience when negotiating deals with carriers. This method relies mostly on Garmin’s existing InReach infrastructure and at least starts to address that gap. Previously, the only Garmin watches that offered any connectivity was the Forerunner 945 LTE, which was released in 2021, and its Bounce kids tracker.\nOn the hardware side of things, the Fenix 8 Pro series will come in two sizes: 47mm and 51mm. The OLED versions of the watches will get an estimated 27 days of battery life. The 47mm will cost $1,199.99 and the 51mm will cost $1,299.99. The $1,999.99 MicroLED version will only be available in the 51mm size, and will get up to 10 days of battery life. All three watches will be available starting September 8th.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c283e276f88caa8a77770beb0edf41dabe5d3465",
      "title": "Lush shuts UK stores for a day to protest Gaza starvation",
      "url": "https://www.bbc.com/news/articles/cn82ly74rk4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:39:32.000Z",
      "summary_90w": "",
      "raw": "The retail chain said similar action could be taken in its other stores worldwide.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d644e189ccfca378169b39abe9c5397dc4cdc763",
      "title": "China's Xi steals the limelight in a defiant push against US-led world order",
      "url": "https://www.bbc.com/news/articles/cn0rllxld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:20:11.000Z",
      "summary_90w": "",
      "raw": "President Xi shows off his power and influence in an open challenge to US supremacy and the world order.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e5d8d8f83ccae0fd3ac291eec9f7d4f8cbbb7b9",
      "title": "How 'teddy bear' coach is helping Osaka find mojo",
      "url": "https://www.bbc.com/sport/tennis/articles/cy9892qlx5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:16:40.000Z",
      "summary_90w": "",
      "raw": "How two-time US Open champion Naomi Osaka has rediscovered her form in New York, two months after a dispiriting Wimbledon exit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32e6a20cb12e08756e4f292b603794f8fe881669",
      "title": "Advanced geothermal startups are just getting warmed up",
      "url": "https://techcrunch.com/2025/09/03/advanced-geothermal-startups-are-just-getting-warmed-up/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T13:14:54.000Z",
      "summary_90w": "",
      "raw": "Geothermal energy startups including Fervo Energy and Sage Geosystems are signing key deals that bring their technology closer to broader commercial deployment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "75e1422f024bad2abd2fabd20d5a7ae477e5601d",
      "title": "Henry Zeffman: Rayner's political future under threat after stamp duty admission",
      "url": "https://www.bbc.com/news/articles/c2lx1999ez8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:11:58.000Z",
      "summary_90w": "",
      "raw": "The deputy prime minister has referred herself for an ethics probe by the PM's adviser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0e2c21d59d6d5db9fe069ef16d4beb9a5afed9ed",
      "title": "Ministers favour merging all UK steel companies into one",
      "url": "https://www.bbc.com/news/articles/c4gqe91kp57o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:11:18.000Z",
      "summary_90w": "",
      "raw": "The government believes the struggling sector's six companies should be merged together, sources tell the BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "79e08853dac5d2ae391c03947e150e221f9f5cca",
      "title": "Budget to be held on 26 November, Reeves confirms",
      "url": "https://www.bbc.com/news/articles/c7545yz0171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:09:55.000Z",
      "summary_90w": "",
      "raw": "The chancellor will set out her plans for the UK economy in November with speculation growing over tax rises.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4b320d7c559404ee6a9e86f76846ac5cc80f3b5",
      "title": "Xi, Putin and Kim show united front at huge Chinese military parade",
      "url": "https://www.bbc.com/news/articles/cp8z83np4xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:00:42.000Z",
      "summary_90w": "",
      "raw": "Speaking during the spectacle in Beijing, China's President Xi Jinping said the world faced a choice between peace and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4b320d7c559404ee6a9e86f76846ac5cc80f3b5",
      "title": "Xi, Putin and Kim show united front at huge parade",
      "url": "https://www.bbc.com/news/articles/cp8z83np4xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T13:00:42.000Z",
      "summary_90w": "",
      "raw": "Speaking during the spectacle in Beijing, China's President Xi Jinping said the world faced a choice between peace and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "affbbcb11158078444971c7c0c0a435406dfb637",
      "title": "College social app Fizz expands into grocery delivery",
      "url": "https://techcrunch.com/2025/09/03/college-social-app-fizz-expands-into-grocery-delivery/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The new partnership will allow students to order anything from late-night snacks to weekly groceries directly within the Fizz app in as fast as 15 minutes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a7350f977759a989dd73e42ba8affcb777d5ae28",
      "title": "Netflix updates its Moments feature to give users greater control over scene clipping",
      "url": "https://techcrunch.com/2025/09/03/netflix-updates-its-moments-feature-to-give-users-greater-control-over-scene-clipping/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T13:00:00.000Z",
      "summary_90w": "",
      "raw": "With the new Moments update, Netflix users now have the option to adjust where each scene clip ends.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55bbef5ef97b3fd579466e466179dd77b3b444ff",
      "title": "Netflix will let you make your own highlight clips",
      "url": "https://www.theverge.com/news/769471/netflix-highlight-clips-moments-start-end",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Netflix will now let you create and share highlight clips of your favorite shows and movies right from the Netflix app on your phone.\nLast year, Netflix launched a feature that let you bookmark spots from shows and movies and save them to your account to watch again later or share with others. Starting today, Netflix is rolling out the ability for you set a specific end point for what you’re saving, meaning that you can make a specific clip instead of having the scene you bookmarked just continue on.\n\nTo make a clip, tap on the “Clip” button that shows up under the playback bar while you’re watching something on Netflix, and then you can adjust where you want the clip to start and stop. After you’ve saved the clip, you can then share a link to it in apps like iMessage, Instagram, and WhatsApp.\nThe feature is launching alongside Part 2 of Wednesday’s second season.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2063431a67a292cda14f078389727e8a5933abe",
      "title": "PayPal and Venmo are giving out Comet invites and free Perplexity Pro subscriptions",
      "url": "https://techcrunch.com/2025/09/03/paypal-and-venno-are-now-giving-out-comet-invites/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The arrangement is part of a new partnership between PayPal and the AI provider, which benefits both companies in different ways.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "136b8999723ea8fe4f5221ecd12de33ac1d13690",
      "title": "The UK’s largest energy supplier has created its own EV charger",
      "url": "https://www.theverge.com/news/769962/octopus-energy-octopus-charge-ev-charger",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T12:54:01.000Z",
      "summary_90w": "",
      "raw": "The UK’s larger energy supplier, Octopus Energy, is launching its own EV charger. The Octopus Charge is designed to pair with the Intelligent Octopus Go tariff, which offers up cheaper electricity rates overnight for EV charging.\nOctopus Energy has designed and built its own EV charger and is backing it with a three-year warranty. There’s a £999 (about $1,300) tethered option with a 5-meter cable or an £899 (around $1,200) untethered version you can use with any cable you want. Those prices are largely in line with other EV chargers once you factor in install costs, but the Octopus Charge will be tempting for Octopus customers as it’s installed and supported entirely by Octopus.\nOctopus has made a name for itself in the UK by using green energy to drive down the costs of electricity in the UK. Wholesale rates for electricity in the UK have soared in recent years, and Octopus offers variable pricing every 30 minutes on its Octopus Agile tariff or the Intelligent Octopus Go option that lets EV owners charge for 6 hours of cheap energy every night at 7p per kWh — that’s 9 cents per kWh. I’ve been using Octopus to get free electricity for a couple of years now.\nIf you’re not with Octopus then Octopus Charge isn’t as appealing, unless you’re willing to switch. While this EV charger looks like an easy way of locking Octopus customers in for life, if you do decide to leave the supplier it will be compatible with other energy suppliers in the UK. “Ideally this provider would have their own Open Charge Point Protocol (OCPP) platform to be able to directly control the charger,” explains Octopus spokesperson Christina Hofmann in an email to The Verge. “It’s also possible to switch the charger to Plug and Charge mode, with scheduling via the EV, in case the provider isn’t equipped their own OCPP platform.”\nThere are also plenty of other EV chargers that can integrate into the Intelligent Octopus Go tariff, but Octopus’ own version will make that integration a lot simpler and easy to use. Octopus controls third-party chargers through vehicle or EV charger APIs, which can occasionally be problematic.\nOctopus says its EV charger will be available for most EV drivers to purchase later this year, and the company is currently offering early access to those who lease a car through its Octopus Electric Vehicles scheme. Everyone else can register their interest at Octopus’ website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "114a6977c2641ee48157c78d288f6dd0271b3578",
      "title": "Microsoft&#8217;s PowerToys are about to add two big missing Windows features",
      "url": "https://www.theverge.com/news/770015/microsoft-windows-11-dark-light-theme-automatic-switch-powertoy",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T12:46:56.000Z",
      "summary_90w": "",
      "raw": "Have you ever wanted Windows 11 to automatically switch between light and dark modes based on a schedule, or help you find keyboard shortcut conflicts? Well, Microsoft is about to solve both of these missing Windows features with PowerToys.\nThe latest 0.94 release of PowerToys, the useful addons for Windows power users, includes a new shortcut conflicts feature that can detect what shortcuts are currently in use by Windows or PowerToys modules. There are so many PowerToys to choose from now that it’s easy to create a conflict and have two things happen at once when you activate a keyboard shortcut. Any conflicts will be highlighted in red in this conflicts tool, so you can reassign them quickly.\nMicrosoft is also working on addressing another big missing Windows 11 feature with a PowerToy module. “We are planning some nice new features and improvements for next month – a revamped Keyboard Manager UI, and a new utility that can automatically switch between light and dark mode based on your schedule,” says Niels Laute, a senior product manager at Microsoft.\nWhile you can manually enable light or dark modes in Windows 11, there’s no way to schedule these automatically based on your schedule or on sunrise and sunset times. It’s a basic feature that’s been part of iOS and Android for years, and I’m surprised Microsoft has had to create a PowerToy for this instead of this being natively part of Windows 11. Either way, it’s arriving next month so if you like to switch between themes on Windows 11 then you won’t have to do it manually anymore.\nIf you haven’t checked out PowerToys before there are plenty of other useful utilities like Advanced Paste, Always on Top, FancyZones, and the new Spotlight-like Command Palette launcher app. You can download the latest PowerToys release over on Microsoft’s GitHub page.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3802f6fd2bee9d8ee61c711ac7fde5acd34e24f6",
      "title": "Kim Jong-un promises to do ‘everything to assist’ Moscow after Putin meeting",
      "url": "https://www.theguardian.com/world/2025/sep/03/kim-jong-un-promises-to-do-everything-to-assist-moscow-vladimir-putin-russia-north-korea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T12:31:29.000Z",
      "summary_90w": "",
      "raw": "North Korean leader invited to visit Russia as Zelenskyy says Putin is displaying ‘impunity’ with new Ukraine strikes\n\nEurope live – latest updates\n\n\nVladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nThe invitation, made through interpreters and shown in a video published by the Kremlin, came as Ukraine’s president, Volodymyr Zelenskyy, accused Putin of demonstrating his “impunity” with fresh strikes on Ukraine overnight.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06aa1975d4538ca33b10208bfacf5a7f5dcd9730",
      "title": "Race to find survivors after Sudan landslide kills hundreds",
      "url": "https://www.bbc.com/news/articles/cdj2jygzzk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T12:24:51.000Z",
      "summary_90w": "",
      "raw": "Sunday's landslide followed heavy rain and \"levelled\" a remote village, a local armed group says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b5f57b1568db0b65bc54bb9e6f83fe844e61ea8e",
      "title": "Brand new unicorn IQM sets its sights beyond Europe for its quantum computers",
      "url": "https://techcrunch.com/2025/09/03/brand-new-unicorn-iqm-sets-its-sights-beyond-europe-for-its-quantum-computers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T12:20:34.000Z",
      "summary_90w": "",
      "raw": "IQM, a Finnish quantum computing company, is now a unicorn after raising over $300 million in a Series B round funding led by Ten Eleven Ventures, a U.S. investment firm focused on cybersecurity.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bba0eaca95165227d0d96eda644426c5cdcaeca1",
      "title": "Israeli drones dropped grenades near peacekeepers in south Lebanon, UN says",
      "url": "https://www.theguardian.com/world/2025/sep/03/israeli-drones-drop-grenades-near-peacekeepers-in-south-lebanon-un-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T12:17:48.000Z",
      "summary_90w": "",
      "raw": "Unifil condemns ‘serious attack’ on Tuesday morning as it was clearing a road and adds that no one was hurt \nIsraeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nThe UN peacekeeping force in Lebanon, Unifil, said the Tuesday morning attack came as it was clearing a road to a UN position close to the Israeli border, adding that no one was hurt.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "488b3d4d8d93b1b4cad1adbbd777ba2f4b6c850a",
      "title": "Lawmakers push for release of more Epstein files. And, Trump family launches crypto",
      "url": "https://www.npr.org/2025/09/03/g-s1-86751/up-first-newsletter-jeffrey-epstein-trump-cryptocurrency-china-military-parade",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T11:19:30.000Z",
      "summary_90w": "",
      "raw": "Some members of Congress are trying to force a vote to make the Trump administration release more of the Jeffrey Epstein files. And, the Trump family's crypto started trading publicly this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c7cc9af564348d74bbbcbdb643c05d0c9ff5a82",
      "title": "Melvyn Bragg steps down from Radio 4's In Our Time",
      "url": "https://www.bbc.com/news/articles/cewnllp1de8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T11:17:44.000Z",
      "summary_90w": "",
      "raw": "The veteran presenter has hosted more than 1,000 epsiodes of the programme over the past 26 years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fcc539ac93ab18f6d94eedc591ac4e7958899b6d",
      "title": "Ex-Premier League stars who lost millions in investments were failed, MPs say",
      "url": "https://www.bbc.com/sport/football/articles/c5ypyyj3xlro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T11:05:18.000Z",
      "summary_90w": "",
      "raw": "Three parliamentarians want an investigation into the case of a group of former Premier League players who say they were victims of \"financial abuse\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9f6c1643121d1b88a4d9e24560cb656ad16b0561",
      "title": "Epstein accusers expected to hold rally and speak on Capitol Hill Wednesday",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525822/epstein-accusers-expected-to-hold-rally-and-speak-on-capitol-hill-wednesday",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T10:59:29.000Z",
      "summary_90w": "",
      "raw": "NPR's Steve Inskeep speaks with Lisa Phillips, who says she was sex trafficked by Jeffrey Epstein, about political moves to release more information and about seeking justice for his victims.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f1e3934f346193278cb732ffa677c2fba9b6b63",
      "title": "Efforts pick up in Congress to force vote on release of Jeffrey Epstein files",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525879/efforts-pick-up-in-congress-to-force-vote-on-release-of-jeffrey-epstein-files",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T10:59:20.000Z",
      "summary_90w": "",
      "raw": "There's a renewed bipartisan push in Congress for information about the investigation into Jeffrey Epstein to be released, with some members trying to force a vote to release all related files.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98d024e06fb98ebf0f6fe23522c10d3e006427ef",
      "title": "Bolsonaro's lawyers to present his defence at coup trial",
      "url": "https://www.bbc.com/news/articles/ce83881001eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T10:58:28.000Z",
      "summary_90w": "",
      "raw": "The former Brazilian president denies conspiring to overturn his 2022 election loss to his left-wing rival, Luiz Inácio Lula da Silva.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca88188114a1190628367f04f5c933d17d2d9e15",
      "title": "Husic rebukes PM’s assertion ‘good people’ went to March for Australia rallies as Nampijinpa Price walks back immigration claim",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/ed-husic-anthony-albanese-jacinta-nampijinpa-price-march-for-australia-immigration-comments-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T10:51:01.000Z",
      "summary_90w": "",
      "raw": "Concern at anti-immigration sentiment targeting Indian community as Coalition politicians cross floor to support defeated Pauline Hanson motion\n\nGet our breaking news email, free app or daily news podcast\n\nThe former Labor minister Ed Husic has rebuked Anthony Albanese’s assertion that “good people” attended last weekend’s anti-immigration rallies, saying “I haven’t seen a good fascist yet”.\nAsked on Wednesday if he agreed with the prime minister’s suggestion that among the neo-Nazis and far-right activists at Sunday’s rallies would have been “good people” concerned about immigration, the now Labor backbencher pushed back.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9122eaec0d3c3caa2eb5e06cd8a21774dc756b3",
      "title": "Hitler's bunker is now just a parking lot. But it's a 'dark tourism' attraction anyway",
      "url": "https://www.npr.org/sections/planet-money/2025/09/03/g-s1-86572/hitlers-bunker-is-now-just-a-parking-lot-but-its-a-dark-tourism-attraction-anyway",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Why evil histories sell. A visit to Hitler's bunker, and a deep dive into the economics and ethical quandaries of \"dark tourism.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "681204107cb37a5031873434f19107c94ec4bd3e",
      "title": "Jamaicans head to polls for election as ruling party faces corruption concerns",
      "url": "https://www.theguardian.com/world/2025/sep/03/jamaican-general-election",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:45:19.000Z",
      "summary_90w": "",
      "raw": "Polls point to ‘very close election’ between the Jamaica Labour party and the opposition People’s National party\nJamaicans head to the polls on Wednesday for a closely fought general election which has been overshadowed by an investigation into potential corruption in the ruling Jamaica Labour party (JLP) which is seeking a third term in office.\nThe latest local poll put the opposition People’s National party (PNP) 3.1% lead over the JLP, but political analyst Damion Gordon cautioned that the lead was barely larger than the margin of error.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31591fc0835ac37803c4c9adbfd4f535de6d2219",
      "title": "Neo-nazi Thomas Sewell will continue to commit violent offences that could lead to death, police tell court",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/neo-nazi-thomas-sewell-will-continue-to-commit-violent-offences-that-could-lead-to-death-police-tell-court-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:35:05.000Z",
      "summary_90w": "",
      "raw": "Sewell, who has been charged over alleged attack on Indigenous protest site, described in court as having ‘at his disposal a large group of followers’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-nazi Thomas Sewell – who allegedly led an attack on a First Nations encampment in Melbourne over the weekend – will continue to commit violent offences that could lead to death, a court heard.\nSewell, 32, applied to be freed on bail on Wednesday after being charged over an alleged attack on Melbourne’s Camp Sovereignty on Sunday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a079a9294ea0636a9ae4517446356559accf6f7b",
      "title": "Four Chinese carmakers enter Australian top 10 for first time, while Tesla sales slump",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/chinese-car-makers-byd-gwm-chery-mg-australian-top-10-sales-tesla-slump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:32:23.000Z",
      "summary_90w": "",
      "raw": "BYD overtakes Mitsubishi after nearly quadrupling sales in past year, according to official figures, as GWM, MG and Chery also surge\n\nGet our breaking news email, free app or daily news podcast\n\nAustralians bought more than 20,000 Chinese-made vehicles in August, putting four Chinese brands into the top 10 for the first time, while Tesla sales have slumped by more than a third.\nBYD came in sixth for the month, overtaking Mitsubishi, after its sales nearly quadrupled compared with August 2024, while GWM, MG and Chery each outsold Isuzu Ute in the month to round out the top 10.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4190dc6ee79e29462b23ccc66433afca076bb47",
      "title": "Alleged Porepunkah killer shown ranting at police in pandemic-era footage as manhunt continues",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/alleged-porepunkah-killer-dezi-freeman-shown-ranting-at-police-pandemic-era-footage-as-manhunt-continues-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:29:17.000Z",
      "summary_90w": "",
      "raw": "Videos show Dezi Freeman arguing about Covid-19 mask mandates and telling police they have ‘intelligence of kindergarten children’\n\nGet our breaking news email, free app or daily news podcast\n\nMore than 100 properties have been searched in the hunt for the alleged Porepunkah police killer, as footage of the fugitive arguing about mask mandates with police during the pandemic emerges.\nOn the ninth day of the search Victoria’s police chief commissioner, Mike Bush, would not be drawn on where they think Dezi Freeman is after he allegedly shot and killed two officers at a property in Porepunkah, about 300km north-east of Melbourne last Tuesday. Police teams were on Wednesday seen working on the south-eastern side of the valley under Mount Buffalo.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4827aec408e374f42ee2a797f5cf51ab212876cb",
      "title": "Australia could pay up to $2.5bn to Nauru over 30 years to take noncitizens, home affairs department says – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:18:49.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nHusic rebukes PM’s assertion ‘good people’ went to March for Australia rallies as Nampijinpa Price walks back immigration claim\n\nGet our breaking news email, free app or daily news podcast\n\nRowland denies government trying to put more information out of public’s reach\nSo what about the Albanese government’s promise that it’s open and transparent?\nAs we found out through robodebt, which was another example of a lack of transparency which cost people lives under the previous government, just labelling something cabinet in confidence does not make it so and we intend to enshrine that in this law.\nWe’ve had cases where FoI requests have been generated, sometimes around 600 of them in one instance, going to a small agency, which tied up the services of that agency for over two months. Now, you might think that’s not important, but let me tell you what that agency was. That was eSafety. That is an organisation responsible for ensuring the safety, particularly of young people, online getting tied up, doing 600 frivolous FoI requests that they are required by law to deal with.\nI would point out that there is currently a charging regime in the Freedom of Information Act, and every state and territory bar the ACT actually imposes a modest application fee of somewhere between $30 and the mid-50s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on drug-carrying vessel from Venezuela",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:10:59.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e86b9f97448a1099fc747a1f3156f8d5dca8a0d1",
      "title": "What new weapons on show at huge parade say about China's military strength",
      "url": "https://www.bbc.com/news/articles/cjr1reyr059o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T09:07:04.000Z",
      "summary_90w": "",
      "raw": "Beijing has unveiled a range of military hardware in a show of might to Western powers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded1eba6568cb83acb1b0db7a34aa4a6154c7d25",
      "title": "Food giant Kraft Heinz to split into two companies",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525657/food-giant-kraft-heinz-to-split-into-two-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T09:02:02.000Z",
      "summary_90w": "",
      "raw": "Food giant Kraft Heinz is splitting up into two companies a decade after the merger that was arranged by billionaire investor Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2c0d58da3655c9a3d77fd527541f80864f7d33e",
      "title": "So um, why do we say 'um' so much?",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521388/um-filler-word-of-the-week",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Who knew two letters could spark so much conversation? This week, we're breaking down the many uses of \"um\" and why the word is so controversial.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c075e76bb6de6d9ca1afc44db0be3efed3158b2e",
      "title": "With federal money in doubt, California's high-speed train seeks a new path forward",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5494532/california-high-speed-rail-change-of-direction",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The leaders of California's high-speed rail project say they've learned from past mistakes. But the troubled megaproject faces an uncertain future with $4 billion in federal funding tied up in court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5debd60595c533c7f34df6227b2e6380f4d5af44",
      "title": "Hundreds of women with brooms join protests as Indonesia leader flies to China",
      "url": "https://www.bbc.com/news/articles/c7vlv2gpvvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:48.000Z",
      "summary_90w": "",
      "raw": "Hundreds of women brandishing broomsticks marched to parliament during fierce nationwide rallies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b0401e9d2081d4f99d62e71998ecf04b1f4099bc",
      "title": "Energy drinks to be banned for under-16s in England",
      "url": "https://www.bbc.com/news/articles/c707074qdnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T08:18:26.000Z",
      "summary_90w": "",
      "raw": "Health and Social Care Secretary Wes Streeting said he was acting on concerns for children's health.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9dcf43076631b3c2c6573bfa4a1ac5edbdb782d9",
      "title": "Putin thanks Kim for North Koreans fighting in Ukraine",
      "url": "https://www.bbc.com/news/articles/cj9w9m1xz1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:14:39.000Z",
      "summary_90w": "",
      "raw": "Thousands of North Korean soldiers are thought to have died while fighting for Russia during its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de0e062ec6e6aede6d5bbe684aaeb1a28f8eaef8",
      "title": "Floods kill 30 and submerge 1,400 villages in Indian state",
      "url": "https://www.bbc.com/news/articles/cvg4g95y7pjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T06:23:23.000Z",
      "summary_90w": "",
      "raw": "More than 354,000 people have been affected by the worst floods since 1988, as rescue efforts continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d27437f91defdbeae26dc28641c69c54124a40a",
      "title": "'A clear message to Trump': BBC correspondents react to China's military parade",
      "url": "https://www.bbc.com/news/articles/c7545p2px5no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T06:21:08.000Z",
      "summary_90w": "",
      "raw": "The display of might comes as Beijing positions itself as a global counterweight to the United States.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T04:45:44.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ace766178d2ad238f44e43eb9ee36a2d98145e72",
      "title": "Trump accuses Xi of conspiring against US with Putin and Kim",
      "url": "https://www.bbc.com/news/articles/c1dxd9eyy71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T03:45:58.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4797c9a7e5dd808d65c909097b9a96e5bae3b474",
      "title": "Watch: Key moments from China's big show of strength",
      "url": "https://www.bbc.com/news/videos/c62n2mm6ngjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T03:35:24.000Z",
      "summary_90w": "",
      "raw": "The military parade was attended by world leaders including Vladimir Putin and Kim Jong Un and showcased China’s new weapons.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df6292318cff9f48c879b31767d4a501c2af5851",
      "title": "Indonesia embassy official’s shooting in Lima probably a ‘contract killing’, says Peru government",
      "url": "https://www.theguardian.com/world/2025/sep/03/indonesian-embassy-official-shooting-lima-likely-contract-killing-says-peru-government-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T02:11:57.000Z",
      "summary_90w": "",
      "raw": "Interior minister says ‘they were waiting for’ official who was shot at point-blank range outside his home in killing that has shocked Peru\nPeru’s government has said the fatal shooting of an Indonesian embassy official in Lima on Monday night was likely a “contract killing”.\nZetro Leonardo Purba, 40, an official at the Indonesian embassy in Peru, was shot dead outside his block of flats in Lima’s Lince neighbourhood while riding a bicycle home from work on Monday evening.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19748ab56d2566a698991b9886df485db53e89a0",
      "title": "US House panel releases 33,000 pages of Epstein files",
      "url": "https://www.bbc.com/news/articles/cp949lrj373o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T01:12:07.000Z",
      "summary_90w": "",
      "raw": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd9711cb196a8a00d95830cc9302c67960583c10",
      "title": "Jury clears Cardi B of assault on security guard in Los Angeles",
      "url": "https://www.bbc.com/news/articles/cgjyj0dp3ego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T00:19:19.000Z",
      "summary_90w": "",
      "raw": "A number of viral moments thrust the civil case into the spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5bbe882f5c32980c0db615e01ac63766ae09113",
      "title": "Don't pay a fake parking fine – four ways to protect yourself from scams",
      "url": "https://www.bbc.com/news/articles/cn8438ngpe1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:37:07.000Z",
      "summary_90w": "",
      "raw": "Four simple tips to make sure you don't fall victim to fake texts or payment demands from BBC expert Nick Stapleton.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3530436b320d6ff4c37d98a45ea7d27948abcda5",
      "title": "'A bullet went through my skull': Tanzania abduction survivor",
      "url": "https://www.bbc.com/news/articles/c78zdzvgw90o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:32:11.000Z",
      "summary_90w": "",
      "raw": "Activist Edgar Mwakabela describes his ordeal after he says he was kidnapped and shot by suspected state agents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7a68a331a49b9b4892ef7c9ad493a7664760f13",
      "title": "Watch: Captain Scott’s famous polar shipwreck as never seen before",
      "url": "https://www.bbc.com/news/articles/cpwyvyqkx9yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:27.000Z",
      "summary_90w": "",
      "raw": "The Terra Nova carried Captain Scott and his men on their doomed expedition to the South Pole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b48d6aa7902484f6161edb09926a7623411adc51",
      "title": "Compassion v fear: Delhi divided over feeding stray dogs",
      "url": "https://www.bbc.com/news/articles/c0kzkzvx848o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:04:26.000Z",
      "summary_90w": "",
      "raw": "Activists are pushing for the welfare of stray dogs, while anxious residents cite safety risks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "464e9fe0d3287700f5827f0ab6d4850271d64bf9",
      "title": "Why is Trump targeting America's most powerful bank?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0fw7d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:01:00.000Z",
      "summary_90w": "",
      "raw": "Can he take control of the Federal Reserve?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1a85b2cd28ef41b47c910e085725e38a0071bb1",
      "title": "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T22:16:18.000Z",
      "summary_90w": "",
      "raw": "Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions \nThe US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between Washington and Caracas.\nTrump trailed the announcement during an address at the White House on Tuesday afternoon, telling reporters the US had “just, over the last few minutes, literally shot out … a drug-carrying boat”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a56676df663ab832e550668815ce2b54c1b2d91",
      "title": "Australia-Israel relations have hit a low point. Behind the scenes, it's business as usual",
      "url": "https://www.bbc.com/news/articles/cdd31vnygemo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T22:02:46.000Z",
      "summary_90w": "",
      "raw": "The two democratic allies have had a spectacular falling out - but what has actually changed?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53112f74c4bcaee6abbc430c1a5584946e8182f3",
      "title": "Watch: Timelapse shows Northern Lights display over North Sea",
      "url": "https://www.bbc.com/news/videos/ckglgp9q2nno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T21:47:48.000Z",
      "summary_90w": "",
      "raw": "Monday night's dazzling sight was filmed from Flamborough in East Yorkshire, over three hours and 40 minutes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4c08b57592134ecabac0d1d7637ad82c99b5e603",
      "title": "How three businesses are coping with tariff limbo",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525791/how-three-businesses-are-coping-with-tariff-limbo",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:08:39.000Z",
      "summary_90w": "",
      "raw": "US importers are in a kind of tariff limbo. A federal appeals court has struck down most of President Trump's import taxes. But the tariffs are still being collected, for now, until there's a final decision from the Supreme Court.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "fe3ea0609a814b72cff681d5788c7defd3c9a0b2",
      "title": "Electric vehicle sales increase as federal tax credits for them come to an end",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650-e1/electric-vehicle-sales-increase-as-federal-tax-credits-for-them-come-to-an-end",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T20:52:12.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7f2bb8b23b878380bd0e4d29f64be437073fcf5b",
      "title": "Waymo expands to Denver and Seattle with its Zeekr-made vans",
      "url": "https://techcrunch.com/2025/09/02/waymo-expands-to-denver-and-seattle-with-its-zeekr-made-vans/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:48:09.000Z",
      "summary_90w": "",
      "raw": "Add another two cities to the growing list where Waymo is looking to deploy its robotaxis. The company will start with manual testing but is eyeing a commercial launch in both cities.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9d1f013b3881055b8ba95ecb5c6e20b120ac2349",
      "title": "Google avoids breakup, but has to give up exclusive search deals in  antitrust trial",
      "url": "https://techcrunch.com/2025/09/02/google-avoids-breakup-but-has-to-give-up-exclusive-search-deals-in-antitrust-trial/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:45:20.000Z",
      "summary_90w": "",
      "raw": "U.S. District Court Judge Amit P. Mehta outlined remedies on Tuesday that would bar Google from entering or maintaining exclusive deals that tie the distribution of Search, Chrome, Google Assistant, or Gemini to other apps or revenue arrangements.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "060597fc354558c19ae50394ae87621f9045f7bd",
      "title": "OpenAI to route sensitive conversations to GPT-5, introduce parental controls",
      "url": "https://techcrunch.com/2025/09/02/openai-to-route-sensitive-conversations-to-gpt-5-introduce-parental-controls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:13:04.000Z",
      "summary_90w": "",
      "raw": "OpenAI said Tuesday it plans to route sensitive conversations to reasoning models like GPT-5 and roll out parental controls within the next month – part of an ongoing response to recent safety incidents involving ChatGPT failing to detect mental distress.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "364368d0c7fdddfffc65ebbf6ed7a407659e52b8",
      "title": "Judges side with Trump EPA over canceled Inflation Reduction Act grants to nonprofits",
      "url": "https://techcrunch.com/2025/09/02/judges-side-with-trump-epa-over-canceled-inflation-reduction-act-grants-to-nonprofits/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:53:50.000Z",
      "summary_90w": "",
      "raw": "An appellate court found that the Trump administration was within its rights to cancel billions of dollars in grants. The nonprofits that had their grants canceled are expected to appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "69edbfd4529d6be1c0e4cf8b3c6608e549424d40",
      "title": "The big Putin, Xi and Kim Jong Un meeting",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0gh4d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T19:52:00.000Z",
      "summary_90w": "",
      "raw": "Russia’s Vladimir Putin and North Korean leader Kim Jong Un head to Beijing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19c9d71fe33d74644215f33e9dcea203c275498e",
      "title": "Amazon launches Lens Live, an AI-powered shopping tool for use in the real world",
      "url": "https://techcrunch.com/2025/09/02/amazon-launches-lens-live-an-ai-powered-shopping-tool-for-use-in-the-real-world/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:42:23.000Z",
      "summary_90w": "",
      "raw": "Lens Live will not replace Amazon's existing visual search tool, Amazon Lens, which lets you take a picture, upload an image, or scan a barcode to discover products. Instead, it brings a real-time component to Amazon Lens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5408d8decba8751b9b8bb5e6702c9e5e6725d8b4",
      "title": "Trump addresses online health rumours in Oval Office",
      "url": "https://www.bbc.com/news/videos/c62724wdxzwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T19:30:43.000Z",
      "summary_90w": "",
      "raw": "In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d83ca70fc5399376184426b5ac11daa2f344a7",
      "title": "OpenAI acquires product testing startup Statsig and shakes up its leadership team",
      "url": "https://techcrunch.com/2025/09/02/openai-acquires-product-testing-startup-statsig-and-shakes-up-its-leadership-team/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:04:05.000Z",
      "summary_90w": "",
      "raw": "OpenAI is bringing on the founder of Statsig as its CTO of Applications, and making changes to other leadership roles at the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7711054b51bf0367bbca9cf52c5dab71776daaf6",
      "title": "Afghan quake victims buried on mountain top as aftershocks continue",
      "url": "https://www.bbc.com/news/videos/cd9j9g5n92do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:46:09.000Z",
      "summary_90w": "",
      "raw": "The BBC's Yama Bariz travelled to a region devastated by the 6.0 magnitude earthquake.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c762575c02c0050e081f400ca742b4cdd720504",
      "title": "What do we know about Kim Jong Un's daughter - and potential successor?",
      "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:07.000Z",
      "summary_90w": "",
      "raw": "Kim Ju Ae's visit to China with her father is likely to further fuel speculation she may succeed him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40a3d29eca31a80068ccb02d3c0a0b95fb653582",
      "title": "Argentina couple under house arrest amid search for painting stolen by Nazis",
      "url": "https://www.theguardian.com/world/2025/sep/02/argentina-painting-nazis-house-arrest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:20:35.000Z",
      "summary_90w": "",
      "raw": "Daughter of former Nazi official and her husband to be questioned after raid on home failed to find masterpiece\nA federal court in Argentina has ordered house arrest for the daughter of a former Nazi official and her husband after a raid failed to locate a painting stolen from a Jewish art dealer in Amsterdam.\nAuthorities raided a home in the coastal city of Mar del Plata last week after a Dutch newspaper identified a painting seen in a real estate photo as an Italian masterpiece registered on a database of lost wartime art.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07715646549620450e4b081adaa0d3b069b4a69",
      "title": "Margaret Atwood releases short story critiquing book bans in Canada",
      "url": "https://www.theguardian.com/world/2025/sep/02/margaret-atwood-alberta-canada-book-ban",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:44:53.000Z",
      "summary_90w": "",
      "raw": "Author quipped she wrote ‘suitable’ piece after Alberta school ban included her novel The Handmaid’s Tale\nMargaret Atwood has released a new short story critiquing elected officials for a wide-ranging book ban in the Canadian province of Alberta. The controversial decision to remove books purportedly containing “explicit sexual content” has seen numerous works of literature swept up in the dragnet, including Atwood’s dystopian work The Handmaid’s Tale.\nIn a social media post, Atwood wrote that since her famed work was no longer permissible in Alberta schools, she had written a “suitable” short work for teens, adding the work was necessary because the province’s minister of education thought students were “stupid babies”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2ea109f825065079513d3bc6892866ac98ffb56",
      "title": "Vogue promotes Chloe Malle to top editor spot",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525663/vogue-chloe-malle-anna-wintour",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T16:38:09.000Z",
      "summary_90w": "",
      "raw": "Malle takes over as the leader of American Vogue immediately. Malle, who has been with the publication since 2011, will still report to Anna Wintour who remains Condé Nast's chief content officer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ae0e1ce7630b5acd0f10dcc27910a2cdc730112",
      "title": "Five children in Gaza among those killed by Israeli strike while fetching water",
      "url": "https://www.theguardian.com/world/2025/sep/02/children-among-those-killed-in-gaza-while-fetching-water-by-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:32:50.000Z",
      "summary_90w": "",
      "raw": "Latest attack comes as Israel’s military urges people to leave Gaza City with 60,000 more reservists to be called up\nAt least nine people, including five children, have been killed in an Israeli strike while fetching water in al-Mawasi, an area of southern Gaza which Israel has designated as a safe zone, health officials said.\nA doctor from al-Nasser hospital shared a picture of the children’s bodies in the hospital, as well as a picture of water jugs left in a pool of blood at the site of the attack on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24cd045a7276ab858581db6792ace812b83c0436",
      "title": "Kraft Heinz is splitting up, separating hot dogs from ketchup",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5464951/kraft-heinz-split-breakup",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T11:26:42.000Z",
      "summary_90w": "",
      "raw": "One of the world's largest food brands is splitting apart a decade after a messy megamerger staged by Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "412aa03368e77abdc17146130a428eacb10acfcf",
      "title": "Federal tax credits for electric vehicles are ending, leading to spike in sales",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650/federal-tax-credits-for-electric-vehicles-are-ending-leading-to-spike-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T08:59:57.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5bbd5ddade2f3b4c8ec87a973c5fd34539ccc944",
      "title": "Starter homes are scarce, so Utah set a target to build more. Here's how it's going",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5431545/starter-homes-utah-housing-cost-affordable-target",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T04:01:00.000Z",
      "summary_90w": "",
      "raw": "In one of the country's priciest housing markets, Utah's leaders worry young people are shut out from building wealth. But despite new incentives, few developers are signing on to build smaller homes.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6a3e022afdd2256a34c3a6e280d1c8816a7b3554",
      "title": "Body seen in secret mortuary could solve 50-year mystery of vanished religious leader",
      "url": "https://www.bbc.com/news/articles/clyr1qr529xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T00:18:28.000Z",
      "summary_90w": "",
      "raw": "Compelling evidence to suggest Lebanese Shia leader Musa al-Sadr was killed in Libya is uncovered by BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0e6d0c8ef09900d8d54bd5f5af91eea6830e085",
      "title": "Watch: Buildings destroyed and rescue efforts under way after deadly Afghanistan earthquake",
      "url": "https://www.bbc.com/news/videos/cqxgx8d14wwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:29:23.000Z",
      "summary_90w": "",
      "raw": "At least 800 people have been killed and thousands injured in the east of the country after a 6.0 magnitude earthquake struck on Sunday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68105a770ce0bbb71d9718bdd33c6fe1ec26154f",
      "title": "How the death of a delivery driver ignited Indonesia",
      "url": "https://www.bbc.com/news/articles/c2dj9w306wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:08:13.000Z",
      "summary_90w": "",
      "raw": "Protests over corruption and inequality have spiralled into violence, arson and deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b922ff820e9ad58307010f6072b7e31bb43110a",
      "title": "How Trump is decimating federal employee unions one step at a time",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5515633/trump-federal-workers-labor-unions-va",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump has ended collective bargaining rights for more than 1 million federal workers. Unions have sued to block the move, but agencies are terminating contracts as litigation continues.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95a8c83c019e1d53f2cde83b3510e1c354708b55",
      "title": "A psychological thriller directed by Christopher Nolan",
      "url": "https://www.bbc.co.uk/iplayer/episode/b00z0f1d/the-prestige?at_mid=3GtaP6hiAK&at_campaign=The_Prestige&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=b00z0f1d&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Prestige&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T00:05:47.000Z",
      "summary_90w": "",
      "raw": "A magician tries to uncover the secret of how his rival performs the ultimate trick.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}