{
  "version": "1757331425492",
  "generatedAt": "2025-09-08T11:37:05.492Z",
  "items": [
    {
      "id": "75abc954ffdf561780cd867ade9a59754f8886a0",
      "title": "UK could suspend visas for countries with no migrant return deals, new home secretary says",
      "url": "https://www.bbc.com/news/articles/c4g7xyn03yno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:21:41.000Z",
      "summary_90w": "",
      "raw": "New Home Secretary Shabana Mahmood made the comments at a security summit in London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd7e90fb966332f5f805b60b07148863dc561793",
      "title": "Europe live: Macron faces new political crisis with France prime minister François Bayrou threatened by confidence vote",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T11:19:44.000Z",
      "summary_90w": "",
      "raw": "Bayrou would be the third prime minister to lose the post in a year, leaving the president in a difficult political position and an impossible vacancy to fill\nIt’s been a long summer of speculations about the French government’s future amid growing controversies about its plans for the country’s next budget seeking to rein in spiraling state deficit and debts.\nBut it will all be clear today as the National Assembly holds a vote of confidence in François Bayrou’s embattled government. According to the declarations from the party leaders, he has little change of securing the majority required to cling on.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "798a6d3cfd4b57d6e8616cbded6ab74fb9e6dded",
      "title": "Palestinian gunmen kill six people at Jerusalem bus stop",
      "url": "https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T11:19:26.000Z",
      "summary_90w": "",
      "raw": "At least 12 others also injured in the attack at Ramot intersection during morning rush hour\n\nMiddle East crisis – live updates\n\nPalestinian attackers opened fire at a crowded bus stop in the northern outskirts of Jerusalem, killing six people and injuring 12 others, Israeli officials have said.\nPolice said two gunmen targeted people waiting for a bus at a busy intersection during the morning rush hour on Monday before being shot dead by an off-duty soldier and a civilian who were at the scene.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27e06763f559cd99d32f31c076e8befda993e822",
      "title": "At least 13 dead after protests against Nepal social media ban",
      "url": "https://www.bbc.com/news/articles/c78nd2zy9jgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:17:01.000Z",
      "summary_90w": "",
      "raw": "The protest was led by young people who oppose the ban in a country which relies heavily on social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a9f0d6bdc396603d6d7290b6a9cfa4832fc35e9",
      "title": "Five people killed in Jerusalem shooting; Israel threatens Gaza City with ‘powerful hurricane’ – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T11:15:32.000Z",
      "summary_90w": "",
      "raw": "Israel’s defence minister, Israel Katz, has warned that a ‘powerful hurricane’ will ‘strike the skies of Gaza City’ later today \nSam Jones is Madrid correspondent for the Guardian\nSpain’s prime minister, Pedro Sánchez, has stepped up his scathing criticism of Israel’s actions in Gaza, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "089eabf354a12f17e4da46bc6ed4688bb97b4c19",
      "title": "England yet to decide Ashes team - coach McCullum",
      "url": "https://www.bbc.com/sport/cricket/articles/cge2jlnn71po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T11:01:51.000Z",
      "summary_90w": "",
      "raw": "England have yet to decide on the 11 players who will play in the first Ashes Test against Australia, says coach Brendon McCullum.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1beb6b2a89ca3033710cf559394c22fc31a9c5e",
      "title": "OpenAI comes for Hollywood with Critterz, an AI-powered animated film ",
      "url": "https://www.theverge.com/news/773584/openai-animated-feature-film-critterz",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T10:56:43.000Z",
      "summary_90w": "",
      "raw": "Two AI-generated  figures from the production of Critterz.\t\n\nOpenAI is on a mission to show Hollywood that generative artificial intelligence can deliver results and is throwing its weight behind an animated feature film it hopes will stand toe-to-toe with much costlier productions, according to the Wall Street Journal.\nThe film, called “Critterz,” is expected to hit theaters worldwide in 2026 after a planned debut at the Cannes Film Festival, the Journal reported. It will be made primarily with the company’s AI tools, including GPT-5, its flagship model that landed with a thud last month. \n“Critterz” is reportedly being made on a budget of less than $30 million in just nine months, fractions of what is normally required for animated features. OpenAI, alongside LA- and London-based partners Native Foreign and Vertigo Films, will be hoping the flick can convince wary Hollywood executives to bet big on AI, a tall order as the industry wrestles with slow uptake, resistance from talent and audiences and concerns over intellectual property and creative agency.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ceb13d3ec698d1c186dbc9585532a30614ae9a4",
      "title": "New Banksy mural appears at Royal Courts of Justice",
      "url": "https://www.bbc.com/news/articles/cgrq0r0y878o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T10:56:37.000Z",
      "summary_90w": "",
      "raw": "The artwork, which shows a judge hitting a protester with a gavel, was confirmed by the elusive street artist.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8911715708d1a1b12ffbfba40f4b24e350536d0e",
      "title": "More than 10 European startups became unicorns this year",
      "url": "https://techcrunch.com/2025/09/08/more-than-10-european-startups-became-unicorns-this-year/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T10:55:11.000Z",
      "summary_90w": "",
      "raw": "This is a good indication of the sectors that are hot among investors, from biotech and defense tech to AI, AI, and AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1fa480b766a68db9a81926a0965244a0d3ffa00",
      "title": "Volkswagen ‘nearing US trade deal’ as it says Trump tariffs have cost it billions",
      "url": "https://www.theguardian.com/business/2025/sep/08/volkswagen-us-trade-deal-trump-tariffs-porsche",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:27:20.000Z",
      "summary_90w": "",
      "raw": "Carmaker’s CEO says Porsche is being squeezed by ‘sandwich’ of tariffs and weak Chinese market\n\nBusiness live – latest updates\n\nVolkswagen is closing in on a tariff deal with the US, the boss of the German carmaker has said, as it eyes up the market for affordable electric cars in Europe.\nEurope’s biggest car manufacturer, which also owns the Audi, Seat and Porsche brands, has been hit hard by Donald Trump’s trade tariffs, announced in April. The levies, combined with a turbulent market, have already cost “several billions”, the chief executive, Oliver Blume, said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e4f6d6c8659c767f9f06bc708b545cbf9b513d7",
      "title": "Labour body meet to plan race to replace Rayner as deputy",
      "url": "https://www.bbc.com/news/articles/c059z4g836eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T10:20:21.000Z",
      "summary_90w": "",
      "raw": "The party's ruling National Executive Committee (NEC) will hold talks on Monday to set the timetable and rules for the contest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10b43e0cf94f37714ff23c0fd66a6d821839d540",
      "title": "The influencer in this Vodafone ad isn’t real",
      "url": "https://www.theverge.com/news/773567/vodafone-generative-ai-ad-presenter-tiktok",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T10:18:45.000Z",
      "summary_90w": "",
      "raw": "Anyone familiar with the AI slop on Pinterest should recognize how unnatural that hair is.\t\n\nI opened TikTok while visiting Germany last week and stumbled across a Vodafone ad being presented by a woman who probably doesn’t exist. The ad includes several “tells” that suggest the presenter was artificially created using generative AI — the unnatural style and movement of her hair, the way her moles disappear, and the uncanny valley vibe of her facial expressions — and Vodafone confirmed my suspicions in its video comments.\nIn response to a commenter asking why Vodafone couldn’t put “a real person in front of the camera,” the company said it was “testing different styles of advertising — this time with AI,” according to machine translation of the German text. In another comment, Vodafone said that “AI is so much a part of everyday life these days that we also try it out in advertising.” \nAs an ad, it certainly captured my attention, but only because my brain registered that there was something “off.”\n\n \n @vodafonedeutschland \nJetzt Internet mit bis zu 1000 Mbit/s im Download für Dein Zuhause.\n ♬ Originalton – vodafone_de – vodafone_de \n  \n\n\nThis isn’t the first time that Vodafone has embraced generative AI in its ads, having released a commercial last year in which every shot was AI-generated. Fake influencers created using artificial intelligence are also rising in popularity, according to a New York Times report, with notable examples like Lil’ Miquela — a creation of tech company Dapper Labs — having already appeared in campaigns for Calvin Klein, Prada, and BMW.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b072daf01516ed2d231a85785a331e5a5a83a7cc",
      "title": "Ford introduces F-150 Lightning STX to replace XLT trim",
      "url": "https://www.theverge.com/ford-motor-company/773017/ford-f150-lightning-stx-specs-xtl",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T10:00:00.000Z",
      "summary_90w": "",
      "raw": "It hasn’t been the greatest year for the Ford F-150 Lightning, with sales so far this year down nearly 10 percent as compared to last year. In the hopes of boosting interest in the battery-powered truck, Ford today announced a new appearance package called STX, which the company says is in direct response to customer feedback. \nThe STX, which replaces the XLT in the Lightning lineup, comes equipped with dual motors and an extended range battery that targets an EPA-estimated 290 miles of range. It also will be no slouch on the straightaway, with 536 horsepower and 775 lb.-ft. of torque, as well as a standard rear e-locking differential.\nFord also “raided the F-150 parts bin” to add a bunch of rugged features, including off-road running boards from the F-150 Tremor and new wheels and all-terrain tires that are new to Ford’s electric truck. \nThere’s a new grille, blue accent lines, and “STX” badging throughout. Truck owners who like to do actual truck stuff with their big electric truck can option up with a black vinyl floor for extra protection. In addition to the regular range of paint options, the STX will also come in two new colors: Argon Blue and Marsh Gray. \n“Customers have been asking for a rugged F-150 Lightning with more range than the standard range XLT,” Will Marchand, product and consumer marketing manager for the Lightning, said in a release. “Until now, if these owners wanted a rugged F-150 Lightning, they had to turn to the aftermarket to build the truck they wanted. We wanted to meet them where they were, which is why we’re so excited about the new F-150 Lightning STX.”\nThe STX arrives at dealers in early 2026, and starts at $63,345. Ford says it expects it to be a top-seller based on internal projections.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4fb4628903a01aad2fe1a4edef8f7fcd5174c7d3",
      "title": "Leni Riefenstahl made movies for Hitler. A new documentary digs through her archives",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5526066/leni-riefenstahl-nazi-filmmaker-new-documentary",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Adolf Hitler commissioned filmmaker Leni Riefenstahl to make propaganda about Nazi Germany. She lived to be 101 years old and denied knowing about the Holocaust.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c13a21ac3037c4d5a5c0be557d3b0e3fb7e20e82",
      "title": "Wade to leave Wigan for union return at Newcastle",
      "url": "https://www.bbc.com/sport/articles/c80gl8y87kxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T09:40:58.000Z",
      "summary_90w": "",
      "raw": "Christian Wade will leave Wigan Warriors at the end of the rugby league season in order to return to rugby union with Newcastle Red Bulls from December.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7202cbb672f9ee714aa94cdc2020ca938b0d8865",
      "title": "New Zealand dad shot dead by police after years on the run with children",
      "url": "https://www.bbc.com/news/articles/c75qlerp2e5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T09:35:32.000Z",
      "summary_90w": "",
      "raw": "Tom Phillips disappeared with his three children in 2021 after losing a custody battle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "374b353a09326b2ad904df2dbb5884500f2b6edf",
      "title": "Five key moments from MTV VMAs as Lady Gaga and Ariana Grande win big",
      "url": "https://www.bbc.com/news/articles/c5yk5jw6w5ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T09:33:30.000Z",
      "summary_90w": "",
      "raw": "Sabrina Carpener was also among the award winners and performers on the night in New York.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61bb447e933f7e2c697b747844cdb487f5703d14",
      "title": "Trump threatens tougher sanctions after Russia's heaviest strikes on Ukraine",
      "url": "https://www.bbc.com/news/articles/cwyrx205dj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T09:29:55.000Z",
      "summary_90w": "",
      "raw": "Trump's threat of sanctions comes after Russia's heaviest attack of the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf8c157d26916af75c042b4ff5a1bc9aefc11af3",
      "title": "Five killed in Jerusalem shooting attack, paramedics say",
      "url": "https://www.bbc.com/news/articles/cr70ny0l7vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:28:57.000Z",
      "summary_90w": "",
      "raw": "Israeli police say two gunmen were \"neutralised\" after the attack at a bus stop, in which seven other people were seriously wounded.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2588595e65e6743b714fb35dc33cce3f3f33e581",
      "title": "Shooting attack at Jerusalem bus stop kills at least 5",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533923/israel-jerusalem-shooting",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:27:11.000Z",
      "summary_90w": "",
      "raw": "Paramedics said at least five people were killed in a shooting attack in Jerusalem after two attackers opened fire at a bus stop at a busy intersection in north Jerusalem.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ce7469d02a8eb2e489bcb1f7992c02741f44380",
      "title": "Spanish PM Pedro Sánchez says Israel is ‘exterminating a defenceless people’",
      "url": "https://www.theguardian.com/world/2025/sep/08/spanish-pm-pedro-sanchez-israel-exterminating-defenceless-people-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:20:34.000Z",
      "summary_90w": "",
      "raw": "Spain announces raft of measures designed to increase pressure on Benjamin Netanyahu to end Gaza war\n\nMiddle East crisis – live updates\n\nSpain’s prime minister, Pedro Sánchez, has stepped up his scathing criticism of Israel’s actions in Gaza, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.\nSpeaking on Monday morning to announce a raft of measures designed to increase the pressure on Netanyahu to stop the military campaign, Sánchez said that while the Spanish government would always support Israel’s right to exist and to defend itself, it felt compelled to try to “stop a massacre”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef6b423971661a246c2d2ba884445141733100a1",
      "title": "Minns backtracks on right to hunt over fears it could lead to US-style gun future",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/chris-minns-backtracks-nsw-right-to-hunt-shooters-and-fishers-bill",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:16:41.000Z",
      "summary_90w": "",
      "raw": "NSW premier initially supported the controversial bill which would have allowed recreational hunters to shoot feral animals on public lands\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe New South Wales premier has backtracked on a central element of a Shooters and Fishers’ private member’s bill – enshrining a right to hunt – saying it could undermine gun control and send the state down the US path of a right to bear arms.\n“We won’t be supporting any provision in [the bill] that will water down gun laws in NSW. They’ve been important pieces of keeping the community safe for a long period of time,” Chris Minns said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e5269d60359f3774ff4dee79a2271d22a6a46b4",
      "title": "Hawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:13:18.000Z",
      "summary_90w": "",
      "raw": "Sussan Ley under pressure to repair ties with diaspora group after NT senator claimed without evidence Labor was bringing in migrants to win votes\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nLiberal MP Alex Hawke has called on Jacinta Nampijinpa Price to apologise for the “real damage” her comments have caused the Indian community as the fallout continues internally and externally for the party.\nThe opposition has scrambled to repair ties with Indian Australians after Price’s remarks. On Monday, the Liberal leader, Sussan Ley, convened a roundtable with community leaders the day before she toured Sydney’s Harris Park – known as “Little India”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f3061f6ff9b741bc2349c9e983d099848e42888",
      "title": "Chinese state media accuses Wong and Marles of ‘stirring up tensions’ – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T09:04:11.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nHawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians\n\nGet our breaking news email, free app or daily news podcast\n\nVictoria’s supreme court will hand down the triple-murderer Erin Patterson’s sentence shortly. The state’s supreme court will allow a television camera inside the courtroom to broadcast the sentencing hearing – with a 10 second delay – for the first time.\nPatterson, 50, faces the prospect of spending the rest of her life in prison. Justice Christopher Beale will deliver her sentence from 9.30am in a hearing expected to last about 30 minutes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a17d725e28af25ca18a225e04e46ddd1a9a797a8",
      "title": "Watch: Glitz, glamour and emotional speeches at VMAs 2025",
      "url": "https://www.bbc.com/news/videos/crl5ngr2069o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:04:06.000Z",
      "summary_90w": "",
      "raw": "The MTV Video Music Awards (VMAs) have taken place in New York, with high profile figures in the music industry taking to the red carpet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5def065df31f3d820e9de7e841b016354e669d2d",
      "title": "20 years ago, New Orleans fired its teachers. It's been rebuilding ever since",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529311/schools-education-new-orleans-teachers-hurricane-katrina",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When New Orleans schools reopened after Katrina, most of the city's educators didn't get their jobs back. Instead, they were often replaced with young people who were new to town — and new to teaching.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93441c221cf21eea5a9e319a2ded131b33db8d3b",
      "title": "Alone in a foreign country, a young woman is saved by two strangers",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529374/alone-in-a-foreign-country-a-young-woman-is-saved-by-two-strangers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In 1980, Elaine Batchelor was attacked on a night train while backpacking alone in Europe. Two strangers stepped in and stayed by her side for the rest of the 12-hour ride.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "How brightly colored do we want our food? For brands, it's a hill to dye on",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f0375c8a939b0fcc70b7ee2689b73c4acb7fbb4",
      "title": "Trial begins for man charged with attempting to assassinate Trump",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529947/ryan-routh-trump-attempted-assassination-trial-begins",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Ryan Routh was arrested after a Secret Service agent spotted him holding a gun and fired on him when Trump was golfing at his West Palm Beach golf club in September. He faces up to life in prison.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88775c2668c9445989c544719d1b77dbd85a3193",
      "title": "What kind of dairy does a body good? Science is updating the answer",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/08/nx-s1-5528747/what-kind-of-dairy-does-a-body-good-science-is-updating-the-answer",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "New dietary guidelines are coming soon. Health Secretary Robert F. Kennedy Jr. has promised the days of skim milk and other low-fat dairy products are over. Is there a case for more fat in dairy?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8090bee0b7bbd41ad9c10cbe8d3aa6af2166b744",
      "title": "World Cup ticket sales are about to begin. Scoring them may not be easy — or cheap",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529273/fifa-world-cup-2026-ticket-sales",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "FIFA is set to launch the first window of regular ticket sales for the 2026 World Cup on Wednesday. Brace yourself: because they may not be easy to get — or cheap.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b62fdc7fe3c8cd498ac340e0efa947d2cba773b",
      "title": "French PM François Bayrou expected to be ousted in confidence vote",
      "url": "https://www.theguardian.com/world/2025/sep/08/french-pm-francois-bayrou-confidence-vote",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T08:59:41.000Z",
      "summary_90w": "",
      "raw": "Opposition parties planning to remove centrist and bring down minority government after just nine months\nThe French prime minister, François Bayrou, is expected to be ousted in a confidence vote on Monday afternoon, plunging the eurozone’s second biggest economy into political crisis.\nOpposition parties from the left to the far right have made clear they will vote against the 74-year-old centrist, meaning he and his minority government would fall after only nine months in office.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c69418396fb8c6aa1dd2e5c3dfbe989668977fd5",
      "title": "Weather tracker: Hawaii declares state of emergency as Hurricane Kiko looms",
      "url": "https://www.theguardian.com/environment/2025/sep/08/weather-tracker-hawaii-declares-state-of-emergency-hurricane-kiko",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T08:55:48.000Z",
      "summary_90w": "",
      "raw": "Heavy rain and powerful winds head for archipelago, while Spain braces for severe thunderstorms\nHawaii has declared a state of emergency for tropical storm-force winds, heavy rain and high surf as the weakening Hurricane Kiko heads for the archipelago.\nKiko began as a depression in the eastern Pacific basin on 31 August, before travelling westward last week and deepening into a category 1 hurricane by Tuesday 2 September as sustained winds exceeded 74mph (119km/h).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1507df7b933fc946887d2e37a5d8a575aec1951c",
      "title": "Mushroom murder survivor's plea to grieve away from the spotlight as wife's killer jailed",
      "url": "https://www.bbc.com/news/articles/cly1v06xz7qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T08:52:36.000Z",
      "summary_90w": "",
      "raw": "As Erin Patterson was sentenced, her sole surviving victim Ian Wilkinson called for privacy and kindness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44309a16a03c77bc272e66aaa19aa5e0d3f31d1c",
      "title": "Families ‘shattered’ and community ‘terrified’ as police hunt alleged Melbourne machete murderers",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/families-shattered-and-community-terrified-as-police-continue-to-hunt-alleged-cobblebank-machete-murderers-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T08:47:47.000Z",
      "summary_90w": "",
      "raw": "Premier says government stands with South Sudanese community in ‘fight against the cancer of youth gang crime’ after Cobblebank killings\nThe families of two children allegedly murdered in Melbourne’s outer west on the weekend are “shattered” and the community “terrified” as police continue to hunt the perpetrators responsible for the machete killings.\nIt comes as the Victorian premier promised the government would stand with the South Sudanese community “in their fight against the cancer of youth gang crime that is breaking their community’s heart”, announcing she would convene an existing working group.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd5758c6a4fc2bc52a9aedb02f73f54cef7493aa",
      "title": "'A heavy shirt to wear' - being Man Utd number one",
      "url": "https://www.bbc.com/sport/football/articles/c3drem05ekmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T08:05:33.000Z",
      "summary_90w": "",
      "raw": "An in-depth look at Manchester United's goalkeeping situation as Andre Onana prepares to leave on loan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89207c51076ab42d256d9b0ca5a8b5a755c753e4",
      "title": "InDrive has big plans to become a global ‘super app’ where others have failed",
      "url": "https://techcrunch.com/2025/09/08/indrive-has-big-plans-to-become-a-global-super-app-where-others-have-failed/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T08:00:00.000Z",
      "summary_90w": "",
      "raw": "InDrive plans to expand into multiple verticals over the next 12 months across its top markets, starting with grocery deliveries in Kazakhstan.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c1361e111e23a07a0dfa32a40c72f4406cb69901",
      "title": "Bruce Lehrmann launches legal challenge against national anti-corruption commission head and federal minister",
      "url": "https://www.theguardian.com/australia-news/2025/sep/08/bruce-lehrmann-launches-a-legal-challenge-against-national-anti-corruption-commission-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:58:18.000Z",
      "summary_90w": "",
      "raw": "Proceedings filed against the commissioner of the national anti-corruption commissioner, Paul Brereton, and federal special minister of state, Don Farrell\n\nGet our breaking news email, free app or daily news podcast\n\nDespite being on the brink of bankruptcy as a result of court proceedings, embattled former Liberal staffer Bruce Lehrmann has lodged legal action against the head of a corruption watchdog and a federal minister.\nThe legal action was filed by Lehrmann personally at 9.30pm on Thursday under the classification of a “judicial review”, which asks the court to review the legality of a governmental decision.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0fe7aba841b3f4f53700bbbf1c7a2b05d7cb187b",
      "title": "Ex-sergeant major admits sexually assaulting soldier who took her own life",
      "url": "https://www.bbc.com/news/articles/ckgqzxq0z55o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T07:41:25.000Z",
      "summary_90w": "",
      "raw": "Michael Webber pleaded guilty to sexual assault against teenage soldier Jaysley Beck, who was left traumatised by the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a15b219fe7b588558df1e85fa87a002b4f9ccede",
      "title": "The football wonderkids who didn't make it in the Premier League",
      "url": "https://www.bbc.com/sport/football/articles/cjw6xj5gjn7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T07:17:37.000Z",
      "summary_90w": "",
      "raw": "The Premier League has a history of young players making it big - which has continued this season - but not every starlet has followed up their bright start.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92c6e3934c891244053cede02b47ac3dd9bb0119",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:01:03.000Z",
      "summary_90w": "",
      "raw": "Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said\nA fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.\nThe whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "50301bd35c485f7b4e27a7e51f31d458acda7bd7",
      "title": "Australian triple murderer jailed for life over toxic mushroom lunch",
      "url": "https://www.bbc.com/news/articles/c1jzr1d5xk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T06:25:22.000Z",
      "summary_90w": "",
      "raw": "She will serve a non-parole period of 33 years for killing three relatives and trying to kill another.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2c05487bf4009e970ec540a06f48f1e758431b5",
      "title": "Fugitive father shot dead by police – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T06:17:21.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. Our full report is here: Tom Phillips shot dead after attempted burglary, NZ police confirm\nThe mayor of Waitomo, John Robertson, told the Guardian this morning’s events were the worst possible outcome for the community.\n“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.\nSo it’s just devastating news. Really the worst outcome we could have expected.\nNo day that goes by that I don’t think about all four of them.\nIt hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c39344a75c89de1c62067977aeffc07ccdd1b39a",
      "title": "Nagelsmann's Northern Ireland comments disrespectful - Craigan",
      "url": "https://www.bbc.com/sport/football/articles/c20z6l2qpqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T06:14:09.000Z",
      "summary_90w": "",
      "raw": "BBC Sport NI pundit Stephen Craigan feels comments from Germany coach Julian Nagelsmann on Northern Ireland were \"disrespectful\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfed3b74c31645cc875de2aa9e06a4dfa380e09a",
      "title": "'Don't be afraid': The self-written note that inspired Alcaraz to latest US Open triumph",
      "url": "https://www.bbc.com/sport/tennis/articles/c9v7nld4we2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T06:11:46.000Z",
      "summary_90w": "",
      "raw": "Before the US Open, Carlos Alcaraz told himself to \"go for it, don't be afraid\". He lived by that motto as he went on to take the title.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "176442bb10b8a44dd6d927000c62741e2845183e",
      "title": "Uber and Momenta to test autonomous vehicles in Germany in 2026",
      "url": "https://techcrunch.com/2025/09/07/uber-and-momenta-to-test-autonomous-vehicles-in-germany-in-2026/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-08T06:00:00.000Z",
      "summary_90w": "",
      "raw": "Momenta is one of 20 global AV partners that Uber has scooped up across its ridehail, delivery, and freight businesses. Uber says those partnerships have already generated an annualized rate of 1.5 million mobility and delivery.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e1383fdfe6cfd863b770d004661d27613115cf58",
      "title": "Uber and Momenta will test fully driverless cars in Germany",
      "url": "https://www.theverge.com/news/772639/uber-momenta-l4-driverless-test-munich-robotaxi",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-08T06:00:00.000Z",
      "summary_90w": "",
      "raw": "Uber and one of its many robotaxi partners, Momenta, will test fully driverless cars in Germany next year. The news comes as Europe continues to lag behind the US and China in the number of commercially operational robotaxi services. \nThe companies say they will test Level 4 autonomous vehicles in Munich starting in 2026. (Level 4 describes fully driverless vehicles, without safety drivers, that can operate anywhere within a defined geographic area.) If everything goes according to plan in Munich, Uber says that Momenta robotaxis could be coming to additional European cities in the years to come. \nMomenta is based in Shanghai, where it is currently operating its own robotaxi service. Earlier this year, Uber said it would allow the company to add its robotaxis to its ridehailing platform, though it would be cities outside the US and China. Uber also said that Momenta’s robotaxis would feature safety monitors behind the wheel at launch, before eventually transitioning to fully driverless vehicles. \nMomenta, which has received funding from China’s state-owned SAIC Motor, GM, Toyota, Mercedes-Benz, and Bosch, currently supplies driver assist software to a number of automakers, including Mercedes and BMW. \nThough it currently lags behind the US and China, Europe is starting to see more robotaxi action that signals the floodgates could soon be open. In addition to Uber and Momenta, China’s Baidu and Lyft plan on bringing driverless taxis to the UK and Germany in 2026. Volkswagen has also been testing autonomous vehicles in Germany for several years, and recently said it would launch its own robotaxi service with — you guessed it — Uber in Los Angeles in 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "742be6fb1885ebd929599a7c1550ffe5d47aeef9",
      "title": "'I see you more than my family' - Alcaraz on Sinner rivalry",
      "url": "https://www.bbc.com/sport/tennis/articles/clyl0j40yr2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T05:53:53.000Z",
      "summary_90w": "",
      "raw": "Carlos Alcaraz joked that he sees Jannik Sinner more than his family - but it is difficult to see who can challenge them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "422b4c7ebd2e44953a9f297257daac3e5d3300ee",
      "title": "Japan’s next PM will face a problem that won’t go away with Shigeru Ishiba’s resignation",
      "url": "https://www.theguardian.com/world/2025/sep/08/japan-shigeru-ishiba-resignation-next-pm-will-face-problem-that-wont-go-away",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T05:25:34.000Z",
      "summary_90w": "",
      "raw": "The ruling Liberal Democratic party is still grappling with the fallout from a years-old funding scandal that may see it go into opposition for just the third time in its history\nThe precise timing of Japanese prime minister Shigeru Ishiba’s resignation announcement – on a Sunday evening – took many by surprise; but the countdown to his departure arguably began just weeks after he took office.\nHaving won the presidency of the Liberal Democratic party (LDP) – a formidable political force that has governed Japan for much of the past seven decades – Ishiba called a snap election in search of a public mandate after a major funding scandal, and to silence his opponents on the right of the party.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54616e387571abd5f00bdaf4237c46afb69af477",
      "title": "Australian woman is sentenced to life for poisoning relatives with mushrooms",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533902/australia-erin-patterson-life-sentence-mushroom-murder",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-08T05:14:43.000Z",
      "summary_90w": "",
      "raw": "An Australian judge sentenced triple-murderer Erin Patterson to life in prison with a non-parole period of 33 years for poisoning four of her estranged husband's relatives with death cap mushrooms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a0ea8bcfd8e548e3b062ceb470fb9545d728839",
      "title": "'Suitcase murder' trial begins in New Zealand",
      "url": "https://www.bbc.com/news/articles/cn83jjx9pjvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T05:12:14.000Z",
      "summary_90w": "",
      "raw": "Hakyung Lee is accused of killing her two young children, whose bodies were found stuffed in suitcases.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1835c1899fa4f16b5164d5956723094ada862d36",
      "title": "'I pretended to be Owen on the street - but you can't compare us'",
      "url": "https://www.bbc.com/sport/football/articles/cr4qxqgqr9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T05:04:18.000Z",
      "summary_90w": "",
      "raw": "Which England great was better aged 17 - Wayne Rooney or Michael Owen? After Owen started the debate, Rooney replies in his latest BBC podcast.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ddfbb3dc5f62c8ce222017e5bcb40503f190088",
      "title": "Huge drugs bust reveals battles on cocaine 'superhighway'",
      "url": "https://www.bbc.com/news/articles/c5yvplyrrwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T05:02:40.000Z",
      "summary_90w": "",
      "raw": "An audacious attempt to smuggle tonnes of cocaine was stopped, but pressure from drug cartels remains.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b6e425f4fb66291d81b91b419409a607f33f73c",
      "title": "'He put his hand down my tights': Sexual harassment widespread among barristers, review finds",
      "url": "https://www.bbc.com/news/articles/c8xrejzk0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T04:46:41.000Z",
      "summary_90w": "",
      "raw": "Widespread problems with sexual harassment and bullying within the Bar are detailed in a report.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T04:28:34.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df935d39b3fdd17370840418ecd274c98faa1ded",
      "title": "Protests expected as 51 Israeli arms makers among exhibitors at London trade fair",
      "url": "https://www.theguardian.com/world/2025/sep/08/protests-expected-as-51-israeli-arms-makers-among-exhibitors-at-london-trade-fair",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T04:00:40.000Z",
      "summary_90w": "",
      "raw": "Campaign Against Arms Trade says UK government has hit ‘peak complicity in genocide’ in allowing the firms to exhibit\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\nTheir presence will be the focus for hundreds planning to demonstrate outside the four-day arms fair, at which the defence secretary, John Healey, is expected to speak alongside senior British military officials.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d98772a77dc18103b9621c4858b7c273dfdb6c6b",
      "title": "What it was like inside court as mushroom murderer was jailed for life",
      "url": "https://www.bbc.com/news/videos/c15k4y5nwz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T03:32:23.000Z",
      "summary_90w": "",
      "raw": "The BBC's Katy Watson was in the courtroom as Erin Patterson was sentenced to life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "169b304d9ac7730c59b76c700858afeb431517b9",
      "title": "Palestinian prisoners not being given adequate food, Israel top court says",
      "url": "https://www.bbc.com/news/articles/c1mxlk518vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T02:53:54.000Z",
      "summary_90w": "",
      "raw": "The court said the state is legally obligated to provide enough food to ensure \"a basic level of existence.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82eb201f0fb6c960f6bd056609aa7f6a5000188d",
      "title": "Duped of millions in 'digital arrest', Indian woman seeks answers from banks",
      "url": "https://www.bbc.com/news/articles/clydllln9lgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T00:45:32.000Z",
      "summary_90w": "",
      "raw": "Anjali asks why such huge sums leaving her account didn’t trigger red flags and automatic alerts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "560ce79c5ad9c75d0a13333406a1f6952e60334e",
      "title": "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533207/carlos-alcaraz-trump-us-open-tennis-rolex",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T00:37:01.000Z",
      "summary_90w": "",
      "raw": "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "28bfa7a0e3281e7c4957e936fd730e89f2e185da",
      "title": "Ryan Routh to stand trial for alleged Trump assassination attempt",
      "url": "https://www.bbc.com/news/articles/c8xre584drdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T00:35:02.000Z",
      "summary_90w": "",
      "raw": "A court case for Mr Routh, who has pleaded not guilty, begins on Monday - with the defendant representing himself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d67032409ea5eda031587317220dbdac2861101",
      "title": "TUC chief calls on ministers to show 'whose side' they are on",
      "url": "https://www.bbc.com/news/articles/cge2j0rrwvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-08T00:11:00.000Z",
      "summary_90w": "",
      "raw": "Paul Nowak will tell his annual conference the government must do more for working class communities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61029694d6d164b5d0539aaa3c298cb2e6a4737f",
      "title": "Trump issues ‘last warning’ to Hamas to accept Gaza ceasefire deal",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/trump-gaza-israeli-hostages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T00:01:42.000Z",
      "summary_90w": "",
      "raw": "President says ‘the Israelis have accepted my terms’ and urges release of hostages to secure peace agreement\nDonald Trump on Sunday issued what he called his “last warning” to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.\n“The Israelis have accepted my Terms. It is time for Hamas to accept as well,” Trump said in a post on his Truth Social platform. “I have warned Hamas about the consequences of not accepting. This is my last warning, there will not be another one!”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00eddcc625e0a689eb77ff2ee9a6f2f35ca97bee",
      "title": "France is set to vote out another PM. Can anything break its political deadlock?",
      "url": "https://www.bbc.com/news/articles/cm2z8xyz68mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T23:52:21.000Z",
      "summary_90w": "",
      "raw": "François Bayrou called a vote of confidence in himself after nine relatively ineffectual months in office.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "354e963cf8bb8116917d0a9ef09baa2936b57556",
      "title": "In US town hoping for revival, Trump's tariffs put to test",
      "url": "https://www.bbc.com/news/articles/c3rvdxz9589o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T23:38:33.000Z",
      "summary_90w": "",
      "raw": "The gulf between Trump's rhetoric and the reality on the ground is starting to show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea44d836cdfeed434a38342d87e7dd5e49cfca2d",
      "title": "I haven't lived with my husband for 15 years - we're still happily married",
      "url": "https://www.bbc.com/news/articles/c5y21nvd56ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T23:35:35.000Z",
      "summary_90w": "",
      "raw": "Margaret says it can be lonely for both her and her husband, but talking regularly makes it work.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb321a5ec31ad66b516c657d96408e9d9bbd9c25",
      "title": "More than 90,000 Jeep Grand Cherokees recalled over potential loss of drive power",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533180/jeep-grand-cherokee-recall-plug-in-hybrid",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T23:24:34.000Z",
      "summary_90w": "",
      "raw": "Vehicles impacted by the recall include 2022 to 2026 plug-in hybrid electric models of the Jeep Grand Cherokee.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dbad04708a3dc7972c447fc4ea8545ac9955e61d",
      "title": "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "url": "https://www.bbc.com/news/articles/c5yqg0rln74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T23:14:55.000Z",
      "summary_90w": "",
      "raw": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67443c3bc8ea74ec08ff53c2960049d49b2088ad",
      "title": "'I don't dare go back': BBC visits Cambodian villages caught in Thai border conflict ",
      "url": "https://www.bbc.com/news/articles/c059j8759rlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T22:04:15.000Z",
      "summary_90w": "",
      "raw": "Tension along disputed parts of the border with Thailand erupted into conflict in July, leaving dozens dead.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "749489d4676afbc12e157f6c04f0cfb493b498bf",
      "title": "New business secretary Peter Kyle going to China for trade talks this week",
      "url": "https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T21:31:50.000Z",
      "summary_90w": "",
      "raw": "Former science secretary promoted in reshuffle to continue UK efforts to revitalise trade relationship with Beijing \nThe UK’s new business secretary, Peter Kyle, will fly to Beijing this week as part of Keir Starmer’s continuing efforts to revitalise the UK’s trade relationship with China and provide growth to the British economy.\nThe former science and technology secretary, who was promoted in Friday’s government reshuffle, is expected to land in China on Wednesday, picking up the schedule of his predecessor, Jonathan Reynolds, who is now the chief whip.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a49bd55cf23e32751be3a871080cfa8d0a938c2",
      "title": "Microsoft says Azure affected after cables cut in the Red Sea",
      "url": "https://techcrunch.com/2025/09/07/microsoft-says-azure-affected-after-cables-cut-in-the-red-sea/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T21:31:17.000Z",
      "summary_90w": "",
      "raw": "It's not clear who cut the cables or why.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "500ac78a34cdd747c9051fb4564774f8628b268c",
      "title": "Are bad incentives to blame for AI hallucinations?",
      "url": "https://techcrunch.com/2025/09/07/are-bad-incentives-to-blame-for-ai-hallucinations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T21:23:23.000Z",
      "summary_90w": "",
      "raw": "How can a chatbot be so wrong — and sound so confident in its wrongness?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9ff9547d6b0b15108e13980eaeff8090421ec8f3",
      "title": "In pictures: Blood Moon captivates sky-gazers around the world ",
      "url": "https://www.bbc.com/news/articles/cx25nyjl4pdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T21:02:33.000Z",
      "summary_90w": "",
      "raw": "During a total lunar eclipse the Moon passes through the Earth's shadow, taking on a deep red hue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce1f11abc06037f96091936f74176bcd11cd3e44",
      "title": "Greta Thunberg's Gaza flotilla arrives in Tunisia",
      "url": "https://www.bbc.com/news/articles/c4gjz0d366eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T20:53:14.000Z",
      "summary_90w": "",
      "raw": "The boats, carrying 350 pro-Palestinian activists and stocked with medical and food supplies, are en route to Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3423a752f7abd52fb923966ef2e52970c39ebdcd",
      "title": "Koah raises $5M to bring ads into AI apps",
      "url": "https://techcrunch.com/2025/09/07/koah-raises-5m-to-bring-ads-into-ai-apps/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T20:48:42.000Z",
      "summary_90w": "",
      "raw": "One investor says Koah is \"building the essential monetization layer for consumer AI.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d0e3227be96864d79ced6d1d6dc7fb548772e698",
      "title": "Google finally details Gemini usage limits",
      "url": "https://www.theverge.com/news/773496/google-gemini-usage-limits",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T19:51:23.000Z",
      "summary_90w": "",
      "raw": "Until very recently it wasn’t clear what usage limits were placed on Gemini at the various tiers. Thankfully Google has finally updated its Help Center article detailing “Gemini Apps limits & upgrades for Google AI subscribers.”\nGone are the useless descriptors like “limited access” or vague statements like “we may at times have to cap the number of prompts and conversations you can have, or how much you can use some features, within a specific timeframe.” Instead it clearly states that you get up to five prompts a day with Gemini 2.5 Pro on a free account, 100 with an AI Pro plan, or 500 with AI Ultra. \nFree accounts are also limited to five Deep Research reports and 100 generated images a day. If you need to make more than 100 AI generated images in a day, A: For what? B: Upgrading to a Pro or Ultra account will get you 1,000 images. You can check out the full breakdown here.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8dc51936161f06ac040b39290844fdee168850c9",
      "title": "Hyundai’s eVTOL startup Supernal pauses work following CEO and CTO departures",
      "url": "https://techcrunch.com/2025/09/07/hyundais-evtol-startup-supernal-pauses-work-following-ceo-and-cto-departures/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The shakeup comes as the startup was still struggling to get its test vehicle off the ground -- literally. The first flight was only in March.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0661abf8fdc49931231d15fac7c879674441fde5",
      "title": "Israel’s top court says government is not giving Palestinian prisoners enough food",
      "url": "https://www.theguardian.com/world/2025/sep/07/israels-supreme-court-says-government-is-not-giving-palestinian-prisoners-enough-food",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T19:07:35.000Z",
      "summary_90w": "",
      "raw": "Justices rule state is legally obliged to ensure ‘basic level of existence’ and orders authorities to improve nutrition\nIsrael’s supreme court has ruled that the government has failed to provide Palestinian security prisoners with adequate food for basic subsistence and ordered authorities to improve their nutrition.\nSunday’s decision was a rare case in which the country’s highest court ruled against the government’s conduct during the nearly two-year war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d625229d1d985684c5f55631964a7ff359406eb",
      "title": "Timelapse shows Blood Moon rising around the world",
      "url": "https://www.bbc.com/news/videos/c93071yz5zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T19:00:54.000Z",
      "summary_90w": "",
      "raw": "As the Moon passes through the Earth's shadow, it takes on a deep red hue, creating a striking \"Blood Moon\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "778cfd5c32802766c7012c868c59bd67c4bf4e1e",
      "title": "300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T18:08:24.000Z",
      "summary_90w": "",
      "raw": "Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles\nSouth Korea announced on Sunday that the roughly 300 of its nationals detained during an immigration raid in Georgia would be released and flown home, as the sudden detention of workers appeared to strain the longstanding diplomatic and economic relationship between the two nations.\nNearly 500 workers, among them at least 300 South Koreans and at least 23 Mexicans, were arrested at the Hyundai-LG battery plant in the city of Ellabell on Thursday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fb66623af50785279079c5a85f4b29f2fddd222",
      "title": "Postal traffic to US drops more than 80% after trade exemption rule ends, UN agency says",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533121/postal-traffic-to-us-drops-more-than-80-after-trade-exemption-rule-ends-un-agency-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-07T17:54:41.000Z",
      "summary_90w": "",
      "raw": "The de minimis rule that allowed small packages worth less than $800 to be exempt from tariffs ended on Friday, Aug. 29, 2025.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "783bb99892c1d02ab88be7b98ef4afa61673c021",
      "title": "GM slows EV production as tax credit nears expiration",
      "url": "https://www.theverge.com/news/773492/gm-cuts-ev-production-tax-credit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T17:27:45.000Z",
      "summary_90w": "",
      "raw": "General Motors is going to be scaling back production of the Cadillac Lyriq and Vistiq, as well as the Chevy Bolt EV as it expects sales of electric vehicles to slow dramatically. The $7,500 consumer tax credit for purchasing a new EV is set to expire at the end of the month. That credit has been crucial to driving demand for EVs, which are still more expensive than their gas-powered counterparts.\nThe company is pausing production on the Lyriq and Vistiq at its Spring Hill, Tennessee plant in December. It’s also planning to halt manufacturing for a week in November and October, as well as slow production during the first five months of 2026 by temporarily laying off one of its shifts of workers. Similarly, it’s indefinitely delaying the start of a second shift at a plant near Kansas City, which is supposed to begin producing the Chevy Bolt EV later this year. \nWhile EV sales have struggled to meet expectations, they have improved over time. GM even announced that August was its best month on record for EV sales. But in the same press release it was quick to note that it was unsure what the future would hold. “We will almost certainly see a smaller EV market for a while, and we won’t overproduce,” the company’s Senior Vice President and President, North America, Duncan Aldred, wrote.\nBack in May, transportation editor Andrew J. Hawkins said, “the US was already woefully behind China and other developed nations in terms of clean energy investments. And now it’s likely to fall even further behind, perhaps permanently so.” When the largest American automaker is aggressively slashing EV production, even as sales surge, it’s hard to see how the US can catch up.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2cce5767605830e7ed6d37c7b2d8e40edc227906",
      "title": "Argentine rights activist Rosa Roisinblit dies aged 106",
      "url": "https://www.bbc.com/news/articles/cewn2nky1w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T16:41:17.000Z",
      "summary_90w": "",
      "raw": "A leading member of the Grandmothers of Plaza de Mayo, she helped convict men who abducted hundreds of babies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d3b2c06d8f9af601040873109a002d23088b591",
      "title": "Thousands flock to Vatican as teenager made first millennial saint ",
      "url": "https://www.bbc.com/news/videos/cy9njpyp09do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T16:32:36.000Z",
      "summary_90w": "",
      "raw": "Pope Leo canonises the London-born Italian boy nicknamed \"God's influencer\" for his online skills.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "922661201adabb2ad3a56d0e6c944b1f248a80d3",
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "url": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T15:56:23.000Z",
      "summary_90w": "",
      "raw": "Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers\nThe Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.\n“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military strike against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ea3b664ecec490dcdab455653c42752ddb6278a",
      "title": "TIFF 2025: Frankenstein, Knives Out 3, and all the biggest movies from Toronto",
      "url": "https://www.theverge.com/film/773480/tiff-2025-frankenstein-wake-up-dead-man-movie-reviews",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T15:30:00.000Z",
      "summary_90w": "",
      "raw": "The Toronto International Film Festival is almost like a preview of the movie slate for the next few months — and this year I’m watching as much as possible to give you all the scoop on what’s ahead. To do that, I’ll be writing a dispatch covering every movie I’ve seen that day, which will run daily throughout most of the festival. That includes bigger movies you probably already know about, like Netflix’s Wake Up Dead Man and Frankenstein, along with hopefully some great new films you maybe weren’t aware of, like the creepy adaptation of the horror game The Exit 8.\nI won’t be able to see everything, of course, but I’ll do my best to bring you the most interesting stuff — and you can keep up with everything right here.\nWake Up Dead Man adds a delightfully dark twist to Knives Out\n\t\t\t\nPark Chan-wook’s No Other Choice is as bleak as it is hilarious\n\t\t\t\nThe Exit 8 movie is even scarier than the game",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5248451b73a3a4c0b98cc328861f130c8f0ed986",
      "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
      "url": "https://techcrunch.com/2025/09/07/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-07T14:54:03.000Z",
      "summary_90w": "",
      "raw": "Mistral AI, the French company behind AI assistant Le Chat and several foundational models, is officially regarded as one of France’s most promising tech startups and is arguably the only European company that could compete with OpenAI. It is reportedly in the process of raising another round that would value it at $14 billion, up […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b12d460a595afe54a03df7010e2551417a756996",
      "title": "Volkswagen rounds out new lineup of affordable EVs with ID. Cross concept",
      "url": "https://www.theverge.com/news/773435/volkswagen-rounds-out-new-lineup-of-affordable-evs-with-id-cross-concept",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T14:46:06.000Z",
      "summary_90w": "",
      "raw": "Everyone basically agrees: if you want people to transition from polluting gas guzzlers to electric cars, you have to make them more affordable. The luxury EVs, with their big battery packs and fine leather interiors, are all well and good, but if you really want to move the needle on EV adoption, we need more entry-level options. And so far, we’re lacking. \nVolkswagen hears this, and is responding with a new lineup of small and mid-sized electric vehicles aimed squarely at the low end of the market. We’ve already seen the ID.2all  — recently renamed ID. Polo and ID. Polo GTI — and ID.EVERY1 concepts. Now we’re getting a fourth concept, the ID. Cross, which VW says will get a proper reveal next year. The concept’s name invokes the ID.4’s predecessor, the ID.Crozz, from 2017. \nThe ID. Cross introduces a new design language that VW says it “friendlier” and more approachable than its current lineup of EVs. For evidence of this, look no further than the front fascia with its narrow headlights and a slightly curved lightbar that looks like its smiling at you. \n\nThe ID. Cross introduces a new design language that VW says it “friendlier”\n\n\nAn electric counterpart to the popular VW T-Cross, the ID. Cross will be built on the automaker’s MEB Plus platform, which is an improvement over the current MEB that powers the ID.4 crossover SUV, the ID Buzz minivan, and a dozen other vehicles from Audi, Skoda, and others. This next-gen platform will have better batteries, engines, and software, VW promises — which, if you’ve ever encountered a current MEB vehicle’s software, will come as welcome news. \nThe concept’s front-wheel drive motor spits out 155kW of power, which is the equivalent of around 208 horsepower. It has a range of 420km (260 miles) based on the more generous WLTP cycle. And it can hit a top speed of 175 km/h (108 mph). And with a ball coupling, the ID. Cross can haul up to 75 kg (165 lbs), which VW says is enough to transport two e-bikes. \nThis new drive system will be built in Europe; if fact, VW makes no mention at all of the US market. Not surprising, considering the uneven success the automaker’s EVs have had in America. But still disappointing, considering how starved we are for fun, affordable EVs. \nThe ID. Cross will be similar in size to the T-Cross, which is smaller than the already fairly compact ID.4 SUV. The Cross will be 4,161 mm (164 in) long, 1,839 mm (72 in) wide, and 1,588 mm (63 in) tall — with a wheelbase of 2,601 mm (102 in). The concept is perched on 21-inch alloy wheels designed specifically for the ID. Cross. \nThat said, VW is trying to use the smallish size to its best advantage. With five people inside, the ID. Cross will have a storage capacity of 450 liters, plus 25 more liters in the frunk. The addition of a front truck is a nice surprise, considering all of VW’s current EVs have been sorely lacking in extra storage space. \nThe interior includes fabric-covered surfaces on the dash that matches the materials used on the seats. The steering wheel features — gasp! — real buttons to control driver assist functions and more, which is notable because VW got a lot of blowback for its lack of physical controls in its current crop of EVs. The front seats can be folded flat, flush with the rear seats when stowed, to create a completely flat surface that can be used for car camping. \nVW says the production version of the ID. Cross will get a proper reveal next summer, after the launch of the ID. Polo and ID. Polo GTI, based on the ID.2all concept. The ID.EVERY1 — which has yet to get its production rebranded name — will be out in 2027.\nVW is betting that its newly “likeable” and affordable EVs will help lift its fortunes in the face of fierce competition from China, especially at the low end of the market. The German automaker, which also owns Audi, Porsche, Lamborghini, Skoda, Seat, and others, hasn’t had the same kind of EV success as its crosstown rival BMW, or even South Korean competitors like Hyundai and Kia. Its European sales have been a bright spot in an otherwise uneven portfolio, which may explain why the company isn’t making any commitments beyond the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49beb9bb6ac7a34046b2f1c1fcad63163b090eab",
      "title": "Wake Up Dead Man adds a delightfully dark twist to Knives Out",
      "url": "https://www.theverge.com/movie-reviews/773429/tiff-2025-wake-up-dead-man-bad-apples-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T13:00:00.000Z",
      "summary_90w": "",
      "raw": "When director Rian Johnson introduced the new Knives Out film on the third day of TIFF 2025, he exclaimed: \"we're going back to church.\"\nBy that he meant that Wake Up Dead Man, the latest Benoit Blanc mystery, would harken back to the origins of the whodunit, and in particular the gothic vibes of Edgar Allan Poe. And now that I've seen it, I have to say that Johnson pulled it off: the new movie has a darker and more spiritual feel than its predecessors, and yet it's still distinctly Knives Out, which is to say twisting and hilarious. I gasped a few times, as did the rest of audience, at the many reveals. I'll have a full review in the comin …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0fe570bcd6e2a3b58109dd5c2f1291d3dbf2ebcf",
      "title": "Computer chips, with a side of forever chemicals",
      "url": "https://www.theverge.com/the-stepback-newsletter/772845/computer-chips-forever-chemicals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-07T12:00:00.000Z",
      "summary_90w": "",
      "raw": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on all things at the intersection of environment and technology, follow Justine Calma. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started\nSome stories that I've worked on as an environmental journalist still haunt me. One of the first to get under my skin happened to be about forever chemicals. \nSince the 1940s, forever chemicals have been commonly used by manufacturers as a way to make things resistant to water, stains, and heat. Think food packaging, nonstick pans, water-repellan …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0821bfdb2476b823c1947bf67d7f1ab6c7c26f63",
      "title": "Has Labour Just Moved Towards the Right?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1cyhy?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-07T11:54:00.000Z",
      "summary_90w": "",
      "raw": "With Angela Rayner out, is Keir Starmer’s government more right wing?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "69ee372a67aefdd9ae7a23bc1be9ab19f8761145",
      "title": "LGBTQ+ Americans consider move to Canada to escape Trump: ‘I’m afraid of living here’",
      "url": "https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-07T10:00:17.000Z",
      "summary_90w": "",
      "raw": "LGBTQ+ people in the US contemplate heading north as they wrestle with the president’s assault on the community\nThe number of LGBTQ+ Americans inquiring about moving to Canada has soared since Donald Trump’s re-election, campaigners have said, as people across the US wrestle with the fallout of rising anti-gay rhetoric, anti-trans executive orders, and the more than 600 bills targeting LGBTQ+ rights.\n“So much is happening in the US right now and a lot of it is terrifying,” said Latoya Nugent of Rainbow Railroad, a North American charity that helps LGBTQI+ individuals escape violence and persecution in their home countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "baf3d47203d4aa69d8a84aa0162af5b7c5f9509c",
      "title": "Why is an Amazon-backed AI startup making Orson Welles fan fiction?",
      "url": "https://techcrunch.com/2025/09/06/why-is-an-amazon-backed-ai-startup-making-orson-welles-fan-fiction/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T21:30:22.000Z",
      "summary_90w": "",
      "raw": "This is a bad idea.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "febb535b7ba16857aa2cf831ebebac7cc2367a85",
      "title": "South Korea charters plane to fly home over 300 workers detained by ICE at Georgia Hyundai plant",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532604/hyundai-immigration-raid-georgia-south-korea",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T19:38:32.000Z",
      "summary_90w": "",
      "raw": "On Sunday, South Korean officials said they would send a plane to bring the detained workers home. Earlier, South Korea's Foreign Minister said his nation was \"deeply concerned\" by the arrests.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "126cb85fc3f66a189bc693da8a17c18c1b6fcafa",
      "title": "EU fines Google $3.5B over adtech ‘abuse’",
      "url": "https://techcrunch.com/2025/09/06/eu-fines-google-3-5b-over-adtech-abuse/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T17:06:03.000Z",
      "summary_90w": "",
      "raw": "This is the EU's largest antitrust penalty ever — and Trump has already threatened to \"nullify\" it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8975cb71bfcd445535ac0c1981eb7726a728226b",
      "title": "The growing debate over expanding age verification laws",
      "url": "https://techcrunch.com/2025/09/06/the-growing-debate-over-expanding-age-verification-laws/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T16:00:00.000Z",
      "summary_90w": "",
      "raw": "As age and identity verification laws become more mainstream, this legislation could have a dire impact on privacy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a924b908341c1c86f307db4c6c9498dfecd63811",
      "title": "Musk’s $1T pay package is full of watered-down versions of his own broken promises",
      "url": "https://techcrunch.com/2025/09/06/musks-1t-pay-package-is-full-of-watered-down-versions-of-his-own-broken-promises/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T14:02:36.000Z",
      "summary_90w": "",
      "raw": "Musk used to say Tesla would make 20 million cars and one million humanoid robots per year. The company's board wants far less than that in exchange for $1 trillion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ff5bffa30fc613afcdb7a34b907996e064561552",
      "title": "Opinion: Susan Stamberg, trailblazer and NPR Founding Mother, retires",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5522120/opinion-susan-stamberg-trailblazer-and-npr-founding-mother-retires",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T12:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR Founding Mother Susan Stamberg is retiring. She became the first woman to anchor a nightly national news program in 1972, and helped loosen up the serious, stodgy sound of radio hosts.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04f64312059b1aa29a182530f112c797830ea1b3",
      "title": "How an 18th-century portrait stolen by the Nazis was recovered 80 years later in Argentina",
      "url": "https://www.theguardian.com/world/2025/sep/06/18th-century-portrait-stolen-by-nazis-recovered-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Painting was spotted online by Dutch journalists when the daughter of a former Nazi official put her house up for sale in Mar del Plata\nThere was nothing very remarkable about the middle-aged couple who lived in the low, stone-clad villa on calle Padre Cardiel, a quiet residential street in the leafy Parque Luro district of Argentina’s best-known seaside town, Mar del Plata.\nPatricia Kadgien, 59, was born in Buenos Aires, five hours to the north. Her social media described her as a yoga teacher and practitioner of biodecoding, an obscure alternative therapy that claims to cure illness by resolving past traumas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1731bbfe2d88f2f34ec7d43bcd198b36ff02523f",
      "title": "OpenAI reorganizes research team behind ChatGPT’s personality",
      "url": "https://techcrunch.com/2025/09/05/openai-reorganizes-research-team-behind-chatgpts-personality/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T23:19:12.000Z",
      "summary_90w": "",
      "raw": "OpenAI is shuffling the team that shapes its AI models' behavior, and its leader is moving on to another project within the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76d81638d9b80d90fd38c1e1e8fc79e09b51402a",
      "title": "Under Trump, the Federal Trade Commission is abandoning its ban on noncompetes",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528937/ftc-noncompete-ban-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T21:46:33.000Z",
      "summary_90w": "",
      "raw": "Federal Trade Commission Chair Andrew Ferguson has called his agency's rule banning noncompetes unconstitutional. Still, he says protecting workers against noncompetes remains a priority.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8a756f86af8b9e727568afbc53119ada7d8084da",
      "title": "Screw the money — Anthropic’s $1.5B copyright settlement sucks for writers",
      "url": "https://techcrunch.com/2025/09/05/screw-the-money-anthropics-1-5b-copyright-settlement-sucks-for-writers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T20:59:21.000Z",
      "summary_90w": "",
      "raw": "Writers aren't getting this settlement because their work was fed to an AI -- this is just a costly slap on the wrist for Anthropic because it illegally downloaded books instead of buying them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0a2945e4f3d3901564e99ea2e0388645285dae0",
      "title": "Judge blocks ending of legal protections for 1m Venezuelans and Haitians in US",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/ruling-end-protections-haitian-venezuelan-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T20:50:00.000Z",
      "summary_90w": "",
      "raw": "Homeland security had tried to end temporary protected status granted by the Biden administration\nA federal judge on Friday ruled against the Trump administration from ending temporary legal protections that have granted more than 1 million people from Haiti and Venezuela the right to live and work in the United States.\nThe ruling by US district judge Edward Chen of San Francisco for the plaintiffs means that 600,000 Venezuelans whose temporary protections expired in April or whose protections were about to expire on 10 September have status to stay and work in the United States.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a15f675293d87d02b0d0eafad506e9a423a5df44",
      "title": "Personalized AI companion app Dot is shutting down",
      "url": "https://techcrunch.com/2025/09/05/personalized-ai-companion-app-dot-is-shutting-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:27:47.000Z",
      "summary_90w": "",
      "raw": "Dot, a personalized AI companion, is shutting down.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d43e495d89e6265b7aa597cb08a59ddbe134fac7",
      "title": "Attorneys general warn OpenAI ‘harm to children will not be tolerated’",
      "url": "https://techcrunch.com/2025/09/05/attorneys-general-warn-openai-harm-to-children-will-not-be-tolerated/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:21:45.000Z",
      "summary_90w": "",
      "raw": "California Attorney General Rob Bonta and Delaware Attorney General Kathy Jennings met with and sent an open letter to OpenAI to express their concerns over the safety of ChatGPT, particularly for children and teens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab43f2749f854c9cb6147eb9e5e83bac30a01186",
      "title": "Google Gemini dubbed ‘high risk’ for kids and teens in new safety assessment",
      "url": "https://techcrunch.com/2025/09/05/google-gemini-dubbed-high-risk-for-kids-and-teens-in-new-safety-assessment/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:09:12.000Z",
      "summary_90w": "",
      "raw": "Google's Gemini comes up short on kids' safety, says Common Sense Media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1dd6e09a0de87a396a8f5161015879791f359f50",
      "title": "Cutting through the equity noise: Don’t miss this powerhouse panel at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/startup-hiring-isnt-just-about-the-pitch-its-about-the-package-pulley-645-ventures-and-epigram-legal-break-it-down-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T18:30:00.000Z",
      "summary_90w": "",
      "raw": "Leaders from Pulley, 645 Ventures, and Epigram Legal join the Builders Stage at TechCrunch Disrupt 2025, happening October 27-29 in San Francisco. Register to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8698efee7b6366b4354843f2b1d30953244ef13",
      "title": "A timeline of the US semiconductor market in 2025",
      "url": "https://techcrunch.com/2025/09/05/a-timeline-of-the-u-s-semiconductor-market-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T18:26:00.000Z",
      "summary_90w": "",
      "raw": "From leadership changes at legacy semiconductor companies to wishy washy policy around chip exports, a lot has happened already.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b163cba03be477c514c241d0963303189072c087",
      "title": "Roblox announces short-form video feed for gameplay clips, new AI tools for creators, and more",
      "url": "https://techcrunch.com/2025/09/05/roblox-announces-short-form-video-feed-for-gameplay-clips-new-ai-tools-for-creators-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:30:00.000Z",
      "summary_90w": "",
      "raw": "Users can scroll through a feed of gameplay moments shared by the Roblox community and react to the clips using emojis, and they can jump into an experience right from a video.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2141ca0516074b1169f7531b3a03deabdd76ee76",
      "title": "Trump sends 10 stealth fighter planes to Puerto Rico amid war on Caribbean drug cartels",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/trump-fighter-planes-puerto-rico-venezuela-drug-cartel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T17:11:58.000Z",
      "summary_90w": "",
      "raw": "Move comes after US accuses Venezuela of buzzing warship and a deadly US missile strike in Caribbean Sea\nDonald Trump is sending 10 F-35 fighter jets to Puerto Rico to bolster US military operations against drug cartels in the Caribbean region, it was reported on Friday.\nIf follows a deadly US missile strike on Tuesday on a boat in the Caribbean Sea that the Trump administration insisted was carrying 11 Venezuelan drug traffickers, and comments by the secretary of state, Marco Rubio, on Wednesday that such attacks “will happen again”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5dbb34225979e86522cc6f2fb9796eb6e48b92aa",
      "title": "The Global Story: The deal that broke Ukraine's trust",
      "url": "https://www.bbc.co.uk/programmes/w3ct714l?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "An exploration of the 1994 Budapest Memorandum, intended to enshrine Ukraine's security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}