{
  "version": "1757958710923",
  "generatedAt": "2025-09-15T17:51:50.923Z",
  "items": [
    {
      "id": "e5615e8c30214ca08fbe7062eb02f463f90e82be",
      "title": "Apple’s iOS 26 with the new Liquid Glass design is now available to everyone",
      "url": "https://techcrunch.com/2025/09/15/apples-ios-26-with-the-new-liquid-glass-design-is-now-available-to-everyone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:45:19.000Z",
      "summary_90w": "",
      "raw": "Apple's iOS 26 update with Liquid Glass redesign is available to all eligible iPhone users starting today.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f78b54253d79365a7019d02bad9f7d7378af5cce",
      "title": "Indian billionaire family's private zoo cleared of 'foul play'",
      "url": "https://www.bbc.com/news/articles/c147kzpy113o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T17:40:45.000Z",
      "summary_90w": "",
      "raw": "India's top court had formed a special team to investigate allegations that animals were mistreated at Vantara.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48341e22cf197b930c55378266f1044034e5ce18",
      "title": "Who is Fed nominee Stephen Miran, and why is he so controversial?",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542126/stephen-miran-fed-reserve-board",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T17:39:32.000Z",
      "summary_90w": "",
      "raw": "Stephen Miran, who has served in both Trump administrations, said he will not resign from the White House if confirmed to the Federal Reserve Board, further stoking concerns about its independence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bde3edff6aa061eaa1cfbd72718f18d4fa52fe3",
      "title": "Microsoft’s Office apps now have free Copilot Chat features",
      "url": "https://www.theverge.com/news/778272/microsoft-office-free-copilot-ai-features-copilot-chat",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:32:55.000Z",
      "summary_90w": "",
      "raw": "Microsoft is adding the free Microsoft 365 Copilot Chat and agents to Office apps for all Microsoft 365 business users today. Word, Excel, PowerPoint, Outlook, and OneNote are all being updated with a Copilot Chat sidebar that will help draft documents, analyze spreadsheets, and more without needing an additional Microsoft 365 Copilot license.\n“Copilot Chat is secure AI chat grounded in the web—and now, it’s available in the Microsoft 365 apps,” explains Seth Patton, general Manager of Microsoft 365 Copilot product marketing. “It’s content aware, meaning it quickly understands what you’re working on, tailoring answers to the file you have open. And it’s included at no additional cost for Microsoft 365 users.”\nWhile this free version of Copilot will rewrite documents, provide summaries, and help create slides in PowerPoint, the $30 per month, per user Microsoft 365 Copilot license will still have the best integration in Office apps. The Microsoft 365 Copilot license is also not limited to a single document, and can reason over entire work data.\n“Users with a Microsoft 365 Copilot license get priority access to features like file upload and image generation, along with the latest technology like GPT-5, including faster response times and more consistent availability—even during peak usage periods,“ explains Patton.\nMicrosoft previously bundled its AI-powered Copilot features into Office apps for consumer Microsoft 365 plans earlier this year, but it raised the prices of subscriptions at the same time. Microsoft isn’t doing any price adjustments for businesses with Copilot Chat being added to Office apps. Microsoft is also getting ready to bundle its sales, service, and finance Copilots into the Microsoft 365 Copilot subscription in October, reducing the price for some businesses that rely on Microsoft’s latest AI tools.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a750454b4f8fe9d2b245e0ab6f117c319a4be65",
      "title": "PM says he would never have appointed Mandelson had he known full Epstein links",
      "url": "https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:29:26.000Z",
      "summary_90w": "",
      "raw": "The PM says a due diligence process was gone through before Lord Mandelson was appointed US ambassador.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64818ba30a0c60188e0771285de8c2e100c0665f",
      "title": "China accuses Nvidia of violating anti-monopoly laws",
      "url": "https://www.bbc.com/news/articles/cj9zedgkm21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T17:28:53.000Z",
      "summary_90w": "",
      "raw": "The accusation comes as the US and China hold talks to de-escalate the trade war between the two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6751768c571aea67186d4dbd011b194f90236c39",
      "title": "Starmer aide resigns after explicit texts about Abbott surface",
      "url": "https://www.bbc.com/news/articles/ckgy79yr74do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:25:54.000Z",
      "summary_90w": "",
      "raw": "Downing Street said the messages about the veteran MP were \"appalling and unacceptable\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be3758589548d1dc21f863630c31eac67575d8c7",
      "title": "Telling stories of gun violence deaths almost cost this reporter his life",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539315/trymaine-lee-a-thousand-ways-to-die",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T17:22:34.000Z",
      "summary_90w": "",
      "raw": "Trymaine Lee spent years reporting on the deaths of men who look just like him. His new memoir, A Thousand Ways to Die, chronicles the impact of gun violence in Black communities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cab26b92019fd670400a1222a05ca0b2c78a4077",
      "title": "Inside the Shift at Disrupt: Building Community and Scaling in the AI Era",
      "url": "https://techcrunch.com/2025/09/15/on-stage-at-techcrunch-disrupt-2025-how-ai-is-forcing-late-stage-startups-to-rewire-gtm-or-be-left-behind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:15:00.000Z",
      "summary_90w": "",
      "raw": "Nirav Tolia (Nextdoor), Jane Alexander (CapitalG), and Vanessa Larco (Premise, NEA) join TechCrunch Disrupt 2025 (Oct 27–29, SF) to share strategies for building resilient companies and scaling in the AI era.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b5a514c60d00853c8804a1745b1fec6b4554b3af",
      "title": "The best phone to buy right now",
      "url": "https://www.theverge.com/22163811/best-phone",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:14:53.000Z",
      "summary_90w": "",
      "raw": "The best screens for screen time. | Image: Cath Virginia / The Verge\t\n\nHaven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable in my recommendations below.\nBut even if you’re looking for something a little more extra, you’ve got some great options. They’re going to be pretty iterative compared to whatever you’re using now — we’re in more of a software era than a hardware innovation cycle these days — but you can find a delightful new device. We finally have a folding phone that feels like the right size and shape, flip phones offer a lot more than just nostalgia, and you can still buy a phone with no fewer than four cameras on the back. Not bad for a boring season of phone hardware.\nA lot of people in the US get their phones through carrier deals, and no judgment here if that’s the route you take — it’s how I bought mine. Just be sure you know what you’re getting into and how many years you’ll need to stay on that Super 5G Everything Unlimited Plus plan to keep the monthly device reimbursements coming.\nIf you’re looking to spend a little less and still get the best smartphone on a budget, you can find something really good for under $600. For those recommendations, check out our guide to budget smartphones.\n\n\n\n\n\nThe best iPhone for most people\nThe best Android phone for most people\nThe best high-end Android phone\nThe best phone for around $500\nThe best high-end iPhone\nThe best flip phone\nThe best folding phone\nOther phones we tested\nWhat’s coming next\n\nThe best iPhone for most people\nApple iPhone 16\n\n\nScore: 8\n\nProsCons\n\n\nReliable camera with versatile photographic styles\nHandy new Action Button\nMore RAM and a current-gen chipset\n\nStandard refresh rate screen\nCamera Control is a mixed bag\n\n\n\nWhere to Buy:\n\n $699 at Apple\n $729.99 at Best Buy\n\nScreen: 6.1-inch, 2556 x 1179 OLED, 60Hz refresh rate / Processor: A18 Cameras: 48-megapixel f/1.6 main with sensor-shift IS; 12-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W wireless MagSafe, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nFrom a hardware perspective, the iPhone 16 (or the 16 Plus) is an easy upgrade choice. If you’re switching from an iPhone 13, 12, or even older, those four or five years of incremental performance improvements add up. But there’s something entirely new this time around — well, two things: the Action Button and the Camera Control button.\nThe customizable Action Button, which replaces the mute switch on the left edge of the phone, is a hand-me-down from the 15 Pro series. You can set it to open a particular app, turn on the flashlight, or almost anything else you might want at the press of a button. On the other side of the phone is the Camera Control, which you can use to launch the camera app. With the camera open, it acts as a shutter button with a full press, and a light press brings up other exposure options you can adjust. Even if you only ever use it to launch the camera, it’s pretty handy, and it frees up the Action Button.\nThe iPhone 16 and its larger 16 Plus sibling use Apple’s A18 chipset, which is in the same family as the 16 Pro’s processor. That bodes well for the phones staying on the same software upgrade cycle. They both received Apple Intelligence last fall, which included AI-powered writing tools and notification summaries in its earliest iteration, and eventually grew to support ChatGPT and a new Visual Intelligence feature. But despite the similarities, the regular 16 models lag behind the Pros in two important departments: the screen and the camera.\nThe Pros come with dedicated 5x lenses and updated main cameras that do a little better in low light. And you’ll only get a ProMotion display on the Pro models; the regular 16 features a slower 60Hz screen. Basically every other high-end phone on the market offers a 120Hz display, so that’s a disappointment given the price. If those two drawbacks don’t bother you — and most people probably won’t mind them — then the iPhone 16 makes for a great upgrade.\nRead our full iPhone 16 review.\nThe best Android phone for most people\nGoogle Pixel 10 (128GB)\nGoogle’s Pixel 10 has a 6.3-inch OLED display, Google Tensor G5 processor, 12GB of RAM, support for Pixelsnap wireless charging, and a triple-lens camera system that includes a new 5x telephoto.\n\n\nScore: 8\n\nProsCons\n\n\nQi2 wireless charging with magnets is great\nAI is actually kind of useful, finally\nTelephoto camera is a nice addition\n\nMain and ultrawide cameras aren’t quite as good as the Pro\nBattery life is just okay\n\n\n\nWhere to Buy:\n\n $799 at Amazon\n $799 at Best Buy\n $799 at Google\n\nScreen: 6.3-inch, 1080p 120Hz OLED / Processor: Tensor G5 / Cameras: 48-megapixel f/1.7 main with OIS; 13-megapixel f/2.2 ultrawide; 10.8-megapixel 5x telephoto with OIS; 10.5-megapixel selfie / Battery: 4,970mAh / Charging: 30W wired, 15W wireless / Weather resistance: IP68\nThe Pixel 10 is an easygoing Android phone that offers some handy upgrades over its predecessor. The addition of Qi2 with built-in magnets is a delight, making it easier than ever to quickly charge up without plugging in. AI features like Magic Cue, which can proactively suggest information based on what you’re doing on your phone, are finally showing promise. And for the first time ever, the base model features a dedicated telephoto lens.\nBut, alas, there’s a catch: The Pixel 10 no longer features the same main and ultrawide camera hardware as the Pro. You’re essentially getting the two rear cameras found in the midrange Pixel 9A, plus a telephoto lens. Still, as a whole, the device’s triple camera system produces images that are totally fine. Beyond the cameras, the Pixel 10 features the same Tensor G5 chipset that’s found in the Pro phones — handy for those aforementioned AI features.\nOverall, the Pixel 10 mostly improves upon what made last year’s Pixel 9 such a solid release. We’re not thrilled with the downgraded camera, but the addition of Qi2 and a telephoto lens helps to soften the blow. If you can live with the camera trade-offs, the Pixel 10 is still a smart pick for anyone who wants a flagship experience at a more approachable price.\nRead our full Pixel 10 review.\nThe best high-end Android phone\nSamsung Galaxy S25 Ultra\n\n\nScore: 8\n\nProsCons\n\n\nExcellent screen\nImproved ultrawide camera\nRounded corners are comfier\n\nExpensive\nBulky\nAI is (still) hit or miss\n\n\n\nWhere to Buy:\n\n $1299.99 $1048 at Amazon (256GB)\n $1299.99 $1049.99 at Best Buy (256GB)\n $1299.99 at Samsung(256GB)\n\nScreen: 6.9-inch, 1440p, 120Hz OLED / Processor: Qualcomm Snapdragon 8 Elite / Cameras: 200-megapixel main with OIS; 50-megapixel 5x telephoto with OIS; 10-megapixel 3x telephoto with OIS; 50-megapixel ultrawide; 12-megapixel selfie / Battery: 5,000mAh / Charging: 45W wired, 15W wireless, Qi2 ready / Weather resistance: IP68\nSamsung’s “Ultra” S-series phone is still your best bet for a maximalist Android phone, even if ultra doesn’t quite mean what it once did. You still get four rear cameras — including a 3x and 5x telephoto — a massive screen, and a built-in S Pen stylus. The battery goes all day, the processor is top-notch, and there are AI features aplenty if you’re into that sort of thing. There’s just no other phone quite like it. \nThis year, Samsung removed the Bluetooth features from the stylus. That stings a little, especially considering that the company swapped a 10x zoom for the shorter 5x camera the year before. It still amounts to a great phone, but it’s one of the priciest slab-style phones you can buy, and Samsung seems to be cutting features without adding back any extra value. It’s still “ultra” alright, but it doesn’t feel quite as special as it used to.\nRead my full Galaxy S25 Ultra review.\nThe best phone for around $500\nGoogle Pixel 9A\n\n\nScore: 8\n\nProsCons\n\n\nRobust IP68 rating\nSeven years of software updates\nBrighter, bigger screen\n\nMissing a couple of AI features\nAI is occasionally handy, usually weird\n\n\n\nWhere to Buy:\n\n $499 at Amazon\n $499 at Best Buy\n $499.99 at Google\n\nScreen: 6.3-inch, 1080p OLED, 120Hz / Processor: Tensor G4 / Cameras: 48-megapixel f/1.7 with OIS, 13-megapixel ultrawide, 13-megapixel selfie / Battery: 5,100mAh / Charging: 23W wired, 7.5W wireless / Weather-resistance rating: IP68\nEvery year, we’re pleasantly surprised by how much Google packs into its midrange Pixel A-series devices. Last year, it was the Pixel 8A, and this year, it’s the even better Pixel 9A. For $500, the 9A offers Google’s fourth-gen custom Tensor G4 chipset (the very same chip that’s in the pricier Pixel 9 and Pixel 9 Pro), a brighter and larger 6.3-inch OLED display, and an IP68 rating for improved durability. Plus, you get the benefit of seven years of software updates and security support. What you end up with is a device that delivers fantastic value, especially compared to other inexpensive devices.\nThe Pixel 9A offers a handful of other features that put it above the pack, like a 120Hz refresh rate, wireless charging, and the largest battery across the Pixel line. It does fall short in a few areas, though — the camera’s low light performance and Portrait mode could be better. That said, the 9A’s camera is still great for everyday snaps, and for the price, the device is an easy recommendation as the best in this category.\nRead my full Pixel 9A review.\nThe best high-end iPhone\nApple iPhone 16 Pro\n\n\nScore: 8\n\nProsCons\n\n\nNew tone control in camera lets you dial back HDR processing\nWho doesn’t love a physical shutter button?\nYour video director friends will spend hours gleefully taking 4K120 video portraits of people at street festivals\n\nCamera Control button is a little fiddly\nDefault photo processing is more aggressive than ever\nThe most incremental of incremental upgrades over the iPhone 15 Pro\n\n\n\nWhere to Buy:\n\n $999 $745.06 at Amazon (Renewed)\n $999.99 $899.99 at Best Buy\n\nScreen: 6.3-inch, 2622 x 1206 OLED, 120Hz refresh rate / Processor: A18 Pro Cameras: 48-megapixel f/1.8 with sensor-shift IS; 12-megapixel 5x telephoto with OIS; 48-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W MagSafe wireless, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nLike all mainline iPhone 16 models, the 16 Pro gained the new Camera Control button, but it got another important update, too: a 5x telephoto lens. In the 15 series, that longer telephoto lens was reserved for the bigger Pro Max model. This time around, it’s on the smaller Pro, too, making it a great option for someone who wants to upgrade without upsizing their phone.\nLike the Pro Max, the iPhone 16 Pro uses an A18 Pro chipset designed to support Apple Intelligence, which started rolling out in the fall of 2024. The first update included things like notification summaries and the new glowing-border Siri UI, which Apple centered its launch event on. Subsequent updates brought ChatGPT integration and Visual Intelligence. But don’t expect anything radical — at least at first.\nOutside of AI, the 16 Pro is a fairly iterative update. The new Camera Control makes it easier to launch the camera and get right to taking photos, and it also frees up the Action Button if you were using it as a camera shortcut. The screen is a little bigger at 6.3 inches compared to 6.1 inches, even though the phone is basically the same size. You can record 4K video at 120fps now. And the new Photographic Styles, which are available on all iPhone 16 models, let you take more control over your photos than ever.\nThere’s nothing here that someone with an iPhone 15 Pro should upgrade for, but it’s an all-around solid device that will please Apple devotees, especially those who prefer a phone that isn’t too big.\nRead our full iPhone 16 Pro review.\nThe best flip phone\nSamsung Galaxy Z Flip 7\n\n\nScore: 8\n\nProsCons\n\n\nSamsung finally adopted the big cover screen\nAll-day battery\nReliable camera\n\nMore susceptible to dust than your average phone\nStill too hard to run full apps on the cover screen\n\n\n\nWhere to Buy:\n\n $1099.99 $949.99 at Amazon (256GB)\n $1099.99 $949.99 at Best Buy (256GB)\n $1099 at Samsung (256GB)\n\nScreen: 6.9-inch, 1080p, 120Hz OLED inner screen; 4.1-inch, 948p, OLED cover screen / Processor: Samsung Exynos 2500 / Cameras: 50-megapixel f/1.8 main with OIS; 12-megapixel ultrawide; 10-megapixel selfie (inner screen) / Battery: 4,300mAh / Charging: 25W wired, 15W wireless, 4.5W reverse wireless / Weather resistance: IP48\nSamsung finally got the memo with the Galaxy Z Flip 7’s cover screen. The company’s latest flip phone ditches the file folder-shaped look of its predecessor for a 4.1-inch, edge-to-edge display that wraps around the cameras. With more outer screen real estate, it’s easier to respond to texts and punch in a coffee order without flipping open the phone and getting sucked into a digital rabbit hole.\nThe Flip 7 still makes you jump through a few hoops if you want to run full apps on the cover screen, but once you’ve wrangled the settings, it unlocks a lot of convenience for everyday tasks. That said, the cover screen isn’t perfect for every app. Sometimes a button hides behind the camera cutout, forcing you to change the app’s window size. But most tasks are a breeze, and opening the phone is always an option.\nUnder the hood, Samsung swapped out Qualcomm’s processor for an in-house Exynos chip, though we didn’t notice any hits to performance. The new 4,300mAh battery will last you all day with moderate use, but heavy gaming and hotspot use will significantly impact battery life. The camera system, meanwhile, remains unchanged from the Z Flip 6, which isn’t a bad thing. You still get a 50-megapixel main shooter and all the fun flex mode tricks, which are great for capturing candids.\nUnfortunately, the Flip 7 still offers no protection against fine particles like dust or sand, which might work their way into the hinge and cause damage. This raises concerns about how the device hold up over time. But Samsung’s beefed-up warranty and repair program can provide extra peace of mind. Plus, with seven years of OS and security updates, the Flip 7 should prove reliable until you decide to upgrade.\nRead our full Galaxy Z Flip 7 review.\nThe best folding phone\nSamsung Galaxy Z Fold 7\n\n\nScore: 8\n\nProsCons\n\n\nRidiculously slim and light for a foldable\nAll-day battery with moderate use\nOuter screen finally feels normal\n\nIt’s $2,000\nDurability still a concern\nCamera bump makes it wobble on a table\n\n\n\nWhere to Buy:\n\n $1999.99 at Amazon(256GB)\n $1999.99 at Best Buy (256GB)\n $2119.99 at Samsung (512GB)\n\nScreen: 8-inch, 1968p, 120Hz OLED inner screen; 6.5-inch, 1080p, 120Hz OLED cover screen / Processor: Qualcomm Snapdragon 8 Elite / Cameras: 200-megapixel f/1.7 main with OIS; 10-megapixel 3x telephoto with OIS; 12-megapixel ultrawide; 10-megapixel selfie (cover screen); 10-megapixel inner selfie camera / Battery: 4,400mAh / Charging: 25W wired, 15W wireless, 4.5W reverse wireless / Weather resistance: IP48\nOne of our biggest criticisms of the Z Fold series has been that it feels too narrow and cramped when closed. The Galaxy Z Fold 7 fixes that. With a more familiar 21:9 aspect ratio, it no longer feels like you’re holding a TV remote control. The result is a book-style foldable that mostly feels like a regular slab-style phone. It’s nearly as slim, too, so it doesn’t feel as bulky in your pocket.\nThe Z Fold 7’s reworked proportions make it easier to wield when replying to texts and Slack messages. When you start craving more screen real estate, the device opens to reveal a spacious 8-inch inner display, giving you an entirely different experience that’s perfect for managing multiple tabs in Chrome and playing games like Diablo Immortal. It’s great for multitasking — being able to track your Uber driver’s arrival time on one half of the screen while replying to emails on the other half is incredibly useful.\nThe bad news? The Z Fold 7 costs $1,999, making the barrier of entry very high. It also has one of the largest camera bumps we’ve encountered in a phone and doesn’t carry a formal dust resistance rating, meaning even a small amount of dust has the potential to cause significant damage to the hinge. Despite these shortcomings, however, Samsung has created a luxurious foldable that’s thinner, lighter, and incredibly nice to use.\nRead our full Galaxy Z Fold 7 review.\nOther phones we tested\nThe Samsung Galaxy S25 is a very good device, and it’s basically the last small-ish Android phone you can buy in the US. I find the software to be fussier and more cluttered than the Pixel 9’s, so it’s not my overall pick, but it’s a reliable device — and your best bet for a phone that isn’t gigantic. Read our review.\nThe iPhone 16E is a great phone that makes a lot of interesting trade-offs. Apple’s latest entry-level phone starts at $599 and comes with the company’s latest A18 processor, USB-C and wireless charging, a 60Hz OLED display, and the customizable Action Button found on Apple’s more premium handsets. The 6.1-inch phone doesn’t have MagSafe support or a Camera Control button, though, and it’s limited to a single 48-megapixel Fusion camera (sorry, ultrawide stans). That makes it hard for us to recommend over the standard iPhone 16, even if it does start at $200 less. Read our review.\nThe Motorola Razr Ultra 2025 is an excellent foldable that exemplifies what makes the brand’s phones so unique. It’s one of the best-looking phones you can buy, thanks to its gold-bronze chassis and wooden back. Plus, it features a spacious cover screen that’s handy for quickly performing tasks without opening the device. However, as much as we enjoy the Razr Ultra, Motorola’s promise of three OS upgrades and four years of security updates is on the shorter side. Read our review.\nThe Samsung Galaxy S25 Edge is an ultra-thin alternative to the big, chunky flagships we’ve seen over the past year. At just 5.8mm thick, it packs a 6.7-inch 1440p OLED display with a refresh rate of up to 120Hz, a 3,900mAh battery, and a Snapdragon 8 Elite processor. Despite its thinner frame, battery life is surprisingly acceptable, though it won’t last as long as other flagship devices. The S25 Edge also lacks a telephoto camera, so it’s not the best phone for portrait photos. Read our review.\nThe OnePlus 13R stands out in two key ways: battery life and screen. The 6.78-inch OLED display has a variable refresh rate of up to 120Hz and a resolution of 1264 x 2780, both of which are great specs for a midrange phone. Meanwhile, its 6,000mAh battery can last for a long time — most people are likely to squeeze out two days before the device needs to be recharged. That said, the 13R lacks features like wireless charging and more robust water resistance, and OnePlus is only promising four major OS upgrades and six years of security updates, which is fewer than the seven years of OS upgrades on the Google Pixel 9A. Read our review.\nThe Nothing Phone 3 is the brand’s “first true flagship phone,” with a 6.67-inch OLED screen, a Snapdragon 8S Gen 4 chip, and a 5,150mAh battery. It also features four cameras — three on the back and one on the front — all of which are 50 megapixels. Additionally, the Phone 3 ditches Nothing’s signature light strips for a small dot-matrix LED display on the back, which can display images or emoji tied to specific apps and contacts. Read our review.\nThe Pixel 9 Pro Fold is an impressive sophomore effort from Google. Like the Z Fold 7, the outer screen matches the dimensions of a regular slab-style phone, while the inner screen is great for multitasking. The whole package is also light enough that it sometimes doesn’t feel like you’re holding a foldable, though it does suffer from a slightly downgraded camera system compared to other Pixel 9 devices. There’s also no formal dust resistance, so long-term durability remains a concern. Read our review.\nThe Pixel 10 Pro is Google’s most refined flagship yet, blending a premium design with meaningful hardware upgrades like the Tensor G5 chip and Pixelsnap wireless charging. Magic Cue delivers genuinely useful on-device AI that can surface helpful info in real-time, while the camera’s portrait mode is much improved over its predecessor. Battery life is just average, though, and some AI features still feel like they’re being shoved into corners of the device where it doesn’t really need to be. Most readers will be better served by the cheaper Pixel 10. Read our review.\nWhat’s coming next\nGoogle’s Pixel 10 Pro Fold is the first foldable to earn an IP68 rating, meaning it offers robust water and dust resistance. The device also features Google’s new Tensor G5 chipset, improved inner and outer displays, and Pixelsnap wireless charging. We got a brief hands on with the 10 Pro Fold following its announcement, though we’re not ready to share a final verdict until we’ve performed more extensive real world testing. For now, you can preorder the base 256GB model at Amazon, Best Buy, or directly from Google starting at $1,799, with a release to come on Thursday, October 9th.\nAt its fall hardware keynote, Apple announced the iPhone 17, iPhone 17 Pro, iPhone 17 Pro Max, and the slimmed down iPhone Air. The Air is Apple’s thinnest device yet at 5.6mm, while the entry-level iPhone 17 got an upgraded 6.3-inch ProMotion display, making it a really great deal. Meanwhile, the Pro models boast a powerful A19 Pro chip and a three-camera system — all of which are 48-megapixels. The 17 Pro Max also features the biggest battery ever in an iPhone, promising up to 39 hours of video playback. The latest iPhones are available to preorder now, with a launch set for Friday, September 19th.\nUpdate, September 15th: Adjusted pricing / availability, added the Google Pixel 10 as the “best Android phone for most people,” and added insights for the Pixel 10 Pro, Pixel 10 Pro Fold, and the 2025 iPhone lineup. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a72592586edf0ffa2cad6101499ce902818ad0a5",
      "title": "I&#8217;ve been using macOS Tahoe 26 since June and here are the eight best things about it",
      "url": "https://www.theverge.com/apple-mac-os/777936/apple-macos-tahoe-26-final-release-testing-impressions-liquid-glass",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:08:41.000Z",
      "summary_90w": "",
      "raw": "Liquid Glass may polarize, but it’s here.\t\n\nApple's new version of macOS, Tahoe 26, launches today for all compatible Macs. I've already shared many feelings about Liquid Glass in my look at the developer and public betas, and my opinion on the new, polarizing UI remains lukewarm. But after using Tahoe through the beta periods to full release, I can confidently say that there are some decent improvements to macOS worth diving further into.\nThe updated Spotlight: power user lite\nCommand + Spacebar was always a helpful shortcut for calling up Spotlight and launching an app with just the keyboard. Now, you can do much more with it, and if you train up the muscle memory it  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef2bcfc1594227b7c24ad388047337f02ea90f92",
      "title": "The unbearable sameness of Liquid Glass",
      "url": "https://www.theverge.com/apple/778197/liquid-glass-iphone-watch-ipad-mac",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:07:08.000Z",
      "summary_90w": "",
      "raw": "The Vision Pro is where Liquid Glass truly shines.\t\n\nLiquid Glass is a neat party trick. The new design system, which was built for nearly all of Apple's products and is rolling out this week, is built on the idea that interfaces should be three-dimensional: in the world of Liquid Glass, buttons and menus sit on top of whatever you're doing or looking at, changing color and refracting digital light like they're physical objects. It's meant to feel like glass does in the real world. It's visually very impressive, and it all kind of works! You install it, you spend a minute fast-scrolling to see the buttons change, it's very well done.\nI've been using Liquid Glass, in Apple's various betas, acr …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a67c3a74ac1413b68cbb92b95d84c5165ef0e55e",
      "title": "Apple releases macOS Tahoe 26 with more powerful Spotlight search and its own Phone app",
      "url": "https://www.theverge.com/news/777521/apple-macos-tahoe-26-now-available-download-update",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:07:06.000Z",
      "summary_90w": "",
      "raw": "macOS Tahoe 26 adds new ways to theme and personalize your Mac. | Image: Apple\t\n\nmacOS Tahoe 26 is now available to everyone using compatible MacBooks and Mac desktops. It was first announced last June at WWDC 25 and made available for testing through developer and public betas released over the past three months. This will be the last major macOS update for older Intel-based Macs – specifically those featuring Apple’s T2 Security Chip.\nThe most notable update with Tahoe will also be its most obvious. It includes a major UI overhaul based on Apple’s new Liquid Glass design language that will feature an extensive use of transparent effects on windows, buttons, and notifications. Tahoe’s menu bar will also be completely transparent, making displays seem a bit larger.\nmacOS’ Spotlight search tool and launcher will be more useful with Tahoe, ranking search results intelligently based on relevance and allowing users to perform specific actions with apps like sending an email or creating a note without having to actually open those specific apps. If you like to keep your Mac immaculately organized you can now change the colors of folders or add an emoji to make them stand out.\nA new Phone app will mirror the functionality of the one on iOS and can relay calls from your iPhone through your computer. It will include access to recents and voicemails, as well as new iOS features like Call Screening that can answer calls from unknown numbers for you and Hold Assist that can stay on the line until a real person responds. Leveraging Apple Intelligence, Live Translation can translate text, audio during phone calls or FaceTime calls, and even chats in Messages.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7f7abc6dc1121f5f2c93932249d7e1d945a967f0",
      "title": "watchOS 26 is now available with a new wrist flick gesture and Notes on your wrist",
      "url": "https://www.theverge.com/news/777319/apple-watchos-26-available-update-download",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:06:29.000Z",
      "summary_90w": "",
      "raw": "watchOS 26 brings a glossier user interface to the Apple Watch. | Image: Apple\t\n\nThe latest iteration of Apple’s wearable OS will look a bit different. For those who have been holding off on testing the developer and public betas, Apple has finally released watchOS 26 to the masses and the update is available for several different iterations of the Apple Watch including the Series 6 to the new Series 11, the second and third-generation Apple Watch SE, and all of the extra-durable Ultra models.\nOne of the biggest changes coming to all of Apple’s operating systems is the company’s new Liquid Glass design language that updates windows, notifications, app icons, and other UI elements with a transparent glassy appearance revealing what’s beneath them. For the Apple Watch, the Liquid Glass update isn’t quite as dramatic a change as it is for the iPhone and iOS 26. You’ll mostly notice a new glossy appearance to icons and buttons in the Smart Stack, Control Center, and apps, and with watch faces that mix text and photos.\nA new wrist flick gesture (that looks easier than the previous finger pinch double tap gesture) lets you silence timers, mute calls, and dismiss notifications by rotating your wrist away from you. With watchOS 26 the Apple Watch can also automatically adjust the volume of calls, notifications, and Siri based on ambient noise, making them quieter when the din dies down. And for the first time, Apple’s Notes app will be available on the Apple Watch, including the ability to create new notes or asking Siri to do that for you.\nHypertension notifications, announced alongside the Apple Watch Series 11 and Ultra 3 last week, are also coming with watchOS 26. The health feature uses the Apple Watch’s existing optical sensor to collect data about how blood vessels respond to heart beats over a 30 day period to detect signs of high blood pressure and notify users. It will also be available on older Apple Watch models with today’s update including the Series 9 and onward and the Ultra 2 and 3.\nNew Apple Watch health features being introduced today include a new sleep score that evaluates the quality of your slumber based on your sleep duration, interruptions throughout the night, and how consistent your bedtime is. It joins a new Workout Buddy, powered by Apple Intelligence, that uses your fitness history to provide motivational messages and insights during a workout such as pep talks letting you know how far you are from your activity goal.\nOther watchOS 26 upgrades include configurable widgets in the Smart Stack so you can prioritize ones you access frequently, automatic message translations using Apple Intelligence, and new watch faces. Supported Apple Watch models will also get access to the iPhone’s Hold Assist and Call Screening features that can ask people why they’re calling or remain on hold on your behalf and send a notification once a live agent is available.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "932d5b2c98d8fdf3af7595fb4a9fe0dc8ebf3d4d",
      "title": "iOS 26 with Apple&#8217;s Liquid Glass redesign is out now",
      "url": "https://www.theverge.com/news/777466/apple-ios-26-launch-iphone-liquid-glass-update",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:05:30.000Z",
      "summary_90w": "",
      "raw": "Apple is rolling out iOS 26 with a bunch of new features for the iPhone. The biggest change you’ll see upon installing the update is Apple’s Liquid Glass redesign, introducing translucent buttons, sliders, tabs, and other navigational elements across the iPhone’s interface.\niOS 26 also includes Live Translation, an AI-powered feature that automatically translates texts in Messages, displays live captions on FaceTime, and provides spoken translations during phone calls or through your AirPods. You’ll also find a handy new feature that automatically answers calls from unknown numbers and allows you to screen text messages from people you might not know.\nSome other small but notable upgrades coming with iOS 26 include typing indicators and polls in group chats, as well as the ability to set a background image for different conversations. Additionally, Apple will officially launch its Games app on the iPhone, serving as a central hub for its games and gaming features.\nApple is bringing its Liquid Glass design language to iPadOS 26, too, which rolls out today with new windowing features that should make the iPad better for multitasking by allowing you to resize and place apps anywhere on your screen. iPadOS 26 adds a Files and Preview app as well.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "36ce4c998cc03a96b350913c6b67551c6ad45549",
      "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T17:04:38.000Z",
      "summary_90w": "",
      "raw": "This live blog is closed.\n\nRubio says Netanyahu has full support of US\n\nThat brings the press conference to a close, as Netanyahu takes a moment to acknowledge both his and Rubio’s staff who are sat in the front row.\nThe main takeaways from the event, which lasted just over half an hour, are that the US views international efforts to recognise the Palestinian state as a hindrance to peace efforts and that Netanyahu refuses to rule out future strikes on Hamas leaders – wherever they are.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fcfdc8182a52a69744a874c481e7899892c841ab",
      "title": "OpenAI upgrades Codex with a new version of GPT-5",
      "url": "https://techcrunch.com/2025/09/15/openai-upgrades-codex-with-a-new-version-of-gpt-5/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:03:40.000Z",
      "summary_90w": "",
      "raw": "OpenAI's AI coding agent, Codex, can now spend anywhere from a few seconds to several hours on a task, thanks to a new, customized version of GPT-5.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5888042c3b88c2cc200111948f2d1a3cd7b73aa3",
      "title": "Hackers steal private data of Gucci, Balenciaga and McQueen customers",
      "url": "https://www.theguardian.com/business/2025/sep/15/hackers-data-gucci-balenciaga-alexander-mcqueen-kering",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T17:02:32.000Z",
      "summary_90w": "",
      "raw": "Cybercriminals steal details of potentially millions of people in attack on labels’ parent company Kering\nHackers have stolen data from customers of the luxury fashion group Kering, whose brands include Gucci, Balenciaga and Alexander McQueen.\nCyber-attackers have stolen data of potentially millions of customers, including the names, phone numbers and email addresses of customers of the fashion group, it has emerged.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "382f9621accda930c69dae33f21b991d12f2be67",
      "title": "Rubio says Netanyahu has full support of US over plans to destroy Hamas",
      "url": "https://www.theguardian.com/world/2025/sep/15/rubio-says-netanyahu-has-full-support-of-us-over-plans-to-destroy-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T17:02:32.000Z",
      "summary_90w": "",
      "raw": "US secretary of state, who is visiting Jerusalem, warns of ‘Israeli counter reaction’ if allies recognise Palestine\nThe US secretary of state, Marco Rubio, has put the Trump administration’s full support behind Benjamin Netanyahu in a visit to Jerusalem, saying Washington’s priorities were the liberation of Israeli hostages and the destruction of Hamas.\nIn public remarks standing alongside Netanyahu, Rubio did not mention the possibility of a ceasefire, and did not repeat his earlier criticism of Israel for carrying out an airstrike last week aimed at Hamas leaders in Doha, the capital of another close US ally, Qatar.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da88483c406faf61da49a6d5413f720ffde0885d",
      "title": "UK fighters to fly air defence missions over Poland – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:57:55.000Z",
      "summary_90w": "",
      "raw": "This live blog is closed.\n\nRussia-Belarus military exercise stirs up unease in Europe’s leaders\n\nEU trade spokesperson Olof Gill also defended the EU’s sanctions from criticism that they are not going far enough.\nHe said:\n“Our assessment is that the successive sanctions packages we have brought forward, which includes new initiatives plus additional initiatives to make the previous one stronger if that makes sense, our assessment is that those sanctions are working. \nThe economic evidence shows that they are having an impact on the Russian economy, and that is precisely what they intended to do. \n“Phasing out of Russian fossil fuels is something that we have been doing and are doing actively for a number already of years, since the beginning of the war, with a very clear roadmap, with now even a clear legislative proposal in order to phase out the remaining gas still entering the EU.\n… This is something on which the EU has been very actively and we have a very, very clear roadmap, and how to go about it.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77d1a2117eb3304ee265211225eb3cca3ac5e5ff",
      "title": "China says Nvidia violated antitrust regulations",
      "url": "https://techcrunch.com/2025/09/15/china-says-nvidia-violated-antitrust-regulations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:44:02.000Z",
      "summary_90w": "",
      "raw": "China is investigating Nvidia's 2020 acquisition of Mellanox Technologies as trade tensions between the U.S. and China heat up.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b405ee8f33a223d2d4399337a5ad1fe5dede8a4",
      "title": "First objects retrieved from wreck of Titanic’s sister ship in Greece",
      "url": "https://www.theguardian.com/world/2025/sep/15/objects-retrieved-hmhs-britannic-wreck-titanic-sister-ship-greece",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:33:37.000Z",
      "summary_90w": "",
      "raw": "Transatlantic passenger liner HMHS Britannic sank in 1916 after striking German mine off island of Kea\nDeep-sea divers have retrieved a first batch of objects from the Titanic’s sister ship, which sank off the coast of Greece in 1916, including a signal lamp, ceramic tiles and a pair of binoculars.\nThe Greek culture ministry said on Monday that a research programme had involved “the retrieval of objects from the wreck site [of the HMHS Britannic] for the first time, from depths exceeding 120 metres [390ft].”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9d923e49e7d54391f6b437a4b3d538ebfa481390",
      "title": "Constance Marten and Mark Gordon jailed for 14 years over baby's death",
      "url": "https://www.bbc.com/news/articles/c931yq8lz19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:31:04.000Z",
      "summary_90w": "",
      "raw": "The couple were found guilty in July after a lengthy retrial at the Old Bailey.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "845c205ad87dbceeefb8ecdd1cee091f223a3b85",
      "title": "The best deals on 4K TVs",
      "url": "https://www.theverge.com/22371561/best-4k-tv-deals-sale-lg-samsung-sony-tcl",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T16:30:00.000Z",
      "summary_90w": "",
      "raw": "Sony’s A95L is currently on sale at Amazon starting at $1,598 ($1,102 off). | Image: Sony\t\n\nThings are looking bright for those who want to nab a great TV in 2025 at a substantial discount. There’s usually a great deal happening on a mid- or high-end TV from LG, Sony, TCL, Hisense, or Amazon’s own Fire TV brand — even if the biggest discounts remain reserved for Black Friday, Cyber Monday, Amazon Prime Day, and during the lead-up to the Super Bowl.\nRight now, there are a number of discounted 4K TVs to choose from, spanning a wide variety of prices, sizes, and feature sets. Whether you want a secondary screen for the bedroom or a high-end OLED that’s built to provide the ultimate gaming or cinematic experience, we’ve picked out the best TV deals.\n\nThe best 4K TV deals for most people\nThe best 4K TV deals for those on a budget\nThe best deals on high-end 4K TVs\n\nThe best 4K TV deals for most people\nSamsung Q8F \nSamsung’s Q8F is available for an all-time low of $599.99 ($150 off) at Amazon and Best Buy for the 55-inch model, which is a solid value for a QLED 4K TV. Its quantum dot LED panel boasts great contrast (especially in HDR content). The Q8F has a 120Hz panel and four HDMI 2.0 ports. This means you can play in 4K at up to 60Hz with a Nintendo Switch 2, Xbox Series S/X, or a PlayStation 5 Pro, or at a faster 120Hz refresh rate bumped down to 1440p resolution. Samsung is also including two free months of Xbox Game Pass Ultimate with purchase, which will allow you to stream games directly to your TV through the cloud, eliminating the need for a console.\nThe TV is powered by Samsung’s Q4 AI processor, which is used to upscale HD video to 4K when necessary, to optimize the picture in real-time, and make navigating its interface feel snappy. Samsung also touts the Q8F’s audio system, which adjusts the EQ and boost dialogue volume when needed. If you’ve cut the cord with cable, you can watch over 2,700 free channels of TV (over 400 of which are exclusive to Samsung TVs) in addition to streaming services. You can save $302 by jumping up to the 85-inch model, which is on sale for around $1,697.99 at Amazon, Best Buy, and B&H Photo.\nSamsung Q8F\n\nWhere to Buy:\n\n $747.99 $599.99 at Amazon (55-Inch)\n $749.99 $599.99 at Best Buy (55-Inch)\n $2297.99 $1697.99 at Amazon (85-Inch)\n\nIf you’re looking for a 65-inch TV for watching sports, TV shows, movies, or playing video games, Hisense’s U65QF is a great choice, one you can currently purchase at Amazon and Best Buy for around $649.99 ($350 off). The TV features a native 144Hz refresh rate and two HDMI 2.1 ports, both of which can take full advantage of the high-speed display. It also sports a pair of HDMI 2.0 ports — which can carry a 4K signal at up to 60Hz — and a port assortment that makes it a good choice for current-gen consoles, 4K Blu-ray players, and streaming devices. If you connect a gaming PC with an AMD graphics card, you can even take advantage of the TV’s support for AMD FreeSync Premium Pro, which reduces graphical glitches such as screen tearing.\nThe U65QF has an LED screen, which means it can’t match the black levels or per-pixel brightness control you’d get with an OLED display. However, its full array lighting panel offers 300 local dimming zones. The TV can control the brightness of each zone to reduce blooming, which is what happens when the area around a bright object (think a lit torch in a cave) looks unnaturally bright. Additionally, the TV has a maximum brightness of 1,000 nits, so the image it produces should look good even in a room with some light interference. The U65QF also supports Dolby Vision, HLG, and HDR10 Plus for better color reproduction, and it features a Hi-View AI chip that automatically processes the image on screen so that it appears sharper. \nAs for its operating system, Hisense’s U65QF runs on Amazon’s Fire OS and features Amazon Alexa built in. You can use the smart assistant to control the TV’s many functions, search for content, control compatible smart home accessories, and look up answers to various questions with your voice. If you want an even larger screen, you can also pick up a 75-inch model for $849.99 ($450 off) at Amazon and Best Buy.\nHisense U65QF TV (2025)\n\nWhere to Buy:\n\n $999.99 $596.99 at Amazon (65-inch)\n $999.99 $649.99 at Best Buy (65-inch)\n $1299.99 $649.99 at Amazon (75-inch)\n\nThe best 4K TV deals for those on a budget\nAmazon Fire TV 4-Series\nAmazon’s Fire TV 4-Series is an affordable option if you want to upgrade a smaller HDTV to a 4K model. The 50-inch model is currently on sale for $289.99 ($110 off) at Amazon. The TV features an LED panel with a 60Hz refresh rate and support for HDR10 / HLG, which is totally sufficient for casual TV viewing or watching movies and TV shows. It runs Fire OS, and comes with a remote that allows you to summon Amazon Alexa with the push of a button for a query or command. You can step up to a 55-inch model for $359.99 ($100 off) if you like its modest feature set but want a slightly larger screen.\nAmazon Fire TV 4-Series\n\nWhere to Buy:\n\n $399.99 $289.99 at Amazon (50-Inch)\n $459.99 $359.99 at Amazon (55-Inch)\n\nHisense QD7\nIf your budget is under $500, the 55-inch Hisense QD7 has a lot to offer, especially now that it’s on sale for around $399.99 ($1oo off) at Amazon and Best Buy. It features a QLED panel that can deliver more contrast and brightness than a typical LED TV, with support for HDR10 Plus and Dolby Vision, with a peak brightness of 600 nits. The 4K set features a processor capable of AI upscaling and full array local dimming with 160 local dimming zones. A panel with full array local dimming offers better control of brightness and contrast than direct- or edge-lit LED panels (this video from LG shows how it works), providing a more consistent picture across the entire screen. The QD7’s obvious weak point is gaming, due to its 60Hz refresh rate, but if that’s not important to you, it remains a superb value. If you want a larger TV, you can get a 65-inch model for $499.99 ($100 off) at Amazon and Best Buy.\nHisense QD7\n\nWhere to Buy:\n\n $499.99 $399.99 at Amazon (55-Inch)\n $499.99 $399.99 at Best Buy (55-Inch)\n $599.99 $499.99 at Amazon (65-Inch)\n\nThe best deals on high-end 4K TVs\nSony Bravia 8 II OLED\nIf you want a TV that produces reference-quality images, Sony’s Bravia 8 II (K65XR80M2) is the best choice. It was recently selected as the top TV in Valve Electronics’ 10th annual TV Shootout based on objective and subjective tests conducted by a panel of experts comparing each set to the image on a $43,000 reference monitor. Disclosure: Verge editor-in-chief Nilay Patel was one of the judges. The 55-inch model also recently received a substantial price cut, dropping it to $2,598.99 ($401 off) at Amazon and B&H Photo.\nSony’s premium set has a 120Hz refresh rate panel, with two HDMI 2.1 ports that support 4K at 120Hz, and two HDMI 2.0 ports that top out at 4K / 60Hz. It doesn’t support Nvidia’s G-Sync or AMD’s FreeSync Pro, so there aren’t any specific features on this TV that PC gamers can take advantage of. Sony calls the Bravia 8 II its brightest OLED screen yet, and testing conducted by Hometheaterreview found its maximum brightness was 1,880 nits when viewing HDR content. Its predecessor topped out at 1,300 nits HDR video, or roughly 44 percent dimmer. \nThe TV runs on Sony’s XR processor, which uses AI to adjust the color, contrast, and clarity of whatever you’re watching in real time to look better. The judges in the aforementioned TV Shootout chose Sony’s set as the best model for SDR (Standard Dynamic Range) processing, but third of four models compared for HDR (High Dynamic Range) processing. Any OLED TV can show true black, but judges agreed that the Bravia 8 II pulled ahead in grayscale and contrast when viewing SDR video.\nSony says its TV has modes calibrated for Netflix, Prime Video, and its own Sony Pictures Core streaming services, too. Sony Picture Core is a streaming service that’s available on select Bravia TVs and Sony gaming consoles, and allows you to stream or download 4K movies at far higher bitrates than competing services. The Bravia 8 II comes with 10 credits, which you can use to download movies for offline viewing, and two years of unlimited streaming for films in its catalogue.\nIf you want this TV in a larger size, Amazon, Best Buy, and B&H Photo are offering the 65-inch model for around $3,098 ($402 off).\nSony Bravia 8 II\n\nWhere to Buy:\n\n $2999.99 $2598 at Amazon (55-inch)\n $2999.99 $2598 at B&H Photo (55-inch)\n $3499.99 $3098 at Amazon (65-inch)\n\nLG C4 OLED\nThe last-gen LG C4 remains one of the best OLED TVs you can buy, and the 65-inch model is currently on sale for around $1,396.99 ($1,303 off) at Amazon, B&H Photo, and Best Buy. Like LG’s newer C5 OLED, it has a 120Hz panel with support for VRR, Nvidia G-Sync, and AMD FreeSync Premium (the option exists to enable a 144Hz mode if you dig in the TV’s options). Its embedded A9 AI Processor Gen7 offers higher-quality video upscaling and image optimization compared to the C3. The biggest difference between the C4 and C5 is their maximum brightness. The C4 tops out at an advertised 1,000 nits, while the C5 tops out at around 1,165 according to tests conducted by Tom’s Guide.\nAdditionally, the C4 features a three-channel audio system, which might sound impressive compared to other TVs, but still can’t compete with a soundbar. When you’re not watching videos or playing games, you can also enable the C4’s Gallery Mode to display art. Basically, the LG C4 offers many of the same features as the C5, but retails for nearly $400 less. You can also save on the 77-inch model, which is on sale for $1,799.96 ($1,900 off) at B&H Photo.\nLG C4\n\nWhere to Buy:\n\n $1596.99 $1396.99 at B&H Photo (65-Inch)\n $1599.99 $1396.99 at Amazon (65-Inch)\n $3496.99 $1799.96 at B&H Photo (77-Inch)\n\nSony A95L\nSony’s 55-inch A95L is a premium TV with features that should appeal to gamers and cinephiles alike, and you can get it for $1,598 ($1,102 off), a return to its all-time low price at Amazon, B&H Photo, and Best Buy. The TV has a 120Hz panel and two HDMI 2.1 ports (four HDMI ports total), so you can play games in 4K at up to 120 frames per second. Its two HDMI 2.0 ports are fine for last-gen consoles like the original Nintendo Switch. If you connect a PS5, the TV will adjust its video settings based on the genre of game you’re playing, which is a nice touch, but games on that console will look incredible on any OLED set.\nSony’s Cognitive Processor XR powers the A95L, which enables better motion processing so sports and games look less blurry. It also claims to improve the contrast and colors compared to previous generation Sony TVs. It has a peak brightness of 1,300 nits according to lab tests by Tom’s Guide, which is higher than most of the other OLED TVs we found on sale.\nThe A95L is a Bravia-series TV, which means it can access Sony’s Picture Core. This video on demand service has the highest-bitrate (aka video quality) of any streaming platform, which means what you watch will look closer to an uncompressed 4K Blu-ray than a 4K stream from Netflix. Its library is limited, but Sony includes 10 credits with A95L, so you can download movies to keep forever, and a 24-month subscription that lets you stream videos from the library.\nIf you want a higher-end OLED TV, Sony’s A95L is a great choice and has features you won’t find on non-Sony TVs. You can also get the 65-inch model on sale for around $1,998 ($1,502 off), which matches its all-time low price at Amazon, Best Buy, and B&H Photo.\nSony A95L\n\nWhere to Buy:\n\n $2799 $1598 at Amazon (55-Inch)\n $3499.99 $1998 at Amazon (65-Inch)\n\nUpdate, September 15th: Updated pricing / availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26d0075cfaf47c6294bbd4d12bcee4f8bf90abab",
      "title": "Tory MP and shadow minister Danny Kruger defects to Reform",
      "url": "https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:17:56.000Z",
      "summary_90w": "",
      "raw": "The East Wiltshire MP said the Conservatives were no longer the main party of opposition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "939152d6f815da177c7222f96dce7ed78f86355a",
      "title": "NY could force TikTok, YouTube, and Instagram to roll out age verification",
      "url": "https://www.theverge.com/news/778177/ny-safe-act-online-age-verification-social-media-proposed-rules",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T16:16:15.000Z",
      "summary_90w": "",
      "raw": "A New York law could require social media platforms to implement age verification. On Monday, New York Attorney General Letitia James released the proposed rules for the Stop Addictive Feeds Exploitation (SAFE) For Kids Act, which would force platforms to confirm that someone is over 18 before allowing them to access an algorithm-driven feed or nighttime notifications.\nNew York Governor Kathy Hochul signed the SAFE For Kids Act into law last year as part of efforts to “protect the mental health of children.” The law joins a growing number of online child safety legislation across the US, many of which have faced legal hurdles and concerns over user privacy. \nBut the legal landscape surrounding online age verification could change, with recent Supreme Court rulings allowing age-gating on porn sites and at least temporarily opening the door for social media platforms.  California is on the cusp of passing a bill that would require device makers and app stores to carry out age verification, while South Dakota and Wyoming have begun forcing platforms to implement age verification if they host sexual content.\nUnder the proposed rules for New York’s  SAFE For Kids Act, social platforms must serve unverified users or kids under 18 only chronological feeds or posts from people they follow, as well as ban notifications from 12AM to 6AM. (The office is requesting comments about how exactly to define a nighttime notification.) Companies can confirm a user’s age with a “number of different methods, as long as the methods are shown to be effective and protect users’ data.” Platforms must also include at least one alternative to uploading a government ID, such as a face scan that estimates a user is 18 years old.\nKids can only gain access to a platform’s “addictive” algorithmic feeds by getting permission from a parent, which involves a similar verification process. The proposed rules state that platforms must delete identifying information about a user or parent “immediately” after they’re verified.\nAs noted in the rules, the SAFE For Kids Act would apply to companies that surface user-generated content and “have users who spend at least 20 percent of their time on the platform’s addictive feeds.” A 2023 version of the bill defines an addictive feed as one that generates content based on information associated with users or their devices. That means it could potentially affect major platforms like Instagram, TikTok, and YouTube. Companies that violate the law could face a fine of up to $5,000 per violation, in addition to other potential remedies.\n“Children and teenagers are struggling with high rates of anxiety and depression because of addictive features on social media platforms,” Attorney General James said in the press release. “The proposed rules released by my office today will help us tackle the youth mental health crisis and make social media safer for kids and families.”\nThe SAFE For Kids Act may not go into effect for a while. The proposed rules kick off a 60-day public comment period, after which the Office of the Attorney General will have one year to finalize the rules. The law will go into effect 180 days after the rules are finalized, though it’s bound to face scrutiny. NetChoice, the Big Tech trade association that has sued to block age verification bills around the US, called the SAFE Act an “assault on free speech” last year. The Electronic Frontier Foundation also said that the law would “block adults from content they have a First Amendment right to access.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67f7f463240fe96584bf63b0b10553d17a536cb5",
      "title": "'I'm just a mixed-race kid from Kirkby', says Stephen Graham after Emmys win",
      "url": "https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:14:25.000Z",
      "summary_90w": "",
      "raw": "Stephen Graham is emotional as he accepts an Emmy award for his role in the hit series Adolescence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2147bf84d6043c37b507082d91c5aca3c1103e5",
      "title": "Israel announces seizure of $1.5M from crypto wallets tied to Iran",
      "url": "https://techcrunch.com/2025/09/15/israel-announces-seizure-of-1-5-million-from-crypto-wallets-tied-to-iran/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:08:14.000Z",
      "summary_90w": "",
      "raw": "The Israeli government ordered the seizure of 187 wallets it said belong to the IRGC, which have over time received $1.5 billion in crypto, according to a blockchain analysis firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T16:05:29.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform' s American operations, according to the US treasury secretary.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c186f3cf8bf6597e85fce82bf92abd6290d3db7",
      "title": "Time’s running out to volunteer at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/times-running-out-to-volunteer-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:05:17.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 takes place October 27–29 at Moscone West in San Francisco, and we’re looking for motivated, curious, and energetic volunteers to help make it all happen.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d5dacef05f2df7b95c4ecdddce7592ae1a85f35f",
      "title": "‘Tinder Swindler’ Shimon Hayut arrested in Georgia on Interpol request",
      "url": "https://www.theguardian.com/world/2025/sep/15/tinder-swindler-shimon-hayut-simon-leviev-arrest-georgia-interpol",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:01:22.000Z",
      "summary_90w": "",
      "raw": "Hayut, a convicted fraudster who was focus of a Netflix documentary, was detained on as-yet unknown grounds\nA convicted con artist who was the focus of the Netflix documentary The Tinder Swindler has been arrested in Georgia on Interpol’s request, officials have said.\nShimon Yehuda Hayut, also known as Simon Leviev, was taken into custody on Sunday as he arrived at Batumi international airport in the south-west of the country.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f24f9cf50f19530fdcdd2da95285d8e569f5a5dc",
      "title": "Cuban prisoners forced to work making cigars and charcoal for export to Europe, report claims",
      "url": "https://www.theguardian.com/world/2025/sep/15/cuba-prisoners-forced-labour-cigars-charcoal-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:01:13.000Z",
      "summary_90w": "",
      "raw": "Madrid-based NGO estimates at least 60,000 inmates subject to forced labour with little or no pay in Cuban jails\nPrisoners in Cuba are forced to work producing the country’s world-famous cigars and marabu charcoal sold to European consumers, according to a new report.\nThe Madrid-based NGO Prisoners Defenders estimates that at least 60,000 people are being forced to work with little or no pay, under threats, in exhausting conditions and without adequate equipment, with reports of violence including the sexual abuse of female detainees.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a26f39ea664acd863c12fd8080bfe97d0e704a0",
      "title": "PayPal adds new one-to-one payment links that will soon support crypto",
      "url": "https://techcrunch.com/2025/09/15/paypal-adds-new-one-to-one-payment-links-that-will-soon-support-crypto/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T15:58:26.000Z",
      "summary_90w": "",
      "raw": "The new PayPal Links allow customers to either request or make a payment to another person by selecting the link option, inputting the amount, and then copying the link into a conversation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "00bca9816f6e87321c9e55f19ecd80390b732898",
      "title": "Spotify&#8217;s free users can finally play the songs they want",
      "url": "https://www.theverge.com/news/778176/spotify-free-user-upgrade-play-specific-songs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T15:47:00.000Z",
      "summary_90w": "",
      "raw": "Spotify has removed restrictions that prevented free users from listening to specific tracks. With lossless audio now finally rolling out to paying subscribers, the music streaming service has announced that it’s also allowing non-paying listeners to search, play, and share any song they want, without having to upgrade to a Premium subscription.\nThe update is being rolled out globally and addresses one of the most annoying limitations of Spotify’s shuffle-only free experience. Instead of playing the specific song a free user had searched for or selected in an album or playlist, Spotify would previously launch tracks in a randomized order that forced users to skip songs until they reached the one they actually wanted to play, with skips limited to six per hour.\nNow, non-paying users can “pick and play any song you want,” according to Spotify. There are still some restrictions in place, however, with CNET reporting that free users can only listen to one song before the app starts shuffling.\n“Only Spotify Premium users have complete control to play and skip music without restrictions. Mobile listeners of the updated free experience will be able to tap on any song or search for what they’d like to play, or if they don’t like a track or simply want to hear what’s next, skip the occasional song and carry on listening,” Spotify spokesperson Luke Mackay told The Verge. “Each user has a daily allocated amount of on-demand time. Once this limit is reached, users will then be limited to six-skips per hour.”\nThe free experience will also still include ads, but this update gives free listeners fewer reasons to use rival streaming services like YouTube when they want to play a specific song without dancing around shuffle-skipping requirements. This also helps Spotify’s desire to get users sharing music links online, given that non-paying users previously couldn’t immediately play songs that friends had shared on social media platforms.\nUpdate, September 15th: Added a statement from Spotify.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1a5b22d77eca4bf1f1fe27ee110529bdb1a5a532",
      "title": "Beauty chain Bodycare to shut a further 30 stores",
      "url": "https://www.bbc.com/news/articles/c62ln4n8kjro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T15:43:50.000Z",
      "summary_90w": "",
      "raw": "Administrators say they are hopeful the chain's remaining 85 stores can be saved.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba1a69c28d42c1982858afe85fca23104d56d0f4",
      "title": "Israel demolishes more high-rise towers as Gaza City offensive ramps up",
      "url": "https://www.bbc.com/news/videos/cr5q8mj6nrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T15:40:30.000Z",
      "summary_90w": "",
      "raw": "BBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eee8d8b260d1c9436cb4fb0ee2c196cca114add9",
      "title": "Netanyahu does not rule out further strikes on Hamas leaders",
      "url": "https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T15:26:38.000Z",
      "summary_90w": "",
      "raw": "At a joint press conference with US Secretary of State Marco Rubio, Netanyahu said every country had the right \"to defend itself beyond its borders\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d47159d918f70d9f8b7ba0e4f6c53cd8827270f",
      "title": "Scam weight-loss drops marketed to Australians contain ‘basically salty water’, analysis finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/scam-weight-loss-product-marketed-australians-water-saline-solution-analysis-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:15.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Scientists from UNSW school of chemistry analyse sample of treatment, bought online and purported to mimic effects of Ozempic, and find nothing more than saline solution\n\nGet our breaking news email, free app or daily news podcast\n\nA scam weight-loss treatment marketed to Australians as an “oral solution” that mimics the effects of Ozempic contains nothing more than a watery saline solution similar to eye drops, analysis has revealed.\nGuardian Australia revealed last month that online “ghost stores” masquerading as Australian businesses had expanded into advertising weight-loss treatments and were impersonating real people to recommend their products.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "305330ee3d627852b37c80a944eee628218249be",
      "title": "Youth crime in regional NSW down 12% with even sharper drops in crime hotspots",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/youth-in-regional-nsw-down-12-with-even-sharper-drops-in-hotspots",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:14.000Z",
      "summary_90w": "",
      "raw": "Exclusive: New data shows far west and Orana region is down 42%, while car theft is down by almost 25% overall\n\nGet our breaking news email, free app or daily news podcast\n\nYouth crime has dropped in regional New South Wales by more than 12% over the past two years, according to new data, with even sharper drops in crime hotspots including the area that takes in Moree.\nThe data from the Bureau of Crime Statistics and Research (Bocsar), which tracks the number of youth charged and issued a court attendance notice between June 2023 to June 2025, shows car theft in the regions has dropped by almost 25%, and break and enters and robbery offences have remained stable.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "406a7b208d86e7d05c1fa50963371fc4d8bb3ba4",
      "title": "The government has laid out the perils of the climate crisis for Australia – but will it meet the moment?",
      "url": "https://www.theguardian.com/environment/2025/sep/16/the-government-has-laid-out-the-perils-of-the-climate-crisis-for-australia-but-will-it-meet-the-moment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:12.000Z",
      "summary_90w": "",
      "raw": "Grave remarks on the potential shocks to people, property and the economy are all too familiar. Putting a credible number on the emissions target is the harder part\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nGet our breaking news email, free app or daily news podcast\n\nIt is hard to imagine there will be a more important piece of work put out by the Albanese government in this term of parliament than the national climate risk assessment. It suggests that at more than 2C of global heating – a level we are headed towards on our current trajectory – the systems Australians rely on could start to crumble and collapse.\nThat’s an easy thing to say, but a hard thing to get your head around. There was a huge amount of information released on Monday, including an adaptation plan that is only the start of grappling with the issue, and it will take time to digest. But it is worth considering what the assessment led by the Australian Climate Service says about the country’s economic future if global emissions are not curbed and temperatures continue to rise.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "833cf00f0e7e352619c93b7093dc27b29b346815",
      "title": "Charlie Kirk suspect linked to crime scene by DNA, says FBI chief",
      "url": "https://www.bbc.com/news/articles/c203qgn61geo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:56:59.000Z",
      "summary_90w": "",
      "raw": "Kash Patel says Tyler Robinson's DNA was found on towel wrapping suspected murder weapon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa28ec246e79fbea659498ffe33b3d3cbb1ec608",
      "title": "Belarus and Russia's show of firepower appears to be a message to Europe",
      "url": "https://www.bbc.com/news/articles/cn95jxvn04eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:32:28.000Z",
      "summary_90w": "",
      "raw": "The Zapad-2025 military drills come just days after Poland accused Moscow of violating its air space with a drone incursion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ace77a88d8da2e30f26fe59956bfdf80512fc95",
      "title": "By popular demand: 10 extra exhibit tables open at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/by-popular-demand-10-extra-exhibit-tables-open-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Back by overwhelming demand, we’ve added 10 more exhibit tables to TechCrunch Disrupt 2025 — and this will be the final release before they sell out.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b239d1fbcf3bfa1eecd81682c90b95d4d1b397cc",
      "title": "Spanish PM calls for Israel to be barred from international sport",
      "url": "https://www.bbc.com/news/articles/c20e1m7vd2no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T14:25:18.000Z",
      "summary_90w": "",
      "raw": "Pedro Sánchez says Israel should be treated in the same way as Russia over its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "806d276038c984b3262c0e0bac419621deb730df",
      "title": "Bob Vylan gig in Netherlands cancelled after frontman makes comments about death of Charlie Kirk",
      "url": "https://www.theguardian.com/music/2025/sep/15/bob-vylan-gig-in-netherlands-cancelled-after-frontman-makes-comments-about-death-of-charlie-kirk",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:12:54.000Z",
      "summary_90w": "",
      "raw": "The 013 venue in Tilburg says ‘new statements go too far’, while band responds that ‘at no point was Kirk’s death celebrated’\nThe punk duo Bob Vylan have had a gig cancelled after their frontman Bobby Vylan called the far right commentator Charlie Kirk, who was fatally shot last week in Utah, “an absolute piece of shit of a human being” while performing in Amsterdam.\nThe Tilburg venue 013 has cancelled the Ipswich band’s 16 September show as a result, saying that the band went “too far” at the Paradiso venue in the Dutch capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "281ed7637d131be22ff995f95c90815475b1f969",
      "title": "'What a legend!' - Duplantis clears 6.30m to break pole vault world record",
      "url": "https://www.bbc.com/sport/athletics/videos/c237mlvl845o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:04:53.000Z",
      "summary_90w": "",
      "raw": "Armand Duplantis breaks the men's pole vault world record for the 14th time, clearing 6.30m attempt after winning gold at the World Athletics Championships in Tokyo.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc6f80b8dc824f2ea3ff3e065c0b715453e4277a",
      "title": "In first interview, Pope Leo XIV takes on billionaires, polarization and war",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542092/in-first-interview-pope-leo-xiv-takes-on-billionaires-polarization-and-war",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T14:01:46.000Z",
      "summary_90w": "",
      "raw": "Pope Leo XIV reflected on the legacy of Pope Francis and whether he sees himself as more U.S. American or Peruvian.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc20e754d1dbb524199e0e7eabb6017e33117031",
      "title": "Zoom’s Eric Yuan and Emergence’s Santi Subotovsky on navigating the second act, at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/zooms-eric-yuan-and-emergences-santi-subotovsky-on-navigating-the-second-act-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Zoom CEO Eric Yuan and Emergence Capital general partner Santi Subotovsky will join the Going Public Stage at Disrupt 2025 in a session called \"What Comes After Breakout Success?\" Join 10,000+ tech and VC leaders from October 27-29 in San Francisco.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26e28a21414cdee22f11d8c220051fd4c5871ef0",
      "title": "Andrew Hastie threatens to quit Coalition frontbench over net zero",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/andrew-hastie-threatens-to-quit-coalition-frontbench-over-net-zero",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:50:27.000Z",
      "summary_90w": "",
      "raw": "In the latest blow for Sussan Ley’s leadership, shadow home affairs minister issues ultimatum over net zero policy\n\nGet our breaking news email, free app or daily news podcast\n\nAndrew Hastie says he would quit the shadow frontbench if the Liberals remain committed to a net zero by 2050 policy, spelling more trouble for Sussan Ley as the opposition leader looks to steady a rocky ship.\nThe shadow home affairs minister and Western Australian MP claimed the Albanese government’s target to reduce emissions to net zero on 2005 levels by 2050 in an appearance is being done in “the name of climate alarmism” on ABC Radio Perth on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "207ad0c999f105f5bfd383a842964f1b08d9245e",
      "title": "Men jailed for attempting to bewitch and kill Zambia's president",
      "url": "https://www.bbc.com/news/articles/cjr57rr9598o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:36:02.000Z",
      "summary_90w": "",
      "raw": "The pair were sentenced to two years in prison after being found with charms, including a chameleon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98a71d5511b50e3bc45a8827ace99736f71a6e45",
      "title": "Conor McGregor ends bid to be Irish president",
      "url": "https://www.bbc.com/news/articles/cly9rnv54jno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:28:02.000Z",
      "summary_90w": "",
      "raw": "The MMA fighter says the decision comes after \"careful reflection\" and consultation with his family.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald’s Trump trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fe915159121b9ae3728fe6ccf3c677f50db91f8",
      "title": "US, China reach ‘framework’ deal for TikTok",
      "url": "https://techcrunch.com/2025/09/15/us-china-reach-framework-deal-for-tiktok/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T13:24:49.000Z",
      "summary_90w": "",
      "raw": "The \"framework\" deal with China is\n\"between two private parties, but the commercial terms have been agreed upon,\" CNBC quoted Bessent as saying on the sidelines of a meeting between the two countries in Madrid on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0ad9214823cfd04c43105d40546694c877a121a8",
      "title": "Trump says Venezuela 'sending drugs, gang members' as tensions rise",
      "url": "https://www.bbc.com/news/articles/cx2jel4gyezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:15:21.000Z",
      "summary_90w": "",
      "raw": "Tension has been running high between the two countries since the US deployed war ships to the South Caribbean.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caeb16e649da1805e48e2c71fea5955e01b1a51d",
      "title": "India's top court suspends parts of contentious Muslim property law",
      "url": "https://www.bbc.com/news/articles/cgq4vx2l45no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:04:20.000Z",
      "summary_90w": "",
      "raw": "The court refused to strike down the entire law saying \"the grant of stay is only in the rarest of rare category\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bcd7a6ccc5a9b3f06b02a35b54ad3c88ae20ce6f",
      "title": "Spotify will now let free users pick and play tracks",
      "url": "https://techcrunch.com/2025/09/15/spotify-will-now-let-free-users-pick-and-play-tracks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "On Monday, the company announced that free users globally will now be able to search and play any song they want or play a song shared by a friend or an artist they follow on social media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7bf3c8b266fba79077bb08a728d39e60b75e664",
      "title": "Prince Harry says his 'conscience is clear' over Royal revelations",
      "url": "https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T12:12:12.000Z",
      "summary_90w": "",
      "raw": "The Duke of Sussex spoke to the Guardian about his family and the upcoming Associated Newspapers case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "beaf932ca3925c4b196e45c6d04160baef92439d",
      "title": "Harvard Law to AI: MarqVision lands $48M to combat brand abuse",
      "url": "https://techcrunch.com/2025/09/15/harvard-law-to-ai-marqvision-lands-48m-to-combat-brand-abuse/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T12:00:00.000Z",
      "summary_90w": "",
      "raw": "This LA-based startup raised $48M to tackle brand abuse",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "17fd6e7987226a3829b516ca050181fdbfd3dea7",
      "title": "South Korea to review possible human rights violations in US raid on workers",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/south-korea-to-review-possible-human-rights-violation-after-us-raid-on-workers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T11:53:30.000Z",
      "summary_90w": "",
      "raw": "Lee Jae Myung says ‘bewildering’ incident may scare off future investment after Ice detained about 475 people\n\nUS politics live – latest updates\n\nSouth Korea’s government has said it will launch an investigation into whether human rights violations were committed when hundreds of its citizens were detained in a US immigration raid.\nAbout 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory in the US state of Georgia on 4 September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8511e1812223ede424a8d13a1bea855d3ef0439e",
      "title": "Final stage of Vuelta abandoned because of protests",
      "url": "https://www.bbc.com/sport/cycling/articles/crl5dele2wro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T11:08:36.000Z",
      "summary_90w": "",
      "raw": "The final stage of the Vuelta a Espana is abandoned after pro-Palestinian protesters enter the course in the centre of Madrid.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879dadf80061e3cff277e6fa1ea9b58dcdab064b",
      "title": "To save its rare birds, New Zealand is relying on a nation of backyard trappers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5508920/birds-new-zealand-conservation-invasive-species-predators-eradication",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T11:00:00.000Z",
      "summary_90w": "",
      "raw": "New Zealand's unique birds are at risk of extinction, like the kiwi. So the country is trying to eradicate the invasive species that prey on them. Everyday people are lining up to help.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "309d58f696e0d3f8fcb2e94ff377a3f8a6dfb0f5",
      "title": "Charges dropped against two men accused of spying for China",
      "url": "https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:51:45.000Z",
      "summary_90w": "",
      "raw": "Christopher Cash, 30, and Christopher Berry, 33, had previously denied the allegations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f1a57b933a7bdf0fb3758e3a226f9dd3b801a63",
      "title": "What we know about the suspect arrested in Charlie Kirk's killing. And, Emmy takeaways",
      "url": "https://www.npr.org/2025/09/15/g-s1-88848/up-first-newsletter-charlie-kirk-shooting-investigation-middle-east-meetings-emmys-recap",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T10:42:32.000Z",
      "summary_90w": "",
      "raw": "Authorities say the suspect in the Charlie Kirk murder investigation is not cooperating. However, the people around him are. Here's what we know. And, takeaways from the 2025 Emmys.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57e08730e5c0ccf9cd1d6e3a65b55c9420525164",
      "title": "Ricky Hatton's family pay tribute, saying his heart was as big as his smile",
      "url": "https://www.bbc.com/sport/boxing/articles/cvg9q28l49no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:04:40.000Z",
      "summary_90w": "",
      "raw": "Ricky Hatton's family pay tribute to the former world champion, who was found dead at the age of 46 at his home in Manchester on Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92da274d7844b9a86cdf639a950e468463f02630",
      "title": "Human rights commissioner blasts Queensland government’s ‘hostile’ approach to First Nations people",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/human-rights-commissioner-blasts-queensland-government-hostile-approach-first-nations-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:36:42.000Z",
      "summary_90w": "",
      "raw": "Scott McDougall uses speech at parliament to warn the LNP is ‘walking us backwards’ on reconciliation as he prepares to exit role\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland’s human rights commissioner has blasted the state government’s “hostile”, “assimilationist” approach to First Nations people in a speech at Parliament House.\nScott McDougall, Queensland’s first-ever human rights commissioner, has consistently criticised both sides of politics over a range of issues, particularly the state’s youth law and order crackdown. His seven-year term in the role comes to an end next month.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e665ec773bbb259ec25a2513e1bd9fb2925d298b",
      "title": "Bali battles worst floods in more than a decade",
      "url": "https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:18:22.000Z",
      "summary_90w": "",
      "raw": "At least 17 dead as torrential downpours trigger landslides, while heavy rain lashes India, Pakistan and Australia\nAt least 17 people have been confirmed dead in Bali, Indonesia, after the island’s worst flooding in more than a decade.\nTorrential rain last Tuesday and Wednesday triggered widespread flooding and landslides, leaving a trail of destruction. Eight victims were found in Denpasar, the island’s capital, and rescue teams continue to search for several others who remain missing.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44a6d52d970d412aeba42e2da31ae9f78fc059af",
      "title": "A record number of congressional lawmakers aren't running for reelection in 2026. Here's the list",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534254/house-senate-retirement-tracker-2026",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR is tracking the record number of lawmakers in Congress who have already announced they don't plan to run for reelection ahead of the 2026 midterms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c76900fcf4ad49a2cb21c40c28f407a88e630ae6",
      "title": "A Utah church embarks on a healing journey in the aftermath of the Kirk assassination",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5541417/orem-utah-church-healing-charlie-kirk-assassination",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A church in Orem, Utah, the city where Charlie Kirk was killed, brings healing during its Sunday service. \"We're going to be navigating this as a community and as a church family for months to come.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db8b03e9757119836a6a0bf393b3b5bdbf922ef9",
      "title": "Democrats will 'either adapt or die' as strategists push them onto new platforms",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5484125/democrats-social-media-strategy-influencers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Prominent Democratic lawmakers and influencers are encouraging their fellow Democrats to embrace social media and online video to reach voters or risk being left behind.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "18e6666c8d85f6ac89abcc97a5f43729e644b6ff",
      "title": "Melting glaciers mean an uncertain future for Europe's rivers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5535161/europe-melting-glaciers-switzerland-alps",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Europe is warming faster than any continent. That's speeding up glacial melt, which is already threatening Europe's largest rivers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1486f9b96cae2b5e1f2628c86cd4f178799ed5be",
      "title": "Trump, fascinated by the royals, gets a rare second U.K. state visit",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5507253/trump-royals-uk-state-visit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump has long expressed fascination with the royal family. The U.K. government will tap into that this week during a state visit that combines pageantry and politics.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9c6cffda714aa3cf269b6307e77264b840c9bc",
      "title": "Brazil's Lula hits back at Trump over Bolsonaro trial and tariffs",
      "url": "https://www.bbc.com/news/articles/cj3yxkkdlkvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:43:19.000Z",
      "summary_90w": "",
      "raw": "In an essay, he says Brazil's democracy and sovereignty \"are not on the table\" after clashes with the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "History-making wins and heartfelt thank yous - highlights from the ceremony in LA",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93b867dff742cdf6387083e9cfa832d6a513aee3",
      "title": "Fourteen NHS trusts' maternity care to be investigated over 'failures'",
      "url": "https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T08:15:11.000Z",
      "summary_90w": "",
      "raw": "Families impacted have criticised the review, calling it \"not fit for purpose\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b79092c60c1bbfe618292fd8c5545606d73d6ac6",
      "title": "Watch: The winning speeches - in two minutes",
      "url": "https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T07:26:45.000Z",
      "summary_90w": "",
      "raw": "Adolescence star Owen Cooper became the youngest ever male winner and The Pitt took out the top drama series award.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ac3b016c4c4ec03f354aceae5c11f89e54306cd",
      "title": "Qatar hosts Arab-Islamic emergency summit over Israeli strike on Doha",
      "url": "https://www.bbc.com/news/articles/c4gk8nx5nw3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T06:49:38.000Z",
      "summary_90w": "",
      "raw": "A draft resolution reportedly says Israeli \"hostile acts\" threaten peace in the Middle East.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7695f814927e386ec1b52d72640bd14608aac66",
      "title": "Monday briefing: Israel’s bombing of Qatar threatens the fabric of Gulf security",
      "url": "https://www.theguardian.com/world/2025/sep/15/monday-briefing-israels-bombing-of-qatar-threatens-the-fabric-of-gulf-security",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T05:36:33.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: For decades, Gulf states have believed that a close relationship with US will guarantee their safety. That is no longer the case\nGood morning. Last Monday, Israel’s foreign minister, Gideon Saar, announced that his country had accepted the US ceasefire proposal to end the devastating war in Gaza. The very next day, Israel attempted to kill Hamas’s negotiating team while they were in Qatar’s capital to discuss that same proposal.\nIsrael, initially bullish about the success of the operation, has since grown more doubtful that it killed any Hamas leaders in Doha. Hamas said that while six people were killed in the bombing – including the son of Khalil al-Hayya, the deputy head of its political bureau – the top leadership including the negotiating team survived.\nUK news | Britain will “never surrender” to far-right protesters who use the English flag as cover for violence and to instil fear, Keir Starmer has said, condemning attacks against police officers and racist harassment after more than 110,000 people attended an extremist London rally.\nCrime | Christian Brueckner, prime suspect in the disappearance of Madeleine McCann, has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, Scotland Yard has said.\nUS | The Utah governor, Spencer Cox, has said 22-year-old Tyler Robinson, the man accused of killing Turning Point USA executive director Charlie Kirk, “does come from a conservative family – but his ideology was very different than his family”. Robinson was not cooperating with authorities, said Cox.\nEurope | Poland’s foreign minister has said the Russian drone incursion into Polish airspace was an attempt by the Kremlin to test Nato’s reactions by incremental escalations without prompting a full-scale response, as Romania became the second Nato country to report an incursion in a matter of days.\nTelevision | It was a full sweep for Adolescence at the Emmys, winning every award in which the show was nominated tonight. Fifteen-year-old Owen Cooper made history as the youngest ever actor to win the Emmy for best supporting actor in a limited series. Emmy awards 2025 – full list of winners\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a877d42bb9dd3d18e601613b86e8c8bab0baa5a",
      "title": "Rising seas will threaten 1.5 million Australians by 2050 - report",
      "url": "https://www.bbc.com/news/articles/c930454e77xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T05:34:24.000Z",
      "summary_90w": "",
      "raw": "Australia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7058a6bba07238fb3117743b4a60acb79a26f08e",
      "title": "Cardiff man still in prison 20 years after stealing phone",
      "url": "https://www.bbc.com/news/articles/c5yev505n5wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T05:22:17.000Z",
      "summary_90w": "",
      "raw": "Leroy Douglas' dad says his son is effectively serving a \"life sentence\" after being handed an IPP.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda56fa31f970d69ff81f2e359c87e7b9940b7a1",
      "title": "Trade war and faltering economy - five challenges facing Canada's Mark Carney",
      "url": "https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:59:38.000Z",
      "summary_90w": "",
      "raw": "From a faltering economy to high expectation from the public, parliament's return could bring challenges for Canada's new PM.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:51:12.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90bf2b02a364567b8812f5ce2202fadf23424be5",
      "title": "Filmed in a single shot: How Adolescence pulled off an Emmys sweep",
      "url": "https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T03:40:13.000Z",
      "summary_90w": "",
      "raw": "The Netflix drama, starring Owen Cooper, explored the impact of smartphones on teenagers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00a7f4307afa99ddb5d740dbe2c0be9aaed877c1",
      "title": "Adolescence star Owen Cooper makes Emmys history as youngest male winner",
      "url": "https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T03:30:53.000Z",
      "summary_90w": "",
      "raw": "The 15-year-old has become the youngest male winner in Emmys history for his role in Netflix's drama.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4aaf0b1519b1693ecda36ab19e69553918787683",
      "title": "Watch: Soda truck falls into sinkhole in Mexico City",
      "url": "https://www.bbc.com/news/videos/cj9zex1r3kjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T02:13:50.000Z",
      "summary_90w": "",
      "raw": "Initial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "812101fea2492226fe35c003b91ddef1c522d31c",
      "title": "Trump insists foreign workers are ‘welcome’ days after arrest of hundreds of South Koreans",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-foreign-workers-welcome-south-korea-arrests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T00:39:54.000Z",
      "summary_90w": "",
      "raw": "US president says he doesn’t want to ‘disincentivize investment’ after images of workers chained and handcuffed caused widespread alarm in South Korea\nPresident Donald Trump has said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platform, Trump wrote: “I don’t want to frighten off or disincentivize investment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0687931e50fcdf7d4473c13d79732d68294470f",
      "title": "In pictures: Best looks from the Emmys red carpet in LA",
      "url": "https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T00:26:06.000Z",
      "summary_90w": "",
      "raw": "Sydney Sweeney, Jenna Ortega and Selena Gomez are among the stars who posed for pictures ahead of the event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d0baf61a59e44d4ce882f4771182b6f1cbe2e92",
      "title": "Madeleine McCann suspect refuses Met Police interview",
      "url": "https://www.bbc.com/news/articles/cr5qd18y8j5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:50:42.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner is due to be released from prison in Germany on a separate offence this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f20771bc1da7b4c5b72d164b114330cdf992415",
      "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
      "url": "https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:36:44.000Z",
      "summary_90w": "",
      "raw": "Why so many corn belt Americans continue to back Trump, even while feeling economic pressure driven partly by his trade policy",
      "topics": [
        "World"
      ]
    },
    {
      "id": "403bfa1b35100d874342d1236d3f7c72bc5db77c",
      "title": "'It's just scary': In Florida, parents ponder future with fewer vaccines",
      "url": "https://www.bbc.com/news/articles/cd07jn0m2y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:25:04.000Z",
      "summary_90w": "",
      "raw": "Florida is pushing to end vaccine mandates as RFK Jr, an immunisation sceptic, remakes US vaccine policy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c736b4edfca330c869707142f35cef62163afbc1",
      "title": "Struggling with brain fog? Here's how to fix it",
      "url": "https://www.bbc.com/news/articles/c87ydw7xdxvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:22:44.000Z",
      "summary_90w": "",
      "raw": "It's common to become forgetful or mentally sluggish but there are easy ways to cut through the haze.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "875f9e36e7dab6be16dfe2731be6172d1467cd8f",
      "title": "'Everybody wants to know what's going to happen' - Summer I Turned Pretty star on the finale of the breakout TV hit",
      "url": "https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:41.000Z",
      "summary_90w": "",
      "raw": "With 25 million viewers and a passionate fandom, season three of The Summer I Turned Pretty is a global sensation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee1bcd1710b1703ad3dc17e278c8fed6eeb14c6b",
      "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
      "url": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:02.000Z",
      "summary_90w": "",
      "raw": "Young Ugandan women tell BBC they are being lured to Dubai to take part in extreme sex acts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc72e58d54b03f9ecda2b3ed493e76146c23e328",
      "title": "Why Man Utd's problem is not the system, it's the personnel",
      "url": "https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T22:47:02.000Z",
      "summary_90w": "",
      "raw": "MOTD pundit Danny Murphy explains how Manchester United's defeat by Manchester City was not down to Red Devils coach Ruben Amorim's rigid 3-4-2-1 formation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd12c04e0781a181213f7f387203dc7e0996d16a",
      "title": "'My wife died giving birth after Trump cut funding to our clinic'",
      "url": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T20:59:49.000Z",
      "summary_90w": "",
      "raw": "The BBC hears devastating accounts of Afghan mothers and babies dying after US-backed clinics shut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "297ebe00f6344ba14b02f69c017185b2acaa23bc",
      "title": "OpenAI board chair Bret Taylor says we’re in an AI bubble (but that’s OK)",
      "url": "https://techcrunch.com/2025/09/14/openai-board-chair-bret-taylor-says-were-in-an-ai-bubble-but-thats-ok/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T19:33:22.000Z",
      "summary_90w": "",
      "raw": "Like OpenAI CEO Sam Altman, Bret Taylor thinks we're in an AI bubble — but he doesn't sound too worried about it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "45a48bf6f5f7e507ef89dec4ef3fadf8a6bf3051",
      "title": "Guy Pearce and Annie Lennox join call to end ‘normalised horror’ for children in Gaza",
      "url": "https://www.theguardian.com/world/2025/sep/14/guy-pearce-and-annie-lennox-join-call-to-end-normalised-horror-for-children-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T19:00:41.000Z",
      "summary_90w": "",
      "raw": "Stars read Michael Rosen’s 2014 poem Don’t Mention the Children in film released by Save the Children\nGuy Pearce, Annie Lennox and Vanessa Redgrave are among the celebrities calling for an end to the “normalised horror” of children being killed in Gaza, as part of new short film.\nReleased by Save the Children and Choose Love, it features the stars reciting the words to a poem by Michael Rosen. Titled Don’t Mention the Children, the poem was written in 2014 in response to a Guardian article about the Israeli government banning a radio advert naming children killed in Gaza. It begins:\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf97b38c63fc5e47b59479ba2c495a3dda116f1e",
      "title": "Vibe coding has turned senior devs into ‘AI babysitters,’ but they say it’s worth it",
      "url": "https://techcrunch.com/2025/09/14/vibe-coding-has-turned-senior-devs-into-ai-babysitters-but-they-say-its-worth-it/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T19:00:00.000Z",
      "summary_90w": "",
      "raw": "TechCrunch spoke to experienced coders about their time using AI-generated code about what they see as the future of vibe coding.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e4b9bd1395bf24c06c4549487476441ba4949ee",
      "title": "Users turn to chatbots for spiritual guidance",
      "url": "https://techcrunch.com/2025/09/14/users-turn-to-chatbots-for-spiritual-guidance/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T18:45:26.000Z",
      "summary_90w": "",
      "raw": "At least one website claims to allow users to chat with God.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "904251f1ce2565ad2a24283cd3b0e4842bdd9db2",
      "title": "Karen Hao on the Empire of AI, AGI evangelists, and the cost of belief",
      "url": "https://techcrunch.com/2025/09/14/karen-hao-on-the-empire-of-ai-agi-evangelists-and-the-cost-of-belief/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T17:00:34.000Z",
      "summary_90w": "",
      "raw": "OpenAI’s rise isn’t just a business story — it’s an ideological one. On Equity, Karen Hao, author of Empire AI, explores how the cult of AGI has fueled a billion-dollar race, justified massive spending on compute and data, and blurred the line between mission and profit.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a46d1579e465359b7bdb94317cbfb6ef660b22a6",
      "title": "Romania becomes second Nato country to report Russian drone in its airspace",
      "url": "https://www.bbc.com/news/articles/c80g7g5rmlno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T16:41:33.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky called the incursion \"an obvious expansion of the war by Russia\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8cf7a2fc5130b7dbf152e77a41df944d4bff50b",
      "title": "iPhone 17, iPhone Air, AirPods Pro 3, and everything else announced at Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/14/iphone-17-iphone-air-airpods-pro-3-and-everything-else-announced-at-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:32:39.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what was announced at this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d255e0d51c980977f1b46f94ea14e4793540e5a",
      "title": "Rolling Stone owner Penske Media sues Google over AI summaries",
      "url": "https://techcrunch.com/2025/09/14/rolling-stone-owner-penske-media-sues-google-over-ai-summaries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:20:00.000Z",
      "summary_90w": "",
      "raw": "Penske's lawsuit accuses Google of abusing its monopoly power in search to force publishers to support AI summaries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dc0dca23aed0dfd2bcb84fd574c38952b866731",
      "title": "Via raises $492.9M in IPO, and German automakers go on the offensive",
      "url": "https://techcrunch.com/2025/09/14/via-raises-492-9m-in-ipo-and-german-automakers-go-on-the-offensive/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:05:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c3a38529f8ffb404cc8894a0ab6c5077f60f11b1",
      "title": "Rubio in Israel for talks to limit diplomatic damage over Qatar strikes",
      "url": "https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T15:47:55.000Z",
      "summary_90w": "",
      "raw": "US secretary of state says Trump ‘not happy’ about Israeli attack that targeted Hamas officials in Doha for Gaza talks\nThe US secretary of state, Marco Rubio, has held talks in Israel with Benjamin Netanyahu aimed at limiting the diplomatic damage to both countries by Israel’s attempt to assassinate Hamas leaders in Qatar, its continued demolition of Gaza, and the accelerated expansion of settlements in the occupied West Bank.\nThe Israeli prime minister took Rubio on a tour of the Western Wall, where both men placed written prayers between the stones, before taking his American visitor underground to view archeological excavations.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2c598731d08b8a2c67883fcf9179abfff61f7e0",
      "title": "‘Selling coffee beans to Starbucks’ – how the AI boom could leave AI’s biggest companies behind",
      "url": "https://techcrunch.com/2025/09/14/selling-coffee-beans-to-starbucks-how-the-ai-boom-could-leave-ais-biggest-companies-behind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The competitive landscape of AI is changing in ways that undermine the advantages of the biggest AI labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e9c42ec2b7533e4dc9e060e2bdf6b91f36c40f4d",
      "title": "Zulu king challenges professor to stick fight",
      "url": "https://www.bbc.com/news/articles/c99gpg3jk80o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T13:23:10.000Z",
      "summary_90w": "",
      "raw": "Prof Musa Xulu tells the BBC he has received threats from hired assassins and has complained to the police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b7c164c4b8785b976a68aecf85502cf20773c708",
      "title": "Hermeto Pascoal, 'the wizard' of Brazilian music, dies at 89",
      "url": "https://www.bbc.com/news/articles/c98dgd2n5y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T12:30:19.000Z",
      "summary_90w": "",
      "raw": "Pascoal - famed for his blend of jazz and traditional music - wrote more than 2,000 instrumental pieces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "499677522d068ec7dc5507989b39afd8fe89ac28",
      "title": "Pot breaks as Nigerian chef attempts to cook largest jollof rice dish",
      "url": "https://www.bbc.com/news/articles/c306m1j542po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T11:17:32.000Z",
      "summary_90w": "",
      "raw": "Hilda Baci and a team of assistants took nine hours to complete the popular West African dish.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c32da42e9fdeae0a4b31d8d24406bc6fadbbb59",
      "title": "Brazilian musician identified as victim of 1976 killing by Argentina military",
      "url": "https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T09:00:29.000Z",
      "summary_90w": "",
      "raw": "The bossa nova pianist Francisco Tenório Cerqueira Júnior went out for cigarettes after a concert in Buenos Aires – a forensic team has finally revealed his fate\nEarly on 18 March 1976, Francisco Tenório Cerqueira Júnior, a Brazilian pianist who had played alongside some of Latin America’s greatest musicians, disappeared from the streets of Buenos Aires.\nFor nearly 50 years, his fate has remained a mystery, sparking desperate searches, raising suspicions of government complicity, and inspiring international documentaries. Now the mystery has been solved, with forensic scientists formally identifying Tenório Júnior’s body – and confirming he was a victim of Argentina’s bloody dictatorship.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29c76de62f0c102c9d13a35815ef97261ffeb4d",
      "title": "Nepal's interim PM to hand over power within six months",
      "url": "https://www.bbc.com/news/articles/cp8wjz90z4no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T08:48:42.000Z",
      "summary_90w": "",
      "raw": "Sushila Karki said the government must heed protesters' demands for \"an end to corruption, good governance and economic equality\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c1f97911443d84721b26e55c9c27fa85500af2b",
      "title": "Chinese carmakers told to improve locking devices for UK market",
      "url": "https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T06:00:26.000Z",
      "summary_90w": "",
      "raw": "UK insurers require critical modifications for sale in country with higher levels of car theft than China\nBritish authorities may have certain concerns about the cyber-spying threat from vehicles made in China, but it turns out the country’s manufacturers have security worries of their own.\nInsurers have told Chinese carmakers they need critical modifications for vehicles on British streets: namely, tougher locking devices to make them harder to steal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf87dacabbd7c88b7a4526ff5ddb23e836521f3c",
      "title": "Trump administration launches trial program to fast-track electric air taxis",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540722/faa-air-taxi-pilot-program",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T23:38:26.000Z",
      "summary_90w": "",
      "raw": "The FAA is seeking proposals for projects that will include piloted and unmanned operations with a focus on electric air taxis, also called an electric vertical takeoff and landing aircraft.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dd6ceb3988caed3aec42c88cbb7419d2377cf3aa",
      "title": "UN condemns reported Haitian village massacre by armed gangs",
      "url": "https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T22:26:51.000Z",
      "summary_90w": "",
      "raw": "Fishing village of Labodrie reportedly set on fire after killing of a gang leader in sign of rising violence outside capital\nThe UN secretary-general has condemned the reported killing of at least 40 people during an attack by armed gangs in a fishing village north of Haiti’s capital.\nMedia in Haiti widely reported that the attack took place on Thursday night in Labodrie. It is another sign of escalating gang violence that has spread outside the capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf1875224740bc86f0fd3ee4e15b2da23e85d79d",
      "title": "Workers taken to hospital after FBI uses furnace to burn seized meth",
      "url": "https://www.bbc.com/news/articles/cly7wzp23lpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T20:22:03.000Z",
      "summary_90w": "",
      "raw": "Fourteen staff were hospitalised and 75 cats and dogs evacuated.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db6fb4e100a8587a10354226fa8af622dde02f46",
      "title": "Mexican congressional staffer resigns after TV comments about Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T19:59:09.000Z",
      "summary_90w": "",
      "raw": "News network Milenio releases public apology after US deputy secretary of state threatens to revoke Mexican visas\nA congressional staffer from Mexico’s ruling party has resigned after being called out online for comments he made on a major Mexican television news program about Turning Point USA executive director Charlie Kirk’s murder.\nThe news network, Milenio, also released a public apology after the United States’ deputy secretary of state – a former ambassador to Mexico – evidently threatened to have Donald Trump’s presidential administration revoke any US visas on which it may count.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93da0a2483a6b1aedc43689592f33bc7d5e8b16f",
      "title": "Trump 'ready' to sanction Russia if Nato nations stop buying its oil",
      "url": "https://www.bbc.com/news/articles/c62zxp1y5lwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T19:46:49.000Z",
      "summary_90w": "",
      "raw": "The US president has repeatedly threatened tougher measures against Moscow, but has so far failed to take action.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a87619aabc325ecc5b17cbadff1d38ab6cbc762",
      "title": "FAA seeks to fine Boeing $3.1 million for safety violations, door plug blowout",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540728/boeing-faa-safety-fines-door-plug-blowout",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T17:45:16.000Z",
      "summary_90w": "",
      "raw": "The FAA said it identified hundreds of quality system violations at Boeing's 737 factory in Renton, Wash., and Boeing subcontractor Spirit AeroSystems' 737 factory in Wichita, Kan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4976f072389d6e6b108dd1494ba10e71543b0f3",
      "title": "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540691/fed-governor-lisa-cook-vacation-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T15:23:53.000Z",
      "summary_90w": "",
      "raw": "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f85f0496c8d31e128ccd0fd31785fa23b9dfaf9e",
      "title": "Woman held by Taliban warns British couple 'dying' in prison",
      "url": "https://www.bbc.com/news/articles/cm28jd2enz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T07:45:03.000Z",
      "summary_90w": "",
      "raw": "Faye Hall was arrested with Peter and Barbie Reynolds in February, and released after two months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b56e156c650fb548ddba8c7fddab2551c1b24e8",
      "title": "What's costing you more lately, and how is it affecting you? NPR wants to hear",
      "url": "https://www.npr.org/2025/09/12/g-s1-88442/cost-of-living-prices",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T22:03:20.000Z",
      "summary_90w": "",
      "raw": "The NPR Network is working on a series about the rising cost of living. We want to hear from you: What costs are going up, and how are you coping? How is it changing the way you live?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c62f31224017c8df6b4e1f818633947cd36e5ddf",
      "title": "Tipper Gore, Twisted Sister and the fight to put warning labels on music",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5460888/music-parental-advisory-sticker-tipper-gore",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T17:03:34.000Z",
      "summary_90w": "",
      "raw": "40 years ago, musicians faced off against a Washington committee over whether to warn parents about explicit lyrics.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1ca38d2acdc84eff3f1b94733cc4a7018d68a94e",
      "title": "Brazilians take to the streets to celebrate Bolsonaro conviction",
      "url": "https://www.theguardian.com/world/2025/sep/12/brazilians-take-to-the-streets-to-celebrate-bolsonaro-conviction",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T14:54:33.000Z",
      "summary_90w": "",
      "raw": "Indigenous groups and other minorities praise verdict while US officials issue warnings of possible sanctions\n• Operation World Cup: the murder plot at the heart of Brazil’s trial of the century\n• Bolsonaro sentenced to 27 years for plotting military coup in Brazil\nThousands of Brazilians have taken to the streets to rejoice at Jair Bolsonaro’s conviction for plotting a coup, as progressive politicians celebrated the historic move and rightwing figures linked to Donald Trump responded with anger and threats.\nChile’s leftwing president, Gabriel Boric, led regional congratulations of the decision to jail Bolsonaro for 27 years for leading a criminal organisation that sought to seize power after the far-right populist lost the 2022 election.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c138099a2a36320e916a93ada7834aa80418ab5",
      "title": "Why mothers in the U.S. are scaling back on their work lives",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5537129/why-mothers-in-the-u-s-are-scaling-back-on-their-work-lives",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:02:37.000Z",
      "summary_90w": "",
      "raw": "Workforce participation for moms in the U.S. has been dropping for most of this year, and the reasons are more complicated than return-to-office mandates. The team from \"The Indicator\" explains why.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    }
  ]
}