{
  "version": "1758170270982",
  "generatedAt": "2025-09-18T04:37:50.982Z",
  "items": [
    {
      "id": "a3e2223a41d8afd889e0d0df732cdffa3f147d92",
      "title": "Australia news live: Sussan Ley says Labor’s new emissions target ‘fails on both counts’ of cost and credibility",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T04:23:09.000Z",
      "summary_90w": "",
      "raw": "Follow today’s news live\n\nAlbanese unveils ‘responsible’ new climate target to slash emissions over next decade\n\nExplainer: what is a climate target and how does Australia’s 2035 goal stack up against other countries?\n\nGet our breaking news email, free app or daily news podcast\n\nMichaelia Cash disputes UN body findings and says genocide not ‘simply about loss of life in war’\nMichaelia Cash, the shadow foreign affairs minister, has discounted findings from a UN commission this week that Israel is committing genocide in Gaza, saying genocide was not “simply about loss of life in war”.\nWell, genocide, Sally, as you know, and I’m a lawyer, has a very specific meaning in international law.\nIt’s not simply about loss of life in war, however, tragic. It requires a deliberate intent to destroy a people in whole or in part. Now, Israel has made it very clear that its actions are about defending its citizens from Hamas terrorism, not about destroying the Palestinian people. …\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "faca9ddd04016d25f556b75434021beaad2abdd9",
      "title": "Facebook owner unveils new range of AI-powered smart glasses",
      "url": "https://www.bbc.com/news/articles/c5y599yz0l3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-18T04:22:02.000Z",
      "summary_90w": "",
      "raw": "The event comes as Meta faces ongoing scrutiny over the impact of its products, particularly on children.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c7456a6ade5cb426fa8bb5cca1dfbcd19f66e6d",
      "title": "Why America is at a dangerous crossroads following the Charlie Kirk shooting ",
      "url": "https://www.bbc.com/news/articles/c78n0e83ye0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T04:18:51.000Z",
      "summary_90w": "",
      "raw": "This moment has parallels with other periods of discord in US history, but it is more complicated than simply repeating them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "711d395e8575de2bb4d97786fda4e773d4ac5861",
      "title": "No more forced job cuts at Australian National University, staff told, but $250m restructure to continue",
      "url": "https://www.theguardian.com/australia-news/2025/sep/18/australian-national-university-no-more-forced-job-cuts-anu-restructure",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T04:10:23.000Z",
      "summary_90w": "",
      "raw": "Australian National Dictionary Centre granted lifeline by ‘anonymous donor’, while ANU music school’s future remains unclear\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThere will be no more forced job cuts at the Australian National University, its interim vice-chancellor has announced, however, Julie Bishop will continue in her leadership role and a restructure at the embattled institution will continue.\nAddressing an all-staff town hall on Thursday morning, the interim vice-chancellor, Prof Rebekah Brown, became visibly emotional and held back tears before confirming there would no more involuntary redundancies as part of the restructure process, named Renew ANU.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09f916cbec93d6ef4a7ffb8d31f5180908a93ca6",
      "title": "France braces for day of strikes amid political crisis",
      "url": "https://www.theguardian.com/world/2025/sep/18/france-strikes-day-sebastien-lecornu-emmanuel-macron-politics",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T04:00:34.000Z",
      "summary_90w": "",
      "raw": "About 800,000 people to demonstrate against budget plans, putting pressure on new prime minister\nFrance is braced for one of its biggest strike days in recent years, as trade unions make a rare show of unity to put pressure on the new prime minister, Sébastien Lecornu, to rethink budget cuts and act on wages, pensions and public services.\nAbout 800,000 people are expected to take to the streets in marches across the country on Thursday, according to police, while schools, rail and air transport will all be affected. A total of 80,000 police will be deployed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87d35b7828b70a86c7272000d222ab5317b8384e",
      "title": "India leads the way on Google’s Nano Banana with a local creative twist",
      "url": "https://techcrunch.com/2025/09/17/india-leads-the-way-on-googles-nano-banana-with-a-local-creative-twist/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T04:00:00.000Z",
      "summary_90w": "",
      "raw": "Indian users turning Google’s Nano Banana into a viral trend engine, from retro AI portraits to figurine-style selfies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f23d3508e7b1ef905c9ff0e4557ce4bced214e0c",
      "title": "'Trump and circumstance' and 'Maddie suspect freed'",
      "url": "https://www.bbc.com/news/articles/cx23g303w94o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T03:58:14.000Z",
      "summary_90w": "",
      "raw": "The state visit and the release of the prime suspect in the disappearance of Madeleine McCann make Thursday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4e695770080a4dc462ad6c55ebb47d001c23bd6",
      "title": "Body found in car registered to D4vd identified as missing teen",
      "url": "https://www.bbc.com/news/articles/ceq27zdzgrqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T03:48:48.000Z",
      "summary_90w": "",
      "raw": "Authorities say the cause and time of the 15-year-old girl's death are still unknown.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e56bb5ad786c74279f40f5182e37d3dc5acfd56",
      "title": "Jimmy Kimmel show is pulled by ABC after comments about the Charlie Kirk killing",
      "url": "https://www.npr.org/2025/09/17/g-s1-89380/jimmy-kimmel-abc-charlie-kirk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-18T03:40:58.000Z",
      "summary_90w": "",
      "raw": "The move follows an appearance by the FCC commissioner, who criticized Kimmel's recent monologue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71d22573f8bf41f1e25ffdd37f9722a1e99b2551",
      "title": "Jimmy Kimmel taken off air over Charlie Kirk comments",
      "url": "https://www.bbc.com/news/articles/c203n52x1y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T03:19:07.000Z",
      "summary_90w": "",
      "raw": "The late-night host said on Monday that Trump's allies were \"doing everything they can to score political points from\" Kirk's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71d22573f8bf41f1e25ffdd37f9722a1e99b2551",
      "title": "US TV host Jimmy Kimmel taken off air over Charlie Kirk comments",
      "url": "https://www.bbc.com/news/articles/c203n52x1y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T03:19:07.000Z",
      "summary_90w": "",
      "raw": "The late-night host said on Monday that Trump's allies were \"doing everything they can to score political points from\" Kirk's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8195814916af2ac7b9cc988fa74444b98c099f8e",
      "title": "Alan Jones pleads not guilty to 27 charges after number of alleged victims drops from 11 to nine",
      "url": "https://www.theguardian.com/media/2025/sep/18/alan-jones-pleads-not-guilty-27-charges-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T03:18:56.000Z",
      "summary_90w": "",
      "raw": "Former 2GB and Sky News Australia broadcaster was not in court on Thursday when it heard 17 of previous 44 charges had been dropped\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAlan Jones faces 25 charges of indecent assault and two of sexual touching relating to nine complainants after prosecutors revealed two alleged victims would no longer be part of the case against the veteran broadcaster.\nJones was on Thursday expected to make his first appearance in court this year to be committed to stand trial on 44 charges of indecent assault against 11 victims aged 17 and older.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c769c68ed396ab9102fd2c8b25d7f9d4763914f1",
      "title": "'Ultimate in cancel culture': Fans outside Jimmy Kimmel studio react to show's axing",
      "url": "https://www.bbc.com/news/videos/c5yqp5n01e0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T03:05:43.000Z",
      "summary_90w": "",
      "raw": "The BBC spoke to fans who expressed surprise and disappointment after the late night show was taken off air \"indefinitely\" over Charlie Kirk comments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb85c9960a575e7883de377dbde516462f6d94d5",
      "title": "Albanese unveils ‘responsible’ new climate target to slash emissions over next decade",
      "url": "https://www.theguardian.com/australia-news/2025/sep/18/albanese-unveils-responsible-new-climate-target-to-slash-emissions-over-next-decade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T03:04:23.000Z",
      "summary_90w": "",
      "raw": "Australia will aim to cut greenhouse gas emissions between 62% and 70% on 2005 levels by 2035, the PM has announced\n\nWhat is a climate target, and how does Australia’s stack up?\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia will aim to cut greenhouse gas emissions by between 62% and 70% of 2005 levels by 2035 under the federal government’s new climate target.\nThe prime minister, Anthony Albanese, announced the long-awaited target at midday on Thursday after cabinet accepted the advice of the Climate Change Authority.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca790903bf9fcaea8a683acecd5758b03a9b40e5",
      "title": "U.S. Education Dept. unites conservative groups to create 'patriotic' civics content",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544582/u-s-education-dept-unites-conservative-groups-to-create-patriotic-civics-content",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-18T02:04:59.000Z",
      "summary_90w": "",
      "raw": "The group of more than 40 conservative organizations met for the first time on Wednesday. The initiative is aimed at celebrations of the nation's founding next summer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "103dc233ef6bc61daa4ead3e0dd873b0b5a66608",
      "title": "Vintage port, a menu in French and 1,452 pieces of cutlery - a glimpse of the state banquet",
      "url": "https://www.bbc.com/news/articles/cn4l13gxy2lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-18T02:00:00.000Z",
      "summary_90w": "",
      "raw": "Chicken and a special cocktail are being served, while Rupert Murdoch and Tim Cook are among the guests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bfdd90bac8803f3a715d31bb379bf2e8f1f46397",
      "title": "Israel threatens national film awards after Palestinian story wins top prize",
      "url": "https://www.bbc.com/news/articles/c2ejzp1rw1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T01:52:56.000Z",
      "summary_90w": "",
      "raw": "The Sea follows a boy from the occupied West Bank who wants to visit Tel Aviv to see the sea for the first time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "697714acb7b5c01a694f3b7973a3f42d7539802a",
      "title": "Laneway festival 2026: Chappell Roan leads lineup featuring Wet Leg, Wolf Alice and PinkPantheress",
      "url": "https://www.theguardian.com/culture/2025/sep/18/laneway-festival-2026-chappell-roan-leads-lineup-featuring-wet-leg-wolf-alice-and-pinkpantheress",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T01:39:24.000Z",
      "summary_90w": "",
      "raw": "The first full Australian tour for the US pop star marks the latest coup for the festival, whose 2025 iteration was headlined by Charli xcx\n\nGet our weekend culture and lifestyle email\n\nUS pop star Chappell Roan will headline next year’s Laneway festival in Australia and New Zealand – another coup for the festival, which was headlined by Charli xcx this year.\nIn exclusive appearances for Laneway, this will be Roan’s first New Zealand show ever, and her first Australian shows since her global ascension in 2024. The 27-year-old artist will perform the full 90-minute production that pulled the biggest crowd at Reading and Leeds festival last month, complete with fantasy castle stage set, an all-female band and gothic fairytale costumes heavily indebted to drag.\nSign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17724f4ddc2b9e0ac18da8bc402d558f81f2c371",
      "title": "Meta Connect 2025: the 6 biggest announcements",
      "url": "https://www.theverge.com/news/780087/meta-connect-2025-ray-ban-oakley-biggest-announcements",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Meta just showed off all the latest in wearable technology, virtual reality, augmented reality, and more at its annual Connect keynote. In addition to the long-awaited reveal of Meta’s updated Ray-Ban smart glasses, the company had some other exciting surprises to share, too.\nHere’s a roundup of all the new tech and software updates announced by Meta.\nMeta’s display-equipped smart specs make their debut\nRumors have swirled for months about Meta launching a pair of smart glasses with a display, and now they’re finally here. The glasses, dubbed the Meta Ray-Ban Display, feature a full-color, high-res screen in the right lens that you can use to view messages, take video calls, read live captions, see walking directions, and preview the pictures you’re about to take with the built-in 12-megapixel camera.\nYou control the display with a wristband, allowing you to scroll, click, and, eventually, write out messages, using different gestures. The glasses offer up to six hours of “mixed-use” battery life, or up to 30 hours with the collapsible charging case.\nThe Meta Ray-Ban Display glasses start at $799, with both the wristband and glasses coming in black or brown. The glasses will be available in the US starting September 30th at Best Buy, LensCrafters, and Ray-Ban stores.\nThe next-gen Ray-Ban Meta smart glasses have longer battery life\nMeta is launching a new version of its popular Ray-Ban smart glasses with an upgraded eight-hour battery life that nearly doubles that of the original model. The second-gen smart glasses still come with a 12-megapixel ultra-wide camera, but they now support 3K video capture and allow wearers to record videos up to 60 frames per second.\nMeta upgraded the charging case that comes included with the glasses, too, as it now offers an extra 48 hours of charging, up from 36 hours. There’s also a new “conversation focus” feature coming to the Ray-Ban Meta and the Oakley Meta HSTN glasses that amplifies the sound of the person speaking to you in noisy areas.\nThe Ray-Ban Meta (Gen 2) glasses will start at $379 and are available now in the familiar Wayfarer, Skyler, and Headliner styles.\nNew athlete-focused AI glasses integrate with Garmin and Strava\nMeta is partnering with Oakley to launch a new pair of smart glasses designed for “high-intensity sports.” The Oakley Meta Vanguard feature a wraparound design, an IP67 rating for water and dust resistance, along with integrations with fitness apps like Garmin and Strava, allowing you to ask Meta AI about your fitness data and stats.\nAdditionally, the Vanguard glasses feature a 12MP, 122-degree camera on the nose bridge, with the ability to record videos in up to 3K resolution, and they support new capture modes, like slow-motion, time-lapse, and hyperlapse, which are coming to Meta’s other AI glasses as well. Some other standout features include upgraded speakers and up to nine hours of battery life.\nThe Oakley Meta Vanguard glasses cost $499 and will come in four frame and lens color combinations when they launch on October 21st. Preorders are available now.\nQuest headsets can now put real spaces into VR\nMeta’s new Hyperscape feature allows users wearing a Quest 3 or Quest 3S headset to scan their surroundings and transform them into a digital space. The company first showed off a demo of the feature at Meta Connect last year, but now users can try out a beta using the Hyperscape Capture app.\nA new entertainment hub for Quest headsets\nMeta is putting a new Horizon TV entertainment hub inside Quest headsets. There, you’ll find all of the streaming apps available on Quest headsets, including Prime Video, Peacock, Twitch, and YouTube. Meta announced today that Disney Plus, ESPN, and Hulu are also launching apps on the platform. \nThe Horizon TV hub supports Dolby Atmos surround sound, and Meta plans on adding Dolby Vision later this year. Some movies you watch through Horizon TV, like M3GAN and The Black Phone, will also come with “immersive special effects” that you can only see inside Quest headsets.\nThe engine powering the metaverse gets a boost\nMeta revealed that its Horizon Engine “powers better graphics, faster performance, and more advanced worlds.” The engine is capable of powering Meta’s new Hyperscape feature, as well as allowing for larger capacities in virtual worlds. Meta also plans on upgrading its Horizon Studio with an agentic AI assistant that helps “stitch” together its existing AI tools that help people make virtual worlds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98aa188e6b3294fa3bd4ddacde09e148967ee600",
      "title": "Meta&#8217;s Ray-Ban Gen 2 and Oakley Vanguard glasses are available to preorder",
      "url": "https://www.theverge.com/tech/780353/meta-ray-ban-display-oakley-vanguard-preorder-price-how-to-buy",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T01:00:11.000Z",
      "summary_90w": "",
      "raw": "At its Connect keynote on Wednesday, Meta officially introduced the $799.99 Meta Ray-Ban Display, also known as Hypernova. The brand's new, high-end smart glasses feature an in-lens display you can control with wrist-based gestures via the new Meta Neural Band that's included. The display pairs with your phone and allows you to see everything from text messages and Instagram Reels to maps and more - all without having to pull out your device. They seem like a more fully-realized version of Google Glass, and they'll be released on September 30th. That's also when in-store demos will be available at Best Buy, LensCrafters, Sunglass Hut, Ray-Ba …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f998bb5d93a45ccd847e1405e42ff01bc3fb696c",
      "title": "Meta launches Hyperscape, technology to turn real-world spaces into VR",
      "url": "https://techcrunch.com/2025/09/17/meta-launches-hyperscape-technology-to-turn-real-world-spaces-into-vr/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T00:43:31.000Z",
      "summary_90w": "",
      "raw": "Meta launches Hyperscape into beta, allowing users to turn real world spaces into digital spaces for VR.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b76cc380cad0833802f97b2d132d00be556f4714",
      "title": "Meta is bringing an all-in-one movie and TV streaming hub to Quest headsets",
      "url": "https://www.theverge.com/news/780492/meta-quest-headset-horizon-tv-streaming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:42:31.000Z",
      "summary_90w": "",
      "raw": "Horizon TV puts your streaming apps in one spot. | Image: Meta\t\n\nMeta is making it easier to stream movies and TV shows on your Quest headset. During its Meta Connect keynote on Wednesday, the company announced that it’s rolling out a Horizon TV hub with access to streaming apps like Prime Video, Peacock, Twitch, and — finally — Disney Plus with Hulu and ESPN.\nThe image shared by Meta shows content recommendations and streaming apps lined up on the homepage, along with tabs to switch between movies, TV shows, “immersive” experiences, sports, music, and your watchlist. It’s unclear whether the tabs will show content from all of these platforms, or just the ones you subscribe to.\nAs part of the launch of Horizon TV, Meta is also partnering with Universal Pictures and Blumhouse, allowing you to watch movies like The Black Phone and M3GAN with 3D effects. Apple similarly partners with Disney to offer 3D movies on its Vision Pro headset.\nHorizon TV currently supports Dolby Atmos surround sound, but Meta plans on launching support for Dolby Vision later this year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e066b6155405bc0884fa4814bcdafe5ffd6fdb5d",
      "title": "Venezuela starts days of military and ‘electronic warfare’ drills after US strikes on alleged drug boats",
      "url": "https://www.theguardian.com/world/2025/sep/18/venezuela-military-exercises-after-us-boat-attacks-kill-14-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-18T00:41:51.000Z",
      "summary_90w": "",
      "raw": "Armed forces say ‘special naval militia’ involved in Caribbean deployment as defence minister cites ‘threatening, vulgar voice’ of Washington\nVenezuela says it has begun three days of military exercises on its Caribbean island of La Orchila as tensions soar amid US military activity in the region.\nForces deployed for what Washington called an anti-drug operation have blown up at least two Venezuelan boats and a combined 14 people allegedly transporting drugs across the Caribbean this month – a move slammed by UN experts as “extrajudicial execution”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7506f41fd87aaab95780b3f5e1623ccdcd626fe",
      "title": "Meta is making the metaverse look better",
      "url": "https://www.theverge.com/news/780256/meta-horizon-worlds-engine-studio",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:39:07.000Z",
      "summary_90w": "",
      "raw": "Meta is making improvements to its Roblox-like social platform Horizon Worlds, with the biggest upgrades being the introduction of a new game engine with better graphics as well as the Meta Horizon Studio to help creators to make custom in-game experiences.\nMeta Horizon Studio is an editor that lets creators make VR worlds. Creators can already use generative AI tools to create things like textures and audio, and Meta will bring an AI assistant to the editor later this year to help creators with development. In a demo I saw at Connect 2025, a developer had a conversation with an AI chatbot to request changes like a new environment and tweaks to the personality of an AI-driven NPC.\nPowering Meta’s new metaverse environments is the Horizon Engine, which “powers better graphics, faster performance, and more advanced” VR worlds, including “much greater concurrency,” according to Meta. \nHorizon Worlds hasn’t caught on broadly, even though it’s expanded from VR to mobile. But Meta is trying to get more creators on board with making things for the metaverse, including opening up a $50 million creators fund earlier this year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a66666f4e8ceca1a6fd7b781b20ab1475b043e9c",
      "title": "Meta will let you use a Quest VR headset to turn your real-world space into a virtual world",
      "url": "https://www.theverge.com/news/780044/meta-quest-metaverse-hyperscape-capture-vr",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:38:36.000Z",
      "summary_90w": "",
      "raw": "Gordon Ramsay’s home kitchen as made by Hyperscape.\t\n\nMeta is rolling out tech that lets you capture a real-world space with a Quest VR headset so you can create a digital, photorealistic VR replica. The company calls the tech “Hyperscape,” and as part of a gradual rollout beginning today, users will be able to use the beta Hyperscape Capture app with their Quest 3 or Quest 3S to make the virtual copies. Initially, you’ll only be able to visit the rooms you’ve scanned by yourself, but Meta says that users will be able to visit rooms together by sharing a private link sometime “soon.”\nMeta showed off Hyperscape as part of a demo introduced at Connect 2024 last year, and while it seems like the tech is still somewhat early, it’s clear that the company sees virtual recreations of real environments as a potentially notable use case for VR and its metaverse ambitions. (Though those ambitions have seemingly taken a back seat to AI as of late.) You can see a Meta-provided example of Hyperscape in the GIF below that recreates Gordon Ramsay’s home kitchen.\nI toured some prescanned rooms at Connect 2025, including Ramsay’s kitchen. The rooms looked a lot like real-life rooms, and it was fun to get up close to details like food on a table or a stack of books. The illusion would break down if you got too close to things — text on a “paper” New York Times was readable, but sometimes a little smudgy — but overall, I was really impressed with the scans.\nI also tried a brief demo of the capture app. Wearing a Quest 3 headset, I walked and looked around a room, and as I did, a virtual mesh started to appear over objects I was facing. After about a three-minute scan of the room, the app prompted me to move closer to objects. That made the mesh start to disappear, which was a clever way to show what I had “scanned” in detail. But I didn’t get to finish that part before a Meta rep ended the demo.\nMeta says that after you complete a full scan, it’s uploaded to the cloud to process over the course of a few hours before you can experience the scan for yourself.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cda2e03329cf61c74696c19836268dd3ac903d17",
      "title": "Meta unveils new smart glasses with a display and wristband controller",
      "url": "https://techcrunch.com/2025/09/17/meta-unveils-new-smart-glasses-with-a-display-and-wristband-controller/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T00:25:39.000Z",
      "summary_90w": "",
      "raw": "Meta showed off its newest AI-powered smart glasses, which have a display and are controlled by a wristband, at Meta Connect 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25680f4b4173be586589dd7f94be662a5f65d2cf",
      "title": "I sat down with Mark Zuckerberg to try Meta’s impressive new Ray-Ban Display glasses",
      "url": "https://www.theverge.com/tech/780539/meta-ray-ban-display-mark-zuckerberg-interview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:21:42.000Z",
      "summary_90w": "",
      "raw": "Mark Zuckerberg wearing the new Meta Ray-Ban Display glasses on Access.\t\n\nMark Zuckerberg mostly uses the new Meta Ray-Ban Display glasses to send text messages. Lots of them.\nHe has been wearing the glasses around the office, firing off WhatsApp pings to his execs throughout the day. \"I run the company through text messages,\" he tells me recently.\n\"Mark is our number one heaviest user,\" Alex Himel, the company's head of wearables, confirms. Zuckerberg is known for sending lengthy, multi-paragraph missives via text. But when he's typing on the glasses, Himel can tell because the messages arrive faster and are much shorter.\nZuckerberg claims he's already at about 30 words per minute. That's impressive considerin …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1c6d8ef15f5c3cc052002b81be4d333f4fdca85",
      "title": "I regret to inform you Meta’s new smart glasses are the best I’ve ever tried",
      "url": "https://www.theverge.com/tech/779566/meta-ray-ban-display-hands-on-smart-glasses-price-battery-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:20:38.000Z",
      "summary_90w": "",
      "raw": "You can’t see it, but I’m reading text messages in this photo. | Photo by Colt Bradley / The Verge\t\n\nI want to preface this hands-on by saying that I've been a smart glasses skeptic for many years. In 2019, I even made a two-part mini documentary with a thesis that consumer smart glasses couldn't happen without massive societal and technological shifts. Well, color me pink and let me find a shoe to eat. After getting a demo of the $799 Meta Ray-Ban Display, I'm convinced this is the closest we've ever gotten to what Google Glass promised over 10 years ago.\nThe glasses look just like a chunky pair of Ray-Bans. But put them on, pinch your middle finger twice, and a display will appear in front of your right eye, hovering in front of your vis …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fbed1bdb056a9c798ed695b0d6f2504244c75446",
      "title": "Meta unveils its new Oakley Meta Vanguard smart glasses for athletes",
      "url": "https://techcrunch.com/2025/09/17/meta-unveils-its-new-oakley-meta-vanguard-smart-glasses-for-athletes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-18T00:15:06.000Z",
      "summary_90w": "",
      "raw": "The new smart glasses are geared toward runners, cyclists, and other athletes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f527b238734edc62a2d1f6c13dc721c5c887d486",
      "title": "The new Oakley Meta glasses are what athletes actually want",
      "url": "https://www.theverge.com/tech/779452/oakley-meta-vanguard-hands-on-smart-glasses-wearables",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:14:36.000Z",
      "summary_90w": "",
      "raw": "This was what I had been expecting from Oakley smart glasses. | Photo by Colt Bradley / The Verge\t\n\nWhen the Oakley Meta HSTN arrived earlier this year, it wasn't what I thought Oakley-branded smart glasses would be. Sure, they had Oakley's famous PRIZM lenses, but where was the wraparound design? Where were the athlete-focused features like stronger water and sweat resistance? Confusingly, it felt like the HSTN glasses were just Ray-Ban Meta glasses by another name. But that's because Meta had the real athlete-focused glasses in its back pocket. Today, the company unveiled the new $499 Oakley Meta Vanguard - and it has everything outdoorsy athletes could want and then some.\n\"When we started building HSTN, it was an easier process of deve …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "28f59fabcfea89ccf905a1fa33ad16756522619b",
      "title": "Meta’s new Ray-Ban smart glasses have twice the battery life",
      "url": "https://www.theverge.com/news/780012/meta-ray-ban-gen-2-smart-glasses-connect-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-18T00:07:37.000Z",
      "summary_90w": "",
      "raw": "Meta has announced a new generation of its Ray-Ban smart glasses, featuring significantly improved battery life and the ability to record 3K video, which brings them up to par with the Oakley HSTN smart glasses. The new glasses, technically called the Ray-Ban Meta Gen 2, are available to order today and start at $379.\nLet’s dig in on battery, which is better on a few fronts. You can use the new Ray-Bans for up to eight hours on a single charge, which is twice the four-hour battery life of the previous generation. The charging case can charge the glasses to 50 percent in 20 minutes — a slight improvement over the 22 minutes to 50 percent for the first generation. The case for the Gen 2 glasses offers an additional 48 hours of battery life, up from 32 hours. \nAs for the camera, you’ll be able to record 3K at 30fps, 1440p at 30fps, and 1200p at 60fps, all for up to three minutes. Later this fall, Meta will also add the ability to capture hyperlapse and slow-motion videos — a feature coming to all of its AI glasses.\nMeta is adding a cool audio-focused feature called “conversation focus” down the line, too, which will use the speakers on the glasses to boost the voice of a person you’re talking with. The company is improving live translation by expanding it to support German and Portuguese.\nI tried the Gen 2 glasses at Meta’s Connect event, and there’s not much to say about them at first blush — they’re a solid upgrade on paper, but they’re ultimately still Meta Ray-Ban glasses, so if you’ve used the first generation before, you pretty much get the idea. You’ll be able to buy them in Wayfarer, Skyler, and Headliner styles. The first-generation glasses will still be available, too, starting at $299.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "77f9d052fad8ba223bc25dea37fe04a5e791751d",
      "title": "Battling a rare brain-eating disease in an Indian state",
      "url": "https://www.bbc.com/news/articles/c79ven0xxyqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-18T00:00:04.000Z",
      "summary_90w": "",
      "raw": "In Kerala this year, more than 70 people have been diagnosed and 19 have died from the brain-eating amoeba.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3fb2069d7fa62c2b0db9dd7f0383bf9c93f3d35",
      "title": "The Summer I Turned Pretty to conclude with feature film",
      "url": "https://www.bbc.com/news/articles/c39rz7r13meo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T23:59:22.000Z",
      "summary_90w": "",
      "raw": "The hit young-adult series will conclude with what author and showrunner Han says is \"another big milestone\" in Belly's journey.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a686f26d4ee35a1752913b3b66a7bbfd406ac116",
      "title": "Nvidia AI chip challenger Groq raises even more than expected, hits $6.9B valuation",
      "url": "https://techcrunch.com/2025/09/17/nvidia-ai-chip-challenger-groq-raises-even-more-than-expected-hits-6-9b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T23:51:42.000Z",
      "summary_90w": "",
      "raw": "The fresh raise comes in above the rumored numbers when word leaked in July that it was raising.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8405c30e901110ccbc5c79975cbeca88ed285691",
      "title": "Here&#8217;s the Jimmy Kimmel clip that got him pulled off the air",
      "url": "https://www.theverge.com/policy/780502/heres-the-jimmy-kimmel-clip-that-got-him-pulled-off-the-air",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T23:46:51.000Z",
      "summary_90w": "",
      "raw": "Disney gave in to threats from FCC chairman and occasional speech regulator Brendan Carr this evening, announcing that Jimmy Kimmel Live! would be pulled off the air “indefinitely.” Carr was unhappy that Kimmel characterized the alleged shooter of Charlie Kirk as “anything other than” a member of the “MAGA gang” and threatened to pull broadcast licenses of stations airing his show as a result.\nThe clip of Kimmel’s monologue that got him pulled off the air is still available on YouTube. Watch it for yourself and see if it’s so objectionable as to warrant pulling the entire show, let alone entire broadcast networks that air it.\n“We hit some new lows over the weekend, with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,” Kimmel said near the top of his monologue. The remarks come just after the 2-minute mark in the clip on YouTube.\nCarr has regularly used his position as FCC chairman to try to manipulate speech by broadcasters that rely on his agency. He previously implied that CBS’s cancellation of Steven Colbert’s late-night show helped get the company’s merger with Paramount approved. The companies had to agree to government speech regulations in order to seal the deal.\nThe Verge has reached out to the FCC to ask what specifically in Kimmel’s show is objectionable and which rules it is in violation of. The commission did not immediately provide comment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "948d98d525ebc1fe887570b2b8e262890d5f80b6",
      "title": "Don't scrap care plans for children with special educational needs, say MPs",
      "url": "https://www.bbc.com/news/articles/c15kwv30007o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T23:35:46.000Z",
      "summary_90w": "",
      "raw": "Concerns grow over the government's plans to reform special needs education in  England.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97fa1f7f0c9652dfe1d106544873651844a90537",
      "title": "Eric Baker’s long, winding road to taking StubHub public",
      "url": "https://techcrunch.com/2025/09/17/eric-bakers-long-winding-road-to-taking-stubhub-public/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T23:33:46.000Z",
      "summary_90w": "",
      "raw": "Although StubHub's shares fell 6% in first day of trading, the IPO is testament to the co-founder's 25-year effort.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f03ca7d112855b9484c5c22a8ddb7e8e156506c6",
      "title": "'Pay attention' - Spirit aircraft warned as it gets too close to Air Force One",
      "url": "https://www.bbc.com/news/articles/cy4jndzj9wjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T23:16:17.000Z",
      "summary_90w": "",
      "raw": "Air traffic controllers warn Spirit flight after it came too close to President Donald Trump's aircraft as he flew to the United Kingdom for his state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0caa04acf690949fe5cfd1f5b89f59816e36dac2",
      "title": "Three officers killed in Pennsylvania shooting, with two others critical",
      "url": "https://www.bbc.com/news/articles/cvg4n4zx48no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T23:13:44.000Z",
      "summary_90w": "",
      "raw": "Officials said the suspect has been \"neutralised\" and there is no further threat to the public.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3b229e2bcf462037eacf53aa25f899173d089e77",
      "title": "Interest rates expected to be held by Bank of England",
      "url": "https://www.bbc.com/news/articles/cge2q7wvyz3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T23:09:13.000Z",
      "summary_90w": "",
      "raw": "The Bank rate was cut in August but many analysts do not expect any further reductions this year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d6eb954273f1c7ae91667f35a62bdb144bd17ae0",
      "title": "Starmer to recognise Palestinian state ‘after Trump state visit’",
      "url": "https://www.theguardian.com/politics/2025/sep/17/reports-say-starmer-will-recognise-palestinian-state-over-weekend",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T22:59:27.000Z",
      "summary_90w": "",
      "raw": "Other nations including France, Australia and Canada plan to take the same step at next week’s UN summit \nKeir Starmer will reportedly recognise a Palestinian state over the weekend after Donald Trump concludes his state visit to the UK.\nThe prime minister has previously said he plans to recognise Palestinian statehood before the UN general assembly in New York this month if Israel does not meet a series of conditions to improve the humanitarian situation in Gaza.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0396324c4cd5cf009092dc4c6d523be7fb442bc5",
      "title": "King and Trump hail UK-US special relationship in state banquet speech",
      "url": "https://www.bbc.com/news/articles/cz9jyzl4532o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:41:55.000Z",
      "summary_90w": "",
      "raw": "The state visit will continue on Thursday, as it moves from a royal spectacle to political talks with PM Keir Starmer",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6c37dcfbb0fc69f75bef4af6534bcd990340d3a",
      "title": "I have no relationship with Trump, Brazil's President Lula tells BBC",
      "url": "https://www.bbc.com/news/articles/c3rv981qv4go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:33:33.000Z",
      "summary_90w": "",
      "raw": "In an exclusive interview, Brazil's president says Trump is \"not emperor of the world\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c87bb8ca709ce8fbe89641a9170183f9da906ed",
      "title": "Melania’s hat, a yellow dress and Kate’s golden gown - standout state visit looks",
      "url": "https://www.bbc.com/news/articles/cy857ddpjp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T22:17:34.000Z",
      "summary_90w": "",
      "raw": "State visits are often seen as an opportunity to exercise “sartorial diplomacy” on the world stage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41f19cf059c1ca2678187f4758d7f847bb6782a0",
      "title": "Fury over corruption and 'nepo babies' as floods paralyse Philippines",
      "url": "https://www.bbc.com/news/articles/czrp7xkd2gpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T22:06:32.000Z",
      "summary_90w": "",
      "raw": "An unusually fierce monsoon has derailed daily life more than ever in the South East Asian nation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a37c924234f58658fee5ad5a0b6f7aca2df3994",
      "title": "Watch: Pomp and protests on day one of Trump state visit",
      "url": "https://www.bbc.com/news/videos/cd07v4g0yy3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T21:53:29.000Z",
      "summary_90w": "",
      "raw": "King Charles hosts Donald Trump at Windsor Castle on the first full day of his UK state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5379f129733c7bf4a4c8bf78e845cfcf2932fed",
      "title": "Irregular raises $80 million to secure frontier AI models",
      "url": "https://techcrunch.com/2025/09/17/irregular-raises-80-million-to-secure-frontier-ai-models/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T21:52:00.000Z",
      "summary_90w": "",
      "raw": "Irregular, the AI security startup, now has a valuation of $450 million, a source  close to the deal told TechCrunch.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f6fac2cd5a5b6a37b1c4ba4097f7b0b7c90a4363",
      "title": "The ongoing U.S.-China trade war has complicated things for U.S. chip giant Nvidia",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5542032/the-ongoing-u-s-china-trade-war-has-complicated-things-for-u-s-chip-giant-nvidia",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T21:45:37.000Z",
      "summary_90w": "",
      "raw": "U.S. chip giant Nvidia is caught in the middle of the U.S.-China trade war. But it will take more than geopolitical tensions to rein in demand for the company's chips.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "51db1646ac2a1af65a876ba5ffbeb9db0e83bad8",
      "title": "A shooting in Pennsylvania has left 3 officers dead and 2 injured",
      "url": "https://www.npr.org/2025/09/17/g-s1-89333/pennsylvania-police-shooting-north-codorus",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T21:35:32.000Z",
      "summary_90w": "",
      "raw": "Authorities say the five officers were following up on an investigation that was \"domestic related.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e03ca3100e80c0f08c25c63134ceca4e842908a",
      "title": "US to invest £150bn in UK, promising thousands of jobs",
      "url": "https://www.bbc.com/news/articles/cx2nllgl3q7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T21:30:05.000Z",
      "summary_90w": "",
      "raw": "The UK government is calling this the largest commercial deal of its kind and expects it to create more than 7,600 \"high-quality jobs\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2c4afcdbd57142488c6308223e3892082045d4c",
      "title": "Ben & Jerry's co-founder Jerry Greenfield resigns over dispute with owner Unilever",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544283/ben-jerrys-jerry-greenfield-resigns-unilever",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T21:19:28.000Z",
      "summary_90w": "",
      "raw": "Greenfield said the Vermont ice cream maker \"has been silenced, sidelined for fear of upsetting those in power\" by Unilever, the multinational corporation that bought Ben & Jerry's in 2000.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5170f156c540e02e967333d70e6a01d27bc130c",
      "title": "What is the president’s schedule for day two of his visit?",
      "url": "https://www.bbc.com/news/articles/c8rynvlm6zjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:58:20.000Z",
      "summary_90w": "",
      "raw": "US President Donald Trump and his wife Melania are in the UK for an unprecedented second state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1c62cda56df4004eb21299e3dcb217900ecde02",
      "title": "Trump moves to scrub national parks sites of signs that cast America in a \"negative light\"",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5540117/government-moves-to-national-scrub-park-sites-of-negative-history",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T20:47:48.000Z",
      "summary_90w": "",
      "raw": "The National Park Service faced a deadline this week to address signs that \"inappropriately disparage\" historical figures. One target is George Washington's house in Philadelphia, where he held enslaved people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: All the best images from the day at Windsor Castle",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:37:24.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: US President Donald Trump on second state to UK",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T20:37:24.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "070c40215df92ef38a2e9be5155fdd80c9226670",
      "title": "Thousands gather in London to protest against visit",
      "url": "https://www.bbc.com/news/articles/cj9zve281k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T20:32:46.000Z",
      "summary_90w": "",
      "raw": "A coalition of more than 50 groups have organised a march in central London against the visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e01a09eca4e151595ed27c58d4b14de1845c384",
      "title": "Tesla is redesigning its door handles following safety probe, Bloomberg investigation",
      "url": "https://techcrunch.com/2025/09/17/tesla-is-redesigning-its-door-handles-following-safety-probe-bloomberg-investigation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T20:23:42.000Z",
      "summary_90w": "",
      "raw": "Chief designer Franz von Holzhausen said Wednesday that the company is \"working on\" combining the electronic and manual door releases after owners have reported getting trapped.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0df906731edfd2a16ce25ec6796e24359c38f747",
      "title": "Vitamin B3 can help protect against skin cancer. Here's who may benefit",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544145/vitamin-b3-can-help-protect-against-skin-cancer-heres-who-may-benefit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T20:04:49.000Z",
      "summary_90w": "",
      "raw": "Dermatologists often recommend nicotinamide — a form of Vitamin B3 — following skin cancer. A study of nearly 34,000 veterans finds this supplement reduces the risk of skin cancer recurrence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c4dc00cdf0e79fce90e45b0fbc7e7cc574551595",
      "title": "Kleiner Perkins-backed voice AI startup Keplar aims to replace traditional market research",
      "url": "https://techcrunch.com/2025/09/17/kleiner-perkins-backed-voice-ai-startup-keplar-aims-to-replace-traditional-market-research/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T19:54:17.000Z",
      "summary_90w": "",
      "raw": "The two-year-old startup raised a $3.2 million seed round led by Kleiner Perkins.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15076a1989cf6746b0a16cde0fb6174d1f02d12e",
      "title": "Meet Macroscope: an AI tool for understanding your code base, fixing bugs",
      "url": "https://techcrunch.com/2025/09/17/meet-macroscope-an-ai-tool-for-understanding-your-code-base-fixing-bugs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T19:52:16.000Z",
      "summary_90w": "",
      "raw": "On Wednesday, former Twitter head of product Kayvon Beykpour announced the launch of Macroscope, an AI system aimed at developers and product leaders that summarizes updates to a codebase and catches bugs, among other things.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "67e9381a6a15cac27c0915aedca0cac07c9b5ac4",
      "title": "China tells its tech companies they can’t buy AI chips from Nivida ",
      "url": "https://techcrunch.com/2025/09/17/china-tells-its-tech-companies-they-cant-buy-ai-chips-from-nivida/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T19:39:28.000Z",
      "summary_90w": "",
      "raw": "After strongly discouraging tech companies from buying Nivdia's AI chips in August, the country is now banning the practice outright.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d81ef59a5fed591e0b4a68fc8d33b878d7647839",
      "title": "Spain arrests 19 on suspicion of torture and murder after 50 disappear from migrant boat",
      "url": "https://www.bbc.com/news/articles/c8jm11lmx71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T19:27:19.000Z",
      "summary_90w": "",
      "raw": "Police suspect some of the victims were accused of witchcraft by others on the boat that had travelled from Senegal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83e4973e9058544954cd5f781c60e18432aa123c",
      "title": "Israeli tanks push into major Gaza City residential area",
      "url": "https://www.bbc.com/news/articles/c4gv881exj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T18:52:53.000Z",
      "summary_90w": "",
      "raw": "The sight of tanks in Sheikh Radwan has caused widespread alarm among residents, with thousands fleeing south.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67d7b1777bbe552286ec4c34882da146bec2389b",
      "title": "Russia gives Ukrainian kids military training and reeducation, Yale researchers find",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544256/russia-ukraine-war-children-military-training-reeducation-yale",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T18:48:05.000Z",
      "summary_90w": "",
      "raw": "The Yale Humanitarian Research Lab says Russia's network of sites for Ukrainian children is larger than previously thought, and programs includes military training for children as young as 8.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e8027c2d702aa1a5ae709daacc4861fdad3c6d8",
      "title": "UK to explore extraditing Madeleine McCann suspect Christian Brückner",
      "url": "https://www.theguardian.com/uk-news/2025/sep/17/uk-to-explore-extraditing-madeleine-mccann-suspect-christian-bruckner",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T18:44:44.000Z",
      "summary_90w": "",
      "raw": "Met chief Mark Rowley says many questions remain and detectives are liaising with German and Portuguese police\nMark Rowley has said the British police investigation into Madeleine McCann will explore extraditing the German national Christian Brückner to the UK to stand trial over the three-year-old’s disappearance.\nBrückner was released from a German prison on Wednesday after serving a seven-year jail term for the rape of an elderly woman in Praia da Luz, Portugal, in 2005, two years before Madeleine disappeared while on holiday with her family in the same town.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd7481db6b8dc2a173e99e49362051f15ab2e6f8",
      "title": "The iPhone Air’s real breakthrough is its battery",
      "url": "https://techcrunch.com/2025/09/17/the-iphone-airs-real-breakthrough-is-its-battery/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T18:38:13.000Z",
      "summary_90w": "",
      "raw": "Apple's slimmest iPhone uses a \"revolutionary\" battery design that allows the cell to fill more space within the device, boosting overall energy storage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "97a3e4201653248a1b1fab7cac44cda4e6a684fe",
      "title": "The Justice Department sues Maine and Oregon, ratcheting up demands for voter data",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544354/voter-data-lawsuit-oregon-maine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T18:28:05.000Z",
      "summary_90w": "",
      "raw": "The Department of Justice is escalating its demands for sensitive data from voting officials, suing two Democratic-controlled states who have thus far rebuffed the department's requests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f05d30ad947189ca2655e99502de2b693ac1aa5",
      "title": "Chimps drinking equivalent of a lager a day in fermented fruit, study finds",
      "url": "https://www.bbc.com/news/articles/cgq4710vendo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T18:00:07.000Z",
      "summary_90w": "",
      "raw": "Scientists say chimps consume the equivalent of a bottle of lager a day from dining on ripe fruit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae2127435bef8ebaceda554ef5210cd939791bcb",
      "title": "Irish police find child remains in hunt for boy not marked as missing for four years",
      "url": "https://www.theguardian.com/world/2025/sep/17/irish-police-find-child-remains-in-hunt-for-boy-not-marked-as-missing-for-four-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T17:59:18.000Z",
      "summary_90w": "",
      "raw": "Gardaí believe body is that of Daniel Aruebose, whose 2022 disappearance was not noticed by authorities until last month\nIrish police investigating the fate of a boy who disappeared four years ago but was only registered by authorities as missing last month have found the remains of a child on Dublin wasteland.\nGardaí named the missing boy as Daniel Aruebose, who is thought to have vanished in 2022 aged three, after they discovered the remains on Wednesday in the Donabate area of north Dublin.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a8635a63f0e3b62ad2eb3f1a13c45a547274914",
      "title": "What does Donald Trump want from his UK state visit?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m3dxrk?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T17:19:00.000Z",
      "summary_90w": "",
      "raw": "And the row over free speech after Charlie Kirk’s assassination",
      "topics": [
        "World"
      ]
    },
    {
      "id": "035ccecf380c2504c70cc27766800299588f2459",
      "title": "Zoom launches a cross application AI notetaker, AI avatars and more in its latest update",
      "url": "https://techcrunch.com/2025/09/17/zoom-launches-a-cross-application-ai-notetaker-ai-avatars-and-more-in-its-latest-update/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Zoom is launching new tools for its meeting and productivity platform including new AI avatars that would resemble users.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b77765e103c4300df7e9ef4c4a0f719e985bbd6",
      "title": "Jaguar Land Rover to pause production for third week due to cyberattack ",
      "url": "https://techcrunch.com/2025/09/17/jaguar-land-rover-to-pause-production-for-third-week-due-to-cyberattack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:44:14.000Z",
      "summary_90w": "",
      "raw": "The company owned by Tata Motors is estimated to be losing millions of pounds a week due to the shutdown.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49e11e4d6ce8a3e20db6d25ae53fe66ae45562f5",
      "title": "Airbuds is the music social network Apple and Spotify wish they had built",
      "url": "https://techcrunch.com/2025/09/17/airbuds-is-the-music-social-network-apple-and-spotify-wish-they-had-built/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:36:38.000Z",
      "summary_90w": "",
      "raw": "Airbuds, a music social app aimed at Gen Z, raises $5M as the app reaches 5 million monthly users.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ebc52b2e7fa6d2f7762e3483cfd5cbebb946281",
      "title": "Precious gold samples stolen in raid on French natural history museum",
      "url": "https://www.theguardian.com/world/2025/sep/17/precious-gold-samples-stolen-france-natural-history-museum",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:33:44.000Z",
      "summary_90w": "",
      "raw": "Museum says specimens taken are worth €600,000 based on price of gold but have ‘immeasurable heritage value’\nHistoric gold samples with a street value of €600,000 but priceless to scientists and researchers have been stolen from the French national natural history museum in the latest of a series of museum robberies in France.\n“This has happened in a critical context for cultural establishments in France, particularly museums,” the Paris museum said. “Several public collections have been the victims of robberies in the past months.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a590a97c6e9f5ed679e048b15b33b134c546162",
      "title": "UN warns of ‘grave’ concerns for fuel and food in famine-hit northern Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:30:57.000Z",
      "summary_90w": "",
      "raw": "Food and supplies running out in northern Gaza after Israel closed only crossing, UN says. This live blog is closed\nThe Israeli army said it has struck more than 150 targets in Gaza City since launching a major ground offensive on the Gaza Strip’s main urban hub early on Tuesday.\n“Over the past two days, the [Israeli air force] and artillery corps troops struck over 150 terror targets throughout Gaza City in support of the manoeuvring troops in the area,” the military said in a statement issued on Wednesday, reports Agence France-Presse (AFP).\nNo one can fail to be distressed by the devastating impact the war has had on the children of Gaza, and I cannot imagine the fear and anguish their families have endured. It is a soul-destroying situation that compels us to act.\nEvery child deserves the chance to heal, to play, to simply be able to dream again. These young patients have witnessed horrors no child should ever see, but this marks the start of their journey towards recovery.\nIn Gaza, where the healthcare system has been decimated and hospitals are no longer functioning, there are severely ill children unable to get the medical care they need to survive.\nAs we welcome the first group of children to the UK for urgent treatment, their arrival reflects our determined commitment to humanitarian action and the power of international cooperation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "337740fbbc40f90f1ef677435953162cc83fd0c9",
      "title": "Israel’s culture minister threatens national film awards after Palestinian story takes top prize",
      "url": "https://www.theguardian.com/film/2025/sep/17/israels-culture-minister-threatens-national-film-awards-after-palestinian-story-takes-top-prize",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:20:19.000Z",
      "summary_90w": "",
      "raw": "Miki Zohar says he will cancel funding for the Ophir awards after The Sea, about a 12-year-old Palestinian boy who is denied entry to Tel Aviv, wins best picture\nIsrael’s culture minister, Miki Zohar, has announced that funding for the Ophirs, the country’s national film awards, would be cancelled after The Sea, a film about a 12-year-old Palestinian boy, won the best feature film prize.\nIn a statement on X, translated by Israeli news media, Zohar said: “There is no greater slap in the face of Israeli citizens than the embarrassing and detached annual Ophir awards ceremony. Starting with the 2026 budget, this pathetic ceremony will no longer be funded by taxpayers’ money. Under my watch, Israeli citizens will not pay from their pockets for a ceremony that spits in the faces of our heroic soldiers.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c20334a4046cd566363ec8bd46520f0bfda45dfa",
      "title": "Israeli minister attacks EU’s proposed ‘morally, politically distorted’ sanctions – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:11:58.000Z",
      "summary_90w": "",
      "raw": "Gideon Saar warns any action against his country ‘will receive an appropriate response’. This live blog is closed\nNordic correspondent\nDenmark is for the first time to buy long-range precision weapons such as missiles and drones, Mette Frederiksen has abruptly announced, as she warned “Russia is testing us”.\nThere is no doubt that Russia will be a threat to Denmark and Europe for many years to come.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca344b2536e95e77ea497040d25808019ddd3fbf",
      "title": "How Charlie Kirk became a leader of the conservative youth movement",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544168/how-charlie-kirk-became-a-leader-of-the-conservative-youth-movement",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T16:06:37.000Z",
      "summary_90w": "",
      "raw": "New York Times reporter Robert Draper explains Kirk's rise and legacy. He was killed Sept. 10. Draper also discusses conservative commentator Nick Fuentes, a rival of Kirk's with a large following.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4f039673c45cdd270920a086143ecd10779d38a",
      "title": "IDF tries to force civilians out of Gaza City as ground offensive continues",
      "url": "https://www.theguardian.com/world/2025/sep/17/idf-try-to-force-civilians-out-of-gaza-city-as-ground-offensive-continues",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T16:06:04.000Z",
      "summary_90w": "",
      "raw": "Two army divisions work their way towards centre of Gaza City as further Israeli airstrikes destroy buildings\nIsraeli troops pressed ahead with a ground offensive into Gaza City on Wednesday, making further efforts to force more people to flee their homes and travel to overcrowded and unsafe areas in the south of the devastated territory.\nThe Israel Defense Forces (IDF) said on Wednesday they had carried out 150 air and artillery strikes ahead of the ground operation that began early on Tuesday morning.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49b2f92b31839efc32952481a218b025efa20554",
      "title": "Nvidia boss says UK will be 'AI superpower' as tech firms invest billions",
      "url": "https://www.bbc.com/news/articles/c7016ljre03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T16:00:11.000Z",
      "summary_90w": "",
      "raw": "Microsoft, Google and Nvidia have announced investments as part of a £31bn UK-US \"Tech Prosperity Deal\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b223613576f8d5f13109e9fe994ddb58d54832c",
      "title": "AI and the Future of Defense: Mach Industries’ Ethan Thornton at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/17/the-new-face-of-defense-tech-takes-the-ai-stage-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Ethan Thornton, CEO of Mach Industries, joins the AI Stage at TechCrunch Disrupt 2025 (Oct. 27–29, San Francisco) to discuss how AI is transforming defense — from autonomous weapons to decentralized strategy. Register now and save up to $650 before rates increase.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bea2d577f1862a70392224d7b17da64659c47e9",
      "title": "Google revamps Discover page to show content from creators",
      "url": "https://techcrunch.com/2025/09/17/google-revamps-discover-page-to-show-content-from-creators/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google will now let you follow publishers and creators directly through its Search app's Discover page.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf5ce48046e3ccd0ff423bfc711816bc9a3371a2",
      "title": "Ousted CDC director testifies she was fired for resisting pressure from RFK Jr.",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/17/nx-s1-5544143/cdc-director-susan-monarez-testimony-rfk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T15:55:43.000Z",
      "summary_90w": "",
      "raw": "Susan Monarez says RFK Jr. told her to commit to decisions in advance, without reviewing evidence and to dismiss vaccine experts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1461ff75d371c21d52ec5b3f2f80dc734c9eb23",
      "title": "Major Scottish gangland figures arrested in Dubai",
      "url": "https://www.bbc.com/news/articles/ckged73p340o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T15:25:56.000Z",
      "summary_90w": "",
      "raw": "Steven Lyons, Ross McGill, Stephen Jamieson and Steven Larwood were taken into custody following a co-ordinated operation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c0869d7de46cc81e1332783a02f9f282d98fa96",
      "title": "AI can forecast your future health – just like the weather",
      "url": "https://www.bbc.com/news/articles/cx2pj502ev6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T15:19:58.000Z",
      "summary_90w": "",
      "raw": "An artificial intelligence model can predict the risk of more than 1,000 diseases, a team of scientists say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c0869d7de46cc81e1332783a02f9f282d98fa96",
      "title": "AI can predict people's health problems, scientists say",
      "url": "https://www.bbc.com/news/articles/cx2pj502ev6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T15:19:58.000Z",
      "summary_90w": "",
      "raw": "An artificial intelligence model can predict the risk of more than 1,000 diseases, a team of scientists say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9319e21a375fe1cf7b00b3bd246f21f8303bc37",
      "title": "EU proposes curbs on trade with Israel over Gaza war",
      "url": "https://www.bbc.com/news/articles/cvgr4nj7405o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T15:00:04.000Z",
      "summary_90w": "",
      "raw": "Despite the forceful language, the measures appear unlikely to pass and have been condemned by Israel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "deb3b5d38783a44ad6142ab004ec7066a639f3b0",
      "title": "Search for ancient Egyptian gold bracelet missing from Cairo museum",
      "url": "https://www.bbc.com/news/articles/cn4l1w98nj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T14:59:42.000Z",
      "summary_90w": "",
      "raw": "A photo of the 3,000-year-old bracelet has been sent to airports, seaports and border crossings to stop it being smuggled out of the country.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00f841983b60d13cc3fea511172010ce5f5a000d",
      "title": "Obama says US faces 'political crisis' after killing of Charlie Kirk",
      "url": "https://www.bbc.com/news/articles/c9dxge2ep4xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T14:57:35.000Z",
      "summary_90w": "",
      "raw": "The former president criticised the response to the shooting by President Trump, who has vowed to tackle \"radical leftists\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f56736ee516d624fd0e003d0614f6853e246624f",
      "title": "From Startup Battlefield to the Disrupt Stage: Discord founder Jason Citron returns to TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/17/from-startup-battlefield-200-to-the-disrupt-stage-discord-founder-jason-citron-returns-to-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:30:00.000Z",
      "summary_90w": "",
      "raw": "From Startup Battlefield in 2013 to the Disrupt Stage in 2018: Discord founder Jason Citron returns to TechCrunch Disrupt 2025 in San Francisco on October 27-29. Register here to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a8fc79105c2876fdeb7b88e4958ac7f52e027e5",
      "title": "Amazon launches AI agent to help sellers complete tasks and manage their businesses",
      "url": "https://techcrunch.com/2025/09/17/amazon-launches-ai-agent-to-help-sellers-complete-tasks-and-manage-their-businesses/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:18:50.000Z",
      "summary_90w": "",
      "raw": "The company is updating Seller Assistant, its AI tool for third-party sellers, to help handle tasks on the seller's behalf.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3a326535f4b00b6509ce3f29ad269e8e6aecfe61",
      "title": "VC firm Insight Partners says thousands of staff and limited partners had personal data stolen in a ransomware attack",
      "url": "https://techcrunch.com/2025/09/17/vc-giant-insight-partners-notifies-staff-and-limited-partners-after-data-breach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T14:05:07.000Z",
      "summary_90w": "",
      "raw": "The venture capital giant, behind cyber giants Wiz and Databricks, notified current and former employees, as well as the firm's limited partners, that their data was stolen in a January cyberattack.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7deb466c33f679361aecb9ffcfb0fef725a3f649",
      "title": "A court blocked a migrant being returned to France - how much of a setback is this for No 10?",
      "url": "https://www.bbc.com/news/articles/ced5gyg2e09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T13:45:57.000Z",
      "summary_90w": "",
      "raw": "The temporary decision by a High Court judge shows how complicated deportation or removal plans can be.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "669ac1cd3d4779e76356f5e7001d277fe3bf6d2e",
      "title": "Tests show Navalny was poisoned in jail, his widow says",
      "url": "https://www.bbc.com/news/articles/c5ye0x28vzqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:49:38.000Z",
      "summary_90w": "",
      "raw": "Yulia Navalnaya is urging the two laboratories she says found her husband was poisoned to release their findings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3881366c4be9bd96924917f8cb4cf9b2503fd146",
      "title": "Flying cars crash into each other at Chinese air show",
      "url": "https://www.bbc.com/news/articles/cn5qk4de997o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T12:34:08.000Z",
      "summary_90w": "",
      "raw": "Footage shared on social media shows burning wreckage on the ground after the mid-air collision.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "64521fb1d717a01d2785b63b3639f7e535bd91c4",
      "title": "Nvidia boss 'disappointed' by reported China chip ban",
      "url": "https://www.bbc.com/news/articles/cqxz29pe1v0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-17T11:23:24.000Z",
      "summary_90w": "",
      "raw": "Jensen Huang said the US needs \"to make sure that that people can access this technology from all over the world\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d55b5f86db748f84aba75d34014b4356b845148",
      "title": "Madeleine McCann suspect freed from German prison",
      "url": "https://www.bbc.com/news/articles/cy4rydzmrmvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T11:03:40.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner has never been charged with any crime in relation to the McCann case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fd78b5306bca30f059bffa462eaf2369d7c387a",
      "title": "Timor-Leste scraps plan to buy MPs free cars after protests",
      "url": "https://www.bbc.com/news/articles/cy4ry7vpkdeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T10:30:42.000Z",
      "summary_90w": "",
      "raw": "Demonstrators had burned tyres and set a government vehicle alight, while police responded with tear gas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "52fc551b8e4847f511dd14b0299cba86c0c646e8",
      "title": "Facing Trump's pressure, the Fed cuts rates for the first time this year",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5539555/federal-reserve-interest-rates-inflation-jobs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Fed lowered interest rates by a quarter percentage point Wednesday in an effort to cushion the sagging job market. The move comes as policymakers face growing pressure from President Trump.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d126c1b5da42cc4bd45e152153e87422efbffc7b",
      "title": "Latest blow to Labor’s Pacific defence strategy might not be the embarrassment the Coalition claims",
      "url": "https://www.theguardian.com/world/2025/sep/17/png-australia-defence-treaty-delay-blow-for-anthony-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T08:41:03.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese must now save the defence agreement with Papua New Guinea, a week after a similar plan with Vanuatu was delayed\n\nGet our breaking news email, free app or daily news podcast\n\nWhen Anthony Albanese landed in Papua New Guinea for celebrations marking 50 years of independence this week, he was expecting to sign a landmark mutual defence agreement and designate the one-time colony as a formal ally of Australia.\nInstead, despite insisting the text of the agreement had been approved, the prime minister left Port Moresby on Wednesday with only a 300-word joint communique signed with his counterpart, James Marape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd0de4a53e9254ca2053bdc21e5409cebb8b1542",
      "title": "Champions League debut and Luiz - the rise of Pafos",
      "url": "https://www.bbc.com/sport/football/articles/cj6x7rrxzedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T06:15:58.000Z",
      "summary_90w": "",
      "raw": "BBC Sport looks at Pafos FC, the team from Cyprus set to make their full Champions League debut with David Luiz in defence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T05:18:36.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "234c150741ced732f897749cbd9d9f327647c0ce",
      "title": "NPR to trim $5 million this year as public radio stations struggle to pay bills",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5539164/npr-public-media-funding-budget",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T04:17:06.000Z",
      "summary_90w": "",
      "raw": "NPR plans to make trims totaling more than $5 million over the course of the coming fiscal year to bring its annual budget into balance. Meanwhile, local stations are asking for more help.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "beef6fa0eb6ca20ac0734bafeefd2cc117576db0",
      "title": "'The hungry can't stay silent' - behind deadly protests in oil-rich Angola",
      "url": "https://www.bbc.com/news/articles/c8ex6k88yy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T02:34:08.000Z",
      "summary_90w": "",
      "raw": "As the 50th independence anniversary approaches the country grapples with poverty and inequality.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35e1f18be2566265a28f6d5206c0cce379ab9109",
      "title": "Syria's worst drought in decades pushes millions to the brink",
      "url": "https://www.bbc.com/news/articles/c70x500lkdno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T01:44:40.000Z",
      "summary_90w": "",
      "raw": "The drought has slashed wheat harvests by 40% in a country where nearly 90% of the population already lives in poverty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98eed288986f3bb0ea338603fd7ad567a62ed5e6",
      "title": "Rocks on train tracks strand 900 Machu Picchu tourists amid protest",
      "url": "https://www.theguardian.com/world/2025/sep/17/rocks-on-train-tracks-strand-900-machu-picchu-tourists-amid-protest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T01:31:30.000Z",
      "summary_90w": "",
      "raw": "About 1,400 visitors were evacuated but hundreds were left stuck because of action linked to bus contract dispute, say Peru authorities\nAt least 900 tourists were stranded near the ancient Inca citadel of Machu Picchu on Tuesday, Peru’s tourism minister said, after a passenger train service was suspended due to a protest.\nPeruRail said service was suspended on Monday because the route in Peru’s mountainous Cusco region had been blocked by “rocks of various sizes” as residents clashed with authorities and bus companies. PeruRail’s local unit also said “third parties” had excavated part of its rail route, which affected the track’s stability and slowed down the evacuation of tourists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34a72c5ac071263b0ee85a5790a9345279142b1b",
      "title": "Watch: Key takeaways from Charlie Kirk suspect's first court appearance",
      "url": "https://www.bbc.com/news/videos/cvgj59p3v7po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T00:56:27.000Z",
      "summary_90w": "",
      "raw": "The BBC's Nada Tawfik reports from Utah, where Tyler Robinson appeared in court as prosecutors read the charges against him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66ddf4ad4a469e8cf2d3460200bc8a3d24515951",
      "title": "Anthony Albanese fails to seal defence treaty between Australia and PNG",
      "url": "https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T00:05:39.000Z",
      "summary_90w": "",
      "raw": "Australian PM will leave Port Moresby without agreement, sparking a setback for strategy to minimise China’s influence among Pacific nations\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAnthony Albanese’s strategy of pushing back against China in the Pacific has been dealt another blow, with a major defence treaty with Papua New Guinea delayed amid concerns about sovereignty.\nA deal was expected with the former Australian colony this week but the prime minister is set to leave Port Moresby without signing the so-called Pukpuk mutual defence treaty with his counterpart, James Marape, on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e09d3a0d584629b135c97a335ec264606a48f1e4",
      "title": "‘We’re still in the dark’: a missing land defender and the deadly toll of land conflict on Indigenous people",
      "url": "https://www.theguardian.com/environment/2025/sep/17/missing-land-defender-deadly-toll-land-conflict-indigenous-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T23:01:18.000Z",
      "summary_90w": "",
      "raw": "Julia Chuñil is one of 146 land defenders who were killed or went missing last year, a third of them from Indigenous communities\nOne day last November, Julia Chuñil called for her dog, Cholito, and they set off into the woods around her home to search for lost livestock. The animals returned but Chuñil, who was 72 at the time, and Cholito did not.\nMore than 100 people joined her family in a search lasting weeks in the steep, wet and densely overgrown terrain of Chile’s ancient Valdivian forest. After a month, they even kept an eye on vultures for any grim signs. But they found no trace of Chuñil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb6f79e5d26a4e871ae3209f230cb1776100d4a",
      "title": "Trump extends TikTok reprieve as deal nears",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543413/tiktok-trump-ban-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-16T20:10:09.000Z",
      "summary_90w": "",
      "raw": "While legally questionable, the extension comes just as it appears China and the U.S. may finally have a deal on TikTok's fate.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9f92c7011ddc8d533025d3f4c904c9f7e3a22b3",
      "title": "Deal is done to keep TikTok in the US, says Trump",
      "url": "https://www.bbc.com/news/articles/c7847q9xvwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T19:56:54.000Z",
      "summary_90w": "",
      "raw": "The social media platform had faced a ban in the US over national security concerns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe1e673b71a77838042ff8c5b8e526317c306446",
      "title": "Bolsonaro ordered to pay damages for racist remarks in office",
      "url": "https://www.theguardian.com/world/2025/sep/16/bolsonaro-damages-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:23:00.000Z",
      "summary_90w": "",
      "raw": "Court rules former president, sentenced to 27 years for coup attempt, must pay R$1m for ‘cockroaches’ comment in 2021\nJair Bolsonaro has been ordered to pay R$1m (£138,000) in collective moral damages for remarks deemed “racist” while he was in office.\nThe latest ruling, delivered by a state appeals court, came less than a week after Brazil’s former president was sentenced to 27 years and three months in prison for leading an attempted coup to overturn the result of the 2022 election.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b8f4f5af137df47d7365c15f630d015d41a06b2",
      "title": "Netanyahu’s ‘super-Sparta’ vision braces Israel for isolated economic future",
      "url": "https://www.theguardian.com/world/2025/sep/16/netanyahu-super-sparta-vision-israel-economic-future-isolation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:03:46.000Z",
      "summary_90w": "",
      "raw": "Israeli PM’s outline of partial autarky and more militarised society stirs up backlash and concern over pariah status \nHours before unleashing a ground offensive against Gaza City on Tuesday, Benjamin Netanyahu braced his country for a future of mounting economic isolation, urging it to become a “super Sparta” of the Middle East.\nThe future the prime minister laid out for Israel, of a more militarised society, a partial autarky – or economically self-sufficient country – with limited trade options and relying increasingly on homemade production, has stirred up a backlash among Israelis who are ever more uneasy at the prospect of following him down the path to a pariah state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d70f31bf5a09693edebf01b9acafcdcfff7f40ad",
      "title": "Israel Committing Genocide in Gaza Says UN Commission",
      "url": "https://www.bbc.co.uk/sounds/play/p0m36nph?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T18:26:00.000Z",
      "summary_90w": "",
      "raw": "Israel rejects UN Commission finding that it is committing genocide in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25e03538e3e9d46dd1bb0cc7d474bd6a8ac81b49",
      "title": "UN tries to limit staff going to Cop30 in Brazil due to high price of hotels",
      "url": "https://www.theguardian.com/environment/2025/sep/16/un-tries-to-limit-staff-going-to-cop30-in-brazil-due-to-high-price-of-hotels",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T16:44:01.000Z",
      "summary_90w": "",
      "raw": "Accommodation costs at climate summit in Belem are pricing out some developing countries and media outlets\n\nThe United Nations has urged its staff to limit attendance at the Cop30 climate summit in Brazil in November due to high accommodation prices, while government delegations are still scrambling to find rooms within their budgets.\nThe move comes as delegations grow increasingly concerned about the cost of accommodation in the coastal Amazon city of Belem hosting Cop30. Brazil said it was working to increase the number of available hotel beds, but soaring prices for accommodation have stoked calls from some governments to relocate the conference, which Brazilian officials have rejected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1b3df1e0b5ca1aebb6e879d9c851190d07c4103",
      "title": "'Completely different, yet genuinely get on' - BBC correspondents on Starmer and Trump",
      "url": "https://www.bbc.com/news/videos/c9dxq447dwvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T16:27:49.000Z",
      "summary_90w": "",
      "raw": "The BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6aeaffe1e3ca5d4f53f06de8b9776c77126dc58b",
      "title": "Who was Agnes Wanjiru, Kenyan woman killed near army base in 2012?",
      "url": "https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T15:37:20.000Z",
      "summary_90w": "",
      "raw": "Relatives remember a dependable, kind and funny woman and remain traumatised by her death\nPerhaps the Kenyan market town of Nanyuki’s greatest claim to fame was that it straddles the equator. But now it has become synonymous with something darker. It was here where Agnes Wanjiru was born and lived and where she was brutally killed.\nHer family searched for her for months before her body was found stuffed into a septic tank at the same hotel where she had last been seen alive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e5ab1016b2b4c8ee8fa716477d83ea53fd26d6",
      "title": "Watch: Bear caught on CCTV searching for food in Indian temple",
      "url": "https://www.bbc.com/news/videos/c9dxq3n2pdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T15:12:11.000Z",
      "summary_90w": "",
      "raw": "The curious creature ransacked an office in its quest to find tasty treats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fda108e96638becd32441a61f74ead623332d49",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "url": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T14:28:29.000Z",
      "summary_90w": "",
      "raw": "High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old\n\nProfile: who was Agnes Wanjiru?\n\nA warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.\nThe high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and his extradition to Kenya was being sought.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc020e784bca26bdc1d2d3aab3e677193c2d7a33",
      "title": "Watch: The Sundance Kid's life in the spotlight",
      "url": "https://www.bbc.com/news/videos/ce9rvmk8xdzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T14:09:21.000Z",
      "summary_90w": "",
      "raw": "The BBC's David Sillito takes a look at the career of the Hollywood icon who has died aged 89.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59465bbcf57a8dccf296d9a9607ae2c90a319d9a",
      "title": "Lesotho villagers complain of damage from water project backed by African Development Bank",
      "url": "https://www.theguardian.com/world/2025/sep/16/lesotho-villagers-complain-damage-water-project-african-development-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T13:44:21.000Z",
      "summary_90w": "",
      "raw": "About 1,600 people file complaint to AfDB demanding transparency over forced relocations and compensation\nEighteen rural communities in Lesotho have filed a complaint with the African Development Bank (AfDB) over its funding of a multibillion-pound water project whose construction process they claim has ruined fields, polluted water sources and damaged homes.\nAbout 1,600 people living in the villages in Mokhotlong district in north-east Lesotho are demanding transparency over planned forced relocations and compensation they say they have not been consulted on.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "186387d96ddac98408cdbe3f00f17ed1441d075e",
      "title": "Homes damaged, cars swept away as rains flood India's Uttarakhand",
      "url": "https://www.bbc.com/news/videos/c8641vd73jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T10:22:35.000Z",
      "summary_90w": "",
      "raw": "Rescue efforts are under way after the Himalayan region was hit by torrential downpour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf1ead77844492def427441a62a9e551b68f045c",
      "title": "Trump files $15 billion defamation lawsuit against 'New York Times'",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543030/donald-trump-nytimes-lawsuit",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-16T10:00:40.000Z",
      "summary_90w": "",
      "raw": "President Trump filed a $15 billion defamation lawsuit against The New York Times and four of its journalists, accusing them of harming his business and personal reputation.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "0a6312505e8e474f11a0efed51b03de5f5914245",
      "title": "Google owner reveals £5bn AI investment in UK ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/crmek723dz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T09:44:20.000Z",
      "summary_90w": "",
      "raw": "Google's president and chief investment officer Ruth Porat tells the BBC there are \"profound opportunities in the UK\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b2914e242af7fcbe31bbde4de1e054a5673857f",
      "title": "Bowen: UN commission report on genocide is blunt indictment of Israel's actions in Gaza",
      "url": "https://www.bbc.com/news/articles/c0m4rxjppl8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T07:01:46.000Z",
      "summary_90w": "",
      "raw": "A new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a8b043a5ef482f7f78bd53960e4dbfb00477ea8",
      "title": "Australia-PNG defence treaty: countries to agree to defend each other from military attack as China’s Pacific influence grows",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T04:28:39.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese and Papua New Guinea’s defence minister downplayed the delay to the Pukpuk defence treaty being formalised\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia and Papua New Guinea will agree to defend each other in the event of a military attack, part of a landmark defence agreement due to be signed on the sidelines of celebrations to commemorate the country’s independence this week.\nAnthony Albanese and PNG’s defence minister, Billy Joseph, both downplayed a delay to the deal being formalised, insisting the plan known as a Pukpuk treaty won’t affect sovereignty in the former Australian colony.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T04:20:10.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b99d9252c79d8fb38e65cdfc6052aa5246c664",
      "title": "Pacific leaders gather to celebrate 50th anniversary of Papua New Guinea’s independence",
      "url": "https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T02:30:58.000Z",
      "summary_90w": "",
      "raw": "Celebrations and events have been held across the country to mark the milestone\n\nPNG independence: 50 years on\n\nPacific leaders have gathered in Port Moresby to celebrate Papua New Guinea’s 50th anniversary of independence from Australia, as prime minster James Marape reflected on the moment and voiced his optimism for the future despite the country’s challenges.\nPapua New Guinea was administered by Australia as a single territory from 1945. The territory included the former British protectorate of Papua and the former German colony of New Guinea. In 1975, Papua New Guinea was granted independence.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5747b8476441fa8d66da50cdeaba29b97d41f796",
      "title": "Appeals court says Lisa Cook can stay on the Federal Reserve board -- for now",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539252/lisa-cook-fed-trump-firing-court",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-16T00:57:53.000Z",
      "summary_90w": "",
      "raw": "A federal appeals court blocked President Trump from firing Federal Reserve governor Lisa Cook, just ahead of a key vote on interest rates.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6026cc8859de8bc9a81914aae63649a61cdf2493",
      "title": "Why Trump wants companies to report earnings less frequently",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542137/trump-corporate-earnings-sec",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T18:34:22.000Z",
      "summary_90w": "",
      "raw": "President Trump would like companies to report their earnings less frequently. Executives have long called for that -- but some financial experts worry it would go badly.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b768a80b7f41e8feeec08c67dd8d720ecfb6200e",
      "title": "Watch: JD Vance hosts Charlie Kirk's daily talk radio show",
      "url": "https://www.bbc.com/news/videos/ckge487nr6ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T18:29:57.000Z",
      "summary_90w": "",
      "raw": "The US vice-president said the late conservative influencer played a \"critical part\" in getting President Donald Trump re-elected.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48341e22cf197b930c55378266f1044034e5ce18",
      "title": "Senate confirms Stephen Miran to Fed Board. Who is he and why's he so controversial?",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542126/stephen-miran-fed-reserve-board",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T17:39:32.000Z",
      "summary_90w": "",
      "raw": "The Senate voted Monday to confirm Stephen Miran to the Federal Reserve Board. Miran, who has served in both Trump administrations, has said he will not resign from the White House but take a leave of absence, further stoking concerns about its independence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ba1a69c28d42c1982858afe85fca23104d56d0f4",
      "title": "Israel demolishes more high-rise towers as Gaza City offensive ramps up",
      "url": "https://www.bbc.com/news/videos/cr5q8mj6nrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:40:30.000Z",
      "summary_90w": "",
      "raw": "BBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a475abb3dc16ccdb5d98f98a66ee869d359880a",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jnl0?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-13T01:00:00.000Z",
      "summary_90w": "",
      "raw": "Lara Lewington explores the tech being trialled to find 'hidden' pancreatic cancer cases.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b3a878af0d65401d30b2b22e759db794e484cb6",
      "title": "Tech Life",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6zp7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T19:30:00.000Z",
      "summary_90w": "",
      "raw": "Robot sailboats are helping forecasters predict where hurricanes will hit land.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}