{
  "version": "1755300829522",
  "generatedAt": "2025-08-15T23:33:49.522Z",
  "items": [
    {
      "id": "4f3bbdad0ee6d057cd4a76a4905e9759d7328a89",
      "title": "'I spend £120 a month on buses': Under-22s on what free travel would mean to them",
      "url": "https://www.bbc.com/news/articles/c70xjj8746wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T23:06:54.000Z",
      "summary_90w": "",
      "raw": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d474a6e3b1ea648ce067a63e6cf4b607b91fe0e6",
      "title": "The 104-year-old WW2 veteran who moved the Queen to tears",
      "url": "https://www.bbc.com/news/articles/c1kzwwk30wro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T23:06:35.000Z",
      "summary_90w": "",
      "raw": "Yavar Abbas reflects on his experiences on the front line - and the wars engulfing the world today.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5a437cef5727a78da5dcdaa9549afd7bbbbf484",
      "title": "Topshop returns to the High Street, but can it get its cool back?",
      "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T23:05:44.000Z",
      "summary_90w": "",
      "raw": "For many people, the stores defined their childhood. Now they are due to come back.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f14a6ea2e1a76e1f2a48a9ef8e704b142219d8d1",
      "title": "The Papers: 'Ukraine's fate in their hands' and 'Praying for peace'",
      "url": "https://www.bbc.com/news/articles/cwypgekyn92o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T22:59:39.000Z",
      "summary_90w": "",
      "raw": "Donald Trump and Vladimir Putin's high-stakes summit in Alaska dominates Saturday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ff01443aa281260806166176f68c2ef7552e1c6",
      "title": "Watch: Royals and veterans mark VJ Day 80 years on",
      "url": "https://www.bbc.com/news/videos/c80dxed31v8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T22:53:54.000Z",
      "summary_90w": "",
      "raw": "The King and Queen led a two-minute silence at a service in Staffordshire to commemorate 80 years since VJ Day.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a63828b1ea9040bf34d0df206f4cfcee8ebb56f",
      "title": "Opening game of Premier League halted after Semenyo reports racist abuse",
      "url": "https://www.bbc.com/sport/football/articles/c7vlme23nm5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T22:45:16.000Z",
      "summary_90w": "",
      "raw": "Bournemouth's Antoine Semenyo reports racist abuse from the crowd during their Premier League match at Liverpool.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "404b091e546e0b491812967dc100a1db821ecaa5",
      "title": "An artist on the run, an exhibition censored: How China tried to silence a Thai art show ",
      "url": "https://www.bbc.com/news/articles/cj6yx71565jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T22:32:26.000Z",
      "summary_90w": "",
      "raw": "The show which contained works by Tibetan, Uyghur and Hong Kong artists has since been censored.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efe14c98502dc77b5862e7605adf4f5c99071ade",
      "title": "Sam Altman, over bread rolls, explores life after GPT-5",
      "url": "https://techcrunch.com/2025/08/15/sam-altman-over-bread-rolls-explores-life-after-gpt-5/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T22:20:59.000Z",
      "summary_90w": "",
      "raw": "At a dinner with reporters in San Francisco, OpenAI CEO Sam Altman spilled details on the company's ambitions beyond ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe66a6709de4ed1238005a173adfd92c00629b85",
      "title": "Jazz pianist thought job offer from Spike Lee 'was spam'",
      "url": "https://www.bbc.com/news/articles/cj4wqdlej1wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T22:05:59.000Z",
      "summary_90w": "",
      "raw": "Fergus McCreadie found himself flying to New York to work on the crime thriller Highest 2 Lowest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0475af7d10027e3335554294d30b1803dd23df23",
      "title": "Afghans resettled in UK hit by new MoD data breach",
      "url": "https://www.bbc.com/news/articles/ce87nyr3evro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T21:53:59.000Z",
      "summary_90w": "",
      "raw": "Personal data of up to 3,700 Afghans have potentially been exposed after a cyber-attack on a company working with the MoD.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6a93a27abb9ba8451c568b8d6a7127748748be1",
      "title": "Why Alaska? Why now? What to know about the Trump-Putin meeting",
      "url": "https://www.bbc.com/news/articles/crev9ep2vdgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T21:13:00.000Z",
      "summary_90w": "",
      "raw": "The two leaders are meeting in Anchorage to discuss how to end of the war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e4d04b9bc917cc7d93e4a0c7eb5c8f9cba9744b",
      "title": "Home Depot stays quiet as immigration raids target day laborers",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5495539/home-depot-stays-quiet-as-immigration-raids-target-day-laborers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T21:06:06.000Z",
      "summary_90w": "",
      "raw": "Home Depot stores have been the location of dramatic federal raids targeting day laborers. But the company has largely been quiet.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2f15914728a88de4f926292f6abcb07cf64b9a7a",
      "title": "King hails veterans' courage and sacrifice on VJ Day",
      "url": "https://www.bbc.com/news/articles/c5y0lnzpqjgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T21:01:52.000Z",
      "summary_90w": "",
      "raw": "The King and Queen join veterans at a service to mark the 80th anniversary of Japan's surrender in World War Two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d7f2e5f082bc1dea0eecab7f0f6f405c21bd054d",
      "title": "How your solar rooftop became a national security issue",
      "url": "https://techcrunch.com/2025/08/15/how-your-solar-rooftop-became-a-national-security-issue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T20:58:45.000Z",
      "summary_90w": "",
      "raw": "Texas solar company EG4 became the poster child for home energy cybersecurity risks this week after federal officials published an advisory detailing how hackers could hijack its inverters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca7071354e3f8e9524aac1a0200b0df42e07e67b",
      "title": "Handshakes and a shared limo: Our correspondents on the moment the presidents met",
      "url": "https://www.bbc.com/news/videos/crm4dnmy0pgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T20:44:25.000Z",
      "summary_90w": "",
      "raw": "Donald Trump and Vladimir Putin appeared to have a friendly, but animated, conversation after landing in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9041bd0498a07914e211729b3bb152f484d3d6d1",
      "title": "Sen. Hawley to probe Meta after report finds its AI chatbots flirt with kids",
      "url": "https://techcrunch.com/2025/08/15/sen-hawley-to-probe-meta-after-report-finds-its-ai-chatbots-flirt-with-kids/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T20:38:40.000Z",
      "summary_90w": "",
      "raw": "“Is there anything - ANYTHING - Big Tech won’t do for a quick buck?” Hawley wrote in a post on X announcing the investigation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d653c14eed0113712bba566071fa205436f84515",
      "title": "After a freeze, Trump administration reluctantly agrees to fund EV chargers",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5501584/ev-charger-nevi-funding",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T20:33:59.000Z",
      "summary_90w": "",
      "raw": "Transportation Secretary Sean Duffy says he doesn't agree with federal subsidies for high-speed EV chargers, but that his department \"will respect Congress' will\" and release the funds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "46c03eb4ea26419aedf83c0516aee36f54d7a40b",
      "title": "When our inflation infeelings don’t match the CPI",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500523/when-our-inflation-infeelings-dont-match-the-cpi",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T20:30:00.000Z",
      "summary_90w": "",
      "raw": "For most Americans, we just lived through the highest period of inflation in our lives. And we are reminded of this every time we go grocery shopping. All over TikTok, tons of people have posted videos of how little they got for … $20. $40. $100. Most upsetting to us: an $8 box of Cinnamon Toast Crunch.\n\nFood prices are almost 30% higher than they were five years ago. It’s bad. And those new, higher prices aren’t going away.\nAt the same time, prices are no longer inflating at a wild pace. For the last two years, the rate of inflation has slowed way down. And yet, our fears or feelings that things will spiral out of control again? Those have not slowed down.\nThis mismatch has been giving us all the …. feelings. Inflation feelings. Infeelings. \nOn our latest show: we sort through our infeeltions. We talk to the economists who have studied us. We learn why our personal inflation calculators don’t always match the professional ones.\nListen free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.\nSupport Planet Money, get bonus episodes and sponsor-free listening and now Summer School episodes one week early by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c951d36c90f21bec8a85f29b15bac07635d569cc",
      "title": "The best budget smartphone you can buy",
      "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T20:29:35.000Z",
      "summary_90w": "",
      "raw": "You can get a great budget device these days if you know how to pick your priorities. | Image: The Verge\t\n\nSome of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in. If that’s you — and there’s no judgment here from a certifiable gadget nerd — then you can probably think of more worthwhile ways to spend $1,000 than on a phone.\nBudget phones to the rescue. These devices are roughly $500 or under, though not all of them, and they’re more capable than ever. You won’t get all the bells and whistles, but you will save a little money to spend on, I don’t know, actual bells and whistles. It’s your world.\nWhat compromises can you expect from a budget phone? Some combination of the following: slower processors, less storage, and worse cameras than flagship phones, almost across the board. Many have lower-resolution screens, and water resistance is often less robust than on a pricier phone.\n\nThe best cheap iPhone\nThe best Android phone under $500\nThe budget phone with a big, beautiful screen\nOther budget phones to consider\n\nThe best cheap iPhone\niPhone 16E\nThe iPhone 16E is the spiritual successor to the iPhone SE, bringing flagship-level performance for less than the standard 16. We really wish it included MagSafe for $599, but those upgrading from older iPhones will probably be satisfied with what’s included.\n\n\nScore: 7\n\nProsCons\n\n\nReliable performance\nGood, if limited, camera system\nIt’s the cheapest new iPhone you can buy\n\nNo MagSafe\n$599 feels like $100 too much\nNo ultrawide\n\n\n\nWhere to Buy:\n\n $599 at Apple\n $599.99 at Best Buy\n $599.99 at Verizon\n\nScreen: 6.1-inch, 1170p OLED / Processor: A18 Cameras: 48-megapixel f/1.6 with OIS, 12-megapixel selfie / Charging: 20W wired, 7.5W wireless / Weather-resistance rating: IP68\nIf I were making this recommendation to you face-to-face, you’d hear a heavy sigh. Yes, this is the cheapest new iPhone Apple makes. Yes, it comes with most of the things that make an iPhone an iPhone. But it comes with some significant tradeoffs — some of which make more sense than others — and it’s not exactly cheap. If you’re amenable to last year’s model or a refurbished iPhone 14, one of those might actually be a better option. But for an unfussy person who just wants a new iPhone for the least amount of money, the 16E will do the trick.\nThere’s a single 48-megapixel rear camera on the back, meaning there’s no ultrawide like on the regular 16. That’s an understandable tradeoff — so is the use of the older “notch” design rather than the Dynamic Island. But it’s harder to understand why Apple left out MagSafe here — that’s the ring of magnets built into the back of virtually every other iPhone since 2020. The 16E still supports wireless charging, but it can’t take advantage of the ecosystem of magnetic chargers and accessories on its own; you’ll need to add a magnetic case. This is a silly omission, and Apple should feel bad about it.\nAnother heavy sigh: the 16E supports Apple Intelligence, which you won’t get if you opt for an iPhone 15 or 14. Should you care? It’s really hard to say. What exists of Apple Intelligence so far is underwhelming and the most interesting bits won’t arrive anytime soon. If you want to future-proof your purchase as much as possible, the 16E will be ready for Apple’s AI. But don’t buy one expecting a life-changing experience now. It’s just an iPhone after all, for better and worse, and right now it’s the best price you’ll find on a brand-new one.\nRead my full iPhone 16E review.\nThe best Android phone under $500\nGoogle Pixel 9A\nThe Pixel 9A adds more robust water resistance and a brighter, bigger screen to what was already a winning formula for a good midrange phone.\n\n\nScore: 8\n\nProsCons\n\n\nRobust IP68 rating\nSeven years of software updates\nBrighter, bigger screen\n\nMissing a couple of AI features\nAI is occasionally handy, usually weird\n\n\n\nWhere to Buy:\n\n $499 $399 at Amazon\n $499 $399 at Best Buy\n $499.99 $399 at Google\n\nScreen: 6.3-inch, 1080p OLED, 120Hz / Processor: Tensor G4 Cameras: 48-megapixel f/1.7 with OIS, 13-megapixel ultrawide, 13-megapixel selfie / Battery: 5,100mAh / Charging: 23W wired, 7.5W wireless / Weather-resistance rating: IP68\nGoogle’s Pixel A-series phones have been my go-to recommendation for a cheap Android phone for years, but there was still room for improvement. With the 9A, Google made some modest tweaks that make it even easier to recommend — and at $499, the price is right. \nThe phone uses a Tensor G4 chipset that doesn’t run as hot as some of its predecessors, and performance is reliable. The 6.3-inch OLED screen is a little bigger and a bit brighter than last year’s, which makes a noticeable difference when you use the phone outside. Durability also received a slight boost to IP68, which means it can withstand a drop in deeper water than the IP67-rated Pixel 8A.\nThe 9A’s camera is fine, though it comes up short against the rest of the Pixel 9 series in low light. Portrait mode could be better, too, and if you care a lot about image quality, then that might be a good reason to consider stepping up to a Pixel 9. But it does the trick for everyday snaps, and for the price, the 9A’s better qualities outweigh its shortcomings by a wide margin.\nRead my full Google Pixel 9A review.\nThe budget phone with a big, beautiful screen\nOnePlus 13R\nThe OnePlus 13R is a pared-down version of the company’s flagship phone, and it offers excellent battery life and a great screen for the price.\n\n\nScore: 6\n\nProsCons\n\n\nExcellent battery life\nGreat screen for the price\nSix years of security updates\n\nNo wireless charging\nOnly splash-resistant\nFewer OS updates than Google and Samsung\n\n\n\nWhere to Buy:\n\n $599.99 $499.99 at Amazon\n $599.99 $499.99 at Best Buy\n $599.99 $499.99 at OnePlus\n\nScreen: 6.78-inch, 1264 x 2780 120Hz OLED / Processor: Snapdragon 8 Gen 3 Cameras: 50-megapixel f/1.8 with OIS, 50-megapixel 2x telephoto, 8-megapixel ultrawide, 16-megapixel selfie / Battery: 6,000mAh / Charging: 80W wired / Weather-resistance rating: IP65\nThe OnePlus 13R isn’t quite as well-rounded as my pick for the best overall budget Android phone, the Pixel 9A. It’s also a little pricier at $599 — although we’ve seen it on sale for $499 for extended periods of time — but for some people, the 13R’s upgrades will make it a better choice. It comes with one of the best big screens in its class, and many people love a big screen. The 13R also offers very strong battery performance; unless you’re a power user, you can probably manage two full days on a single charge.\nThere’s also very fast charging with the included charger, though you won’t find wireless charging at any speed. The 13R also lacks full water resistance; it should hold up fine against sprays and rain showers, but it isn’t rated to withstand full immersion. Plenty of people won’t find those omissions bothersome, but they make it harder to recommend to a general audience, especially at a higher price than the Pixel 9A.\nRead my full OnePlus 13R review.\nOther budget phones to consider\nThe 2025 Motorola Moto G Power offers a lot despite its starting price of $299.99. It features a 6.8-inch LCD display, a 5,000mAh battery, wireless charging support, and a 3.5mm headphone jack, which is increasingly rare in 2025. Additionally, the device combines both IP68 and IP69 ratings, meaning it’s rated for both submersion in water and exposure to high-pressure water jets and steam, in addition to full protection from dust.\nThe Samsung Galaxy S24 FE is another perfectly capable phone that doesn’t quite earn a recommendation here. It’s a little outside the scope of this guide at $649 anyway, but you do get a telephoto lens and a nice, big screen for that price. Still, you’re better off saving a bunch and picking up the Pixel 9A or trying to score a trade-in promo for the newer Galaxy S25. Read our review.\nThe Samsung Galaxy A56 recently launched in the US with a starting price of $499. The device has all the makings of a solid midrange phone, including a 6.7-inch OLED display, a 50-megapixel main camera, an Exynos 1580 chip, and a 5,000mAh battery with 45W wired charging. Although we haven’t tested it yet, it has some pretty stiff competition in the form of the Pixel 9A, which also has a starting price of $499.\nWe got our first glimpse of the TCL 60 XE Nxtpaper 5G back at CES 2025, and it’s finally in our hands for testing. The device features an Nxtpaper matte LCD screen that’s supposed to be easier on your eyes than a traditional LCD, as it reduces your exposure to blue light. It also features a “Max Ink Mode,” which turns the screen monochrome and silences notifications. This, in turn, can help extend the phone’s battery life to multiple days. Read our initial impressions.\nThe Samsung Galaxy A36 5G is another great choice that recently launched in the US for $399.99. The device sports a big OLED display, a decent midrange Snapdragon 6 Gen 3 processor, and an IP67 rating for water and dust resistance. Samsung is promising six years of OS and security updates, which is a lot in this price range. Compared to the Galaxy A35 5G, which we previously included in this guide but is no longer available, the A36 5G drops the microSD slot for a second SIM card slot. While we haven’t tested the A36 5G, its predecessor offered a good balance of hardware and price, and the latest release sounds just as compelling.\nUpdate, August 15th: Updated pricing / availability and added a bullet for the Galaxy A36 5G. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "499216c62047f685cd7d58451ed3594e05afaa38",
      "title": "Les Amis, the European app helping women form friendships, launches in New York",
      "url": "https://techcrunch.com/2025/08/15/les-amis-the-european-app-helping-women-form-friendships-launches-in-new-york/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T20:04:50.000Z",
      "summary_90w": "",
      "raw": "Les Amis is an app designed to make it easy for women to form friendships and attend local events.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c171091c43e19cc04262bf8bb871e3f2f25de87",
      "title": "Watch: Moment Trump and Putin meet in Alaska for Ukraine talks",
      "url": "https://www.bbc.com/news/videos/cj3l8056e1yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T19:51:03.000Z",
      "summary_90w": "",
      "raw": "This is the moment Donald Trump and Vladimir Putin exchange handshakes as they meet for a summit in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83b4797e99c5a3207f0380c51eeadcf00da62915",
      "title": "TikTok’s new guidelines add subtle changes for LIVE creators, AI content, and more",
      "url": "https://techcrunch.com/2025/08/15/tiktoks-new-guidelines-add-subtle-changes-for-live-creators-ai-content-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T19:17:48.000Z",
      "summary_90w": "",
      "raw": "TikTok is preparing an update to its Community Guidelines, which dictate the rules for participating on the social video platform as well as what standards the company uses to determine the videos that make it onto its For You feed.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1d557051c05aad42693f38a91832da8594f656b2",
      "title": "A Secret History of the Japanese Army",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5504026/a-secret-history-of-the-japanese-army",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T19:15:06.000Z",
      "summary_90w": "",
      "raw": "On the 80th anniversary of Japan’s surrender in WWII, the legacy\nof a biological warfare unit still haunts. And human rights activists are\nalarmed by the Trump administration’s changing focus.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e154715e5b50a30cede70d1d9502fe8ec406878",
      "title": "Children in a mental health crisis can spend days languishing in the ER",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/15/nx-s1-5502689/pediatric-mental-health-er-boarding-jama-health-forum",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T19:05:12.000Z",
      "summary_90w": "",
      "raw": "A new study finds that nearly 1 in 10 kids on Medicaid visiting an emergency department for mental health care remain stuck there for days waiting for follow up psychiatric care.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ab3ab6c1377b2ba9c684625271fec85a5f54b5a",
      "title": "Louisiana sues Roblox for creating an environment where &#8216;child predators thrive&#8217;",
      "url": "https://www.theverge.com/news/760162/roblox-louisiana-lawsuit-child-predators-safety",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T18:38:16.000Z",
      "summary_90w": "",
      "raw": "The state of Louisiana has filed a lawsuit against Roblox, alleging that the company has “permitted and perpetuated an online environment in which child predators thrive, directly contributing to the widespread victimization of minor children in Louisiana.” \nRoblox sees more than 111.8 million daily active users, and it’s hugely popular with children, with users under 13 comprising nearly 40 percent of players last quarter. However, the platform has come under significant scrutiny over reported failures to protect children on the platform, with Bloomberg publishing a major report last year about predators on Roblox and the investment firm Hindenburg Research alleging that its research revealed “an X-rated pedophile hellscape.” In recent months, Roblox has taken steps to bolster its child safety features, including introducing parent accounts that can manage their child’s account and the ability for parents to block people on their child’s friend list.\nBut Louisiana alleges that Roblox’s “deliberate failure to implement effective safety measures to protect child users from well-documented predatory threats, along with its ongoing failure to warn parents and children of the foreseeable dangers posed by its platform, has directly facilitated the widespread sexual exploitation of minors and inflicted severe, lasting harm upon the children of Louisiana,” according to the complaint.\n“Roblox is overrun with harmful content and child predators because it prioritizes user growth, revenue, and profits over child safety,” Attorney General Liz Murrill says. “Every parent should be aware of the clear and present danger poised to their children by Roblox so they can prevent the unthinkable from ever happening in their own home.”\nRoblox spokesperson Kadia Koroma sent the following statement about the lawsuit to The Verge:\nThe assertion that Roblox would intentionally put our users at risk of exploitation is categorically untrue. Every day, tens of millions of people around the world use Roblox to learn stem skills, play, and imagine and have a safe experience on our platform. We dedicate vast resources to supporting a safe infrastructure including advanced technology and 24/7 human moderation, to detect and prevent inappropriate content and behavior — not only because it’s important to us but because it is such a critical issue and so important to our community. We dispute these allegations and we remain committed to working with Attorney General Murrill to keep kids safe.\nWhile no system is perfect, Roblox has implemented rigorous safeguards—such as restrictions on sharing personal information, links, and user-to-user image sharing—to help protect our community. Unfortunately, bad actors will try to circumvent our systems to try to direct users off the platform, where safety standards and moderation practices may differ. We continuously work to block those efforts and to enhance our moderation approaches to promote a safe and enjoyable environment for all users.\nThe company also published an article responding to the lawsuit on its newsroom.\nSeven lawsuits regarding child predator issues have been filed against Roblox in a “little over two weeks,” Bloomberg reports.\nThis week, Roblox published a post on its website about why it removes what it describes as “vigilantes” who try to catch bad actors on Roblox by using tactics “similar to actual predators.” One user, who goes by “Schlep” and says on his X profile that he has contributed to “6 Roblox arrests and counting,” posted screenshots on X last week of what he says was a cease-and-desist notice by Roblox.\nUpdate, August 15th: Added statement from Roblox.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f8e7e98cf47162095bcef6e4088429cea341853",
      "title": "Here are the best AirPods deals you can get right now",
      "url": "https://www.theverge.com/21302051/best-apple-airpods-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T18:29:53.000Z",
      "summary_90w": "",
      "raw": "Apple’s latest AirPods Pro are receiving the biggest discount at 32 percent off. | Photo: Chris Welch / The Verge\t\n\nIf you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Amazon Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, though you can still find great deals throughout the year.\n \n\nThe best AirPods 4 deals\nThe best AirPods Pro (second-gen) deals\nThe best AirPods Max deals\n\nBelow, we’ve rounded up the best deals currently available on each model, including both iterations of the AirPods 4, the latest AirPods Pro, and the AirPods Max.\nThe best AirPods 4 deals\nApple AirPods 4\nApple’s AirPods 4 improve on previous models with better sound, clearer voice calls, and an even more comfortable design. For $50 extra, you can purchase a model with active noise cancellation and wireless charging.\n\nWhere to Buy:\n\n $129 $99 at Amazon\n $129 $99 at Walmart\n $129 $99.99 at Best Buy\n\n\nAirPods 4 with Active Noise Cancellation\nThe fancier version of the new AirPods 4 offer support for active noise cancellation, a wireless charging case that can use either Qi or Apple Watch pads, and a speaker in the case that chirps to help you find it.\n\nWhere to Buy:\n\n $179 $148.99 at Amazon\n $179 $148.99 at Walmart\n $179 $149.99 at Best Buy\n\nAt its September 2024 event, Apple introduced the AirPods 4, a pair of wireless earbuds available in two variations: a $129 standard model and a $179 noise-canceling model. Both versions represent significant upgrades over the third-gen AirPods, with a more comfortable design and improved audio performance. They’re also better for taking calls thanks to Apple’s Voice Isolation feature, which focuses the mics on your voice so you can be heard more clearly in noisy environments.\nThe $179 AirPods 4 with Active Noise Cancellation offer a surprisingly effective noise-canceling mode, a helpful transparency mode, and several other Pro-level features. The latest AirPods Pro do a better job of tuning out noise, but the AirPods 4 with ANC still do a good job of reducing sound. They also feature other perks formerly reserved for Apple’s top-of-the-line earbuds, including wireless charging and a case with a built-in speaker that allows you to easily track it down via Apple’s Find My app.\nGiven they’ve been out for nearly a year, we consistently see discounts on both versions of the AirPods 4. Right now, for instance, the standard AirPods 4 are on sale at Amazon, Walmart, and Best Buy for around $99 ($30 off), which is just $10 shy of their all-time low. The AirPods 4 with ANC, meanwhile, are matching their second-best price to date at Amazon, Walmart, and Best Buy, where you can currently pick them up starting at $148.99 (also $30 off).\nRead our full AirPods 4 review.\nThe best AirPods Pro (second-gen) deals\nApple AirPods Pro (second-gen) with USB-C charging case\nThe second-gen AirPods Pro improve upon Apple’s original pair with much better noise cancellation, sound quality, and onboard volume controls. The latest refresh also ships with a USB-C charging case, as opposed to Lightning.\n\nWhere to Buy:\n\n $249 $169 at Amazon\n $249 $169 at Walmart\n $249.99 $169.99 at Best Buy\n\nIn 2022, Apple released the second-gen AirPods Pro, which feature a similar build to the first-gen model but offer better noise cancellation, swipe-based controls, and an extra-small pair of swappable silicone ear tips for smaller ears. Apple followed up a year later with a minor refresh, one that features a USB-C charging case and an upgraded IP54 rating for water and dust resistance. The newest model also supports lossless audio when used with Apple’s new Vision Pro headset and doubles as a pair of FDA-approved hearing aids.\nAs far as deals go, Apple’s updated AirPods Pro with USB-C are currently available at Amazon, Walmart, and Best Buy for around $169 ($80 off), which remains the best price we’ve seen this year outside of Prime Day.\nRead our AirPods Pro with USB-C impressions.\nThe best AirPods Max deals\nApple AirPods Max\nApple’s AirPods Max feature exemplary build quality, sound phenomenal, and keep up with the best at noise cancellation.\n\nWhere to Buy:\n\n $549 $479.99 at Amazon (USB-C)\n $549 $479.99 at Walmart (USB-C)\n $549 $479.99 at Best Buy (USB-C)\n\nThe AirPods Max aren’t the iconic in-ears that have become synonymous with the AirPods name. They’re large and luxurious, comprised of aluminum, steel, and mesh fabric that remains comfortable during extended listening sessions. They also sport excellent noise cancellation, Apple’s spatial audio feature, and expansive, balanced sound, even if they lag behind some of their peers when it comes to bass response and features. They’re not the best noise-canceling headphones for most people — blame the sticker price — but it’s hard to find a better pair of Bluetooth headphones if you’re an iPhone user.\nToward the end of last year, Apple replaced the first-gen Max with a new model that features support for USB-C charging and a few new color options. As of writing, they’re on sale at Amazon, Walmart, and Best Buy in all six colors for $479.99 ($70 off) — not quite the $399 low we saw during Prime Day.\nRead our original AirPods Max review.\nUpdate, August 15th: Updated to reflect current pricing / availability and add several related links.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "723b0dda382a077e968b563bc04bcb196874fab5",
      "title": "Kyte, which billed itself as the ‘best competitor to Hertz,’ shuts down",
      "url": "https://techcrunch.com/2025/08/15/kyte-which-billed-itself-as-the-best-competitor-to-hertz-shuts-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T18:29:06.000Z",
      "summary_90w": "",
      "raw": "The startup entered into receivership after selling its customer list to Turo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b10c1e62303efcc8960bc79f9d6e3845a1aef662",
      "title": "What my first five Steam purchases say about me",
      "url": "https://www.theverge.com/games/760049/steam-first-five-purchases-meme-dragon-age",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T18:27:58.000Z",
      "summary_90w": "",
      "raw": "There's a meme currently going around Bluesky where people are posting their first purchases on Steam. Taking a look presents a neat time capsule, offering a glimpse of who we used to be. It also gives us a chance to compare our gaming habits now with what they were 10 or more years ago - that is, if you're one of the Olds that's been around that long. On a lark, I looked at mine and got the thrill of being able to place a date on when exactly my current life began.\nSometimes, examining your earliest Steam purchases  presents as many questions as answers. My very first Steam purchases were made on December 25th, 2010, and were all over the  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a056b9b2538821f15829507191268962fe09488f",
      "title": "Trump wants to clean up the space industry’s red tape: Here’s who wins",
      "url": "https://techcrunch.com/2025/08/15/trump-wants-to-clean-up-the-space-industrys-red-tape-heres-who-wins/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T18:09:09.000Z",
      "summary_90w": "",
      "raw": "A new executive order takes aim at the bureaucracy that the White House says is holding back American competitiveness in space.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "302682608e7a805bd9dea3957232885ac16c2192",
      "title": "Guardian Australia wins Kennedy awards for outstanding digital innovation, photography and columnist",
      "url": "https://www.theguardian.com/media/2025/aug/15/guardian-australia-wins-kennedy-awards-for-outstanding-digital-innovation-photography-and-columnist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T18:09:07.000Z",
      "summary_90w": "",
      "raw": "Leaving Gaza interactive, a portrait by Carly Earl, and columnist Ranjana Srivastava claim media accolades\n\nGet our breaking news email, free app or daily news podcast\n\nGuardian Australia has won three Kennedy awards for outstanding digital innovation, outstanding portrait photography and outstanding columnist at an industry event in Sydney.\nThe Leaving Gaza interactive, which showcased text messages exchanged between Palestinian friends – one in Gaza, one in the US – in the opening days of the Israel-Gaza war, won the innovation category.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cfd807a2be2dab14adac08ea34b3b375c9c8984f",
      "title": "One dead and several injured as Danish train hits tanker and derails",
      "url": "https://www.bbc.com/news/articles/cx235yjk3mmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T18:05:10.000Z",
      "summary_90w": "",
      "raw": "Local media report crash at railway crossing in southern Jutland involved lorry transporting farm waste.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b22b9b59b978a0b418666304e43e6b8c46e92805",
      "title": "PBS is slashing its budget in response to Trump&#8217;s attack on public media",
      "url": "https://www.theverge.com/news/760026/pbs-is-slashing-its-budget-in-response-to-trumps-attack-on-public-media",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T18:01:39.000Z",
      "summary_90w": "",
      "raw": "Now that Congress has passed a bill that will defund the Corporation for Public Broadcasting, PBS is taking drastic measures to stay alive.\nIn an email sent out to PBS station managers on Wednesday, PBS president and CEO Paula Kerger announced that the organization plans to cut its budget by 21 percent in order to offset some of the financial damage being caused by the Trump administration’s campaign to stop public media from receiving federal funding that was originally distributed by the CPB. Because of the recently passed bill, PBS, NPR, and all of both organizations’ affiliates will no longer receive the $1.1 billion that was previously set aside for them to use over the next two years.\nIn addition to the budget cuts, PBS’ board of directors also voted in favor of lowering the overall amount of dues it collects from member stations across the country by $35 million dollars — a reduction of about 15 percent from the $227 million it originally budgeted for back in June. Additionally, PBS is giving its member stations more time to plan out how they will raise the funds necessary to pay their dues, which are determined by a formula that accounts for how much nonfederal funding they receive. \nThe move to lower dues is meant to make it easier for PBS member stations — which air programming like Sesame Street, PBS News Hour, and Finding Your Roots — to deal with some of their own financial burdens. But Kerger was also clear in her memo that PBS as a whole is fighting an uphill battle to stay afloat.\n“We recognize that even with the dues reduction, adjusted payment schedule and efforts to raise funds for initial financial stabilization, we all face hard choices about the future,” Kerger said. “We are stronger together, and together, we will continue to stay focused on our mission.”\nThough the CPB is set to begin winding its operations down at the end of September, PBS and NPR — which have both historically relied on federal funding to help fund programming and pay employees — are not going away, at least, not yet. Earlier this month, NPR said that it is cutting its own budget by $8 million and using that money to set up a “fee relief” fund to help smaller member stations meet their needs. But the CPB’s dismantling is going to put a significant strain on the US’ largest public media broadcasters, particularly for smaller member stations in more rural areas across the country. In PBS’ case, this new budget cut is also likely to lead to layoffs.\n\n\nThe Trump administration has made clear that it sees public media outfits like the CPB, NPR, and PBS as bastions for an liberal bias. In an executive order signed back in May, Trump accused the organizations of failing to provide “fair, accurate, unbiased, and nonpartisan news coverage.” And now, the Department of Education has begun working more directly with The Prager University Foundation (Prager is not a real school) in a way that seems to indicate that Trump may want it to fill the void left by the CPB with content teaching children that slavery and racism aren’t so bad, actually.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4945822ee57bc7cd4a99db8a45b5fd5595696600",
      "title": "Embryos small but mighty, first live videos show",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/15/nx-s1-5498787/embryos-small-but-mighty-first-live-videos-show",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Scientists have recorded a human embryo implanting in a womb in real time.  The implications of how it happens could lead to more and better treatments for infertility.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48a1141fa81884d7ab5b4f42d2696ee1a054dade",
      "title": "Trump says he wants to see a ceasefire and ‘won’t be happy if it’s not today’  – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/15/donald-trump-vladimir-putin-meeting-anchorage-alaska-ukraine-war-europe-live-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T17:57:18.000Z",
      "summary_90w": "",
      "raw": "Trump-Putin summit live updates: US and Russian leaders to meet in Alaska to discuss ending Ukraine war\n\nUS president says Russia needs to show willingness to seriously talk about the end of the war in Ukraine, as he travels to meeting in Anchorage, Alaska\nAsked if his conversation with Trump will cover territorial issues, Trump says:\n“They’ll be discussed, but I’ve got to let Ukraine make that decision, and I think they’ll make a proper decision, but I’m not here to negotiate for Ukraine. \nI’m here to get them at a table. \n“I noticed he’s bringing a lot of business people from Russia, and that’s good.\nI like that because they want to do business, but they’re not doing business until we get the war stopped.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7969fde26fac89303ec07bf80b7875bf0f49b99",
      "title": "Iceland offers £1 reward to customers for reporting shoplifters",
      "url": "https://www.bbc.com/news/articles/c707rzen2zvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T17:34:12.000Z",
      "summary_90w": "",
      "raw": "The company estimates that shoplifting costs its business around £20m each year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d21a89b4daf74bc0cb2a4f61e9b2fdd7b352280",
      "title": "Anker’s 3-in-1 Qi2 charging station has returned to its Prime Day low",
      "url": "https://www.theverge.com/tech/759853/anker-maggo-3-in-1-qi2-charging-station-oneplus-buds-4-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T17:30:00.000Z",
      "summary_90w": "",
      "raw": "If you’ve ever juggled a phone, a smartwatch, and a pair of wireless earbuds, you know the struggle of keeping them all charged. Rather than go through the process of charging them one by one, a quality charging station can help you manage the chaos and reduce cable clutter. The Anker MagGo Wireless Charging Station is a solid option for keeping your devices charged, and it’s currently matching its all-time low of $62.99 ($27 off) at Amazon and Anker’s online storefront — the same price drop we saw during Amazon Prime Day.\nAnker MagGo Wireless Charging Station (3-in-1, Dock Stand)\n\nWhere to Buy:\n\n $89.99 $62.99 at Amazon\n $89.99 $62.99 at Anker (with code WS7DV2YB43A0)\n\nThe 3-in-1 charger features a relatively compact design that’s about the size of a coffee mug. Front and center is a MagSafe / Qi2 charging pad that can quickly charge a compatible phone with an output of up to 15W. You can adjust the pad’s angle vertically up to 45 degrees, which is handy for viewing notifications or taking video calls. Just behind the main pad is a horizontal charging spot that supports fast-charging on newer Apple Watch models, including the Apple Watch Series 10, which can be charged from 0 to 100 percent in just over an hour. Additionally, the base of the charging station has a third pad for wireless earbuds.\nIf you decide to buy Anker’s 3-in-1 charging station, you won’t need to pick up any additional accessories to get started. That’s because your purchase includes a 40W USB-C adapter and a USB-C to USB-C cable — everything you need to top off your devices.\nMore deals to check out\nIf you’ve been thinking of adding something new to your anime collection, now’s the time to do so. Crunchyroll is taking 35 percent off more than 3,000 products through August 26th as part of its summer sales event, dropping the price of everything from manga and select Blu-ray titles to figures you can display on your shelf. Crunchyroll members can save up to 15 percent more on top of the 35 percent off, making it possible to stack for even bigger savings. Not sure what to get? You can save on Blu-ray copies of Perfect Blue, Your Name, Akira, and Cowboy Bebop.\nThe OnePlus Buds 4 are currently available for an all-time low of $99.99 ($30 off) at Amazon and OnePlus. The wireless earbuds feature an AirPods Pro-esque design, with a familiar stem and silicone tips for a more secure fit. They support features like active noise cancellation, hi-res and spatial audio, and are powered by dual 11mm and 6mm drivers in each bud. Additionally, each earbud stem features concave touch controls, making it easier to feel where you’re meant to swipe and tap. Read our impressions.\nThe Verge’s Jennifer Pattison Tuohy recently went with her family to the Great Smoky Mountains National Park, where she was met by a brutal heat dome. Without AC and temperatures hovering around 100 degrees, they relied on the Koonie Camping Fan to stay cool. If you, too, are looking to beat the heat, this exact model is now 50 percent off at Amazon, dropping the price to an all-time low of $22.49 (about $22 off). The fan features a beefy 16,000mAh battery that doubles as a USB power bank, built-in lights, and a remote control. While the fan works well, it can be a bit noisy at night on its highest setting.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a48df388d6eaa5ff0e5330e7de7505103e3c393c",
      "title": "A treaty to end plastic pollution is still out of reach — that’s not necessarily a bad thing ",
      "url": "https://www.theverge.com/news/760058/plastic-pollution-treaty-negotiations-end",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T17:12:29.000Z",
      "summary_90w": "",
      "raw": "Juan Carlos Monterrey Gómez, Special Representative for Climate Change, Panama, speaks at a press conference ahead of the final INC-5.2 Negotiation plenary Session, warning negotiators that a weak treaty will fail the world. | Image: © Greenpeace / Marie Jacquemin\t\n\nThe nations of the world have been on the precipice of reaching a global agreement to curb plastic pollution for a few years now. Delegates from 184 governments met in Geneva this month to try to hammer out a final treaty, but in the end, they walked away without a deal.\nThis is not necessarily a bad thing. Delegates have missed their 2024 deadline, which was extended to this round of talks. But no deal is better than a bad deal, environmental advocates say. The big schism was over whether the treaty should phase out the use of hazardous chemicals in manufacturing and set limits to how much plastic is actually produced. Countries where plastics and fossil fuels are big business — including the US and Russia — would rather just focus on managing and recycling waste, leading to the deadlock.\n\n“We need to address unhinged plastic production.”\n\n\n“We need to address unhinged plastic production,” Juan Carlos Monterrey Gómez, a delegate from Panama, said during a Thursday press conference before negotiations came to a close. “We’re not here to simply get to a deal. We are here to end plastic pollution.” \nPlastic production has exploded since the 1950s, reaching 475 metric megatons a year by 2022. That’s the year that United Nations member states committed to developing a legally-binding agreement on plastic pollution. \nPlastics are made with fossil fuels and more than 16,000 different chemicals that leach into the environment and wind up in our air and our bodies; that’s why health advocates are calling on policymakers to pump the brakes.\nThe industry has also been facing increasing heat for peddling recycling as a solution. California filed suit against ExxonMobil last year over what it calls a “campaign of deception” about plastic recycling. It’s estimated that less than 10 percent of plastic waste has ever been recycled. The material is difficult and costly to rehash, and even products made with recycled plastic typically still need to be reinforced with freshly-made plastic. \nRecycling, as a result, can fuel more production, says Mohamed Kamal, a waste management expert and executive director of the Egypt-based foundation Greenish who attended the talks in Geneva. “Recycling is a reaction to the generation of waste. It is not a preventive method,” Kamal tells The Verge. “You would want to prevent yourself from getting injured. You wouldn’t want to get injured and then react every time.”\nA “high ambition coalition” of more than 70 nations, led by Norway and Rwanda, wants to go farther by addressing the entire lifecycle of the material, including restraining plastic production. Details on the next round of negotiations haven’t been decided yet, but they could take place later this year or next year. \n“I feel more emotional than I have in the previous negotiations,” says Jo Banner, who co-founded the nonprofit The Descendants Project with her sister and has attended all of the plastics treaty negotiations to advocate for their community in Louisiana. It’s been nicknamed “cancer alley” since it’s considered a “frontline” community to the problem. There are around 200 industrial plants in the area connected to petrochemical and plastics production. Air pollution in Louisiana has been linked to higher cancer rates, particularly in neighborhoods with a higher proportion of Black residents and with higher poverty rates. A treaty that doesn’t pay any attention to the health risks caused by plastic production wouldn’t begin to help her community heal, Banner says. \n“We are willing to go without [a treaty] than to have something that will continue to harm us,” she says. “I know it may seem like, in many ways, it is a failure. But ultimately … people from the frontline have been able to be on a global stage intervening for their communities.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "540ed76a32bd05daefc6668a16a4983f1cb1c84d",
      "title": "Some John Grisham adaptations are better than others. We ranked them",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5496326/the-rainmaker-john-grisham-the-pelican-brief-the-firm",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T17:10:23.000Z",
      "summary_90w": "",
      "raw": "A TV version of The Rainmaker is out this week, which gave critic Linda Holmes as good a reason as any to rank the on-screen adaptations of John Grisham's legal novels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e78fc99b58f131ff18bfccbf71d318e01572a227",
      "title": "Anthropic has new rules for a more dangerous AI landscape",
      "url": "https://www.theverge.com/news/760080/anthropic-updated-usage-policy-dangerous-ai-landscape",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T17:05:16.000Z",
      "summary_90w": "",
      "raw": "Anthropic has updated the usage policy for its Claude AI chatbot in response to growing concerns about safety. In addition to introducing stricter cybersecurity rules, Anthropic now specifies some of the most dangerous weapons that people should not develop using Claude.\nAnthropic doesn’t highlight the tweaks made to its weapons policy in the post summarizing its changes, but a comparison between the company’s old usage policy and its new one reveals a notable difference. Though Anthropic previously prohibited the use of Claude to “produce, modify, design, market, or distribute weapons, explosives, dangerous materials or other systems designed to cause harm to or loss of human life,” the updated version expands on this by specifically prohibiting the development of high-yield explosives, along with biological, nuclear, chemical, and radiological (CBRN) weapons.\nIn May, Anthropic implemented “AI Safety Level 3” protection alongside the launch of its new Claude Opus 4 model. The safeguards are designed to make the model more difficult to jailbreak, as well as to help prevent it from assisting with the development of CBRN weapons. \nIn its post, Anthropic also acknowledges the risks posed by agentic AI tools, including Computer Use, which lets Claude take control of a user’s computer, as well as Claude Code, a tool that embeds Claude directly into a developer’s terminal. “These powerful capabilities introduce new risks, including potential for scaled abuse, malware creation, and cyber attacks,” Anthropic writes.\nThe AI startup is responding to these potential risks by folding a new “Do Not Compromise Computer or Network Systems” section into its usage policy. This section includes rules against using Claude to discover or exploit vulnerabilities, create or distribute malware, develop tools for denial-of-service attacks, and more.\nAdditionally, Anthropic is loosening its policy around political content. Instead of banning the creation of all kinds of content related to political campaigns and lobbying, Anthropic will now only prohibit people from using Claude for “use cases that are deceptive or disruptive to democratic processes, or involve voter and campaign targeting.” The company also clarified that its requirements for all its “high-risk” use cases, which come into play when people use Claude to make recommendations to individuals or customers, only apply to consumer-facing scenarios, not for business use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61e4a61ce13c041338d2390d1da227d54d15ed26",
      "title": "Israeli unit tasked with smearing Gaza journalists as Hamas fighters – report",
      "url": "https://www.theguardian.com/world/2025/aug/15/israeli-military-unit-reportedly-tasked-with-linking-journalists-in-gaza-to-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T17:00:37.000Z",
      "summary_90w": "",
      "raw": "Israeli-Palestinian magazine says IDF ‘legitimisation cell’ set up to blunt global outrage over killing of media staff\nA special unit in Israel’s military was tasked with identifying reporters it could smear as undercover Hamas fighters, to target them and to blunt international outrage over the killing of media workers, the Israeli-Palestinian outlet +972 Magazine reports.\nThe “legitimisation cell” was set up after the 7 October 2023 Hamas attack to gather information that could bolster Israel’s image and shore up diplomatic and military support from key allies, the report said, citing three intelligence sources.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06d43ca16391a849ab9736c2e63f39e05c2f3b97",
      "title": "Lamborghini’s new plug-in hybrid is the fastest car its ever built",
      "url": "https://www.theverge.com/news/759581/lamborghini-fenomeno-phew-few-off-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Lamborghini makes fast cars; this is an indisputable fact. So when the iconic Italian automaker says it’s new plug-in hybrid is both “the most powerful V12 every built” and “the fastest Lamborghini ever,” you should pay attention. \nAt Monterey Car Week, Lamborghini unveiled its new Fenomeno plug-in hypercar that will be part of the automaker’s limited edition “Few Off” collection, which also includes notable entrants like the Sián and Countach. But before you reach for your wallet, you should know that this exclusive machine will cost a whopping $3.5 million. Just in case you’re worried about affordability.\nIf money is no option, then the Fenomeno is sure to impress when out on the track. The combination of 835cv from the naturally aspirated 6.5-liter V12 and a further 245cv from the three electric motors, the Fenomeno’s total power output registers as a blistering 1,080cv (a metric unit of horsepower that roughly translates to 1,065hp). That’s a clear step above the Revuelto’s 1,015cv (1,001hp) power output and a sign that Lamborghini’s hybrid models have some room to grow.\nThe Fenomeno also represents a record-smashing power-to-weight ratio of 1.64kg/cv, which Lamborghini says is the best in its 62-year history. Maximum torque is the same as the Revuelto: 725 Newton-meters at 6,750 rpm. And a zero to 100 kph (zero to 62mph) sprint will only take you 2.4 seconds — a tenth of a second quicker than the Revuelto. That might not mean much to the average person, but for real performance heads, every tenth of a second you can shave off makes a difference. The Fenomeno also has a top speed of more than 350 kph (218 mph).\nLamborghini says the increased power is possible thanks to the new 7kWh battery that is unique to Fenomeno. Up from 3.8kWh in the Revuelto, the new battery pack bestows the Fenomeno with a claimed driving range of just 20 km (12.4 miles) in electric-only mode, compared to just a few clicks in the Revuelto.\nThe Fenomeno features a monocoque chassis and exterior built entirely from carbon fiber, with carbon-ceramic brake discs for added stopping power. It rides on 21-inch rims at the front and 22-inch wheels on the rear, wearing Bridgestone Potenza Sport tires.\nMore aggressive in its styling than the Revuelto, the Fenomeno features two large air intakes on the hood derived from the Huracán GT3 race car, while its silhouette is inspired by the “long tail” of the track-only Lamborghini Essenza.\nNaturally, the name was chosen as a nod to Lamborghini’s iconic bull logo, the company says:\nThe name Fenomeno comes, as per Lamborghini tradition, from a very brave and famous bull fought in Morelia, Mexico, in 2002. In a bullfight between two ‘toreros’, the bull was pardoned for the exceptional qualities it demonstrated. In both Italian and Spanish, Fenomeno means “phenomenal,” symbolizing something truly exceptional and unique.\nLamborghini only plans on making 29 Fenomeno hybrids — plus one for its own collection. But the hypercar’s design is meant to serve as a “design manifesto” for future Lamborghinis. When we’ll see a fully electric Lamborghini, though, remains a bit up in the air. In 2021, the Italian automaker outlined its electrification plans, which are supposed to produce gas-electric hybrid versions of its entire lineup. Following that, Lamborghini has said it will debut its first all-electric model sometime before the end of this decade.\nWe got a sneak peek of an electric Lamborghini with the all-electric Lanzador concept in 2023. Lamborghini initially planned to launch the production version in 2028 but pushed it back until 2029. Now it’s not clear if it will even arrive as a full EV. Lamborghini is also delaying its plans for an all-electric Urus and instead plans to release a performance version of its plug-in hybrid crossover.\nIn the meantime, these ultra-quick hybrids will have to suffice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5f3cec73de48f803d4d91b9136e5a41305b7b7b7",
      "title": "Washington DC sues federal government over police takeover",
      "url": "https://www.bbc.com/news/articles/c2018769n1yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:54:21.000Z",
      "summary_90w": "",
      "raw": "The city has asked a judge to block Attorney General Bondi's order that put in place an \"emergency police commissioner\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27dad586ae21fc81e751ddeb3915d5e6972a9d7a",
      "title": "‘Hellish’: heatwave brings hottest nights on record to the Middle East",
      "url": "https://www.theguardian.com/world/2025/aug/15/hellish-heatwave-brings-hottest-nights-on-record-to-the-middle-east",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T16:49:56.000Z",
      "summary_90w": "",
      "raw": "Temperatures did not drop below 36C in Sedom, Israel on Tuesday night, while several parts of Jordan stayed above 35C on Monday\nJordan and Israel have suffered through their hottest nights on record, with nocturnal temperatures in the Levant well above levels that scientists consider “hellish”.\nTemperatures on Monday night did not go below 35C (95F) in Ghor es-Safi and Aqaba in Jordan, while in the capital, Amman, they stayed above 31.8C.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ff3e5beede45ebab646cfffcea621f42addf76b",
      "title": "CFPB staff layoffs can proceed, appeals court rules",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5403868/appeals-court-ruling-cfpb-layoffs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T16:21:49.000Z",
      "summary_90w": "",
      "raw": "The Trump administration sent reduction-in-force notices to more than 1,400 staffers at the Consumer Financial Protection Bureau in April.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5b7c6fccd2bb8bf478678cb22d8a2855819af80",
      "title": "Tensions grow as Trump and Washington, D.C. officials fight over police authority",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5503555/washington-dc-lawsuit-trump-metro-police-department",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T16:19:49.000Z",
      "summary_90w": "",
      "raw": "Tension in the nation's capital escalated over the question of who controls the city's police department after Washington, D.C.'s Attorney General sued over the White House's bid for full control.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8afffc9093501b4c9dab822ee4699259076fcba2",
      "title": "A comprehensive list of 2025 tech layoffs",
      "url": "https://techcrunch.com/2025/08/15/tech-layoffs-2025-list/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T16:08:50.000Z",
      "summary_90w": "",
      "raw": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a0cb13c918f6b5e3638bcd5a8f5289d6a9fcbadf",
      "title": "Charity boss offers Jenrick 'olive branch' over BBC row",
      "url": "https://www.bbc.com/news/articles/cwyex93wnd3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:08:40.000Z",
      "summary_90w": "",
      "raw": "The theologian who made the claim said he wanted to work with the shadow justice secretary.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb1057b5af6a72b31dffd61ccb7f942946a1a5b6",
      "title": "Epping hotel given temporary ban on taking new asylum seekers",
      "url": "https://www.bbc.com/news/articles/cp8z537ngvno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:05:15.000Z",
      "summary_90w": "",
      "raw": "A court hears housing the asylum seekers at the hotel is causing an \"unacceptable\" safety risk.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1b169e251d7803d1095175fa5759a575a52ed27",
      "title": "Suspended Labour councillor cleared of encouraging violent disorder at rally",
      "url": "https://www.bbc.com/news/articles/cjeykklwn7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:04:05.000Z",
      "summary_90w": "",
      "raw": "Ricky Jones denied encouraging violent disorder after comments at a counter-protest last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09a037ed2d107d69d9e3b285a2ea87a7c5554a00",
      "title": "Ultrahuman acquires viO HealthTech to launch enhanced cycle and ovulation tracking",
      "url": "https://techcrunch.com/2025/08/15/ultrahuman-acquires-vio-healthtech-to-launch-enhanced-cycle-and-ovulation-tracking/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Cycle and Ovulation Pro is available starting Friday as a premium PowerPlug in the Ultrahuman app for $3.99 per month or $39.99 per year for users in the U.S., U.K., EU, Australia, and Canada.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fa038f8a39c330078102b3fb381a066bef42e735",
      "title": "Israeli minister posts video online confronting Palestinian detainee in his prison cell – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/15/israel-gaza-palestinian-injured-attack-israeli-settlers-west-bank-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:56:13.000Z",
      "summary_90w": "",
      "raw": "Far-right national security minister Itamar Ben Gvir posts video showing him confronting Marwan Barghouti, who has spent more than 20 years in Israeli custody\nAt least 16 Palestinian people, including five aid seekers, have been killed in Israeli attacks on Gaza since dawn, Al Jazeera is reporting, citing medical sources.\nHere are some of the latest images being sent to us over the newswires from Gaza:\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "647975cea125e3ed7571695ecd0d86e7a4a2699c",
      "title": "ChatGPT’s mobile app has generated $2B to date, earns $2.91 per install",
      "url": "https://techcrunch.com/2025/08/15/chatgpts-mobile-app-has-generated-2b-to-date-earns-2-91-per-install/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T15:36:28.000Z",
      "summary_90w": "",
      "raw": "On average, the app is generating close to $193 million per month, up from $25 million last year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ebbbdf85db14648f720538dcda146aabd9da34cb",
      "title": "Microsoft launches inquiry into claims Israel used its tech for mass surveillance of Palestinians",
      "url": "https://www.theguardian.com/world/2025/aug/15/microsoft-launches-inquiry-claims-israel-used-tech-mass-surveillance-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:32:11.000Z",
      "summary_90w": "",
      "raw": "Company says use of its cloud technology to store millions of intercepted calls would breach terms of service\nMicrosoft has launched an “urgent” external inquiry into allegations Israel’s military surveillance agency has used the company’s technology to facilitate the mass surveillance of Palestinians.\nThe company said on Friday the formal review was in response to a Guardian investigation that revealed how the Unit 8200 spy agency has relied on Microsoft’s Azure cloud platform to store a vast collection of everyday Palestinian mobile phone calls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b97e3b550c530bbd5f2fbf4fa81c4cc21ffaf247",
      "title": "Kingsmill owner to buy Hovis to make UK bread giant",
      "url": "https://www.bbc.com/news/articles/c4gm3g2ljz1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:13:01.000Z",
      "summary_90w": "",
      "raw": "Warburtons is the current market leader and the deal needs approval from the competition watchdog.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b9300184c5d14f6baea7ed2b5752ede39788483",
      "title": "I tested a bunch of Switch 2 screen protectors, and these are the best",
      "url": "https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T15:10:59.000Z",
      "summary_90w": "",
      "raw": "This is what a Switch 2 looks like with a glossy glass protector attached to its screen. | Image: Cameron Faulkner/The Verge\t\n\nA glass screen protector is one of a few essential accessories that every Switch 2 owner should make, along with buying a protective case for the console. In fact, it should be a priority to stick one onto the console’s screen as soon as possible to avoid accidental scratches. \nI’ve been installing and removing Switch 2 screen protectors to test others on my console at an alarming rate, more than any sane person should, and here are the most important takeaways:\nDo not buy a flimsy plastic screen protector. They won’t protect your Switch 2 enough.\nIt’s impossible to tell different brands’ protectors apart once they’re on your screen; product packaging and the installation process are the biggest differences (as well as the key factors that increase cost).\nSome protectors are glossy and some are anti-reflective, each with its own tradeoffs. For my money, glossy is the way to go. The matte finish looks good, but it reduces the screen’s vivid quality and its viewing angles.\nOf the options below, it’s easiest to recommend amFilm’s three-pack of glossy screen protectors. Not only is the pack incredibly affordable ($7.19 from Amazon), but the tray also allows for perfect alignment of the glass protector for easy, bubble-free installation. I’ve used this company’s screen protectors on various gadgets for years, and I particularly like its glossy option over the matte finish, since it lets the Switch 2’s screen fully shine through.\namFilm three-pack of glossy screen protectors\nMy go-to screen protector brand for years has been amFilm. Three glossy tempered glass sheets come in the box, and the tools make installation fairly simple. JSAUX’s model is just as good based on my testing, and just as affordable.\n\nWhere to Buy:\n\n $8.65 $7.19 at Amazon\n\namFilm OneTouch two-pack of glossy screen protectors\nIn keeping up with some brands that offer faster installations, amFilm offers a two-pack of glossy protectors that includes a “OneTouch” tray. Remove the protector’s bottom film, attach the tray to your device, and then press gently on the protector until it’s fully applied.\n\nWhere to Buy:\n\n $15.99 $8.99 at Amazon\n\nDbrand Prism 2.0 two-pack of glossy screen protectors\nDbrand’s Prism 2.0 includes two glass protectors for the Switch 2, each nestled into plastic cases that fit perfectly around the edges of the console (with the Joy-Con 2 removed). $34.99 is expensive for two protectors, but if simplicity and elegant packaging trump value, then this is a good option.\n\nWhere to Buy:\n\n $34.95 at Dbrand\n\nGenki Aegis Shield two-pack of glossy screen protectors\nGenki offers a cheaper alternative to Dbrand with the Aegis Shield. It includes two protectors, and the installation process is nearly identical: just align the plastic frame with the console, pull the tab, and run your finger across the exposed section of the frame. Spigen makes a similar product that costs $24.99 for a two-pack.\n\nWhere to Buy:\n\n $19.99 at Amazon\n $19.99 at Genki\n\namFilm two-pack of matte screen protectors\nLet’s start with one of the most affordable options if you want to go the matte-textured route. AmFilm sells a two-pack of protectors at Amazon for $8.99. The set includes a plastic frame that serves as a guide to align the protector just right. JSAUX makes a similar product that’s the same price.\n\nWhere to Buy:\n\n $12.99 $9.99 at Amazon\n\namFilm OneTouch two-pack of matte screen protectors\nAmFilm also sells a two-pack with a OneTouch frame for easier installation. Again, keep in mind that opting for matte over glossy will reduce glare, but at the cost of viewing angles as well as the full vivid quality of the Switch 2’s screen. That’ll be an acceptable tradeoff for some, but not all people.\n\nWhere to Buy:\n\n $15.99 $12.99 at Amazon\n\nWhat’s coming next?\nJSAUX is launching a new screen protector in August called the Obsidian AR. I’ll be testing this model soon. The company claims that it offers vastly better glare resistance as well as enhanced brightness and color accuracy compared to standard protectors.\nUpdate, August 15th: Adjusted prices as needed, and added a link to our best Switch 2 accessories buying guide.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1369fcaa513177d0bdfbb7a1e44dbd1d909114e2",
      "title": "Sonic boom heard after RAF scrambled to incident",
      "url": "https://www.bbc.com/news/articles/c7vl8vdj225o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:08:39.000Z",
      "summary_90w": "",
      "raw": "A loud explosive sound is reported in Essex, Cambridgeshire, Suffolk, Norfolk, Kent and London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d001ddd6d9c4406583982713c9b3b2f37173765c",
      "title": "Flash floods kill nearly 200 in Pakistan and Pakistan-administered Kashmir",
      "url": "https://www.bbc.com/news/articles/cn02g0n2kepo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:04:55.000Z",
      "summary_90w": "",
      "raw": "The majority of deaths were recorded in Pakistan's mountainous Khyber Pakhtunkhwa area.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e2d9932ca8c62e791e26de1de92562e939fec30",
      "title": "Climate wars are simmering among the NSW Liberals – and they could pose a problem for Mark Speakman",
      "url": "https://www.theguardian.com/australia-news/2025/aug/16/climate-wars-are-simmering-among-the-nsw-liberals-and-they-could-pose-a-problem-for-mark-speakman",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:00:36.000Z",
      "summary_90w": "",
      "raw": "Energy policy had been an area of mostly bipartisan agreement for the NSW opposition – until now\n\nGet our breaking news email, free app or daily news podcast\n\nThe never-ending war within the Coalition over energy policy and climate targets appears to have infected the New South Wales Liberals as they struggle to restore the administration of their branch and get traction with voters.\nIt’s bad news for the NSW opposition leader, Mark Speakman, whose hold on the leadership is being increasingly questioned.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "12b98ebf9648f89e2624a1189e3eda30da2bd079",
      "title": "The economic roundtable is Jim Chalmers’ chance for bold reform. Australians can’t afford anything less | Tom McIlroy",
      "url": "https://www.theguardian.com/australia-news/2025/aug/16/the-economic-roundtable-is-jim-chalmers-chance-for-bold-reform-australians-cant-afford-anything-less",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:00:35.000Z",
      "summary_90w": "",
      "raw": "The best way to undermine claims that the productivity roundtable is a stage-managed talkfest is to make it a success\n\nGet our breaking news email, free app or daily news podcast\n\nJim Chalmers had a determined look about him this week, ahead of the government’s much-hyped economic reform roundtable in Canberra.\nThe atmosphere in the treasurer’s office was reminiscent of the days immediately before a federal budget, with frenetic activity and an air of sleep deprivation among the small army of advisers. Preparations for the three-day event have been exhaustive and Chalmers works at a pace few people in the ministerial wing can sustain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b976f08841a2312a5d6cdd62088dcf5d00d393d",
      "title": "UTS academics describe ‘culture of fear’ as enrolments put on hold for nearly a fifth of courses",
      "url": "https://www.theguardian.com/australia-news/2025/aug/16/uts-academics-describe-culture-of-fear-as-enrolments-put-on-hold-for-nearly-a-fifth-of-courses",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:00:35.000Z",
      "summary_90w": "",
      "raw": "The freeze comes as the university pursues $100m in cost cuts and after it announced in April it could axe 400 jobs\n\nGet our breaking news email, free app or daily news podcast\n\nAcademics at the University of Technology Sydney have described feelings of stress and a “culture of fear” after the educational institution temporarily paused student enrolments for nearly a fifth of its courses, leaving staff wondering if their jobs will be among the hundreds set to be axed.\nThe university has stopped taking in new students for 120 of its 615 courses, including masters degrees in teaching primary and secondary education. More than 50 of the affected courses were international study options attached to other degrees. The pause will last until the end of the autumn 2026 semester.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77f4a940fbfd14e7c515b013f6183c1d5533e71c",
      "title": "Ukraine says it has bombed Russian ship carrying drone parts at Caspian port",
      "url": "https://www.theguardian.com/world/2025/aug/15/ukraine-says-bombed-russian-ship-drone-parts-caspian-port",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:55:15.000Z",
      "summary_90w": "",
      "raw": "Attack on cargo vessel more than 500 miles from frontline is show of force before Trump-Putin meeting\n\nTrump-Putin summit – live updates\n\nUkraine says it has conducted a long-range drone attack on a supply ship that it claims was carrying drone components from Iran, striking it at a port north of the Caspian Sea, in a show of force hours before Donald Trump and Vladimir Putin meet for a summit in Alaska.\nPhotographs showed a partially sunken cargo vessel at Olya, near Astrakhan, more than 500 miles from the frontline. Ukraine’s military claimed credit for the attack and the overnight bombing of an oil refinery at Samara on the Volga River, deep inside Russia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de57e48e82067d83f002b0deebf13cef534a96bf",
      "title": "Far-right Israeli minister taunts jailed Palestinian leader in prison visit",
      "url": "https://www.theguardian.com/world/2025/aug/15/far-right-israel-minister-itamar-ben-gvir-taunts-jailed-palestinian-leader-marwan-barghouti-in-prison-visit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:48:15.000Z",
      "summary_90w": "",
      "raw": "Itamar Ben-Gvir posts video footage showing him making threatening remarks to a gaunt Marwan Barghouti\nIsrael’s national security minister, Itamar Ben-Gvir, has posted video footage in which he is seen taunting the imprisoned Palestinian leader Marwan Barghouti in jail, prompting strong condemnation from Barghouti’s family and Palestinian leaders.\nThe 13-second clip shows Ben-Gvir, a far-right politician on whom the UK and several other countries imposed sanctions this year for incitement to violence against Palestinians, making threatening remarks to Barghouti while Israel’s prisons minister, Kobi Yaakobi, an ally of Ben-Gvir stands nearby.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be21839a8e7356ba04c634fe074badf98124abf3",
      "title": "Louisiana attorney general sues Roblox",
      "url": "https://techcrunch.com/2025/08/15/louisiana-attorney-general-sues-roblox/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T14:43:20.000Z",
      "summary_90w": "",
      "raw": "The lawsuit points to several sexually explicit experiences that were on the platform, including “Escape to Epstein Island,” “Diddy Party,” and “Public Bathroom Simulator Vibe.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f73f9282222e9b09b1010a5c6e585fd4f03a04",
      "title": "Meet the first batch of VCs set to judge Startup Battlefield 200 at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/15/meet-the-first-batch-of-vcs-set-to-judge-startup-battlefield-200-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Startup Battlefield 200 is the crown jewel of TechCrunch Disrupt. From thousands of applicants, only the top 20 will take the Stage at Disrupt 2025 (October 27-29, San Francisco) to pitch their vision to panels of top-tier VCs in front of a live audience. Every contender is chasing game-changing impact — and we’re here for the drama, the breakthroughs, and the big reveals.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "714aee6c8c4d3884f7c5dd66678fdd051c1bc887",
      "title": "'About our lives, but without our voice': Sidelined Ukrainians look on",
      "url": "https://www.bbc.com/news/articles/cm21l237pkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T13:38:03.000Z",
      "summary_90w": "",
      "raw": "Left uninvited to key talks, many Ukrainians look on with a mix of fatigue and mistrust.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "714aee6c8c4d3884f7c5dd66678fdd051c1bc887",
      "title": "Sidelined Ukrainians look on with deep scepticism",
      "url": "https://www.bbc.com/news/articles/cm21l237pkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T13:38:03.000Z",
      "summary_90w": "",
      "raw": "Left uninvited to key talks, many Ukrainians look on with a mix of fatigue and mistrust.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41a35b9196d3629dbd6572cb7d7e8e91e0847fcb",
      "title": "Emmanuel Macron decries ‘antisemitic hatred’ after memorial tree cut down",
      "url": "https://www.theguardian.com/world/2025/aug/15/emmanuel-macron-decries-antisemitic-hatred-after-memorial-tree-cut-down",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T13:09:16.000Z",
      "summary_90w": "",
      "raw": "French president vows to punish those who felled tree planted in memory of Jewish man tortured to death in 2006\nThe felling of an olive tree planted in memory of a young French Jewish man tortured to death in 2006 caused outrage in France on Friday, with Emmanuel Macron promising to punish an act of “antisemitic hatred”.\nPoliticians across the political spectrum condemned the felling as an attack against the memory of Ilan Halimi, who was kidnapped by a gang of about 20 young people in January 2006 and tortured on a low-income housing estate in the southern Paris suburb of Bagneux.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd8c53cabfe9ae1d5cfba3fe397e824816a71ec5",
      "title": "Putin ready to make Ukraine deal, Trump says before Alaska summit",
      "url": "https://www.theguardian.com/world/2025/aug/14/keir-starmer-to-meet-volodymyr-zelenskyy-in-downing-street",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T12:34:29.000Z",
      "summary_90w": "",
      "raw": "US president’s comment that Russian and Ukrainian leaders may have to ‘divvy’ things up likely to raise alarm\nDonald Trump has said he believes Vladimir Putin is ready to make a deal on the war in Ukraine as the two leaders prepare for their summit in Alaska on Friday, but his suggestion that the Russian leader and Volodymyr Zelenskyy could “divvy things up” may alarm some in Kyiv.\nThe US president, who left the White House on Friday at 7.30am, implied there was a 75% chance of the Alaska meeting succeeding, and that the threat of economic sanctions may have made Putin more willing to seek an end to the war. “HIGH STAKES!!!” he posted on Truth Social as his motorcade idled outside the White House shortly after sunrise in Washington.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1a029866fea3f1dcc27da99ff9c74914aaa9e19",
      "title": "Far-right Israeli minister taunts prominent Palestinian prisoner",
      "url": "https://www.bbc.com/news/articles/cqxg3xg8xyyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T12:16:50.000Z",
      "summary_90w": "",
      "raw": "Video shows Itamar Ben Gvir telling the most prominent Palestinian prisoner Marwan Barghouti \"you will not win\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1a029866fea3f1dcc27da99ff9c74914aaa9e19",
      "title": "Far-right Israeli minister taunts prominent Palestinian prisoner in his cell",
      "url": "https://www.bbc.com/news/articles/cqxg3xg8xyyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T12:16:50.000Z",
      "summary_90w": "",
      "raw": "Video shows Itamar Ben Gvir telling the most prominent Palestinian prisoner Marwan Barghouti \"you will not win\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "759e10855f992444cf657763f4adb57a019bd988",
      "title": "Global plastic talks collapse as countries remain deeply divided",
      "url": "https://www.bbc.com/news/articles/cvgpddpldleo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:57:06.000Z",
      "summary_90w": "",
      "raw": "The latest round of UN-led talks have ended in deadlock, with disputes over plastic production and recycling.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53b261e7bae13147ad2dcd8d29def65fe4705e3d",
      "title": "Spain at 'extreme risk' of new wildfires as 14 blazes spread",
      "url": "https://www.bbc.com/news/articles/crevxg4yl37o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:53:05.000Z",
      "summary_90w": "",
      "raw": "Temperatures remain high across southern Europe with wildfires also affecting Portugal, Greece, France and the Balkans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8af381f97959af15a2684e72fd463cda886a5314",
      "title": "'It's coming home' - the undignified row over the body of Zambia's ex-president",
      "url": "https://www.bbc.com/news/articles/clyv68324zgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:39:28.000Z",
      "summary_90w": "",
      "raw": "Edgar Lungu, who died in June, is yet to be buried - the debate over what next exposes deep divisions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cca514fd7d1872c62bf128dda8030875c50dee3a",
      "title": "USSR sweatshirt and chicken kyiv: Russia dials up trolling before Alaska summit",
      "url": "https://www.theguardian.com/world/2025/aug/15/ussr-sweatshirt-and-chicken-kyiv-russia-dials-up-trolling-before-alaska-summit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:23:56.000Z",
      "summary_90w": "",
      "raw": "Foreign minister’s attire and inflight menu for Russian media are latest in series of provocations towards Ukraine\n\nTrump-Putin summit – live updates\n\nIn a not-so-subtle act of trolling, Russia’s foreign minister, Sergei Lavrov, arrived in Alaska on the eve of the US–Russia summit wearing a sweatshirt emblazoned with “CCCP”, the Russian initials for the USSR.\nOnce seen in western capitals as a pragmatic and skilled diplomat, the 75-year-old has in recent years mirrored the Kremlin’s radicalised politics, adopting an increasingly combative tone and resorting to trolling and mockery.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70f5435aab01c943f26d5a0ebd8e17d235b8741f",
      "title": "What to know ahead of Trump-Putin summit. And, Texas Democrats could end boycott",
      "url": "https://www.npr.org/2025/08/15/g-s1-82812/up-first-newsletter-putin-trump-summit-texas-democrats-crime-crackdown-left-leaning-communities",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T11:07:26.000Z",
      "summary_90w": "",
      "raw": "Trump and Putin meet in Alaska today. Here's what you need to know before the summit. And, Texas Democrats could end their boycott if California also begins redistricting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3a291ece92ac651260ac1e5f727c31c4bdb9e8b",
      "title": "Sturgeon book reignites trans row with JK Rowling",
      "url": "https://www.bbc.com/news/articles/cd6n78z1d34o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T10:13:26.000Z",
      "summary_90w": "",
      "raw": "In her memoir, Sturgeon complains about the Harry Potter author posting a selfie in a T-shirt branding her a \"destroyer of women's rights\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89e6b7dc66b19ad27e6c9791b597260be84fce9a",
      "title": "Online fashion retailer Shein’s UK sales leap by a third to more than £2bn",
      "url": "https://www.theguardian.com/business/2025/aug/15/online-fashion-retailer-shein-uk-sales-leap-by-a-third-to-more-than-2bn",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T10:09:20.000Z",
      "summary_90w": "",
      "raw": "Profits rise 56% to £38.2m in 2024 as company overtakes British rival Boohoo and closes in on Asos\nShein, the online fast-fashion retailer founded in China, increased sales in the UK by about a third to more than £2bn last year, overtaking the British rival Boohoo and closing in on Asos.\nThe company, which had been considering a £50bn float on the London Stock Exchange but is expected to list in Hong Kong, said profits rose 56% to £38.2m last year on which it paid £9.6m corporation tax, according to accounts filed at Companies House this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d433daa9d7e7dc43ff5cf3e6f3cdfcd3b097486",
      "title": "Weather tracker: Typhoon Podul pounds southern Taiwan",
      "url": "https://www.theguardian.com/environment/2025/aug/15/weather-tracker-typhoon-podul-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T09:47:14.000Z",
      "summary_90w": "",
      "raw": "One person dies after storm whips up waves, while temperatures approach 50C as heatwave grips Middle East\nTyphoon Podul crossed southern Taiwan on Wednesday with wind speeds of up to 110mph (177km/h), equivalent to a category 2 hurricane.\nPodul had developed a week earlier, near the Northern Mariana Islands, and tracked west across the Philippine Sea, achieving typhoon status on Tuesday before making landfall in south-east Taiwan the following day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b0eaa1f767a70f05cd15af35ad2324a0e0f94ba",
      "title": "Chinook helicopter was on 'show flight' when it crashed killing 29, ex-RAF pilot says",
      "url": "https://www.bbc.com/news/articles/c04rg3l3y64o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T09:42:45.000Z",
      "summary_90w": "",
      "raw": "Four crew and 25 passengers were killed when an RAF Chinook struck a hillside in foggy conditions over the Mull of Kintyre in 1994.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ace638f6d6859af8bed04540ff3e15de9eb0d5a",
      "title": "In Houston, some worry their problems would be neglected after redistricting",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502654/texas-redistricting-trump-midterm-elections",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In one neighborhood of the city, Latinos worry about immigration and urban problems but may soon be grouped in with suburban voters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5365702b06a0d3249addfa344a2ad7b4eddb852b",
      "title": "Man arrested over Sydney airport scuffle back in custody after alleged assault at Central train station",
      "url": "https://www.theguardian.com/australia-news/2025/aug/15/man-arrested-over-sydney-airport-scuffle-back-in-custody-after-alleged-assault-at-central-train-station",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T08:36:10.000Z",
      "summary_90w": "",
      "raw": "Nicholas Teplin, 41, allegedly struck three men on Thursday afternoon, a day after airport arrest during which a police gun accidentally fired\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA Victorian man involved in an airport scuffle in which a police gun was accidentally fired is back in custody for allegedly assaulting several people the next day.\nNicholas Teplin, 41, faced a court on Friday on allegations he hit three men in the head at Sydney’s Central railway station and then shoved a police officer while in custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e3c7af582402c98fdfac1e7cbe1bf395b9bfd9f",
      "title": "My family may be killed if deported, says son of Afghan caught in UK data breach",
      "url": "https://www.bbc.com/news/articles/c776zgj73lpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T08:22:31.000Z",
      "summary_90w": "",
      "raw": "Documents seen by the BBC suggest he was part of a special forces unit who worked with the British in Afghanistan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e68c7dd3ae1075b18a9d052166b5c7d19acaee9",
      "title": "Celebrities are marketing products directly to their fans",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502704/celebrities-are-marketing-products-directly-to-their-fans",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T08:13:25.000Z",
      "summary_90w": "",
      "raw": "Stars are starting their own companies and marketing products directly to their fans. We talked to people following and making these deals, including John Legend who started his own skincare brand.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7a6c4565740cea489d8be97d249c1a14588628f1",
      "title": "In maps: The war-ravaged Ukrainian territories at the heart of the summit",
      "url": "https://www.bbc.com/news/articles/cgkrn433lk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T07:30:17.000Z",
      "summary_90w": "",
      "raw": "Kyiv has rejected ceding territory seized by Russia to secure a ceasefire.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a6c4565740cea489d8be97d249c1a14588628f1",
      "title": "In maps: The war-ravaged Ukrainian territories at the heart of the Trump-Putin summit",
      "url": "https://www.bbc.com/news/articles/cgkrn433lk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T07:30:17.000Z",
      "summary_90w": "",
      "raw": "Kyiv has rejected ceding territory seized by Russia to secure a ceasefire.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab9355e1bbff91d36fa84ea2a1d0e70cbadaa733",
      "title": "The nepo baby premium, frothing markets, and Apple vs. Apples",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502731/the-nepo-baby-premium-frothing-markets-and-apple-vs-apples",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T07:00:00.000Z",
      "summary_90w": "",
      "raw": "It’s … Indicators of the Week! Our rapid run through the numbers you need to know.  \nOn today’s episode: John Legend croons; CPI inflation soothes; Same job as mom? You’ll earn more, dude; Apple vs. Apple, a courtroom feud. \nRelated episodes: \nWhy every A-lister also has a side hustle \nThe DOJ's case against Apple \nThe Intergenerational Transmission of Employers and the Earnings of Young Workers\nGenerational Wealth: How High Earners Help Their Children’s Careers\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.  \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8d95c4ff8f1b7e3dc2da1ab25cb66c30eb31a82e",
      "title": "Suspected French spy arrested in alleged Mali coup plot ",
      "url": "https://www.bbc.com/news/articles/cj9w7dg3pr4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T06:52:07.000Z",
      "summary_90w": "",
      "raw": "The French national is accused of working \"on behalf of the French intelligence service\" in Mali.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f964d68d588d6f8ccd5054a446462c6ea8b0108a",
      "title": "What do Alaskans make of the geopolitical circus arriving? ",
      "url": "https://www.bbc.com/news/articles/c7541g6d191o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T05:58:24.000Z",
      "summary_90w": "",
      "raw": "The city of Anchorage is set to host a meeting that could re-shape Europe and global security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80bf0549fc282bd51d701edd8bd8b21bef969f93",
      "title": "'It makes me feel horrible': Female PC goes undercover as runner to catch catcallers",
      "url": "https://www.bbc.com/news/articles/cz0y8r141pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T05:13:27.000Z",
      "summary_90w": "",
      "raw": "Surrey Police's campaign sees female police officers go out for runs, with uniformed officers nearby to intervene if they are harassed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8fb10fb888a15be2fb114905aee712fdf7a41e0b",
      "title": "Climate crisis harming world heritage painted houses in Burkina Faso, say residents",
      "url": "https://www.theguardian.com/environment/2025/aug/15/climate-crisis-harming-world-heritage-painted-houses-tiebele-in-burkina-faso-say-residents",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T05:00:23.000Z",
      "summary_90w": "",
      "raw": "Tiébélé’s wavy-walled houses covered in geometric lines showing signs of disintegration amid erratic weather\nA world heritage site that was once a famous tourist destination is suffering from signs of disintegration, as climate change affects weather patterns.\nThe wavy-walled houses covered with singular geometric lines of the Royal Court of Tiébélé in Burkina Faso, established in the 16th century, are recognisable all over the world. The paintings represent the thoughts, culture, and religion of the Kassena people, literally written on the walls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb0350455a24158e1fee1b42d21f4e578e460d25",
      "title": "'Putin is a master of persuasion' - BBC correspondents discuss summit strategy",
      "url": "https://www.bbc.com/news/videos/c6205ezp6nlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T03:35:15.000Z",
      "summary_90w": "",
      "raw": "The BBC’s US and Russia correspondents outline the leaders' different approaches to the high stakes summit on the Ukraine war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba580e7d06fd2721fa7f8fe1271c85e20ec0c533",
      "title": "Hundreds hit with food poisoning in Indonesia after eating free meals from president’s flagship program",
      "url": "https://www.theguardian.com/world/2025/aug/15/hundreds-struck-by-poisoned-in-indonesia-after-eating-free-meals-from-presidents-flagship-program",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T01:48:11.000Z",
      "summary_90w": "",
      "raw": "Since its launch in January, Prabowo Subianto’s signature policy has been marred by mass food poisoning cases affecting over 1,000 people\nMore than 360 people fell ill in the Indonesian town of Sragen in Central Java after consuming school lunches, according to officials, in the largest food poisoning case to hit President Prabowo Subianto’s flagship free meals programme to date.\nSince its launch in January, the free school meals programme has been marred by mass food poisoning cases across the archipelago, affecting more than 1,000 people.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54abaeea3fae8face0da9743c19cb9906089950a",
      "title": "Bowen: Netanyahu is presiding over a divided Israel - the fault lines are now chasms",
      "url": "https://www.bbc.com/news/articles/c3r441zyw27o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T23:33:47.000Z",
      "summary_90w": "",
      "raw": "Jeremy Bowen travelled through Israel to hear views from all sides - from protesters in 'psychological despair' over Gaza, to those who feel an overwhelming sense that their country's actions are justified.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0dd3f49325b8f29acc7f0340cf4eacb3e8ceb8e",
      "title": "What do Putin and Trump each want from the Alaska summit?",
      "url": "https://www.bbc.com/news/articles/c776ddjer8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T23:26:20.000Z",
      "summary_90w": "",
      "raw": "The Russian leader senses a chance for more international recognition, while his American counterpart hopes to play peacemaker.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af9e8bd4a508386bfe81194164a006827717a47",
      "title": "'We were never friends': A massacre on the eve of WW2 still haunts China-Japan relations",
      "url": "https://www.bbc.com/news/articles/cp89ed9j5ygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T22:09:30.000Z",
      "summary_90w": "",
      "raw": "Eighty years after Japan was defeated, a wave of Chinese films about the  occupation are fuelling memory and anger.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efb53e34c0c0115f5bc19bc8b3b76f4757d86fc1",
      "title": "Trump turns up the heat on CEOs and private companies",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5499368/trump-turns-up-the-heat-on-ceos-and-private-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T20:54:02.000Z",
      "summary_90w": "",
      "raw": "Corporate America doesn't want to fight with President Trump in public. But as a result, it's ceding him an unprecedented amount of control over the shape — and future — of U.S. business.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "58317c20d65f7e97b048b1aed22731c6d41f755b",
      "title": "US government is reportedly in discussions to take stake in Intel",
      "url": "https://techcrunch.com/2025/08/14/u-s-government-is-reportedly-in-discussions-to-take-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T20:38:20.000Z",
      "summary_90w": "",
      "raw": "This deal would be meant to help Intel bulk up its U.S. chip manufacturing, including its much-delayed Ohio factory.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8de5706d62e1695f8815e2a6a51f4dcaf3caba30",
      "title": "Israeli settlement plans will 'bury' idea of Palestinian state, minister says",
      "url": "https://www.bbc.com/news/articles/ckgdzxpkdd7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T19:36:37.000Z",
      "summary_90w": "",
      "raw": "Far-right Israeli minister Bezalel Smotrich announced approval for 3,401 new homes in the controversial E1 area project in the occupied West Bank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b496f6ddb830a6861f17c48a354336ffcc3871a",
      "title": "What is Bluesky? Everything to know about the X competitor",
      "url": "https://techcrunch.com/2025/08/14/what-is-bluesky-everything-to-know-about-the-x-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:59.000Z",
      "summary_90w": "",
      "raw": "We’ve compiled the answers to some of the most common questions users have about Bluesky.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7cedea8287c90818e33157aacce663554f41001",
      "title": "The wait is almost over: The 2025 Startup Battlefield 200 list drops August 27",
      "url": "https://techcrunch.com/2025/08/14/the-wait-is-almost-over-the-2025-startup-battlefield-200-list-drops-august-27/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:46.000Z",
      "summary_90w": "",
      "raw": "After reviewing thousands of groundbreaking applications from around the globe, TechCrunch is just days away from announcing the 2025 Startup Battlefield 200.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "467fd47571f03b8203e74e00039e862ea2b2abf4",
      "title": "Bluesky rolls out massive revamp to policies and Community Guidelines",
      "url": "https://techcrunch.com/2025/08/14/bluesky-rolls-out-massive-revamp-to-policies-and-community-guidelines/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:49:58.000Z",
      "summary_90w": "",
      "raw": "Some of the changes represent an effort by Bluesky to purposefully shape its community and the behavior of its users, nudging them to be nicer and more respectful of others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e26e1583258bda8942994aff606848d94e37766c",
      "title": "Norway spy chief blames Russian hackers for hijacking dam",
      "url": "https://techcrunch.com/2025/08/14/norway-spy-chief-blames-russian-hackers-for-hijacking-dam/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:32:02.000Z",
      "summary_90w": "",
      "raw": "The Russian hackers used their access to the dam's computer systems to open a floodgate that spilled millions of gallons of water.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "421e772239efc79b6bf7f88def1109151bef74df",
      "title": "Cohere hits a $6.8B valuation as investors AMD, Nvidia, and Salesforce double down",
      "url": "https://techcrunch.com/2025/08/14/cohere-hits-a-6-8b-valuation-as-investors-amd-nvidia-and-salesforce-double-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T17:40:27.000Z",
      "summary_90w": "",
      "raw": "Cohere's market proposition has always been to offer secure LLMs specifically geared for enterprise use, not for consumers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2deef6e45599cc3630640a2ba9dbdb673997e6a",
      "title": "Melania Trump threatens to sue Hunter Biden for $1bn over Epstein claim",
      "url": "https://www.bbc.com/news/articles/cqjyw0l9d82o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T17:21:01.000Z",
      "summary_90w": "",
      "raw": "The first lady's lawyer has demanded that Joe Biden's son retract claims he made about how she met her husband.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17869ae56d5f28d47c5baaa85e7dd9d125214732",
      "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/14/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T17:05:41.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5782abee4feef22bf79db80afbc62e77940a236e",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/14/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T16:55:27.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4bb7fbbf22261c69523d382527bfb7191ed2fb96",
      "title": "Blackwater founder Erik Prince to send hundreds of fighters to strife-torn Haiti",
      "url": "https://www.theguardian.com/world/2025/aug/14/erik-prince-blackwater-haiti",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:19:48.000Z",
      "summary_90w": "",
      "raw": "Critics say Vectus Global’s presence – including snipers – will undermine Haiti’s police and UN security force\nHundreds of combatants from the US, Europe and El Salvador will reportedly be deployed to Haiti in the coming weeks to battle the country’s gangs as part of a mission led by the controversial Blackwater founder and Donald Trump backer Erik Prince.\nAccording to Reuters, Prince’s new security firm, Vectus Global – which has been operating in the violence-ravaged Caribbean country since March – is preparing to intensify its activities there to help authorities win key roads and territories back from heavily armed criminal groups.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb7740c574fe5c26e6a4a4f6088a00a2dd90b12a",
      "title": "FBI returns stolen document signed by conquistador Hernán Cortés to Mexico",
      "url": "https://www.theguardian.com/world/2025/aug/14/hernan-cortes-document-mexico",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:04:07.000Z",
      "summary_90w": "",
      "raw": "US officials did not say who had the 16th-century page that was missing from Mexico’s archives for decades\nNearly five centuries after Spanish conquistador Hernán Cortés signed it and decades after someone swiped it from national archives, a priceless manuscript page has been returned by the FBI to Mexico.\nThe document contains a detailed accounting of the logistics related to Cortés’s journey to what eventually became New Spain – a territory that stretched from Central America to modern-day Washington state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e48ae59632c9a0b2556a51ef30df83c860244986",
      "title": "Ice deported boy with cancer and two other US citizen children to Honduras, suit alleges",
      "url": "https://www.theguardian.com/us-news/2025/aug/14/ice-lawsuit-louisiana-immigration-deportation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T14:22:55.000Z",
      "summary_90w": "",
      "raw": "Suit filed in Louisiana says agency didn’t give parents choice as to whether children should be deported with them\nA lawsuit filed in Louisiana on behalf of two mothers and their four minor children, including one with cancer, claims the two families were unlawfully denied due process and deported by US Immigration and Customs Enforcement (Ice) to Honduras in April 2025.\nThe lawsuit, which names the attorney general, Pam Bondi, Department of Homeland Security secretary, Kristi Noem, and various Ice officials as defendants, alleges Ice violated its own policies, and multiple federal laws, when officers secretly detained the families, denied access to counsel and swiftly deported them to Honduras, ignoring legal filings.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6befc5e77a703e2b37e89f0330b9cb6c5d85306",
      "title": "Ancient manuscripts return to Timbuktu 13 years after jihadist takeover",
      "url": "https://www.theguardian.com/world/2025/aug/14/timbuktu-manuscripts-taken-to-bamako-to-protect-them-from-jihadist-militants-returned",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T13:37:28.000Z",
      "summary_90w": "",
      "raw": "Malian city welcomes return of hundreds of crates of treasures after more than a decade stored in capital Bamako\nPolitical and religious figures in Malian city of Timbuktu have welcomed the return of ancient manuscripts that were removed to the capital, Bamako, more than a decade ago to prevent them from falling into the hands of militants linked to al-Qaida.\nAccording to a UN expert mission, jihadists destroyed more than 4,000 manuscripts and as many as nine mausoleums after occupying the desert city in 2012. Workers at the state-run Ahmed Baba Institute used rice sacks to smuggle the remaining documents out of the city a number of ways, including by donkey cart and motorcycle.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07e2fb3d7a071addf5c174da282f45b453e95695",
      "title": "BBC defends investigation of Kenya child-sex trafficking after 'hoax' claims",
      "url": "https://www.bbc.com/news/articles/cvgnkdpl49ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T13:16:46.000Z",
      "summary_90w": "",
      "raw": "The exposé was in the \"public interest\", the BBC says, following criticism from senior Kenyan politicians.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "053ff63f1757981ceff6df959b55d139d127bfe4",
      "title": "Baby Shark: South Korean court rejects US composer’s claim song was plagiarised",
      "url": "https://www.theguardian.com/world/2025/aug/14/baby-shark-song-south-korean-court-rejects-us-composers-claim-catchy-tune-was-plagiarised",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T12:41:28.000Z",
      "summary_90w": "",
      "raw": "Ruling upheld that there was insufficient evidence of copyright infringement on song that is YouTube’s most viewed video\nSouth Korea’s supreme court has rejected a US composer’s allegation that the producers of the catchy children’s song Baby Shark plagiarised his work, ending a six-year-long legal battle.\nThe court upheld two lower court verdicts in favour of Pinkfong, the South Korean company behind the tune with the famous “doo doo doo doo doo doo” refrain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47d042641809b37e01d39fb4dd03cf37b92adfda",
      "title": "Sheinbaum’s expulsion of criminals is more about placating Trump than keeping Mexico safe",
      "url": "https://www.theguardian.com/world/2025/aug/14/mexico-sheinbaum-cartel-extradition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T11:00:43.000Z",
      "summary_90w": "",
      "raw": "Perhaps not coincidentally, the timing of tariff discussions was closely followed by the transfer of wanted criminals\nMexico’s president, Claudia Sheinbaum, has denied that the transfer of 26 alleged cartel members to the United States was part of any kind of deal with Washington and was instead about her country’s own security priorities.\nThis week’s expulsion marked the second time Mexico had sent top criminals to the US this year: in February, Mexican authorities handed over 29 cartel members, including druglord Rafael Caro Quintero, who was responsible for the murder of a DEA agent in 1985. The latest transfers took place after US authorities vowed that prosecutors would not seek the death penalty in any of the cases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32fd75a9e5b0814bcb0ab21569b3a58fb3271b60",
      "title": "Dozens of migrants killed after boats capsize off Italian coast ",
      "url": "https://www.bbc.com/news/articles/cn02g5w39jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T10:31:48.000Z",
      "summary_90w": "",
      "raw": "More than 700 have died crossing the central Mediterranean in 2025, according to the UN reugee agency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a488f310d7c27a78662cdbe9036113e1e860d0a",
      "title": "Argentina rocked as contaminated medical fentanyl kills up to 96 patients",
      "url": "https://www.theguardian.com/world/2025/aug/14/argentina-contaminated-fentanyl",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T10:00:41.000Z",
      "summary_90w": "",
      "raw": "Dozens of hospital patients treated with opioid for unrelated conditions suffered serious bacterial infections\nAs many as 96 people are now thought to have died in Argentina after being treated with medical-use fentanyl that was tainted with bacteria.\nThe official death toll stands at 87, and a judicial source has told the Buenos Aires Herald that nine further deaths are under investigation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "446014e63d6f5af3726d2c5bd66e68553431539a",
      "title": "FBI returns stolen conquistador document to Mexico",
      "url": "https://www.bbc.com/news/articles/c62we83d1lno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:53:45.000Z",
      "summary_90w": "",
      "raw": "The document, signed by Hernán Cortés in 1527, is thought to have been taken over three decades ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38a804d9f28369b6fdef65b1b09d31c65623cf53",
      "title": "Watch: Passengers escape car hit by drone in Russia",
      "url": "https://www.bbc.com/news/videos/cwypkvpdz3eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:39:38.000Z",
      "summary_90w": "",
      "raw": "CCTV captured the moment a car was hit by a Ukrainian drone in the Russian city of Belgorod, governor Vyacheslav Gladkov said in his official Telegram channel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e8843b0baa539760fd10984836e3f8ccfbaa73a",
      "title": "Relationship and new album - what we learned from Taylor Swift on Travis Kelce's podcast",
      "url": "https://www.bbc.com/news/articles/cedv5dy9v8lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:27:37.000Z",
      "summary_90w": "",
      "raw": "The pop superstar gives a rare insight into their life together and reveals details of her new album.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "137a8e7adcf9d66b044b04039eaa11c281b3165f",
      "title": "German states debate who invented Bratwurst sausages",
      "url": "https://www.bbc.com/news/articles/cq8735exn80o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:26:36.000Z",
      "summary_90w": "",
      "raw": "The German states of Bavaria and Thuringia are embroiled in a row over who can lay claim to inventing the Bratwurst.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3fd322f5902f1da2878d9d8806202af274ecc77",
      "title": "'Our children are dying': Rare footage shows plight of civilians in besieged Sudan city",
      "url": "https://www.bbc.com/news/articles/czxp0qyn6dqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:16:38.000Z",
      "summary_90w": "",
      "raw": "Parents are struggling to feed their children in war-hit Sudan's Darfur region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed04f77081b68c78ccd53fd7d85a9352a74c1786",
      "title": "Why every A-lister also has a side hustle",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501492/why-every-a-lister-also-has-a-side-hustle",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T07:00:03.000Z",
      "summary_90w": "",
      "raw": "Seemingly every celebrity has their own brand these days, whether it’s booze (Cameron Diaz, Matthew McConaughey) or cosmetics (Selena Gomez, Lady Gaga) or squeezy food pouches (Jennifer Garner). Today on the show, what is fueling the celebrity business bonanza? We hear from two legendary singers, Lisa Loeb AND John Legend, who are pursuing ventures outside of show business. \nRelated episodes: \nThe celebrity crypto nexus \nThe Olympian to influencer pipeline (Apple / Spotify)\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "60ef19ca2852e9f60dc3882df7aa7d376cad06bd",
      "title": "US warns of additional tariffs on India if Trump-Putin peace talks fail",
      "url": "https://www.bbc.com/news/articles/c776zrmy5jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T06:27:29.000Z",
      "summary_90w": "",
      "raw": "US Treasury chief says Washington could increase secondary tariffs on India if talks don't go well in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62ffbad25af882bec8907ea4ada94a73d7fe6e46",
      "title": "Watch: Meteor shower seen in skies above UK",
      "url": "https://www.bbc.com/news/videos/cvgnkmpkd77o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T01:55:07.000Z",
      "summary_90w": "",
      "raw": "The astronomical event was captured on camera at North York Moors National Park on 13 August.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4eef0749e5758fa85b6029c1237063dc7ecae1a",
      "title": "Australia and Vanuatu agree to $328m security and business deal ",
      "url": "https://www.bbc.com/news/articles/c8ry0l045myo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T01:13:36.000Z",
      "summary_90w": "",
      "raw": "Australia is trying to grow its influence in the Pacific region, to counter China's increased power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cb7c206284f9d9097dfd1ca27e8741a341349f3",
      "title": "Jimmy Lai trial: closing arguments in Hong Kong delayed by aftermath of Typhoon Podul",
      "url": "https://www.theguardian.com/world/2025/aug/14/jimmy-lai-trial-hong-kong-closing-arguments",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T23:33:52.000Z",
      "summary_90w": "",
      "raw": "Lai has been detained since December 2020, with western nations and rights groups calling for his release\nThe closing arguments in the national security trial against jailed Hong Kong media mogul Jimmy Lai were postponed on Thursday after the Asian financial hub issued its highest-level “black” weather warning, stemming from ex-typhoon Podul.\nQueues had formed outside the court for the public gallery, but torrential rain saw the closing arguments in the trial, which began in late 2023, delayed. Proceedings are expected to resume on Friday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf58767402e72f72fd0baa8c979c57722aafac07",
      "title": "Chemistry on trial: How a professor tried to convince a court she didn’t kill her husband",
      "url": "https://www.bbc.com/news/articles/c0r77qezg09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T21:21:44.000Z",
      "summary_90w": "",
      "raw": "While the accused mounted a self-argued defence using science, the court found her guilty of murder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f4106dc65521c3ec88052a2e68475b9b666a45e5",
      "title": "US warships patrol South China Sea after two Chinese ships collide",
      "url": "https://www.theguardian.com/world/2025/aug/13/us-warships-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T17:00:03.000Z",
      "summary_90w": "",
      "raw": "USS Higgins and USS Cincinnati sailed near Scarborough Shoal after Chinese tried to drive away Philippine vessel\nThe US has briefly deployed two warships in a disputed South China Sea shoal where two Chinese ships collided earlier in the week while trying to drive away a smaller Philippine ship in a high-seas accident that raised alarms about maritime safety.\nBoth China and the Philippines claim Scarborough Shoal and other outcroppings in the South China Sea. Vietnam, Malaysia, Brunei and Taiwan also lay overlapping claims in the contested waters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "829ac3fbd98d53cfadf9e76a9cccdd391cf6a96a",
      "title": "What it was like for one NPR newscaster to go on an AI date",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500249/what-it-was-like-for-one-npr-newscaster-to-go-on-an-ai-date",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T08:58:28.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "011af3f7b044fb0610cd786612919dcf3cde5c21",
      "title": "Crime in DC: What do the figures say and how safe do people feel?",
      "url": "https://www.bbc.com/news/videos/cewynn7krj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T23:18:28.000Z",
      "summary_90w": "",
      "raw": "National Guard troops have been seen reporting for duty in Washington DC as President Trump takes over the city’s police force.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5fbeba8eff0af4d13d44fcbe2969b53f70c8046",
      "title": "Inside Australia's billion-dollar bid to take on China's rare earth dominance",
      "url": "https://www.bbc.com/news/articles/cgm2z91mvlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T22:05:03.000Z",
      "summary_90w": "",
      "raw": "Recent moves by Beijing have got businesses worried - and Australia is looking to offer an alternative.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1989. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    }
  ]
}