{
  "version": "1755008243951",
  "generatedAt": "2025-08-12T14:17:23.951Z",
  "items": [
    {
      "id": "4e9d4bdcfebbf1aa9c129f6dab02b6163ca17fe6",
      "title": "Small boat migrant crossings hit 50,000 under Labour",
      "url": "https://www.bbc.com/news/articles/c8e1xkwd74wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T14:10:04.000Z",
      "summary_90w": "",
      "raw": "A government minister describes the number as \"unacceptable\" but says Labour is \"making progress\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bd7659181fa5445590f3adf67f1634e79e9a483",
      "title": "What we learned from Nicola Sturgeon's memoir ",
      "url": "https://www.bbc.com/news/articles/cn844n379y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T14:04:17.000Z",
      "summary_90w": "",
      "raw": "The much anticipated book by the former first minister is now on sale - and the BBC's Scotland editor James Cook has been doing some speed-reading.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "538df611a1ccdf92b88e1e035262eff7d299abff",
      "title": "Trump screwed over Nvidia’s Chinese sales, then let them happen",
      "url": "https://www.theverge.com/regulator-newsletter/757996/trump-screwed-over-nvidias-chinese-sales-then-let-them-happen",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Hello there, world! Welcome to the first issue of Regulator, a newsletter about the collision between Big Tech and Washington. If you enjoy this, consider subscribing to get  this newsletter weekly and everything The Verge has to offer.\nFor anyone who subscribed via our Instagram announcement: I am so, so sorry that I didn't use the proper song to announce the launch of Regulator, which is, of course, Warren G's \"Regulate.\" But I never thought that a track that samples one of my favorite Michael McDonald songs would be so perfectly applicable to the topic of this newsletter: a gun-wielding gang jumping a group of rich dudes and demanding th …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "64dbf00b34db766d7eaceb8c3345c3880846e93a",
      "title": "British soldiers using sex workers in Kenya despite ban, inquiry finds",
      "url": "https://www.bbc.com/news/articles/czjmveemj7zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T13:52:29.000Z",
      "summary_90w": "",
      "raw": "Chief of Defence Staff Sir Roly Walker says the army is committed to stopping sexual exploitation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1df7e680c86a53b91a29ed7441fb5d6ebb2af6dd",
      "title": "Sling TV&#8217;s $5 pass buys you one day of cable TV",
      "url": "https://www.theverge.com/news/758020/sling-tv-pass-one-day-cable-tv",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T13:43:21.000Z",
      "summary_90w": "",
      "raw": "Sling TV has launched a new option that lets you watch live content without signing up for a streaming or cable subscription. Now, you can pay $4.99 for a “day pass,” offering 24 hours of live and on-demand access to several channels, including ESPN, ESPN2, ESPN3, TNT, A&E, Disney Channel, CNN, and others.\nSling TV also offers a weekend pass from Friday through Sunday for $9.99, along with a seven-day pass for $14.99. These passes include the “popular networks” within Sling TV’s $45.99 per month Orange subscription, but if you’re looking for more channels, you can pay for one of the service’s add-ons, like Sports Extra, News Extra, Lifestyle Extra, and more. Each add-on costs $1 more when added to the day pass, $2 for the weekend pass, or $3 for the week pass.\nIt sounds like Sling TV’s new passes will come in handy if you’re trying to watch a specific sporting event, awards show, or season premiere without getting locked into a subscription. Live TV streaming services are already pretty pricey, and the ones focused on live sports are no different. Both Comcast and DirecTV have $70 per month live sports streaming bundles, while ESPN and Fox’s upcoming sports streaming services will cost $29.99 and $19.99, respectively.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "220332d2a4e2499a8071b95c6d6a43d913306632",
      "title": "Middle East crisis live: 25 foreign ministers issue joint call for ‘flood’ of aid into Gaza",
      "url": "https://www.theguardian.com/world/live/2025/aug/12/gaza-israel-lobal-outcry-killing-of-six-journalists-al-jazeera-middle-east-latest-updates-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T13:37:49.000Z",
      "summary_90w": "",
      "raw": "Representatives from countries including UK, Australia and France say that humanitarian suffering has reached ‘unimaginable levels’\nIn a post on X, Israel Defense Forces claim to have “debunked” what it called Hamas’s “starvation campaign” in Gaza.\nThe IDF said that reviews of documents showed that most deaths by malnutrition in Gaza were linked to “severe pre-existing conditions” and that only a handful of the 133 deaths by malnutrition claimed by Gaza’s authorities in July could be “verified”. The post said that the “expert review concluded that there are no signs of a widespread malnutrition phenomenon among the population in Gaza”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ea5db97b7d325fa4011354c648dd3f1057cf2cd",
      "title": "Europe live: EU says Ukraine should be able to ‘choose its own destiny’ ahead of Trump-Putin meeting",
      "url": "https://www.theguardian.com/world/live/2025/aug/12/europe-live-ukraine-russia-putin-trump-viktor-orban-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T13:35:35.000Z",
      "summary_90w": "",
      "raw": "Ukrainian president thanks EU leaders for their support and calls for further pressure on Russia \nJust days before the Trump-Putin summit, Ukraine’s authoritative DeepState war map showed that Russian forces had advanced by at least 10 km (six miles) north in two prongs in recent days, part of their drive to take full control of Ukraine’s Donetsk region, Reuters reported.\nThe advance is one of the most dramatic in the last year, it stated.\n“We’re waiting for the US to follow through on the on the commitments they’ve made, the clear political commitments they’ve made, and, and that’s where we are right now as soon as we have any updates, we’d be happy to provide them.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04fce68f7713ebcd4ddd5a9e22ae8b110ab8b19f",
      "title": "US woman convicted over failed assassination in UK",
      "url": "https://www.bbc.com/news/articles/c4gj87jxg78o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T13:34:46.000Z",
      "summary_90w": "",
      "raw": "Aimee Betro flew into the country and tried to shoot a man at point-blank range before going on the run for nearly five years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2adaa238a1180e01a278ee161541b967ca8bd6d5",
      "title": "Alien: Earth is a brilliant and terrifying expansion of the franchise",
      "url": "https://www.theverge.com/tv-reviews/719173/alien-earth-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T13:16:07.000Z",
      "summary_90w": "",
      "raw": "FX’s Alien: Earth — Pictured: Sydney Chandler as Wendy. CR: Patrick Brown/FX | FX\t\n\nWhile the monsters in each of the nine Alien movies have been a little bit different, the nefarious corporate forces have remained the same. Ridley Scott's original Alien didn't need to mention Weyland-Yutani by name for it to be clear that a singular mega-company had cornered the market on space exploration. But subsequent Alien films turned the franchise into a terrifying rumination on the violence baked into capitalism's DNA.\nThough Weyland-Yutani has loomed larger and larger in various Alien projects over the years, FX's new Alien: Earth series is the first to explore what it looks like on the ground. Set two years before the original f …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c2d8cbeeb2c110cbc4ba18ff4289d35c8494c67",
      "title": "A dating app, a niqab and a 9mm gun - how a US woman was hired to end a UK family feud",
      "url": "https://www.bbc.com/news/articles/cn72x5p8801o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T13:04:43.000Z",
      "summary_90w": "",
      "raw": "US woman Aimee Betro was hired to come to the UK to kill a Birmingham man as part of a family feud.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8aa2ff0bf8f3d1c02166655e0b92518736e6b9eb",
      "title": "Australian court finds Apple, Google abused app store market power",
      "url": "https://techcrunch.com/2025/08/12/australian-court-finds-apple-google-abused-app-store-market-power/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T13:00:12.000Z",
      "summary_90w": "",
      "raw": "Epic Games has just secured a win in its crusade against Apple and Google's app store policies: The Federal Court of Australia on Tuesday ruled that Apple and Google's engaged in anti-competitive conduct when it came to their respective app stores, ABC News reported.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "39c1052a54e30d96c8bdd3ac375de8d4f97d3bbd",
      "title": "How to save a smart home company",
      "url": "https://www.theverge.com/podcast/757679/how-insteon-came-back-from-the-dead-smart-lighting-hotline",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The smart home can be scary. It seems like every other month, we hear about another smart home company going out of business, leaving you scrambling for a new way to turn on your lights. Why is it so hard for smart home manufacturers to keep the lights on? And what can they do to stay in business, so we can continue to enjoy the benefits of home automation? \nThis week on The Vergecast, The Verge’s smart home reviewer, Jennifer Pattison Tuohy, chats with Ken Fairbanks, a longtime customer of Insteon who ended up buying the smart lighting company when it went bankrupt.\n\n\nThey trace the rise and fall of the early smart lighting protocol, born in the post-X10 era when home automation shifted from wired to wireless, and how he and a group of former employees — who were also users — revived it. He shares lessons learned on how to keep the lights on, from fostering customer loyalty and managing the realities of subscriptions, to navigating new tariffs and musing on how closely some IoT hardware companies come to resembling pyramid schemes.\nThen, in a special and supersized (and we mean SUPER) Vergecast hotline (call 866-VERGE11 or email vergecast@theverge.com), Jen is joined by Richard Gunther, cohost of The Smart Home Show podcast, to tackle a bunch of your burning smart lighting questions. They answer everything from how to move your smart home lighting, to how to choose smart switches or bulbs, to which Thread border router you should buy for your Matter setup. Plus, they run down how they have smart lighting working in their own homes. \nFor more on the topics in this episode, here are some links to dig into:\nInsteon’s troubles are a smart home tale as old as time\nInsteon customers turned Insteon’s lights back on\nSmart switches or smart bulbs? How to choose the right smart lighting for your home\nThread count: Ikea is stitching together a smarter home\nTaming Wi-Fi in the Smart Home\nHow to move a smart home\nMoving a smart home – The Smart Home Show\nBinding should be the next big thing for smart home devices\nGoogle TV Streamer review: smarter than your average set-top box",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f0173479a8064d3a4bb7b827e259564fd617edb",
      "title": "Inflation remains elevated as Trump's tariffs take hold",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499344/inflation-consumer-prices-cpi-tariffs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T12:46:07.000Z",
      "summary_90w": "",
      "raw": "Inflation remained elevated last month as President Trump's tariffs continued to make their way into the prices that consumers pay. The average cost of living in July was up 2.7%.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cedc7e106eddfe296d49276a50028fb9d1ed7f2c",
      "title": "How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company",
      "url": "https://techcrunch.com/2025/08/12/how-a-once-tiny-research-lab-helped-nvidia-become-a-4-trillion-dollar-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Nvidia's research lab developed the technology that took the company from a video game GPU startup to a $4 trillion-dollar company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "af8a107011a9a85761c0c9f143e4d95df4bbb44c",
      "title": "Sam Altman is right and wrong about the future of photos",
      "url": "https://www.theverge.com/ai-artificial-intelligence/757709/sam-altman-ai-bunnies-what-is-a-photo",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Don’t compare AI bunnies to phone camera processing, Sam.\t\n\nI'm annoyed, not for the first time, by something Sam Altman has said. But this time it's because I'm annoyed at how much I agree with what he's saying - even though I think his statement is kind of bullshit.\nIn a recent interview, journalist Cleo Abram asked Altman how people will be able to tell what's real and what's not in an age of convincing AI-generated content. Specifically, she references the bunnies. You know the ones I mean: caught in some Ring-camera-ish footage of a backyard, discovering and jumping on a trampoline. So cute! So wholesome! So completely AI-generated! The video went viral, almost certainly before the people likin …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ea1e0af4bf30bf749d044fd5686b65caa5ae95a8",
      "title": "Jennifer Aniston says she and Gwyneth Paltrow discuss mutual ex Brad Pitt",
      "url": "https://www.bbc.com/news/articles/c3r4vq9edveo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T12:04:35.000Z",
      "summary_90w": "",
      "raw": "Asked if they ever discuss their mutual ex, she says: \"Oh, of course. How can we not? We're girls.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8315308f60dd0450c86e36cf9be48aac6886101c",
      "title": "When is it too hot to walk your dog?",
      "url": "https://www.bbc.com/news/articles/ce839egxynwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:50:59.000Z",
      "summary_90w": "",
      "raw": "How to make sure your pets are cool and comfortable during periods of hot weather.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caef277499498d7e9ad5a40a6d891b009356bb43",
      "title": "US and China extend trade truce to avoid tariffs hike",
      "url": "https://www.bbc.com/news/articles/cg7jjkvzmkxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T11:50:47.000Z",
      "summary_90w": "",
      "raw": "The US will hold its levy on Chinese imports at 30%, while China will keep a 10% tariff on American goods.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eef2bc8b6e893513bbfbc7da0cf944b7f7c1fef4",
      "title": "Elon Musk says he’s suing Apple for rigging App Store rankings",
      "url": "https://www.theverge.com/news/757941/elon-musk-xai-apple-lawsuit-app-store",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T11:50:29.000Z",
      "summary_90w": "",
      "raw": "There’s a sore loser in this popularity contest.\t\n\nElon Musk says that his artificial intelligence company xAI “will take immediate legal action” against Apple for allegedly manipulating its App Store rankings to the advantage of rival AI apps. In a series of X posts on Monday night, Musk suggested that Apple was “playing politics” by not placing either X or xAI’s Grok chatbot in the App Store’s list of recommended iOS apps, and that he had no choice but to file a lawsuit.\n“Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation,” Musk said. “Why do you refuse to put either X or Grok in your ‘Must Have’ section when X is the #1 news app in the world and Grok is #5 among all apps?,” the xAI CEO asked Apple in another post, which is now pinned to his profile.\nMusk provided no evidence for his claims, and it’s unclear if he has made good on his threats and filed the lawsuit yet. The Verge has reached out to xAI, Apple, and OpenAI for comment.\nAt the time of writing, ChatGPT is listed as Apple’s top free iPhone app in the US, with Grok ranked as the sixth. China’s DeepSeek AI briefly managed to take the top App Store position from ChatGPT in January, however, disproving Musk’s claim that it would be impossible for other AI apps to do so.\nAccusations of meddling from Musk are ironic, given allegations about alterations made to X after he acquired the company in 2022, then known as Twitter. A research study in 2024 suggested that X’s algorithm was manipulated to boost posts from Musk’s account. OpenAI CEO Sam Altman responded to Musk’s posts by sharing a Platformer report from 2023 that similarly found Musk had a system built to promote his X posts to the entire platform’s userbase. In June, the “maximally truth-seeking” Grok chatbot was also found to be consulting Musk’s opinion before providing answers to controversial questions around topics like Israel and Palestine, US immigration, and abortion.\nThis isn’t the first time that Musk has beefed with Apple and OpenAI. Musk was an early founder at OpenAI, and previously targeted the AI startup via lawsuits and a unanimously rejected $97.4 billion buyout offer after taking issue with its pivot to being a profit-driven business. Following OpenAI’s partnership with Apple to integrate ChatGPT into iPhones, iPads, and Macs last year, Musk threatened to ban Apple devices at his companies if OpenAI’s tech was fused with Apple’s OS.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "572b0be163b9dac8b27be8d4f2d73148e5420ae3",
      "title": "Who were the Al Jazeera journalists killed by Israel in Gaza?",
      "url": "https://www.bbc.com/news/articles/c6200wnez73o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:49:16.000Z",
      "summary_90w": "",
      "raw": "Prominent reporter Anas al-Sharif and six other journalists were killed when Israel targeted a tent used by media, the broadcaster said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6062b8dc25cbe0a2595b5fe5fc40b92803b971b1",
      "title": "Microsoft releases lightweight Office taskbar apps for Windows 11",
      "url": "https://www.theverge.com/news/757935/microsoft-365-companion-apps-windows-11-release",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T11:39:12.000Z",
      "summary_90w": "",
      "raw": "Microsoft is starting to roll out lightweight taskbar apps for Microsoft 365 users on Windows 11. These taskbar apps will automatically launch at startup and provide quick access to contacts, file search, and calendar straight from the Windows taskbar.\nThe Microsoft 365 companion apps, as Microsoft calls them, are starting to roll out to business users of Microsoft 365 this month. The People companion provides a browsable org chart, as well as the ability to look up anyone in your company. You can also quickly start a Teams message or call with a contact, or email them directly.\nThe File Search companion is designed for quick access to Microsoft 365 files from the Windows 11 taskbar. You can search by file name, author, or other keywords to find files across OneDrive, SharePoint, Microsoft Teams, and Outlook. There’s also an option to preview a file before you open it, and plenty of filtering and sharing options.\nThe Calendar app is a quick view of a Microsoft 365 calendar from the taskbar, where you can see upcoming events, search for appointments, or join meetings.\nAll three apps have been in beta in recent months, after Microsoft originally announced them at its Ignite conference last year. They are now heading to all business users of Microsoft 365 as part of a general availability release this month. The apps will be automatically installed as long as Microsoft 365 apps are installed on a Windows 11 system. IT admins can prevent the automatic install of these Microsoft 365 companion apps, and end users can stop them from automatically launching at startup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "56cf0ca8a8b3b9fafb0b726e9f0560467f06c63c",
      "title": "'My staff feel unsafe': Pharmacies report surge in shoplifting and aggression",
      "url": "https://www.bbc.com/news/articles/cj6yxkp2wx9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:37:27.000Z",
      "summary_90w": "",
      "raw": "A survey finds nearly nine in 10 pharmacies have seen a surge in shoplifting in the past year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a54f9c18f13ae24cc22018ec697722fefa4bc83f",
      "title": "EU leaders defend Ukraine’s freedom to decide future ahead of Trump-Putin summit",
      "url": "https://www.theguardian.com/world/2025/aug/12/trump-putin-summit-alaska-eu-leaders-ukraine-sovereignty",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T11:35:40.000Z",
      "summary_90w": "",
      "raw": "Statement on Ukrainian sovereignty signed by all EU leaders except for Viktor Orbán before call with Trump\n\nEurope live – latest updates\n\nRead all our coverage of the Ukraine war\n\nEuropean Union leaders made a rallying call to defend Ukraine’s freedom to decide its own future in advance of their virtual summit with Donald Trump – convened to discuss US strategy before the president’s talks with Vladimir Putin on Friday.\nWith the exception of Hungary, all EU leaders signed a joint statement, with Kaja Kallas, the EU foreign policy chief, also calling for the Ukrainian president, Volodymyr Zelenskyy, to attend the Trump-Putin summit in Alaska on Friday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6d4faf6315d636d7ac67f1e039b24a313d7ae42",
      "title": "D.C. residents express concern over crime crackdown. And, Ford invests big in EVs",
      "url": "https://www.npr.org/2025/08/12/g-s1-82200/up-first-newsletter-washington-dc-crime-crackdown-europe-trump-putin-ford-electric-vehicle-rollout",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T11:32:09.000Z",
      "summary_90w": "",
      "raw": "Washington, D.C., residents express concerns over what Trump's crime crackdown could mean for them. And, Ford plans to invest billions in building a new, cheaper electric truck",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2eb25f0b283fe84b6aabf1c094aeb2dfe6cd6c7",
      "title": "Joshua should fight Paul if it pays - Whyte",
      "url": "https://www.bbc.com/sport/boxing/articles/cqxgz9wy7wpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:30:56.000Z",
      "summary_90w": "",
      "raw": "Dillian Whyte says Anthony Joshua should fight Jake Paul for a lucrative purse, but insists he still has unfinished business with Joshua himself.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5883c89953fd7eb6966f902b6ac90b5485a27862",
      "title": "‘Play by the rules’: Fortnite developer Epic Games wins Australian court battle against Apple and Google",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/fortnite-developer-epic-games-wins-australian-federal-court-apple-google",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T11:26:51.000Z",
      "summary_90w": "",
      "raw": "Fortnite was kicked off Google and Apple app stores in 2020 after Epic Games offered its own in-app payment system\n\nGet our breaking news email, free app or daily news podcast\n\nThe creator of Fortnite, Epic Games, has won a partial victory in the Australian federal court against Apple and Google over restrictions in app stores and failing to allow for competition for in-app payment options, but it could be a long time before any changes are made in Australia.\nFortnite was kicked off the Google and Apple app stores in 2020 after Epic Games offered its own in-app payment system that bypassed the one used by the platforms, and cut out the fees Apple and Google receive for in-app payments.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65071f7142c49c603f865510e960a288790610af",
      "title": "Mum of murdered schoolboy Harvey Willgoose calls for killer to be named",
      "url": "https://www.bbc.com/news/articles/cwy195xg8e4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:24:44.000Z",
      "summary_90w": "",
      "raw": "The identity of the 15-year-old boy who killed Harvey Willgoose is protected due to his age.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbe5118c1a6442f79d6d5a617bfb675b208b2743",
      "title": "Why lung cancer is a 'hidden epidemic' in this part of the world",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/12/g-s1-77203/lung-cancer-africa",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T11:24:25.000Z",
      "summary_90w": "",
      "raw": "Rates of the world's deadliest cancer appear to be low in sub-Saharan Africa. But that statistic is masking the scope of the disease, doctors say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "061fb862089fc565c8f0a053d96cdb405152197a",
      "title": "Sacked referee Coote banned by FA over Klopp comments",
      "url": "https://www.bbc.com/sport/football/articles/cn726g7r46ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:21:59.000Z",
      "summary_90w": "",
      "raw": "Former Premier League referee David Coote given eight-week ban by the FA for his comments about ex-Liverpool manager Jurgen Klopp.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ae4518d55e3c8baaed32d56e11f4e4a782e6395",
      "title": "Taylor Swift’s 12th announced at 12:12 on the 12th",
      "url": "https://www.theverge.com/news/757921/taylor-swift-t12-album-name",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T11:04:41.000Z",
      "summary_90w": "",
      "raw": "Taylor Swift at NFL Game.\t\n\nTaylor Swift leaned into her love for symbolism with the announcement of her dozenth album, titled The Life of a Showgirl. \nTS12 was introduced in a teaser — already viewed over 65 million times — for the next episode of the New Heights podcast airing Wednesday, hosted by boyfriend Travis Kelce and his big brother Jason. Tay extracted the $29.99 album from a briefcase but the artwork was blurred out ahead of tomorrow’s reveal. It’s already up for “pre pre-order” in a variety of formats over at taylorswift.com.\nThe New Heights podcast consistently ranks in the top 10 on Spotify and Apple charts and this will certainly give viewership a bump and a chance to break into YouTube’s ranks. It’s the kind of masterful brand crossover that reportedly elevated NFL viewership and merch sales.\nSometimes love is love, but sometimes it’s also good for business.\n\n\n  \n \n  \n \n\n\n \n\n View this post on Instagram\n\n \n \n \n \n\n \n \n\n \n \n \n\n \n \n \n\nA post shared by New Heights (@newheightshow)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d8d1ed4c709ccb015f64865a971005b3fdf9b547",
      "title": "Trump deploys National Guard to Washington DC and pledges crime crackdown",
      "url": "https://www.bbc.com/news/articles/cm2110me5g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T11:01:50.000Z",
      "summary_90w": "",
      "raw": "The president also takes control of the city's police force, as the mayor rejects his claims of a crime wave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59affc555db1533dca6fbb7dc1ae5cddbb7aeaf6",
      "title": "UK recovers position in EU’s Horizon Europe science research programme",
      "url": "https://www.theguardian.com/science/2025/aug/12/uk-recovers-position-horizon-europe-science-research-eu-brexit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T11:00:18.000Z",
      "summary_90w": "",
      "raw": "Scientists received €735m in grants in 2024 after UK rejoined programme as associate member post-Brexit\n\nEurope live – latest updates\n\nThe UK is quickly recovering a prime position in the EU’s £80bn science research programme 18 months after becoming a participating member following the resolution of Brexit problems, data shows.\nThe country was frozen out of Horizon Europe for three years in a tit-for-tat row with the then prime minister, Boris Johnson, over the Northern Ireland trading arrangements.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9d44c621395b16e465bb1238d22e3ab311b15a3",
      "title": "Ford is doubling down on EVs — the timing is awful",
      "url": "https://www.theverge.com/ford-motor-company/757719/ford-ev-platform-timing-sales-trump",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T11:00:00.000Z",
      "summary_90w": "",
      "raw": "On Monday, Ford introduced an innovative new manufacturing process that it says will help make its EVs more sustainable, more desirable, and more importantly, more affordable. The timing couldn't have been worse. \nEV tax credits were set to expire at the end of September. President Trump's trade war was tilting the balance in favor of China's EVs. And automakers are beginning to delay and even cancel some planned models.  \nFord seems to realize its timing is unfortunate. Throughout their announcement, the company's top executives kept hammering one salient point: this was going to be really hard, success was far from guaranteed, and in fac …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ee6a7f3c12f39d7f6ee8b7674bf8eeb21136552d",
      "title": "GTA V now has DLSS 4 Multi Frame Generation support",
      "url": "https://www.theverge.com/news/757907/gta-5-dlss-4-multi-frame-generation-official-release-nvidia-game-ready-driver",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Rockstar Games is adding Nvidia’s DLSS 4 Multi Frame Generation support to Grand Theft Auto V Enhanced today. Nvidia is also releasing a new Game Ready driver today that will improve Grand Theft Auto V Enhanced performance, as well as support the enhanced version of Senua’s Saga: Hellblade II that’s available today.\nThe DLSS 4 upgrade to GTA V complements the game’s existing ray tracing capabilities, by allowing RTX 50-series owners to enable Multi Frame Generation and generate additional frames to make the motion of gameplay look smoother.\nSenua’s Saga: Hellblade II Enhanced also has DLSS 4 with Multi Frame Generation, as well as a new Dark Rot game mode that debuts with this enhanced version.\nYou can download Nvidia’s new 580.97 Game Ready driver direct from Nvidia’s website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d844ff761ea66bb969e4c61fa85b4e2f8eb7963",
      "title": "UK jobs market cools as vacancies fall",
      "url": "https://www.bbc.com/news/articles/cpdjjp681p7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T10:56:02.000Z",
      "summary_90w": "",
      "raw": "Data suggests companies are not recruiting or are holding off replacing people who have left.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10e3c8f0426646f6456d6c3eb5160f918f8e62c6",
      "title": "NHS is over-treating men for prostate cancer, says charity",
      "url": "https://www.bbc.com/news/articles/cger2712j1yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T10:43:29.000Z",
      "summary_90w": "",
      "raw": "More low-risk cancers could be monitored rather than treated, avoiding significant side effects, says a charity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "314d7311c6e2ede024378503431d3e53469b6887",
      "title": "Alaska was once a full-fledged Russian colony. Now it's hosting a U.S.-Russia summit",
      "url": "https://www.npr.org/2025/08/12/g-s1-82188/alaska-russia-us-putin-trump-summit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:56:16.000Z",
      "summary_90w": "",
      "raw": "Russia lost a war in Crimea in the 1850s. To pay off war debts, Russia sold Alaska to the U.S. Now presidents Trump and Putin will meet Friday in Alaska to discuss another war involving Crimea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf4e5d60154f36ea40d80aa0a0534b75a4fe90f8",
      "title": "U.S. and China extend tariff truce deadline for another 3 months",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5500039/us-china-tariffs-trade-truce",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:47:35.000Z",
      "summary_90w": "",
      "raw": "President Trump's executive order extends a reprieve from the threat of rising tariffs between the world's two largest economies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d9b7b48471ad76673dc26d3346fadc03b028feef",
      "title": "Pilot in crash that killed Outback Wrangler star panicked and lied to investigators, court hears",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/outback-wrangler-star-matt-wright-helicopter-pilots-service-checks-court-hears-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:39:47.000Z",
      "summary_90w": "",
      "raw": "Sebastian Robinson, who was left a paraplegic by a February 2022 crash that killed Chris ‘Willow’ Wilson, gave evidence on Tuesday\n\nGet our breaking news email, free app or daily news podcast\n\nA pilot panicked and lied to air crash investigators after a helicopter accident that killed Outback Wrangler co-star Chris “Willow” Wilson, a court has been told.\nSebastian Robinson, who was left a paraplegic by the February 2022 crash in remote swampland in the Northern Territory, on Tuesday gave evidence in the trial of reality TV star Matt Wright.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "881d04899e3f70d0235388040df8bab1fb46bf7b",
      "title": "Taylor Swift announces new album on boyfriend Travis Kelce's podcast",
      "url": "https://www.bbc.com/news/articles/cqjyerlv8eyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T09:36:18.000Z",
      "summary_90w": "",
      "raw": "The Life of a Showgirl revealed as the popstar's latest album after intense speculation from fans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc0093142e82ff5fc185a1d9076efd6fe46f6ffa",
      "title": "Ukraine's borders must not be changed by force, EU leaders say",
      "url": "https://www.bbc.com/news/articles/clyrlvwx9rgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T09:36:03.000Z",
      "summary_90w": "",
      "raw": "The EU says \"the people of Ukraine must have the freedom to decide their future\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc0093142e82ff5fc185a1d9076efd6fe46f6ffa",
      "title": "Ukraine's borders must not be redrawn by force, EU leaders warn ahead of Trump-Putin summit",
      "url": "https://www.bbc.com/news/articles/clyrlvwx9rgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T09:36:03.000Z",
      "summary_90w": "",
      "raw": "The EU says \"the people of Ukraine must have the freedom to decide their future\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a623de09717122caf535debcc676396c647aa27",
      "title": "Thousands evacuated in Spain amid deadly wildfires and new heatwave",
      "url": "https://www.theguardian.com/world/2025/aug/12/thousands-evacuated-in-spain-amid-deadly-wildfires-and-new-heatwave",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:26:50.000Z",
      "summary_90w": "",
      "raw": "Temperatures of 44C predicted as blazes rage across Europe\n\nEurope live – latest updates\n\nAlmost 6,000 people have been evacuated from their homes in northern, central and southern Spain as wildfires continue to burn amid a heatwave that could bring temperatures of 44C to some parts of the country.\nThe deadly heat across large parts of Europe has created what scientists have called a “molotov cocktail” of climatic conditions that is fuelling vast wildfires.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c2d76faa33df945c74b5a4fa8b91b7026656082",
      "title": "Newcastle striker Isak still determined to join Liverpool",
      "url": "https://www.bbc.com/sport/football/articles/czxp05re72po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T09:20:25.000Z",
      "summary_90w": "",
      "raw": "Newcastle striker Alexander Isak is still determined to join Premier League champions Liverpool before the transfer window closes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f37ee941b080f2ed353048ba3d2783ff8bf7725",
      "title": "Chinese warship crashes into own coastguard vessel while chasing Philippine boat in South China Sea",
      "url": "https://www.theguardian.com/world/2025/aug/12/chinese-ships-crash-warship-coast-guard-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:12:50.000Z",
      "summary_90w": "",
      "raw": "Footage shows Chinese coastguard vessel with its entire bow caved in after colliding with warship near contested Scarborough Shoal\nThe Philippines has released dramatic footage of a Chinese warship colliding with a vessel from its own coastguard while chasing a Philippine patrol boat in the South China Sea.\nThe incident occurred near the contested Scarborough Shoal on Monday as the Philippine Coast Guard (PCG) escorted vessels distributing aid to fishers in the area, Philippine authorities said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3226fb36e579d3d88886c9377be88c0ae9193271",
      "title": "Last call: Melbourne airport ranked Australia’s least convenient",
      "url": "https://www.theguardian.com/world/2025/aug/12/last-call-melbourne-airport-ranked-australias-least-convenient",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:08:23.000Z",
      "summary_90w": "",
      "raw": "A study scoring the 11 major airports on convenience puts Melbourne last with Townsville and Canberra tied for first\n\nGet our breaking news email, free app or daily news podcast\n\nMelbourne airport has been ranked Australia’s least convenient, with Sydney coming in a close second-worst.\nTravel insurance company iSelect ranked Australia’s 11 major airports on factors like cost of transport to and from the airport, parking and queue durations, then assigned each airport an overall “convenience index” score. \n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2b95cfa35c85a31b0aededd3ae91d42625f9b96",
      "title": "Risks of climate crisis to Australia’s economy and environment are ‘intense and scary’, unreleased government report says",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/risks-of-climate-crisis-to-australias-economy-and-environment-are-intense-and-scary-unreleased-government-report-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:06:00.000Z",
      "summary_90w": "",
      "raw": "Sources say delayed risk assessment includes modelling of effects of climate crisis in ways that have been little discussed in political debate so far\n\nGet our breaking news email, free app or daily news podcast\n\nAn unreleased Australian government report on the economic and environmental risks posed by the climate crisis is “intense and scary”, and confronting even for those who work in the area, according to people familiar with the assessment.\nThe delayed report – the national climate risk assessment – includes modelling of future climate damage, estimates of the number of people who could be killed by worsening heatwaves and a mapping tool that forecasts flooding risk in suburbs across the continent.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f425552d145a273fc1570bc5d6b6acff2afa905",
      "title": "A Palestinian activist was killed by the violence he sought to stop",
      "url": "https://www.npr.org/2025/08/12/g-s1-81501/west-bank-hathaleen-israeli-settler-shooting",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:04:52.000Z",
      "summary_90w": "",
      "raw": "Awdah Al Hathaleen was shot during a clash with an Israeli settler. His West Bank village hoped No Other Land, the Oscar-winning film about settler violence that he worked on, might help protect them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82fc0e50aed1562dc0c26f4b359b9992cab15d85",
      "title": "A look at the deal to allow Nvidia chip sales to China in exchange for revenue",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498744/a-look-at-the-deal-to-allow-nvidia-chip-sales-to-china-in-exchange-for-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:00:17.000Z",
      "summary_90w": "",
      "raw": "NPR's Michel Martin speaks with Peter Harrell of the Carnegie Endowment for International Peace about the Trump administration's deal to allow AI chip sales to China in exchange for revenue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e900b3766217c804ab9bec1b058aefd6913ba381",
      "title": "In Alabama, a dredging project in Mobile Bay brings together unlikely allies",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5468942/mobile-bay-dredging-mud-army-corps",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Dredging waterways for navigation is a centuries-old practice, but this project is controversial because the mud being dug out of the channel is put into other parts of Mobile Bay.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1991. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68b11cd591ccca1e42b46bcb0092199e440e70e0",
      "title": "Trump's Washington, D.C., takeover targets a host of groups, many of them vulnerable",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498766/trumps-d-c-takeover-targets-vulnerable-groups",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Some residents are skeptical that President Trump's use of tough police tactics will work to solve complex social ills.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "75b0645ffc8cfc2a83e0cc3917936b1121f6f90a",
      "title": "Scores still missing a week after India flash floods",
      "url": "https://www.bbc.com/news/articles/c87eyx1v039o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T08:51:55.000Z",
      "summary_90w": "",
      "raw": "Rescue operations at the disaster site have been hampered by heavy rains and blocked roads.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9d47ac1b607699989d368c3859d1b2e2602e9e2",
      "title": "An Israeli airstrike kills a prominent Al Jazeera journalist and colleagues in Gaza",
      "url": "https://www.npr.org/2025/08/12/g-s1-82143/gaza-anas-al-sharif-al-jazeera-israel",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T08:35:01.000Z",
      "summary_90w": "",
      "raw": "Al Jazeera's Anas al-Sharif and five of his colleagues at the network were killed in an Israeli airstrike targeting Gaza's most recognized television journalist.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "062af02e3874f055c5936f8281a1644256074d01",
      "title": "Scores of bandits killed in air and ground raids, Nigerian military says",
      "url": "https://www.bbc.com/news/articles/cdd3m679dzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T08:29:51.000Z",
      "summary_90w": "",
      "raw": "The air force says it targeted more than 400 gunmen in a forest as they were planning a village raid.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "756a9d4979bc1da44723aa7e4468e978107d5955",
      "title": "Trump’s China trade truce extension spurs market rally",
      "url": "https://www.theguardian.com/us-news/2025/aug/12/trumps-china-trade-truce-extension-spurs-market-rally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T08:20:11.000Z",
      "summary_90w": "",
      "raw": "Bourses in Australia and Japan hit record highs as hopes grow of trade deal within latest 90-day pause\n\nBusiness live – latest updates\n\nGeorge Magus: Why Peak China may finally have arrived\n\nDonald Trump’s decision to extend a truce in the trade war with China has triggered a stock market rally across the globe.\nOn Monday night, the US president signed an executive order extending the deadline for higher tariffs on China until 10 November. Beijing said early on Tuesday it would suspend additional tariffs on US goods for a further 90 days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de697f4bc0c3c77220b3cfcd7f43b11d1afde599",
      "title": "Charges dropped against teen pilot detained in Antarctica ",
      "url": "https://www.bbc.com/news/articles/c04rql923kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T08:12:06.000Z",
      "summary_90w": "",
      "raw": "Ethan Guo must leave the island and pay $30,000 dollars to charity for illegally landing on Chilean territory, a judge says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dba62a8f50e288025ff52a11e2cecaf470d92771",
      "title": "Grammy-winning Afropop star Tems: 'Women are not respected in the industry'",
      "url": "https://www.bbc.com/news/articles/c1leez0jn8ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T08:00:14.000Z",
      "summary_90w": "",
      "raw": "The Nigerian musician details her rise to the top of a notoriously male-dominated industry.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90b9f813145356db0ff383695f3cecc750766bb7",
      "title": "RBA interest rates decision: relief for borrowers as Reserve Bank cuts cash rate to 3.6%",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/rba-interest-rates-decision-relief-for-borrowers-as-reserve-bank-cuts-cash-rate-to-36",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T07:46:14.000Z",
      "summary_90w": "",
      "raw": "RBA also warns of ‘persistently’ lower productivity growth than previously expected as it reveals interest rate decision\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Reserve Bank of Australia delivered a much-anticipated rate cut at its meeting on Tuesday and flagged the potential for two or three more, while warning of slow economic growth for the foreseeable future.\nThe RBA’s monetary policy board voted unanimously to drop the official cash rate target to 3.6%, from 3.85%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "528fcfc0c770bddfaa4b8753afe7ee82b824c71f",
      "title": "The Nicola Sturgeon Interview",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdjmx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T07:45:00.000Z",
      "summary_90w": "",
      "raw": "Nicola Sturgeon on her time in office, Alex Salmond, her sexuality and more.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "786ddcdef48141d582cd2f6c48f4e5e51bdb5883",
      "title": "Man faces jail in US for shipping 850 turtles in socks to Hong Kong",
      "url": "https://www.bbc.com/news/articles/c8x5rp88n9jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T07:43:22.000Z",
      "summary_90w": "",
      "raw": "The turtles were packed in boxes labelled as plastic toys, according to the Justice Department.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2dc749aec301ba86dd01cfdb595f5d30cc08e866",
      "title": "The arduous system for getting aid into Gaza",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498719/the-arduous-system-for-getting-aid-into-gaza",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Insulin needles. Sleeping bags. Nutella. These are items Arwa Damon’s charity — International Network for Aid, Relief and Assistance — has tried to send to Gaza and Israel has rejected. It’s a glimpse into the harsh reality of a humanitarian crisis with no end in sight. Today on the show, we talk to Damon about the economics of running a humanitarian nonprofit and what’s stopping more aid from reaching Gaza. \nRelated episodes: \nWhy Israel uses diaspora bonds \nWhy the U.S. helps pay for Israel’s military \nWhat could convince Egypt to take Gaza’s refugees? \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9a17004a552c1c39b783ceefe58ae1ac0de55b57",
      "title": "EastEnders actress added to Strictly Come Dancing",
      "url": "https://www.bbc.com/news/articles/cly3318nrmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T06:47:52.000Z",
      "summary_90w": "",
      "raw": "She joins the likes of Dani Dyer and Jimmy Floyd Hasselbaink on the BBC dance floor show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "429d766613c7eb6cc971d789bb3898a0104055a2",
      "title": "Italian athlete dies after collapse at World Games",
      "url": "https://www.bbc.com/sport/articles/c24zr5590nvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T06:30:30.000Z",
      "summary_90w": "",
      "raw": "Italian athlete Mattia Debertolis dies after collapsing during orienteering event in China.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "429d766613c7eb6cc971d789bb3898a0104055a2",
      "title": "Italian athlete dies after collapse at World Games in China",
      "url": "https://www.bbc.com/sport/articles/c24zr5590nvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T06:30:30.000Z",
      "summary_90w": "",
      "raw": "Italian athlete Mattia Debertolis dies after collapsing during orienteering event in China.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1646d35a389c9d4c755c605f8e234929022ac9a",
      "title": "Worst bleaching on record for Western Australian coral reefs",
      "url": "https://www.bbc.com/news/articles/cq877llq099o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:45:39.000Z",
      "summary_90w": "",
      "raw": "Scientists say the damage was caused by the \"longest, largest and most intense\" marine heatwave on record.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "190dc4d813dea7dc3041531ea95eaf389f5f06cd",
      "title": "How a Red Bull can helped solve the mystery of a missing cyclist",
      "url": "https://www.bbc.com/news/articles/c9d0j2y3w3eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:27:50.000Z",
      "summary_90w": "",
      "raw": "Dr Caroline Muirhead helped lead police to the spot where Tony Parsons had been buried after a confession from her boyfriend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "663c4c24e0da68deec2e5073c9574745f0b7b55f",
      "title": "'I said yes to them' - when star striker Robert Lewandowski nearly joined Man Utd",
      "url": "https://www.bbc.com/sport/football/articles/c0kz3xnd0e8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:26:41.000Z",
      "summary_90w": "",
      "raw": "Robert Lewandowski discusses the time he \"said yes\" to a Man Utd move, the influence of Jurgen Klopp and why the sky is the limit for Lamine Yamal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42e72ed855d3e1f7f063ebf62f528b234220f941",
      "title": "North Koreans tell BBC they are being sent to work 'like slaves' in Russia",
      "url": "https://www.bbc.com/news/articles/c2077gwjlvxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:10:26.000Z",
      "summary_90w": "",
      "raw": "More than 50,000 North Koreans will be sent to work in Russia, as Moscow's war in Ukraine drains labour pools.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6c64959d1d5f25c063b5d48b562fddf0b5b3b9d",
      "title": "Knee-replacement implant used on thousands of NHS patients was known to be faulty for years",
      "url": "https://www.bbc.com/news/articles/cqxgen498ejo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:00:19.000Z",
      "summary_90w": "",
      "raw": "Patients say they were left immobile or addicted to painkillers after receiving the NexGen implant.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83f0597a9ce0b00131e190899f448d494d77e1aa",
      "title": "Australia PM says Israel's Netanyahu 'in denial' about Gaza war",
      "url": "https://www.bbc.com/news/articles/c79lvw4q9ylo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T04:53:05.000Z",
      "summary_90w": "",
      "raw": "Albanese had earlier said Australia would recognise a Palestinian state at the UN General Assembly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0316d3cea8a7aff3ea604484051626b6598a6b9f",
      "title": "TDK backs Ultraviolette with $21M to take India-made electric motorcycles global",
      "url": "https://techcrunch.com/2025/08/11/tdk-backs-ultraviolette-with-21m-to-take-india-made-electric-motorcycles-global/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T04:30:00.000Z",
      "summary_90w": "",
      "raw": "Ultraviolette aims to expand its electric motorcycles to 40 European countries, as well as Latin America and Southeast Asia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "df9e0ad64148d9121fe65b8cbbcc9d9adc4d767c",
      "title": "Migrants swim from Morocco to Ceuta as officials say enclave ‘overwhelmed’",
      "url": "https://www.theguardian.com/global-development/2025/aug/12/migrants-swim-from-morocco-to-ceuta-as-officials-say-enclave-overwhelmed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T04:00:12.000Z",
      "summary_90w": "",
      "raw": "Seven children reach shore as dozens of people intercepted on risky route, which authorities say is now used more often\nAbout 100 people, including several children, risked their lives by trying to swim from Morocco into Spain’s north African enclave of Ceuta early on Saturday morning, as the territory’s authorities warned that its overwhelmed reception system was close to collapse.\nRecent weeks have seen a rise in the number of people trying to reach Ceuta, with more than 50 children swimming across from Morocco on 26 July alone.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e24f31a2497c361bf36a68a8df00611cd5f89ffe",
      "title": "Spanish town ordered to scrap religious festivals ban mainly impacting Muslims",
      "url": "https://www.theguardian.com/world/2025/aug/12/spanish-town-jumilla-ordered-to-scrap-ban-on-muslim-religious-festivals-in-public-spaces",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T04:00:11.000Z",
      "summary_90w": "",
      "raw": "Jumilla’s ban on gatherings in public sports centres breaches right to religious freedom, says Madrid\nSpain’s central government has ordered officials in a Spanish town to scrap a ban on religious gatherings in public sports centres, describing it as a “discriminatory” measure that breaches the right to religious freedom as it will mainly impact Muslims.\n“There can be no half-measures when it comes to intolerance,” Ángel Víctor Torres, the minister for territorial policy, wrote on social media on Monday. Rightwing opposition parties, he added, “cannot decide who has freedom of worship and who does not”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a877128dbbdc1a63c8342727ddbe3cba7b6578be",
      "title": "Flames near Madrid as wildfires burn across Spain and Portugal",
      "url": "https://www.bbc.com/news/videos/c8ryvxlr6dlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T03:32:17.000Z",
      "summary_90w": "",
      "raw": "Emergency crews are battling wildfires as a record-breaking heatwave continues across Europe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a877128dbbdc1a63c8342727ddbe3cba7b6578be",
      "title": "Watch: Flames near Madrid as wildfires burn across Spain and Portugal",
      "url": "https://www.bbc.com/news/videos/c8ryvxlr6dlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T03:32:17.000Z",
      "summary_90w": "",
      "raw": "Emergency crews are battling wildfires as a record-breaking heatwave continues across Europe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73cf07328170cce13dfaf7d0aa4cab1fe4f18118",
      "title": "Migrant sentenced to life for murdering Maryland mum in case invoked by Trump",
      "url": "https://www.bbc.com/news/articles/c1dxxddqqz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T02:58:47.000Z",
      "summary_90w": "",
      "raw": "The victim's mother told the court:  \"The brutality of her murder will haunt us for the rest of our lives.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35fc222667fc389e94a19049e783c94f98244fe6",
      "title": "Ronaldo engaged to long-term partner Georgina Rodríguez",
      "url": "https://www.bbc.com/news/articles/c7vll24y0nzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T02:00:35.000Z",
      "summary_90w": "",
      "raw": "Rodríguez shared the news on Instagram, writing \"Yes I do. In this and in all my lives\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e9a518ff89e9b1ca685addff597dde05219882a",
      "title": "Nepal offers free climbs to 97 peaks as tourism to Everest surges",
      "url": "https://www.bbc.com/news/articles/c0j99xxd1z1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T01:55:25.000Z",
      "summary_90w": "",
      "raw": "Most tourists visiting Nepal head to Everest, which has seen overcrowding and increased pollution.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e2d8102d0d733b7e27759e9e3e4c2ef52e59ccc",
      "title": "Two dead and 10 injured in Pennsylvania steel plant explosion",
      "url": "https://www.bbc.com/news/articles/ckgjj49neldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T01:29:17.000Z",
      "summary_90w": "",
      "raw": "A second death is confirmed after a search operation for a missing person stretched into Monday evening.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dd539637d168a104bbcbdcb657e736b770656ef",
      "title": "Rise in dengue fever outbreaks across the Pacific driven by the climate crisis, experts say",
      "url": "https://www.theguardian.com/world/2025/aug/12/dengue-fever-outbreaks-samoa-fiji-tonga-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T00:58:44.000Z",
      "summary_90w": "",
      "raw": "Samoa, Fiji and Tonga among the worst affected amid warning the disease and others will become ‘more common and more serious’ as the planet warms\nThe climate crisis is driving a sharp rise in dengue fever cases across the Pacific islands, experts say, as infections hit their highest level in a decade and several countries declare emergencies.\nPacific Island countries and territories have reported 16,502 confirmed cases and 17 deaths since the start of 2025, according to the Pacific Syndromic Surveillance System (PSSS), which collaborates with the World Health Organization (WHO) and other agencies. Infections across the region are at the highest level since 2016, the WHO said. Fiji, Samoa and Tonga are among the worst affected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0774d63d5c37b1fa17f74b70deda796bffaf3e8",
      "title": "Pronto’s 10-minute house help pitch sparked a 3.6x valuation jump in just 90 days",
      "url": "https://techcrunch.com/2025/08/11/prontos-10-minute-house-help-pitch-sparked-a-3-6x-valuation-jump-in-just-90-days/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T00:30:00.000Z",
      "summary_90w": "",
      "raw": "Pronto has raised $11 million in an all-equity Series A round co-led by General Catalyst and Glade Brook Capital at a post-money valuation of $45 million.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5519d5a678d59190318366aa73e1b88158d1c48",
      "title": "Tibetans in India long for identity and homeland",
      "url": "https://www.bbc.com/news/articles/ce87v5n2n2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T23:39:59.000Z",
      "summary_90w": "",
      "raw": "Many fear they could lose the long-standing support that sustained the community after the current Dalai Lama passes away.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bbdf52cc08492970e8253669e31882b50f69d80",
      "title": "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce",
      "url": "https://techcrunch.com/2025/08/11/seoul-based-datumo-raises-15-5m-to-expand-llm-evaluation-challenging-scale-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T23:00:00.000Z",
      "summary_90w": "",
      "raw": "Datumo began as an AI data labeling company and now wants to help businesses build safer AI with tools and data that enable testing, monitoring, and improving their models — without requiring technical expertise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5ebcf134e3c630af6cdd7c2917113af663672cbe",
      "title": "Is crime in Washington DC 'out of control', as Trump claims?",
      "url": "https://www.bbc.com/news/articles/c8600x7dnn4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T22:23:22.000Z",
      "summary_90w": "",
      "raw": "President Trump says he will deploy hundreds of troops to Washington DC to address crime there.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a565b76075891591c6779aeaf18f41680d74425",
      "title": "Palestinian reporters killed, international reporters banned – Israel’s other Gaza war is over narrative",
      "url": "https://www.theguardian.com/world/2025/aug/11/palestinian-reporters-killed-and-foreigners-barred-in-israels-battle-for-gaza-narrative",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T22:17:10.000Z",
      "summary_90w": "",
      "raw": "Members of press and influencers covering devastation are being silenced despite protection under international law\n\nAnas al-Sharif, prominent Al Jazeera correspondent, among five journalists killed in Israeli airstrike on Gaza\n\n\nIsrael is running two Gaza campaigns: one for military control of the strip; another for narrative control of how the world understands what happens there.\nIn theory, Palestinian journalists and social media influencers documenting starvation, mass killing and other Israeli war crimes in Gaza are protected civilians under international law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76623f799ee8438f072a60dc622e788fbfa0b125",
      "title": "Slow Ventures cuts first check from $60M creator fund into woodworking founder",
      "url": "https://techcrunch.com/2025/08/11/slow-ventures-cuts-first-check-from-60m-creator-fund-into-woodworking-founder/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T22:00:00.000Z",
      "summary_90w": "",
      "raw": "This marks the first investment for Slow’s $60 million Creator Fund since its launch in February. The fund looks to help creators launch businesses, under the belief that what made them successful influencers is what can also make them a good founder.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "233bd258facdfe8421fa06339878ccd402c8a8a2",
      "title": "iOS 26 beta 6 adds new ringtones, snappy app launches, and more",
      "url": "https://techcrunch.com/2025/08/11/ios-26-beta-6-adds-new-ringtones-snappy-app-launches-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T20:39:31.000Z",
      "summary_90w": "",
      "raw": "The new developer beta release, iOS 26 beta 6, adds new ringtones, faster app launches, and fixes the Camera swipe direction issues.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "af85864c1e11ea8240eccf21840be0fe76305f4e",
      "title": "Canada wildfire season already second worst on record as experts warn of ‘new reality’",
      "url": "https://www.theguardian.com/world/2025/aug/11/canada-wildfire-season",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T20:08:49.000Z",
      "summary_90w": "",
      "raw": "More than 470 Canadian fires classified as ‘out of control’ as scientists say climate change exacerbating the burning\nWith hundreds of wildfires burning out of control, Canada’s 2025 fire season is already the second-worst on record, as scientists report climate change is prolonging and exacerbating the burning, leading to more destruction, evacuations and smoke-filled skies.\nMore than 470 fires across the country are currently classified as “out of control”, according to the Canadian Interagency Forest Fire Centre (CIFFC).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d765fa57cdb5f39c656d5f8309d93d82d7e5da6",
      "title": "Poshmark CEO and founder to step down",
      "url": "https://techcrunch.com/2025/08/11/poshmark-ceo-and-founder-to-step-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T19:38:57.000Z",
      "summary_90w": "",
      "raw": "After nearly 15 years, Manish Chandra will transition to being a member of the board of directors. Namsun Kim, who has served as executive chairman since April, has been appointed as his successor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31bf8884ed02789120e6304ec2612079df67c0d4",
      "title": "US government seized $1M from Russian ransomware gang",
      "url": "https://techcrunch.com/2025/08/11/u-s-government-seized-1-million-from-russian-ransomware-gang/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T19:04:12.000Z",
      "summary_90w": "",
      "raw": "A global law enforcement coalition targeted the infrastructure of the group behind the Royal and BlackSuit ransomware strains, allegedly responsible for extorting victims out of $370 million since 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb3f2b174f284d9d91773d2e012e8222083373dc",
      "title": "‘I risked everything’: remembering six media workers killed by Israel in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/11/i-risked-everything-remembering-six-media-workers-killed-by-israel-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T18:50:23.000Z",
      "summary_90w": "",
      "raw": "CJP says the period since 7 October 2023 has been the most deadly for journalists since it began gathering data in 1992\nJournalists have been prominent among casualties since the war in Gaza was triggered by Hamas’s incursion into Israel in October 2023.\nSome were working for well-known international media, others were employed by local news organisations. Several were high-profile veterans, but many were newcomers to the profession.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "880947313919ee8f43c8384cfeae8b3e5c57869f",
      "title": "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdfhf?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:42:00.000Z",
      "summary_90w": "",
      "raw": "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a5e209010f29b91e5f74430190a107b11d6971d",
      "title": "How founders are ditching VC norms and finding capital on their own terms at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/11/how-founders-are-ditching-vc-norms-and-finding-capital-on-their-own-terms-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T18:38:22.000Z",
      "summary_90w": "",
      "raw": "Founders today have more capital paths than ever. But how do you navigate them — and know which one actually supports your growth?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a691470abc6f7adf58d4178f1636c062bd040ea0",
      "title": "UN condemns targeted Israeli attack that killed five Al Jazeera journalists",
      "url": "https://www.bbc.com/news/articles/cq688qz3rlro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T17:47:23.000Z",
      "summary_90w": "",
      "raw": "Israel says it targeted correspondent Anas al-Sharif, accusing him of leading a Hamas cell, which he had denied. Israel provided little evidence for the claim.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f02a184dd2709ae67aff294da35e91c5fddd34d0",
      "title": "Ocean’s new app brings inbox triage, tasks, and invites to Gmail users",
      "url": "https://techcrunch.com/2025/08/11/oceans-new-app-brings-inbox-triage-tasks-and-invites-to-gmail-users/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T17:46:50.000Z",
      "summary_90w": "",
      "raw": "Ocean debuts an email app for Gmail users with triage tools, a task manager, and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dfb2e0528b6a377701da8a28591133ced3c85bd",
      "title": "Moment suspects carjack a tanker lorry during police pursuit in LA",
      "url": "https://www.bbc.com/news/videos/ceqyypv5942o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T17:29:49.000Z",
      "summary_90w": "",
      "raw": "A pair of armed carjackers stole at least three vehicles, including a truck, that led to a police pursuit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f99749bd627cd94c4aab9fa9e94d1548e34d65f6",
      "title": "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more",
      "url": "https://techcrunch.com/2025/08/11/made-by-google-2025-how-to-watch-google-debut-the-pixel-10-pixel-watch-4-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T17:12:20.000Z",
      "summary_90w": "",
      "raw": "Google is hosting its Pixel 10 event next week. Learn how to watch the tech giant reveal its new mobile devices and what else you can expect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d15c95b0abc5fcd03ab193b618d2014132d96b3",
      "title": "Trump administration stops illegal freeze of $5B EV charger funds after losing in court",
      "url": "https://techcrunch.com/2025/08/11/trump-administration-stops-illegal-freeze-of-5b-ev-charger-funds-after-losing-in-court/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T17:12:08.000Z",
      "summary_90w": "",
      "raw": "The money is on the table again, but with fewer requirements for proving out safety, environmental impacts, and inclusion of minority- and women-owned businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d204a92b3d807ffd139b0983ff1c872283552f7d",
      "title": "Harry and Meghan sign new multi-year Netflix deal",
      "url": "https://www.bbc.com/news/articles/cvgnne6lznzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T17:06:32.000Z",
      "summary_90w": "",
      "raw": "It's a looser arrangement than their previous deal - and comes ahead of a second series of Meghan's cookery show being screened later this month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6851b8fb0ebe0663ab3c156875f072b49783a527",
      "title": "Mourners gather amid outrage over Israeli troops’ killing of journalists in Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/11/israel-gaza-war-anas-al-sharif-al-jazeera-benjamin-netanyahu-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T17:02:08.000Z",
      "summary_90w": "",
      "raw": "UN condemns killing of Anas al-Sharif and colleagues, calling it a ‘grave breach of international humanitarian law’\nAnas al-Sharif among five journalists killed in Israeli airstrike\nReporters Without Borders has condemned the “acknowledged murder by the Israeli army” of Al Jazeera correspondent Anas al-Sharif in Gaza, who the armed forces admitted they had targeted, along with several of his colleagues.\nThe press freedom campaign group told news agency AFP it “strongly and angrily condemns the acknowledged murder by the Israeli army” of al-Sharif and other journalists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c8d01b364de46314b41670466b7287c42930d34",
      "title": "‘Death spiral’: Mekong River megafish have shrunk by half, study reveals",
      "url": "https://www.theguardian.com/environment/2025/aug/11/mekong-river-megafish-shrunk-by-half-study-overfishing-dams-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T17:00:09.000Z",
      "summary_90w": "",
      "raw": "Fish once as large as grizzly bears have become far smaller in recent years due to overfishing, dams and climate crisis\nThe size of megafish in the Mekong River has shrunk alarmingly in recent years owing to overfishing, a study has found. The length of the largest and most endangered freshwater giants, some as big as grizzly bears, decreased by 40% in seven years.\nSome fish, like the Mekong giant catfish, have been studied for over a longer period and show a decline in weight of 55% in the past 25 years, dropping from an average of 180kg (397lb) to 80kg.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d40fb478cd771fbbbfcf1c9f64be7125bddf97ff",
      "title": "Ghislaine Maxwell court materials to stay secret, judge rules",
      "url": "https://www.bbc.com/news/articles/c1jnn2r7r47o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T16:30:07.000Z",
      "summary_90w": "",
      "raw": "The judge said there was nothing new to learn from the materials, and releasing them could hurt future grand jury proceedings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee2697c4648551522e49bb73913b47d0916623f2",
      "title": "GitHub CEO to step down",
      "url": "https://techcrunch.com/2025/08/11/github-ceo-to-step-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:25:01.000Z",
      "summary_90w": "",
      "raw": "The move comes as GitHub is facing growing competition from companies like Google and Cursor over AI tools for programmers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0cef7e8e3c521fed6938ca7fff5ba9c5d2d74739",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/11/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:22:05.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed200b3f3c222ffca2a8710b602f4ff2adf7d4e9",
      "title": "Colombian senator Miguel Uribe dies after June campaign shooting",
      "url": "https://www.theguardian.com/world/2025/aug/11/colombian-senator-miguel-uribe-dies-after-june-campaign-shooting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T16:18:58.000Z",
      "summary_90w": "",
      "raw": "Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39\nMiguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.\nUribe, an opposition candidate with the rightwing Centro Democrático party, was shot twice in the head and once in the leg during a campaign stop two months ago while vying for his party’s nomination for the 2026 elections.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5749a3266ac0f0dc79c438612428d00ed2f0a5c",
      "title": "TechCrunch Mobility: The triple punch headed for automakers",
      "url": "https://techcrunch.com/2025/08/11/techcrunch-mobility-the-triple-punch-headed-for-automakers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:06:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e66519a8a7a15f8cc688272ca6a20dc964aef788",
      "title": "Electronic Arts blocks more than 300,000 attempts to cheat after launching Battlefield 6 beta",
      "url": "https://techcrunch.com/2025/08/11/electronic-arts-blocks-more-than-300000-attempts-to-cheat-after-launching-battlefield-6-beta/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T16:01:30.000Z",
      "summary_90w": "",
      "raw": "Soon after the launch of first-person shooter Battlefield 6, cheaters flooded the games, forcing Electronic Arts to respond.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded8323ef01c9a8645666d22f063db1c60abf5a6",
      "title": "Revel shuts down its ride-hail business to focus on EV charging",
      "url": "https://techcrunch.com/2025/08/11/revel-shuts-down-its-ride-hail-business-to-focus-on-ev-charging/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T15:33:14.000Z",
      "summary_90w": "",
      "raw": "Revel has abandoned its small Uber and Lyft competitor four years after it started, and is looking to sell or return its bright-blue Tesla and Kia EVs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "714eb0e154ca54f52b2aee51a900cb1cc5349b5f",
      "title": "Nvidia unveils new Cosmos world models, infra for robotics and physical uses",
      "url": "https://techcrunch.com/2025/08/11/nvidia-unveils-new-cosmos-world-models-other-infra-for-physical-applications-of-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Nvidia on Monday unveiled a set of new world AI models, libraries, and other infrastructure for robotics developers, most notable of which is Cosmos Reason, a 7-billion-parameter \"reasoning\" vision language model for physical AI applications and robots.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68f358f6bc037412af4a5d3379d94d256bec4a0e",
      "title": "Colombian Senator Miguel Uribe dies two months after being shot",
      "url": "https://www.bbc.com/news/articles/c78mmj97ygmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T14:55:18.000Z",
      "summary_90w": "",
      "raw": "Miguel Uribe has died of injuries he sustained in a targeted attack on his life at a rally in June.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "446fae1a124b3bce49b50f995037861331169278",
      "title": "Elon Musk confirms shutdown of Tesla Dojo, ‘an evolutionary dead end’ ",
      "url": "https://techcrunch.com/2025/08/11/elon-musk-confirms-shutdown-of-tesla-dojo-an-evolutionary-dead-end/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-11T14:50:26.000Z",
      "summary_90w": "",
      "raw": "“Once it became clear that all paths converged to AI6, I had to shut down Dojo and make some tough personnel choices, as Dojo 2 was now an evolutionary dead end,” Musk posted on X, the social media platform he owns, on Sunday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6064bc6d9692689547530b924ce5bc54344ba707",
      "title": "Eight people killed in barrage of gunfire on Ecuador nightclub",
      "url": "https://www.theguardian.com/world/2025/aug/11/eight-people-killed-ecuador-nightclub",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:43:11.000Z",
      "summary_90w": "",
      "raw": "Police found 800 cartridge cases at the scene, where gunmen had arrived in two pickup trucks and opened fire\nEight people have been killed and two others wounded when a group of gunmen unleashed a barrage of gunfire on a crowd outside a nightclub in a town in south-western Ecuador.\nLaw enforcement arrived on the scene following an emergency call alerting them to a shooting, and found “several people wounded and seven bodies”, said Javier Chango, the police colonel, at a press conference on Sunday, adding that an eighth person died in the hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66db2f710278fec589a05ac0d76920d7f45fa942",
      "title": "Palestinian activist killed by settler filmed his shooting, footage shows",
      "url": "https://www.theguardian.com/world/2025/aug/11/awdah-hathaleen-shooting-video-west-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T13:26:14.000Z",
      "summary_90w": "",
      "raw": "B’Tselem publishes film showing killing of Awdah Hathaleen after suspect released by court over ‘weakened’ evidence\n\nMiddle East crisis – latest updates\n\nAwdah Hathaleen, the prominent Palestinian activist who was killed late last month by an extremist Jewish settler in the West Bank, filmed the moment he was shot, newly released video footage reveals.\nHathaleen, who worked on the filming of the Oscar-winning documentary No Other Land, which examined settler violence against the Palestinian community of Masafer Yatta, was killed by Yinon Levi, a settler who was already under sanctions in the UK and EU for violent acts against Palestinians.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d92ae6c8c0f15774840e61591d47f0fe5e413f62",
      "title": "Outrage as baby dies after genital mutilation in The Gambia",
      "url": "https://www.bbc.com/news/articles/c6200g5d4jlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T12:28:30.000Z",
      "summary_90w": "",
      "raw": "Two women have been arrested for their alleged involvement in the girl's death, police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b6003219965f1b2897cd364ed9369c51167aabc",
      "title": "Farmers displaced by $1.5bn Trump golf course reportedly being offered rice and cash",
      "url": "https://www.theguardian.com/world/2025/aug/11/farmers-displaced-trump-golf-course",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T11:07:50.000Z",
      "summary_90w": "",
      "raw": "White House denies suggestions resort in Vietnam presents conflict of interest amid row over compensation rates\nVillagers whose farms in Vietnam will be bulldozed to make way for a $1.5bn golf resort backed by the Trump family have reportedly been offered rice provisions and cash compensation of as little as $12 for a square metre of land by state authorities.\nThousands of villagers will be offered compensation based on land size and location, according to a report by Reuters. The agency spoke to elderly farmers who said they feared they would struggle to find a stable livelihood.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "441807ddb64b0246b9323978db7b23b42d256aff",
      "title": "Weather tracker: Europe braces for another heatwave with highs of 44C",
      "url": "https://www.theguardian.com/environment/2025/aug/11/weather-tracker-europe-heatwave-spain-portugal-north-america",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T10:26:47.000Z",
      "summary_90w": "",
      "raw": "Parts of Spain and Portugal likely to bear brunt of heat, while drought conditions sweep North America\n\nEurope live – latest updates\n\nAfter a period of cooler weather, swaths of central and eastern Europe face another heatwave as hot air over south-western Europe pushes north-west.\nSince late July, large parts of the Iberian peninsula have endured persistent heat, with temperatures frequently climbing to the high 30s to low 40s celsius.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ce7f0de56478b344de0d016c1792b75486304d",
      "title": "Delhi given eight weeks to round up hundreds of thousands of stray dogs ",
      "url": "https://www.bbc.com/news/articles/cly665zjg2eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:22:02.000Z",
      "summary_90w": "",
      "raw": "Activists say it will be difficult to move over a million stray dogs to shelters within eight weeks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f86f2b14d072b4d96758ad8c0d7172778b83d9e5",
      "title": "British man who perished in Antarctic glacier found 65 years later",
      "url": "https://www.bbc.com/news/articles/c4g034yx4gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T09:05:51.000Z",
      "summary_90w": "",
      "raw": "His brother tells BBC News that he had lost hope he would ever be found.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d369b043fb360561f4eacbf65523dbf297880eb4",
      "title": "Factories from GE to Kraft Heinz lose immigrant workers, stressing those who remain",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496335/trump-immigration-workers-parole-tps",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump campaigned on helping American workers through his immigration policies. Now that he's revoked work authorization for thousands of immigrants, those left behind are feeling taxed by their absence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "88f224a667546254d25af6df313cfb4eded31142",
      "title": "Trump's tariff revenue has skyrocketed. But how big is it, really?",
      "url": "https://www.npr.org/2025/08/11/g-s1-81934/trump-tariffs-record-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump's new tariffs are pouring in. But it's still only a fraction of overall government revenues — and falls short of new spending in the recent Republican megabill.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "022d6c9011ee1101105ea6d644b311ccd9b3d3d8",
      "title": "Growing pains: can rice production in Africa keep up with demand?",
      "url": "https://www.theguardian.com/world/2025/aug/11/can-rice-production-in-africa-keep-up-with-demand",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T07:21:32.000Z",
      "summary_90w": "",
      "raw": "Africa Rice initiative aims to give farmers more control over their land in order to reduce flooding and increase yields\nSalmata Ouattara remembers 2023 as the turning point for her rice farm.\nJune is usually the peak of the rainy season in Ivory Coast, but in the preceding years she and other farmers in M’Be on the outskirts of Bouaké, the country’s second biggest city, would wait weeks for rainfall. Then in September, they would watch helplessly as their farmlands were flooded. Some abandoned their farms, frustrated by fluctuating crop yields.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f0cba1ce4f971e6dfe974a4aa734e9b97063a8b",
      "title": "What we're reading on the beach this summer",
      "url": "https://www.npr.org/2025/08/11/1257106922/what-were-reading-on-the-beach-this-summer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T07:00:59.000Z",
      "summary_90w": "",
      "raw": "It's time for our annual beach reading recs. Today we bring you three books, with a little economic learning to boot. Our recs: \nWho is Government? The Untold Story of Public Service by Michael Lewis \nEl Dorado Drive by Megan Abbott \nAlgospeak: How Social Media is Transforming the Future of Language by Adam Aleksic \nRelated episodes: \nBeach reading with a side of economics How to beach on a budget \nHow to beach on a budget \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ea131997d68ef45d7a7fd94d748204d2ff4544ef",
      "title": "New voters list in Indian state includes wrong photos and dead people",
      "url": "https://www.bbc.com/news/articles/c3wnx7689l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-10T23:22:21.000Z",
      "summary_90w": "",
      "raw": "A political row has broken out over India's Election Commission's decision to update the rolls in Bihar.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe6c7ce90325a67bd27a5e6670771b6f6f05f0f0",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "summary_90w": "",
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35f5b7f5a08af746467e75b951d1769e913f63c0",
      "title": "Businesses can use your online data to overcharge you. What can customers do?",
      "url": "https://www.npr.org/2025/08/10/nx-s1-5494712/businesses-can-use-your-online-data-to-overcharge-you-what-can-customers-do",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-10T12:41:15.000Z",
      "summary_90w": "",
      "raw": "NPR's Adrian Ma speaks to Sam Levine, former director of the FTC's Bureau of Consumer Protection, now at UC Berkeley, about the use online data to charge some customers more for products and services.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b738ea59ed9d06875f61ea110fc61fe764a33fe",
      "title": "Bolsonaro supporters pray for Trump rescue as coup plot trial verdict nears",
      "url": "https://www.theguardian.com/world/2025/aug/09/bolsonaro-supporters-pray-for-trump-rescue-coup-plot-trial-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-09T09:00:02.000Z",
      "summary_90w": "",
      "raw": "Far-right ex-president’s devotees pin hopes on pressure campaign but tariffs and sanctions appear likely to fail\nEach morning, Edite Costa steps out of her bungalow on Brasília’s sun-baked savannah, stands beneath a mango tree and lifts her hands to the sky in prayer. “I ask God to work so that not just Trump but all Americans come to help us rip out the evil that has taken hold of the country I love,” said the 66-year-old Baptist, who is a fervent supporter of Brazil’s far-right former president Jair Bolsonaro.\nBolsonaro could face decades in jail for allegedly leading a murderous conspiracy to seize power after his leftwing rival Luiz Inácio Lula da Silva beat him in the 2022 presidential election. But Costa believes her populist leader can still be saved – if her prayers are answered and Donald Trump intervenes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87e0cb3806c43dd5fbc2c815f724788e794b20aa",
      "title": "Elon Musk's AI accused of making explicit AI Taylor Swift videos",
      "url": "https://www.bbc.com/news/articles/cwye62e1ndjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T23:06:01.000Z",
      "summary_90w": "",
      "raw": "Grok Imagine's \"spicy\" mode made explicit videos of Taylor Swift, according to The Verge and Gizmodo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a0cffe0b1719cb447d49291529b1e9b8f862e00",
      "title": "OpenAI beats Elon Musk's Grok in AI chess tournament",
      "url": "https://www.bbc.com/news/articles/ce830l92p68o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T11:37:19.000Z",
      "summary_90w": "",
      "raw": "The tournament saw models from Anthropic, Google, xAI and DeepSeek compete against each other to be crowned the top AI chess player.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "527f8f76888890f9006a32ef3b3f42d67e941604",
      "title": "How to get out of a love-hate relationship with your phone",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492392/phone-addiction",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Finding it hard to concentrate? Are you glued to social media for longer than you’d like? Well, maybe it’s not you… maybe it’s the phones.\n\nBrittany is joined by Magdalene Taylor, writer, cultural critic and senior editor at Playboy, and Fio Geiran, producer at TED Radio Hour and a writer of their Body Electric newsletter, to discuss this phrase: “it’s the phones.” They get into the effects that smartphones have on our brains and our culture, why some people are returning to “dumbphones,” and why it might take more than willpower to manage our relationships with our phones.\nClick here to check out the Body Electric newsletter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1f9673f0113254421ab14083f82fb80ecce702c",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "summary_90w": "",
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3a116098e95d5d8b862a9758d74ef9afaec1ce",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "summary_90w": "",
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "690acb123904939b5719f42c39d3568c6f9c677f",
      "title": "It's 2025, the year we decided we need a widespread slur for robots",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5493360/clanker-robot-slur-star-wars",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People all over TikTok and Instagram are using the word \"clanker\" as a catch-all for robots and AI. Here's a deep dive into the origins of the pejorative and an explanation of why it's spreading.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb5fed10d4a083eb417cdeb5c2a39344a4c35a78",
      "title": "Nihilistic online networks groom minors to commit harm. Her son was one of them",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5479882/teen-forums-violent-extremist-grooming",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Dana's son was hospitalized last year, it led her to a path of discovery about predatory online networks that groom children into harming themselves and others. Their reach is global and growing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66ced3c97746b3b0d64269796bb661b6d428ffdd",
      "title": "So long, study guides? The AI industry is going after students",
      "url": "https://www.npr.org/2025/08/06/g-s1-81012/chatgpt-ai-college-students-chegg-study",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Students are increasingly using AI tools to help with — and do — their homework. Here's how older online study services, students and professors are adapting.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0e07eb5c626c839c8247e2cbe798ad520796112f",
      "title": "Tech Life",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6zp2?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T19:30:00.000Z",
      "summary_90w": "",
      "raw": "China’s DeepSeek took the AI world by storm this year. Where is it now? And: AI doomsday?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8c99c5c638c53b30027e9a9648b98e72b5ba5c9",
      "title": "The history behind the QR code",
      "url": "https://www.bbc.com/news/videos/c1jnpkdjjryo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:24:56.000Z",
      "summary_90w": "",
      "raw": "It's used by millions of us every day, but why was the Quick Response code invented?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4548a6b956cd3bd0e05948b4dcb11e63bb9d6b51",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002gw67?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:00:00.000Z",
      "summary_90w": "",
      "raw": "Joe Tidy explores how the rise of artificial intelligence may play out.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b247f10f2df4bdf9312924806cdc968fb5a578c0",
      "title": "The Gulf bets big on AI as it seeks the 'new oil'",
      "url": "https://www.bbc.com/news/articles/cvg8z2mx508o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T23:14:44.000Z",
      "summary_90w": "",
      "raw": "The UAE and Saudi Arabia are partnering with the US to position themselves as AI hubs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d20c2ce25c13cec7ba044f41abd29d0618288f2e",
      "title": "Minister must apologise over Savile claim, says Farage",
      "url": "https://www.bbc.com/news/articles/cgery3eeqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T11:28:07.000Z",
      "summary_90w": "",
      "raw": "Minister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cc9359fecc24e9e22f350119da85d0276d2276e",
      "title": "Google launches new AI search feature in UK",
      "url": "https://www.bbc.com/news/articles/clyj4zky4zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T08:43:59.000Z",
      "summary_90w": "",
      "raw": "The new tool marks a significant change for the search giant but raises questions for advertisers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}