{
  "version": "1755031140164",
  "generatedAt": "2025-08-12T20:39:00.164Z",
  "items": [
    {
      "id": "899c36185a28a4899b5d0d63997dc05add8b81fe",
      "title": "England enters fourth heatwave of summer with 'nationally significant' water shortfalls",
      "url": "https://www.bbc.com/news/articles/czerrzdewzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T20:33:47.000Z",
      "summary_90w": "",
      "raw": "Temperatures reach 33.4C in London, as officials warn of a lack of water in England.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffeea7377f33ba59d76b830353b6dae1a85dfa23",
      "title": "Richardson to seek help following airport arrest",
      "url": "https://www.bbc.com/sport/athletics/articles/czerwyj2zgno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T20:29:46.000Z",
      "summary_90w": "",
      "raw": "American sprinter Sha'Carri Richardson says she will seek help following her arrest over allegations of domestic violence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99251952bc196d5f7116ce6637425e15375cc3a0",
      "title": "Russian government hackers said to be behind US federal court filing system hack: report",
      "url": "https://techcrunch.com/2025/08/12/russian-government-hackers-said-to-be-behind-us-federal-court-filing-system-hack-report/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T20:26:09.000Z",
      "summary_90w": "",
      "raw": "Officials are reportedly blaming a recent breach of the U.S. federal court's filing system on Russia, whose hackers used the access to snoop on midlevel criminal cases in the New York City area and other jurisdictions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cb20a140c85da1dc8b0f176c8b6e308db2a09a02",
      "title": "League of Legends is testing a new WASD control scheme, 16 years in",
      "url": "https://www.theverge.com/news/758360/league-of-legends-wasd-keyboard-control-riot-games",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T20:03:55.000Z",
      "summary_90w": "",
      "raw": "Riot Games is going to slowly introduce a WASD-based control scheme to League of Legends, which previously relied on point and click controls. “We believe that offering WASD controls will provide a fresh yet familiar way to play for both new players and veterans of the Rift without changing what makes League, League,” Riot says.\nThe company notes that WASD is “the most familiar control scheme for PC games today,” and by adding it as a control option, “we believe League will feel more intuitive to some players who come from other games.” However, Riot is also working to “ensure competitive balance” between the two different control styles, so it’s going to start with a test of the control scheme on League’s public beta environment before slowly rolling it out to non-ranked and eventually ranked and pro play.\nLeague of Legends launched nearly 16 years ago, and while it’s a hugely popular game, it has a reputation for being pretty intimidating to get into. Despite having watched many hours of competitive League, whenever I’ve tried to play it myself, I’ve quickly bounced because of its complexity. WASD controls could lower the barrier to entry, and Riot says that they are “the first of a number of long-term projects we’re working on to help shape League’s future.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adca3c4507b230dace78a48f21edeb1c0e072c66",
      "title": "Trump administration rewrites and scales back annual human rights report",
      "url": "https://www.bbc.com/news/articles/cwy0lejvw25o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T19:56:50.000Z",
      "summary_90w": "",
      "raw": "The report reduces criticism of some US allies like Israel, and escalates disapproval of perceived foes such as Brazil.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a98708c0eb5ca3eaf01d4d7690567fe460ffe565",
      "title": "The best foldable phone you can buy",
      "url": "https://www.theverge.com/tech/635839/best-foldable-phone",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T19:43:23.000Z",
      "summary_90w": "",
      "raw": "A foldable phone isn’t for the faint of heart. They’re generally heavier, pricier, and have less capable cameras than a standard slab-style phone. And while they’re far less fragile than when they first debuted, foldables are still susceptible to the kind of damage a regular smartphone can shrug off. You really don’t want any dust getting in that hinge. But if you’re an adventurous sort of gadget lover, then a folding phone is a rewarding investment. \nThere are basically two kinds of foldables at the moment — the kind that fold like books and the ones that fold clamshell style, like your old flip phone. Here’s how I think of it: a book-style foldable is like a phone plus a tablet, and a flip-style foldable is a phone plus a smartwatch. The book foldables provide an outer screen for all your regular phone needs, and then a tablet-like inner screen when you want, well, more screen. Flip phones come with a smaller secondary display on the outer panel that’s useful for checking information quickly. When you need to do regular phone stuff, you unfold it.\nSo while they all fit in one category of folding tech, they’re suited to two very different kinds of people — someone who wants even more phone with their phone and someone who wants to be fully immersed a little less. Whichever category you fit into, you’d be wise to get the manufacturer’s extended warranty with your purchase; fixes can be expensive, and you won’t be able to walk into just any phone repair shop to get them. If you don’t opt for the warranty, you’ll want to be sure you can comfortably afford to replace your phone in the event of a sudden sand-related catastrophe. Death can come swiftly to a folding screen.\nIf I haven’t scared you off by this point, then you’re probably the kind of person who will have a heck of a good time with a foldable. I’ve used every phone under the sun, and folding phones are some of my favorite gadgets. Run four apps at once! Prop it up like a tiny laptop! Hold it like a camcorder when you shoot video! There are tons of possibilities, and the thrill you get when you fold your phone shut never fully wears off.\n\n\n\n\n\nBest book-style foldable\nBest flip-style foldable\nThe most fun foldable\nThe best battery life in a foldable\nOther foldables to consider\nWhat’s coming next\n\nBest book-style foldable\nSamsung Galaxy Z Fold 7\n\n\nScore: 8\n\nProsCons\n\n\nRidiculously slim and light for a foldable\nAll-day battery with moderate use\nOuter screen finally feels normal\n\nIt’s $2,000\nDurability still a concern\nCamera bump makes it wobble on a table\n\n\n\nWhere to Buy:\n\n $2119.99 $1949.99 at Samsung (512GB)\n $1999.99 at Amazon(256GB)\n $1999.99 at Best Buy (256GB)\n\nScreen: 8-inch, 1968p, 120Hz OLED inner screen; 6.5-inch, 1080p, 120Hz OLED cover screen / Processor: Qualcomm Snapdragon 8 Elite / Cameras: 200-megapixel f/1.7 main with OIS; 10-megapixel 3x telephoto with OIS; 12-megapixel ultrawide; 10-megapixel selfie (cover screen); 10-megapixel inner selfie camera / Battery: 4,400mAh / Charging: 25W wired, 15W wireless, 4.5W reverse wireless / Weather-resistance rating: IP48\nThe Galaxy Z Fold 7 is the foldable we’ve been waiting for Samsung to create. Unlike the long and narrow form factor of previous Z Fold devices, the Z Fold 7 boasts a more familiar 21:9 aspect ratio, making it feel much less unwieldy to use. At just 8.9mm thick, it’s nearly as slim as standard slab-style devices and doesn’t feel bulky in your pocket. Open it up, and you get a spacious inner display that’s perfect for multitasking, gaming, or simply enjoying more screen real estate. It will even last a day with moderate use, which is relatively good for a folding phone.\nThe Z Fold 7, however, isn’t without its shortcomings. Notably, its starting price of $1,999 is a huge reminder that this is a luxury device, not a practical choice for everyone. The outer display also has a lower resolution than the screen found in the more affordable Galaxy S25 Ultra, and the camera bump is quite large, resulting in a slight wobble when the phone is placed on flat surfaces. That said, the camera system is top-notch, highlighted by a 200-megapixel lens that performs well in low-light scenarios.\nIt was going to take a lot to unseat the Pixel 9 Pro Fold as our favorite book-style foldable, but the Z Fold 7 has done just that. The hardware is stunning, and the reworked proportions make it feel much nicer to use. Still, issues like long-term durability remain a concern, while the $1,999 price tag places it out of reach for most.\nRead our full Galaxy Z Fold 7 review.\nBest flip-style foldable\nSamsung Galaxy Z Flip 7\n\n\nScore: 8\n\nProsCons\n\n\nSamsung finally adopted the big cover screen\nAll-day battery\nReliable camera\n\nMore susceptible to dust than your average phone\nStill too hard to run full apps on the cover screen\n\n\n\nWhere to Buy:\n\n $1099.99 $1049.99 at Samsung (256GB)\n $1099.99 at Amazon (256GB)\n $1099.99 at Best Buy (256GB)\n\nScreen: 6.9-inch, 1080p, 120Hz OLED inner screen; 4.1-inch, 948p, OLED cover screen / Processor: Samsung Exynos 2500 / Cameras: 50-megapixel f/1.8 main with OIS; 12-megapixel ultrawide; 10-megapixel selfie (inner screen) / Battery: 4,300mAh / Charging: 25W wired, 15W wireless, 4.5W reverse wireless / Weather-resistance rating: IP48\nThe latest Galaxy Z Flip may not be as fun as the newest Razr Ultra, but it does offer a few new tricks. Samsung ditched the old file-folder cover screen in favor of a glorious, 4.1-inch edge-to-edge panel that wraps around the cameras. The extra real estate means you have more room to quickly respond to messages or perform any task that doesn’t require you to open your phone (and risk getting lost in a digital rabbit hole).\nIn addition to the larger cover screen, the Flip 7 offers a couple of other thoughtful updates. It’s thinner than its predecessor and features a bigger 4,300mAh battery, which is a step up from the 4,000mAh battery found in the last-gen Flip 6. The camera system remains unchanged from last year’s model, too, though that’s not necessarily a bad thing. The 50-megapixel main shooter still produces great images, and you get all the versatility the flip form factor has to offer, including the ability to easily take selfies using the rear camera.\nDespite some welcome changes, the Flip 7 carries the same IP48 rating as last year’s model, which means long-term durability against fine dust particles remains a concern. However, Samsung offers a great warranty and repair program, along with seven years of OS and security updates. The Flip 7 isn’t perfect, but it’s the most powerful and polished version yet — just don’t drop it while lounging on the beach.\nRead our full Galaxy Z Flip 7 review.\nThe most fun foldable\nMotorola Razr Ultra (2025)\n\n\nScore: 7\n\nProsCons\n\n\nOne of the best-looking phones you can buy\nGreat battery life\nOuter screen is useful in unexpected ways\n\nAI button is wasted real estate \nLong-term durability is still a question mark\nCamera processing is occasionally weird\n\n\n\nWhere to Buy:\n\n $1299.99 $1065.99 at Amazon (512GB)\n $1299.99 $1099.99 at Best Buy (512GB)\n $1299.99 $1099.99 at Motorola (512GB)\n\nScreen: 7-inch 1224p OLED 165Hz inner screen; 4-inch 1080p OLED 165Hz outer screen / Processor: Qualcomm Snapdragon 8 Elite / Cameras: 50-megapixel f/1.8 main with OIS; 50-megapixel f/2.0 ultrawide; 50-megapixel f/2.0 selfie / Battery: 4,700mAh / Charging: 68W wired, 30W wireless / Weather-resistance rating: IP48\nThe Razr Ultra is the newest and most advanced member of Motorola’s foldable lineup. Compared to the Razr Plus, it boasts a higher-resolution inner screen, Qualcomm’s most powerful mobile processor, double the storage space, and an upgraded selfie camera. The device is also one of the best-looking phones you can buy — the gold-bronze chassis and wooden back panel lend the Ultra a real elegance. When every phone tends to look the same — even in the foldable market — the Razr Ultra stands out in a crowd, which only adds to its charm.\nBeyond its appearance, the Ultra is just plain fun to use. The 4-inch outer screen covers almost the entire front of the phone, making it perfect for checking notifications, responding to messages, and taking quick actions such as hailing an Uber. The titanium hinge is also an upgrade over the stainless steel found in the Razr Plus. While the Ultra is enjoyable, it can’t overcome the gripes we’ve had with previous Motorola foldables, like inconsistent camera processing. Meanwhile, Motorola is only promising three OS upgrades and four years of security updates, which is on the shorter side considering the $1,300 retail price.\nRead our full Razr Ultra (2025) review.\nThe best battery life in a foldable\nOppo Find N5\nAt less than 9mm thick when shut, the Oppo Find N5 is a foldable phone that’s thinner than any so far.\n\n\nScore: 8\n\nProsCons\n\n\nIt’s really, really thin\nExcellent battery life\nThe crease is almost invisible\n\nFoldables are still fragile\nIt’s not launching in the US or Europe\n\n\n\nWhere to Buy:\n\n $2499 $2099 at Oppo (512GB)\n\nScreen: 8.12-inch, 2248p, 120Hz OLED inner screen; 6.62-inch, 1140p, 120Hz OLED outer screen size/ Processor: Qualcomm Snapdragon 8 Elite Cameras: 50-megapixel f/1.9 main with OIS, 50-megapixel 3x telephoto with OIS, 8-megapixel ultrawide, 8-megapixel selfie cameras (inner and outer) / Battery: 5,600mAh / Charging: 80W wired, 50W wireless / Weather-resistance rating: IPX8/IPX9\nLet’s get the bad news out of the way first: if you live in the US or Europe, you can’t buy the Oppo Find N5. That rules out, well, a lot of us. But if you live in China, Singapore, or any of the other Asian countries Oppo included in its so-called “global” release, then you’re in luck: you can pick up one of the world’s thinnest book-style folding phones, and the rest of us are all very jealous of you.\nThe Find N5 isn’t all about thinness, either. Its Qualcomm Snapdragon 8 Elite chipset is highly capable, the phone is fully water-resistant, and battery life is excellent. It utilizes silicon-carbon battery technology to accommodate a large (by foldable standards) 5,600mAh battery, which easily holds up after a long day of heavy use. What’s even more impressive is that, like the aforementioned Z Fold 7, the Find N5 is still barely thicker than a standard slab-style phone and only slightly heavier. That matters when you’re using the phone via the cover screen for long periods of time or stashing it in the side pocket of your yoga pants. When a foldable is only about as heavy and bulky as a regular phone, using the inner screen feels like getting away with something fantastic — not a benefit you have to make many other sacrifices for. Oppo delivers this in spades, and I just wish more of us could… find it.\nRead our full Oppo Find N5 review.\nOther foldables to consider\nThe OnePlus Open strikes a great balance in its form factor and offers a clever UI for multitasking that has won plenty of fans since it debuted. But the phone lacks wireless charging and full water resistance — it’s only splash-resistant — and OnePlus’ software support policy isn’t as strong as Google’s and Samsung’s. Read our review.\nThe Huawei Mate XT gets an honorable mention for its sheer wow factor alone. The “trifold” phone — as it’s been dubbed — contains three screen segments and two hinges, putting it in a category of its own right now. It’s only available in China and a few other countries that don’t include the US or the UK, and it’s monstrously expensive at €3,499. But it’s cool as heck and may be a sign of things to come from other manufacturers. Read our hands-on impressions.\nThe Motorola Razr Plus 2025 is new to the scene, replacing last year’s model. Although the two devices look identical, there are a few notable changes. The biggest difference is that the Razr Plus 2025 now features a titanium hinge, rather than stainless steel, promising better durability and a less noticeable crease when the device is open. Additionally, the Razr Plus 2025 offers IP48 dust and water resistance, whereas last year’s model featured an IPX8 rating. While we haven’t tested the newest model, it appears to be a solid alternative to the Ultra.\nThe standard Motorola Razr 2025 is a more affordable entry point into the world of foldables, starting at $699. The Razr 2025 offers improved performance, battery life, and durability — the kind of bumps we expect year after year. It boasts a smaller cover screen compared to the Razr Plus and Ultra, but still offers a spacious 6.9-inch internal display. We haven’t tested the Razr 2025 yet, but its relatively budget-friendly price is a good option for jumping into the foldable market.\nThe Pixel 9 Pro Fold is an impressive sophomore effort from Google, offering an ideal form factor that’s a joy to use. When folded, the outer screen matches the dimensions of a regular phone, and the inner screen can get nice and bright outdoors. The whole package is also light enough that it sometimes doesn’t feel like you’re holding a foldable, though it does suffer from a slightly downgraded camera system compared to its slab-style siblings. There’s also no formal dust resistance, so long-term durability remains a concern. Read our review.\nWhat’s coming next\nGoogle has an event scheduled for August 20th, where we’re expecting to learn more about the upcoming Google Pixel 10 series. The company has already given us a glimpse at the standard Pixel 10 ahead of the launch event, but we’re still waiting for information about a new foldable. Rumors suggest Google is gearing up to release the Pixel 10 Pro Fold, which could feature an IP68 rating, addressing a common concern about long-term durability in the foldable space.\nUpdate, August 12th: Adjusted pricing / availability and added the Galaxy Z Flip 7 as the best flip-style foldable. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de99ca96c3276231295a153fee72203dc3fbc2c4",
      "title": "'Glass half-full' & 'enthralled by details' - Spurs' new era under Frank",
      "url": "https://www.bbc.com/sport/football/articles/cr4eqzggwqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T19:37:30.000Z",
      "summary_90w": "",
      "raw": "BBC senior football correspondent Sami Mokbel looks at how Tottenham are shaping up for the season under new manager Thomas Frank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5429f951748d51e3e30d25d44135e9beb419dc7",
      "title": "Zelensky rules out ceding Donbas region as Russians make fresh advance",
      "url": "https://www.bbc.com/news/articles/c4g6qd3k2peo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T19:35:25.000Z",
      "summary_90w": "",
      "raw": "The Ukrainian leader was speaking ahead of a meeting between Donald Trump and Vladimir Putin in Alaska on Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b64b8952d60260961c0a25f7caada02b65969d3",
      "title": "Watch: Mic'd up Livingstone captains team in real time",
      "url": "https://www.bbc.com/sport/cricket/videos/cz609ddd5zlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T19:34:34.000Z",
      "summary_90w": "",
      "raw": "Listen to Birmingham Phoenix captain Liam Livingstone discussing his field placements and conversations with his bowlers, as he is mic'd up in the field against the Oval Invincibles in the men's Hundred.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fa13e50c29bd263c6e1e10afe8a491058465a217",
      "title": "Krafton claims former Subnautica 2 devs ‘lost interest’ in developing game",
      "url": "https://www.theverge.com/news/758265/subnautica-2-lawsuit-response-krafton-unknown-worlds",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T19:14:45.000Z",
      "summary_90w": "",
      "raw": "Krafton has fired another shot in its legal battle with former executives of Subnautica 2 studio Unknown Worlds, who filed a lawsuit last month, claiming the South Korean publisher undermined the game’s release to avoid paying them a bonus. In its response, Krafton claims that the three plaintiffs, Ted Gill, Charlie Cleveland, and Max McGuire, had “lost interest in developing Subnautica 2.”\nThe story told by Krafton’s lawyers in the filing is that after selling Unknown Worlds to Krafton for $500 million and promising $250 million more in earnout bonuses, Cleveland and McGuire essentially checked out of working on Subnautica 2 to focus on personal projects. \n“In 2024 and 2025, Cleveland stated that he was ‘no longer working on games but […] working on a couple of films,’” while “McGuire started ‘working on initiatives that fall outside of [the Company’s] main development activities.’” As for Gill, “And Gill, who remained, focused on leveraging his operational control to maximize the earnout payment, rather than developing a successful game.”\nThey allege that without the leadership of Cleveland and McGuire, development on Subnautica 2 suffered to the point that a delay of the game’s early access launch was necessary. \n…as the end of the carnout period drew nearer, the game was still nowhere near its planned scope. Indeed, as late as March of 2025, only two months before the Key Employees claimed the game was ready for the first Early Access (“EA”) release, the development lead for Subnautica 2 at Unknown Worlds noted that the first EA and second EA (planned for December 2025) would only be “about 12% of our intended 1.0 scope” and joked that “at that rate we would be in development for 30 years.”\nWhen the plaintiffs disagreed that Early Access should be delayed, Krafton fired them, sparking the battle playing out now in Delaware Chancery Court.\n \n  Defendant's Answer to Verified Complaint  by  krafton",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8707571064a5ed0b081aa4da3c8fcaa75f22d4d1",
      "title": "UK government suggests deleting files to save water",
      "url": "https://www.theverge.com/science/758275/drought-delete-files-email-data-center-water-uk",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T19:11:39.000Z",
      "summary_90w": "",
      "raw": "An aerial photo taken on Aug. 8, 2025 shows a view of the nearly exhausted Baitings Reservoir in Yorkshire, Britain. Reservoir levels recently have continued to fall as increased water use met lack of rain in Britain. | Photo: Getty Images\t\n\nCan deleting old emails and photos help the UK tackle ongoing drought this year? That’s the hope, according to recommendations for the public included in a press release today from the National Drought Group.\nThere are far bigger steps companies and policymakers can take to conserve water of course, but drought has gotten bad enough for officials to urge the average person to consider how their habits might help or hurt the situation. And the proliferation of data centers is raising concerns about how much water it takes to power servers and keep them cool. \n“Simple, everyday choices – such as turning off a tap or deleting old emails – also really helps the collective effort to reduce demand and help preserve the health of our rivers and wildlife,” Helen Wakeham, Environment Agency Director of Water, said in the press release.\n\n“Simple, everyday choices – such as turning off a tap or deleting old emails – also really helps the collective effort”\n\n\nThe Environment Agency didn’t immediately respond to an inquiry from The Verge about how much water it thought deleting files might save, nor how much water data centers that store files or train AI use in the UK’s drought-affected areas.\nA small data center has been estimated to use upwards of 25 million liters of water per year if it relies on old-school cooling methods that allow water to evaporate. To be sure, tech companies have worked for years to find ways to minimize their water use by developing new cooling methods. Microsoft, for example, has tried placing a data center at the bottom of the sea and submerging servers in fluorocarbon-based liquid baths. \nGenerating electricity for energy-hungry data centers also uses up more water since fossil fuel power plants and nuclear reactors also need water for cooling and to turn turbines using steam, an issue that transitioning to more renewable energy can help to address. \nAugust ushered in the UK’s fourth heatwave of the summer, exacerbating what was already the driest six months leading to July since 1976. Five regions of the UK have officially declared drought, according to the release, while another six areas are in the midst of “prolonged dry weather.” \nThe National Drought Group says pleas to residents to save water have made a difference. Water demand dropped by 20 percent from a July 11th peak in the Severn Trent area after “water-saving messaging,” according to the release. Plugging leaks is another major concern. Fixing a leaking toilet can prevent 200 to 400 liters of water from being wasted each day, it says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c21e791f4a6615d693f84f667ea4750b7bc677c4",
      "title": "Indian fintech Paytm wins a major regulatory battle days after key investor exit",
      "url": "https://techcrunch.com/2025/08/12/indian-fintech-paytm-wins-a-major-regulatory-battle-days-after-key-investor-exit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T19:08:02.000Z",
      "summary_90w": "",
      "raw": "Paytm has received approval from India’s central bank to resume onboarding new online merchants and offer its digital payment services.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a22e07974df8682e0fc326cce3033d45a6bf84f",
      "title": "Match to pay $14M to the FTC due to false advertising and other deceptive practices",
      "url": "https://techcrunch.com/2025/08/12/match-to-pay-14m-to-the-ftc-due-to-false-advertising-and-other-deceptive-practices/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T18:56:28.000Z",
      "summary_90w": "",
      "raw": "Match Group agrees to pay the FTC $14 million after it was sued for deceiving users into buying subscriptions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f84bd68a325542c0c658311038b2fa81f02ae366",
      "title": "JD Vance meets senior Tories as he continues UK holiday in the Cotswolds",
      "url": "https://www.bbc.com/news/articles/cx29n78gg0vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T18:26:29.000Z",
      "summary_90w": "",
      "raw": "The US vice-president, Conservative shadow justice secretary and shadow home secretary meet during Vance's holiday in the UK.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e9d4bdcfebbf1aa9c129f6dab02b6163ca17fe6",
      "title": "Small boat migrant crossings hit 50,000 under Labour",
      "url": "https://www.bbc.com/news/articles/c8e1xkwd74wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T18:18:20.000Z",
      "summary_90w": "",
      "raw": "A government minister describes the number as \"unacceptable\" but says Labour is \"making progress\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "29f27a89e7ca8fd2a95838bc7af921691b6fbab3",
      "title": "Anthropic just made its latest move in the AI coding wars",
      "url": "https://www.theverge.com/ai-artificial-intelligence/757998/anthropic-just-made-its-latest-move-in-the-ai-coding-wars",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T18:10:33.000Z",
      "summary_90w": "",
      "raw": "The AI coding wars are heating up. One of the main battlegrounds? \"Context windows,\" or an AI model's working memory - the amount of text it can take into account when it's coming up with an answer. On that front, Anthropic just gained some ground. Today, the AI startup announced a 5x increase in its context window as it races to compete with OpenAI, Google, and other major players.\nContext windows are measured in tokens, and Anthropic's new context window for Claude Sonnet 4, one of its most powerful AI models, can handle 1 million tokens. For reference, Anthropic has said in the past that a 500k context window can handle about 100 half-ho …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d0f74c95a7e67fd59a639972f9bc99b4104f57e5",
      "title": "State Department slashes its annual reports on human rights",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5495621/state-department-human-rights-reports-slashed",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T17:46:09.000Z",
      "summary_90w": "",
      "raw": "Required by Congress, the reports no longer single out things like rigged elections or sexual violence against children as human rights violations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd424c6c3684bbd25e652aad8a029df6a619ffb5",
      "title": "AI companion apps on track to pull in $120M in 2025",
      "url": "https://techcrunch.com/2025/08/12/ai-companion-apps-on-track-to-pull-in-120m-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:38:42.000Z",
      "summary_90w": "",
      "raw": "The number of AI companion apps has grown more than 60% since 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8135783ed10cf5157cd7e2c9b38f63280acdc58",
      "title": "Ukraine will not cede land that could be Russian springboard for new war, Zelenskyy says",
      "url": "https://www.theguardian.com/world/2025/aug/12/ukraine-russia-donbas-springboard-for-war-zelenskyy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:36:50.000Z",
      "summary_90w": "",
      "raw": "Ukrainian leader sees no sign of Russia preparing for ceasefire after reports of frontline breach in Donbas\nVolodymyr Zelenskyy has said Ukraine could not agree to a Russian proposal to give up more of his country’s territory in exchange for a ceasefire because Moscow would use what it gained as a springboard to start a future war.\nThe Ukrainian president said he did not believe that Donald Trump supported Russia’s demands, and he expressed hope the US leader would act as an honest mediator when he meets Vladimir Putin in Alaska on Friday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24592a7af25ab944fa1b02c3aba79bf2fffc35c2",
      "title": "Hackers breach and expose a major North Korean spying operation",
      "url": "https://techcrunch.com/2025/08/12/hackers-breach-and-expose-a-major-north-korean-spying-operation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:34:34.000Z",
      "summary_90w": "",
      "raw": "Two hackers broke into the computer of a North Korean government hacker and leaked its contents, offering a rare glimpse inside the secretive nation's spying operations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8ff068dfa09650f4088517f1c9cddfe1d17dc9c",
      "title": "Ultimate Ears’ Wonderboom 4 speaker is cheaper than ever at 40 percent off",
      "url": "https://www.theverge.com/tech/757717/ultimate-ears-ue-wonderboom-4-bluetooth-speaker-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T17:30:00.000Z",
      "summary_90w": "",
      "raw": "If you’re hosting a small get-together or hangout at the park, a small speaker like the UE Wonderboom 4 can provide the soundtrack. It’s the kind of gadget that fades into the background yet remains as important as the food and drink. And right now, it’s down to just $59.99 ($40 off) at Amazon, Best Buy, and B&H Photo, which is its lowest price to date.\nUltimate Ears Wonderboom 4\n\nWhere to Buy:\n\n $99.99 $59.99 at Amazon\n $99.99 $59.99 at Best Buy\n $99.99 $59.99 at B&H Photo\n\nThe Wonderboom 4’s compact design — which is roughly the size of a softball — makes it easy to bring anywhere, whether you’re lounging by the pool or cruising on a bike. One of its handiest features is the built-in loop, which allows you to clip on a carabiner and hook it right to your backpack. That way, you can hike with your friends on the trail and everyone can enjoy your outdoor playlist. Despite its smaller size, the battery life is estimated to last up to 14 hours, so you won’t have to worry about charging it if you’re away from an outlet all day.\nIn addition to all-day battery life, the compact USB-C speaker features an IP67 rating, so it should be able to withstand dust, dirt, and water. And if you’re clumsy like me, you’ll be happy to know that the speaker is built to endure drops (it even floats). It can also easily connect to Android devices thanks to Google’s Fast Pair feature, and you can link two units to create stereo sound, giving you a richer, more immersive listening experience.\nA few Verge staffers own the Wonderboom 4 and recommend it for its combination of size, sound, and price. We’re generally fans of Ultimate Ears’ catalog of wireless speakers, which offer decent audio performance, are very durable, and, of course, are easy to transport. The Wonderboom 4 comes in a variety of colors — many of which are on sale — but if you’re on the fence for what to get, The Verge’s David Pierce recommends the blue.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "756a9d4979bc1da44723aa7e4468e978107d5955",
      "title": "Trump’s China trade truce extension spurs market rally",
      "url": "https://www.theguardian.com/us-news/2025/aug/12/trumps-china-trade-truce-extension-spurs-market-rally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:25:42.000Z",
      "summary_90w": "",
      "raw": "Bourses in Australia and Japan hit record highs as hopes grow of trade deal within latest 90-day pause\n\nBusiness live – latest updates\n\nGeorge Magus: Why Peak China may finally have arrived\n\nDonald Trump’s decision to extend a truce in the trade war with China for another 90 days triggered a stock market rally across the globe on Tuesday.\nThe US president signed an executive order on Monday night extending the deadline for higher tariffs on China until 10 November and avoiding a rates cliff edge. Beijing responded the following morning that it would suspend additional tariffs on US goods for a further 90 days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e00341fa6f5681af04bc2dac017cccbae0f50a4",
      "title": "Wildfires rage across southern Europe as temperatures top 40C",
      "url": "https://www.bbc.com/news/articles/cdd3my4e0pqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T17:16:26.000Z",
      "summary_90w": "",
      "raw": "The heatwave has led to red alerts being issued in parts of Italy, France, Spain, Portugal and the Balkans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64dbf00b34db766d7eaceb8c3345c3880846e93a",
      "title": "British soldiers using sex workers in Kenya despite ban, inquiry finds",
      "url": "https://www.bbc.com/news/articles/czjmveemj7zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T17:15:58.000Z",
      "summary_90w": "",
      "raw": "Chief of Defence Staff Sir Roly Walker says the army is committed to stopping sexual exploitation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "afd72b2a2ab9902ecc73b68df5657e712dd4fecf",
      "title": "Google vet raises $8M for Continua to bring AI agents to group chats",
      "url": "https://techcrunch.com/2025/08/12/google-vet-raises-8m-for-continua-to-bring-ai-agents-to-group-chats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:15:01.000Z",
      "summary_90w": "",
      "raw": "David Petrou, founding member of Google Goggles and Google Glass, wants to enhance group chats with AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c807c5f00b13468f95c9377dd078aee39e5465dc",
      "title": "Perplexity offers to buy Chrome for billions more than it’s raised",
      "url": "https://techcrunch.com/2025/08/12/perplexity-offers-to-buy-chrome-for-billions-more-than-its-raised/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:14:08.000Z",
      "summary_90w": "",
      "raw": "Perplexity tells TechCrunch the terms of the offer include a commitment to keep Chrome’s underlying engine, Chromium, open source and to invest $3 billion into it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a623de09717122caf535debcc676396c647aa27",
      "title": "Thousands evacuated in Spain as deadly heatwave fans Mediterranean wildfires",
      "url": "https://www.theguardian.com/world/2025/aug/12/thousands-evacuated-in-spain-amid-deadly-wildfires-and-new-heatwave",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:11:56.000Z",
      "summary_90w": "",
      "raw": "Boy, four, dies of heatstroke in Rome as scientists say high temperatures and fires are reminder of climate emergency\nThe deadly heatwave fanning wildfires across the Mediterranean region has claimed at least three lives and forced thousands of people from their homes.\nFirefighters continued to battle blazes on Tuesday and authorities braced for further damage as temperatures in some areas surged well past 40C. In Spain, a Romanian man in his 50s died after suffering 98% burns while trying to rescue horses from a burning stable near Madrid on Monday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9140d7b91e8e1b4c362273e8709af7da1df7b032",
      "title": "South Korean court orders arrest of impeached former president’s wife",
      "url": "https://www.theguardian.com/world/2025/aug/12/south-korean-court-orders-arrest-of-impeached-former-president-wife-kim-keon-hee",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:08:26.000Z",
      "summary_90w": "",
      "raw": "Kim Keon Hee in custody on three charges while husband Yoon Suk Yeol detained over attempt to impose martial law\nA South Korean court on Tuesday ordered the arrest of Kim Keon Hee, the wife of the impeached former president Yoon Suk Yeol, making her the first former first lady to be arrested in the country’s history.\nThe Seoul central district court ruling creates an unprecedented situation in which both members of a former presidential couple are simultaneously in custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "482ab8153cc6dd67d07dd55b3320ceee7140c6a2",
      "title": "Tropical Storm Erin could become the first Atlantic hurricane of the 2025 season",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5500164/tropical-storm-erin-hurricane",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T17:00:22.000Z",
      "summary_90w": "",
      "raw": "The National Hurricane Center expects the storm to strengthen over the next several days and says it could become a hurricane by late Thursday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7568c6a86229301eec6741969b963edba13adb57",
      "title": "Quick fixes: bring back Google Photos classic search instead of ‘Ask Photos’ Gemini AI",
      "url": "https://www.theverge.com/how-to/758206/bring-back-google-photos-classic-search-instead-of-gemini",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T16:58:40.000Z",
      "summary_90w": "",
      "raw": "Issue\nYou just want to search your archived photos, instead of interacting with an AI assistant.\nQuick fix\nInside the app, tap the Google account button at top-right, then go to Photos settings > Preferences > Gemini features in Photos, and turn off either \"Search with Ask Photos\" or \"Use Gemini in Photos\". \nThe full story\nWhen Google rolled out its new AI-powered 'Ask Photos' search tool, I gave it a go - but after finding it slower, less helpful, and more confusing than the classic search, I always wound up pressing Google's handy button labeled \"Switch to classic search\" or \"Use classic search\" instead. (Some people found you could g …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a0cc81a491b0e4d52bf034cf719baee96782a0b",
      "title": "D.C. has been under tighter federal control before. Here's what it looked like",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498451/dc-federal-control-history-home-rule-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T16:55:58.000Z",
      "summary_90w": "",
      "raw": "Trump's expansion of federal authority over Washington, D.C., is in many ways unprecedented, but calls to mind other times the city has been under tighter federal control.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2538151c82589f8f19fe6acdc2179df97e28ce40",
      "title": "Perplexity offers to buy Google Chrome for $34.5 billion",
      "url": "https://www.theverge.com/news/758218/perplexity-google-chrome-bid-unsolicited-offer",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T16:50:26.000Z",
      "summary_90w": "",
      "raw": "Perplexity has just offered to buy Google Chrome for $34.5 billion — a bid that’s far more than the AI search startup itself is valued at, according to reports from The Wall Street Journal and Bloomberg. The startup sent the unsolicited bid on Tuesday, just months after Perplexity said it would buy Chrome if the government forces Google to sell its browser.\nThe startup also offered to buy TikTok earlier this year. Google hasn’t indicated that it would sell Chrome at any price, and so far, the court hasn’t ordered a sale.\nPerplexity spokesperson Jesse Dwyer confirmed to The Verge that the WSJ’s reporting is accurate. The startup’s bid for Chrome stands in stark contrast to the startup’s valuation of about $18 billion. \nDmitry Shevelenko, Perplexity’s chief business officer, told Bloomberg that “multiple large investment funds have agreed to finance the transaction in full.” A spokesperson for the startup also told Bloomberg that Perplexity would invest more than $3 billion in Chrome and Chromium over the next two years if Google accepts the deal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "17c5d845d8877f58d005bf95207ed03bf8dc5ccf",
      "title": "Threads now has more than 400 million monthly active users",
      "url": "https://techcrunch.com/2025/08/12/threads-now-has-more-than-400-million-monthly-active-users/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:44:07.000Z",
      "summary_90w": "",
      "raw": "X, meanwhile, has north of 600 million monthly active users, according to previous statements made by its former CEO, Linda Yaccarino.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fea31236e95f1390286f63013e1dd03660fde2e9",
      "title": "Israel bombards Gaza City as UK and allies demand action against 'unfolding famine'",
      "url": "https://www.bbc.com/news/articles/clyj0dd0qj9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T16:42:05.000Z",
      "summary_90w": "",
      "raw": "The countries demanded \"immediate, permanent and concrete steps\" to facilitate the entry of aid to Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9d21d611270d2b56497e2a0da0fb17bc8a2b21d",
      "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/12/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:33:20.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c2fe66867db375c5e8872747a216bbad8f2b1218",
      "title": "AI companies are chasing government users with steep discounts",
      "url": "https://www.theverge.com/policy/758189/openai-anthropic-claude-chatgpt-government",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T16:31:51.000Z",
      "summary_90w": "",
      "raw": "Ever since the launch of ChatGPT, AI companies have been racing to gain a foothold in government in more ways than one. Most recently, that's meant luring government users with attractive low prices for their products. \nWithin the last week, both OpenAI and Anthropic have introduced special prices for government versions of their generative AI chatbots, ChatGPT and Claude, and xAI announced its Grok for Government in mid-July. OpenAI and Anthropic are both offering their chatbots to federal agencies for one year for a nominal price of $1. Anthropic appeared to try to one-up OpenAI's announcement by saying all three branches of government co …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5505014f937ecac34a65207ed72cdbb1244f49d",
      "title": "The best doorbell cameras",
      "url": "https://www.theverge.com/22954554/best-video-doorbell-camera",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T16:30:00.000Z",
      "summary_90w": "",
      "raw": "With a smart video doorbell, your front door’s communication skills go from 1980s landline to a modern smartphone. Combining a motion-activated camera with a microphone, speaker, and buzzer, a doorbell camera sends alerts to your phone, allowing you to see who’s at the door without needing to open it or even be at home. Whether you’re curled up on the couch, hard at work in your office, or sunning on a beach in the Bahamas, a video doorbell keeps you in touch with what’s happening on your doorstep.\nI’ve tested more than 35 video doorbells, and while there’s no one-size-fits-all, like a smartphone, it’s a personal choice, I have thoughts on which are the best of the best and which work well for specific use cases.\nMy top advice is to use the existing doorbell wires if you have them. Wired doorbells are generally cheaper, work better, and are more compact, so they tend to look nicer.\nIf you don’t have wires and don’t want to pay for an electrician to run them, try using an AC power adapter (Ring and Google Nest sell their own; you can also find generic ones). But if all else fails, I’ve got recommendations for good battery-powered buzzers. Just plan to pick up an extra battery when you purchase, or factor in removing it from your door every few months to charge it for a few hours.\nBest doorbell camera\nNest Doorbell (wired)\nWith 24/7 recording, facial recognition, reliable smart alerts, and some free video recording, Google’s wired doorbell is the best option for most people. \n\nWhere to Buy:\n\n $179.99 $139.99 at Google\n $179.99 at Best Buy\n\nVideo quality: 960 x 1280p, 6x zoom, HDR / Smart alerts: Person, package, animal, vehicle, and facial recognition ($) Aspect ratio: 3:4 / Field of view: 145 degrees diagonal / Power options: Wired / Wi-Fi: 2.4GHz and 5GHz / Storage: Cloud and local / Subscription fee: $10 a month / Works with: Alexa, Google, SmartThings\nThe Nest Doorbell Wired (2nd-gen) is one of only two video doorbells in this list that can record 24/7. Scrolling through a continuous timeline view of everything that’s happened at your front door is super helpful and means you won’t miss anything. This, along with a good price, great video quality, the ability to tell you what and who is at your door, and some free recorded video, make it the best doorbell for most people.\nThe Nest Wired is also the best video doorbell that works with Google Home, and the best for protecting your packages. Its proactive package watch feature tells you when a package arrives and sends another alert when it’s gone. In my testing, it worked very well.\nUnlike many competitors — such as Ring and Arlo — Google doesn’t charge for smart notifications. The Nest Wired will tell you if it’s a person, package, animal, or vehicle at your door for free. You also get free activity zones to cut down on unwanted notifications, and three free hours of event-based recordings, thanks to local storage and local processing.\n\nYou can, in theory, use this doorbell without paying a subscription\n\n\nBut three hours isn’t enough to be particularly useful, and to get recorded video, you need a Nest Aware plan (starting at $10 per month, $100 per year). This does cover all your Google Nest cameras, though, and it adds Nest’s excellent Familiar Faces feature, which tells you who is at your door.\nIf you want 24/7 recording, you need Nest Aware Plus ($20 per month, $200 a year), but again, this subscription applies to all Google Nest cameras you have.\nOn paper, the Nest doesn’t have the best specs; the Ring Wired Pro is technically better. But it does deliver a 960 x 1280 pixel resolution with a 6x digital zoom, and video quality is very good, thanks to some digital trickery. Its 3:4 portrait aspect ratio and 145-degree field of view are very good, and I could see my porch from top to bottom and a fair amount from side to side.\nOn-device AI makes the Nest speedy with notifications, and it delivers rich alerts to both your phone and watch. These are interactive, allowing you to press and hold the video to see a clip and activate one of the three preset quick responses. It’s also quick to call up live video.\nNest’s doorbells and cameras work with Nest and Amazon Alexa smart displays for viewing a live feed. Google also now lets you have a live stream pull up automatically on your Google TV when someone rings the doorbell — a super handy feature.\nThere are a few quirks. There’s no reliable way to snooze notifications from the doorbell, and if you use multiple Nest speakers or displays, they’ll all announce your visitors. Not great if you have a Nest Mini in your kid’s nursery.\nGoogle is gradually rolling out a search and description feature to its cameras, including video doorbells that will send an alert describing exactly what’s happening in a clip, giving you more context before opening the app. You’ll also be able to search through footage for specific events — like kids on bikes. The search and description feature will require a subscription.\nRead my full Nest Doorbell wired review.\nBest battery-powered doorbell camera\nRing Battery Doorbell Plus\nThis is a great battery-powered buzzer with excellent video quality, a good head-to-toe view, and very speedy response times for a battery doorbell. It integrates well with Amazon Alexa and can record locally to a Ring Alarm Pro, but the battery only lasts about two months unless you turn on battery-saving features.\n\nWhere to Buy:\n\n $149.99 at Best Buy\n $149.99 at Best Target\n $149.99 at Amazon\n\nVideo quality: 1536 x 1536p, HDR, color night vision / Smart Alerts: Person, package ($) Aspect ratio: 1:1 / Field of view: 150 degrees horizontal, 150 degrees vertical / Power options: Battery, wired trickle charge, solar / Wi-Fi: 2.4GHz / Storage: Cloud and local (with Ring Alarm Pro) / Subscription fee: $4.99 a month / Works with: Amazon Alexa, Samsung SmartThings\nIf you really want a battery-powered buzzer, the Ring Battery Doorbell Plus is the way to go. At $149.99, it’s cheaper than the Ring Battery Pro, while still offering a head-to-toe view and high-quality video resolution to provide a clear picture of what’s happening at your door.\nUnlike the $100 Ring Battery Doorbell, the Plus uses removable, rechargeable batteries, making it easier to keep your doorbell charged. Just have a second on hand charged and ready to swap in when you get low. Most other doorbells require you to take them down to recharge.\nThe Plus also has color night vision and was more responsive than any other non-Ring battery doorbell I’ve tested. It pulled up a live view in under four seconds, compared with upwards of 10 seconds for most others.\nAs with other battery-powered doorbells, there’s no preroll. If catching people as they approach your door — not just at your door — is crucial, consider the Battery Doorbell Pro ($229.99). That model adds preroll and improved motion detection using radar, which significantly cuts down on nuisance alerts.\nIt’s only really worth spending the extra $80 if you have lots of trees or passing cars in front of your door and/or you want to make sure you see the whole event when someone approaches your door. The Pro is also compatible with 5GHz Wi-Fi, which could mean faster responses if your front door is close enough to your router. The Plus is 2.4GHz only.\nBattery life isn’t great on either doorbell. They last around two months with all the features turned on except for extra-long recordings (the default is 30 seconds, but it can go up to 120). You can tweak settings to reduce power consumption, but then you have to give up features like HDR (which makes it easier to see faces) and snapshot capture, which takes a picture every five minutes to give you a better idea of what’s been happening at your door.\nAs with all Ring doorbells, there are no animal or vehicle alerts, only people and packages. These require a Ring Home plan starting at $4.99 a month, which also includes 180 days of recorded video.\nAn AI-powered search feature introduced in 2024 lets you search recorded footage for things like animals, vehicles, and even the color of the coat you wore when you left the house. It’s handy for understanding what’s been going on around your home, but you still can’t get an alert when your cat is sitting on your porch.\nOther free features include pre-recorded quick replies, the option to set a motion alert schedule, live view, and two-way audio. The Plus can announce visitors on Echo speakers and automatically initiate a two-way audio/video call on an Echo Show. It won’t work with your existing chime unless you wire it (which also trickle-charges the battery), but Ring sells a plug-in chime.\nThe Plus also works with Ring Edge, a local storage and processing option that requires a Ring Alarm Pro smart hub and a Ring Home Premium subscription ($20 a month). This adds cellular backup through its built-in Eero Wifi system, so it can keep your doorbell online if both the power and internet go out.\nBest budget doorbell camera\nBlink Video Doorbell\nBlink’s buzzer is the best if you’re looking for a budget-friendly option with motion-activated recording and alerts, night vision, two-way audio, and up to two years of battery life. \n\nWhere to Buy:\n\n $59.99 $50.99 at Best Buy\n\nVideo quality: 1080p / Smart alerts: None / Aspect ratio: 16:9 / Field of view: 135 degrees horizontal, 80 degrees vertical / Power options: Wired or battery / Wi-Fi: 2.4GHz / Storage: Cloud or local with a Sync Module / Subscription fee: $3 a month / Works with: Amazon Alexa\nThe Blink Video Doorbell is the best cheap doorbell with a no-subscription option. And while it works as a wired doorbell, it’s also a good option for a battery-powered buzzer, as it can go up to two years on two AAs. I don’t love this doorbell, as video and audio quality are not great, but it’s cheap, it gets the job done, and that battery life is phenomenal.\nThe Blink doesn’t have smart alerts or quick replies, and it only records 1080p video at a standard 16:9 aspect ratio). But the basics are here: motion-activated recording (with a max of 30 seconds), alerts, live view (with caveats), night vision, motion zones, and two-way audio.\nIf you want to pay $50 (often less) to have a camera at your door and be done with it, get the Blink. Cloud storage is also a bargain at $3 a month ($30 a year), or you can do local storage with the Sync Module 2 and a USB stick. You need the Sync Module to initiate a live view through the camera in the app (or you have to pay for the subscription). Without it, you can only see video if there’s a motion event or someone rings the doorbell.\nThe Sync Module is sold with the doorbell as a “doorbell system” for $70, and should pay for itself compared to a monthly subscription.\n\nUniquely for a battery-powered doorbell, the Blink can also be a true hardwired doorbell\n\n\nThe biggest selling point for Blink is the feature that makes its similarly inexpensive security cameras so attractive: up to two years of battery life on two AA lithium batteries. The company has developed a super energy-efficient chip that will power its cameras longer than any other doorbell I’ve tested. (I managed almost a year with very heavy use). \nUniquely for a battery-powered doorbell, the Blink can also be a true hardwired doorbell. When wired, it will activate an existing chime (something neither the sub-$100 Ring nor Wyze doorbells can do) and provide constant power — not just trickle charge. This means it can wake up faster than a battery-powered buzzer and catch your visitor as they arrive. Wiring also adds on-demand two-way audio and live view (otherwise, you can only see the stream if there’s a motion event at the doorbell or someone presses the buzzer.)\nThe Blink comes in white or black and, because it uses just two AA batteries, isn’t as huge as most battery-powered doorbells, making it a more discreet option. However, it is a giant pain in the neck to install; make sure to follow the video instructions Blink provides closely to save a lot of frustration.\nThe biggest drawbacks are lower video quality and poor audio quality (it can be staticky, and it’s push-to-talk — not full duplex), short recording length, and no smart alerts. The app is also a bit tricky to navigate. It doesn’t work with Google Home, but it works great with Alexa, and you can see a live view on Echo Show devices and use any Echo speaker as an indoor chime.\nNote: Blink recently launched a second-generation video doorbell with higher image resolution, a head-to-toe view, and person detection for the same price. I plan to test this soon. You can read more details here.\nBest doorbell camera without a subscription\nTP-Link Tapo D225 Video Doorbell Camera\nAt under $100, this feature-packed, subscription-free doorbell offers a lot of value, including free local recording, 24/7 recording, and smart alerts, plus a robust smart home ecosystem. It’s big, you need a microSD card for recording, and there’s no HDR, but it’s a solid choice.\n\nWhere to Buy:\n\n $99.99 $79.97 at Amazon\n $99.99 $89.99 at Tapo\n\nVideo quality: 2K HD (no HDR) / Smart alerts: People, packages, pets, vehicles (free) Aspect ratio: 4:3 / Field of view: 180 degrees horizontal / Power options: Battery, wired trickle charge / Wi-Fi: 2.4GHz / Storage: microSD card or cloud / Subscription fee: $2.79 a month / Works with: Amazon Alexa, Google Home\nYou can use any doorbell on this list without a subscription, but you may sacrifice features like smart alerts, recorded video, and 24/7 continuous recording. If you want these but don’t want to pay a monthly fee, TP-Link’s Tapo D225 is an excellent choice.\nA wired and battery-powered doorbell, the D225 offers free smart alerts for people, packages, pets, and vehicles and can record locally to a microSD (purchased separately) without paying a subscription. There is an optional cloud service if you want to store your video offsite that also adds rich notifications (where a clip or image shows in the notification), but no other features are locked behind a paywall.\n\nIt is a chunky doorbell and may not meet the spousal approval factor\n\n\nTo get the free recording of motion-activated events, you just need to insert a microSD card (up to 512GB) into the doorbell. While it can run on its built-in 10,000mAh battery, you will need to wire it up for continuous 24/7 recording. This will also trickle charge the battery, and the doorbell will still work and record video, even if your power and Wi-Fi go out.\nThere are a few hoops to jump through to get 24/7 recording working, which can be a bit confusing in the slightly cluttered Tapo app. However, once set up, it will capture everything that happens. This is a great option, considering Nest charges $15 a month for 24/7 recording.\nThe D225 also provides good video quality, a decent zoom, and a nice 4:3 aspect ratio that clearly shows your entire porch from top to bottom and a good view from side to side. There is no HDR imaging, though, so if your porch is covered, it can be hard to make out faces in some lights.\nThe doorbell can work with your existing chime (although, oddly, not if you enable 24/7 recording) but also comes with a plug-in chime. If you don’t wire it, you’ll have to remove it to charge, but the large battery can last up to eight months. The downside is that it is a huge, chunky doorbell, which may not meet the spousal approval factor for a good-looking doorbell.\nAnother neat feature of the Tapo is doorbell calling. When someone rings your doorbell, the alert comes in like a phone call, making it less likely that you’ll miss it. This is something first offered on Arlo buzzers, and Ring says it’s bringing it to its line.\nAs Tapo also offers a wide range of smart home products — including security cameras, smart lights, and robot vacuum cleaners — you can tie your doorbell into smart home routines.\nIf you have lots of devices, the Tapo app can get a bit cluttered. But it’s easy enough to use and packed with features, including quick replies, a privacy mode that turns the camera off, and the ability to schedule notifications, set detection zones, and specify the type of alert you want to get from each one (e.g., only notify me if you see people in this zone and packages in this zone).\nRead my full Tapo D225 review.\nMore expensive, but more flexible\nReolink Battery Doorbell\nThe Reolink is sleeker than the Tapo, with very good video quality and HDR support but no 24/7 recording. It can record local video on a microSD card, Reolink Hub, or FTP server and connect to a platform like Home Assistant. But its battery doesn’t last as long as Tapo’s, the app can be confusing, and the smart alerts are spotty. It works with Amazon Alexa and Google Home.\n\nWhere to Buy:\n\n $119.99 at Amazon\n $119.99 at Reolink\n\nBest wired video doorbell that works with Amazon Alexa and Ring\nRing Wired Doorbell Pro\nThe flagship Ring doorbell has the best video quality, good connectivity, and excellent motion detection. It works smoothly with Amazon Alexa but is expensive, requires a subscription for most features, and doesn’t offer 24/7 recording.\n\nWhere to Buy:\n\n $229.99 at Amazon\n $229.99 at Best Buy\n $229.99 at Ring\n\nVideo quality: 1536 x 1536p, HDR / Smart alerts: Person, package ($) Aspect ratio: 1:1 / Field of view: 150 degrees horizontal, 150 degrees vertical / Power options: Wired / Wi-Fi: 2.4GHz and 5GHz / Storage: Cloud and local (with Ring Alarm Pro) / Subscription fee: $4.99 a month / Works with: Amazon Alexa, Samsung SmartThings\nThe Ring Wired Doorbell Pro (formerly Ring Doorbell Pro 2) — previously my top pick — is the best wired doorbell camera that works with Amazon Alexa and integrates with Ring Alarm and other Ring cameras. It’s more expensive than the Nest Wired — which also works with Alexa — but its video is higher quality and much brighter.\nIt has an ideal square aspect ratio for a full front porch view, speedy notifications, and impressively accurate motion detection using three separate sensors — radar, video analysis, and passive infrared. It also has a nice slim design and multiple faceplate options to fit your decor.\nBut there’s no free video recording, no option for 24/7 recording (yet), and the smart alerts are limited to people and packages. However, you can now search for things like vehicles and animals after the fact with Ring’s Smart Video Search feature. This makes tracking down my cat or checking which delivery driver came by a little easier.\nThe Ring Pro also works with Samsung SmartThings, and while it doesn’t support Apple Home, it can be integrated with extra hardware. There’s no support for Google Home.\nA true wired doorbell, the Ring Pro is one of the most responsive doorbells I’ve tested, delivering notifications immediately. It also has the best range and connectivity, and built-in, full-color preroll helps ensure you don’t miss any crucial action.\nThe Pro has good color night vision, dual-band Wi-Fi, and smart responses (which let your doorbell talk to your visitor for you). The Ring app is best in class, and there are pages of settings you can tinker with. Plus, the timeline view for scrolling through your recordings is very good.\nThe Pro will work with your existing doorbell chime, plus Ring sells a plug-in Chime and Chime Wi-Fi extender that can help boost connectivity while providing a selection of fun doorbell tones.\nAs with most doorbell cameras, the Pro can use Echo smart speakers to announce when someone is at the door. As a Ring doorbell, it can also automatically pull up a live feed of your front door on an Echo Show or Fire TV-enabled television when someone presses the doorbell.\nThe downside is that the Pro is expensive. Its subscription fee starts at $4.99 a month (or $49.99 a year). This adds recorded footage, smart alerts, and an extra six seconds of preroll video, which, in lieu of 24/7 recording, provides plenty of time around motion events to catch all the action.\nThe Pro works with Ring Edge for local storage and video processing, plus the option of cellular backup. But you need a Ring Alarm Pro and Ring Home Premium subscription for this, which costs $20 a month and no longer includes professional monitoring of your alarm (that’s now a $10 add-on).\nRing recently added 24/7 recording to some wired cameras, and that feature will be included in the $20-a-month plan. While this isn’t coming to the wired doorbells at launch, Ring has said the feature will expand to more devices soon.\nRead our Ring Wired Doorbell Pro review.\nA battery-powered alternative\nRing Battery Doorbell Pro\nIf you like the sound of the Wired Pro but don’t have wires, the Ring Battery Doorbell Pro has almost all of the same features —  including head-to-toe view, excellent video, dual-band Wi-Fi, color preroll, color night vision, and noise-canceling audio — in a battery package. It also features radar motion detection, which cuts down on nuisance notifications, and is a great alternative to the Pro 2.\n\nWhere to Buy:\n\n $229.99 at Amazon\n $229.99 at Best Buy\n $229.99 at The Home Depot\n\nA great wired doorbell camera for Ecobee users\nEcobee Smart Doorbell Camera\nThis is the only video doorbell that can use an Ecobee thermostat as a video intercom, making it a no-brainer for Ecobee households, as long as you can hook it to your doorbell wiring. \n\nWhere to Buy:\n\n $159.99 $144.99 at The Home Depot\n $159.99 $147.99 at Best Buy\n $159.99 at Ecobee\n\nVideo quality: 1080p, 8x zoom, color and IR night vision / Smart Alerts: Person, package Aspect ratio: 3:4 portrait / Field of view: 187 degrees diagonal / Power options: Wired / Wi-Fi: 2.4GHz, 5GHz / Storage: Cloud / Subscription fee: $5 a month or $50 a year  / Works with: Amazon Alexa, Apple Home, Google Home\nThe Ecobee Smart Doorbell Camera is a great wired doorbell camera and the only one that can use an Ecobee thermostat as a video intercom — a neat feature. It sends fast, accurate alerts for people and packages, and thanks to radar detection and computer vision motion detection, it never once sent me a false alert.\nThe Ecobee has a comprehensive 187-degree diagonal field of view that lets you see top to bottom and side to side and offers decent 1080p HD video. A subscription is required for viewing recorded video, $5 a month / $50 a year, but alerts for people and packages are free. In 2024, Ecobee introduced the ability to control your Yale or August Wi-Fi-enabled door lock directly from its app, so you can more easily unlock the door for someone from afar.\nOne quirk is that while the Ecobee records all motion (if you subscribe), it only alerts you if it sees people or packages. This does cut down on the number of alerts you get, but I’d like the option to turn motion alerts on, mainly so I can know when my dog has gotten out and is sitting at my front door (especially because there are no animal or vehicle alerts). The doorbell does record all motion events for up to two minutes, so you can go back and view them, but you won’t get notified.\nThe Ecobee works with Apple Home and can ring a HomePod as a chime (as well as your existing chime), plus pull up a live view on your Apple TV. But it doesn’t support HomeKit Secure Video, so you have to pay Ecobee’s subscription fee if you want recorded videos. It also works with Amazon Alexa and recently added support for Google Home. If you have an Ecobee thermostat in a convenient location, this is an excellent option.\nRead my full Ecobee Smart Doorbell Camera review.\nBest video doorbell camera for Apple HomeKit Secure Video\nAqara G4 Video Doorbell\nThe Aqara G4 is an inexpensive HomeKit Secure Video doorbell that also works with Alexa and Google Home. It’s powered by batteries, wires or both, and offers 24/7 local recording. But a 16:9 aspect ratio and poorer video quality let it down. \n\nWhere to Buy:\n\n $119.99 $89.99 at Best Buy\n $119.99 $99.99 at Amazon\n\nVideo quality: 1080p / Smart Alerts: Person, facial recognition and person, facial recognition, packages with HSV, / Aspect ratio: 16:9 / Field of view: 162 degrees horizontal / Power options: Wired or battery / Wi-Fi: 2.4GHz / Storage: Cloud and local / Subscription fee: Seven days of free cloud storage or 99 cents a month with iCloud / Works with: Apple Home, Amazon Alexa, Google Home\nAqara’s G4 is currently the best video doorbell for Apple Home users, especially if you want 24/7 video recording. It’s also the only battery-powered doorbell that’s compatible with Apple Home, and it works with HomeKit Secure Video.\nIt runs on six standard AA batteries and can be hardwired to support 24/7 video recording (through Aqara’s app, though, not in Apple Home). It’s jam-packed with features, but it’s probably best suited for those who live in apartments as its landscape aspect ratio means it can’t really see packages at the doorstep, and it’s not very weather-resistant.\nAt $120, it’s the least expensive HomeKit option and pairs with the Aqara U100 smart lock (which also works with Apple Home and Home Key) for a nice, fully Apple Home-compatible setup on your front door. As a bonus, you can easily unlock the door from the same screen as viewing your doorbell footage.\nDownsides include a 16:9 aspect ratio (a problem if you want to see packages on your porch), no HDR imaging, which delivers pretty bad video quality, and a finicky chime box that has to be plugged in inside and near the doorbell. That chime also houses a microSD card, which is required for 24/7 recording. Unfortunately, the G4 can’t ring an existing electronic chime, but the chime box is plenty loud, and you can customize the heck out of the sounds.\nThe G4 has smart alerts for people, packages, animals, and vehicles, facial recognition, and the option to announce who is at the door on a connected HomePod or HomePod Mini (you need an Apple Home hub to use this in HomeKit).\nIt responded quickly to doorbell rings and motion alerts, but I had some connectivity issues. Plus, occasionally, I got an overheating warning while testing in May 2024 — and that was before the heatwave we experienced in South Carolina this summer.\nAqara has its own app, which has a ton of innovative features, including custom ringtones for different people, a voice changer, and the option to have your smart home devices react depending on who is at the front door.\nThe Aqara app adds access to 24/7 video, a nice feature to have, especially for free. The implementation is spotty, and video quality is not great, but it will do in a pinch. In addition to Apple Home, the Aqara doorbell works with Google Home and Amazon Alexa.\nNote: Aqara announced the Aqara Doorbell Camera Hub G410 earlier this year, which adds 2K video quality, a 4:3 aspect ratio, and end-to-end encryption of video. You can read more details here. I’ll be testing it soon.\nRead my full Aqara Video Doorbell G4 review.\nBest video doorbell door lock\nEufy FamiLock S3 Max\nEufy FamiLock S3 Max Palm Vein Recognition Wi-Fi Smart Lock\n\nWhere to Buy:\n\n $399.99 at Amazon\n $399.99 at Best Buy\n $399.99 at Eufy\n\nVideo quality: 2K HD / Smart Alerts: Person, motion, / Aspect ratio: 16:9 / Field of view: 150 degrees horizontal / Power options: Battery / Wi-Fi: 2.4GHz, 5GHz / Storage: Local / Subscription fee: N/A / Works with: Apple Home, Amazon Alexa, Google Home\nEufy’s FamiLock S3 Max is a two-in-one video doorbell and smart lock that manages to handle both functions pretty well. Its $399 price tag may cause sticker shock at first but is easier to accept when you consider the price of a smart door lock and video doorbell together. \nThe FamiLock S3 Max has a 4-inch screen that shows a live video feed of what’s captured by the front camera, so you can check it at a glance without opening your phone. The screen also allows other people in your household to check who’s at the door without having Eufy’s app installed, which is especially helpful for kids and guests. \nYou can unlock the FamiLock S3 Max using an app, PIN code, key, or palm recognition, which works by using infrared light to scan the vascular patterns beneath the palm of your hand. Using palm recognition doesn’t require you to physically touch the door lock and can be more reliable than a fingerprint reader for older folks whose fingerprints have degraded over time. It took a little time to get used to unlocking my door this way, but it worked reliably once I did. To lock the door, you’ll need to push a button on the lock, or enable auto-lock within Eufy’s app.\nRunning both a video doorbell and smart lock takes a lot of power, and in our tests, the FamiLock S3 Max’s battery was down to 41 percent after one month. It does have four AAA batteries to keep basic functions operational while you charge the lock’s main battery. You can also pick up a spare battery from Eufy for $37 if you want to have a fully charged backup at all times. \nIn our tests, the FamiLock S3 Max recorded clear video both day and night, though a protruding door frame blocked part of the camera. You can save video footage for free within Eufy’s app because it’s stored locally rather than in the cloud. You’ll receive an alert when people or motion are detected, but the video doorbell can’t recognized specific events, like package recognition. Hooking it up to Eufy’s HomeBase 3 enables some smart alerts, including pet and vehicle detection and facial recognition, but will set you back $150. \nYou can view a live feed from the camera on an Amazon Alexa or Google Home smart speaker with a screen, but I found it easier to just check the display built into the smart lock. Apple Home support is available on the smart lock portion of the FamiLock S3 Max, but not the video doorbell. Still, if you want both a smart lock and video doorbell without having to install and manage two separate devices, Eufy’s FamiLock S3 Max is a compelling choice.\nRead my full Eufy FamiLock S3 Max review.\nOther doorbell cameras I tested\nThe Reolink Video Doorbell (starting at $99) is a wired version of Reolink’s battery model mentioned above. It’s worth considering if you can use Power over Ethernet (there’s also a Wi-Fi version). There’s also the option of dual-band Wi-Fi, local storage to a microSD card or FTP server, and 24/7 recording with compatible hardware. I tested the black Wi-Fi version ($109.99), which streams good 2K video but only supports person detection (which is fairly inaccurate) and has a more horizontal field of view. The white model has package detection and a more vertical field of view. The battery Reolink adds animal and vehicle alerts and has a better field of view, so it’s the better choice unless you want PoE.\nThe Tapo D210 ($59.99) is a battery-powered doorbell with a similar design to the D225, but there’s no wiring option, so it can’t record 24/7. It does have free local recording with a microSD card and free alerts for people, pets, and vehicles, but there’s no package detection. Its rectangular 16:9 aspect ratio shows less of my porch, and it’s only available in white. While it has a few more features than the similarly priced Blink, it is very big and bulky, has a shorter battery life, and can’t be wired to trickle-charge or ring your existing chime (it does come with a plug-in chime). \nThe Ring Battery Doorbell ($99.99) suffers badly from the back-of-the-head problem common with battery-powered buzzers. Other than that, it’s a fine basic buzzer, but it doesn’t have removable batteries. While the redesigned quick-release system makes it easier to remove the doorbell to charge, the Plus is worth the extra money for the added convenience and better video resolution. The one thing this Ring has going for it is its slim profile, which makes it a good option if you want something more discreet.\nThe Google Nest Doorbell (battery) is worth considering if you are in a Google household and can’t wire your doorbell, but it is big and bulky. Plus, you have to remove it to charge. Specs and price-wise, it’s the same as my top pick, the Nest Doorbell (wired), but it can’t record 24/7, which the wired Nest can. It’s also twice the size of the wired model. \nThe Eufy Video Doorbell Dual is a previous pick that doesn’t require any monthly fees and records footage locally. But at $250, it’s very expensive, and there are now better, cheaper options. It’s still great thanks to its dual camera feature that lets you see your porch and your visitor with a wide view, plus free smart alerts, including facial recognition and a neat uncollected package alert. It’s worth considering if you already have a Eufy HomeBase. You can read my full review here.\nThe Wyze Video Doorbell Pro is a battery buzzer with impressive features for its price, and if you hardwire it, you get preroll video. However, a five-minute cooldown period between recordings, unless you pay for a subscription, is an inexcusable amount of time that negates its offer of “free recording.” Plus, Wyze has had some major security issues in the past.\nThe Ring Video Doorbell Wired is a budget buzzer at just $60, but it won’t work with your existing chime and doesn’t draw the same amount of power from those wires as the Ring Pro 2, making it generally less reliable. Without HDR, its video quality is spotty.\nThe Netatmo Smart Video Doorbell has some interesting features, including entirely local storage (to an included microSD card) and free person recognition. It also works with Apple Home (but not HomeKit Secure Video), but a weirdly narrow field of view and poor video quality let it down — not to mention the $300 price tag and recent lack of availability.  \nThe Logitech Circle View Wired is another Apple HomeKit Secure video option I tested, which, while fast, is expensive, only works with Apple Home, and frequently dropped off my Wi-Fi network. \nIn addition to Eufy’s FamiLock S3 Max, I’ve also tested the Lockly Vision Elite and the Eufy Security S330 Video Smart Lock. Both are very expensive and work better as door locks than doorbells. But if you have a specific need for this device (e.g., you have nowhere else to put a doorbell camera), then they are useful for at least seeing up the nose of whoever is at your door, if not much beyond that.\nDoorbell cameras I plan to test\nBlink launched an upgraded version of its doorbell in May. The Blink Video Doorbell (newest model) is the same price as the current model ($69.99) but adds a head-to-toe view of your porch, 1440p x 1440p image resolution, and person detection. It requires a Sync Module to work, which the current version doesn’t.\nThe Aqara Doorbell Camera Hub G410 is an upgrade to the G4. It offers 2K video quality, a 4:3 aspect ratio, and end-to-end encryption, along with a mmWave sensor for more accurate person detection. Uniquely, it uses dual-band Wi-Fi and is a Zigbee, Thread, and Matter smart home hub for Aqara’s wide smart home system.\nThe Arlo Video Doorbell (wired / wireless) is the second generation of the excellent Arlo Essential wired, which was a former pick in this guide. It doesn’t have the option of wiring only; instead, it’s a battery doorbell you can wire to trickle-charge. There’s a choice between 1080p ($79.99) and 2K ($129.99) resolutions, and it features a 180-degree field of view and an integrated siren. Recording and smart alerts require a $10 per month subscription ($8 if paying annually), and there’s no local storage or 24/7 recording, but there are AI-powered features (including facial recognition).\nSwitchbot’s first video doorbell comes with an in-home display/chime to give you a quick way of seeing who  is at the door. No price, release date, or further details are known yet.\nThe $50 Kasa Smart Doorbell (KD110) from TP-Link comes with a plug-in chime, 2K video quality, free person detection, and the option of local storage to a microSD card. It’s a wired doorbell with a 160-degree viewing angle and works with Amazon Alexa and Google Home.\nI plan to test several subscription-free doorbells from Eufy, including the Eufy Doorbell E3340, C210, and S220.\nPhotos by Jennifer Pattison Tuohy / The Verge\nUpdate, August 12th: Updated to include Eufy’s FamiLock S3 Max as the best video doorbell door lock, and adjusted pricing throughout.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "949bdccbce3e17d4dd865aa9997fa2413d8b3c30",
      "title": "Taylor Swift announces her next era: 'The Life of a Showgirl'",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5500115/taylor-swift-new-album-life-showgirl",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T16:26:20.000Z",
      "summary_90w": "",
      "raw": "After cryptic Instagram posts and a surprise countdown clock, Swift announced early Tuesday that her new album will be called The Life of a Showgirl. The cover art and release date remain a mystery.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Musk threatens Apple and calls OpenAI boss a liar as feud deepens",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T16:22:44.000Z",
      "summary_90w": "",
      "raw": "Relations between the two tech bosses have soured amid a slew of lawsuits and social media digs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c25402a33e82a1cb24be45c3568bef552daea95",
      "title": "Everton seal Grealish loan 'coup' - but where will he play?",
      "url": "https://www.bbc.com/sport/football/articles/cz93j5vxy55o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T16:17:43.000Z",
      "summary_90w": "",
      "raw": "Everton sign Manchester City and England winger Jack Grealish on a season-long loan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b45663d70cc961155824937b28c54588a0dc6981",
      "title": "Anthropic’s Claude AI model can now handle longer prompts",
      "url": "https://techcrunch.com/2025/08/12/anthropics-claude-ai-model-can-now-handle-longer-prompts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:15:46.000Z",
      "summary_90w": "",
      "raw": "Anthropic's popular coding model just became a little more enticing for developers with a million-token context window.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0ce1e402214d2f5c2cac99d14b7ac49e748720d4",
      "title": "Starbucks tells customers in South Korea not to bring printers or PCs to cafes",
      "url": "https://www.bbc.com/news/articles/c207v3q9w08o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T16:10:57.000Z",
      "summary_90w": "",
      "raw": "Customers have been bringing in printers and multiple computers as they work from cafes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc146f18408428b9be0e14aa64821cda895a6605",
      "title": "A guide to using Edits, Meta’s CapCut rival for short-form video editing",
      "url": "https://techcrunch.com/2025/08/12/a-guide-to-using-edits-metas-new-capcut-rival-for-short-form-video-editing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:08:21.000Z",
      "summary_90w": "",
      "raw": "Meta shared that it was working on Edits in January after ByteDance-owned CapCut was removed from U.S. app stores when the TikTok ban momentarily went into effect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "220332d2a4e2499a8071b95c6d6a43d913306632",
      "title": "Middle East crisis: 25 foreign ministers issue joint call for ‘flood’ of aid into Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/12/gaza-israel-lobal-outcry-killing-of-six-journalists-al-jazeera-middle-east-latest-updates-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T16:02:48.000Z",
      "summary_90w": "",
      "raw": "Representatives from countries including UK, Australia and France say that humanitarian suffering has reached ‘unimaginable levels’\nIn a post on X, Israel Defense Forces claim to have “debunked” what it called Hamas’s “starvation campaign” in Gaza.\nThe IDF said that reviews of documents showed that most deaths by malnutrition in Gaza were linked to “severe pre-existing conditions” and that only a handful of the 133 deaths by malnutrition claimed by Gaza’s authorities in July could be “verified”. The post said that the “expert review concluded that there are no signs of a widespread malnutrition phenomenon among the population in Gaza”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e4285e8d0eea4160ca21dc36af86d8353e3b80bf",
      "title": "In a world of vibe coding startups, Uno Platform is targeting enterprise developers",
      "url": "https://techcrunch.com/2025/08/12/in-a-world-of-vibe-coding-startups-uno-platform-is-targeting-enterprise-developers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:00:00.000Z",
      "summary_90w": "",
      "raw": "And it's finding customers and investors, including $2.54 million in seed funding.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53e71f1f3db923bbfb2f01a22e73f9eba97f7d50",
      "title": "'We had too much drama' - meet the Real Housewives of London",
      "url": "https://www.bbc.com/news/articles/cz711p4z101o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T15:59:31.000Z",
      "summary_90w": "",
      "raw": "The Real Housewives franchise has spread around the world but there hadn't been a series in London until now.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c417d2d692eefc2eb90c3c803c5fd951a27dbd92",
      "title": "Israel intensifies bombing of Gaza, killing 89 Palestinians in 24 hours",
      "url": "https://www.theguardian.com/world/2025/aug/12/israel-intensifies-bombing-of-gaza-dozens-killed-in-24-hours",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:56:43.000Z",
      "summary_90w": "",
      "raw": "At least 15 people queueing for food among the dead, and five people reported to have died from starvation\nIsrael has stepped up bombing Gaza, killing at least 89 Palestinians in 24 hours, including at least 15 people queueing for food, despite global outcry over the deaths of six journalists in the territory the previous day.\nGaza’s civil defence agency said Israeli airstrikes on Gaza City had intensified in the three days after Benjamin Netanyahu’s security cabinet approved plans to expand the war in the territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3de687c33ddf6183d9e7c493d4312c472fd5d12b",
      "title": "Mould, vermin and ceiling leaks: German police say they work in ‘embarrassing’ conditions",
      "url": "https://www.theguardian.com/world/2025/aug/12/german-police-unfit-work-conditions-mould-vermin-ceiling-leaks",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:52:36.000Z",
      "summary_90w": "",
      "raw": "Union calls for increased spending to revamp vehicles and station houses that it says are an insult to officers’ dignity\nGermany’s biggest police union has complained about the dilapidated state of hundreds of police stations across the country and a fleet of aged vehicles, saying conditions are a threat to officers’ health and an insult to their dignity.\n“Decades-old toilet bowls, mould in the offices, vermin, broken heating units and holes in the ceiling that let the rain in,” said Hagen Husgen of the GdP union, citing just a few of the complaints his organisation had received from members.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a17004a552c1c39b783ceefe58ae1ac0de55b57",
      "title": "YouTuber George Clarke added to Strictly line-up",
      "url": "https://www.bbc.com/news/articles/cly3318nrmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T15:46:53.000Z",
      "summary_90w": "",
      "raw": "He joins the likes of Balvinder Sopal and Jimmy Floyd Hasselbaink on the BBC dance floor show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3197def1fa056cd8136f743296fe1a1ccfd670da",
      "title": "Anthropic takes aim at OpenAI, offers Claude to ‘all three branches of government’ for $1",
      "url": "https://techcrunch.com/2025/08/12/anthropic-takes-aim-at-openai-offers-claude-to-all-three-branches-of-government-for-1/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:37:50.000Z",
      "summary_90w": "",
      "raw": "Anthropic’s escalation — a response to OpenAI’s attempt to undercut the competition — is a strategic play meant to broaden the company’s foothold in federal AI usage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "641be5f6da0af7a82efa5c49b563d6d071e050b3",
      "title": "Cassette’s new app turns your videos into retro, VHS-like home movies",
      "url": "https://techcrunch.com/2025/08/12/cassettes-new-app-turns-your-videos-into-retro-vhs-like-home-movies/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:26:54.000Z",
      "summary_90w": "",
      "raw": "Cassette's new iOS app plays back videos in a format similar to VHS, making your iPhone videos feel more like old home recordings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0d33edb924aed1ec4151520d760d8630c8b12db",
      "title": "Anduril opens solid rocket motor factory amidst ongoing chemical chokepoint",
      "url": "https://techcrunch.com/2025/08/12/anduril-opens-solid-rocket-motor-factory-amidst-ongoing-chemical-chokepoint/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:15:42.000Z",
      "summary_90w": "",
      "raw": "As more solid rocket motor suppliers are coming online, a supply chain chokepoint looms.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "051f73c6ef4cf462d9ff871aa26cc15a8085c238",
      "title": "WA Museum partnership with Woodside criticised as record-breaking marine heatwave decimates coral reefs",
      "url": "https://www.theguardian.com/australia-news/2025/aug/13/wa-museum-partnership-with-woodside-criticised-as-record-breaking-marine-heatwave-decimates-coral-reefs-ntwfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:00:26.000Z",
      "summary_90w": "",
      "raw": "A report finding 75% of coral is bleached or dead along a 1,500km stretch of WA coastline is released as fossil fuel giant inks partnership extension\n\nGet our breaking news email, free app or daily news podcast\n\nThe WA Greens and the state’s peak conservation body have condemned the extension of a research partnership between the Western Australian Museum and Woodside, as the state reels from a record-breaking marine heatwave that has killed corals over a 1,500km stretch of ocean.\nThe five-year continuation of the “longstanding collaboration”, in which the gas giant supports the museum’s biodiversity research along the WA coastline, would allow for further targeted research along the Gascoyne coast, according to announcements.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b21a7dbd99825255c6beb7489fb50844220c06e1",
      "title": "Three more interest rate cuts may be on the way. But when is increasingly looking like anyone’s guess",
      "url": "https://www.theguardian.com/business/2025/aug/13/rba-interest-rate-cuts-michele-bullock-inflation-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:00:25.000Z",
      "summary_90w": "",
      "raw": "The prospect of lower rates is good news, but Michele Bullock’s vision for the future appears blurrier\n\nGet our breaking news email, free app or daily news podcast\n\nThree down, three more to go.\nFor mortgage holders, that was the most optimistic takeaway from Michele Bullock’s press conference after the Reserve Bank of Australia’s decision to cut its cash rate for the third time this year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f1c48d58240dd7dc1927fd2bbddcd526ce77888",
      "title": "AI and misinformation in crosshairs of Labor’s review of its landslide election win",
      "url": "https://www.theguardian.com/australia-news/2025/aug/13/labor-federal-election-review-emerging-misinformation-and-ai-threats",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:00:24.000Z",
      "summary_90w": "",
      "raw": "Party appoints four people to lead a months-long review of the 2025 campaign, despite its biggest victory in decades\n\nGet our breaking news email, free app or daily news podcast\n\nLabor will use a review of its historic 3 May election victory to better prepare for cyber misinformation and artificial intelligence threats in future federal campaigns.\nThe party’s national executive has appointed four people to lead a months-long review into the campaign, despite Labor winning 94 seats in the lower house and securing its biggest victory in decades.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f13d8e05a4aa9e53ed2630d0a84b65ce891422ae",
      "title": "Australia’s borrowers may have to wait weeks for Reserve Bank’s rate cut to reduce their mortgage",
      "url": "https://www.theguardian.com/australia-news/2025/aug/13/australias-borrowers-may-have-to-wait-weeks-for-reserve-banks-rate-cut-to-reduce-their-mortgage",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:00:24.000Z",
      "summary_90w": "",
      "raw": "NAB said it would wait 13 days to pass on the 0.25% cut to borrowers, while Westpac announced it would wait 14 days\n\nGet our breaking news email, free app or daily news podcast\n\n\nMortgage rates will slide after the Reserve Bank announced a third interest rate cut of the year – but borrowers with some major banks may have to wait weeks for relief.\nLenders have lined up to reduce their rates by 0.25%, with 20 banks – including each of the big four – announcing on Tuesday that they will pass on the cuts but only two of them doing so immediately.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2f7de9646ca0a97ea2dd7dc81f950bc97e31c08",
      "title": "Aukus laws will mean anywhere in Australia could be potential nuclear waste dump, critics say",
      "url": "https://www.theguardian.com/world/2025/aug/13/aukus-laws-will-mean-anywhere-in-australia-could-be-potential-nuclear-waste-dump-critics-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T15:00:23.000Z",
      "summary_90w": "",
      "raw": "Greens senator David Shoebridge says communities will have ‘no way to protect the land’ from waste that will be radioactive for millennia\n\nGet our breaking news email, free app or daily news podcast\n\nCritics of Australia’s Aukus submarine deal say the government has given itself the power to nominate any place in Australia as a potential nuclear waste dump, without proper consultation with communities and indigenous landowners.\nAustralia has agreed to take sole responsibility for the management, security and storage of all nuclear waste from its fleet of proposed nuclear-powered submarines, including the spent fuel from the submarines’ reactors – high-level nuclear waste that will be radioactive for millennia once the submarines are decommissioned from the early 2050s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a7f757594855368b7d4d3774a9f0844f4193ebb",
      "title": "Google will now let you pick your top sources for search results",
      "url": "https://techcrunch.com/2025/08/12/google-will-now-allow-you-define-your-top-sources-for-search-results/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Google will let you define the top sources to get more stories from those sites.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "16a4755dc821394da473c7ebb818270d821fd16d",
      "title": "Uber Freight CEO Lior Ron leaves to join self-driving startup Waabi as COO",
      "url": "https://techcrunch.com/2025/08/12/uber-freight-ceo-lior-ron-joins-self-driving-startup-waabi-as-chief-operating-officer/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Self-driving truck maker Waabi has hired autonomous vehicle industry veteran and Uber Freight CEO Lior Ron to step in as chief operating officer, as the startup looks to scale its commercial operations ahead of its planned launch of driverless trucks on public highways later this year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5f2acbac6a7bdc921ecb5f32722135a0d2bbdd51",
      "title": "Dozens of luxury cars, including twin Lamborghinis, seized in London",
      "url": "https://www.bbc.com/news/articles/cp948xjkpkdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T14:57:28.000Z",
      "summary_90w": "",
      "raw": "Police seize 72 vehicles worth £6m in an operation across Hyde Park, Kensington and Chelsea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5fef24b52d4989bbd5ab766b755f39294296a94c",
      "title": "Madonna urges Pope to visit Gaza 'before it's too late'",
      "url": "https://www.bbc.com/news/articles/cly39694g30o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T14:37:56.000Z",
      "summary_90w": "",
      "raw": "The US pop star says the pontiff is \"the only one of us who cannot be denied entry\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ea5db97b7d325fa4011354c648dd3f1057cf2cd",
      "title": "Europe live: EU says Ukraine should be able to ‘choose its own destiny’ ahead of Trump-Putin meeting",
      "url": "https://www.theguardian.com/world/live/2025/aug/12/europe-live-ukraine-russia-putin-trump-viktor-orban-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T14:35:11.000Z",
      "summary_90w": "",
      "raw": "Ukrainian president thanks EU leaders for their support and calls for further pressure on Russia \nJust days before the Trump-Putin summit, Ukraine’s authoritative DeepState war map showed that Russian forces had advanced by at least 10 km (six miles) north in two prongs in recent days, part of their drive to take full control of Ukraine’s Donetsk region, Reuters reported.\nThe advance is one of the most dramatic in the last year, it stated.\n“We’re waiting for the US to follow through on the on the commitments they’ve made, the clear political commitments they’ve made, and, and that’s where we are right now as soon as we have any updates, we’d be happy to provide them.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e53a85740850c3cdef1f74663b088f72b823bb06",
      "title": "The hidden costs of cutting Medicaid",
      "url": "https://www.npr.org/sections/planet-money/2025/08/12/g-s1-82221/medicaid-cuts-big-beautiful-bill-uninsured",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T14:18:21.000Z",
      "summary_90w": "",
      "raw": "Cutting Medicaid can seem like an easy way to slash the budget. But, the costs can spread to all of us.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bd7659181fa5445590f3adf67f1634e79e9a483",
      "title": "What we learned from Nicola Sturgeon's memoir ",
      "url": "https://www.bbc.com/news/articles/cn844n379y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T14:04:17.000Z",
      "summary_90w": "",
      "raw": "The much anticipated book by the former first minister is now on sale - and the BBC's Scotland editor James Cook has been doing some speed-reading.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c2d8cbeeb2c110cbc4ba18ff4289d35c8494c67",
      "title": "A dating app, a niqab and a 9mm gun - how a US woman was hired to end a UK family feud",
      "url": "https://www.bbc.com/news/articles/cn72x5p8801o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T13:04:43.000Z",
      "summary_90w": "",
      "raw": "US woman Aimee Betro was hired to come to the UK to kill a Birmingham man as part of a family feud.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8aa2ff0bf8f3d1c02166655e0b92518736e6b9eb",
      "title": "Australian court finds Apple, Google abused app store market power",
      "url": "https://techcrunch.com/2025/08/12/australian-court-finds-apple-google-abused-app-store-market-power/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T13:00:12.000Z",
      "summary_90w": "",
      "raw": "Epic Games has just secured a win in its crusade against Apple and Google's app store policies: The Federal Court of Australia on Tuesday ruled that Apple and Google engaged in anti-competitive conduct when it came to their respective app stores, ABC News reported.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f0173479a8064d3a4bb7b827e259564fd617edb",
      "title": "Inflation remains elevated as Trump's tariffs take hold",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499344/inflation-consumer-prices-cpi-tariffs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T12:46:07.000Z",
      "summary_90w": "",
      "raw": "Inflation remained elevated last month as President Trump's tariffs continued to make their way into the prices that consumers pay. The average cost of living in July was up 2.7%.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cedc7e106eddfe296d49276a50028fb9d1ed7f2c",
      "title": "How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company",
      "url": "https://techcrunch.com/2025/08/12/how-a-once-tiny-research-lab-helped-nvidia-become-a-4-trillion-dollar-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Nvidia's research lab developed the technology that took the company from a video game GPU startup to a $4 trillion-dollar company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ea1e0af4bf30bf749d044fd5686b65caa5ae95a8",
      "title": "Jennifer Aniston says she and Gwyneth Paltrow discuss mutual ex Brad Pitt",
      "url": "https://www.bbc.com/news/articles/c3r4vq9edveo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T12:04:35.000Z",
      "summary_90w": "",
      "raw": "Asked if they ever discuss their mutual ex, she says: \"Oh, of course. How can we not? We're girls.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8315308f60dd0450c86e36cf9be48aac6886101c",
      "title": "When is it too hot to walk your dog?",
      "url": "https://www.bbc.com/news/articles/ce839egxynwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:50:59.000Z",
      "summary_90w": "",
      "raw": "How to make sure your pets are cool and comfortable during periods of hot weather.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caef277499498d7e9ad5a40a6d891b009356bb43",
      "title": "US and China extend trade truce to avoid tariffs hike",
      "url": "https://www.bbc.com/news/articles/cg7jjkvzmkxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T11:50:47.000Z",
      "summary_90w": "",
      "raw": "The US will hold its levy on Chinese imports at 30%, while China will keep a 10% tariff on American goods.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11d111a72fa4494da6ad13df79bfae1a6f62b6d3",
      "title": "Dozens killed in attack on Sudan camp for people who had fled war",
      "url": "https://www.bbc.com/news/articles/c890dx9vk8do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T11:50:20.000Z",
      "summary_90w": "",
      "raw": "An aid group in Abu Shouk camp says at least 40 were killed by gunmen from the Rapid Support Forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "572b0be163b9dac8b27be8d4f2d73148e5420ae3",
      "title": "Who were the Al Jazeera journalists killed by Israel in Gaza?",
      "url": "https://www.bbc.com/news/articles/c6200wnez73o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T11:49:16.000Z",
      "summary_90w": "",
      "raw": "Prominent reporter Anas al-Sharif and six other journalists were killed when Israel targeted a tent used by media, the broadcaster said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a54f9c18f13ae24cc22018ec697722fefa4bc83f",
      "title": "EU leaders defend Ukraine’s freedom to decide future ahead of Trump-Putin summit",
      "url": "https://www.theguardian.com/world/2025/aug/12/trump-putin-summit-alaska-eu-leaders-ukraine-sovereignty",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T11:35:40.000Z",
      "summary_90w": "",
      "raw": "Statement on Ukrainian sovereignty signed by all EU leaders except for Viktor Orbán before call with Trump\n\nRead all our coverage of the Ukraine war\n\nEU leaders made a rallying call to defend Ukraine’s freedom to decide its own future in advance of their virtual summit with Donald Trump – convened to discuss US strategy before the president’s talks with Vladimir Putin on Friday.\nWith the exception of Hungary, all EU leaders signed a joint statement, with Kaja Kallas, the EU foreign policy chief, also calling for the Ukrainian president, Volodymyr Zelenskyy, to attend the Trump-Putin summit in Alaska on Friday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6d4faf6315d636d7ac67f1e039b24a313d7ae42",
      "title": "D.C. residents express concern over crime crackdown. And, Ford invests big in EVs",
      "url": "https://www.npr.org/2025/08/12/g-s1-82200/up-first-newsletter-washington-dc-crime-crackdown-europe-trump-putin-ford-electric-vehicle-rollout",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T11:32:09.000Z",
      "summary_90w": "",
      "raw": "Washington, D.C., residents express concerns over what Trump's crime crackdown could mean for them. And, Ford plans to invest billions in building a new, cheaper electric truck",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65071f7142c49c603f865510e960a288790610af",
      "title": "Mum of murdered schoolboy Harvey Willgoose calls for killer to be named",
      "url": "https://www.bbc.com/news/articles/cwy195xg8e4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T11:24:44.000Z",
      "summary_90w": "",
      "raw": "The identity of the 15-year-old boy who killed Harvey Willgoose is protected due to his age.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbe5118c1a6442f79d6d5a617bfb675b208b2743",
      "title": "Why lung cancer is a 'hidden epidemic' in this part of the world",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/12/g-s1-77203/lung-cancer-africa",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T11:24:25.000Z",
      "summary_90w": "",
      "raw": "Rates of the world's deadliest cancer appear to be low in sub-Saharan Africa. But that statistic is masking the scope of the disease, doctors say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8d1ed4c709ccb015f64865a971005b3fdf9b547",
      "title": "Trump deploys National Guard to Washington DC and pledges crime crackdown",
      "url": "https://www.bbc.com/news/articles/cm2110me5g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T11:01:50.000Z",
      "summary_90w": "",
      "raw": "The president also takes control of the city's police force, as the mayor rejects his claims of a crime wave.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10e3c8f0426646f6456d6c3eb5160f918f8e62c6",
      "title": "NHS is over-treating men for prostate cancer, says charity",
      "url": "https://www.bbc.com/news/articles/cger2712j1yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T10:43:29.000Z",
      "summary_90w": "",
      "raw": "More low-risk cancers could be monitored rather than treated, avoiding significant side effects, says a charity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dadbb15cc7db3e1dcd3b985ca6110ae4a9dac3aa",
      "title": "Trump's takeover 'out of touch' with facts on the ground, says D.C. attorney general",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498728/trump-washington-dc-police-takeover",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T10:38:24.000Z",
      "summary_90w": "",
      "raw": "Washington D.C. Attorney General Brian Schwalb says Metropolitan Police Department officers must follow local policies that govern their policing, even as President Trump vows to crack down on crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "314d7311c6e2ede024378503431d3e53469b6887",
      "title": "Alaska was once a full-fledged Russian colony. Now it's hosting a U.S.-Russia summit",
      "url": "https://www.npr.org/2025/08/12/g-s1-82188/alaska-russia-us-putin-trump-summit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-12T09:56:16.000Z",
      "summary_90w": "",
      "raw": "Russia lost a war in Crimea in the 1850s. To pay off war debts, Russia sold Alaska to the U.S. Now, Presidents Trump and Putin will meet Friday in Alaska to discuss another war involving Crimea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf4e5d60154f36ea40d80aa0a0534b75a4fe90f8",
      "title": "U.S. and China extend tariff truce deadline for another 3 months",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5500039/us-china-tariffs-trade-truce",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:47:35.000Z",
      "summary_90w": "",
      "raw": "President Trump's executive order extends a reprieve from the threat of rising tariffs between the world's two largest economies.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8f37ee941b080f2ed353048ba3d2783ff8bf7725",
      "title": "Chinese warship crashes into own coastguard vessel while chasing Philippine boat in South China Sea",
      "url": "https://www.theguardian.com/world/2025/aug/12/chinese-ships-crash-warship-coast-guard-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:12:50.000Z",
      "summary_90w": "",
      "raw": "Footage shows Chinese coastguard vessel with its entire bow caved in after colliding with warship near contested Scarborough Shoal\nThe Philippines has released dramatic footage of a Chinese warship colliding with a vessel from its own coastguard while chasing a Philippine patrol boat in the South China Sea.\nThe incident occurred near the contested Scarborough Shoal on Monday as the Philippine Coast Guard (PCG) escorted vessels distributing aid to fishers in the area, Philippine authorities said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82fc0e50aed1562dc0c26f4b359b9992cab15d85",
      "title": "A look at the deal to allow Nvidia chip sales to China in exchange for revenue",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498744/a-look-at-the-deal-to-allow-nvidia-chip-sales-to-china-in-exchange-for-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:00:17.000Z",
      "summary_90w": "",
      "raw": "NPR's Michel Martin speaks with Peter Harrell of the Carnegie Endowment for International Peace about the Trump administration's deal to allow AI chip sales to China in exchange for revenue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1991. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "75b0645ffc8cfc2a83e0cc3917936b1121f6f90a",
      "title": "Scores still missing a week after India flash floods",
      "url": "https://www.bbc.com/news/articles/c87eyx1v039o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T08:51:55.000Z",
      "summary_90w": "",
      "raw": "Rescue operations at the disaster site have been hampered by heavy rains and blocked roads.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "062af02e3874f055c5936f8281a1644256074d01",
      "title": "Scores of bandits killed in air and ground raids, Nigerian military says",
      "url": "https://www.bbc.com/news/articles/cdd3m679dzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T08:29:51.000Z",
      "summary_90w": "",
      "raw": "The air force says it targeted more than 400 gunmen in a forest as they were planning a village raid.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de697f4bc0c3c77220b3cfcd7f43b11d1afde599",
      "title": "Charges dropped against teen pilot detained in Antarctica ",
      "url": "https://www.bbc.com/news/articles/c04rql923kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T08:12:06.000Z",
      "summary_90w": "",
      "raw": "Ethan Guo must leave the island and pay $30,000 dollars to charity for illegally landing on Chilean territory, a judge says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dba62a8f50e288025ff52a11e2cecaf470d92771",
      "title": "Grammy-winning Afropop star Tems: 'Women are not respected in the industry'",
      "url": "https://www.bbc.com/news/articles/c1leez0jn8ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T08:00:14.000Z",
      "summary_90w": "",
      "raw": "The Nigerian musician details her rise to the top of a notoriously male-dominated industry.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "528fcfc0c770bddfaa4b8753afe7ee82b824c71f",
      "title": "The Nicola Sturgeon Interview",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdjmx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T07:45:00.000Z",
      "summary_90w": "",
      "raw": "Nicola Sturgeon on her time in office, Alex Salmond, her sexuality and more.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "786ddcdef48141d582cd2f6c48f4e5e51bdb5883",
      "title": "Man faces jail in US for shipping 850 turtles in socks to Hong Kong",
      "url": "https://www.bbc.com/news/articles/c8x5rp88n9jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T07:43:22.000Z",
      "summary_90w": "",
      "raw": "The turtles were packed in boxes labelled as plastic toys, according to the Justice Department.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2dc749aec301ba86dd01cfdb595f5d30cc08e866",
      "title": "The arduous system for getting aid into Gaza",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498719/the-arduous-system-for-getting-aid-into-gaza",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Insulin needles. Sleeping bags. Nutella. These are items Arwa Damon’s charity — International Network for Aid, Relief and Assistance — has tried to send to Gaza and Israel has rejected. It’s a glimpse into the harsh reality of a humanitarian crisis with no end in sight. Today on the show, we talk to Damon about the economics of running a humanitarian nonprofit and what’s stopping more aid from reaching Gaza. \nRelated episodes: \nWhy Israel uses diaspora bonds \nWhy the U.S. helps pay for Israel’s military \nWhat could convince Egypt to take Gaza’s refugees? \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "429d766613c7eb6cc971d789bb3898a0104055a2",
      "title": "Italian athlete dies after collapse at World Games",
      "url": "https://www.bbc.com/sport/articles/c24zr5590nvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T06:30:30.000Z",
      "summary_90w": "",
      "raw": "Italian athlete Mattia Debertolis dies after collapsing during orienteering event in China.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c1fde1d973e932e949621655d770d7b84538ea2",
      "title": "Anthony Albanese says Benjamin Netanyahu is ‘in denial’ about crisis in Gaza",
      "url": "https://www.theguardian.com/australia-news/2025/aug/12/anthony-albanese-says-benjamin-netanyahu-is-in-denial-about-crisis-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T05:54:53.000Z",
      "summary_90w": "",
      "raw": "The PM’s escalating criticism of Israel comes as the French president overnight welcomed Australia’s plan to recognise Palestinian statehood\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nBenjamin Netanyahu is “in denial” over the humanitarian crisis in Gaza, Anthony Albanese claimed after a phone call with the Israeli leader, saying frustration with Israel’s military campaign in the besieged territory was part of Australia’s decision to recognise a Palestinian state.\nThe prime minister’s escalating public criticism of Israel comes as the French president, Emmanuel Macron, overnight welcomed Australia’s commitment to recognise Palestinian statehood at the UN general assembly in September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1646d35a389c9d4c755c605f8e234929022ac9a",
      "title": "Worst bleaching on record for Western Australian coral reefs",
      "url": "https://www.bbc.com/news/articles/cq877llq099o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T05:45:39.000Z",
      "summary_90w": "",
      "raw": "Scientists say the damage was caused by the \"longest, largest and most intense\" marine heatwave on record.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "190dc4d813dea7dc3041531ea95eaf389f5f06cd",
      "title": "How a Red Bull can helped solve the mystery of a missing cyclist",
      "url": "https://www.bbc.com/news/articles/c9d0j2y3w3eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:27:50.000Z",
      "summary_90w": "",
      "raw": "Dr Caroline Muirhead helped lead police to the spot where Tony Parsons had been buried after a confession from her boyfriend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42e72ed855d3e1f7f063ebf62f528b234220f941",
      "title": "North Koreans tell BBC they are being sent to work 'like slaves' in Russia",
      "url": "https://www.bbc.com/news/articles/c2077gwjlvxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T05:10:26.000Z",
      "summary_90w": "",
      "raw": "More than 50,000 North Koreans will be sent to work in Russia, as Moscow's war in Ukraine drains labour pools.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83f0597a9ce0b00131e190899f448d494d77e1aa",
      "title": "Australia PM says Israel's Netanyahu 'in denial' about Gaza war",
      "url": "https://www.bbc.com/news/articles/c79lvw4q9ylo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T04:53:05.000Z",
      "summary_90w": "",
      "raw": "Albanese had earlier said Australia would recognise a Palestinian state at the UN General Assembly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0316d3cea8a7aff3ea604484051626b6598a6b9f",
      "title": "TDK backs Ultraviolette with $21M to take India-made electric motorcycles global",
      "url": "https://techcrunch.com/2025/08/11/tdk-backs-ultraviolette-with-21m-to-take-india-made-electric-motorcycles-global/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T04:30:00.000Z",
      "summary_90w": "",
      "raw": "Ultraviolette aims to expand its electric motorcycles to 40 European countries, as well as Latin America and Southeast Asia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "df9e0ad64148d9121fe65b8cbbcc9d9adc4d767c",
      "title": "Migrants swim from Morocco to Ceuta as officials say enclave ‘overwhelmed’",
      "url": "https://www.theguardian.com/global-development/2025/aug/12/migrants-swim-from-morocco-to-ceuta-as-officials-say-enclave-overwhelmed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T04:00:12.000Z",
      "summary_90w": "",
      "raw": "Seven children reach shore as dozens of people intercepted on risky route, which authorities say is now used more often\nAbout 100 people, including several children, risked their lives by trying to swim from Morocco into Spain’s north African enclave of Ceuta early on Saturday morning, as the territory’s authorities warned that its overwhelmed reception system was close to collapse.\nRecent weeks have seen a rise in the number of people trying to reach Ceuta, with more than 50 children swimming across from Morocco on 26 July alone.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a877128dbbdc1a63c8342727ddbe3cba7b6578be",
      "title": "Flames near Madrid as wildfires burn across Spain and Portugal",
      "url": "https://www.bbc.com/news/videos/c8ryvxlr6dlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T03:32:17.000Z",
      "summary_90w": "",
      "raw": "Emergency crews are battling wildfires as a record-breaking heatwave continues across Europe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73cf07328170cce13dfaf7d0aa4cab1fe4f18118",
      "title": "Migrant sentenced to life for murdering Maryland mum in case invoked by Trump",
      "url": "https://www.bbc.com/news/articles/c1dxxddqqz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T02:58:47.000Z",
      "summary_90w": "",
      "raw": "The victim's mother told the court:  \"The brutality of her murder will haunt us for the rest of our lives.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35fc222667fc389e94a19049e783c94f98244fe6",
      "title": "Ronaldo engaged to long-term partner Georgina Rodríguez",
      "url": "https://www.bbc.com/news/articles/c7vll24y0nzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T02:00:35.000Z",
      "summary_90w": "",
      "raw": "Rodríguez shared the news on Instagram, writing \"Yes I do. In this and in all my lives\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e9a518ff89e9b1ca685addff597dde05219882a",
      "title": "Nepal offers free climbs to 97 peaks as tourism to Everest surges",
      "url": "https://www.bbc.com/news/articles/c0j99xxd1z1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T01:55:25.000Z",
      "summary_90w": "",
      "raw": "Most tourists visiting Nepal head to Everest, which has seen overcrowding and increased pollution.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e2d8102d0d733b7e27759e9e3e4c2ef52e59ccc",
      "title": "Two dead and 10 injured in Pennsylvania steel plant explosion",
      "url": "https://www.bbc.com/news/articles/ckgjj49neldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T01:29:17.000Z",
      "summary_90w": "",
      "raw": "A second death is confirmed after a search operation for a missing person stretched into Monday evening.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dd539637d168a104bbcbdcb657e736b770656ef",
      "title": "Rise in dengue fever outbreaks across the Pacific driven by the climate crisis, experts say",
      "url": "https://www.theguardian.com/world/2025/aug/12/dengue-fever-outbreaks-samoa-fiji-tonga-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T00:58:44.000Z",
      "summary_90w": "",
      "raw": "Samoa, Fiji and Tonga among the worst affected amid warning the disease and others will become ‘more common and more serious’ as the planet warms\nThe climate crisis is driving a sharp rise in dengue fever cases across the Pacific islands, experts say, as infections hit their highest level in a decade and several countries declare emergencies.\nPacific Island countries and territories have reported 16,502 confirmed cases and 17 deaths since the start of 2025, according to the Pacific Syndromic Surveillance System (PSSS), which collaborates with the World Health Organization (WHO) and other agencies. Infections across the region are at the highest level since 2016, the WHO said. Fiji, Samoa and Tonga are among the worst affected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5519d5a678d59190318366aa73e1b88158d1c48",
      "title": "Tibetans in India long for identity and homeland",
      "url": "https://www.bbc.com/news/articles/ce87v5n2n2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T23:39:59.000Z",
      "summary_90w": "",
      "raw": "Many fear they could lose the long-standing support that sustained the community after the current Dalai Lama passes away.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca3ea0ec5d88b1fad36fd7012a953ba8962f28c4",
      "title": "How to get AI to work in 22 languages",
      "url": "https://www.bbc.com/news/articles/cn0qqzz1e4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:09.000Z",
      "summary_90w": "",
      "raw": "India tackles the problem of making AI translate between its many languages and dialects",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5ebcf134e3c630af6cdd7c2917113af663672cbe",
      "title": "Is crime in Washington DC 'out of control', as Trump claims?",
      "url": "https://www.bbc.com/news/articles/c8600x7dnn4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T22:23:22.000Z",
      "summary_90w": "",
      "raw": "President Trump says he will deploy hundreds of troops to Washington DC to address crime there.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a565b76075891591c6779aeaf18f41680d74425",
      "title": "Palestinian reporters killed, international reporters banned – Israel’s other Gaza war is over narrative",
      "url": "https://www.theguardian.com/world/2025/aug/11/palestinian-reporters-killed-and-foreigners-barred-in-israels-battle-for-gaza-narrative",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T22:17:10.000Z",
      "summary_90w": "",
      "raw": "Members of press and influencers covering devastation are being silenced despite protection under international law\n\nAnas al-Sharif, prominent Al Jazeera correspondent, among five journalists killed in Israeli airstrike on Gaza\n\n\nIsrael is running two Gaza campaigns: one for military control of the strip; another for narrative control of how the world understands what happens there.\nIn theory, Palestinian journalists and social media influencers documenting starvation, mass killing and other Israeli war crimes in Gaza are protected civilians under international law.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "af85864c1e11ea8240eccf21840be0fe76305f4e",
      "title": "Canada wildfire season already second worst on record as experts warn of ‘new reality’",
      "url": "https://www.theguardian.com/world/2025/aug/11/canada-wildfire-season",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T20:08:49.000Z",
      "summary_90w": "",
      "raw": "More than 470 Canadian fires classified as ‘out of control’ as scientists say climate change exacerbating the burning\nWith hundreds of wildfires burning out of control, Canada’s 2025 fire season is already the second-worst on record, as scientists report climate change is prolonging and exacerbating the burning, leading to more destruction, evacuations and smoke-filled skies.\nMore than 470 fires across the country are currently classified as “out of control”, according to the Canadian Interagency Forest Fire Centre (CIFFC).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2b174f284d9d91773d2e012e8222083373dc",
      "title": "‘I risked everything’: remembering six media workers killed by Israel in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/11/i-risked-everything-remembering-six-media-workers-killed-by-israel-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T18:50:23.000Z",
      "summary_90w": "",
      "raw": "CJP says the period since 7 October 2023 has been the most deadly for journalists since it began gathering data in 1992\nJournalists have been prominent among casualties since the war in Gaza was triggered by Hamas’s incursion into Israel in October 2023.\nSome were working for well-known international media, others were employed by local news organisations. Several were high-profile veterans, but many were newcomers to the profession.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "880947313919ee8f43c8384cfeae8b3e5c57869f",
      "title": "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdfhf?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:42:00.000Z",
      "summary_90w": "",
      "raw": "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a691470abc6f7adf58d4178f1636c062bd040ea0",
      "title": "UN condemns targeted Israeli attack that killed five Al Jazeera journalists",
      "url": "https://www.bbc.com/news/articles/cq688qz3rlro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T17:47:23.000Z",
      "summary_90w": "",
      "raw": "Israel says it targeted correspondent Anas al-Sharif, accusing him of leading a Hamas cell, which he had denied. Israel provided little evidence for the claim.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0dfb2e0528b6a377701da8a28591133ced3c85bd",
      "title": "Moment suspects carjack a tanker lorry during police pursuit in LA",
      "url": "https://www.bbc.com/news/videos/ceqyypv5942o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T17:29:49.000Z",
      "summary_90w": "",
      "raw": "A pair of armed carjackers stole at least three vehicles, including a truck, that led to a police pursuit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d204a92b3d807ffd139b0983ff1c872283552f7d",
      "title": "Harry and Meghan sign new multi-year Netflix deal",
      "url": "https://www.bbc.com/news/articles/cvgnne6lznzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T17:06:32.000Z",
      "summary_90w": "",
      "raw": "It's a looser arrangement than their previous deal - and comes ahead of a second series of Meghan's cookery show being screened later this month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8c8d01b364de46314b41670466b7287c42930d34",
      "title": "‘Death spiral’: Mekong River megafish have shrunk by half, study reveals",
      "url": "https://www.theguardian.com/environment/2025/aug/11/mekong-river-megafish-shrunk-by-half-study-overfishing-dams-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T17:00:09.000Z",
      "summary_90w": "",
      "raw": "Fish once as large as grizzly bears have become far smaller in recent years due to overfishing, dams and climate crisis\nThe size of megafish in the Mekong River has shrunk alarmingly in recent years owing to overfishing, a study has found. The length of the largest and most endangered freshwater giants, some as big as grizzly bears, decreased by 40% in seven years.\nSome fish, like the Mekong giant catfish, have been studied for over a longer period and show a decline in weight of 55% in the past 25 years, dropping from an average of 180kg (397lb) to 80kg.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d40fb478cd771fbbbfcf1c9f64be7125bddf97ff",
      "title": "Ghislaine Maxwell court materials to stay secret, judge rules",
      "url": "https://www.bbc.com/news/articles/c1jnn2r7r47o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T16:30:07.000Z",
      "summary_90w": "",
      "raw": "The judge said there was nothing new to learn from the materials, and releasing them could hurt future grand jury proceedings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed200b3f3c222ffca2a8710b602f4ff2adf7d4e9",
      "title": "Colombian senator Miguel Uribe dies after June campaign shooting",
      "url": "https://www.theguardian.com/world/2025/aug/11/colombian-senator-miguel-uribe-dies-after-june-campaign-shooting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T16:18:58.000Z",
      "summary_90w": "",
      "raw": "Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39\nMiguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.\nUribe, an opposition candidate with the rightwing Centro Democrático party, was shot twice in the head and once in the leg during a campaign stop two months ago while vying for his party’s nomination for the 2026 elections.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6064bc6d9692689547530b924ce5bc54344ba707",
      "title": "Eight people killed in barrage of gunfire on Ecuador nightclub",
      "url": "https://www.theguardian.com/world/2025/aug/11/eight-people-killed-ecuador-nightclub",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:43:11.000Z",
      "summary_90w": "",
      "raw": "Police found 800 cartridge cases at the scene, where gunmen had arrived in two pickup trucks and opened fire\nEight people have been killed and two others wounded when a group of gunmen unleashed a barrage of gunfire on a crowd outside a nightclub in a town in south-western Ecuador.\nLaw enforcement arrived on the scene following an emergency call alerting them to a shooting, and found “several people wounded and seven bodies”, said Javier Chango, the police colonel, at a press conference on Sunday, adding that an eighth person died in the hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "441807ddb64b0246b9323978db7b23b42d256aff",
      "title": "Weather tracker: Europe braces for another heatwave with highs of 44C",
      "url": "https://www.theguardian.com/environment/2025/aug/11/weather-tracker-europe-heatwave-spain-portugal-north-america",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T10:26:47.000Z",
      "summary_90w": "",
      "raw": "Parts of Spain and Portugal likely to bear brunt of heat, while drought conditions sweep North America\n\nEurope live – latest updates\n\nAfter a period of cooler weather, swaths of central and eastern Europe face another heatwave as hot air over south-western Europe pushes north-west.\nSince late July, large parts of the Iberian peninsula have endured persistent heat, with temperatures frequently climbing to the high 30s to low 40s celsius.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d369b043fb360561f4eacbf65523dbf297880eb4",
      "title": "Factories from GE to Kraft Heinz lose immigrant workers, stressing those who remain",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496335/trump-immigration-workers-parole-tps",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump campaigned on helping American workers through his immigration policies. Now that he's revoked work authorization for thousands of immigrants, those left behind are feeling taxed by their absence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "88f224a667546254d25af6df313cfb4eded31142",
      "title": "Trump's tariff revenue has skyrocketed. But how big is it, really?",
      "url": "https://www.npr.org/2025/08/11/g-s1-81934/trump-tariffs-record-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump's new tariffs are pouring in. But it's still only a fraction of overall government revenues — and falls short of new spending in the recent Republican megabill.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "022d6c9011ee1101105ea6d644b311ccd9b3d3d8",
      "title": "Growing pains: can rice production in Africa keep up with demand?",
      "url": "https://www.theguardian.com/world/2025/aug/11/can-rice-production-in-africa-keep-up-with-demand",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T07:21:32.000Z",
      "summary_90w": "",
      "raw": "Africa Rice initiative aims to give farmers more control over their land in order to reduce flooding and increase yields\nSalmata Ouattara remembers 2023 as the turning point for her rice farm.\nJune is usually the peak of the rainy season in Ivory Coast, but in the preceding years she and other farmers in M’Be on the outskirts of Bouaké, the country’s second biggest city, would wait weeks for rainfall. Then in September, they would watch helplessly as their farmlands were flooded. Some abandoned their farms, frustrated by fluctuating crop yields.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f0cba1ce4f971e6dfe974a4aa734e9b97063a8b",
      "title": "What we're reading on the beach this summer",
      "url": "https://www.npr.org/2025/08/11/1257106922/what-were-reading-on-the-beach-this-summer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-11T07:00:59.000Z",
      "summary_90w": "",
      "raw": "It's time for our annual beach reading recs. Today we bring you three books, with a little economic learning to boot. Our recs: \nWho is Government? The Untold Story of Public Service edited by Michael Lewis \nEl Dorado Drive by Megan Abbott \nAlgospeak: How Social Media is Transforming the Future of Language by Adam Aleksic \nRelated episodes: \nBeach reading with a side of economics \nHow to beach on a budget \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe6c7ce90325a67bd27a5e6670771b6f6f05f0f0",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "summary_90w": "",
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b738ea59ed9d06875f61ea110fc61fe764a33fe",
      "title": "Bolsonaro supporters pray for Trump rescue as coup plot trial verdict nears",
      "url": "https://www.theguardian.com/world/2025/aug/09/bolsonaro-supporters-pray-for-trump-rescue-coup-plot-trial-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-09T09:00:02.000Z",
      "summary_90w": "",
      "raw": "Far-right ex-president’s devotees pin hopes on pressure campaign but tariffs and sanctions appear likely to fail\nEach morning, Edite Costa steps out of her bungalow on Brasília’s sun-baked savannah, stands beneath a mango tree and lifts her hands to the sky in prayer. “I ask God to work so that not just Trump but all Americans come to help us rip out the evil that has taken hold of the country I love,” said the 66-year-old Baptist, who is a fervent supporter of Brazil’s far-right former president Jair Bolsonaro.\nBolsonaro could face decades in jail for allegedly leading a murderous conspiracy to seize power after his leftwing rival Luiz Inácio Lula da Silva beat him in the 2022 presidential election. But Costa believes her populist leader can still be saved – if her prayers are answered and Donald Trump intervenes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87e0cb3806c43dd5fbc2c815f724788e794b20aa",
      "title": "Elon Musk's AI accused of making explicit AI Taylor Swift videos",
      "url": "https://www.bbc.com/news/articles/cwye62e1ndjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T23:06:01.000Z",
      "summary_90w": "",
      "raw": "Grok Imagine's \"spicy\" mode made explicit videos of Taylor Swift, according to The Verge and Gizmodo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a0cffe0b1719cb447d49291529b1e9b8f862e00",
      "title": "OpenAI beats Elon Musk's Grok in AI chess tournament",
      "url": "https://www.bbc.com/news/articles/ce830l92p68o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-08T11:37:19.000Z",
      "summary_90w": "",
      "raw": "The tournament saw models from Anthropic, Google, xAI and DeepSeek compete against each other to be crowned the top AI chess player.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "527f8f76888890f9006a32ef3b3f42d67e941604",
      "title": "How to get out of a love-hate relationship with your phone",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492392/phone-addiction",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Finding it hard to concentrate? Are you glued to social media for longer than you’d like? Well, maybe it’s not you… maybe it’s the phones.\n\nBrittany is joined by Magdalene Taylor, writer, cultural critic and senior editor at Playboy, and Fio Geiran, producer at TED Radio Hour and a writer of their Body Electric newsletter, to discuss this phrase: “it’s the phones.” They get into the effects that smartphones have on our brains and our culture, why some people are returning to “dumbphones,” and why it might take more than willpower to manage our relationships with our phones.\nClick here to check out the Body Electric newsletter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1f9673f0113254421ab14083f82fb80ecce702c",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "summary_90w": "",
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3a116098e95d5d8b862a9758d74ef9afaec1ce",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "summary_90w": "",
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "690acb123904939b5719f42c39d3568c6f9c677f",
      "title": "It's 2025, the year we decided we need a widespread slur for robots",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5493360/clanker-robot-slur-star-wars",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People all over TikTok and Instagram are using the word \"clanker\" as a catch-all for robots and AI. Here's a deep dive into the origins of the pejorative and an explanation of why it's spreading.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb5fed10d4a083eb417cdeb5c2a39344a4c35a78",
      "title": "Nihilistic online networks groom minors to commit harm. Her son was one of them",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5479882/teen-forums-violent-extremist-grooming",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Dana's son was hospitalized last year, it led her to a path of discovery about predatory online networks that groom children into harming themselves and others. Their reach is global and growing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66ced3c97746b3b0d64269796bb661b6d428ffdd",
      "title": "So long, study guides? The AI industry is going after students",
      "url": "https://www.npr.org/2025/08/06/g-s1-81012/chatgpt-ai-college-students-chegg-study",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Students are increasingly using AI tools to help with — and do — their homework. Here's how older online study services, students and professors are adapting.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8c99c5c638c53b30027e9a9648b98e72b5ba5c9",
      "title": "The history behind the QR code",
      "url": "https://www.bbc.com/news/videos/c1jnpkdjjryo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:24:56.000Z",
      "summary_90w": "",
      "raw": "It's used by millions of us every day, but why was the Quick Response code invented?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b247f10f2df4bdf9312924806cdc968fb5a578c0",
      "title": "The Gulf bets big on AI as it seeks the 'new oil'",
      "url": "https://www.bbc.com/news/articles/cvg8z2mx508o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T23:14:44.000Z",
      "summary_90w": "",
      "raw": "The UAE and Saudi Arabia are partnering with the US to position themselves as AI hubs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d20c2ce25c13cec7ba044f41abd29d0618288f2e",
      "title": "Minister must apologise over Savile claim, says Farage",
      "url": "https://www.bbc.com/news/articles/cgery3eeqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T11:28:07.000Z",
      "summary_90w": "",
      "raw": "Minister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cc9359fecc24e9e22f350119da85d0276d2276e",
      "title": "Google launches new AI search feature in UK",
      "url": "https://www.bbc.com/news/articles/clyj4zky4zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T08:43:59.000Z",
      "summary_90w": "",
      "raw": "The new tool marks a significant change for the search giant but raises questions for advertisers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}