{
  "version": "1755834968217",
  "generatedAt": "2025-08-22T03:56:08.217Z",
  "items": [
    {
      "id": "8d3ce06ad68f6c1d31ad5029e7c2414ab6b64aec",
      "title": "Australia news live: Guzman y Gomez cracks $1bn in sales but share price tumbles as US losses double",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/22/australia-news-live-penny-wong-gaza-israel-netanyahu-anthony-albanese-childcare-safety-education-database-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T03:37:20.000Z",
      "summary_90w": "",
      "raw": "Mexican-themed chain plans to open at least 15 restaurants in the US to prove its ‘concept’. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nCoalition says if Labor tries to raise taxes after roundtable it would be ‘major breach of faith’ with Australian people\nJames Paterson, the shadow minister for finance, says if the government moves to increase taxes it would be a “major breach of faith with the Australian people”. Paterson spoke to RN Breakfast after the conclusion of yesterday’s roundtable, where Chalmers said there was a longer-term process to consider major reform on the matter.\nNo Australian voted for higher taxes at the election, and so it seems that Jim Chalmers isn’t on the same page as the prime minister because he was unwilling to repeat that commitment at his press conference yesterday. And he is leaving open the door to higher taxes, and particularly on people’s retirement savings, on family trusts, on a whole range of other things.\nWhen those questions were raised during the election campaign, Jim Chalmers and the Labor party said that was a Liberal Party scare campaign. So, if they go ahead and try and increase taxes, that’ll be a major breach of faith with the Australian people.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb332494d436697134b56bf651045308769565eb",
      "title": "'My dog was my ring bearer' - the pooches playing a starring role in weddings ",
      "url": "https://www.bbc.com/news/articles/cj3ly6e5xe8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T03:32:09.000Z",
      "summary_90w": "",
      "raw": "Many couples are including their pooch in their big day, we talk to some whose dogs have played a key role.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4861cd289858e2fd0549245497489fdced32ca2",
      "title": "Ultra Violette pulls Lean Screen sunscreen from shelves as new tests find ‘inconsistent’ SPF protection",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/ultra-violette-sunscreen-lean-screen-sunscreen-from-shelves-as-new-tests-find-inconsistent-spf-protection",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:37:41.000Z",
      "summary_90w": "",
      "raw": "Company had initially challenged a Choice investigation that questioned SPF claims\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nSunscreen company Ultra Violette says it will immediately withdraw its Lean Screen Skinscreen product from the market after new tests found a “pattern of inconsistency” in its SPF results.\nThe company’s co-founders, Ava Chandler-Matthews and Bec Jefferd, on Friday published the test results in a statement in which they apologised to customers, offered them refunds and instructed them to stop using the product.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11d3b4abed46eefdb083826d3130ebcf3a3a4f1f",
      "title": "Erik Menendez denied parole three decades after killing his parents",
      "url": "https://www.bbc.com/news/articles/c3wnlldjp20o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T02:36:58.000Z",
      "summary_90w": "",
      "raw": "The younger of the Menendez brothers, who killed their parents in their Beverly Hills mansion, can try again for parole in three years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df32adc48d8de520c7f8e3beb96fc3a33dc37bf4",
      "title": "Thailand former PM faces ruling on royal insult case as fate of Shinawatra dynasty hangs in balance",
      "url": "https://www.theguardian.com/world/2025/aug/22/thailand-former-pm-thaksin-shinawatra-royal-insult-lese-majesty-court-case",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:17:30.000Z",
      "summary_90w": "",
      "raw": "Thaksin Shinawatra is accused of lese-majesty in 2015 interview, while his daughter Paetongtarn will hear next week if she will be removed as prime minster\nA criminal court in Thailand will decide on Friday whether former leader Thaksin Shinawatra violated the country’s strict lese-majesty law, the first of three court cases that could decide the fate of one of the country’s most powerful families.\nThaksin is accused of insulting the monarchy during an interview with South Korean newspaper Chosun Ilbo in 2015.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7b9d354350303b743edc7e9ec3cd2d754f96ce0",
      "title": "Indonesia working on details of plan to treat 2,000 people from Gaza amid concerns about right to return",
      "url": "https://www.theguardian.com/world/2025/aug/22/indonesia-plans-details-treat-2000-injured-palestinians-galang-island",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:17:11.000Z",
      "summary_90w": "",
      "raw": "Security ministry and the ministries of health and foreign affairs have met to discuss how the controversial proposal to treat Palestinians would work\nThe Indonesian government is working on plans to treat 2,000 people from war-ravaged Gaza, holding a series of inter-ministerial discussions to discuss logistics, legality and foreign policy implications relating to the highly sensitive proposal, according to a senior government official.\nIndonesia announced earlier this month that it would provide temporary medical assistance to 2,000 Palestinians from Gaza, with the uninhabited island of Galang identified as one possible site. Located just south of Singapore, the island was once home to a former camp for Vietnamese refugees and most recently the site of a pandemic hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e9525ab7dafdde3a0890d9db72863108c6824df",
      "title": "National childcare worker register, CCTV trial and mobile phone ban declared in major Australian safety reform",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/national-childcare-register-cctv-trial-mobile-phone-ban-declared-australian-safety-reform",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T02:09:20.000Z",
      "summary_90w": "",
      "raw": "Jason Clare says CCTV trial at 300 centres to begin later this year and improved training regime rolled out in 2026\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nChildcare workers will be put on a national register in a sweeping safety overhaul of the sector that includes a CCTV trial at hundreds of centres, mobile phone bans and mandatory staff training.\nThe commonwealth will put $189m towards the reforms and work will begin immediately.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "695df91694c9a4635aaad2a15bb33841d2e09a25",
      "title": "Anger in Italy over non-consensual photos of women shared online",
      "url": "https://www.bbc.com/news/articles/ce874j4ye3no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T01:59:57.000Z",
      "summary_90w": "",
      "raw": "The My Wife Facebook group had 32,000 members before it was shut down for violating adult sexual exploitation policies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "52037154496c2f4a17f6279c7957ed7ace6a2cd1",
      "title": "Australian doctors subjected to vexatious complaints over social media posts on Gaza, GP peak body says",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/australian-doctorssubjected-to-vexatious-complaints-over-social-media-posts-on-gaza-peak-body-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T01:26:50.000Z",
      "summary_90w": "",
      "raw": "Royal Australian College of General Practitioners letter to health regulator cites ‘growing number’ of complaints \n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\n\nA growing number of Australian GPs have reported being subjected to frivolous or vexatious complaints to the health regulator about social media posts opposing Israel’s war in Gaza.\nDr Michael Wright, president of the Royal Australian College of General Practitioners (RACGP), wrote to the Australian Health Practitioner Regulation Agency (Ahpra) on 14 August about “concerning reports” from multiple members of the college who had “publicly expressed views on the deteriorating humanitarian situation in Gaza”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b163c9a8093e4c1f4948977e309e2e1d8ae19193",
      "title": "At least five dead and dozens injured in Colombia car bomb attack",
      "url": "https://www.bbc.com/news/articles/cwypw0xvdk5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T01:05:10.000Z",
      "summary_90w": "",
      "raw": "The attack targeted an air base in the city's north, with eyewitnesses saying civilians are among the dead.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b22bee96624699871ae2654e5c0f03756f29e35b",
      "title": "Mystery ‘debris balls’ return to NSW beaches as residents warned to steer clear",
      "url": "https://www.theguardian.com/australia-news/2025/aug/22/debris-balls-nsw-beaches-central-coast-entrance-north-shelly",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T00:51:45.000Z",
      "summary_90w": "",
      "raw": "Central Coast council says residents should not touch the balls and avoid beaches where they wash ashore\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nDebris balls have again washed up along the New South Wales coast as officials warn residents not to touch the mysterious spherical globules and to avoid beaches where they appear.\nCentral Coast council said on Thursday the debris balls – which are grey-coloured and about 10mm to 40mm in size – had been found on beaches including at The Entrance, the Grant McBride baths, Blue Bay, Toowoon Bay, North Shelly, Shelly and Blue Lagoon.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da18fa84cafeeab92f9444caff810ebc751fabcb",
      "title": "OpenAI lawyers question Meta’s role in Elon Musk’s $97B takeover bid ",
      "url": "https://techcrunch.com/2025/08/21/openai-lawyers-question-metas-role-in-elon-musks-97b-takeover-bid/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-22T00:31:38.000Z",
      "summary_90w": "",
      "raw": "OpenAI says that Elon Musk met with Meta CEO Mark Zuckerberg to discuss a $97 billion takeover bid of the ChatGPT-maker.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "026bf50c2b9787a5f626dd51d39e38350c032261",
      "title": "Lil Nas X arrested and taken to hospital after wandering LA streets in underwear",
      "url": "https://www.bbc.com/news/articles/cgm2ep3eym7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T00:06:53.000Z",
      "summary_90w": "",
      "raw": "The LAPD allege the singer \"charged\" at them and was placed under arrest on suspicion of battery.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36d69de2f0cb4b72cbeea28305b613e6ee6b02e0",
      "title": "Netflix’s new Splinter Cell animated series kicks off in October",
      "url": "https://www.theverge.com/netflix/763821/netflix-splinter-cell-deathwatch-release-date-trailer",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-22T00:00:00.000Z",
      "summary_90w": "",
      "raw": "The Splinter Cell: Deathwatch animated series finally has a release date and a proper trailer, but Netflix already wants you to start thinking about what else it has coming down the pipeline.\nDuring this year’s Anime NYC convention, Netflix announced that Deathwatch is slated to debut on October 14th, and the series has added The Sandman‘s Kirby Howell-Baptiste to its cast. Howell-Baptiste will voice Zinnia McKenna, an agent working alongside Sam Fisher (Liev Schrieber) as they’re hunted by squads of trained killers. Though it’s brief, Deathwatch‘s new trailer gives you a pretty solid sense of the series’ slick and brutal action. You can also see that, tonally, the series is going to be a rather serious video game adaptation. But things are going to be a bit different for the next season of Netflix’s take on Devil May Cry.\n\nDue out some time in 2026, Devil May Cry‘s second season will see Dante (Johnny Yong Bosch) and Vergil (Robbie Daymond) reuniting for a battle to the death. In a teaser for the new season, the two brothers actually seem to be having a ball shooting and slashing at each other while humans and demons get caught in the crossfire. It will be interesting to see if the new season really ups its action set pieces when it returns.\n\nThat seems to be the plan for Blue Eye Samurai‘s next season. Along with a scene from Blue Eye Samurai season 2 focused on Mizu (Maya Erskine) storming a stronghold, Netflix shared a behind-the-scenes featurette where series co-creators Amber Noizumi and Michael Green, and executive producer Jane Wu, tease some of what we can expect to see. It looks like Mizu’s quest for revenge will take her all the way to London and involve at least a couple of seemingly-dead characters making unexpected returns. Season 2 is still in production and doesn’t have a firm release date just yet. But you can see from the featurette that the creative team is cooking, especially when it comes to choreographing the show’s action sequences.\nNetflix also shared new trailers for the second half of Sakamoto Days‘ first season, which is currently streaming, and for the third season of Record of Ragnarok, which premiers this December. The big takeaway is that Netflix isn’t easing up on its animated projects. It might be a while before we actually get to see a lot of this new stuff, but hopefully it will be worth the wait.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "73fff78f64cc5335e3308cb61c52c82e53df1ac2",
      "title": "Bereaved families feel 'ignored' over maternity review",
      "url": "https://www.bbc.com/news/articles/c1ejq4yy501o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T23:57:08.000Z",
      "summary_90w": "",
      "raw": "It follows a meeting between the families and Baroness Amos, who will chair the review.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1bc4c7534ced12367ba39b2c26bbed6d2e06f126",
      "title": "Baby food firms told to cut sugar and stop promoting snacks for under-ones",
      "url": "https://www.bbc.com/news/articles/cvgpld8p9rqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T23:42:39.000Z",
      "summary_90w": "",
      "raw": "Manufacturers who do not make products healthier within 18 months may face action, the government says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "579e819d493401f15146f903524352f6888515cd",
      "title": "'Record asylum claims' and 'Strictly rocked'",
      "url": "https://www.bbc.com/news/articles/cger0pj8nxwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T23:38:04.000Z",
      "summary_90w": "",
      "raw": "New figures on asylum seekers and a change of dancers for Strictly Come Dancing make Friday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a19bd4c11aee79f28f9817b4d4acae3485832c57",
      "title": "The race for the two miles-a-second super weapons that Putin says turn targets to dust",
      "url": "https://www.bbc.com/news/articles/cgeqj1q8gj4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T23:24:37.000Z",
      "summary_90w": "",
      "raw": "Russia and China are leading the global race in hypersonic missiles - how worried should we be that the US is playing catch up and the UK has none?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad9d968a6b99ac4763a56b9bdd4e84ea8774f060",
      "title": "Kennedy Center terminates dance programming team",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5510039/kennedy-center-dance-programming",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T23:00:13.000Z",
      "summary_90w": "",
      "raw": "This is the latest shakeup since Trump took over the cultural center. \"We will have an exciting announcement about the new direction for Dance programming soon,\" said a Kennedy Center spokesperson.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53f7e12ea625fe8d6d6777841e3203e95f6c67f8",
      "title": "Here are the best streaming service deals available right now",
      "url": "https://www.theverge.com/23353629/streaming-deals-netflix-hulu-disney-plus-amazon-prime-video-hbo-max-best-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T22:35:18.000Z",
      "summary_90w": "",
      "raw": "To celebrate the launch of ESPN Unlimited, Disney is offering a discounted bundle through January 5th. | Image: Getty Images\t\n\nSo far, 2025 has been a great year for watching new, must-see TV shows and movies on subscription services. But if you, like many of us, have more concurrent subscriptions than you care to admit, you’ll agree that keeping up with the latest stuff every month can get expensive. They may not cost as much as most of the tech we cover, but it adds up.\nIf you’re trying to cut down on your expenses, you might be able to do so while holding onto your precious subscriptions. Attempting to cancel your service is a good way to see if you’ll be offered a cheaper monthly rate to stick around. Outside of that, several services offer promos at different times throughout the year, some of which are even available to new and returning subscribers alike. Below, we’ve curated some of the best deals going on right now, so you can enjoy streaming your favorite show or movie for less than it would typically cost you.\n\n\n\n\n\nThe best Peacock deals\nThe best Hulu deals\nThe best Sling TV deals\nThe best Apple TV Plus deals\nThe best HBO Max deals\nThe best Netflix deals\nThe best YouTube TV deals\nThe best Paramount Plus and Showtime deals\nThe best Starz deals\nThe best Amazon Prime Video deals\n\nNote: keep an eye out for free trials and student discounts\nMost streaming services offer free trials that typically last from a week to a month, whether you sign up for an annual membership or just a monthly subscription. However, you will likely have to provide your credit card information in advance, and you will be charged once your trial is over, so make a note in your calendar if you don’t want to be charged.\nSome streaming platforms offer student discounts. These include Hulu, Paramount Plus, YouTube TV, Amazon Prime, and more. You’ll have to prove your student eligibility through a sign-up form and typically be enrolled in an accredited Title IV college or university to take advantage of these deals.\nThe best Peacock deals\nPeacock\n\nWhere to Buy:\n\n $10.99 at Peacock (monthly, with ads)\n $16.99 at Peacock (monthly, with no ads)\n $109.99 at Peacock (annual, with ads)\n\nPeacock is NBCUniversal’s streaming service, one that offers next-day programming from NBC (and Bravo). The platform also provides access to live sports programming, including Sunday Night Football and WWE, as well as movies and shows like The Wild Robot, Conclave, Wicked, Oppenheimer, Yellowstone, Teacup, Saturday Night Live, Rian Johnson’s Poker Face, and The Office spinoff, The Paper, which debuts on September 4th.\nThe platform currently offers two plans: an ad-supported Peacock Premium tier for $10.99 a month (or $109.99 a year) or the ad-free Peacock Premium Plus tier for $16.99 a month (or $169.99 a year). Only the latter lets you download content for offline viewing. These new prices went into effect in late July for new subscribers, and current subscribers will continue paying the previous rate until August 22nd.\nIn terms of deals, things are pretty dry right now. You can grab a complimentary subscription when you sign up for a year of Instacart Plus ($99 annually or $9.99 a month). You can also get free access if you’re an Xfinity Internet customer with gigabit speeds or a Diamond or Platinum Rewards member. If you’re a first responder or a medical professional (and are alright with your credentials being verified by SheerID), you can get Peacock’s monthly plan for $3.99 per month, which is a nice perk.\nThe best Disney Plus deals\nDisney Plus, Hulu Bundle Basic\nThis bundle comes with ads and grants access to all of the shows and movies available in Hulu’s and Disney Plus’ library.\n\nWhere to Buy:\n\n $10.99 at Disney (monthly, with ads)\n\n\nDisney Plus, Hulu, ESPN Unlimited Bundle\nThe bundle grants access to Disney Plus, Hulu, and the new ESPN Unlimited, which includes access to all of ESPN’s networks and services, including ESPN Plus.\n\nWhere to Buy:\n\n $35.99 $29.99 at Disney Plus (with ads)\n $44.99 $38.99 at Disney Plus (without ads)\n\nWith Disney Plus, you can stream a wide range of shows and movies, including Star Wars: Skeleton Crew, Deadpool & Wolverine, Andor, X-Men ‘97, Your Friendly Neighborhood Spider-Man, and Taylor Swift’s Eras Tour film. A monthly subscription currently costs $9.99 a month with ads or $15.99 a month without (or $159.99 annually). The $15.99 per month service includes Dolby Atmos sound in content that supports it, as well as the ability to download TV shows and movies on up to 10 devices.\nFor just a dollar more, Disney offers an ad-supported, $10.99-a-month Duo Basic subscription that brings together Disney Plus and Hulu. To enjoy an ad-free experience across both services, the cost is $19.99 per month.\nThere’s also the $16.99-a-month Disney Bundle Trio Basic bundle, which includes the ad-supported Hulu and ESPN Plus (paying $26.99 a month nets you the ad-free version of Hulu and Disney Plus, though ESPN will still have ads). That’s cheaper than subscribing to all three streaming services individually, and is the wisest route to take if you want all three.\nNow through January 5th, Disney is celebrating the launch of ESPN Unlimited — a $29.99 streaming service that grants access to all of ESPN’s networks and services, including ESPN Plus — with a discounted bundle. You can currently get a year of Disney Plus and Hulu (with ads), along with ESPN Unlimited, for $29.99 a month, down from $35.99. You can also sign up for an ad-free bundle for $38.99 a month, down from $44.99.\nCarriers are also offering deals on other plans. Those currently on one of Verizon’s Unlimited plans, for instance, can get Disney Plus Trio Basic with ads for $10 a month instead of $16.99. If you already subscribe to Verizon’s existing Legacy bundle, you can also continue to enjoy ad-free Disney Plus, as well as ad-supported ESPN Plus and Hulu, for $15 per month ($6 off).\nThe best Hulu deals\nHulu and Disney Plus (with ads)\nHulu grants access to originals like The Handmaid’s Tale, as well as non-Hulu content like Shogun, The Bear, Futurama, Say Nothing, and Alien: Romulus.  T-Mobile also offering complementary access to the Hulu-ad supported plan when you maintain a qualifying Go5G Next line.\n\nWhere to Buy:\n\n $9.99 at Hulu \n\nHulu offers both ad-supported and ad-free plans. No matter which you sign up for, you’ll be able to access all of Hulu’s TV shows and movies on multiple devices, including originals like The Handmaid’s Tale and Alien: Earth, as well as other content, like Shogun, The Bear, Futurama, and the recent revival of King of the Hill. The service also allows two people to stream simultaneously, and you can have up to six user profiles. However, subscribing to the ad-free plan means you won’t have to deal with commercials; you’ll also be able to watch downloads offline.\nThe ad-supported plan currently costs $9.99 per month, while the ad-free plan costs $18.99 a month. Hulu also sells ad-free and ad-supported bundles that include Disney Plus and / or ESPN Plus, which are cheaper than subscribing to each service individually. With the Hulu with Live TV, Disney Plus, and ESPN Plus bundle, you’ll be able to access more than 90 live sports, news, and entertainment channels, as well as content from each of the streaming services. You’ll also be able to record live shows with unlimited DVR storage and take advantage of the same features the standard, ad-free, and ad-supported Hulu plans offer. The ad-supported Hulu with Live TV subscription is $82.99 a month, while the ad-free tier is $95.99 a month (though, it’s worth noting that, of the three services included, ESPN Plus will still have ads, even at this tier). Complicated, right?\nHowever, if you just want Hulu and don’t need the live TV version, you can subscribe to the ad-supported Disney Bundle Duo Basic, which includes Disney Plus, for $10.99 a month. You can also add ESPN Plus for $16.99 per month, or get rid of ads and add live sports for $26.99 a month.\nIn terms of deals, students can subscribe to the ad-supported version for $1.99 a month or a bundle that combines Spotify Premium, Showtime, and ad-supported Hulu for $5.99 a month. Some wireless carriers are also offering customers discounts when they sign up for premium phone plans. As mentioned previously, those currently on one of Verizon’s Unlimited plans can get the Disney Plus Trio Basic with ads for $10 per month instead of $16.99. If you already subscribe to Verizon’s Legacy bundle, you can also continue to stream ad-free Disney Plus and ad-supported ESPN Plus / Hulu for $15 a month ($6 off). T-Mobile, meanwhile, offers complimentary access to Hulu’s ad-supported tier when you maintain a qualifying Go5G Next line. \nThe best Sling TV deals\nSling TV\nSling TV is a live TV streaming service featuring live and on-demand TV channels like CNN, Fox, NBC, Comedy Central, Cartoon Network, and more. \n\nWhere to Buy:\n\n $230 $199 at Sling Orange (five months)\n $230 $199 at Sling Blue (five months)\n $330 $274 at Sling Orange and Blue (five months)\n\nSling TV is a streaming service that functions as a more affordable alternative to YouTube TV and Hulu with Live TV. With it, you can watch a range of streaming services as well as live and on-demand channels — including ESPN, CNN, Fox, NBC, Comedy Central, and Cartoon Network — on multiple devices.\nSling offers an ad-supported free tier — Sling Freestream — which provides access to more than 500 live channels as well as more than 40,000 on-demand movies and TV shows. \nThe platform also offers four paid plans, all of which come with 50 hours of DVR storage: Sling Select ($19.99 a month); Sling Blue ($50.99 a month); Sling Orange ($45.99 a month); and Sling Orange and Blue ($65.99 a month). Sling also lets you subscribe to HBO Max as a Blue-tier add-on for a discount (totaling $57.97 per month), or you can sign up for an ad-free subscription to HBO Max as a standalone service for $16.99 a month. \nSling Select includes access to just 11 channels — including Fox News, NFL Network, National Geographic, and Vice — while select markets also get access to Fox, ABC, and NBC. You can add additional channels, if desired, but you’ll have to pay extra. Sling Orange, meanwhile, is best for sports fans since it includes ESPN channels — but only on one device. Sling Blue, on the other hand, offers a number of channels Sling Orange lacks, including Fox News, MSNBC, E!, Discovery, Bravo, and local NBC or Fox affiliates. You can also subscribe to a bundle that includes both Sling Orange and Sling Blue, which offers all the channels featured in the first two plans.\nRight now, you can save money by signing up for Sling’s new Season Pass, which grants you five months of access to Sling Orange or Sling Blue for $199 ($31 off). Alternatively, you can opt for five months of both packages for $274, which saves you $56 over the course of five months. If you just want temporary access to Sling Orange so you can watch a sports game, Sling also recently introduced Flexible Passes, which include a Day Pass ($4.99), a Weekend Pass ($9.99), and a Week Pass ($14.99). Finally, Sling also offers a Premium Pass, which provides new Sling subscribers access to Paramount Plus with Showtime, Starz, MGM Plus, and AMC Plus.\nThe best Apple TV Plus deals\nApple TV Plus\nApple’s streaming service has a variety of original programming, including live MLB games and standouts like Severance, Ted Lasso, Silo, and Coda. A subscription normally runs $12.99 per month with a seven-day free trial.\n\nWhere to Buy:\n\n $12.99 at Apple \n\nApple TV Plus is a service operated by Apple that offers original shows and movies in 4K HDR, including Ted Lasso, The Studio, The Morning Show, Silo, Severance, Finch, Coda, For All Mankind, and Napoleon. The platform is also the streaming home to Major League Soccer, and currently costs $12.99 a month. There are no ads whatsoever on Apple TV Plus, except for some skippable pre-roll advertisements for other Apple TV Plus content.\nThere are a couple of promos to make note of when it comes to Apple TV Plus. The service currently offers a weeklong free trial for new subscribers, after which you’ll be charged $12.99 a month. You can also get a free three-month subscription when you buy an Apple device, though you’ll have to redeem the offer within 90 days of purchase.\nApple TV Plus is also included in the larger Apple One suite of apps. The all-in-one service lets you bundle four other Apple services for a single monthly subscription starting at $19.95 a month. New subscribers will get a free month of Apple TV Plus if they include it as part of their Apple One membership. In addition, eligible individuals who sign up for the student Apple Music subscription, which starts at $5.99 per month, can get Apple Music for 50 percent off with a free Apple TV Plus subscription.\nAs far as carrier deals go, T-Mobile offers discounts on Apple TV Plus, as well as other streaming services. For instance, the wireless carrier is currently offering customers in the US complimentary access to Apple TV Plus when they subscribe to a qualifying Go5G Next line. For Verizon Unlimited customers, the option exists to get Apple One (which includes Apple TV Plus) for $10 per month (about $10 off) for an individual plan, or $20 for a family plan (about $6 off).\nThe best HBO Max deals\nMax \nHBO Max provides access to shows like Furiosa: A Mad Max Saga, Dune: Prophecy, The Last of Us, The Penguin  — as well as films like Barbie and Dune — starting at $9.99 a month. AT&T offers complimentary access to the ad-free tier when you subscribe to a select AT&T Unlimited Choice or Plus plan, which starts at $60 per month.\n\nWhere to Buy:\n\n $9.99 at HBO Max (monthly, with ads)\n $99.99 at HBO Max (annual, with ads)\n $169.99 at HBO Max (annual, ad-free)\n\nHBO Max is home to Game of Thrones and its spinoff, House of the Dragon, along with shows and movies like Furiosa: A Mad Max Saga, Dune: Prophecy, The Last of Us, Wonka, Euphoria, Sinners, Mountainhead, Righteous Gemstones, Hacks, Scavenger’s Reign, The Batman, Succession, and even content from Discovery Plus.\nThe platform offers an ad-supported tier that costs $9.99 a month and two ad-free plans that start at $16.99 a month. Unlike the ad-supported plan, the standard ad-free tier also lets you download 30 shows or movies for offline viewing. HBO Max also offers a $20.99-a-month Premium plan, which allows you to stream in 4K and supports Dolby Atmos with select content. The latter plan also lets you stream on four devices simultaneously and download a maximum of 100 shows or movies to watch on the go.\nHBO Max offers an annual subscription and various bundles, both of which are cheaper than subscribing on a monthly basis. The ad-supported plan normally costs $99.99 a year, saving you a modest $19 over the course of 12 months, while subscribing to the annual ad-free base plan for $169.99 saves you $33. You can also save about $41 by subscribing to the annual 4K Premium ad-free plan for $209.99. Lastly, you can opt for the ad-supported bundle — which includes HBO Max, Disney Plus, and Hulu — for $16.99 a month, or pay $13 extra to go ad-free. The total cost is cheaper than subscribing to each of the three individually, saving you money in the long run. A basic plan exists, with ads, for $9.99 per month.\nMultiple wireless carriers are offering deals. You can, for instance, get a year of Netflix and HBO Max when you purchase a 5G Home Plus, LTE Home Plus, Fios 1 Gig, or the Fios 2 Gig Verizon Home Internet (VHI) plan. Alternatively, Verizon is offering those with an Unlimited plan the ability to get Netflix and HBO Max (with ads) for $10 a month (about $7 off). \nAT&T also includes complimentary access to ad-free HBO Max when you subscribe to select AT&T Unlimited Choice or Plus plans, which start at $60 a month. If you opt for Cricket’s Unlimited Plus 15GB Mobile Hotspot phone plan, which starts at $60 a month, you’ll also be able to get the ad-supported version of HBO Max for free. Finally, you can get two months of HBO Max free with DirecTV Stream or Satellite TV services.\nThe best Netflix deals\nNetflix (monthly, with ads)\nThe well-known streaming service offers individual subscriptions starting at $7.99 a month as well as more premium tiers that allow for 4K resolution and additional users. T-Mobile is offering the ad-supported plan for free those on qualifying Go5G Next, Go5G Plus, and Magenta Max lines. This deal is also available to those on two or more qualifying Go56 and Magenta lines.\n\nWhere to Buy:\n\n $7.99 at Netflix\n\nA Netflix subscription grants you access to thousands of movies and TV shows, as well as a limited number of mobile games. Notable shows and movies include Squid Game, Dan Da Dan, Baby Reindeer, K-Pop Demon Hunters, The Witcher: Sirens of the Deep, Cobra Kai, Stranger Things, The Killer, and Arcane, among countless others.\nThe well-known streaming service currently offers three plans: Standard with ads ($7.99 per month), Standard without ads ($17.99 per month), and Premium ($24.99 per month). The premium tier allows for higher resolution, lets multiple users watch content on four devices at the same time as opposed to just two, and lets you download on six devices at a time as opposed to just two. It’s also the only plan that supports 4K HDR content, as well as spatial audio.\nNetflix isn’t currently offering a discount, but T-Mobile is offering the ad-supported plan for free to those on qualifying Go5G Next and Go5G Plus lines. This deal is also available to those on qualifying Magenta Max lines or those who sign up for two or more Go56 and Magenta lines. As mentioned previously, you can also get a year of both Netflix and HBO Max when you purchase one of the following Verizon Home internet plans: a 5G Home Plus, LTE Home Plus, Fios 1 Gig, or the Fios 2 Gig Verizon Home Internet (VHI) plan. Alternatively, Verizon is offering those with an Unlimited plan the ability to get Netflix and HBO Max (with ads) for $10 per month (about $7 off). \nThe best YouTube TV deals\nYouTube TV (monthly)\nYouTube TV offers access to more than 100 major channels covering live sports, news, entertainment, and more. It also includes unlimited recording for up to six accounts. Now through August 31st, new subscribers can pay $49.99 ($33 off) a month for the first three months when they sign up for the YouTube TV Base Plan.\n\nWhere to Buy:\n\n $82.99 $49.99 at YouTube\n\nYouTube TV grants subscribers access to live sports and a number of major news and entertainment channels, including PBS, Comedy Central, Nickelodeon, NBC, ABC, Fox, CNN, and more. It also comes with unlimited recording for a maximum of six accounts, all for $82.99 per month. You can buy optional add-ons as well, which range between $2 and $65 a month and include access to services like HBO Max, Starz, and NBA League Pass. The service also offers a separate Spanish-only plan.\nNow through August 31st, new subscribers can sign up for the YouTube TV Base Plan for $49.99 ($33 off) a month for the first three months. It’ll be free for 21 days as a trial.\nThe best Paramount Plus and Showtime deals\nParamount Plus Essential (monthly)\nThe ad-supported Paramount Plus Essential plan provides access to a wide variety of shows and films. Walmart Plus members can currently get it for free as a part of their plan.\n\nWhere to Buy:\n\n $7.99 at Paramount Plus\n\nParamount Plus and Showtime provides access to live sports and 24/7 live news with CBS News. It also grants access to the entire Paramount Plus catalog, including shows like Tales of the Teenage Mutant Ninja Turtles and Yellowstone spinoff 1923, as well as films like Gladiator II and Top Gun: Maverick. You’ll also get access to Showtime’s library, which includes originals like Billions, Dexter: Resurrection, and Yellowjackets, as well as movies like Talk To Me and Past Lives.\nIf you want to subscribe to both Paramount Plus and Showtime, you can sign up for the ad-supported or ad-free Paramount Plus with Showtime package for $12.99 a month. Alternatively, if you’re willing to pay for a year upfront, you can save about $36 compared to paying monthly when you subscribe to the annual plan for $119.99.\nAlternatively, you can subscribe to Paramount Plus as a standalone service when you pay for Paramount Plus’ ad-supported Essential plan, which costs $7.99 per month. The annual plan, meanwhile, costs $59.99 per year, saving you $36 over the course of 12 months if you’re willing to pay upfront. Just bear in mind this plan offers fewer live sporting events than the Paramount Plus with Showtime package, and won’t let you download content for offline viewing.\nIn terms of deals, Walmart Plus subscribers can currently get the Essential plan for free as part of their subscription. College students can also subscribe to the Essential plan for $5.99 ($2 off) a month, while seniors with an AARP membership can get a 10 percent discount on the Essential plan or Paramount Plus with Showtime plan. Lastly, military members can get a 50 percent discount on a year of the Essential or Paramount Plus with Showtime plans.\nThe best Starz deals\nStarz\nWith Starz, you can stream movies like Asteroid City and Jurassic Park, as well as original shows like Outlander. Currently, the platform only offers one ad-free plan, which typically costs $10.99 a month.\n\nWhere to Buy:\n\n $69.99 $29.99 at Starz (annual, prepaid)\n $10.99 $4.99 at Starz (monthly)\n\nWith Starz, you can stream a variety of shows and movies, including John Wick: Chapter 4, M3GAN, and Asteroid City, as well as originals like Outlander and Sweetpea. The platform offers a single ad-free plan for $10.99 per month, which allows you to stream on up to four devices simultaneously and download content for offline viewing. Right now, however, new subscribers can get three months of Starz for $4.99 per month. Alternatively, you can sign up for a one-year plan for $29.99, a savings of $40.\nThe best Amazon Prime Video deals\nAmazon Prime Video (monthly, with ads)\nAmazon Prime members can take advantage of faster delivery as well as an assortment of other benefits. This includes Amazon Prime Video, which encompasses a wide range of movies, some live content, and shows like The Lord of the Rings: The Rings of Power. Customers of Metro By T-Mobile’s unlimited plan can get a free Amazon Prime membership, which provides access to Prime Video for free.\n\nWhere to Buy:\n\n $8.99 at Amazon\n\nAmazon Prime Video is an on-demand streaming service owned by Amazon. Its library includes a range of movies, some live content, and shows like Fallout, The Lord of the Rings: The Rings of Power, The Boys, The Marvelous Mrs. Maisel, and more. Through the service, you can watch certain titles in 4K and take advantage of deals on rentals and purchases not included in the subscription. There’s also an option to add extra channels with Prime Video channels, or go ad-free for an additional $2.99 a month.\nAmazon Prime Video is included with an Amazon Prime membership, though you can sign up for the service without a membership for $8.99 a month with ads or $11.98 without. Right now, customers of Metro By T-Mobile’s unlimited plan can also get a free Amazon Prime membership, which provides access to Prime Video and other benefits, for free.\nUpdate, August 20th: Adjusted relevant pricing details, most notably for Apple TV Plus, which has increased in price. Also added new deals for Sling and mentioned a new ESPN Unlimited bundle deal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2abba537f679faa8adc0de6cda097d75ea1ee0cf",
      "title": "Appeals court throws out Trump's $500m civil fraud penalty ",
      "url": "https://www.bbc.com/news/articles/c5y09q1zgg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T22:28:59.000Z",
      "summary_90w": "",
      "raw": "In its 323-page ruling, the New York judges stated that the fine was excessive, and likely violated the US Constitution.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "94feb02f20418fe114fbdc2acbf2818101acbb92",
      "title": "Microsoft is bringing PC gaming apps and stores to its Xbox app on Windows",
      "url": "https://www.theverge.com/news/763994/microsoft-xbox-app-windows-third-party-stores-apps-utilities",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T22:20:32.000Z",
      "summary_90w": "",
      "raw": "Microsoft has started testing another handheld-friendly addition to its Xbox app, allowing PC gamers to quickly install and launch third-party apps like browsers, gaming utilities, and even rival storefronts. A new “My apps” feature is being tested in the Xbox app for Windows 11, and it looks like another way to avoid having to launch the main Microsoft Store or hunt for downloads online if you’re on a gaming PC.\n“My apps is a new tab within the Xbox PC app’s library that allows players to locate, view, and download third-party applications and most commonly used storefronts,” explains Devin Dhaliwal, a product manager for Xbox experiences. “By consolidating gaming apps in one location, this feature supports the new aggregated gaming library, making it more straightforward to find, download, and launch games from multiple locations.”\nMicrosoft has already been adding Steam, Battle.net, Ubisoft Connect, and other PC games into to a unified library inside its Xbox app, but this my apps view will be useful on a handheld PC where you want to avoid using the Windows desktop interface as much as possible. “My apps enables players on an ROG Xbox Ally or other Windows 11 handhelds to more easily navigate between applications from the Xbox full screen experience,” says Dhaliwal.\nI’ve briefly tested the My apps view today and it lists Battle.net, Chrome, and GOG Galaxy. I have Chrome and Battle.net installed, so it simply launches these apps, but with GOG Galaxy it tries to download and install the app all within the Xbox UI. I say try because it failed to install during my testing, but this is a beta so there are bound to be bugs.\nMicrosoft is testing this with a “tailored selection of apps” right now, and plans to expand support for additional apps over time. It’s an interesting move, particularly given Microsoft’s work on merging the best bits of Windows and Xbox together for the Xbox Ally handheld gaming PCs. Microsoft said last year that it wanted to make the Xbox app the home of PC gaming, and it’s sure trying to make that a reality.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90c01b64500f2a39e171e36fc3f33564e75c3508",
      "title": "Anduril, Blue Origin to study how to transport cargo from orbit to Earth for the Pentagon",
      "url": "https://techcrunch.com/2025/08/21/anduril-blue-origin-to-study-how-to-transport-cargo-from-orbit-to-earth-for-the-pentagon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T22:11:37.000Z",
      "summary_90w": "",
      "raw": "Blue Origin and Anduril notched small contracts that could revolutionize how the Pentagon transports cargo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d419fd4a38f9a4a92cf3111c0038586a0487cee4",
      "title": "The 95-year-old POW who wants to return to North Korea to die",
      "url": "https://www.bbc.com/news/articles/c1jnk1dr5pgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T22:04:55.000Z",
      "summary_90w": "",
      "raw": "Ahn Hak-sop failed in his attempt to cross the border, after spending most of his life in South Korea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63de6ea78b3f780ddcacbd77307b8e4df2b28d51",
      "title": "Supreme Court allows NIH to stop making nearly $800M in research grants for now",
      "url": "https://www.npr.org/2025/08/21/g-s1-84441/supreme-court-nih-grants",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T21:41:09.000Z",
      "summary_90w": "",
      "raw": "But the court, in its emergency-docket order, left in place by a 5-4 order a lower court ruling that threw out National Institutes of Health memos that enforced the administration's policies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d91eb0d2c8c1f10b3054fd713313c169e7d8128",
      "title": "Longtime Bungie head Pete Parsons steps down",
      "url": "https://www.theverge.com/news/763895/bungie-ceo-pete-parsons-steps-down-destiny",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T21:05:36.000Z",
      "summary_90w": "",
      "raw": "Bungie CEO Pete Parsons has announced that he’s leaving the company one decade after taking on the role. In an update on Thursday, Parsons wrote that he has “decided to pass the torch” to longtime Bungie developer Justin Truman.\nParsons has worked at Bungie for over 20 years and led the studio through the launch of Destiny 2 in 2017, along with the release of its major expansion pack, The Final Shape.\nIn 2022, Sony Interactive Entertainment purchased Bungie for $3.6 billion. The studio has since contended with the layoffs of hundreds of workers and delayed its extraction shooter Marathon following lackluster alpha test feedback. In May, an artist accused Bungie of using their work in Marathon without permission.\n“We’ve been through so much together: we launched a bold new chapter for Destiny, built an enviable, independent live ops organization capable of creating and publishing its own games, and joined the incredible family at Sony Interactive Entertainment,” Parsons writes.\nTruman joined Bungie in 2010 and became chief development officer in 2022. He says the team is “currently heads down” on both Marathon and Destiny, adding that “we’ll have more to show you in both of these worlds later this year.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9334850b249c6ada78ac597a42126661fad0a7b7",
      "title": "Microsoft&#8217;s new NFL deal could let you blame Copilot AI for terrible playcalls",
      "url": "https://www.theverge.com/news/763928/nfl-microsoft-copilot-surface-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T20:59:31.000Z",
      "summary_90w": "",
      "raw": "The NFL and Microsoft have extended their arrangement that makes Surface tablets a familiar fixture on gameday sidelines, but naturally, now there’s an AI-powered twist on top. \nWhile Tom Brady is no longer actively putting those slates in danger of destruction, they do have something to offer to coaches and players. Microsoft touts a GitHub Copilot-based feature that filters plays to make strategy calls based on the situation, and a Microsoft 365 Copilot-based dashboard that sorts spreadsheets for analysts in the booth to filter through game data quickly.\nAlong with their multiyear contract extension, Microsoft and the NFL announced that the Sideline Viewing System for every team is now connecting to more than 2,500 Surface Copilot Plus PCs (complete with massive “Copilot” logos on the case carrying strap).\nI figure we’ll be able to tell if AI is having an impact on the NFL when someone asks a coach about their prompts after a playoff game, as long as there aren’t any more network issues to blame.\nThe two claim that “analyzing draft prospect performance outside the NFL Combine, providing data-driven business and football operations insights to clubs, and driving productivity across all business functions, including finance, human resources, and events” will be next up for AI applications.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8366b52649516d16a5025475aa5c13e0f20ef6",
      "title": "Vance touts tax cuts, Trump's domestic agenda in Georgia",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509924/vance-one-big-beautiful-bill-georgia",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T20:58:55.000Z",
      "summary_90w": "",
      "raw": "The vice president spoke about the administration's domestic agenda enacted in a sweeping bill last month that will shift resources from social safety programs to immigration enforcement and tax cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "162b0de56c793447c543bb3275849e41ae063c29",
      "title": "As India bans real-money games, Dream Sports, MPL start pulling the plug",
      "url": "https://techcrunch.com/2025/08/21/as-india-bans-real-money-games-dream-sports-mpl-start-pulling-the-plug/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T20:56:57.000Z",
      "summary_90w": "",
      "raw": "Several Indian startups, including Dream Sports, MPL, and Zupee, are shutting down their real-money games after parliament passed a bill banning such games.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "93f8f6cb77733d6fce02a77d53bd44da8702132a",
      "title": "Israel says it will start talks to free all hostages as cabinet approves Gaza City assault",
      "url": "https://www.bbc.com/news/articles/c754kknw2g2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T20:41:53.000Z",
      "summary_90w": "",
      "raw": "Earlier this week, a Hamas source said the armed group had agreed to a temporary ceasefire proposal from mediators.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3cdada313639f66f0a7da9d637d19b24938213d",
      "title": "Hamas has one top strategy: End the war and survive",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5507998/hamas-gaza-war-strategy-israel",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T20:06:04.000Z",
      "summary_90w": "",
      "raw": "Hamas has endorsed a new proposal for a ceasefire deal with Israel in Gaza, as it faces pressure from Arab countries and seeks to ensure its own survival.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d35176ac7be0a3646a78528f461db5cea32a0413",
      "title": "Ecosia has offered to take ‘stewardship’ of Chrome. And it’s not a bad idea.",
      "url": "https://techcrunch.com/2025/08/21/ecosia-has-offered-to-take-stewardship-of-chrome-and-its-not-a-bad-idea/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T20:02:47.000Z",
      "summary_90w": "",
      "raw": "Berlin-based nonprofit search engine Ecosia has asked a U.S. judge to turn Chrome into a foundation it controls, funding billions in climate projects.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a6a3cf6e01fa64cd4abf60e91c791d60a772152c",
      "title": "Texas and California near new partisan voting maps in a battle prompted by Trump",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5496659/texas-congressional-redistricting-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T19:57:43.000Z",
      "summary_90w": "",
      "raw": "California and Texas, the country's two most populous states, are getting closer to redrawing their congressional districts in a political fight sparked by President Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3b5397a92eb6b3a6eeb9c089d4b275d72eef3cb",
      "title": "Gas power plants approved for Meta’s $10B data center, and not everyone is happy",
      "url": "https://techcrunch.com/2025/08/21/gas-power-plants-approved-for-metas-10b-data-center-and-not-everyone-is-happy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T19:52:20.000Z",
      "summary_90w": "",
      "raw": "Meta's massive data center will draw power from three gas-fired power plants producing 2.25 gigawatts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e18f613011239ba522ea0b2aa769c1063b72b5a1",
      "title": "Trump delivers pizza to National Guard working on his DC crackdown",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509910/trump-patrol-washington-dc-national-guard",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T19:47:55.000Z",
      "summary_90w": "",
      "raw": "President Trump thanked National Guard soldiers and police officers involved in his crackdown on what he has described as rampant crime in Washington, D.C.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8be2df1819a14457e5154257c1a90924483dd8bf",
      "title": "Google reveals it isn&#8217;t making tablets, smart rings, flip phones, or glasses (yet)",
      "url": "https://www.theverge.com/news/763778/google-canceled-tablet-no-smart-ring-or-flip-phone-glasses",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T19:40:44.000Z",
      "summary_90w": "",
      "raw": "Photo by Max Braun (Wikimedia Commons)\t\n\nGoogle’s new Pixel 10 and Pixel 10 Pro Fold and Pixel Watch 4 may compete with Samsung, but it’s happy to let Samsung explore other parts of the Galaxy on its own. In interviews with Bloomberg, Google just revealed a lot of devices it isn’t currently working on. Here’s Bloomberg:\nDespite its partners Samsung and Motorola getting into flip-style phones where the screens opens up vertically like an old school Motorola Razr, Google says it intends to sit out that race. It’s also not currently working on a smart ring and has paused development on a tablet overhaul until it figures out a meaningful future for the category, executives said.\nPretty sure that’s the first true confirmation that the Pixel Tablet 2 was canceled! Remember when Google was done with tablets in 2019?\nAnd though Google has repeatedly teased its own prototype glasses and even let us try them on, it appears that Google devices boss Rick Osterloh isn’t sure it’ll actually manufacture any glasses for sale: \nOsterloh says it’s still “TBD” whether Google itself will release glasses again, but he’s intent on the category being part of the company’s future.\nTo be fair, Google has almost always shown off those glasses prototypes alongside the XR headsets it’s co-developing with Samsung, and — like Meta — it seems more interested in making Android XR a platform for other glasses partners too. \nIf Google were to release glasses again, though, Bloomberg did get one interesting hint about how they might work. Osterloh and his deputy Shakil Barkat suggested in the interview that display-free glasses might pair nicely with a smaller phone, one that could unfold for your entertainment needs as well. But, again, it sounds like Google wants to “sit out” Razr-style folding flip phones for now.  \nGoogle would hesitate before announcing glasses, I bet, because of its infamous fails with the original Google Glass. We ranked it near the very top of the list in our 84 biggest flops of the past decade in tech, though I imagine a modern version would get a less frosty reception in the post Meta Ray-Ban world.\nLastly, if you’re curious when Pixel phone design might change again, perhaps away from big camera bumps, design chief Ivy Ross told Bloomberg that the company tries on new design languages “every two to three years.” That means it’s due.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d05a651266e1de84da405c6574632a3cf020af4",
      "title": "Elon Musk’s X may finally settle $500M severance lawsuit",
      "url": "https://techcrunch.com/2025/08/21/elon-musks-x-may-finally-settle-500m-severance-lawsuit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T19:25:22.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's X is settling a severance lawsuit with former Twitter employees.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "139f7d9bfbeb0e4e98c3fa98917f5e9a0384933a",
      "title": "Game of Thrones star Kristian Nairn withdraws from Strictly due to stress-related illness",
      "url": "https://www.bbc.com/news/articles/c74d71j4433o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T19:18:28.000Z",
      "summary_90w": "",
      "raw": "Emmerdale's Lewis Cope has been announced as Nairn's replacement on Strictly Come Dancing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c8f6b805d5c00eadaa4cf80c690a3793a35571a",
      "title": "Why I love my Le Creuset sauté pan",
      "url": "https://www.theverge.com/tech/763409/le-creuset-saute-pan-favorites",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T19:00:00.000Z",
      "summary_90w": "",
      "raw": "Jennifer Pattison Tuohy is a senior reviewer at The Verge covering the smart home, Internet of Things, and, as she puts it, “as many kitchen gadgets as I can get my hands on.” In her four years here, she’s tested everything from smart locks, lights, and doorbells to robot vacuums (some with arms), robot lawnmowers, and an actual home robot. But, she says, “the heart of my home is my kitchen, and I love a good smart kitchen gadget. I’ve tested a smart trash can, smart mixer, smart pizza oven, smart ice maker, and yes, even a smart fridge. But none of these could ever replace my favorite kitchen gadget — my Le Creuset sauté pan.”   \nWhen did you get your Le Creuset pan?\nMy Le Creuset pan was a wedding gift. I’m about to celebrate my 20th wedding anniversary, so it’s been around a while! \nIts official name is Le Creuset Signature Enameled Cast Iron Deep Saute Pan, 4 1/4-Qt., and you can only get it at Williams Sonoma, which I discovered when I tried to buy one as a wedding gift for my brother-in-law. I did buy it for them, and I also got one for my sister-in-law as her wedding gift a few years later! Thankfully, I am now out of in-laws to buy them for. They’re not cheap.\nWhat do you use it for?\nI use it almost every time I cook a meal. It’s hands down the best, most versatile pan I’ve ever owned. Some of my favorite dishes to cook in it are frittatas, stews, and bolognese sauce (it can simmer in the oven with the lid on at 200 degrees for 8 hours). \nI also use it for searing meats like chicken thighs and pork cops. It’s also great for fish, and I love to make Yorkshire puddings, Dutch baby pancakes, and even the occasional pizza in it.\nWhat do you like about it?\nI love that it’s big enough to cook a beef stew or a whole batch of soup, while also easy to just scramble eggs in. I also love that it has a handle and a lid and that everything can go in the oven — up to 500 degrees! And it all goes in the dishwasher — though I generally hand-wash it, as it takes up an entire rack.\nLe Creuset cookware is known for its enameled cast-iron, which has amazing heat distribution, so it’s my go-to for any searing, browning, or sauteing. The best thing is how much surface area it has, which makes browning meats easy to do in one batch.\nPlus, its super deep sides mean I can cook a one-pot meal in it without things flying out the sides when I’m stirring. It’s perfect for all-in-one dishes like pork stroganoff, risotto, my favorite Mexican beef-’n’-rice dish, and any combination of protein, sauté-able veggies, and a nice pan sauce, like this Creamy Tuscan Chicken dish I make regularly.\nIs there anything you don’t like about it, or that you’d improve if you could?\nOther than the price, the only downside is its weight. At 13 pounds, it weighs almost as much as a 6-month-old baby, so it’s almost always a two-hander. My grandmother was a professional cook, and she swore by Le Creuset pans. But as she got older, she complained that she couldn’t use them anymore, as they were too heavy.\nI also have not been a model Le Creuset owner; the enamel inside is far from pristine, but I still use it all the time and don’t see any need to replace it.\nAs someone who reviews the latest tech gadgets — many of which, in the best-case scenario, have a 10-year lifespan — pulling out a 20-year-old pan each night to cook dinner gives me a nice feeling of permanence and tradition.\nLe Creuset Signature Enameled Cast Iron Deep Sauté Pan\n\nWhere to Buy:\n\n $368 at Williams Sonoma",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b336670a975129ffd56fe66f37d227b67af45476",
      "title": "StrictlyVC at TechCrunch Disrupt 2025: Inside the LP Track",
      "url": "https://techcrunch.com/2025/08/21/strictlyvc-at-techcrunch-disrupt-2025-inside-the-lp-track/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T18:33:39.000Z",
      "summary_90w": "",
      "raw": "In an era of extended exit timelines, slowed distributions, and increasingly selective LPs, the conversations behind closed doors matter more than ever.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b656f6b075e83af7feb2ce5978ba62a5ad897cc4",
      "title": "Struggling fusion power company General Fusion gets $22M lifeline from investors",
      "url": "https://techcrunch.com/2025/08/21/struggling-fusion-power-company-general-fusion-gets-22m-lifeline-from-investors/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T18:12:29.000Z",
      "summary_90w": "",
      "raw": "General Fusion pleaded for new funding in May after it laid off 25% of its staff. The new round buys it precious months to pursue its scientific milestones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a34303f579ebe6a6d5961f3a399a7f06fc17c0e2",
      "title": "UN and Red Cross warn of catastrophe if Israel launches Gaza City offensive",
      "url": "https://www.theguardian.com/world/2025/aug/21/gaza-city-offensive-would-be-death-sentence-for-israeli-hostages-say-relatives",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T18:10:39.000Z",
      "summary_90w": "",
      "raw": "Netanyahu tells soldiers he has approved takeover plan as aid groups advised to prepare for forced displacement\nThe International Red Cross and UN have warned of an impending catastrophe in the Gaza Strip if Israel launches an offensive to take over Gaza City, as the Israeli military told medical and aid groups in the Palestinian territory to prepare for imminent forced displacement.\nAt the same time a concerted campaign of international opposition to Israel’s defiance of ceasefire calls and its approval of a huge new illegal settlement construction in the occupied West Bank gathered pace, with the UK summoning Israel’s ambassador and joining 20 other countries in condemning the settlement plan as a “violation of international law”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c90c00a87a2a81b4ccf0d51b2970214a9858f29f",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/21/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T18:03:46.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "57451ad46b46c3049e96230af0778eb34d938fdf",
      "title": "Artificial light has essentially lengthened birds' day",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5507165/light-pollution-bird-day-hour-longer",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Millions of audio recordings of hundreds of bird species have revealed that artificial light is making the birds wake up earlier and go to bed later.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d13306c5d441aa5cae0058620bc7e756496fcac",
      "title": "Has Israel begun its Gaza City offensive or will there be yet more ‘approvals’?",
      "url": "https://www.theguardian.com/world/2025/aug/21/has-israel-begun-gaza-city-offensive",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T17:58:30.000Z",
      "summary_90w": "",
      "raw": "Netanyahu is latest to ‘approve’ plan that has had daily announcements and that Israel knows will have serious consequences\nHas Israel begun its expanded offensive in Gaza City, or is it hype?\nAfter several weeks of threats of a new large-scale offensive, strongly opposed by most of the international community, Israeli officials have made announcements daily saying the plan to occupy Gaza City has been “approved”; it has been approved by the Israel Defense Forces, by the security cabinet, by the defence minister.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "528308005ee4ed8c3fc4ef2b0e5ab9ed1ce34d3e",
      "title": "Microsoft AI chief says it’s ‘dangerous’ to study AI consciousness",
      "url": "https://techcrunch.com/2025/08/21/microsoft-ai-chief-says-its-dangerous-to-study-ai-consciousness/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T17:52:53.000Z",
      "summary_90w": "",
      "raw": "As AI chatbots surge in popularity, Mustafa Suleyman argues that it's dangerous to consider how these systems could be conscious.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5169518a0242e42575b4765e4e58c5bc81806fe",
      "title": "David Lammy among 21 foreign ministers to condemn plan for illegal West Bank settlement",
      "url": "https://www.theguardian.com/world/2025/aug/21/david-lammy-among-21-foreign-ministers-to-condemn-plan-for-west-bank-settlement",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T17:46:12.000Z",
      "summary_90w": "",
      "raw": "Israeli ambassador to UK summoned as joint statement says move will fuel further violence and break international law\nDavid Lammy has joined 20 other foreign ministers around the world in condemning Israeli plans to build an illegal settlement on the West Bank, with the Foreign Office summoning the Israeli ambassador to communicate the government’s displeasure.\nThe foreign secretary co-signed a joint statement on Thursday criticising the so-called E1 plan, a 3,400-home settlement that critics say would divide the West Bank in half.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "188482650429022b27cff6ea73465768f9f9c2ba",
      "title": "Russia orders state-backed Max messenger app to be pre-installed on new phones",
      "url": "https://www.theguardian.com/technology/2025/aug/21/russia-max-app-phones",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T17:38:29.000Z",
      "summary_90w": "",
      "raw": "Critics say Max, a WhatsApp rival, could be used to track users, though state media says it is not a spying app\nA Russian state-backed messenger application called Max, a rival to WhatsApp that critics say could be used to track users, must be pre-installed on all mobile phones and tablets bought in the country starting next month, the Russian government said on Thursday.\nThe decision to promote Max comes as Moscow, locked in a standoff with the west over Ukraine, is seeking greater control over the internet. The Kremlin said in a statement that Max, which will be integrated with government services, would be on a list of mandatory pre-installed apps on all “gadgets”, including mobile phones and tablets, sold in Russia from 1 September. The firm behind Max said this week that 18 million users had downloaded its app, parts of which are still in a testing phase.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c66d352c2505ace2024ca02b372cbbf7c50deed",
      "title": "2025 is turning into a good year for long-awaited games",
      "url": "https://www.theverge.com/games/763698/delayed-games-silksong-metroid-prime-4-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T17:30:00.000Z",
      "summary_90w": "",
      "raw": "It actually happened: Silksong, the standalone sequel to Hollow Knight, has a release date. After seven years in development, and almost as many shrouded in silence, the game is coming out on September 4th. It's welcome news for the millions of Hollow Knight fans who have been impatiently waiting. But it's also part of a welcome trend: 2025 is shaping up to be the year that several long-in-development games finally see the light of day.\nJoining Silksong later this year will be Metroid Prime 4: Beyond. While it doesn't have a specific release date, the shooter is part of Nintendo's steady stream of releases for the first year of the Switch 2 …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "937ae5ceff97d70b4b06439ca65217a985ae1ffe",
      "title": "Record numbers of GCSE results were resits - are we in a 'resit crisis'?",
      "url": "https://www.bbc.com/news/articles/cpdj5y98302o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:29:19.000Z",
      "summary_90w": "",
      "raw": "With pupils resitting Maths and English GCSEs at an all-time high, and fewer than a fifth of those passing, is the system broken?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e36eaa894d587d79f948705831112c742adba1a",
      "title": "With Fed under pressure, Jerome Powell prepares for a high-stakes speech",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509586/federal-reserve-jerome-powell-jackson-hole-speech",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T17:27:32.000Z",
      "summary_90w": "",
      "raw": "The Fed chair will speak Friday at an annual economic symposium in Jackson Hole, Wyo.  The speech comes as the central bank is under mounting pressure from the White House to lower interest rates.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b4d248d9420dfa1417aec6b04b6203d196f1dcd",
      "title": "UK's third-largest steelworks collapses into government control",
      "url": "https://www.bbc.com/news/articles/cy0818y4jdlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:25:27.000Z",
      "summary_90w": "",
      "raw": "Hundreds of Liberty Steel workers in Rotherham and Sheffield face an uncertain future.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d067f687b2d0bddd1fb68ef5f8fc5ff139a3ef4",
      "title": "How Google’s new Pixel 10 compares to the last-gen Pixel 9",
      "url": "https://www.theverge.com/tech/763600/google-pixel-9-vs-10-comparison-specs-price-features",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T17:13:45.000Z",
      "summary_90w": "",
      "raw": "Google on Wednesday introduced its new Pixel 10 lineup during an event in New York - complete with a very strange keynote. In case you missed it, there are a lot of similarities across the latest Pixel models - and some key additions - including the MagSafe-style Pixelsnap, Google's new Tensor G5 chip, and a proactive AI feature known as Magic Cue.\nWhile Google's Pro models come loaded with the most advanced tech, the base Pixel 10 looks like the sleeper hit. Starting at $799, it's the most affordable of the bunch, and for the first time, it adds a telephoto lens to the standard Pixel. For anyone weighing an upgrade, the real question is ho …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dc8d00b02efa9eb89d7548ae455ba27a23e09f1e",
      "title": "Microsoft’s Xbox handheld is a good first step toward a Windows gaming OS",
      "url": "https://www.theverge.com/notepad-microsoft-newsletter/763357/microsoft-asus-xbox-ally-handheld-hands-on-notepad",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-21T17:00:00.000Z",
      "summary_90w": "",
      "raw": "The first thing I did when I got my hands on the Xbox Ally was reboot it. I wanted to see exactly how Microsoft manages to hide Windows beneath the Xbox interface that's debuting on these handheld devices.\nAfter a short startup, I was met with the standard Windows login prompt. But I could use the controller to input the PIN code, an immediate improvement over what's available right now. And as soon as Windows 11 loaded up, the interface immediately disappeared. The Xbox PC app took over and went full-screen - and for the most part, I didn't have to leave.\nI've spent enough time with Microsoft and Asus' Xbox Ally devices this week to get a …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db38ac044426fbeb4e8756a6713ac60a809e2ea3",
      "title": "Councillor's wife jailed for race hate social media post released from prison",
      "url": "https://www.bbc.com/news/articles/c5yl7p4l11po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T16:57:17.000Z",
      "summary_90w": "",
      "raw": "Lucy Connolly is released from HMP Peterborough after receiving a 31-month sentence in October.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19f6c3e0f993142a1a2acfacc069fcc791428f65",
      "title": "Millie Bobby Brown and husband Jake Bongiovi adopt a baby girl",
      "url": "https://www.bbc.com/news/articles/c8ry4m80mn7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T16:53:06.000Z",
      "summary_90w": "",
      "raw": "The Stranger Things star and Jake Bongiovi say they are \"beyond excited to embark on this beautiful next chapter\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7e6d3aa3ff7fda455e6c60aef4da19d0c271029",
      "title": "An appeals court throws out a massive civil fraud penalty against President Trump",
      "url": "https://www.npr.org/2025/08/21/g-s1-84246/civil-fraud-penalty-president-trump-appeal",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T16:52:34.000Z",
      "summary_90w": "",
      "raw": "Trump, in a social media post, claimed \"total victory\" after the ruling, which spares him from a potential half-billion-dollar fine for decades of exaggerating his wealth.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea63df2de981d20e3c8b6fb8128273f23c05d92a",
      "title": "Is the government meeting its pledges on illegal immigration and asylum?",
      "url": "https://www.bbc.com/news/articles/c9dqqj0v1ndo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T16:48:13.000Z",
      "summary_90w": "",
      "raw": "BBC Verify examines key areas which the government has promised to make improvements",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7039e9228cf5bee0b2309fd7135f9a0da82a37cd",
      "title": "If a Putin-Zelensky summit takes place, where could it be?",
      "url": "https://www.bbc.com/news/articles/cedvexq7z8zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T16:45:29.000Z",
      "summary_90w": "",
      "raw": "Geneva, Istanbul and Budapest have been put forward as potential locations - but bilateral talks still remain a long way off.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfdc6b2f6e77eecbe704dd1729b16b5024cc983f",
      "title": "Hurricane Erin brings flooding to parts of Outer Banks as it pivots from East Coast",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509661/hurricane-erin-outer-banks-north-carolina-east-coast",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-21T16:28:57.000Z",
      "summary_90w": "",
      "raw": "The storm flooded parts of North Carolina's Outer Banks, including a section of the main highway. Another round of overwash was happening during the evening's high tide.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b39006bbe38b143868f4a34d265145354b1d727",
      "title": "Do asylum figures show if government's strategy is working?",
      "url": "https://www.bbc.com/news/articles/cx2x371g2k8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T16:21:27.000Z",
      "summary_90w": "",
      "raw": "Two BBC correspondents assess what the Home Office's new data tells us about the efficacy of the government's asylum strategy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc758fb896050d2c6aecef0f3f23e33be13a587c",
      "title": "Remnants of 2,000-year-old sunken city lifted out of the sea off Alexandria",
      "url": "https://www.theguardian.com/world/2025/aug/21/egypt-retrieves-parts-of-2000-year-old-sunken-city-canopus-off-coast-of-alexandria",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T16:18:58.000Z",
      "summary_90w": "",
      "raw": "Cranes hoisted statues from depths of submerged site that authorities say may be extension of ancient city of Canopus \nEgypt has unveiled parts of a sunken city submerged beneath waters off the coast of Alexandria, including buildings, artefacts and an ancient dock that date back more than 2,000 years.\nEgyptian authorities said the site, located in the waters of Abu Qir bay, may be an extension of the ancient city of Canopus, a prominent centre during the Ptolemaic dynasty, which ruled Egypt for nearly 300 years, and the Roman empire, which governed for about 600 years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99f8ab128c48752e7f9cb8a2ab113810f01049de",
      "title": "German contest to live in depopulated Soviet-era city proves global hit",
      "url": "https://www.theguardian.com/world/2025/aug/21/german-contest-to-live-in-depopulated-soviet-era-city-proves-global-hit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T16:08:21.000Z",
      "summary_90w": "",
      "raw": "Eisenhüttenstadt offered spacious central flats rent-free for two weeks in effort to attract valuable professionals\nAn innovative contest by a city in formerly communist east Germany to curb depopulation by offering a fortnight of free housing has stunned local officials with its success.\nThe competition drew more than 1,700 applications from around the world to try living in Eisenhüttenstadt, a Soviet-style planned city on the Polish border, near Berlin, which was built around a steel plant in the aftermath of the second world war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "466881bd76f9d945ad65b0ecfeead1a61ee117e5",
      "title": "Apple TV+ price jumps 30% to $12.99 monthly",
      "url": "https://techcrunch.com/2025/08/21/apple-tv-price-jumps-30-to-12-99-monthly/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T16:04:22.000Z",
      "summary_90w": "",
      "raw": "The updated price is effective for new customers starting Thursday and will affect current subscribers 30 days after their next renewal date.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "43d6059b4d2d3c9e95e912727fe68665164d120d",
      "title": "'Slave-like' assistants and late-night massages: How a radical priest abused his congregation",
      "url": "https://www.bbc.com/news/articles/cr4ezy313qwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T16:00:04.000Z",
      "summary_90w": "",
      "raw": "Chris Brain, who led nightclub-style services in the 1980s and 90s, is convicted of indecent assault.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "035f8ec9765a71058819ecf25ce550485a474eef",
      "title": "Instagram now lets creators link multiple reels in a series",
      "url": "https://techcrunch.com/2025/08/21/instagram-now-lets-creators-link-multiple-reels-in-a-series/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Now if a creator is telling a story in a series of videos and follow-ups, they can now link them all together so that viewers don't have to scroll or search for different parts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8aee4cac371739ab66c95bb90ada8fb32a32f230",
      "title": "YouTube Music celebrates 10 years with new features that help it compete with Spotify",
      "url": "https://techcrunch.com/2025/08/21/youtube-music-celebrates-10-years-with-new-features-that-help-it-compete-with-spotify/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T16:00:00.000Z",
      "summary_90w": "",
      "raw": "YouTube Music is rolling out taste match playlists, comments, badges and more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "248204680ea001be97c5daebd21e19aa66cccea8",
      "title": "Five key takeaways from this year's GCSE results",
      "url": "https://www.bbc.com/news/articles/c70x5j8z34do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T15:59:35.000Z",
      "summary_90w": "",
      "raw": "The GCSE pass rate has fallen again this year. Here's what you need to know.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d31ee5b25f04dbe3c8f6614fb910601ea2a36b45",
      "title": "UK backs call for Israel to allow foreign media into Gaza",
      "url": "https://www.bbc.com/news/articles/c05ed10zqj8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T15:55:33.000Z",
      "summary_90w": "",
      "raw": "Governments from 27 countries, including France and Germany, say journalists in Gaza must be protected.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23b8d5e13b3f37f333521af3e6e3f49c2ba6f4aa",
      "title": "Walmart says tariff costs are rising 'each week' and will continue",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5509592/walmart-tariff-costs-rising-earnings",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T15:55:32.000Z",
      "summary_90w": "",
      "raw": "The world's largest retailer — like many others — has been absorbing most of the increased costs, but raising prices of some goods.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4bc6209ed9f1adc50b4cf54763cf3948fc841093",
      "title": "McDonald's Japan postpones toy promo after Pokémon complaints",
      "url": "https://www.bbc.com/news/articles/cwy0j5gjwq3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T15:51:52.000Z",
      "summary_90w": "",
      "raw": "Fast-food giant postpones \"One Piece\" trading card promotion after Pokémon giveaway led to bulk-buying and cards sold online.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c1681a99389fcadc15b5970d903baa1b144a274",
      "title": "Nato leaders must ‘not be naive’ about any potential Ukraine deployment, says head of German soldiers’ union – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/21/us-minimal-security-guarantees-ukraine-russia-diplomacy-europe-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T15:50:28.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed, you can read more on this story here\nWe have just heard from the European Commission, confirming that the EU and the US have now agreed on the much-awaited “joint statement” advancing the political commitments on trade agreed by Ursula von der Leyen and Donald Trump in Scotland last month.\nThe commission’s press release says the statement “lays out in detail the new US tariff regime towards the EU, with a clear maximum, all-inclusive, tariff rate of 15% for the vast majority of EU exports, including strategic sectors such as cars, pharmaceuticals, semiconductors and lumber.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "edb0bf7f9897f0fec851b12780f5d6a18acda70e",
      "title": "Israel keeps up military pressure on Gaza City ahead of planned offensive – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/21/israel-gaza-city-middle-east-palestinians-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T15:39:03.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed, you can read more on this story here\nIran was seeking to reassert an image of strength on Thursday after suffering heavy losses, when Israel largely destroyed Iran’s air defences during the war and much of its stockpile of ballistic weapons is believed to have been damaged by Israeli strikes.\nThe Iranian Defence Ministry said in a statement on Thursday: “Any new adventure by the enemy will be faced with a strong slap.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6cc07d1a7a37d08d05fa48a61b6ae93f6d2706ee",
      "title": "Ghanaian music star Shatta Wale detained over Lamborghini purchase",
      "url": "https://www.bbc.com/news/articles/cq68j92yjd9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T15:37:54.000Z",
      "summary_90w": "",
      "raw": "US authorities have linked Wale's car to an alleged criminal enterprise operating stateside.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "79dea3c70366ff8875f506ec6888ff06fe40f31a",
      "title": "'I regret that I didn't fight harder,' former labor secretary Robert Reich says",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5507068/i-regret-that-i-didnt-fight-harder-former-labor-secretary-robert-reich-says",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T15:30:39.000Z",
      "summary_90w": "",
      "raw": "Reich served under President Clinton from 1993 to 1997. He opens his new memoir, Coming Up Short, with an apology on behalf of the Baby Boom generation for failing to build a more just society.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ad71741895cdd93988b1bfdde1fcbfe290f3b3e9",
      "title": "Tesco increases cost of meal deal as UK food prices continue to rise",
      "url": "https://www.bbc.com/news/articles/clyr7renp51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T14:31:23.000Z",
      "summary_90w": "",
      "raw": "The move by the UK's largest supermarket is the latest example of rising food prices.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7571ab87fd83998490d50825567d17e7746dbe56",
      "title": "Bolsonaro given 48 hours to explain alleged plans to flee to Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/21/bolsonaro-given-48-hours-to-explain-alleged-plans-to-flee-to-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T14:16:57.000Z",
      "summary_90w": "",
      "raw": "Brazilian supreme court judge sets ultimatum after police claim far-right populist sought to flee to avoid punishment over failed coup\nA supreme court judge has given Brazil’s ex-president, Jair Bolsonaro, 48 hours to explain police claims he was planning to flee to Argentina to avoid punishment for allegedly masterminding a failed coup after losing the 2022 election.\nBolsonaro’s trial for the alleged attempt to seize power is scheduled to conclude early next month. The far-right populist faces more than four decades in prison if found guilty.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d883df7075cd6290437c2efa424042c46c4d13c",
      "title": "Raising multiple rounds of venture capital might be wrong for your startup",
      "url": "https://techcrunch.com/2025/08/21/raising-multiple-rounds-of-venture-capital-might-be-wrong-for-your-startup/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T14:00:00.000Z",
      "summary_90w": "",
      "raw": "What if startups raised less VC money and became self-sustaining? SecurityPal founder Pukar Hamal has done that and wants founders to know their options.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ce1706499293ff027bf4e97bb76e47a9417d03d",
      "title": "Google’s AI Mode expands globally, adds new agentic features",
      "url": "https://techcrunch.com/2025/08/21/googles-ai-mode-expands-globally-adds-new-agentic-features/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T13:49:37.000Z",
      "summary_90w": "",
      "raw": "As part of the expansion, Google is bringing AI Mode to 180 new countries in English.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d271e5778b462e8af2db0d8ff6cd0b64ba519fbe",
      "title": "Italian police arrest Ukrainian man over Nord Stream pipelines blast",
      "url": "https://www.theguardian.com/world/2025/aug/21/italian-police-arrest-ukrainian-man-over-nord-stream-pipelines-blast",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T13:33:25.000Z",
      "summary_90w": "",
      "raw": "Serhiy K is believed to have been onboard boat from where 2022 attack on gas pipelines was carried out\nA Ukrainian man alleged to have been involved in the 2022 detonation of the Nord Stream pipelines carrying gas from Russia to Germanyhas been arrested in Italy, according to German authorities.\nThe man, identified only as Serhiy K, is believed to have been onboard the sailing boat from where the attack was allegedly carried out.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5348838958b63f7ff489cac1639e7b9602dd81dd",
      "title": "Three more species of giraffe than previously thought - can you spot the difference?",
      "url": "https://www.bbc.com/news/articles/c2l7wxpxn0eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T13:29:07.000Z",
      "summary_90w": "",
      "raw": "Giraffes have always been thought to be one species, but scientists now say there are four.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d597e54c1b48bf9ed889f0635c7114fbe54df9e2",
      "title": "Report: Meta is hitting pause on AI hiring after its poaching spree",
      "url": "https://techcrunch.com/2025/08/21/report-meta-is-hitting-pause-on-ai-hiring-after-its-poaching-spree/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T13:25:15.000Z",
      "summary_90w": "",
      "raw": "The freeze went into effect last week, and it’s not clear how long it will last, The Journal’s sources say. Meta is still likely working through its reorg, which split its AI unit, Meta Superintelligence Labs, into four new groups: TBD Labs, run by former Scale AI founder Alexandr Wang, and three groups focused on research, product integration, and infrastructure, respectively.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a0f8d5a89ee318d5e282223edacc75557f20ecf2",
      "title": "US to hold high tariffs on European cars until Brussels moves to cut tariffs on US goods",
      "url": "https://www.theguardian.com/us-news/2025/aug/21/tariffs-eu-cars-brussels",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T13:20:40.000Z",
      "summary_90w": "",
      "raw": "Framework deal pledges to cut 27.5% tariff once EU tables legislation, and both sides say they want swift action\nWashington will not lower steep tariffs on European cars until Brussels has introduced legislation to reduce its own tariffs on US exports, maintaining pressure on the EU’s automotive industry.\nWhile the Trump administration has agreed to lower the current 27.5% US tariffs on European cars and car parts to 15%, details of a framework trade deal published on Thursday revealed the terms and conditions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "21c4e648906517fe28453f4d53f73115f734018d",
      "title": "Hackers who exposed North Korean government hacker explain why they did it",
      "url": "https://techcrunch.com/2025/08/21/hackers-who-exposed-north-korean-government-hacker-explain-why-they-did-it/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T12:30:00.000Z",
      "summary_90w": "",
      "raw": "The two self-described hacktivists said they had access to the North Korean spy’s computer for around four months before deciding what they had found should be made public.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5ba63865cf7d7cce396ae6f5df432f42d28ea92d",
      "title": "Nvidia is latest investor to back AV startup Nuro in $203M funding round",
      "url": "https://techcrunch.com/2025/08/21/nvidia-is-latest-investor-to-back-av-startup-nuro-in-203m-funding-round/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-21T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Nuro has attracted more investors, and capital, to push its Series E round to $203 million.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dada350ef6972d72367331671edbcdb44e5d9ae9",
      "title": "Bolsonaro planned to flee to Argentina, Brazil police say",
      "url": "https://www.bbc.com/news/articles/c05ede3j24zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T11:53:26.000Z",
      "summary_90w": "",
      "raw": "Police say they found a letter on the former Brazilian president's phone requesting asylum in Argentina.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef515194d86ecede0d991ef89a7f2b16b99e0576",
      "title": "Russia launches biggest wave of strikes on Ukraine for weeks",
      "url": "https://www.bbc.com/news/articles/c62wj8yje2eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T11:49:28.000Z",
      "summary_90w": "",
      "raw": "Ukrainian officials say the attacks included drones, hypersonic, ballistic, and cruise missiles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb271a83f34be50d10d004b7cb9341828fa1b2a",
      "title": "Ukrainian held in Italy over Nord Stream gas pipelines blast mystery ",
      "url": "https://www.bbc.com/news/articles/crkz1jl5j06o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T11:16:43.000Z",
      "summary_90w": "",
      "raw": "German prosecutors say the man was in a group that planted explosives in the Baltic Sea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fa9e8750644016331894e5881bd1a92a6967c26e",
      "title": "Far fewer Canadians are visiting the U.S. this year, new numbers show",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5508461/fewer-canadians-visiting-us",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-21T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Canadian residents made just 1.7 million return trips by motor vehicle back into their country from the U.S. in July, a nearly 37% decline over the same month in 2024, according to Statistics Canada.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6936b2a9fe69c26167823b153f0b1624e47ba739",
      "title": "Texas approves new electoral map favouring Republicans",
      "url": "https://www.bbc.com/news/articles/cp8z4nj17dno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T09:25:55.000Z",
      "summary_90w": "",
      "raw": "Facing opposition from Democrats who fled the state to stall the vote, Republicans hope the new maps will lead to more seats in Congress.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7044e23050aa2a132a9212d3cef4043c16a12f49",
      "title": "Pope Leo XIV to travel to Lebanon in likely first international trip",
      "url": "https://www.bbc.com/news/articles/cvgplp9kd8do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T09:14:39.000Z",
      "summary_90w": "",
      "raw": "The visit would mark a significant moment for the Pope, who has urged peace in the Middle East.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95d52ad51f13285bba2865e7001e0bf24b6bcbaf",
      "title": "Fast-food giant Jollibee blames fraudsters for raffle row in Philippines",
      "url": "https://www.bbc.com/news/articles/c4gzdk25dr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T07:52:17.000Z",
      "summary_90w": "",
      "raw": "The raffle winners have AI-sounding names like Hobby Dynamics and Noble Beer, social media users say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T04:52:26.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fa390446a5b9545fe6eef15e3f3244a663c267dc",
      "title": "'Bear attack victim' was actually killed by son, Japan police say",
      "url": "https://www.bbc.com/news/articles/c62n5gv72j5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T04:40:31.000Z",
      "summary_90w": "",
      "raw": "A man police believed was killed by a bear had in fact been stabbed to death by his son, they say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f5faa64461899e2ab8c8449aed315d3cdd1c2bf",
      "title": "China's Xi touts unity and development in surprise Tibet visit",
      "url": "https://www.bbc.com/news/articles/cjr19770x7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T04:27:35.000Z",
      "summary_90w": "",
      "raw": "The visit to Lhasa suggests a desire to stamp the Chinese leader's authority over the region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11e67f16b6483a2a58e306c44d5eb711909cb5c7",
      "title": "New Zealand to spend $3bn upgrading helicopters and ‘embarrassing’ defence planes",
      "url": "https://www.theguardian.com/world/2025/aug/21/new-zealand-seahawk-helicopters-defence-spending-planes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T03:06:28.000Z",
      "summary_90w": "",
      "raw": "Government says country will buy five Seahawk helicopters and two Airbus A321XLR aircraft\nNew Zealand will spend nearly NZ$3bn ($1.7bn) upgrading its ageing defence fleet, including replacing its “embarrassing” planes that have left multiple prime ministers grounded during international travel, the government has announced.\nThe defence minister, Judith Collins, said NZ$2bn would be spent buying five MH-60R Seahawk helicopters and another NZ$700m to buy two Airbus A321XLR aircraft.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1c8634f88806a1f78d8ffb1fbf8efb821035e616",
      "title": "Delta and United sued for selling 'window seats' without windows",
      "url": "https://www.bbc.com/news/articles/c754k7d0z51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T02:57:04.000Z",
      "summary_90w": "",
      "raw": "Delta and United are being sued over allegedly charging extra for seats next to a blank walls.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df9e733c1fa93c0088804673ba70ef3ebc461e60",
      "title": "ICC 'deplores' new US sanctions on judges and prosecutors",
      "url": "https://www.bbc.com/news/articles/c620l3y7ydro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T02:29:40.000Z",
      "summary_90w": "",
      "raw": "Secretary of State Marco Rubio denounces the court as \"an instrument of lawfare\" against the US and Israel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1631129ec82de30e58c1bb8da79989ecae1ad5a0",
      "title": "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum",
      "url": "https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T01:56:35.000Z",
      "summary_90w": "",
      "raw": "Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges\nBrazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead of his judgment for allegedly plotting a military coup.\nThe far-right populist is facing a jail term of over 40 years when Brazil’s supreme court convenes next month to decide whether he is guilty of conspiring to overturn the result of the 2022 presidential election, which Bolsonaro lost to his leftwing opponent Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31e01ffd56e824f74bfb4ae87bcbc6103b44a37a",
      "title": "US Navy sailor convicted of spying for China",
      "url": "https://www.bbc.com/news/articles/cjw6847p2ypo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-21T01:00:45.000Z",
      "summary_90w": "",
      "raw": "Jinchao Wei is found guilty of selling details about warships' locations and weapons for $12,000.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6d760f89b41f334fcb3e953c1d421a1ecb53ec0",
      "title": "Space is open for business with Even Rogers and Max Haot at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/20/space-is-open-for-business-with-even-rogers-and-max-haot-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T22:43:01.000Z",
      "summary_90w": "",
      "raw": "The next era of the space economy isn’t just about rockets and satellites — it’s about infrastructure, autonomy, and entirely new models for building and defending off-Earth assets. At TechCrunch Disrupt 2025 this October 27–29 in San Francisco's Moscone West, the Space Stage is where this shift gets real.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aecc0a731724623dbc8758a58ee9816d9b2b4ba7",
      "title": "Saving China's finless porpoise from the brink of extinction",
      "url": "https://www.bbc.com/news/articles/ce3jy7el90po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T22:01:43.000Z",
      "summary_90w": "",
      "raw": "Scientists are racing to protect what some view as \"the most important animal\" in the Yangtze.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70614f519d0aa81fe1318fa871dba0c17e4fba94",
      "title": "US court allows Trump officials to end protected status for 60,000 migrants",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/appeals-court-trump-temporary-protected-status",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T21:48:05.000Z",
      "summary_90w": "",
      "raw": "Administration officials given legal right to move towards deportation of people from Nepal, Honduras and Nicaragua\nA federal appeals court on Wednesday sided with the Trump administration and halted for now a lower court’s order that had kept in place temporary protections for 60,000 migrants from Central America and Nepal.\nThis means that the Republican administration can move toward removing an estimated 7,000 people from Nepal whose temporary protected status designations expired on 5 August. The TPS designations and legal status of 51,000 Hondurans and 3,000 Nicaraguans are set to expire 8 September, at which point they will become eligible for removal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5dcd63be90057a61528450a94033da05ec4b353",
      "title": "Group14 lands $463M from SK, Porsche, and others to make silicon anodes for EVs",
      "url": "https://techcrunch.com/2025/08/20/group14-lands-463m-from-sk-porsche-and-others-to-make-silicon-anodes-for-evs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T20:50:33.000Z",
      "summary_90w": "",
      "raw": "The battery materials startup raised significant Series D funding to expand its manufacturing capability. At the same time, it bought out partner SK's stake in a joint venture.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9a9347d28be98f5a69604b97d249f804980f1f92",
      "title": "India ‘successfully tests’ nuclear-capable missile able to reach deep into China",
      "url": "https://www.theguardian.com/world/2025/aug/20/india-successfully-tests-nuclear-capable-missile-able-to-reach-deep-into-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T20:26:06.000Z",
      "summary_90w": "",
      "raw": "Agni-5 intermediate-range ballistic missile also part of Narendra Modi’s defence strategy against Pakistan\nIndia has said it successfully test-fired an intermediate-range ballistic missile that, when operational, should be capable of carrying a nuclear warhead to any part of China.\nThe Agni-5 missile was successfully launched in India’s eastern Odisha state on Wednesday, and authorities said it “validated all operational and technical parameters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f05a5f933dc2281be8cc47929c7de50b044c69c",
      "title": "Israel approves controversial West Bank settlement project",
      "url": "https://www.bbc.com/news/articles/cvg30l6myj3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T19:26:05.000Z",
      "summary_90w": "",
      "raw": "The Palestinian Authority says the decision is illegal and will \"destroy\" the prospects for a two-state solution.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27ad35931940d0a986c4f9a026d28b1f1b5862fc",
      "title": "Has Donald Trump really stopped six (or seven) wars?",
      "url": "https://www.bbc.co.uk/sounds/play/p0ly23xj?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T18:00:00.000Z",
      "summary_90w": "",
      "raw": "And can the US president get rid of postal voting across America?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5fb940ca89f696e590d9f001174a65f989b89dff",
      "title": "Fire still burning in one of world's tallest trees after three days",
      "url": "https://www.bbc.com/news/articles/czxp4x1ykwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T17:25:36.000Z",
      "summary_90w": "",
      "raw": "With about 50 ft already lost, the fire may impact the Doerner Fir's standing in global height rankings, officials say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ce1b9b5ba18a162aec8e929c74920bbaa83fdff",
      "title": "Why Donetsk 'fortress belt' matters so much for Ukraine's defences",
      "url": "https://www.bbc.com/news/articles/cj6yd4d5zj6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T17:12:10.000Z",
      "summary_90w": "",
      "raw": "For Ukraine to lose western Donetsk would mean the fall of a bulwark against any future Russian advance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47fd89a3e47495e9adc595bbcf93e757eb8b3487",
      "title": "Denmark scraps book tax to fight 'reading crisis'",
      "url": "https://www.bbc.com/news/articles/crm48mvl33ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T16:57:27.000Z",
      "summary_90w": "",
      "raw": "The government hopes abolishing the sales tax will encourage more people to buy books.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "489248e679d2f3cb84168b8ac7a5e83b892b68f0",
      "title": "Trump calls for resignation of Fed governor in latest line of attack",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5508276/trump-calls-for-resignation-of-fed-governor-in-latest-line-of-attack",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-20T16:56:04.000Z",
      "summary_90w": "",
      "raw": "President Trump is calling for the resignation of Federal Reserve governor Lisa Cook after a Trump ally accused her of making false statements on mortgage applications.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3cca5f889d03eb19a602e5f44ae7e5a7afa57bdf",
      "title": "German controversy surrounds jail term for transgender far-right extremist",
      "url": "https://www.bbc.com/news/articles/c3r4zrg35vlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T16:46:52.000Z",
      "summary_90w": "",
      "raw": "Marla-Svenja Liebich was sentenced two years ago to a total of one year and six months in prison without parole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8691cb0200ee02380fc72155816cf5888f8d911f",
      "title": "Leading conservationist in South Africa denies smuggling rhino horns worth $14m",
      "url": "https://www.bbc.com/news/articles/c0ql3qdykpxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T16:35:32.000Z",
      "summary_90w": "",
      "raw": "John Hume was allegedly part of an international rhino horn trafficking syndicate, prosecutors say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34813e0f1f26d76786862ca068e099b13644362d",
      "title": "Human rights regulator criticises Met's use of facial recognition cameras",
      "url": "https://www.bbc.com/news/articles/c1kzgx4v2pko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:18:42.000Z",
      "summary_90w": "",
      "raw": "The Equality and Human Rights Commission says it believes the Met's use of the tech is unlawful.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b2c5d6d0908d4a6f91069746af4fa65f34b8ddc",
      "title": "South African minister investigated for historical racial slurs on social media",
      "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:15:35.000Z",
      "summary_90w": "",
      "raw": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts \nSouth Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid.\nMcKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts, which were still online at the time of publication.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09b5e26022a84d312516c81e1a87b0dcb2955319",
      "title": "Supporting freedom of expression is not wrong, Jimmy Lai’s lawyer tells court",
      "url": "https://www.theguardian.com/world/2025/aug/20/jimmy-lai-unwavering-intent-to-solicit-foreign-sanctions-hong-kong-court-told",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T15:23:24.000Z",
      "summary_90w": "",
      "raw": "Closing arguments made in Hong Kong media mogul’s national security trial, which has lasted more than 140 days\nA lawyer for Jimmy Lai has argued that it is not wrong to support freedom of expression, as he began his final argument in the prominent Hong Kong democracy activist and newspaper founder’s landmark national security trial.\nThe barrister Robert Pang is representing Lai in his fight against charges of colluding with foreign forces to endanger national security and conspiring with others to issue seditious publications. Lai, 77, faces up to life in prison if convicted under a national security law imposed by Beijing after anti-government protests in 2019.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c4b3001312bdcbbb916e54e23d39819415118c0",
      "title": "Man held after four bodies found in River Seine",
      "url": "https://www.bbc.com/news/articles/c5yer12rp8po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T14:17:07.000Z",
      "summary_90w": "",
      "raw": "A passer-by led French police to the grim discovery at the foot of a bridge south-east of Paris.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "906a1feb4c5eb7947139b45194cde396dd3b3823",
      "title": "South African MP opens fire to fend off attack during attempted hijacking",
      "url": "https://www.bbc.com/news/articles/cm2k167kge2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T14:13:02.000Z",
      "summary_90w": "",
      "raw": "Two teens, aged 16 and 18, have been arrested over the attack as police search for a third suspect.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca9dc3e79708726084045a1b585cddef480086c2",
      "title": "Uganda denies reports that it has struck deal with Trump to take in US deportees",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/uganda-trump-deal-immigration",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T13:01:24.000Z",
      "summary_90w": "",
      "raw": "Ugandan official said the east African country does not have the capability to take in undocumented immigrants\nUganda said it has not reached any agreement with the US to take in undocumented immigrants, contradicting reports that the east African country had struck a deal with the Trump administration to do so.\nHenry Oryem Okello, Uganda’s state minister for foreign affairs, told Reuters the country does not have the capability to take in immigrants. It comes as the US has deported migrants convicted of crimes in the US to non-native countries including South Sudan and Eswatini.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9bf11feed4f8cfa76d9994383b7dd26842836552",
      "title": "South Korea tells tourists on holiday island Jeju to behave",
      "url": "https://www.bbc.com/news/articles/c939j4n2274o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T12:55:26.000Z",
      "summary_90w": "",
      "raw": "The island has issued visitor guidelines for the first time as it sees an increasing number of tourists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "33608c51b45b57a766acec6d31039aa5ed38f1c1",
      "title": "Trump administration wants government to have an equity stake in chipmaker Intel",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507038/trump-administration-wants-government-to-have-an-equity-stake-in-chipmaker-intel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-20T09:15:33.000Z",
      "summary_90w": "",
      "raw": "The Trump administration is pursuing an unusual deal that would make the U.S. government a major stakeholder in chipmaker Intel. NPR unpacks the proposal with Bloomberg reporter Mackenzie Hawkins.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d878abc47011950c1db1e8d6d11ffdf056ecf28c",
      "title": "US in talks over 10% Intel stake, White House confirms",
      "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T06:37:52.000Z",
      "summary_90w": "",
      "raw": "The potential deal could involve swapping government grants for shares in the chip making giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4ba1e658887c50df9642cf490b109f962d033b",
      "title": "Walmart recalls frozen shrimp over potential radioactive contamination",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507971/walmart-recall-frozen-shrimp-radioactive",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-20T05:18:08.000Z",
      "summary_90w": "",
      "raw": "The risk from the recalled shrimp is \"quite low,\" said Donald Schaffner, a food safety expert at Rutgers University. Cesium-137 is a byproduct of nuclear reactions.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "07ae72a57aca8d210e3bfb2fbe31cab2c31739ed",
      "title": "Chili's has staged a remarkable revival in sales",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506272/chilis-has-staged-a-remarkable-revival-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T20:21:58.000Z",
      "summary_90w": "",
      "raw": "The 50-year-old casual dining chain Chili's has posted five straight quarters of double digit sales increases. NPR's Mary Louise Kelly talks with Slate's Dan Kois about what's behind the brand's turnaround.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "93e6d03c7c4e4531f649edf86d10c6cdf123c005",
      "title": "Peruvian woman accused of trying to smuggle cocaine into Bali using sex toy",
      "url": "https://www.theguardian.com/world/2025/aug/19/peruvian-woman-bali-cocaine-smuggling",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T19:23:25.000Z",
      "summary_90w": "",
      "raw": "Officers say they found 1.4kg of drug inside toy in woman’s underwear and also accused her of hiding ecstasy pills\nA Peruvian woman has been arrested in Bali after allegedly trying to smuggle cocaine into the Indonesian resort island using a sex toy and hiding drugs in her underwear, police said.\nThe 42-year-old, identified only by her initials NS, arrived at Bali’s international airport from Qatar on 12 August when authorities became suspicious.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "05652f0296eef23ac43f283c2f5203c0500df8e0",
      "title": "Home Depot keeps quiet on immigration raids outside its doors",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5504124/home-depot-earnings-immigration-raids-day-laborers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T18:32:19.000Z",
      "summary_90w": "",
      "raw": "The home-improvement chain is now one of the companies most caught up in Trump's immigration crackdown. The retailer's history with day laborers is long. So far, it's choosing to keep its distance.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bc595540d80662f85fbc4697aadf01a3a421a495",
      "title": "Diphtheria cases spiralling in Somalia, health officials warn",
      "url": "https://www.theguardian.com/world/2025/aug/19/diphtheria-cases-spiralling-somalia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:46:12.000Z",
      "summary_90w": "",
      "raw": "MSF says low vaccination coverage and poor living conditions driving spread of deadly bacterial disease\nDiphtheria cases are rapidly increasing across Somalia, officials and humanitarians warn, with children accounting for more than 97% of the cases.\nDiphtheria, a highly contagious and deadly bacterial disease that mainly affects children, is preventable by a vaccine. While Somalia has improved vaccination rates in recent years, the medical charity Médecins Sans Frontières (MSF) blames the uptick in cases on persisting immunisation gaps.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a69509bcd96ce8786a899f4a9734c85aef21c2ae",
      "title": "Brazil issues last-ditch plea for countries to submit climate plans ahead of Cop30",
      "url": "https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:38:38.000Z",
      "summary_90w": "",
      "raw": "Only 28 countries have submitted carbon-cutting proposals to the UN, with some of the biggest emitters yet to produce plans\nBrazil has issued an urgent call for all countries to come forward with strengthened national plans on the climate, in a last-ditch attempt to meet a key September deadline.\nOnly 28 countries have so far submitted carbon-cutting proposals to the UN, with some of the biggest emitters of greenhouse gases – including China and the EU – still to produce their plans.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c83215dd1b60362dbf7df75be0608a4595067a50",
      "title": "Air Canada flights slowly resume after flight attendants agree to end their strike",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507052/air-canada-flights-resume-flight-attendants-union-strike",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T15:25:59.000Z",
      "summary_90w": "",
      "raw": "The flight attendants' union said a new agreement guarantees members will be paid for work performed while planes are on the ground, resolving one of the major issues that drove the strike.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}