{
  "version": "1757607439262",
  "generatedAt": "2025-09-11T16:17:19.262Z",
  "items": [
    {
      "id": "2738b9a41c0b01dd105bf0f83cafe079edff6108",
      "title": "Gmail is launching a tab for all your Amazon purchases",
      "url": "https://www.theverge.com/news/776305/google-gmail-purchases-tab-online-orders",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Gmail is trying to make it easier to track your online orders with a new Purchases tab coming to mobile and the web. When you click on the tab, you’ll only see emails related to your purchases, including order confirmations and shipping estimates. \nThis new tab builds on Gmail’s existing package-tracking features on mobile, which show packages expected to arrive within the next 24 hours at the top of your inbox. Gmail also places order tracking cards at the top of emails with at-a-glance information about your purchase.\nAlong with this new tab, Gmail will start flagging timely deals within its Promotions category and roll out a new filter that lets you sort emails by the “most relevant” ones. Google says this filter will surface updates based on brands “you engage with the most,” but it notes that you can switch back to viewing your “most recent” emails at any time. \nThe update to the Promotions tab will roll out in the “coming weeks” on mobile to users with personal Gmail accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b56c8966f95c5c129b0b3964260941d77365c703",
      "title": "Gmail makes it easier to track upcoming package deliveries",
      "url": "https://techcrunch.com/2025/09/11/gmail-makes-it-easier-to-track-upcoming-package-deliveries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google also announced on that it's updating the Promotion category in Gmail to allow users to sort by \"most relevant\" promotion emails.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "167f3a38f593d1ec5b7bb18e94b19aa1d1c3cda4",
      "title": "Xbox Cloud is getting a much-needed upgrade",
      "url": "https://www.theverge.com/notepad-microsoft-newsletter/776320/microsoft-xbox-cloud-gaming-limitations-strategy-notepad",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Over the past week, I've been using Nvidia's new RTX 5080 GeForce Now tier. Nvidia's cloud gaming service has been the best on the market for years now, and this upgrade makes it even better. I've been playing Cyberpunk 2077, Overwatch 2, and Silksong, and it's genuinely comparable to my own PC.\nThe upgrade is also a staggering reminder of just how far behind Xbox Cloud Gaming is, both in stream quality and latency - two key components for streaming games from the cloud. Microsoft needs a far better cloud for its Xbox everywhere strategy. Fortunately, there are plenty of signs that it's about to get a much-needed upgrade.\nXbox Cloud Gaming …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1e6fb8911a2b4985f5d8b71e0a460e70f94af8f",
      "title": "Ireland threatens to withdraw from Eurovision if Israel participates",
      "url": "https://www.bbc.com/news/articles/c5yvd8158ywo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:57:16.000Z",
      "summary_90w": "",
      "raw": "The Irish broadcaster said that Ireland's participation in the contest \"would be unconscionable given the ongoing and appalling loss of lives in Gaza\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1e6fb8911a2b4985f5d8b71e0a460e70f94af8f",
      "title": "Ireland threatens to withdraw from Eurovision if Israel participates ",
      "url": "https://www.bbc.com/news/articles/c5yvd8158ywo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T15:57:16.000Z",
      "summary_90w": "",
      "raw": "The Irish broadcaster said that Ireland's participation in the contest \"would be unconscionable given the ongoing and appalling loss of lives in Gaza\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec313245262a91f387807cf9c970dfe86e5ee6ee",
      "title": "South Sudan vice-president charged with murder and treason  ",
      "url": "https://www.bbc.com/news/articles/c07vkln2ezro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T15:52:07.000Z",
      "summary_90w": "",
      "raw": "The roads leading to Riek Machar's house are blocked by tanks and soldiers, amid fears of renewed fighting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6f4281e47b2777b004029cf9e59d9265d817acac",
      "title": "Lawmaker calls for French criminal investigation into TikTok",
      "url": "https://www.theguardian.com/world/2025/sep/11/lawmaker-calls-for-french-criminal-investigation-into-tiktok",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:47:57.000Z",
      "summary_90w": "",
      "raw": "Move comes after parliamentary inquiry into social media platform’s psychological effects on minors\nA French lawmaker has asked the state prosecutor for a criminal investigation into whether TikTok was responsible for “endangering the lives” of its young users.\nArthur Delaporte, a Socialist MP, said he co-chaired a six-month French parliamentary inquiry into TikTok’s psychological effects on minors and heard testimony from families, social media executives and influencers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb2717c799d0316e5eda885fb8fa03627626e23f",
      "title": "Fortnite will soon let you buy exactly the V-bucks you need",
      "url": "https://www.theverge.com/news/776478/fortnite-v-bucks-need-top-up-item-shop-skins-exact-amount",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T15:45:38.000Z",
      "summary_90w": "",
      "raw": "If you want to buy a skin or virtual gear from the Fortnite item shop but don’t have enough V-Bucks, Epic Games is going to add a way to “top up” your V-Bucks balance so that you can buy just the V-Bucks you need to afford your purchase.\nEpic is calling this feature the “Exact Amount” offer, and it will be available starting October 14th on Android, iPhone, iPad, Nintendo, PC, Xbox, and Epic’s item shop for Fortnite on the web. That means the feature, at least initially, won’t be available on PlayStation, but Epic says that “we will work to make this available everywhere.” \nHere’s Epic’s explanation of how this might work in practice:\nLet’s say you want an item that costs 500 V-Bucks but you only have 400 V-Bucks in your account. You’ll be able to buy just the 100 V-Bucks needed.\nExact Amount will display offers in increments of 50 V-Bucks, Epic says. The company also bringing Exact Amount offers to Rocket League and Fall Guys.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1894911a63f2eb943ee27da3be64046c3dda7114",
      "title": "Nato strengthens defences after Russian drones shot down over Poland",
      "url": "https://www.bbc.com/news/articles/c0lkz2n34z6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:43:36.000Z",
      "summary_90w": "",
      "raw": "Germany, the Netherlands and the Czech Republic will be sending Poland more support to defend Nato's eastern flank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab7c1effdd1fedfb32492fe7ffb3efe4b45ea86f",
      "title": "Chelsea face 74 FA charges over payments to football agents",
      "url": "https://www.bbc.com/sport/football/articles/c8643dp5043o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:36:40.000Z",
      "summary_90w": "",
      "raw": "Chelsea are charged by the Football Association with 74 alleged rule breaches related to payments to agents when Roman Abramovich was owner.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25a04dd392ff3a835b853371b785a5e2e152b93c",
      "title": "Russian drone incursion an ‘aggressive, reckless act’, says EU as Poland plans no-fly zone – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:36:11.000Z",
      "summary_90w": "",
      "raw": "Poland is seeking to step up its defences with plans to restrict air traffic in the eastern part of the country\nGrynkewich now gets a specific question on Poland.\nHe speaks about how allied command operations worked in this case, with every level “doing exactly what they were supposed to do, which was to defend Alliance territory.”\n“But when you’re when you’re an operational commander, and you have a capability and there’s an attack or an incursion into your airspace, the cost of the weapon doesn’t matter at that moment in time; you’re going to use it to defend our population.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c98904bc4d21c59b49d54e158e9903fde5e2bad",
      "title": "The killing of Charlie Kirk adds to a time of political upheaval and violence",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537908/political-violence-charlie-kirk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T15:32:30.000Z",
      "summary_90w": "",
      "raw": "The killing of conservative activist Charlie Kirk Wednesday at a college in Utah is the latest in a series of politically motivated violent acts just in recent months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f5b639f903c784e7bcfc4b8e410de412b524239",
      "title": "France says Apple notified victims of new spyware attacks",
      "url": "https://techcrunch.com/2025/09/11/france-says-apple-notified-victims-of-new-spyware-attacks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:32:05.000Z",
      "summary_90w": "",
      "raw": "The French government says Apple sent out threat notifications to customers alerting them to spyware attacks earlier in September.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0edb4a9643af7a8b23b0dd5d8dfe8571f9da748a",
      "title": "Roku wants you to see a lot more AI-generated ads",
      "url": "https://www.theverge.com/lowpass-newsletter/776248/roku-ai-ads",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T15:30:00.000Z",
      "summary_90w": "",
      "raw": "Are you tired of having to watch the same three or four ads over and over again? That could change soon, if Roku has its way. The smart TV and streaming device maker is working on dramatically expanding the number of advertisers vying for your attention, to the point where ads on streaming could soon look a lot more like those on your Instagram feed, complete with brands you've never heard of and videos that don't quite look real.\nRoku's secret weapon for this is generative AI, according to Roku CFO and COO Dan Jedda, who laid out Roku's plans for this during two appearances at investor conferences hosted by Citi and Bank of America this mo …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d726604ce348753b5d46eda288662c4db3aceee",
      "title": "Poland says UN will hold emergency meeting after Russian drone incursions",
      "url": "https://www.theguardian.com/world/2025/sep/11/poland-says-un-will-hold-emergency-meeting-after-russian-drone-incursions",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:26:45.000Z",
      "summary_90w": "",
      "raw": "Polish, Ukrainian and Lithuanian foreign minister says act was deliberate and coordinated as Trump offers little support \n\nEurope live – latest updates\n\nPoland said the UN security council would hold an emergency meeting over an incursion into the country by Russian drones on Wednesday as allies disputed whether it was a deliberate attack on Poland by Russia and Donald Trump offered little in the way of public support.\nPoland’s foreign minister, Radosław Sikorski, told local radio Poland planned to use the security council meeting to “draw the world’s attention to this unprecedented Russian drone attack on a member of the UN, EU and Nato”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ac6e9b683542989bc3c364ef893cc185f390341",
      "title": "UK could see first named storm of season as yellow warning issued for rain and wind",
      "url": "https://www.bbc.com/weather/articles/cpd9x525653o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T15:18:56.000Z",
      "summary_90w": "",
      "raw": "Heavy rain and strong winds will affect the UK on Sunday and Monday bringing a risk of some disruption.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "756fab8f54bed63dd69d59f5ad59b9df65716034",
      "title": "The best earbuds we’ve tested for 2025",
      "url": "https://www.theverge.com/21309820/best-wireless-earbuds",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T15:17:06.000Z",
      "summary_90w": "",
      "raw": "It’s hard to buy a bad pair of wireless earbuds these days, and with constant discounts and deals wherever you look, now is as good a time as any to splurge on the pair you’ve been eyeing. The market has come a long way since the early era of true wireless earbuds when we had to deal with mediocre sound quality and unreliable performance, all for the sake of ditching cables. Things are much different now. After several product generations of learned lessons, companies like Sony, Apple, Samsung, and others are releasing their most impressive earbuds to date. \nYou can get phenomenal noise cancellation and sound quality in the premium tier of earbuds if you’re willing to spend big. But those aren’t always the most important criteria for everyone: maybe you’re looking for the perfect fitness earbuds or for a set that works just as well for Zoom calls as for playing your favorite playlists and podcasts.\nTech companies are increasingly making their earbuds work best with their own products through exclusive features and functionality, so that’s another thing to consider as you shop around. If you want a perk like head-tracking spatial audio, you’ll need to use AirPods with an iPhone, Samsung buds with a Samsung phone, and so on.\nFeatured in this article\nBest overall: Sony WF-1000XM5\nSony’s flagship wireless earbuds offer the company’s best noise cancellation, powerful and lively sound, and a comfortable fit.\n\nWhere to Buy:\n\n $329.99 $213 at Amazon\n $329.99 $214.99 at Best Buy\n $329.99 $214.99 at Target\n\nBest noise-canceling: Bose QuietComfort Ultra Earbuds\nWith dynamic, rich sound and the best ANC available, the QC Ultra Earbuds are a terrific pick if you want to listen to your music in peace.\n\nWhere to Buy:\n\n $299 at Amazon\n $299 at Walmart\n $299 at Best Buy\n\n\n\n\n\n\nThe best overall wireless earbuds\nThe best budget earbuds under $100\nThe best noise-canceling earbuds\nThe best earbuds for sports and working out\nThe best earbuds for iPhone owners\nThe best earbuds for Samsung Galaxy phone owners\nThe best earbuds for Google Pixel phone owners\nThe best earbuds if you own both Apple and Android devices\nThe best earbuds for sound quality\nThe best earbuds for voice calls on iPhone\nThe best earbuds for voice calls on Android\nWhat’s coming next\n\nThe best overall wireless earbuds\nSony WF-1000XM5\nSony’s flagship wireless earbuds offer the company’s best noise cancellation, powerful and lively sound, and a comfortable fit. Read our review.\n\n\nScore: 8\n\nProsCons\n\n\nSmaller, more comfortable design\nUpgrades to ANC and sound quality\nMuch clearer voice call performance\n\nGlossy texture can make them harder to remove from case\nSony’s bonus features aren’t as seamless as those of its competitors\nPotential battery longevity concerns\n\n\n\nWhere to Buy:\n\n $329.99 $213 at Amazon\n $329.99 $213 at Best Buy\n $329.99 $214.99 at Target\n\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: LDAC, AAC, SBC / Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Foam (XS, S, M, L)\nJust like their predecessors, Sony’s WF-1000XM5 earbuds have again topped our recommendations for the overall best noise-canceling earbuds. Thanks to their larger drivers, the audio quality is more detailed and dynamic than before while still retaining the warmth and clarity that made the WF-1000XM4 so enjoyable. Sony has also further improved its ANC and is nearing the same territory as Bose’s QC Earbuds II. These earbuds do a terrific job of eliminating background noise. Battery life can stretch to eight hours of continuous listening with noise cancellation turned on.\nSome people found the XM4 to be bulky and uncomfortable, so this time around, Sony has managed to shrink the XM5 by 25 percent. Like before, the company includes foam-style tips that expand in your ears to create an excellent seal — and now there’s a fourth (extra small) set of tips in the box.\nOn Android phones, the 1000XM5 support Sony’s LDAC codec for higher-quality music playback. And they’re capable of dynamic head tracking spatial audio through supported video apps like Netflix. But even if you’re not using LDAC (or have an iPhone), these are up there with the very best audio-focused premium earbuds — including Sennheiser’s Momentum True Wireless 4, only with substantially better noise cancellation. They’re also capable of multipoint Bluetooth connectivity, so you can pair them with two devices at the same time.\nIt’s worth noting that there were many reports of battery issues with the 1000XM4 over time as those earbuds aged, but Sony claims to have rectified that problem with the new model by tweaking the charging algorithm.\nRead our full WF-1000XM5 review.\nThe best budget earbuds under $100\nNothing Ear (a)\nNothing’s Ear (a) earbuds have the same stylish, semi-transparent design as the company’s other earbuds — but these come in a snazzy yellow. They combine decent ANC, enjoyable sound, and other features like multipoint for under $100.\n\n\n\nProsCons\n\n\nStandout color and design\nVery compact carrying case\nGreat performer for the price\n\nLimited retail availability\nPlastic case can show scuffs\n\n\n\n\nWhere to Buy:\n\n $99 $89 at Nothing\n $99 $89 at Amazon\n\nNoise cancellation: Yes / Battery life: 5.5 hours (ANC on) / Water resistance: IP54 / Bluetooth codecs: LDAC, AAC, SBC / Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (S, M, L)\nWhen looking at Nothing’s Ear (a) earbuds, it’s easy to focus all your attention on the catchy yellow color or their fun, super compact carrying case. But at their $99 price, the company’s entry-level earbuds provide a ton of features, including active noise cancellation, a low-latency mode for gaming, multipoint Bluetooth pairing, and a decent IP54 dust and water resistance rating. \nAnd the sound quality you get outperforms my usual expectations for this price point. They’re not quite on par with Nothing’s higher-end Ears, but you do get expressive, very enjoyable audio — and you can customize the EQ further in Nothing’s mobile app.\nRead my full Nothing Ear (a) impressions.\nThe best noise-canceling earbuds\nBose QuietComfort Ultra Earbuds\n\n\nScore: 8\n\nProsCons\n\n\nMost powerful ANC you’ll find in earbuds\nLively, rich sound\nStabilizer fins are easier to apply\n\nImmersive Audio drains battery\nWireless charging requires $49 case\n\n\n\nWhere to Buy:\n\n $299 at Amazon\n $299 at Walmart\n $299 at Best Buy\n\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC, aptX Adaptive / Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (S, M, L)\nBose’s QuietComfort Ultra Earbuds are the most powerful noise-canceling earbuds on the market. Of all our top picks, they do the best job of offering peace and quiet from the cacophony of daily life, putting you in a private bubble with your music playlists or favorite podcasts.\nThe QC Ultra Earbuds are extremely similar to 2022’s QC Earbuds II in terms of design, fit, and sound. Audio quality is rich and dynamic, delivering more bass thump than, say, Apple’s AirPods Pro. And by switching to a two-piece ear tip / stabilizer fitting process, Bose’s latest flagship buds should fit a wider range of ears more comfortably. The Ultra also introduce a new Immersive Audio mode, which is Bose’s take on spatial audio.\nThat being said, it’s worth noting that Bose recently announced an updated version of the QC Ultra Earbuds, which, with the help of AI, supposedly offer improved call quality and enhanced adaptive ANC to help curb sudden spikes in noise. They’ll also retail for the same price as the current model and come with a wireless charging case when they launch later this year, preventing you from having to pay extra for what has essentially become a table-stakes feature.\nRead our full QuietComfort Ultra Earbuds review.\nThe best earbuds for sports and working out\nBeats Powerbeats Pro 2\n\n\nScore: 8\n\nProsCons\n\n\nHuzzah! Wireless charging!\nAdds ANC, transparency modes, spatial audio\nSlimmer ear hook, smaller case\nAdds heart rate\nGreat sound\nNo price hike\n\nCase is still a chonker\nHeart rate is not that useful for iOS users\n\n\n\nWhere to Buy:\n\n $249 $199.95 at Amazon\n $249 $199.95 at Walmart\n $249.99 $199.99 at Best Buy\n\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC / Multipoint: No / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L, XL)\nAfter a long wait, Beats finally introduced the Powerbeats Pro 2 in early 2025. They carry forward the signature ear hook design of past Powerbeats earbuds, but improve upon the original Powerbeats Pro in several key ways. Beats added active noise cancellation and a natural-sounding transparency mode to the Pro 2; the first-generation pair lacked both. The earbuds themselves are lighter, too, and the charging case is noticeably smaller.\nThe Powerbeats Pro 2 also feature heart rate monitoring thanks to built-in sensors on each earbud. You might already have a fitness tracker, chest strap, or smartwatch for this purpose, but if not, you can use these with compatible apps like Nike Run Club, Runna, Ladder, Slopes, Open, Peloton, and YaoYao. The downside is that they can’t simultaneously play music and broadcast heart rate to gym equipment when paired to an iOS device, rendering the Pro 2 a better heart rate monitoring alternative for Android users than iPhone users.\n\n\nThe Powerbeats Pro 2 remain rated IPX4 for water resistance. While that’s not as robust as some other fitness-focused buds, it should be sufficient to survive sweat and outdoor runs in various conditions. The earbuds still offer easy-to-use physical buttons and a dedicated volume rocker, so it’s easy to control them in the middle of a workout.\nIf you’re an iPhone owner, the Powerbeats Pro 2 earbuds include Apple-only features like dynamic head tracking for spatial audio, auto device switching, Find My integration, and more. For Android users, Beats has an app that packs in a smaller subset of these functions. \nRead our full Powerbeats Pro 2 review.\nThe best earbuds for iPhone owners\nApple AirPods Pro (second-gen) with USB-C charging case\n\n\nScore: 8\n\nProsCons\n\n\nMuch better noise cancellation\nImproved sound quality and clarity\nUnrivaled hearing health features\n\nUnchanged design\nSound is better but not top tier\n\n\n\nWhere to Buy:\n\n $249 $199 at Amazon\n $249 $199 at Walmart\n $249.99 at Best Buy\n\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC / Multipoint: No / Works best with: iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\nFor those invested in Apple’s ecosystem, the second-gen AirPods Pro bring an appealing mix of top-notch noise cancellation and refined sound compared to the original pair. As always, they also include numerous features (spatial audio, audio sharing, automatic syncing across iCloud devices, etc.) that make them an ideal companion to the company’s other devices. They’re also the only AirPods that come with different sizes of ear tips for a customizable fit — including an extra small option. Note: the introduction of the AirPods Pro 3 during Apple’s iPhone 17 event, that model features one additional size, XXS, totaling five ear tip options. They also bring a host of updates, including better battery life, a built-in heart rate sensor, and improved bass. This new model launches September 19th, and we’re working on a full review, so stay tuned.\nThe AirPods Pro have a compact case that supports wireless charging. Setting them up is as simple as holding the open case near your iPhone. The earbuds are lightweight and fit snugly in most ears. Their force sensor pinch controls are easy to get down, and with the second-gen model, Apple added swipe-based volume controls. The AirPods Pro have traditionally ranked among the best wireless earbuds when it comes to voice call quality, and the second-gen earbuds don’t disappoint. Their ANC is improved over the original model and is now right up there with Sony, and their transparency mode has gained the ability to quickly damper sudden, loud noises that might happen around you.\nWhere the AirPods Pro stand out is with their Apple-only features like head tracking for spatial audio, automatic device switching, extensive Find My support, and so on. The charging case now features a built-in speaker and a U1 chip for pinpoint location tracking, and the latest AirPods Pro have better sound and noise canceling capabilities than the original model. Plus, they retain their deep integration with Apple’s hardware ecosystem.\nLast year, Apple also rolled out an impressive set of hearing health features for the second-gen AirPods Pro. They’re now able to serve as clinical-grade hearing aids for people with mild to moderate hearing loss and protect your hearing in loud environments; you can even take a hearing test to assess your own level of hearing loss.\nRead our original AirPods Pro (second-gen) review.\nThe best earbuds for Samsung Galaxy phone owners\nSamsung Galaxy Buds 3 Pro\nThe Galaxy Buds 3 Pro are Samsung’s best-sounding wireless earbuds yet. They have a stemmed design similar to the AirPods Pro, but even if their design is a little bland, the Buds 3 Pro make up for it with great call quality, useful voice commands, and more.\n\n\nScore: 8\n\nProsCons\n\n\nTerrific sound quality\nCrisp, natural transparency / passthrough mode\nVoice commands are simple and so useful\nGood voice calls\n\nUninspired design\nMidtier noise cancellation performance\nNo true multipoint\n\n\n\nWhere to Buy:\n\n $249.99 $189.99 at Amazon\n $249.99 $189.99 at Samsung\n $249.99 $189.99 at Best Buy\n\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IP57 / Bluetooth codecs: Samsung seamless, AAC, SBC / Multipoint: No / Works best with: Android, Windows, macOS / Ear tips: Silicone (S, M, L)\nSamsung’s Galaxy Buds 3 Pro ditch the company’s more discreet designs of the past for a stemmed style that’s similar to AirPods and any number of other wireless earbuds. Boring? Maybe, but thanks to that change, I’ve found them to be more comfortable and provide better stability than the Buds 2 Pro. The sound quality is even better than before — and it was already excellent. These are right up there with Sennheiser and Technics from an audio fidelity standpoint.\nThe Buds 3 Pro are also a standout performer when it comes to call quality. And my favorite thing about these earbuds are the hands-free voice commands that don’t require you to say any specific wake phrase beforehand. You can just say “volume up” and / or “next song,” and it happens.\nBut they’re not perfect: the Buds 3 Pro lack multipoint connectivity, so they can’t connect to two devices at the same time. Just like Apple, Samsung prefers to automatically hop between products within its own walled garden ecosystem. Some people might consider this a dealbreaker, but I’ve still enjoyed the earbuds plenty without it.\nRead our full Galaxy Buds 3 Pro review.\nThe best earbuds for Google Pixel phone owners\nGoogle Pixel Buds Pro 2\n\n\nScore: 9\n\nProsCons\n\n\nSmaller and lighter design is supremely comfortable\nMore powerful noise cancellation\nCrystal-clear transparency mode\nVery pleasant and detailed sound quality\n\nANC can’t quite match Bose\nGoogle still refuses to add higher-quality Bluetooth codecs, limiting overall fidelity\nGemini Live feels more feeble than futuristic\n\n\n\nWhere to Buy:\n\n $229 $225 at Amazon\n $229 at Best Buy\n $229 at Google Store\n\nNoise cancellation: Yes / Battery life: 8 hours (ANC on) / Water resistance: IP54 / Bluetooth codecs: AAC, SBC / Multipoint: Yes / Works best with: Android, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\nWith the Pixel Buds Pro 2, Google has addressed most of the downsides of the original pair. They’re far smaller and lighter than the chunky first-gen Pixel Buds Pro. And there’s a small nub on the buds to help lock them in place even during intensive activities like running or exercise.\nGoogle’s active noise cancellation still isn’t on the same tier as Bose, but the transparency mode on the Buds Pro 2 is among the very best you’ll find. It offers a crisp, natural passthrough for the outside world when needed. Multipoint support is included, and Google’s latest earbuds eke out impressive battery life that surpasses most competitors.\nGot a Pixel phone? With the Pixel Buds Pro 2, you can have lengthy conversations with Google’s Gemini AI while your phone stays in your pocket. Features like head-tracking spatial audio and Clear Calling are also exclusive to those within the Pixel ecosystem. If that’s you, the Pixel Buds Pro 2 are a big step up from the previous buds in a much smaller package.\nRead our full Pixel Buds Pro 2 review.\nThe best earbuds if you own both Apple and Android devices\nBeats Studio Buds Plus\n\n\nScore: 8\n\nProsCons\n\n\nBetter sound, ANC, and battery life than Studio Buds\nStandout translucent case option\nImproved voice call performance\n\nANC and transparency fall short of second-gen AirPods Pro\nDoesn’t offer all Apple ecosystem tricks\nNo wireless charging or in-ear detection\n\n\n\nWhere to Buy:\n\n $169.95 $99.95 at Amazon\n $169.95 $99.95 at Walmart\n $169.99 $99.99 at Best Buy\n\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IPX4 / Bluetooth codecs: AAC, SBC / Multipoint: No / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\nBeats’ Studio Buds Plus are an upgraded, better-performing revision of the Studio Buds released in 2021. This time, the company has made the noise cancellation more powerful while also improving the quality of the transparency mode and extending battery life. If you’re going for style points, it doesn’t get much cooler than the translucent color option. These earbuds are very tiny and rank up with the best in terms of overall comfort.\nWhat’s interesting about the Studio Buds Plus is that they use a proprietary chip that allows them to support native software features on both iOS and Android. Plenty of earbuds offer companion apps on each platform, but in the case of the Beats, they work with both Apple’s Find My and Google’s Find My Device. You also get simple one-tap pairing, no matter which operating system you’re using.\nThe drawback to this dual-ecosystem life is that Apple customers don’t get all the usual bells and whistles that come with AirPods or even the Beats Powerbeats Pro 2; you lose out on audio sharing, head tracking spatial audio, and other tricks. Wireless charging and an ear detection sensor (for auto-pause when a bud is removed) are also MIA, which stings a bit considering the price.\nRead our full Beats Studio Buds Plus review.\nThe best earbuds for sound quality\nSennheiser Momentum True Wireless 4\n\n\nScore: 8\n\nProsCons\n\n\nFantastic sound quality\nImproved day-to-day reliability\nAuracast-enabled\n\nToo pricey for some\nNoise cancellation does the job, but isn’t anything special\nLong-term durability remains to be seen\n\n\n\nWhere to Buy:\n\n $349.95 $279.95 at Amazon\n $349.95 $279.95 at B&H Photo\n $349.95 $279.95 at Sennheiser\n\nNoise cancellation: Yes / Battery life: 7.5 hours (ANC on) / Water resistance: IP54 / Bluetooth codecs: AptX Adaptive, AptX, AAC, SBC / Multipoint: Yes / Works best with: Android, iOS, Windows, macOS / Ear tips: Silicone (XS, S, M, L)\nSennheiser’s Momentum True Wireless earbuds have always sounded fantastic; that’s never been the issue. But previous models in the series have been tainted a bit by bugs, unsteady performance, and battery reliability problems. The fourth-gen pair finally gets that part right while continuing to offer tremendous, detailed sound quality that stands above nearly all competitors. They’re a joy to listen to. The active noise cancellation can’t compete with the likes of Apple, Sony, and Bose, but if you care more about lush, intricate sound, the MTW4 won’t disappoint in the slightest.\nThese earbuds come with optional wing tips to help keep them securely locked in your ears. That could prove helpful for running or when hitting the gym. Sennheiser allows for plenty of EQ customization using its mobile app, and the Momentum True Wireless 4 support a range of Bluetooth codecs, including AAC, SBC, AptX, and AptX Adaptive. Sennheiser has also promised that they’re LE Audio and Auracast-ready for when those features become more widespread.\nRead our full Momentum True Wireless 4 review.\nThe best earbuds for voice calls on iPhone\nApple AirPods 4\n\n\nScore: 7\n\nProsCons\n\n\nUpgraded sound quality\nVoice isolation can noticeably improve call clarity\nDeep Apple ecosystem integration\n\nNo wireless charging\nNo built-in speaker on the case\nNo proper multipoint\n\n\n\nWhere to Buy:\n\n $129.99 $116 at Amazon\n $129.99 $116 at Walmart\n $129.99 $116 at Best Buy\n\nNoise cancellation: Optional / Battery life: 5 hours / Water resistance: IP54 / Bluetooth codecs: AAC, SBC / Multipoint: No / Works best with: iOS, Windows, macOS / Ear tips: None\nApple’s AirPods 4 come in two different versions, with a higher-priced option that includes active noise cancellation and wireless charging. But sound quality is identical on both sets, and equally as important in this case is that the same can be said of voice call clarity.\nOn the AirPods 4, there’s a new “voice isolation” feature — enabled by default — that uses machine learning both on the earbuds and your iPhone to eliminate distracting background noise on your end so that you come through clearly to whoever you’re speaking with.\nOverall call quality is excellent with the AirPods 4. And beyond that, compared to the third-gen model, you can expect upgraded audio quality (with richer bass), new ways of interacting with Siri through head movements, and yes… there’s a USB-C connector on the included charging case, as opposed to a Lightning port.\nThe AirPods still have a one-size-fits-most hard plastic form factor, so I recommend trying them before committing to a purchase. However, Apple says it used more than 50 million data points to further refine the contours and overall stability of its latest earbuds. So, if previous models worked well for you, these seem like a safe bet. The only question is whether you feel like spending a little more to gain ANC, a transparency mode, wireless charging, and a built-in speaker for Find My location tracking.\nRead our full AirPods 4 review.\nThe best earbuds for voice calls on Android\nSamsung Galaxy Buds 3 Pro\n\n\nScore: 8\n\nProsCons\n\n\nTerrific sound quality\nCrisp, natural transparency / passthrough mode\nVoice commands are simple and so useful\nGood voice calls\n\nUninspired design\nMidtier noise cancellation performance\nNo true multipoint\n\n\n\nWhere to Buy:\n\n $249.99 $189.99 at Amazon\n $249.99 $189.99 at Samsung\n $249.99 $189.99 at Best Buy\n\nNoise cancellation: Yes / Battery life: 6 hours (ANC on) / Water resistance: IP57 / Bluetooth codecs: Samsung seamless, AAC, SBC / Multipoint: No / Works best with: Android, Windows, macOS / Ear tips: Silicone (S, M, L)\nSony’s unconventional LinkBuds were our longtime pick for the clearest voice calls on Android, but we haven’t had the chance to review their successors. For now, the aforementioned Galaxy Buds 3 Pro are an easy-to-recommend choice. The built-in “voice pickup unit” detects the movement of your mouth to help isolate your voice from background noise and keep conversations clear.\nThe Buds 3 Pro have proven dependable for me during video chats on Google Meet, and people have been able to hear me without issue, even when I’m answering a quick call on the street.\nRead our full Galaxy Buds 3 Pro review.\nWhat’s coming next\nGoogle’s August event saw the introduction of the Pixel Buds 2A, Google’s next pair of budget-friendly earbuds. They come out in October.\nApple debuted the AirPods Pro 3 wireless earbuds, which release on September 19th.\nNothing will reveal the Ear 3 earbuds on September 18th, and we’ll be testing those, too.\nPhotography by Chris Welch / The Verge except where specified\nUpdate, September 11th: Updated to reflect current pricing / availability and mention the AirPods Pro 3 and the Nothing Ear 3 earbuds coming soon. Brandon Widder and Cameron Faulkner also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "df1c6e02fda152fafb9404dab89f66e4aa68e84a",
      "title": "Google is shutting down Tables, its Airtable rival",
      "url": "https://techcrunch.com/2025/09/11/google-is-shutting-down-tables-its-airtable-rival/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:15:23.000Z",
      "summary_90w": "",
      "raw": "Google Tables, a work-tracking tool and competitor to the popular spreadsheet-database hybrid Airtable, is shutting down. The app will not be supported after December 16, 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11f56be1571eab8454cca26e36461f80f8151887",
      "title": "TB is the #1 killer among infectious diseases. A new study says its toll could mount",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/11/nx-s1-5534234/tuberculosis-tb-deaths-aid-cuts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T15:09:43.000Z",
      "summary_90w": "",
      "raw": "New research estimates that as many as 2.2 million more people could die of tuberculosis if U.S. cuts to foreign aid become permanent.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf54c8e6986a21b0c9a565cfdce4bc13ec14a30e",
      "title": "Humanoids, AVs, and what’s next in AI hardware with Waabi and Apptronik at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/11/humanoids-avs-and-whats-next-in-ai-hardware-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T15:02:50.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 is bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6efb3e564c002dd579e77ce57476f6961b5fe2a8",
      "title": "‘Grave concerns’ from states over Labor plan to move autism services off NDIS",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/states-react-to-labor-ndis-changes-autism-services-thriving-kids",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:00:11.000Z",
      "summary_90w": "",
      "raw": "Federal health minister last month announced surprise move to shift child foundational supports to new Thriving Kids program from July 2027\n\nGet our breaking news email, free app or daily news podcast\n\nLabor is facing a growing revolt by the states over plans to provide early intervention autism services through a new $2bn national scheme, with Victoria’s disability minister warning children’s rights must not be traded away “for 30 pieces of silver”.\nStates and territories were blind-sided by last month’s announcement from the health minister, Mark Butler, that the federal government had scrapped plans for locally provided services for children with mild autism and other developmental issues, as part of efforts to ease pressure on the rapidly growing NDIS budget.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53016a35083afb00d067f015197394637fbe058f",
      "title": "Victorian Liberal party shapes up for ‘nastiest, most toxic’ state council in years amid leaks and infighting",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/victorian-liberal-party-nastiest-most-toxic-state-council-years-leaks-infighting-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:00:10.000Z",
      "summary_90w": "",
      "raw": "State party’s deep divisions on show as sexist messages force resignation of director days before annual meeting\n\nGet our breaking news email, free app or daily news podcast\n\nTiming is everything in politics. It’s a principle worth recalling when nine-month-old messages are made public just two days before the Victorian Liberals’ annual state council meeting.\nThe messages, taken from a WhatsApp group involving a small handful of party headquarters staff, are undeniably sexist and inappropriate. In them, Victorian Liberal party director Stuart Smith mocked the party’s women’s council, saying it could only make decisions at a meeting “after two men told them they had to”, and joked that upper house MP Bev McArthur had dementia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "87d37ed2e6e9d0ae2a11665706cb845a28936372",
      "title": "Jessica has 77 half-brothers and sisters through the same sperm donor. She wonders how many more there could be",
      "url": "https://www.theguardian.com/australia-news/2025/sep/12/jessica-has-77-half-brothers-and-sisters-through-the-same-sperm-donor-she-wonders-how-many-more-there-could-be-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T15:00:09.000Z",
      "summary_90w": "",
      "raw": "Queensland woman says its time for clinic to destroy 30-year-old samples as state and federal health ministers meet to push for reform\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland woman Jessica Hamilton has 77 half-brothers and sisters. But this week she learned that number could grow even further – swelled by new births.\nIn 1995, the year she was born, Queensland Fertility Group told Hamilton’s mother that she could expect to have between three and five siblings to other families.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0168340090b269a173adf995b4f8817c1ffdbaee",
      "title": "HBO Max is going to get more expensive, Warner Bros. Discovery CEO says",
      "url": "https://techcrunch.com/2025/09/11/hbo-max-is-going-to-get-more-expensive-warner-bros-discovery-ceo-says/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:59:02.000Z",
      "summary_90w": "",
      "raw": "Zaslav also said that the streaming service's crackdown on passwords will be coming in the future.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2a08d46a69740d7448a3d14e0546cba40ad716e2",
      "title": "Man arrested over fire at Labour MP's office",
      "url": "https://www.bbc.com/news/articles/cp3qwpe93yzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T14:54:21.000Z",
      "summary_90w": "",
      "raw": "A spokesperson for Sharon Hodgson says the MP \"will not be deterred\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "738e1ad01919d21230b7d89153f5f8374034406b",
      "title": "Kids in the UK are hacking their own schools for dares and notoriety",
      "url": "https://techcrunch.com/2025/09/11/kids-in-the-uk-are-hacking-their-own-schools-for-dares-and-notoriety/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:42:14.000Z",
      "summary_90w": "",
      "raw": "Kids are making a mark in the U.K.'s cybersecurity arena, and not in the way their parents want them to.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d0781e20d908495e2b221e24156542f9ad354063",
      "title": "Box CEO Aaron Levie on AI’s ‘era of context’",
      "url": "https://techcrunch.com/2025/09/11/box-ceo-aaron-levie-on-ais-era-of-context/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T14:36:31.000Z",
      "summary_90w": "",
      "raw": "Box released a new set of AI tools at its Boxworks conference on Thursday, filling out CEO Aaron Levie's vision for an AI-led transformation of the enterprise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "99e13e57f9481e6dfef31e2dbd03d8c656813cfe",
      "title": "Apple’s faster MagSafe Charger can now charge other phones at 25W",
      "url": "https://www.theverge.com/news/776411/apple-magsafe-charger-qi2-2-wireless-charging-25w",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T14:36:20.000Z",
      "summary_90w": "",
      "raw": "Apple’s updated MagSafe Charger is priced the same as last year’s version. | Image: Apple\t\n\nApple introduced an updated version of its MagSafe charging puck a year ago that can wirelessly charge its then new iPhone 16 lineup at faster 25W rates. However, when used with other devices, including older iPhone models, charging rates were limited to 15W and slower. A new version of Apple’s MagSafe Charger is now available, and like the iPhone 17, 17 Pro, and 17 Pro Max, it now fully supports the Qi2.2 standard and can be used to charge other compatible devices (like the Google Pixel 10) at 25W rates, as spotted by MacRumors and 9to5Mac.\nThe new charger, which was first leaked last June through Taiwan’s National Communications Commission’s website, is now available through Apple’s online store with a 1-meter USB-C cable for $39, or a 2-meter cable for $49. \nApple introduced 25W wireless charging with the iPhone 16 ahead of the Qi2.2 specification being officially introduced early this year, which is why the faster rate was only available when using Apple’s own wireless charger. Now that the iPhone 17 lineup is Qi 2.2 compatible (as will most of the iPhone 16 lineup be once iOS 26 is released) the phones can be powered up at 25W rates using any wireless charger that supports Qi2.2. However, if you’re upgrading to the iPhone Air, you’re only going to see a maximum of 20W rates when charging wirelessly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d44fcfb5fd8ac4ff9880441a191585cb3e5c3ebf",
      "title": "EU divisions over Gaza hit Eurovision as Ireland pulls out",
      "url": "https://www.theguardian.com/tv-and-radio/2025/sep/11/rte-says-ireland-will-not-be-part-of-eurovision-2026-if-israel-participates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T14:35:22.000Z",
      "summary_90w": "",
      "raw": "Ireland’s national broadcaster joins Slovenia’s in making participation next year conditional amid Israel’s war in Gaza\nIreland’s national broadcaster, RTÉ, has decided not to take part in next year’s Eurovision song contest if Israel is a participant.\nRTÉ is the second of 37 broadcasters who took part in the event this year to have made participation next year conditional.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26729002e1e5dd88918f78e60c92523080673ab5",
      "title": "See Kathmandu's destroyed and barricaded streets after violence",
      "url": "https://www.bbc.com/news/videos/cwy9jrdg4qro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T14:32:18.000Z",
      "summary_90w": "",
      "raw": "There's an intense military presence on the Nepali capital's streets, says the BBC's Samira Hussain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26729002e1e5dd88918f78e60c92523080673ab5",
      "title": "Watch: See Nepal capital's destroyed and barricaded streets after violence",
      "url": "https://www.bbc.com/news/videos/cwy9jrdg4qro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T14:32:18.000Z",
      "summary_90w": "",
      "raw": "There's an intense military presence on the Nepali capital's streets, says the BBC's Samira Hussain.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "22f2cd525d433952c51090d02f78b41a77e434b0",
      "title": "Europe’s far-right leaders attack ‘hate-mongering left’ after Charlie Kirk murder",
      "url": "https://www.theguardian.com/us-news/2025/sep/11/europe-far-right-leaders-charlie-kirk-shooting-turning-point-usa",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T14:30:26.000Z",
      "summary_90w": "",
      "raw": "Viktor Orbán claims death of Turning Point USA’s founder was ‘result of international hate campaign’ as prominent figures pay tribute\n\n‘What have we become?’: shock across US political parties after shooting\n\nCharlie Kirk shooting – latest updates\n\nEuropean far-right leaders have lauded Charlie Kirk, the influential 31-year-old conservative US activist who was fatally shot on Wednesday, with several also claiming his death was a consequence of violent leftwing rhetoric.\nThe European parliament briefly descended into chaos as far-right MEPs demanded a minute’s silence to honour Kirk, a rising star of Trump’s Maga movement, who was hit in the neck by a single bullet as he addressed students at Utah Valley University.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83f1b85cf32a53a9e5240783b240bfe58f505453",
      "title": "I tested a bunch of gaming laptops and these are the best",
      "url": "https://www.theverge.com/22295181/best-gaming-laptop",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Gaming laptops come in various shapes and sizes, though many of the heavy hitters remain thick and beefy machines that maximize cooling to get the most out of their powerful chips. Most are awash in RGB lighting and edgy designs geared towards capital-G Gamers, but there are also thinner, lighter options that are more portable and less showy. \nOur go-to recommendation that checks the boxes for most people is, and has been for a while, the Asus ROG Zephyrus G14. It’s a gaming laptop that doesn’t forget the “laptop” part. The G14 is a versatile machine for both play and work, and it travels exceptionally well.\nOther great, though pricey, recommendations include the big and heavy Asus ROG Strix Scar and Lenovo Legion Pro 7i, or the Razer Blade 16 for lots of graphics power in a thin and sleek design.\nThe most important part of any gaming laptop, just like desktop PCs, is the graphics card. Laptop GPUs can’t stack up to full-size cards that reach much higher wattage in desktops, but that doesn’t stop the likes of Nvidia from making things a little confusing with the naming scheme on its RTX brand of GeForce cards. So keep in mind that, for example, an RTX 5090 laptop card doesn’t come anywhere near the performance of a desktop 5090. Desktops may always win out in raw performance, but gaming laptops are a simpler turnkey solution that can easily go places (yes, even the ones that feel like you’re toting around a cinderblock). \nEven more confusing: the same GPU in one laptop may not perform as well in another if it’s throttled by thermal constraints. We try to test a wide range of gaming laptops, as well as regular laptops, and these are the ones we confidently recommend.\n\n\n\n\n\nThe best gaming laptops\nThe most powerful gaming laptop\nThe best mid-to-high-tier gaming laptops for most people\nThe best budget gaming laptop\nA sleek 16-inch gaming laptop\nThe best convertible gaming laptop\nWhat’s next\n\nThe best gaming laptops\nCPU: AMD Ryzen 9 270, HX 370 / GPU: Nvidia GeForce RTX 5060, RTX 5070, RTX 5070 Ti, RTX 5080 / RAM: 16GB, 32GB / Storage: 1TB / Display: 14-inch OLED, 2880 x 1800, 120Hz, 500 nits / Dimensions: 12.24 x 8.66 x 0.63 to 0.64 inches / Battery: 73Whr / Weight: 3.31 pounds\nAsus’s ROG Zephyrus G14 has been a favorite among Verge staffers for years now, and it remains our go-to pick for its balance of power and portability. It can be your full-time gaming machine as well as your commuter-friendly everyday laptop. Asus redesigned it in 2024 and toned down its more playful aesthetics for a sleeker, refined look, and for 2025 it just got a modest chip bump with RTX 50-series graphics and the ability to charge via USB-C on either side (but you still need to use its proprietary charger for max wattage). \nIt now starts at $1,799.99 instead of $1,699.99. But you get a little more for your extra money since even the base Zephyrus G14 comes with a lovely, high-res OLED display capable of a 120Hz refresh rate, and it still has a great keyboard and trackpad. Games play well on high settings, though due to the thin chassis, the G14 — and even its 16-inch sibling, the Zephyrus G16 — are known to get a little hot to the touch, and their fans are quite noisy.\nZephyrus laptops are never going to offer quite the same performance as much thicker models, like the Asus ROG Strix or other chunkers running equivalent GPUs — they just don’t have as much thermal headroom. But if you want a jack-of-all-trades notebook that puts gaming at the forefront, the G14 (or G16, if you want to go bigger and have the budget) is unlikely to steer you wrong.\nThe most powerful gaming laptop\nMSI Titan 18 HX AI (2025)\n\n\nScore: 7\n\nProsCons\n\n\nTop-tier gaming performance in a laptop\n4K Mini LED screen is massive, looks great, and gets very bright\nMechanical keyboard is loud but feels awesome to type on\n\nAstronomically expensive\nBattery drains very fast, even during regular tasks\nFans get loud\n120Hz refresh is half the speed of cheaper laptops with 2.5K OLEDs\n\n\n\nWhere to Buy:\n\n $5799.99 $4999 at Amazon (RTX 5090)\n $5799.99 $5449 at MSI (RTX 5090)\n\nCPU: Intel Core Ultra 9 285HX  / GPU: Nvidia Geforce RTX 5090 / RAM: 64GB, 96GB / Storage: 6TB / Display: 18-inch Mini LED 4K (3840 x 2400), 120Hz display, 1,000 nits, 100 percent DCI-P3 / Dimensions: 15.9 x 12.08 x 1.26 inches / Battery: 99.9Whr / Weight: 7.93 pounds\nThe MSI Titan is your pick if budget isn’t a concern. It starts at a ridiculous $5,799.99 with Intel’s flagship Core Ultra 9 285HX CPU and Nvidia’s most powerful GPU, the RTX 5090. The Titan pairs its punchy hardware with a massive 18-inch 4K / 120Hz Mini LED screen that gets incredibly bright, along with 64GB of RAM and a 6TB SSD.\nIt’s loaded with RGB (including an illuminated haptic trackpad), a mechanical keyboard by SteelSeries, five USB ports (two of which are Thunderbolt 5), and a four-speaker / dual-woofer sound setup. It can tackle most games you throw at it on ultra settings. The screen may not be as fast as other laptops with 2.5K / 240Hz panels, but 4K at 18 inches looks so crisp. You have to pay out the nose for this no-holds-barred experience, but the nearly eight-pound behemoth is about as powerful as laptops get right now.\nIn the past, our choice for this tier of laptop was Asus’s ROG Strix Scar 17 using one of AMD’s X3D chips. That model was especially unique since it was significantly cheaper (under $4,000). \nThe best mid-to-high-tier gaming laptops for most people\nAsus ROG Strix Scar 16 (2025, RTX 5080)\n\n\nScore: 8\n\nProsCons\n\n\nGreat graphics performance in the latest high-end games\nLots of ports and easy access to RAM / SSDs\nAnimated lid and wraparound RGB are fun\nVery good QHD / 240Hz Mini LED screen\n\nTypical gaming laptop issues (pricey, hefty, and not great battery life)\nCompetition offers OLED screens\nCustomizing lid animations is a pain\n\n\n\nWhere to Buy:\n\n $3299.99 $3029.99 at Walmart\n $3299.99 at Asus\n\nCPU: Intel Core Ultra 9 275HX / GPU: Nvidia GeForce RTX 5080 / RAM: 32GB / Storage:  2TB / Display: 16-inch Mini LED 2560 x 1600, 240Hz display / Dimensions: 13.94 x 10.55 x 0.9 to 1.21 inches / Battery: 90Whr  Weight: 6.17 pounds\nYou don’t have to spend Titan money to land somewhere in the ballpark of excellent gaming performance. There are a few great options in the mid-to-high tier of gaming laptops, sporting RTX 5080 graphics (or the RTX 5070 Ti if you need to save a bit more). My top pick is the Asus ROG Strix Scar 16, followed closely by the Lenovo Legion Pro 7i.\nLenovo Legion Pro 7i (16-inch, Intel)\n\n\nScore: 8\n\nProsCons\n\n\nGreat performance at 2.5K and even at 4K on an external monitor\nBeautiful OLED screen\nOne of the best keyboards in this class of gaming laptops\n\nNo face or fingerprint unlock\nNumpad makes things slightly cramped, with off-center trackpad\nLenovo’s apps are slightly more invasive with notifications than others\n\n\n\nWhere to Buy:\n\n $3559.99 $2969.99 at Best Buy (RTX 5080, 1TB SSD)\n $3499 at B&H Photo (RTX 5080, 2TB SSD)\n $3559.99 at Lenovo (RTX 5080, 1TB SSD)\n\nThe 16-inch ROG Strix Scar is decked out with a wraparound RGB light bar that creates a colorful underglow and a dot-matrix LED lid for adorning fun illuminated animations. The Strix Scar’s game performance is exceptional, with its RTX 5080 nearly matching the 5090 in the much thinner Razer Blade 16 — and for $1,200 less.\nThe Lenovo Legion Pro 7i is a similarly specced 16-incher, offering the same CPU and GPU in a better, metallic build. It’s got its share of RGB lighting, but it’s done a little more tastefully than the Asus. Meanwhile, the Strix Scar’s 2.5K / 240Hz screen is a Mini LED display that’s bright, colorful, and visually pleasing. It matches the resolution and refresh rate of the OLED on Lenovo’s Legion Pro 7i, but the OLED on the Lenovo is even better, with a punchier look. \nIt’s a bit of a toss-up between these two: the Lenovo has the better screen and build quality, yet it lacks face or fingerprint unlocking. But the Asus is $200 cheaper, and I prefer the trackpad and better key spacing of its numpad-less design. You can’t go wrong here, so picking one based on small nuances like that or just whatever you can get a deal on is fair.\nThe best budget gaming laptop\nHP Victus 15 (2025, RTX 4050)\n\n\n\nProsCons\n\n\nGood pricing\nAMD or Intel CPU options\nRTX 4050 is fine for 1080p gaming\n\n16:9 aspect ratio is outdated\nNot a ton of ports, and only one of them is USB-C\n\n\n\nWhere to Buy:\n\n $699 $1049.99 at Walmart (Intel)\n $899.99 at Best Buy (AMD)\n\nCPU: AMD Ryzen 7 7445HS, Intel Core i5-13420H / GPU: Nvidia GeForce RTX 4050 / RAM: 16GB / Storage: 512GB / Display: 15.6-inch IPS, 1920 x 1080, 144Hz, no touch option / Dimensions: 14.09 x 10.04 x 0.93 / Battery: 70Wh  Weight: 5.06 pounds\nOur previous pick among budget gaming laptops was the HP Victus 15 with an RTX 3050 GPU, which cost around $800 in 2022 when it wasn’t on a steep sale for less. It had a 60Hz screen and just 8GB of RAM, which feels a little paltry for gaming on Windows 11 in 2025. Now, you can get the same chassis with a 1080p / 144Hz screen, a newer RTX 4050 GPU, and either AMD Ryzen 7 7000-series or Intel 13th-Gen CPU for around $850 to $900.\nNvidia announced its RTX 5050 laptop GPU in June, which is set to slowly trickle out into new laptops for about $999. We’ll have to see how that stacks up in future testing.\nThe Victus isn’t going to wow you with the best screen or highest-quality components for a keyboard or trackpad, but it does emphasize a solid graphics card in an affordable package. It’s the kind of laptop that will excel with live service games like Minecraft or Fortnite, as well as indie titles. Just don’t expect high or ultra settings on the latest AAA games. With the right expectations, a more inexpensive gaming laptop like the Victus can treat you well.\nA sleek 16-inch gaming laptop\nRazer Blade 16 (2025, RTX 5090)\n\n\nScore: 7\n\nProsCons\n\n\nGreat fit, finish, and build\nSlim and sleek design for a gaming laptop\nExcellent OLED screen comes standard\nVery good performance, especially in DLSS 4 supported games\n\nStarts expensive and gets expensive-er\nMiddling battery life\nThinness aside, minimal improvements over last year’s model\nA cheaper 5080 laptop may be money better spent\nThe matte black finish smudges easily, and the Razer lid logo is still a little cringe\n\n\n\nWhere to Buy:\n\n $2399.99 $1999.99 at Razer (RTX 5060)\n $2799.99 $2399.99 at Razer (RTX 5070)\n $3499.99 at Razer (RTX 5080)\n\nCPU: AMD Ryzen AI 9 365, Ryzen AI 9 HX 370 / GPU: Nvidia Geforce RTX 5060, 5070, RTX 5070 Ti, RTX 5080, RTX 5090 / RAM: 16GB, 32GB, 64GB / Storage: 1TB, 2TB, 4TB / Display: 16-inch OLED, 2560 x 1600, 240Hz / Dimensions: 13.98 x 9.86 x 0.59 to 0.69 inches / Battery: 90Wh / Weight: 4.71 pounds\nThe Razer Blade 16 has long been touted as the MacBook Pro for gamers, and after thickening up for a few years, it’s back to an ultra-thin chassis without much compromise to performance. It’s flush with ports, has a great keyboard and massive trackpad, and its AMD chips can be paired with a variety of Nvidia GeForce RTX GPU — ranging from the 5060 for $2,399.99 to the top-tier 5090 for a much steeper $4,499.99. The high-end model is hard to find right now, but we still recommend any configuration you can afford.\nThe Blade sports a lovely 16-inch OLED display with 2560 x 1600 resolution and 240Hz refresh, even for the entry-level configuration. The look of its stealthy matte black design and green Razer logo may not be to everyone’s liking, but pair that with its thinness, and you’ve got something that can travel and blend in almost anywhere.\nI tested the RTX 5090 version in our review, and while it’s impressive, it can be a little hard to justify spending $4,500 without getting the maximum capabilities of that flagship GPU, since the Blade 16’s thinness throttles the 5090. But it’s such a nice overall package if you want your gaming laptop to do it all. The Blade also comes in 14- and 18-inch sizes, but I think the 16 is the sweet spot.\nRead our Razer Blade 16 (2025) review.\nThe best convertible gaming laptop\nAsus ROG Flow Z13 (2025)\n\n\nScore: 8\n\nProsCons\n\n\nImpressive game performance for an iGPU on a tablet\n\nCapable 2.5K performance\n\nLaptop-quality keyboard and trackpad\n\nBattery can get through a day of work (with no gaming breaks)\n\nPlay games on your lap without heating up your legs\n\nExcellent kickstand\n\nStill a pricey, niche device\n\nWish the keyboard cover had Bluetooth like the latest Surface Pro\n\nPower / sleep button is too flush\n\nNo auto-brightness\n\nKeyboard case sometimes not detected after waking from sleep\n\nSingle-zone keyboard RGB looks basic\n\n\n\nWhere to Buy:\n\n $2099.99 at Asus\n $2399.99 at Best Buy\n\nCPU: AMD Ryzen AI Max 390, Ryzen AI Max Plus 395 / GPU: Integrated / RAM: 32GB, 64GB, 128GB / Storage: 1TB SSD / Display: 13.4-inch IPS, 2560 x 1600, 180Hz, touchscreen / Dimensions: 11.81 x 8.03 x 0.51 to 0.59 inches / Battery: 70Whr Weight: 2.65 pounds\nAsus’s ROG Flow Z13 gaming tablet has always been a niche device, but the latest generation with AMD’s new Strix Halo APU is the best version yet. That’s right, Asus switched from a discrete GPU to integrated graphics, but surprisingly, the chunky “Surface Pro for gamers” is actually better for it.\nIt may sound a little reckless to spend $2,100 or more on a gaming tablet, but the Z13 and its new Ryzen AI Max chip offer enough graphical prowess to make most games look great on its 2560 x 1600 / 180Hz IPS display. And it even has the battery chops to squeak through an eight-hour work day, making it an impressive multi-purpose device.\nA regular clamshell laptop may make more logical sense for most people, but the ROG Flow’s form factor just makes it kinda fun. Being able to remove the keyboard entirely allows you to comfortably plop it on your lap and game away without feeling like you’re going to set your legs on fire. And if you’re a mechanical keyboard nerd like me, you can connect your favorite board without the bottom half of a laptop in your way (this is surprisingly useful for using the Z13 as a second screen below a big monitor.\nRead our Asus ROG Flow Z13 (2025) review.\nWhat’s next\nLenovo announced its upcoming Legion Pro 7 gaming laptop at IFA. The machine’s base configuration costs $2,399, but it can be configured with an AMD Ryzen 9955HX3D processor and Nvidia’s GeForce RTX 5080 graphics card, which will increase its gaming performance — and its price.\nAcer also introduced its new slate of gaming laptops at IFA 2025. Its high-end Predator Helios 18P has a 4K display and starts at 4,999 euros (US pricing and availability haven’t been announced). Its premium configuration features an Intel Core Ultra 9 825HX processor and an Nvidia RTX 5090 GPU. The laptop has a proprietary power port, two Thunderbolt 5 ports, an HDMI 2.1 port, a full-sized SD card slot, an ethernet port, and a 3.5mm audio jack.\nAcer’s entry-level Nitro V16 gaming laptop will launch in October and starts at $999.99. The slightly upgraded Nitro V 16S will be released in November and starts at $1,099.99 (it’s a little thinner and lighter than the Nitro V 16, but has the same assortment of ports). The starting configuration of both machines feature a 1920 x 1200 display, but you can upgrade to a 2560 x 1600 panel. You can spec either laptop with up to an Intel 270H processor and Nvidia RTX 5070 GPU. They feature one Thunderbolt 4 port, three USB-A ports, one HDMI 2.1 port, a microSD card slot, an ethernet port, a power port, and a 3.5mm audio jack. \nMonica Chin and Joanna Nelius also contributed to previous versions of this buying guide.\nUpdate, September 11th: Adjusted pricing and availability. Added information about Lenovo’s Legion Pro 7  laptop, and Acer’s upcoming gaming laptops announced at IFA 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b2cbdc6c5db509650c7406015a32092d11b2fb14",
      "title": "Why does Apple think three lenses are eight lenses?",
      "url": "https://www.theverge.com/iphone/776253/apple-event-iphone-17-pro-air-cameras-lenses-cropping-marketing",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T14:30:00.000Z",
      "summary_90w": "",
      "raw": "How many lenses do you see?\t\n\nApple always makes big claims about the cameras in its new iPhones. But what does it actually mean when Apple says the iPhone 17 Pro's three rear cameras are equivalent to \"eight pro lenses in your pocket\" and that the iPhone Air's one rear camera is equivalent to four lenses? \nThe super-thin iPhone Air only has one camera on its rear: a 48-megapixel sensor with a 26mm-equivalent f/1.6 lens. It's the same as the main camera of the regular iPhone 17 (which also features a second 0.5x ultrawide camera). The 17 Pro and Pro Max have a similar-but-not-the-same main camera, consisting of a 48MP sensor and 24mm-equivalent f/1.78 lens - and it also …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c191b4f8c934d4282d46e258fecbd1e02ef08693",
      "title": "After Charlie Kirk’s killing, MAGA influencers call for violence",
      "url": "https://www.theverge.com/politics/776293/charlie-kirk-maga-influencer-violence",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T14:14:01.000Z",
      "summary_90w": "",
      "raw": "Within minutes of the news that right-wing youth activist Charlie Kirk had been shot on a college campus in Utah, the first accusations began to fly across MAGA social media: someone on the left must have been responsible for this.\nWithin hours of the confirmation of his death, rage began pouring out. \"Congratulations. You have now made a radical out of me,\" tweeted Ryan Fournier, a right-wing activist formerly associated with Kirk's group, Turning Point USA. \"You fuckers deserve it.\"\nWithin minutes of reports that the FBI had apprehended a suspect, The Daily Wire's Matt Walsh tweeted his desire for justice: \"Thank God. Now punish him in t …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Charlie Kirk: Conservative influencer who rallied a youth movement",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T14:04:15.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Conservative influencer who rallied a youth movement",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T14:04:15.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77477d7dc276cd7d434ee6c90e555e4e8b5eb745",
      "title": "Farage faces questions over who funded £885,000 Clacton constituency home",
      "url": "https://www.bbc.com/news/articles/ce845w70g0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T14:03:55.000Z",
      "summary_90w": "",
      "raw": "A BBC investigation raises questions about how the Reform UK leader's partner paid for a home in his constituency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0882630daba4b9fa425a628fe24da84a569f3318",
      "title": "Sierra CEO Bret Taylor on why the AI bubble feels like the dotcom boom",
      "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/773904/sierra-ceo-bret-taylor-ai-agents-openai-bubble-interview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-11T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Welcome to Decoder. This is Alex Heath. For my final episode as your Thursday guest host, I recently sat down with Bret Taylor, the CEO of AI startup Sierra and the chairman of OpenAI, for a live event in San Francisco, California, hosted by Alix Partners. \nVery few people have seen the tech industry up close like Bret has. He was an early engineer at Google before starting FriendFeed, a social network he sold to Facebook in 2009, where he then served as chief technology officer. He later founded Quip, which he sold to Salesforce.\nAfter eventually becoming co-CEO of Salesforce, he left to start Sierra, which is rethinking how businesses use AI for customer support. Along the way, he led Twitter’s board during Elon Musk’s takeover and became chairman of the OpenAI board after the firing and rehiring of CEO Sam Altman.\nAs you’ll hear in our conversation, Bret is all in on AI. Just this week, Sierra raised a new round of funding, valuing it at $10 billion. In this episode, we get into Sierra’s origins and what it’s doing with AI agents. I also asked Bret about OpenAI and the overall trajectory of the AI industry. We covered a lot of ground, and I hope you find Bret’s perspective as fascinating as I do.\nOkay, here’s my conversation with Bret Taylor:\n\n\nThis interview has been lightly edited for length and clarity. \nSo I hope people here are familiar with Decoder. I’ve been guest-hosting over the summer. Nilay Patel, our editor-in-chief, has been out on parental leave, and I’m very happy to be here talking with Bret. Thanks for being on the show.\nThank you for having me.\nI would like to start by going back to early 2023. You’re leaving Salesforce, you were the co-CEO. Talk about that process of deciding to make a new company and what you looked at. Why did you land on Sierra at that time?\nI happened to announce I was leaving Salesforce within a few days of ChatGPT coming out. I don’t know if you believe in cosmic forces. But like for every single human being, particularly a geek like me, who first uses a product like that, it’s all I could think about. \nSo I was honestly not 100 percent sure what I wanted to do when I left Salesforce. I was trying to leave and then figure it out, which is a good thing to do in life. And I immediately just became obsessed with the technology. I was using it personally. [LinkedIn cofounder] Reid Hoffman is a friend of mine, and he was showing me early versions of GPT-4, and I just couldn’t believe the level of empathy and how it just truly sounded human. I had been following AI for years, but honestly, if you had told me in October [2023] or the month before to define what a large language model was, I would’ve given you a blank stare.\nI ended up realizing that this technology, which I had not been following as closely as I wish I had been, was really going to change the world. I knew I wanted to work in it. I didn’t know what I wanted to do, but that was okay. It reminded me a little bit of when I first discovered the internet, and I think everyone knew it was going to change everything. At least I felt that way, and I was excited to work in that space, and that’s all I knew. \nI ended up having lunch with Clay Bavor, whom I’d known for 20 years and was not planning to start a company with, but I found out through the course of the lunch that he was equally obsessed. He was working for [Google CEO] Sundar Pichai at the time, and by the end of lunch, we had had a couple of more courses than we had originally planned.\nWe had decided to start a company, and we had no idea what we were going to do, but I think it was really based on the premise that when you have a seismic shift in technology, a lot of business opportunities present themselves, because it kind of shuffles the deck of what consumers want, what companies need, and what software vendors have the resources to support that need.\nIf you look at the advent of the internet, it gave birth to some of the largest names in the stock market today, like Amazon and Google. It disrupted companies like Microsoft, which got through it quite strong. It disrupted companies like Siebel Systems, which emerged a little bit less strong. So you end up where the incumbent insurgent dynamic changes quite a bit, and huge markets open up. In the case of the internet, it was search and e-commerce. \nI think with large language models, and we will probably talk about that more as I have given too long-winded of an answer here, it really stands to reason that a lot of different markets, from software engineering to customer service, are going to be completely transformed and upended. What an interesting time to start a company.\nSo, we left and gave ourselves a few months of just recovering from our jobs and then talked to a lot of customers and decided to build Sierra. At Sierra, we’re building AI agents for customer experiences. Everyone from ADT home security to Ramp in New York to SiriusXM are using agents to answer the phone when you call them up, or in their digital properties, or just to have a conversation — they’re doing everything from helping you upgrade or downgrade your SiriusXM plan to calling you when your ADT alarm goes off, which I think is pretty exciting.\nTalk to me about Sierra and how you work practically with a new customer. Walk me through that process, because this is all a very new field. I mean, customer support is not new, but the way you’re doing it is new. So what is unique about how you work with a customer versus how you would’ve done it at another company before?\nI’ll start with our business model, because I think it will help to answer your question. One of the things that we do differently at Sierra from traditional software companies is we charge only for outcomes. So for most of our customers, that means when the AI agent autonomously resolves the case that the customer called about or chatted in about, there’s a fee for that. If the AI agent has to transfer to a real person, it’s free.\nWe really like this as a business model, and I think it will become the standard business model for agents because the word “agent” comes from the word “agency,” and the principle of it implies some degree of autonomy. I think most of the most sophisticated agents will actually start and complete a task, whether it’s generating a new lead for your sales team or solving a customer service inquiry or doing a legal analysis for an antitrust review, whatever it might be.\nIf an AI agent isn’t only helping a person become more productive but is actually accomplishing a task, why not just pay for a job well done? If you look at most of your companies, if you have a job where the outcome is measurable, like sales, you tend to pay a commission, right? There’s not just a salary. So I think agents sort of being paid on commission, if you will, is not only a great incentive alignment between a vendor and a partner and a company but also just feels right from first principles. That’s why I think it will be just like the advent of cloud-based software. When Mark [Benioff] and Parker [Harris] started Salesforce, and it was a subscription-based service rather than a perpetual license, it changed the landscape of software; the same will happen with agents.\nNow going back to how we work with customers, it raises the question of what the relationship is between a software vendor and a company if you get paid only when it works. There’s a certain degree of arm’s-length relationship that most software vendors have with their customers. If you’ve ever seen someone who’s done a big ERP implementation, I don’t know much about ERP systems, but apparently, they’re really hard to execute because for everyone I’ve ever met who’s done one, it’s taken two years longer than expected and cost a lot more money than expected. \nIf you go and talk to the 10,000 people involved in one of those projects, the systems integrator points to the software vendor. The software vendor points to the systems integrator. No one’s really pointing at the company, because the company is the one paying the bills. So everyone’s like, “Oh, you’re great. No, I’m sure everything’s fine.” And it’s like success has a thousand fathers, but failure is an orphan. Part of the issue is the only party in that relationship that cares about the outcome is the company.\nSo everyone’s blaming everyone else, and it requires a good CIO or CTO to navigate that, but you can see all the perverse incentives involved. Maybe the partner’s getting paid by the hour; that’s not a great incentive. The software vendor’s already made the sale, so good luck to you in getting it successfully deployed. \nI think going toward outcome-based pricing demands a different relationship between a software company and the companies it works with. I think it’s trendy right now in AI, in part for this reason. No software company wants to be a professional services firm. So you can’t turn that knob all the way up to 11 and build a company that I think you want to build. But there is a different level of accountability.\nSo in our relationship with our customers, we’ve really focused on a couple of different things. One is product usability. I think to make your outcome, you need to make it as easy as possible to achieve that outcome. We’re somewhat unparalleled in the market in having a product for technology teams as well as a product for operations teams. You can build agents without any technical knowledge at all. Again, we’re trying to empower as many customer experience professionals as possible. And then on the partnership side, we have a lot of support with what we call agent development. So if you need help getting your agent out the door, we show up in a bus to help you do it. That’s unique. \nI’m not sure how everything will play out, but I’m really bought into this vision. When I talk to our customers, I love the idea that they know exactly the value that we’re providing for them because they pay us only when the agent works. I just love the simplicity of that relationship, and I’m really bought into it.\nSo you have hundreds of customers, and 50 percent have revenue over $1 billion, and 20 percent have revenue over $10 billion a year. Is that right?\nThat’s correct.\nWhy focus on customers like that instead of taking a huge Shopify-like approach to this? Why are you going toward the big companies?\nBig companies have big problems. I love first principles thinking, and if you are a large consumer brand and you have 100 million consumers around the globe, before large language models, you could not have had a conversation with all of them. If you just do the math, there’s a phrase in call centers called cost per contact, and it essentially measures how much all-in labor and technology costs to answer the phone or answer the chat. It really depends on how complex the conversation is, and the qualifications of the person answering the phone. It depends on whether it’s onshore or offshore. \nBut say it costs somewhere between $10 and $20 to answer the phone. For most consumer brands, their average revenue per user is less than that phone call. So you literally can’t afford to have a conversation. It’s why if you’ve ever tried to call any consumer brand, you’ll find you can’t.\nThere’s entire websites devoted to finding the phone numbers for many consumer brands. It’s not because they don’t care about you. It’s just not economical. If everyone who wanted to call them called them, they would go out of business, which is probably not good for you either. Now with large language models, that’s totally different. You bring down the cost of a phone call by not one but two orders of magnitude, and all of a sudden the economics of having a conversation change dramatically.\nSo the reason we’ve pursued larger enterprise brands is that’s the type of step-change function in customer experience that is relevant to a company that has tens of millions or hundreds of millions of customers. Those are the larger companies in the world. What’s really exciting is, I think for a lot of people, when they think about AI agents for customer experience, they think contact-center automation, and that’s a huge part of it.\nBut if you think about it through the lens of what I just said, you can now have an order or two orders of magnitude more conversations with your customers than you could before, for the same cost. And that’s really remarkable. And if you think about all the companies that are competing for whether it’s, let’s say, a mobile phone company, you’re competing for a fixed pie of customers trying to decide which company to align themselves with. And if you can improve customer attention by 100 basis points, that’s a lot of value. If you can reduce your attrition and churn by 500 basis points, that changes the lifetime value equation of your company.\nSo I think people are thinking about it. I think it is really the first-order effect of reducing the cost of a phone call, which is great; you can save that money and return it to shareholders. But I think the more sophisticated companies are asking, “Can I actually gain market share?” And that’s really, really exciting, and that’s what we’re trying to do for some of the largest brands in the world.\nDo you have agents right now that are doing things for customers without human involvement? I’m talking like beyond a chatbot, but actually doing things that have economics tied to it, or that would be something you would think a human would be involved in but is actually not. Is there an example of this right now?\nI’ll give a few. We have retailers for whom you can submit a photo of your damaged goods and immediately adjudicate a warranty claim, and it’ll connect to the inventory system and ship you a new product. You can refinance your home with an AI agent powered on our platform end to end.\nWithout a human in the loop?\nWithout a human in the loop. These agents are remarkable at what they’re doing, and you can take action with an agent built on the Sierra platform — 100 percent of our customers are doing it. To some degree, there’s this technique in AI called retrieval augmented generation, which is a fancy way of saying it’s answering questions. It turns out that that’s kind of a commodity at this point. Slapping ChatGPT together with a knowledge base is not that hard. Most engineers nowadays could do that in a weekend, which by the way is mind-blowing. It was science fiction three years ago; now it’s a weekend project. Welcome to technology. It’s mind-blowing. \nActually, being able to put sophisticated guardrails around a regulated process… We work in the health-insurance payer industry, we work in the provider space, we work with banks, we work with property and casualty insurance companies. If you’re talking about sophisticated, regulated conversations like claims processing, that’s not retrieval augmented generation, right? That’s a very complex conversation with regulatory oversight. How do you put AI-based guardrails around it? How do you put deterministic-based guardrails around it? How do you solve the mundane problems of transcription accuracy in 40-plus languages?\nIt turns out transcription accuracy doesn’t really matter if it misses the word “and” or “or,” but it really matters if it’s your account number. So how do you get the hard parts? We do roadside assistance, and it turns out if you’ve ever chatted with an AI agent and a car horn honks, it’ll often stop talking because it thinks it’s being interrupted, because it can’t distinguish the difference between a car horn and you talking.\nOur platform is really designed to solve those problems: effective guardrails, multilingual conversations over chat and voice, deterministic guardrails, AI-based guardrails, which are called supervisor models — and are really, really effective and interesting. And simple stuff like knowing, “Hey, that’s the television in the background, no one’s talking right now,” or “That’s a car horn, someone’s not interrupting me.” It turns out that I’m sure in three or four years, that’ll be easy. Right now, it’s really hard, which is why we have a lot of demand for our product.\nI’m glad you brought up voice. I’d be curious to hear how voice is entering this mix beyond chat, and do you think voice will actually be a bigger piece of the pie for agents than text?\nI do. Voice is already a bigger part of our platform than text, which is kind of remarkable, because we launched it in November of last year. I think it stems from a couple of reasons. One is, first, I’ll just go to the human parts of it. I mean, if you watch movies about computers in the future, or science fiction authors’ vision of the future, you’re usually talking to a computer. I think it is the most ergonomic interface. We’re all born with it. We all know how to talk. As a consequence, I think it’s quite low friction, it’s quite accessible. We talk a lot about the digital divide, and I think if most of the ways you interact with digital technology is just speaking, what a great way to make it accessible to everyone, especially if it’s multilingual and patient.\nIf you look at the telecommunications industry, the health-insurance industry, and things like that, a lot of customer service still goes over the phone. It’s not just as patients or consumers but providers to payers. A lot of this is still running over the phone. And what AI has done is it’s taken one of the oldest analog channels, which is the publicly switched telephone network, and made it digital for the first time. It used to be that almost every company I talked to had a digital self-service team, which is a fancy way of saying, “Hey, can you please use our website rather than calling us, because gosh, it’d be better for you, and it’s better for us. It’s cheaper. It’s faster.” And there’s entire teams devoted to that. Now it’s like, “Maybe call us. It’s all good. It turns out the same agent on our website is picking up the phone,” which is kind of crazy.\nYou always talk about TCP/IP, which is like TCP running over the internet protocol. There’s some name for this. We’ve basically put the internet on the phone; we’ve just made the phone a channel for digital technology for the first time. And so as a consequence, if you look at… There’s a proverb in entrepreneurialism that says, “You want to make a painkiller, not a vitamin,” because people buy painkillers and people think about buying vitamins. \nThis is truly a painkiller. You’ve just taken the most expensive, the most tedious, channel — and everyone hates it too, by the way, even if you talk to the best customer service agent of all time on the phone, it’s usually after you’ve been waiting on hold for 10 minutes. Because the economics of making a call center where customers don’t have to wait on hold are just untenable.\nSo it’s just one of those things where consumers, companies, there’s no one defending the current landscape of phone calls at all. Everyone hates it on all sides, and now you have this technology that just solves the problem. So that’s why I think it’s going to have a big impact. But looking forward, it’s really unclear. I’m kind of in the center of a lot of this AI stuff, and I couldn’t tell you where the world is going, but I think it is really exciting. If you look at the way WhatsApp is used in Brazil and India, you wonder with conversational agents whether that style of digital interaction will be as pervasive in other markets.\nI was blown away when I went to Brazil, I don’t know, four years ago and saw someone do a mortgage over WhatsApp. I was like, “Tell me what you’re doing.” And it’s like uploading the PDF. All of a sudden, if you think about every company in the world’s customer experience having a conversational agent, then maybe every company in the world will have a WhatsApp presence to do that, or maybe smart speakers will make a comeback.\nI think about driving into work and CarPlay. I love the product in a lot of ways, but you can’t really do anything with it. Imagine triaging your email, having a conversation with a personal agent while you’re driving into work, and all of a sudden your commute just got super productive. It’d be like talking to a personal assistant with a PhD in everything. I mean, that’s pretty cool. So I think that’s exciting. We talk about phones, because I do think it is the area that is just economically impactful. Right now, we’re making computers conversational, and I think it is a user-interface paradigm as much as a technical change. And I’ve never felt sold.\nThe other day I was talking on the phone like this. For people online, I’m touching the phone to the side of my face, which until this moment I thought was normal. My kid was like, “You’re touching your phone to your face?” It would be like someone licking their phone or something. All kids just talk on the phone differently. I never thought of that as abnormal until that moment. And then I thought, “I’m fucking old.” \nYou realize that I just think that kids who grew up with these technologies who never saw a rotary dial, they just have a different style of interaction with these new technologies. Younger kids today are going to grow up in a world where of course computers can understand what I say when I talk to them with nuance and sarcasm, and of course I have a personal AI agent that can go do my research for me for my next trip. \nI think we are not even contemplating the second and third order effects that led to my child thinking that touching a phone to the side of my face was weird, which just still boggles my mind. But I think we’re at the start of a really significant trend, and I’m hopeful in a lot of ways because I, like many others, read things like The Anxious Generation, and I catch myself being mildly addicted to staring at the glowing screen in my pocket. You wonder if you fast-forward four or five years, will software melt away into the background? Will a lot of things that are tedious, like waiting on hold and not being able to find a phone number, will this technology make all that go away? \n“Yeah, call us anytime.” Oh, and it knows everything about me and whether I want to talk to it over chat because I’m on the BART train and I don’t want people to hear me, or I want to talk on the phone because I am holding things in my hands. All of that will just be available.\nSo I’m excited for it because I think like with all technology trends, we’re on the bottom rung of Maslow’s hierarchy of needs, and it’s very hard to see self-realization, or whatever the top is, but I think we’re going to get there relatively quickly. Our hope at Sierra is that we can help every company in the world navigate that. Step one is to create an amazing customer service experience for your customers that makes them feel respected and valued, and is truly personalized. Step two is to set up your company for whatever the future holds. What does conversational commerce mean? What does it mean when people are doing their consumer research on OpenAI rather than search engines?\nI’m sure many of you have done that, when, for example, you get a lab result. I just upload it into ChatGPT immediately before I talk to my doctor, and I don’t know how he feels about that. But I promise you 100 percent of his other patients are doing that too. The whole world’s changing. So a lot of what we think about at Sierra is how do we set up every company in the world to be successful in that new world?\nTechnically, though, are you developing your own models? What is the actual tech secret sauce here that you have? Is it models, or something else?\nWe do a lot of fine-tuning. We don’t pretrain any models. I think most applied AI companies shouldn’t. It’s a very fast-appreciating asset, and probably would not produce a meaningful return for your shareholders, but it is quite complex. For any given message to one of the agents on our platform, that’s probably 20-plus inference calls just to generate one response. Just to give you a sense of the complexity, there are lots of different models under the hood. There’s not one provider or even one parameter count, which is a measure of the complexity of these models.\nI think that’s where the world is going for an applied AI company like Sierra, because it’s almost like saying, “What’s the right way to store my data?” And for the technologists in the room, there’s a trillion different databases and data storage systems from Snowflake and Databricks to traditional transactional databases. We’ve gotten to the point now where a modern technologist would know, “Hey, for this use case, this is the correct choice.”\nThat’s where I think we’re going in the applied AI space, not artificial general intelligence but in the applied AI space, where these models are truly pieces of infrastructure, and sometimes you want something that is really fast, and sometimes you want something that’s really cheap, and sometimes you want something that’s really high-quality. And with this price-performance or latency choice, there’s really an option everywhere in that matrix for whatever you want for your business. \nI think it will end up like the database market. It will be the practitioners of building these agents and other things. They’re not going to be the researchers who know how to pretrain a model. My intuition, for what it’s worth, is that even fine-tuning will wane over time just as the context of windows and the quality of rules adherence improves in these models. But what it will mean to build an application on these models will be like saying, “Hey, do you know how to use a database?” Not “do you know how to write a database?” Those are two very different skill sets today, and I think that’s kind of where the applied AI market is going.\nI think we saw with the release of GPT-5 that the models are still getting better, but the step changes are not as dramatic as they used to be. Maybe that will change as the space moves faster?\nI don’t totally agree with you on this one, but finish your question because I’m rudely interrupting.\nNor should you agree; you’re on the board of OpenAI. But I guess what I’m saying is, do you agree with the thesis that the models themselves are becoming commodified? I mean, you talked about it as infrastructure, but I guess what I’m getting at is, what are the second-order effects, if that is true? If the models are really just becoming anything plug and play, yes, they have certain attributes that are better, but they’re not dramatically step-function changing like they used to.\nWell, the reason I was disagreeing wasn’t about being an OpenAI homer, which I am by the way. So happy to play that role. Actually, it’s more just saying, I think it really depends on the task. If anyone was using GPT-4.0 or 4.1 for coding and then swapped in GPT-5 for coding afterward, you saw a dramatic improvement in performance.\nSo through the lens of that task, it was very much a step change in performance. And so for people who are using this for coding agents, I think through the lens of that use case, what you said was definitely not true. There was absolutely a step change in performance. I planned one of our vacations on ChatGPT earlier this year, and I think I was using 4.0 to do it. And my guess, if I’d used GPT-5 for that same trip planning, it would’ve been like, yeah, okay, it’s whatever, slightly better. I had a great vacation, so maybe I just didn’t have high enough standards. Maybe it would’ve gotten a lot better.\nI think that we’re getting to the point that for a lot of tasks, we’ve reached sufficient intelligence. So when new models come out, if you’re measuring it relative to planning my vacation, you’d be like, “Gosh, I don’t see a huge change in the quality of this model.” If you’re trying to discover a new therapy and you’re doing drug discovery, or you’re trying to autonomously write a complex piece of software, or you’re trying to do a complex asynchronous agentic task, your perspective on how big of a step change there was may change. So my intuition, but it’s just one person’s intuition, is that perception of how big of a step change these models bring will increasingly be a function of how complex of a problem you’re trying to solve with them.\nIf you think about what it means to build artificial general intelligence, we need some more improvements, right? There was a really interesting thread on X from an OpenAI researcher [Sebastien Bubeck] who gave it a math paper, and it actually had a relatively novel approach for a type of math I don’t understand. So that’s the limit of what I can say about that, but it was really interesting. It was really creative. It really had that sort of almost alpha go moment of like, “Wow, that’s interesting. It’s sort of novel new mathematics.” Certainly, if we want to get to the point of developing new AI research, finding new drug therapies, proving some of the unproven math problems in the world, we have some work to do. We haven’t gotten to that point. \nBut my guess for what motivated your comment, probably for a big bunch of tasks, the models have sort of gotten to the point of sufficiency. So going back to your question, which is, what does it mean? I think OpenAI is a mission-driven company. Our mission is to ensure that artificial general intelligence benefits humanity, and we want to work toward beneficial AGI, and we’re not there yet. We need to continue to do that research and development. There are parts of it that are already superintelligent, but there are a lot that aren’t. That’s really what we’re working on.\nDoes it mean that for different tasks that Sierra solves, or that you do in your personal life, we need those really powerful models? Maybe not, and I think that will just result in an ecosystem of models and what they’re used for. But what’s exciting, just around here in San Francisco, is we’re not done yet. We want to create AGI, and that’s really exciting. I think despite the perception of these models slowing down, I don’t really subscribe to it. You can see in some of the true research breakthroughs, the Math Olympiad results — I mean, these are really meaningful new changes that weren’t possible with previous models, and I think they’re dang exciting.\nI’m glad you brought up AGI. I am increasingly of the opinion that no one knows what AGI means, but I think as the chairman of OpenAI, it actually really matters what you think AGI means. I would love to know what AGI means, and I would love to know what you think it means, and if that has changed at all for you, especially in the last year or so. Do you have a sense of “this is AGI,” and when we achieve this, we have hit it?\nFirst of all, I’ll answer the last question, which is, has it changed? Yes, it has changed for me. I think we are already at what I would’ve defined AGI as three years ago. Actually, by the way, I think we’re already at what almost anyone in the world would have defined AGI as three years ago. There’s this thing called the Turing test, which I think, actually, I don’t know what the original one was in the paper, but the way it was taught to me in computer science was having a conversation with an AI and having it be basically indistinguishable from a human conversation. We’ve been past that for years. This was a big thing in AI for a long time. We passed that and yeah, just forget the Turing test. That was a dumb idea made by the smartest computer scientist of all time.\nSo we just keep on moving the goalposts, because we have exceeded our own collective expectations about what this technology can do so many times that what we had intuitively thought of as AGI, we’ve lapped it four or five times. The way I think about it now — and it may change again — is that in the domain of digital technology and ideas, are these models exceeding human intelligence or at human intelligence in almost all domains? I say that in the digital domain of ideas because I think it’s one thing to invent new types of math, which I think a lot of people would put in the domain of AGI and superintelligence. But interacting with the physical world is a whole different thing. I think that’s a separate problem that’s unrelated to intelligence per se. Just being concrete about it. You can invent a new therapy, but a clinical trial is a completely independent process. So I think the intelligence part of it is really what I was trying to find a measure of.\nThe other part of the G in AGI is generalization. So one of the things that I don’t believe, but I’ve talked to a lot of researchers — and that’s what’s interesting about AI, some of the smartest people don’t agree on all these things — if you make something that is really, really good at math, the question is how good will it be at a lot of other things? You’ll talk to some researchers who think, “Well, math is sort of the basis of reasoning, and it will be great at a lot of things.” You talk to other people who wonder, “I don’t know, will it generalize to different parts of biology and other things like that?”\nSo I am more in the camp of thinking that as long as the model isn’t trained for something like the Math Olympiad and is a byproduct of the model, it will generalize. But I think we’ll have to see. I think we’ll see how it generalizes to other forms of science and things like that. But more and more, just looking at the rate of progress and seeing some of the results coming out of OpenAI and the other research labs, I’m more optimistic, and I’m looking forward to the first true scientific breakthrough to come from an AGI. I think it will happen in the next couple of years. I don’t know. But it feels as if it will. It’s a better question for the researchers at OpenAI than me. But certainly, if you start to see some of these early results, it certainly feels possible.\nWhy are people like your old boss Mark Zuckerberg now talking about superintelligence? What is the difference there? I mean, this is a thing when you’re out here in Silicon Valley and San Francisco, now people are saying superintelligence. It’s like, well, is it because everyone is kind of like, “Well, we did it,” shrug, “We passed the Turing test?”\n[Laughs] It’s a rebrand, yeah.\nYeah, rebrand. What is the difference? I don’t really understand, to be honest.\nSuperintelligence, I think, literally just means that it is more intelligent than humans. So I guess if there’s a subtle distinction, it’s if you made something that was generally intelligent and functioned as well as you and me, is that now lackluster? No offense, Alex, by the way. I think it would be great if we made it. You’re sufficiently intelligent for me.\nSo I think it’s a higher bar that is truly exceptional. There’s a few reasons from a research and safety standpoint. It’s useful to talk about superintelligence because it’s a reminder that if the models exceed your own capacity to reason, how do you monitor them? How do you make them safe? You really have to use technology to monitor the technology if it exceeds your own capacity to do so. There’s lots of precedent in non-AI things. You have lots of things in an airplane or a car that are monitoring for things you can’t understand or are operating too fast, but that is a really important area of research.\nSo I think it’s useful to talk about. There’s the public relations part of it that I don’t really have an opinion on or care to think about, but it’s useful when you think about safety. There’s a real question of how do you know that it’s aligned if you can’t understand it? How important is it that a human being understand it versus a supervisor AI that we made to understand it? There’s a lot of both technical and philosophical questions that I think are really important to answer as we develop.\nI was at a recent dinner with Sam, Sam Altman. This dinner got a lot of headlines because Sam said that he thinks we’re in an AI bubble. His exact quote was, “Someone is going to lose a phenomenal amount of money. We don’t know who. And a lot of people are going to make a phenomenal amount of money.” \nIt’s like the old marketing quote.\nYeah?\nOnly 50 percent of my marketing is useful.\nWhich one?\nI just don’t know which 50, yeah.\nRight. Do you agree with that? And if so, why?\nOh, absolutely, yes. I’ve given this analogy before, so I apologize, Alex, if you’ve heard it, but I think there’s a lot of parallels to the internet bubble. If you look at the internet bubble, a lot of people think about the flops, like Pets.com and Webvan. Through the lens of the past 30 years, though, we’ve now gotten most of the largest companies in the world, including Amazon and Google, two of the largest companies in the world. But then you look at how much of Microsoft’s market cap is from Cloud and others, and you start to look and you say, “Actually, if you look at the GDP of the world, how much has actually been created or influenced by the existence of the internet?” One could argue that all the people in 1999 were kind of right. It was as impactful on pretty much every measure.\nEven things like Webvan, there’s now, as the internet became more distributed, really healthy businesses like Instacart and DoorDash and others that were built now that the smartphone and the scale of the internet has matured. So even some of the specific ideas were actually not that bad, but maybe a little early.\nBut if you look at the internet, if you were an Amazon shareholder from its IPO to now, you’re looking pretty good. If you’re a Webvan shareholder, you might feel a little differently. So both exist at the same time, and I think right now you have modern large language models and modern AI that are absolutely going to have a huge impact on the economy, if you just look at software engineering and customer service by themselves. \nI mean, we haven’t seen a world in which we’ve reached a sufficient number of software engineers, and we probably will with coding agents, just because we’ve taken something scarce and we’re making it more plentiful. What is the market for developing software? I don’t know. I mean, I don’t even know how to measure that because every company in the world is now a software company to some degree.\nSo as a consequence, I think just for me, it almost has to be that there’s going to be huge winners in this. Because of the amount of economic opportunity, you just end up with a ton of investors, and some companies will fail and some will succeed. If you look at the people who built out fiber in the early days of the internet, a lot of them went bankrupt, but that fiber ended up getting used, just by the next person or the private equity firm or whatever entity bought it. \nI think it is both true that AI will transform the economy, and I think it will, like the internet, create huge amounts of economic value in the future. I think we’re also in a bubble, and a lot of people will lose a lot of money. I think both are absolutely true at the same time, and there’s a lot of historical precedent for both of those things being true at the same time.\nDoes it worry you at all that the bubble could be in the sector of AI you’re in, in the enterprise? There was that MIT report that everyone’s been talking about where a lot of spend [on AI] is not seeing results. I know you have a different pricing model that’s more geared toward success. But I don’t know, it seems like the bubble could be all the enterprises that have rushed in and spent a ton of money on stuff that’s not working. What happens when that reverses?\nI’ll decouple whether I worry about it from that study, which I disagree with. Because I do worry about it, but I don’t worry about that study, so I’ll decouple the two. So I’ll end with the study, because it’s more optimistic than me worrying about my existential issues around my business. But I’ll start with that.\nYeah, I mean it’s weird. So there’s this story that goes on around me about rewriting Google Maps, and it’s mostly true and a little embellished like many great stories are. And it’s interesting to me because people like to tell the story because they’re like, “Oh, wow, one person wrote a lot of software over a weekend.” And now if you’ve used Codex or Cloud Code, you’re like, “Yeah, I can just have an AI agent do that over a weekend.”\nSo it’s like the thing that’s so exciting, that was actually part of my own personal identity is now an AI agent. Maybe not quite yet. I wrote some pretty good code. But probably in a couple of years, yeah, an AI agent could totally do that. So it’s going to go from, “Wow, that was impressive,” to “Wow people did that?” over the next couple of years.\nThere’s the business thing, which is what is the software market of the future? I think it’s a really good question, because if you pull the thread… And we reach plateaus, like self-driving cars, we’re really excited. It took a long time. So even smart people can be wrong on these things or too overoptimistic, but with agents doing software engineering, we’re taking the scarcest resource and one of the highest-paying jobs and we’re literally making AI agents that do that. So what will that do? I have a lot of people ask, “Should I study computer science in school?” I have a bunch of opinions. I think the answer’s yes, but honestly no one really knows.\nAre we going to reach a world where generating software — and generating’s not the hardest part of software as most software people know — will largely become a commodity? Maybe. A lot of people think that. What does that do to the software market? My hypothesis is actually it doesn’t change it a lot. I don’t think when you buy an ERP system — going back to my ERP; I don’t know why ERP systems are on my mind this morning — you’re not buying the bits and bytes that did it. You’re buying the fact that a lot of companies have their ledger on it and that you can close your books every quarter on it and it’s reliable, and there’s a patch to the servers so that you know that your cloud-based ERP is not going to have a security vulnerability, and the system has these compliance certifications and all these other things that aren’t particularly exciting, but they’re kind of the boring but important part of enterprise software.\nIf you could write your own ERP system as a major CPG [consumer packaged goods] company, is that a good idea? I’m not totally convinced it is. I always like to say software’s like a lawn, you have to tend to it. And so if you build it, you bought it, right? You have to own it and maintain it and deal with all of it. There’s a new accounting standard that comes out, and all of a sudden you have to do that yourself. So I think it will change the way we write software. Do I think it will completely upend the landscape of the existence of an enterprise software market? I don’t totally believe that. Might be wrong.\nIt’s really new. We’re just in a really new world because we’re taking something scarce and making it plentiful. I have thought about this movie a lot recently, and I recommend people watch it, which is Hidden Figures. It’s a great movie about putting people on the moon, but it focuses particularly on the women who did the math calculations to do it, and they were called  computers. I’m a computer. I didn’t know that until that movie, and I watched it with my kids, that that was a job title.\nIt’s interesting. One of the women in there, they’re putting in an IBM computer, which is the size of a living room, and she in a sort of a savvy way learns how to use punch cards to program it, basically for job security. We’re all kind of going through these moments right now. Like I’m a computer, a calculator, basically. And that story of me with Google Maps is like a story of a computer or calculator, right? But I think the second and the third order effects are a little fuzzy. I believe the enterprise software market will change from software to agents, but I believe companies want to buy solutions to their problems and not build software. So I believe the market will continue to exist.\nOn that study, I don’t know the basis for the data. I think it was problematic because it conflated people building their own software with AI and buying solutions off the shelf. I think those are two very different types of AI adoption. We have basically a 100 percent success rate with our customers doing a proof of concept and going live with our platform. And I think it’s because we’re not selling AI, we’re selling customer experience, and you just turn it on and it works.\nThere’s an amazing company called Harvey somewhere here in San Francisco. I actually don’t know where it’s headquartered, but it’s a really great company. I’ve talked to so many law firms who’ve deployed Harvey for a lot of their legal analyses and they’re all successful, but it’s not an AI project. Like Harvey uses AI. That’s the only reason the company can exist, but it’s doing it because you want a better antitrust review process, and that’s what they’re buying from it.\nI think we’re just in the early days of AI, where there isn’t yet a wonderful vendor for every problem that you have in your business. So as a consequence, you either have to wait, or you have to build it yourself. And so I don’t know what the right answer is. And when you’re trying to build these things yourself, it’s just a glacial amount of complexity. And what you end up having is a lot of these, I call it AI tourism, like a lot of people doing performative AI projects, but to actually go to that last mile is quite difficult. I think the solution will be applied AI companies. I think if you want to build a better customer experience, buy Sierra. If you want a legal AI agent, buy Harvey.\nI think we need to go through every use case, from supply chain optimization to accounting to maybe an auditor for your accounting department. All of those will be AI agents, but I think there’s a company in every single one of those domains. And I think that is the correct way to package and purchase AI software. I think that study is a measure of all the people who are trying to… which is just a lack of maturity in the market. There’s just not a solution to every space yet. But there’s a few VCs in the room, and hopefully thanks to all of you, in a couple of years there will be. And I think that will be the new what was software as a service, those new agent companies will be that next frontier of business solutions for enterprises.\nAll right, Bret, we have to leave it there. Thank you so much.\nThanks for having me.\nQuestions or comments about this episode? Hit us up at decoder@theverge.com. We really do read every email!",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d5cc6f6575996d78c10f8014bcd73c40c1765571",
      "title": "South African court rules that men can take wife's surname",
      "url": "https://www.bbc.com/news/articles/cm2z351l6jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T13:52:14.000Z",
      "summary_90w": "",
      "raw": "The highest court rules that a law barring men from taking the surnames of their wives is a \"colonial import\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5def6ee298b3fa16f2e1e455a572e77b4674969",
      "title": "The rise and fall of Mandelson: Labour's political fixer and 'Trump whisperer'",
      "url": "https://www.bbc.com/news/articles/cr4q61y399xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:41:07.000Z",
      "summary_90w": "",
      "raw": "For 40 years the wily operator made himself indispensable to successive Labour leaders - but has also caused them headaches.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bfa75b4d29d10ea67aa0504577b94aced12588f",
      "title": "Why did Starmer take the risk of appointing Peter Mandelson?",
      "url": "https://www.bbc.com/news/articles/cjd1egrlj0mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:16:37.000Z",
      "summary_90w": "",
      "raw": "Many Labour MPs think the prime minister should have seen the Mandelson scandal coming a mile off, writes Joe Pike.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fe2417ad71c0b41f0e0f72386beccf674277209",
      "title": "How the Charlie Kirk shooting unfolded",
      "url": "https://www.bbc.com/news/videos/ckg3xp9g9zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T13:11:35.000Z",
      "summary_90w": "",
      "raw": "The conservative activist and influential Trump ally was shot and killed while speaking at Utah Valley University.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fe2417ad71c0b41f0e0f72386beccf674277209",
      "title": "Watch: Videos show how Charlie Kirk shooting unfolded",
      "url": "https://www.bbc.com/news/videos/ckg3xp9g9zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:11:35.000Z",
      "summary_90w": "",
      "raw": "The conservative activist and influential Trump ally was shot and killed while speaking at Utah Valley University.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93f9e4e35c079cc81f9ed79d1a766024accb6f63",
      "title": "Doctors warn hospitals under pressure as NHS waiting lists rise",
      "url": "https://www.bbc.com/news/articles/c3dr52l1j3yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T13:01:27.000Z",
      "summary_90w": "",
      "raw": "The waiting list for planned hospital treatment in England rose for the second month in a row in July to its highest level since March.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0343f569d8a34eefaf497a0bce755d17c32ea4b1",
      "title": "How Bill Gates’s fellowship program is adapting to global uncertainty",
      "url": "https://techcrunch.com/2025/09/11/how-bill-gatess-fellowship-program-is-adapting-to-global-uncertainty/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T13:00:00.000Z",
      "summary_90w": "",
      "raw": "As Breakthrough Energy Fellows welcomes a new cohort of 22 startups, it is also diversifying its portfolio to include more global founders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b464178e670e89ba3af772e61b1aa82cf19364f5",
      "title": "Inflation climbs in August as grocery and gas prices jump",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537074/inflation-economy-grocery-gas-federal-reserve",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T12:58:18.000Z",
      "summary_90w": "",
      "raw": "Inflation accelerated in August as Americans paid more for gasoline and groceries. Over the last 12 months, consumer prices have risen 2.9%.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "41d65e7ba810de79dadc5468f134738b3bbfeb0e",
      "title": "A figure on the roof and a single bullet - what we know about Charlie Kirk shooting",
      "url": "https://www.bbc.com/news/articles/cy04p4x21e5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T12:53:41.000Z",
      "summary_90w": "",
      "raw": "Details of the attack in Utah are still unclear, but a large manhunt is under way for the shooter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e396c6973341565876f3f45646fe39cdb6842ca4",
      "title": "Apple’s new live translation feature for AirPods won’t be available in the EU at launch",
      "url": "https://techcrunch.com/2025/09/11/apples-new-live-translation-feature-for-airpods-wont-be-available-in-the-eu-at-launch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T12:53:03.000Z",
      "summary_90w": "",
      "raw": "On its official page detailing the features available on iOS 26, the company said EU residents or those with EU Apple IDs won't be able to use live translation, which is powered by Apple Intelligence and will also be coming to AirPods 4 and AirPods Pro 2.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e6a1ad8093d6d1b87a9f7f68b8c9f80e681ad468",
      "title": "Zambia presses China for more compensation over toxic mine spill",
      "url": "https://www.bbc.com/news/articles/cwy9j8xqq2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T12:45:39.000Z",
      "summary_90w": "",
      "raw": "Zambia's Vice-President Mutale Nalumango says the compensation offered to communities \"may not be all\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d65d4b64c9de1829f4f49c0e1b4e893a5716ee6",
      "title": "NPR's next news chief built an international career at CNN",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5536569/npr-thomas-evans-news-editor-in-chief",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T12:31:09.000Z",
      "summary_90w": "",
      "raw": "NPR has promoted Thomas Evans, its editorial review chief, to lead the newsroom through a period of change, following Congress' decision to end federal funding of public media.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86dc765b650a7b118c8207debe68282841d06125",
      "title": "John Lewis losses nearly triple to £88m",
      "url": "https://www.bbc.com/news/articles/cx2jm4pgejjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T12:12:21.000Z",
      "summary_90w": "",
      "raw": "The owner of the eponymous department store and Waitrose expects the business to return to profit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9e0f0f9be9d18adf3539d8d7dbaf512aaa56cdc",
      "title": "U.K. fires its ambassador to Washington over emails to Jeffrey Epstein",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537814/jeffrey-epstein-uk-ambassador-mandelson",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T12:01:07.000Z",
      "summary_90w": "",
      "raw": "In one email, Peter Mandelson wrote to Jeffrey Epstein, \"I think the world of you and I feel hopeless and furious about what has happened.\" In another note, he called Epstein his \"best pal.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "100b5151ee8f0d9dba9021960fc6985a2d0f9510",
      "title": "France suspects foreign intelligence over pigs heads left outside mosques",
      "url": "https://www.bbc.com/news/articles/cx25414vg7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T11:53:28.000Z",
      "summary_90w": "",
      "raw": "Foreign nationals are blamed for the incident, which has striking similarities with other recent provocations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea0ce9e7fc0ac37a3179f63f5a6f72cb960f9fbd",
      "title": "Hundreds of South Koreans arrested in a U.S. immigration raid are being sent home",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537811/south-koreans-arrested-immigration-us-raid-sent-home",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T11:50:19.000Z",
      "summary_90w": "",
      "raw": "U.S. immigration authorities are preparing to send more than 300 South Korean workers home on a chartered flight from Atlanta, a week after detaining them for allegedly working illegally.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9e925106ef910af1d2ba971b8ab041833153c09a",
      "title": "Southport killer didn't look human, says teenager stabbed in attack",
      "url": "https://www.bbc.com/news/articles/cn0ry8dy320o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T11:49:09.000Z",
      "summary_90w": "",
      "raw": "A 14-year-old girl who survived the attacks tells an inquiry the memories are \"like a horror film\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6cf767c0006db0950d943038c16e6cb069ae7ebf",
      "title": "Scientists link hundreds of severe heat waves to fossil fuel producers' pollution",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5534484/oil-companies-heat-waves-climate",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T11:05:00.000Z",
      "summary_90w": "",
      "raw": "A new study finds dozens of heat waves would be \"virtually impossible\" without the activity of major fossil fuel producers, including oil companies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fe8e1e2ed8a5fc2a45ce74be7321706be6531d0",
      "title": "Israeli strikes in Yemen kill 35 people, Houthis say",
      "url": "https://www.bbc.com/news/articles/c179e5v552ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T11:00:49.000Z",
      "summary_90w": "",
      "raw": "The Israeli military says it hit military targets, but the Houthis say only civilian sites were targeted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36ace78fcd6ec5616654a82f8ba8e390fcf9111e",
      "title": "Love, drugs and condoms: Couples with different HIV status face a new reality",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/11/g-s1-77007/hiv-condoms-hiv-positive-u-s-aid-cuts",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T10:56:59.000Z",
      "summary_90w": "",
      "raw": "They're called \"serodiscordant\" couples. One is HIV positive, the other negative. Aid from the U.S. enabled them to obtain medicines and condoms for protection — until this year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "690e37473af8a9f23d78eb228fb514da9d4e64d8",
      "title": "The latest on the shooting death of right-wing activist Charlie Kirk",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5537295/the-latest-on-the-shooting-death-of-right-wing-activist-charlie-kirk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T10:56:21.000Z",
      "summary_90w": "",
      "raw": "Charlie Kirk, a right-wing activist and Trump ally, died after a shooting at an outdoor speaking event in Utah on Wednesday. Officials are still looking for the shooter. NPR reports on the latest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a73b1a7a487a931881d61f173ada46175d7d3f8e",
      "title": "Charlie Kirk shooter remains at large. And, 9/11 families still seek justice",
      "url": "https://www.npr.org/2025/09/11/g-s1-88105/up-first-newsletter-charlie-kirk-9-11-russia-poland-drones",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-11T10:54:03.000Z",
      "summary_90w": "",
      "raw": "Right-wing activist Charlie Kirk has died at 31. He was shot at a college campus speaking event. And, two people who lost their fathers during 9/11 share differing views on seeking justice.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f43dbb8fe07397a438f6fdbff379942aa2485bd",
      "title": "Nasa bans Chinese nationals from working on its space programmes",
      "url": "https://www.bbc.com/news/articles/c9wd5qpekkvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T10:34:01.000Z",
      "summary_90w": "",
      "raw": "Earlier this month, Chinese nationals working with Nasa suddenly found themselves denied access.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d32b258091a54f2e05acf348fc1d85fb96bfa600",
      "title": "'Everyone hit the deck and scattered': Witnesses describe moment of Utah shooting",
      "url": "https://www.bbc.com/news/articles/c8d7900yl3zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T10:09:04.000Z",
      "summary_90w": "",
      "raw": "Witnesses describe screaming and running to flee the scene after hearing the fatal gunshot that killed Kirk.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Lab results confusing? Some patients use AI to interpret them, for better or worse",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e6327aa960c4171c1cb87602f8b02cba1b3cff34",
      "title": "Barker and Thornberry pull out of deputy Labour leader race",
      "url": "https://www.bbc.com/news/articles/cg7dzejkz4ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T09:51:10.000Z",
      "summary_90w": "",
      "raw": "The remaining candidates have to get support from 80 MPs by 17:00 on Thursday to progress in the contest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5170f156c540e02e967333d70e6a01d27bc130c",
      "title": "Donald Trump's UK state visit is next week - this is what we know",
      "url": "https://www.bbc.com/news/articles/c8rynvlm6zjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T09:44:35.000Z",
      "summary_90w": "",
      "raw": "US President Donald Trump and his wife Melania will carry out their second UK state visit in September.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80e4723e4b6d67c498758a596bc2382c16d543ae",
      "title": "Bali's worst floods in a decade kill 14",
      "url": "https://www.bbc.com/news/articles/c9dx5jyqz97o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T09:01:07.000Z",
      "summary_90w": "",
      "raw": "Authorities say the flash floods on the popular island were caused by heavy rainfall.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02e1f5a7f25678fb6dd1f6dcc569528ad3d1cabc",
      "title": "After crafting quiet Florida life, Shah of Iran’s alleged ‘chief torturer’ must now face trial",
      "url": "https://www.theguardian.com/world/2025/sep/11/parviz-sabeti-shah-iran-lawsuit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T09:00:32.000Z",
      "summary_90w": "",
      "raw": "Parviz Sabeti crafted an anonymous new life for his family – but now he faces a $225m lawsuit for atrocities committed in prisons in Tehran and elsewhere\nNeighbors in the upscale Florida community of Windermere know them as Peter and Nancy, the seemingly friendly retired couple they wave to on morning walks, and who always appear to enjoy visits from their two high-flying grown daughters, one a respected professor of science at Harvard University.\nYet behind the high walls of their $3.6m lakefront mansion lies a darker, more closely guarded reality: “Peter” is actually Parviz Sabeti, the alleged head of secret police and chief torturer of the former Shah of Iran’s pre-revolutionary government, now facing a $225m lawsuit in Florida for atrocities committed in prisons in Tehran and elsewhere.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "139f262bc3987c2dbd95b84f9ffd659df4b52187",
      "title": "6 ways college students can get a better handle on their money",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5519357/the-broke-college-students-guide-to-managing-money",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For college students who don't have a lot of money, it can be tough to wrap your head around student loans, credit cards and a tight budget. A financial educator offers advice for first-year students.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "716d90a7a686c8315680cf405edb9d142faa4ecf",
      "title": "Tasmanian museum kept and displayed 177 human remains without families’ knowledge, report finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/tasmanian-museum-kept-and-displayed-177-human-remains-without-the-families-knowing-report-finds-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T08:14:26.000Z",
      "summary_90w": "",
      "raw": "University of Tasmania apologises, saying staff have met with families and will consider coroner’s findings\n\nGet our breaking news email, free app or daily news podcast\n\nHuman specimens were collected, and in some cases publicly displayed, by a museum for decades without the knowledge or consent of families.\nThe University of Tasmania’s RA Rodda Museum collected remains from coronial autopsies from 1966 to 1991 for teaching and research purposes.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92549df85c8f60d3f350d908ec5e12f9f729667d",
      "title": "Pocock says Bishop should be ‘reflecting on her position’ – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T07:59:08.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nJulie Bishop vows to stay on as ANU chancellor after vice-chancellor resigns amid leadership crisis\n\nGet our breaking news email, free app or daily news podcast\n\nSome images from the wild weather across Sydney and NSW\nAustralia raises travel advice level for Nepal as Nepalese Australians express grief over unrest\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4943cd65aaf6185ec871a259d73404af9f1aaa36",
      "title": "Ghana agrees to accept West Africans deported from US ",
      "url": "https://www.bbc.com/news/articles/c9v7m0pgv8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T07:12:28.000Z",
      "summary_90w": "",
      "raw": "Fourteen deportees including nationals of Nigeria and The Gambia have already arrived, President Mahama says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32d0450fd1ecf0a66e3dcf89d08614901ee10a35",
      "title": "Hong Kong criticised for rejecting bill giving ‘bare minimum’ rights to same-sex couples",
      "url": "https://www.theguardian.com/world/2025/sep/11/hong-kong-same-sex-couples-rights-bill-rejected",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T06:16:01.000Z",
      "summary_90w": "",
      "raw": "Legislative council voted down a bill that was introduced to comply with an order from the city’s top court\nHuman rights groups have accused the Hong Kong government of failing to provide the “bare minimum” of rights to same-sex couples after it rejected a bill that was introduced to comply with an order by the city’s top court.\nThe city’s unicameral legislative council (LegCo), on Wednesday rejected the bill by a vote of 71-14 after the second reading, following months of debate in the city between opponents who said it threatened family values and advocates who said the government was out of line with the majority of residents who supported same-sex relationships.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3e57be78ca1afae15e412add71be651d57c9302",
      "title": "Killing of Trump ally lays bare America's bloody and broken politics",
      "url": "https://www.bbc.com/news/articles/cm2z9z4m22ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T05:40:57.000Z",
      "summary_90w": "",
      "raw": "Charlie Kirk's killing is another episode of gun violence in America and the latest in a line of recent political violence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f005b7f3d7630c6b8ccd095e4b8f9a826a6f623f",
      "title": "Great North Run error medals listed for £5,000",
      "url": "https://www.bbc.com/news/articles/cderkx117rno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T05:17:27.000Z",
      "summary_90w": "",
      "raw": "Organisers are urging people to be wary of scams as some opt to sell the \"error\" medals for £5,000.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb9b2667cd236c606a32badb5c3fa63755fb13ef",
      "title": "A California bill that would regulate AI companion chatbots is close to becoming law",
      "url": "https://techcrunch.com/2025/09/10/a-california-bill-that-would-regulate-ai-companion-chatbots-is-close-to-becoming-law/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T05:10:51.000Z",
      "summary_90w": "",
      "raw": "If SB 243 is enacted, California would become the first state to require operators to implement safety protocols for AI companions and hold companies legally accountable if their chatbots fail to meet those standards.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7100762668b4d825976c57ac1afba991545e01b8",
      "title": "The Muslim women who defied tradition and changed lives with exercise",
      "url": "https://www.bbc.com/news/articles/ce397wpy338o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T05:05:35.000Z",
      "summary_90w": "",
      "raw": "Women from the Asian community describe how they are overcoming barriers to exercise.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e566eb7c4722f8556cd32601c0b0046354e9170",
      "title": "Flash floods in Indonesia leave at least 15 people dead and 10 missing",
      "url": "https://www.theguardian.com/world/2025/sep/11/flash-floods-indonesia-bali-deaths",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:58:57.000Z",
      "summary_90w": "",
      "raw": "Torrential rains cause flooding and landslides in East Nusa Tenggara province and on the tourist island of Bali\n\nFlooding in Bali, Indonesia – in pictures\n\nRescuers have recovered the bodies of 15 people who have died in flash flooding in two Indonesian provinces, while authorities said 10 others were missing.\nTorrential rains beginning on Monday caused flooding and landslides in East Nusa Tenggara province and on the island of Bali.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T04:42:58.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6255592ca0aa0b4c83b6393db826697a383395e0",
      "title": "Firms will hesitate to invest in US after raid - S Korea president",
      "url": "https://www.bbc.com/news/articles/cly0e4k750go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T04:32:01.000Z",
      "summary_90w": "",
      "raw": "More than 300 South Koreans who were arrested in the raid are due to return home on Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f62af97d9abdf6233d42244078b83c0e10cf8777",
      "title": "Perplexity reportedly raised $200M at $20B valuation",
      "url": "https://techcrunch.com/2025/09/10/perplexity-reportedly-raised-200m-at-20b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-11T03:59:10.000Z",
      "summary_90w": "",
      "raw": "The AI-powered search startup's valuation jumped from $18 billion two months earlier.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "025c8fc1c8160fbb07c6aeb2868cce25a0feae69",
      "title": "Feeling stressed? Here's five ways to manage it better",
      "url": "https://www.bbc.com/news/articles/cg42zq7nqxwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-11T00:30:06.000Z",
      "summary_90w": "",
      "raw": "Stress, in small doses, can be good for us. Here are five simple, science-backed ways to manage it better.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2508002d85ec34011ad48a2f2bad50d7eef8261",
      "title": "Fatal dam collapse: 'How do you restart from nothing?'",
      "url": "https://www.bbc.com/news/articles/c1kwepevkzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-11T00:10:25.000Z",
      "summary_90w": "",
      "raw": "Survivors of the flood tell the BBC they are still in need of government support.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4c0b57ef0ba4ad83b1ad673b9a082c5acc10855",
      "title": "TV cooking shows are dying out - the cronut holds the secret to why",
      "url": "https://www.bbc.com/news/articles/c0jq1d63l7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T23:17:52.000Z",
      "summary_90w": "",
      "raw": "The curious case of why the UK has fallen out of love with once-beloved 'chop and chat' food shows.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9434232e262d9b16fcaf7399776bb45549356463",
      "title": "How Syria's dictatorship used a global child welfare charity to 'disappear' children",
      "url": "https://www.bbc.com/news/articles/c4g53e4zdjpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T23:15:51.000Z",
      "summary_90w": "",
      "raw": "The Assad regime used an international charity to hide children of detainees from their families.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c5b9307d5b2cc39fe1973214edd71809a14c28",
      "title": "Mystery of dancing spiders' DNA could explain how they develop into new species",
      "url": "https://www.bbc.com/news/articles/c4gzl2zj72jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T23:00:20.000Z",
      "summary_90w": "",
      "raw": "There are many more species of peacock spider than other animals, scientists think they may know why.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57ce8bf756e4f328ac6e32ad22b8e1e712b2e460",
      "title": "Thinking Machines Lab wants to make AI models more consistent",
      "url": "https://techcrunch.com/2025/09/10/thinking-machines-lab-wants-to-make-ai-models-more-consistent/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T21:30:11.000Z",
      "summary_90w": "",
      "raw": "In a blog post shared Wednesday, Mira Murati's startup offered a rare glimpse into some of work its doing to improve AI models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef68cf68717ca35f3a60f509f239c9b4dc7cb4b5",
      "title": "Students flee as Charlie Kirk shot in front of crowd of hundreds",
      "url": "https://www.bbc.com/news/videos/c2ejgzyggpmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T21:20:58.000Z",
      "summary_90w": "",
      "raw": "Video from the campus in Utah shows how the event turned to chaos after a single shot rang out.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ef311f97f5ed8090c474813cb132b42592f748",
      "title": "How to turn off autoplay on your social media feeds",
      "url": "https://techcrunch.com/2025/09/10/how-to-turn-off-autoplay-on-your-social-media-feeds/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T21:02:52.000Z",
      "summary_90w": "",
      "raw": "Here's how you can turn off autoplaying videos and GIFs on Facebook, Instagram, X, Twitter, and Threads.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f685ce70e92f92303d88958421fbbea0ad357920",
      "title": "Putin and Netanyahu present twin challenges to Trump's diplomacy",
      "url": "https://www.bbc.com/news/articles/cvg9pnpqm2jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T19:44:52.000Z",
      "summary_90w": "",
      "raw": "Israel's strikes in Doha and the Russian drone incursion could present major affronts to his authority.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f669446916e1e964d117b5e69b0d08621f116518",
      "title": "Israeli airstrikes ‘killed any hope’ for hostages in Gaza, says Qatari prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:27:05.000Z",
      "summary_90w": "",
      "raw": "Mohammed bin Abdulrahman bin Jassim al-Thani calls for Benjamin Netanyahu to be ‘brought to justice’\nQatar’s prime minister has said that Benjamin Netanyahu “killed any hope” for the remaining hostages in Gaza following Israel’s extraordinary strike on Hamas negotiators in Doha on Tuesday.\nIn an interview with CNN on Wednesday, Mohammed bin Abdulrahman bin Jassim al-Thani called the deadly strike in the Qatari capital an act of “state terror”. Israel’s attack the previous day killed six members of Hamas who were negotiating a ceasefire deal brokered by the US and other Gulf countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4af0c3e7688c3503f00f63cc20194a1017b9ed51",
      "title": "While US stalls, Australia and Anduril move to put XL undersea vehicle into service",
      "url": "https://techcrunch.com/2025/09/10/while-u-s-stalls-australia-and-anduril-move-to-put-xl-undersea-vehicle-into-service/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:12:11.000Z",
      "summary_90w": "",
      "raw": "Anduril has landed a lucrative contract and is bringing its uncrewed undersea vehicle Ghost Shark to Australian waters next year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d48ceee8b5edf664df74d7365a4014b7c8e2a3a5",
      "title": "Klarna’s IPO pops, raising $1.4B, with Sequoia as the biggest winner",
      "url": "https://techcrunch.com/2025/09/10/klarnas-ipo-pops-raising-1-4b-with-sequoia-as-the-biggest-winner/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:11:44.000Z",
      "summary_90w": "",
      "raw": "Of the 34.3 million shares Klarna sold, only 5 million were sold by the company, it said. The rest were sold by existing investors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ea132f7941d86ace33277764e7c4ce89ca3e0e8",
      "title": "'Netanyahu, we're not leaving': Defiance in Gaza City as Israel shows aid sites planned for evacuees",
      "url": "https://www.bbc.com/news/articles/c0lkz0l4x51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T19:05:25.000Z",
      "summary_90w": "",
      "raw": "As Israel insists the whole population of Gaza City must leave, the BBC visits new aid sites the army claims will help them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c30d16306c0d90ee60df5323f815af9c45a84471",
      "title": "OpenAI and Oracle reportedly ink historic cloud computing deal",
      "url": "https://techcrunch.com/2025/09/10/openai-and-oracle-reportedly-ink-historic-cloud-computing-deal/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:00:34.000Z",
      "summary_90w": "",
      "raw": "OpenAI and Oracle reportedly signed a deal that includes OpenAI buying $300 billion of compute over a five-year span.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "13ea08e07d8c36122cf44bf22c52cea93e421323",
      "title": "Accidental or deliberate? Russia's drone incursion into Poland is a test for Nato",
      "url": "https://www.bbc.com/news/articles/clydk8821nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T18:56:48.000Z",
      "summary_90w": "",
      "raw": "Whether the drone incursion was deliberate or accidental, Moscow will be watching Nato's response to it closely.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0c530c0888212e92b4f6a6371a20c41c35dc20d",
      "title": "Anti-Islamic biker gang members hired to run security at controversial Gaza aid sites",
      "url": "https://www.theguardian.com/world/2025/sep/10/anti-islamic-biker-gang-infidels-mc-gaza-aid-sites",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T18:00:45.000Z",
      "summary_90w": "",
      "raw": "More than 10 Infidels MC members deployed to sites run by US- and Israeli-backed Gaza Humanitarian Foundation\nSenior members of an anti-Islamic biker gang have been hired by US contractors and deployed to Gaza to oversee security at food distribution sites backed by the US and Israeli governments, according to a BBC investigation.\nThe investigation found that more than 10 members of Infidels MC, a US biker gang that uses the Crusader cross as its symbol and whose members have anti-Islamic tattoos, have been hired by UG Solutions and deployed to food aid sites run by the Gaza Humanitarian Foundation. According to the BBC, seven members of the gang are in “senior positions overseeing [GHF] sites”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "45e47eeba17b40783853f42f78d97ee8b27c5e8d",
      "title": "YouTube’s multi-language audio feature for dubbing videos rolls out to all creators",
      "url": "https://techcrunch.com/2025/09/10/youtubes-multi-language-audio-feature-for-dubbing-videos-rolls-out-to-all-creators/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:58:32.000Z",
      "summary_90w": "",
      "raw": "YouTube's multi-language audio feature is rolling out to millions of creators, helping them reach a wider global audience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7aaa438c51bbedb99211b556db59356aa36effe5",
      "title": "TechCrunch Disrupt 2025: Full agenda reveal for the brand-new Going Public Stage",
      "url": "https://techcrunch.com/2025/09/10/techcrunch-disrupt-2025-first-full-agenda-reveal-for-the-brand-new-going-public-stage/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:45:35.000Z",
      "summary_90w": "",
      "raw": "We recently unveiled the Going Public Stage at TechCrunch Disrupt 2025 — a new destination for founders navigating the complexities of company building, from early traction to IPO and beyond.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e6823579d8dfe3f3e01dc8667e99f54f699d3e9",
      "title": "Arc gets its first major order for electric tugboats worth $160M",
      "url": "https://techcrunch.com/2025/09/10/arc-gets-its-first-major-order-for-electric-tugboats-worth-160m/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:43:09.000Z",
      "summary_90w": "",
      "raw": "Arc's boats have so far been all-electric, and the company's ambitious mission is to electrify all watercraft. The new tugs will largely operate on electric propulsion, with the motors putting out over 4,000 horsepower drawn from a massive 6 MWh battery onboard.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5808d2c2569fd1dea340c0064521b16d9e33f6a2",
      "title": "Meta adds new features to Community Notes fact checks, including alerts for corrected posts",
      "url": "https://techcrunch.com/2025/09/10/meta-adds-new-features-to-community-notes-fact-checks-including-alerts-for-corrected-posts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:33:21.000Z",
      "summary_90w": "",
      "raw": "Now users will be notified when they've interacted with a post on Facebook, Instagram, or Threads that receives a Community Note. Plus, anyone can now request a note or rate a note if it's been helpful to them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f941aa6a42dc26e2886df058363f237cb352f6c",
      "title": "Israeli military kills at least 41 people as it continues to order evacuation of Gaza City",
      "url": "https://www.theguardian.com/world/2025/sep/10/israeli-military-kills-at-least-people-as-it-continues-to-order-evacuation-of-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:45:26.000Z",
      "summary_90w": "",
      "raw": "Many of 1 million residents say they will not leave as they do not believe al-Mawasi humanitarian zone is safe\nThe Israeli military has killed at least 41 people in Gaza, including 12 aid seekers, over the last 24 hours as it continued to order the population of Gaza City to evacuate before its planned offensive.\nThe evacuation orders were accompanied by intensified Israeli bombing of the city, the Israeli military interspersing orders with announcements of high-rise towers they had bombed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac80bff6ea922455776c4e7a955e3e1fad7529fd",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "url": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:34:14.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Thousands of film workers join new boycott initiative criticized by Israeli producers’ group as ‘misguided’\nThousands of actors, directors and other film industry professionals have signed a new pledge vowing not to work with Israeli film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.\n“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” the pledge reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb68248c92c9258dd49995548514f71d695fcd25",
      "title": "Footage shows second claimed attack on Greta Thunberg Gaza flotilla",
      "url": "https://www.bbc.com/news/videos/cyv64eppj56o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T16:33:01.000Z",
      "summary_90w": "",
      "raw": "BBC Verify analyses footage of the suspected drone attacks and images of a device found after the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae06b5148592ea1fb379588d750f8d85b8fbb500",
      "title": "Emma Heming Willis talks about husband Bruce's diagnosis and care",
      "url": "https://www.bbc.com/news/videos/cp8j2v458z8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T16:31:23.000Z",
      "summary_90w": "",
      "raw": "The actor, well known for his roles in the Die Hard franchise, was diagnosed with frontotemporal dementia, a condition his family publicly disclosed in 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0f76ad215c1560219d8cc3921d269f7ef3a8809e",
      "title": "Cuba hit with fifth blackout in less than a year with 10m people in the dark",
      "url": "https://www.theguardian.com/world/2025/sep/10/cuba-electricity-power-blackout",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:28:09.000Z",
      "summary_90w": "",
      "raw": "Grid failure follows string of nationwide blackouts that plunged antiquated power system into near-total disarray\nEmergency crews were working to restore power to 10 million people on Wednesday as Cuba suffered its fifth nationwide blackout in under a year, the energy ministry announced.\n“There has been a total disconnection of the electric system,” the energy ministry and National Electric Union said early on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fdcf43bd41e1462082cf51354af827b1fd0ebe6",
      "title": "Trump asks EU to impose tariffs of up to 100% on India and China",
      "url": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:59:45.000Z",
      "summary_90w": "",
      "raw": "In effort to end Russia’s war in Ukraine, US president proposes tariffs targeting Putin allies and trade partners\n\nBusiness live – latest updates\n\nEurope live – latest updates\n\nDonald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine.\nThe US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to a White House official.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b70e8456a1017fae26d04b586fb5d56937d0a0",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:56:42.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice\nA court in South Korea has acquitted a woman convicted six decades ago for biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.\nChoi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae. He pinned her to the ground and repeatedly forced his tongue into her mouth, at one point blocking her nose to stop her from breathing, according to court records.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33bc623fa4b98469ed6d7eeb3ca66f79faa83a4e",
      "title": "Watch: Army patrols streets of Kathmandu after fierce protests",
      "url": "https://www.bbc.com/news/videos/cyv647g63gvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:32:09.000Z",
      "summary_90w": "",
      "raw": "Charlotte Scarr reports from the Kathmandu where deadly protests against corruption and nepotism took place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef95c7eba627dce8e41fef5eb513669ce3ed052e",
      "title": "James McAvoy reportedly assaulted  in Toronto bar",
      "url": "https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:12:49.000Z",
      "summary_90w": "",
      "raw": "Actor promoting his directorial debut California Schemin’ at the city’s film festival is reported to have been punched by another drinker\nThe actor James McAvoy was assaulted in a bar in Toronto, it has been reported.\nAccording to People magazine, McAvoy was “sucker punched” by another visitor to Charlotte’s Room bar on Monday evening, two days after the premiere of his directorial debut, California Schemin’, at the Toronto film festival.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5f7bd78ca39fa302ac879fc431ad2a1235ae06",
      "title": "Who is Lachlan Murdoch, the anointed media tycoon?",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535569/lachlan-murdoch-rupert-news-corp-fox",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T09:01:00.000Z",
      "summary_90w": "",
      "raw": "His position in leading News Corp. and Fox is now secure, as his father ends a dramatic succession battle. Lachlan grew up in New York City but has lived in Australia for much of his adult life.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7314c5d1c78502f4efe20b8d90ba421798102985",
      "title": "Federal judge blocks Trump from firing Fed Governor Lisa Cook, for now",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5529281/appeals-court-lisa-cook-federal-reserve-independence-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T03:29:38.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve Governor Lisa Cook won a round in federal court in her bid to keep her job despite President Trump's effort to fire her.  On Wednesday, the Justice Department said Trump would appeal.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6f917466683095255dab3a4e1782a394f7c187e9",
      "title": "Discovery of new campsite shows fugitive Tom Phillips had ‘outside help,’ NZ police say",
      "url": "https://www.theguardian.com/world/2025/sep/10/tom-phillips-new-zealand-man-fugitive-father-outside-help-nz-police-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T02:57:50.000Z",
      "summary_90w": "",
      "raw": "Phillips had spent nearly four years hiding in the wilderness with his three children before he was killed in an exchange of fire with police on Monday\nFugitive father Tom Phillips was receiving outside help during his years on the run before he was killed in a police shoot-out this week, New Zealand police said on Wednesday as they released images that show a newly discovered campsite.\nPhillips had spent nearly four years hiding in the wilderness with his three children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio, in the central North Island, on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf4a56d44ef7fdeb4cd2eccd77400c36a6c59d82",
      "title": "First two Brazilian judges vote to convict Jair Bolsonaro in coup plot trial",
      "url": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T21:30:45.000Z",
      "summary_90w": "",
      "raw": "Three more supreme court justices to cast their votes in coming days, with verdict expected by Thursday\n\n‘He’s always on the attack’: the Brazilian judge prosecuting Bolsonaro inspires both love and hate\n\nJair Bolsonaro led a criminal organisation that sought to plunge Brazil back into dictatorship with a murderous power grab involving special forces assassins and a vast disinformation campaign, the supreme court judge presiding over the former president’s trial has claimed as he voted for Bolsonaro’s conviction.\nAlexandre de Moraes was the first supreme court justice of five to announce his decision on Tuesday, as the trial of Bolsonaro and seven alleged co-conspirators – including four senior members of the military and the former head of Brazil’s answer to MI6 – entered its final stretch.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "147efeea67aea93f276f37a14b2d4fea1b8c886f",
      "title": "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535813/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:47:28.000Z",
      "summary_90w": "",
      "raw": "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4594d1aba0cfe8215d7c138089f20cd34937c619",
      "title": "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535806/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:43:10.000Z",
      "summary_90w": "",
      "raw": "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3e8da303c0ae690bcabf79ae59862e52da45f4e2",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "url": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:45:02.000Z",
      "summary_90w": "",
      "raw": "Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged\nA Canadian beekeeper has described fending off thousands of “robber bees” as they raided her shop in a brazen attempt to steal honey.\nChristine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07b34831be5e4cb07a32f4935262aa84c1d532e",
      "title": "A government building struck in Kyiv and a new threat from Trump",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1srdr?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:39:00.000Z",
      "summary_90w": "",
      "raw": "Trump says he'll respond after Ukraine's main cabinet building was hit",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b7bbe56c335a5284801381e0fb0268841ce0acb",
      "title": "'The Office' creators deliver 'The Paper,' a sharp mockumentary about journalism",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535137/the-office-creators-deliver-the-paper-a-sharp-mockumentary-about-journalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:54:18.000Z",
      "summary_90w": "",
      "raw": "The issues facing journalism these days — from online clickbait to corporate interference — run throughout The Paper. But it's primarily a comedy, with characters and actors that will win you over.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows annual hiring was overstated by 911,000 jobs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}