{
  "version": "1755706749723",
  "generatedAt": "2025-08-20T16:19:09.723Z",
  "items": [
    {
      "id": "f718fa413797572472d314c58cf35e817137924a",
      "title": "Pixel 10, AI capabilities, and everything else announced at the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/20/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:13:42.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5f17517b5cfea53dae9bfc30952d6fa1d4d55222",
      "title": "Polish army believes drone that exploded in eastern Poland was launched from Russia – Europe",
      "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:08:26.000Z",
      "summary_90w": "",
      "raw": "Not clear if it was a deliberate violation of Poland’s airspace or a malfunction of a drone targeting Ukraine, Poland said\nAn object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine.\n“...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d8def9417da3c5722456d95d7db6c58203d7c2b",
      "title": "ESPN&#8217;s streaming launch brings a TikTok-like feed and AI commentary",
      "url": "https://www.theverge.com/news/762294/espn-live-sports-streaming-app-launch-tiktok-feed-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:06:00.000Z",
      "summary_90w": "",
      "raw": "ESPN is showing off its overhauled app ahead of the launch of its live sports streaming service. On Wednesday, ESPN detailed all of the new features coming to the ESPN app, including a TikTok-style vertical video feed.\nESPN’s long-awaited live sports streaming service costs $29.99 per month and puts all 12 of the network’s linear channels, including ESPN, ESPN2, ESPNU, SECN, and others, inside its new app. The service officially launches on August 21st, but ESPN is rolling out some features inside its app starting today.\nThe mobile app’s personalized feed will show bite-sized sports videos in a standalone “verts” tab as well as within a carousel on the homepage. There’s a new “SC For You” feature launching in beta, too, which uses the AI-generated voices of SportsCenter anchors to deliver a daily version of the show that’s tailored to your favorite teams, leagues, and sports. This feature will be available on the ESPN mobile app, along with ESPN.com and some smart TVs.\nAnother update will give you the ability to connect the ESPN mobile app to its app on TV while you watch a live sporting event. During the game, you can get stats and automated alerts sent to your phone, along with access to play-by-play updates, betting information, and ESPN Fantasy. You can also use the mobile app to control ESPN’s livestream on your TV.\nIf you’re late tuning into a game, ESPN will offer a series of highlights for select events to help you catch up to what’s happening now. You’ll also have the option to play a game from the beginning or watch it live. \nESPN is rolling out multiview on “all major” smart TV platforms as well, allowing you to watch up to four games at the same time. The network plans on building out the new app with even more features in the future, as ESPN head Jimmy Pitaro said the app “will evolve with regular enhancements over time.”\nAdditionally, ESPN is folding its full-featured streaming service into Disney Plus for bundle subscribers. As part of this change, Disney Plus is rolling out a new “Live” hub in the coming weeks where you can watch sports, news, and other live content. ESPN is currently offering a bundle with ad-supported Disney Plus and Hulu plans for $29.99 per month for the first year before increasing the price to $35.99 per month.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a921219faed04aac0c2034f7e437c017c539adf8",
      "title": "Israel to call up around 60,000 reservists before planned offensive on Gaza City, says Israeli military official – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/aug/20/israeli-army-reservists-gaza-city-offensive-ceasefire-proposal-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T16:03:13.000Z",
      "summary_90w": "",
      "raw": "Call-up notices sent as Israeli plans to increase its offensive; Israel studies Hamas’ response to proposal for 60-day ceasefire\nIsrael is “killing all prospects” for peace in the Middle East, Jordan’s foreign minister has said amid escalating international outrage over Israel’s plans for a new large-scale offensive in Gaza City and plans to massively expand Jewish settlements in the West Bank.\nAyman Safadi made his remarks during a visit to Moscow on the same day that the Israeli defence minister, Israel Katz, approved a plan to conquer Gaza City, an urban area home to hundreds of thousands of people in the north of the Palestinian territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7825c18730a6990b517650388c7289e89ef58a0",
      "title": "Ex-priest found guilty of 17 indecent assaults",
      "url": "https://www.bbc.com/news/articles/c20662dxl88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T16:01:13.000Z",
      "summary_90w": "",
      "raw": "Chris Brain abused nine women while head of the Nine O'Clock Service in Sheffield in the 80s and 90s.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d300467a956c7bb9de261f0c69e64c684b2f253",
      "title": "Google doubles down on ‘AI phones’ with its Pixel 10 series",
      "url": "https://techcrunch.com/2025/08/20/google-doubles-down-on-ai-phones-with-its-pixel-10-series/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:01:00.000Z",
      "summary_90w": "",
      "raw": "Google's updates to the Pixel 10 line allow it to showcase what its latest AI technology can do when enhanced by the Tensor G5 processor, an upgrade to the company's custom silicon designed for the AI experience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d469659e4cd26298aaa3fbfa4b2eb96cfab44121",
      "title": "Fitbit’s AI health coach is the first I might actually be interested in",
      "url": "https://www.theverge.com/hands-on/761965/fitbits-ai-health-coach-is-the-first-i-might-actually-be-interested-in",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "We won’t get to try it until October, but so far I’m cautiously curious. | Photo by Victoria Song / The Verge\t\n\nI'm not a fan of AI health and fitness features. Not only do they regurgitate Captain Obvious-level summaries of what you just did, but the \"insights\" are so generalized that a Google search is often more helpful. So it was with great skepticism that I walked into a demo to learn about Fitbit's forthcoming AI-powered personal health coach. To my surprise, I left cautiously curious about where Fitbit is going.\n\"We really want to move towards this world of coaching,\" Andy Abramson, Google's director of product management for Fitbit and Health, says during a demo of the feature. Professional athletes have a whole team of people helping to craf …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "592579a5d00de446082436cd0f400ac7b64c6c7a",
      "title": "Google announces new AI-powered personal health and fitness coach for Fitbit",
      "url": "https://techcrunch.com/2025/08/20/google-announces-new-ai-powered-personal-health-and-fitness-coach-for-fitbit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "At its Made by Google event on Wednesday, the company announced a new AI-powered personal health coach built with Gemini that’s coming to Fitbit. The tech giant says the new personal health coach is a fitness trainer, sleep coach, and wellness advisor all in one. Google plans to roll out a preview of the personal […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e92d0cb54495d860df124e9743812e746e49be2e",
      "title": "Google brings improved Gemini features to its new Pixel Buds",
      "url": "https://techcrunch.com/2025/08/20/google-brings-improved-gemini-features-to-its-new-pixel-buds/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google Gemini was the star yet again at this year's hardware event, brining new features to the 2nd gen Pixel Buds A-Series and Pro 2.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a410d9994a16c4f9f0d65f0d0f07efe55c7fde13",
      "title": "Google debuts Pixel Watch 4 with domed display, emergency Satellite Communication",
      "url": "https://techcrunch.com/2025/08/20/google-debuts-pixel-watch-4-with-domed-display-emergency-satellite-communication/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "The 41mm Pixel Watch 4 starts at $349 for Wi-Fi and $449 for LTE, while the 45mm version starts at at $399 for Wi-Fi and $499 for LTE.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b0d0d24b8e67dd6a6e8e241dfd15c72e0c542a5f",
      "title": "Google is launching its first magnetic wireless charging accessories",
      "url": "https://www.theverge.com/news/762426/google-qi2-wireless-charger-pixelsnap-pixel-10-series",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google’s new magnetic Pixelsnap charger attaches to an optional stand accessory. | Image: Google\t\n\nWith its new Pixel 10 Series, Google is finally embracing the Qi2 wireless charging standard, making it much easier to securely attach wireless chargers thanks to a ring of magnets built into the device. That also makes the new phone compatible with the many MagSafe and Qi2 accessories already on the market — so naturally, Google is introducing its own options, too.\nThe Pixelsnap Charger is a wireless charging puck that looks similar to Apple’s own MagSafe charger and is compatible with other Qi2-certified devices. It supports wireless charging speeds up to 25W when paired with the Pixel 10 Pro XL and can be purchased with an optional stand accessory that’s sturdy enough to support the Pixel 10 Pro Fold while it’s unfolded and allows the charging puck to be detached as needed.\nIf you’re eager to upgrade to one of the new Pixel 10 Series devices and aren’t already eyeing one of PopSockets’ magnetic grip accessories, the Pixelsnap Ring Stand offers similar functionality. You can prop up your device using its fold-out metal ring, while a soft microfiber lining between the accessory and your phone lets you rotate the stand for changing its orientation without having to completely remove it.\nGoogle is also introducing a collection of Pixelsnap cases compatible with the new magnetic functionality. The cases for the Pixel 10 Pro Fold include moonstone, jade, and obsidian color options, while the 10 Pro XL adds a porcelain option, and the 10 and 10 Pro add indigo, frost, and lemongrass versions.\nAnd because wireless charging isn’t truly wireless — you still need a tether to a power source — Google is releasing a new dual port adapter. The Pixel Flex Dual Port 67W USB-C Fast Charger features folding prongs for portability and a “proprietary algorithm that intelligently identifies andprioritizes charging Pixel phones” with two devices connected. It’s not the smallest or fastest multiport charger you can buy, but it’s got a sleek design if you’re not into branding.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c46b0f456ad2bb6ee9d702532dc5e7026f2db4e2",
      "title": "Google launches a new Pixel Journal app",
      "url": "https://techcrunch.com/2025/08/20/google-launches-a-new-pixel-journal-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Pixel Journal is a new journaling app from Google that uses on-device AI to suggest writing prompts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de8e85fefacfd1cca08ee4371cfa3f538920e1c2",
      "title": "Google Pixel 10 launch event: the 8 biggest announcements",
      "url": "https://www.theverge.com/news/762150/google-pixel-10-launch-event-announcements",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google has just announced a bunch of shiny new devices to look at and AI features to yell about. As part of its Made by Google event, the company revealed an upgraded Pixel 10 lineup, a bubblier smartwatch with a brighter screen, and a ton of AI updates that extend across all of its new devices.\nHere’s everything that was announced at the Made by Google 2025 event.\nGoogle’s next-gen foldable arrives with a dustproof design\nJust like the slew of leaks predicted, Google’s Pixel 10 Pro Fold comes with an IP68 rating, making it the first foldable that’s dust-tight and protected against continuous submersion in water. Google also shrunk the bezels on the outside of the device, allowing for a slightly larger 6.4-inch cover display. The inner screen remains the same at 8 inches.\nThe 10 Pro Fold comes equipped with the company’s upgraded Tensor G5 processor, its first made with TSMC instead of Samsung. It also offers support for Qi2 wireless charging speeds of up to 15W, which I’ll go over in more detail later on. \nThe 10 Pro Fold starts at $1,799 and is available in silver and green. The new device will be available in stores a bit later than usual, on October 9th.\nThe Pixel 10 Pro gets a spec bump\nThe new Pixel 10 Pro and the larger XL variant haven’t changed much. They both look almost identical to their predecessors and come with the same 6.3-inch and 6.8-inch display sizes, along with an unchanged 16GB of RAM.\nThe major difference is that the 10 Pro and 10 Pro XL come with a Tensor G5 chip and support for Qi2 wireless charging — though only the 10 Pro XL supports Qi 2.2-certified speeds of up to 25W (the smaller 10 Pro is stuck at 15W). Google also removed the 128GB 10 Pro XL, leaving you with the options of 256GB, 512GB, or 1TB storage.\nThe 10 Pro starts at $999, while the 10 Pro XL has a slightly higher starting price of $1,119 because Google skipped the 128GB storage variant. Both phones are available for preorder today, with in-store availability starting on August 28th. They’re available in silver, green, white, and black.\nGoogle adds a third camera to the base Pixel 10\nFor the first time, the base Pixel phone is getting a three-camera setup, just like its more premium sibling. The new cameras aren’t as good as the ones on the Pro-level models, as the Pixel 10 uses a smaller 48-megapixel main camera, a 13MP ultrawide sensor, and a 10.8MP telephoto lens. Those first two are actually downgrades compared to the Pixel 9.\nOther key upgrades include support for Qi2 wireless charging speeds of up to 15W, the Tensor G5 chip, a slightly larger battery, and a higher peak brightness of up to 3,000 nits. The Pixel 10 starts at $799 and will be available for preorder before hitting store shelves on August 28th. It comes in indigo, light blue, bright green, and black.\nPixelsnap magnetic charging accessories make a splash\nWith the entire Pixel 10 lineup featuring wireless charging, Google has designed a bunch of new “Pixelsnap” accessories that support Qi2 magnetic charging. That includes a set of Qi2-compatible cases priced at $49.99, which match the colors of Google’s newest phones, along with a $39.99 wireless charging puck and a $69.99 Pixelsnap charger that doubles as a stand.\nAdditionally, Google revealed a $29.99 ring-style accessory that snaps to the back of your device, allowing you to use it as a way to prop up your phone. Google is launching a new dual-port 67W fast charger, as well.\nThe Pixel Watch 4 gets a brighter, curvier display\nOn top of its phone lineup, Google also took the wraps off its Pixel Watch 4. The new smartwatch comes with a bunch of notable upgrades, including a “domed” display that allows for 10 percent more visible screen space and 16 percent smaller bezels. The display’s brightness got a boost, too, with a 50 percent increase to 3,000 nits.\nGoogle says the Watch 4 has a 25 percent longer battery life, allowing for 30 hours of use on the 41mm model and 40 hours on the 45mm version. The device starts at $349 for the 41mm Wi-Fi model and $449 for LTE, while the 45mm version starts at $399 for Wi-Fi-only and $499 with LTE. It will be available on October 9th.\nGoogle’s Pixel Buds 2A come with more bells and whistles\nGoogle’s budget-friendly Pixel Buds 2A cost $129.99, making them $30 more expensive than their predecessors. But the price increase comes with a number of upgrades, including Google’s Tensor A1 chip, a replaceable charging case battery, active noise cancellation, and support for Gemini AI.\nThe earbuds also offer transparency mode, which lets you hear the environment around you, along with AI-powered wind and background noise reductions during calls. The Buds 2A also offer seven hours of battery life with ANC turned on (or 10 hours when turned off). \nThe Buds 2A will be available in stores in black and purple on October 9th.\nThe Pixel Buds Pro 2 get an update, too\nEven though Google set its focus on its latest and greatest devices, it didn’t forget about the Pixel Buds Pro 2 it released last year. These earbuds are getting a decent-sized update coming in September that will add Adaptive Audio, a new feature that automatically adjusts sounds to how loud your environment is, as well as Noise Protection, which will dampen sudden loud noises to help protect your hearing.\nOther features on the way include the ability to nod or shake your head to answer or decline phone calls and respond to texts. They will also get a new feature that reduces background noise when using Gemini Live. Oh, and they come in a new silver color, as well.\nAI features galore\nEvery device that Google showed today comes with some degree of AI, with its phones getting the vast majority of new features. That includes a new Magic Cue tool that can make proactive suggestions based on what you’re doing on your phone, such as surfacing an Airbnb listing if your friend asks for the address.\nGoogle also put AI directly into the Pixel 10 Pro and 10 Pro XL’s cameras, allowing it to use the technology to refine the detail of zoomed-in photos. Pixel phones even offer an AI Camera Coach to help you improve your shots, as well as new AI journaling and translator apps. Meanwhile, on the Pixel Watch 4, Google added a new AI-powered health coach.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c1520f5c1ef33cad3921e1b6e9628fbe599b0dfd",
      "title": "Google unveils its $1,799 Pixel 10 Pro Fold",
      "url": "https://techcrunch.com/2025/08/20/google-unveils-its-1799-pixel-10-pro-fold/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "The phone's new gearless hinge allows for a larger outer display with smaller bezels, and the hinge is two times more durable than the one of the Pixel 9 Pro Fold.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb02c0aeb4e70420862e5b2ae353ac585cc577e0",
      "title": "Google’s Pixel Buds Pro 2 are getting new AI-powered features in September",
      "url": "https://www.theverge.com/news/762048/googles-pixel-buds-pro-2-new-ai-powered-features",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google just announced its new budget Pixel Buds 2A, but it didn’t forget about the earbuds it launched last fall. Owners of the Pixel Buds Pro 2 will get an update in September that will deliver a few new AI-powered features.\nOne of them, Adaptive Audio, automatically adjusts the volume based on the noise in your environment. Google’s also improving the audio processing to reduce background noise when interacting with Gemini Live. Pro 2 owners will be able to pick up calls and reply to texts hands-free by nodding or shaking their head. A new Loud Noise Protection feature, in which the buds automatically dampen sound when loud noises like sirens or alarms are detected, is also coming.\nOh, and Google announced a new “moonstone” color. (It’s dark gray, I don’t know what else to tell you.) The Pro 2 in moonstone will cost the same price at $229 and launch alongside the Pixel 10 lineup on August 28th.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6fb7a009c520f66b5c1bcc70c7f424f4cfef9666",
      "title": "Google&#8217;s Pixel Buds 2A add Gemini, noise cancellation, and a replaceable battery",
      "url": "https://www.theverge.com/hands-on/760852/google-pixel-buds-2a-hands-on-active-noise-cancellation-battery-gemini-earbuds",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Four years after launching the original Pixel Buds A-series, Google's back with the Pixel Buds 2A. The new budget buds are $30 more expensive at $129.99, but add some notable updates like an upgraded chip, Gemini access, a replaceable battery, and most importantly, active noise cancellation. \nThe 2A also adds a Tensor A1 chip, which Google says \"unlocks the power of Google's advanced AI and Gemini features.\" That Gemini access was heavily emphasized during my briefings, though in practice it mostly replaces Google Assistant on the buds. For most people, the most exciting feature enabled by the new Tensor chip is active noise cancellation an …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e7e05d93717fa6233d7b83d0f4f7c47a56f5952",
      "title": "Google&#8217;s Pixel Watch 4 has big ideas — and an even bigger focus on AI",
      "url": "https://www.theverge.com/hands-on/761918/google-pixel-watch-4-hands-on-smartwatch-wearable-gemini",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "The original Pixel Watch was late to the game. For years, there had been rumors of a Google smartwatch that never materialized. Then, when it finally arrived, it was a quintessential first-gen device, with thicc bezels, dismal battery life, and a host of quirks that needed ironing out. My DMs were full of people wondering when the watch would be unceremoniously dumped into Google's infamous product graveyard. A part of me wondered if Google was going to spend the next decade playing catch-up. \nFast forward to 2025, and I'm holding the Pixel Watch 4 at Google's office in New York City. On the surface (and my wrist), it doesn't look like much …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63bcfa1cd85bf22f3ceffc683ce9dd9b357faa3b",
      "title": "Harvard dropouts to launch ‘always on’ AI smart glasses that listen and record every conversation",
      "url": "https://techcrunch.com/2025/08/20/harvard-dropouts-to-launch-always-on-ai-smart-glasses-that-listen-and-record-every-conversation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "After developing a facial recognition app for Meta’s Ray-Ban glasses and doxing random people, two former Harvard students are now launching a startup that makes smart glasses with an always-on microphone.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c852c36900e6f74f4b04fd0e33f85c1940eae46",
      "title": "The Google Pixel 10 and 10 Pro come with magnets, a new chip, and AI everywhere",
      "url": "https://www.theverge.com/hands-on/761055/google-pixel-10-pro-hands-on-camera-gemini",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Phones on phones on phones.\t\n\nGoogle has formally announced the Pixel 10, 10 Pro, and 10 Pro XL, and their hardware upgrades can be summed up in two letter/number combinations: G5 and Qi2. Otherwise, there's not much to see on the outside of the phones. They mostly cost the same as last year's devices - $799 for the Pixel 10, $999 for the 10 Pro, and $1,199 for the 256GB 10 Pro XL, though Google got rid of the cheaper 128GB Pro XL variant. They also look an awful lot like last year's phones, with a few specs tweaked here and there. But we got a look at some of the new features running on these phones, including - you guessed it - a bunch of AI stuff, and there's just a w …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c35551a79249f6a34965f1d374355eea4de2f16",
      "title": "The Google Pixel 10 Pro Fold is the first fully dust-resistant foldable",
      "url": "https://www.theverge.com/hands-on/762080/google-pixel-10-pro-fold-dust-rating-ip68",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Just look at that dust-tight hinge.\t\n\nFinally, a foldable to take to the beach. The Google Pixel 10 Pro Fold is official, matching last year's starting MSRP of $1,799, and it comes with an IP68 rating. That means full water and dust resistance, which is something that no other foldable maker has figured out yet - and no small feat for a device with moving parts.\nThe 10 Pro Fold uses a new hinge with a gear-less design that Google says provides better protection against drops. It certainly feels sturdy, though it didn't feel overly stiff when I unfolded and folded the phone back up again. The crease on the inner screen doesn't look any more prominent to my eye, but I'm not usual …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "56c1b02f20da007298bb46ef9e368a960ff8ff4f",
      "title": "The newest Pixels put generative AI right inside the camera",
      "url": "https://www.theverge.com/hands-on/761817/google-pixel-10-pro-res-zoom-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "The call is coming from inside the house.\t\n\nAt The Verge, we like to ask \"What is a photo?\" when we're trying to sort out real and unreal images - especially those taken with phone cameras. But I think there's another question that we'll want to add to the mix starting right now: what is a camera? With the introduction of the Pixel 10 Pro and Pro XL, that answer is more wild and complicated than ever, because generative AI isn't just something you can use to edit a photo you've already taken; it's baked right into the camera itself.\nI'm talking about Pro Res Zoom, which is not to be confused with Apple's ProRes video format or Google's Super Res Zoom, so help us all. Pro Res Zoom kic …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d440c09f60a995a77c9c5e2a29bbf14832aad582",
      "title": "You can now talk to Google Photos to make your edits",
      "url": "https://techcrunch.com/2025/08/20/you-can-now-talk-to-google-photos-to-make-your-edits/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Google Photos introduces an \"ask to edit\" feature that lets you speak or text your edit requests.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d463db416d84c32d0335f994a54bfed5cdb0c0a",
      "title": "Meta to add 100 MW of solar power from U.S. gear",
      "url": "https://techcrunch.com/2025/08/20/meta-to-add-100-mw-of-solar-power-from-u-s-gear/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T15:56:53.000Z",
      "summary_90w": "",
      "raw": "The social media company is adding another tranche of solar to power a new AI data center in South Carolina.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7a3de094ecb146b3f8ccfe18fc455aa189a6982a",
      "title": "Brentford reject new £40m Newcastle bid for Wissa",
      "url": "https://www.bbc.com/sport/football/articles/cgm2lmvgzrno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T15:50:56.000Z",
      "summary_90w": "",
      "raw": "Brentford turn down Newcastle's improved bid of £40m for DR Congo striker Yoane Wissa.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6fd20a1eb97166af18cbbbe32321ed65bda24835",
      "title": "The White House is on TikTok now, which is technically banned in the U.S.",
      "url": "https://techcrunch.com/2025/08/20/the-white-house-is-on-tiktok-now-which-is-technically-banned-in-the-u-s/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T15:44:04.000Z",
      "summary_90w": "",
      "raw": "The White House joined TikTok, despite ongoing legal battles surrounding the use of the Chinese-owned app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8343de16e52f5c7d4c3878597b18af12722caaf",
      "title": "Man who shot PC with crossbow jailed for nine years",
      "url": "https://www.bbc.com/news/articles/cy8jlwee0xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T15:29:31.000Z",
      "summary_90w": "",
      "raw": "The judge hears Jason King also stabbed a neighbour's partner in the stomach.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3a8f75eddc57f55f527e799f36e60c2fd1297e4",
      "title": "US-Mexico border wall to be painted black to stop climbers",
      "url": "https://www.bbc.com/news/articles/cq587vpe46eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T15:27:46.000Z",
      "summary_90w": "",
      "raw": "Using black paint to make the entire US-Mexico border wall hotter and harder to climb was reportedly Trump's idea.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e564999255d8ff4dbe92a44540e1be148ff95fa7",
      "title": "Labour MSP Colin Smyth charged over indecent images",
      "url": "https://www.bbc.com/news/articles/cy08309kxw6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T15:26:55.000Z",
      "summary_90w": "",
      "raw": "The South Scotland representative has been suspended by the party after being arrested in Dumfries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09b5e26022a84d312516c81e1a87b0dcb2955319",
      "title": "Supporting freedom of expression is not wrong, Jimmy Lai’s lawyer tells court",
      "url": "https://www.theguardian.com/world/2025/aug/20/jimmy-lai-unwavering-intent-to-solicit-foreign-sanctions-hong-kong-court-told",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T15:23:24.000Z",
      "summary_90w": "",
      "raw": "Closing arguments made in Hong Kong media mogul’s national security trial, which has lasted more than 140 days\nA lawyer for Jimmy Lai has argued that it is not wrong to support freedom of expression, as he began his final argument in the prominent Hong Kong democracy activist and newspaper founder’s landmark national security trial.\nThe barrister Robert Pang is representing Lai in his fight against charges of colluding with foreign forces to endanger national security and conspiring with others to issue seditious publications. Lai, 77, faces up to life in prison if convicted under a national security law imposed by Beijing after anti-government protests in 2019.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "50ed82093eac7ac9b0c6df1846aee3cead4d313b",
      "title": "Swimmers are warned to avoid East Coast beaches as Hurricane Erin moves north",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5508084/hurricane-erin-outer-banks-east-coast-rip-currents",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T15:20:15.000Z",
      "summary_90w": "",
      "raw": "The National Hurricane Center is urging beachgoers to stay out of the water. Parts of North Carolina's Outer Banks are under mandatory evacuation orders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67680591a96c3ff08966d158a96e67e1a067a961",
      "title": "Decision over Kneecap rapper terror charge delayed",
      "url": "https://www.bbc.com/news/articles/c939v4kw2l4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T15:04:00.000Z",
      "summary_90w": "",
      "raw": "Liam Óg Ó hAnnaidh was charged with a terror offence after allegedly displaying a flag in support of proscribed organisation Hezbollah.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3243e8f7a3d90af346980482429f460ff3230060",
      "title": "Scientists make 'superfood' that could save honeybees",
      "url": "https://www.bbc.com/news/articles/c776kynn771o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T15:03:02.000Z",
      "summary_90w": "",
      "raw": "We rely on honeybees to pollinate our crops and a new food could protect them from growing threats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d47774febf0f82401c72c7e26cd2fd23ba915e6",
      "title": "Students face nervous wait for GCSE and BTec results",
      "url": "https://www.bbc.com/news/articles/c4g64qedynlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T15:01:26.000Z",
      "summary_90w": "",
      "raw": "The GCSE pass rate is expected to be broadly similar to 2024, after years of flux during the Covid pandemic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71596e8079ef35b0b8a8828fee8cd6dcbaebc4a1",
      "title": "Concern Australian doctor ‘pushed’ out as chair of medical insurer board over social media posts on Gaza war",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/concern-australian-doctor-pushed-out-as-chair-of-medical-insurer-board-over-social-media-posts-on-gaza-war-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T15:00:50.000Z",
      "summary_90w": "",
      "raw": "Dr Stephen Parnis says public comments based on ‘my views and conscience’ in resignation email that has prompted letter writing campaign in his support\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nHigh-profile emergency physician Dr Stephen Parnis has stepped down as chair of the board of a leading medical insurance provider in an apparent response to concerns about statements he has made on social media opposing the war in Gaza.\nParnis, a former vice-president of the Australian Medical Association, announced in an email to members of the Medical Insurance Group of Australia (Miga) last Monday that he was giving up his role as chair of the board.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f1d2418f8d42fa093e0c8fc4eb2e52693c7bca53",
      "title": "How do we decide if a tax is good or bad? And which ones are ‘damaging’ Australia’s economy?",
      "url": "https://www.theguardian.com/australia-news/2025/aug/21/how-do-we-decide-if-a-tax-is-good-or-bad-and-which-ones-are-damaging-australias-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T15:00:48.000Z",
      "summary_90w": "",
      "raw": "Experts say stamp duties and income taxes have a much higher burden than more efficient policies, such as GST\n\nGet our breaking news email, free app or daily news podcast\n\nHow do we judge whether one tax is better than another? That question will lie at the heart of the tax reform agenda at the economic reform roundtable on Thursday.\nFour principles have guided tax reform over the decades: efficiency, equity, simplicity and sustainability (or revenue adequacy).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95df77787efdcbdd80bbd3ea222ac5c2e653fb42",
      "title": "Here is what actually needs to be done to address Australia’s childcare abuse crisis - and politicians can’t say they didn’t know",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/its-time-for-australia-politicians-to-take-childcare-safety-out-of-the-too-hard-basket-and-commit-to-real-reform-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T15:00:46.000Z",
      "summary_90w": "",
      "raw": "Review after review has made recommendations to government that have never been implemented. It’s time to take childcare safety out of the too-hard basket and commit to real reform\n\nGet our breaking news email, free app or daily news podcast\n\nOn Friday, state education ministers will meet Jason Clare to discuss the thorny and critically important issues facing the country’s childcare sector.\nThere could not be a more significant moment for the conversations that we are having about the safety of the more than 1 million Australian children who attend childcare.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9d050b46f587a45bd3caef48e72127ede19b75e",
      "title": "Life360 adds a new no-show notification to its app",
      "url": "https://techcrunch.com/2025/08/20/life360-adds-a-new-no-show-notification-to-its-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Life360 has launched a new no-show notification to alert family members when you don't reach a location at a designated time.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4fcfd30f9cd62323eec5a4335711c12ef5e6d51",
      "title": "Why the asylum hotel challenge doesn't end with Epping court ruling",
      "url": "https://www.bbc.com/news/articles/cly4v3pllgko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T14:58:02.000Z",
      "summary_90w": "",
      "raw": "The High Court ruling follows an unprecedented backlog in people waiting for a decision on their cases.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cc1a51a4ef415c2f27a29fad5e2115920c08b0a",
      "title": "How Attorney General Pam Bondi has reshaped the Justice Department to suit Trump",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507021/how-attorney-general-pam-bondi-has-reshaped-the-justice-department-to-suit-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T14:52:47.000Z",
      "summary_90w": "",
      "raw": "The New Yorker's Ruth Marcus says Bondi has presided over the DOJ's most convulsive transition of power since Watergate, aggressively reversing policies, investigating Trump's foes and firing staff.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b12dae349f2f92509b689889e8c0a94156789be5",
      "title": "Israel calls up 60,000 reservists ahead of planned Gaza City offensive",
      "url": "https://www.bbc.com/news/articles/c7417pl3ddpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T14:51:59.000Z",
      "summary_90w": "",
      "raw": "Troops are already operating in some areas ahead of the planned operation, which the ICRC says will worsen \"an already catastrophic situation\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a380c9328ff8100d48a10f9e9399151a8ec24fe",
      "title": "Denmark to abolish VAT on books in effort to get more people reading",
      "url": "https://www.theguardian.com/world/2025/aug/20/denmark-to-abolish-vat-on-books-in-effort-to-get-more-people-reading",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T14:50:55.000Z",
      "summary_90w": "",
      "raw": "Culture minister says government will propose ending the 25% rate, the highest in the world, in its budget bill\nDenmark is to stop charging VAT on books in an attempt to get more people reading.\nAt 25%, the country’s tax rate on books is the highest in the world, a policy the government believes is contributing to a growing “reading crisis”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "224e0b9da547eeb624205ad48d0dd6f641a174af",
      "title": "Police investigating death of French streamer seize equipment and videos",
      "url": "https://www.bbc.com/news/articles/cd0d31r423ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T14:36:45.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven - also known as Jeanpormanove - was known for his extreme videos on the platform, Kick.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c18ffbaa888ae0398867adf0818360640af4",
      "title": "Kremlin plays down Zelensky talks as Trump warns Putin may not want to make deal",
      "url": "https://www.bbc.com/news/articles/cn92e52rpjxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T14:24:11.000Z",
      "summary_90w": "",
      "raw": "The US president conceded the war in Ukraine was \"tough to solve\" after several days of high-level talks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "538dfc91e5618700d0b040095cdb17c71d0a7c23",
      "title": "Dex is an AI-powered camera device that helps children learn new languages",
      "url": "https://techcrunch.com/2025/08/20/dex-is-an-ai-powered-camera-device-that-helps-children-learn-new-languages/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T14:19:54.000Z",
      "summary_90w": "",
      "raw": "A new gadget called Dex allows kids to take pictures of objects and the AI translates the word into different languages.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c4b3001312bdcbbb916e54e23d39819415118c0",
      "title": "French police question man after four bodies found in River Seine",
      "url": "https://www.bbc.com/news/articles/c5yer12rp8po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T14:17:07.000Z",
      "summary_90w": "",
      "raw": "A passer-by led French police to the grim discovery at the foot of a bridge south-east of Paris.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c4b3001312bdcbbb916e54e23d39819415118c0",
      "title": "Man held after four bodies found in River Seine",
      "url": "https://www.bbc.com/news/articles/c5yer12rp8po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T14:17:07.000Z",
      "summary_90w": "",
      "raw": "A passer-by led French police to the grim discovery at the foot of a bridge south-east of Paris.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a21ad05db478aaf1da986ce5f8d031bd23355207",
      "title": "Airbus workers vote to strike for 10 days next month in pay dispute",
      "url": "https://www.theguardian.com/business/2025/aug/20/thousands-of-airbus-workers-in-uk-to-go-on-strike-in-dispute-over-pay",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T14:13:28.000Z",
      "summary_90w": "",
      "raw": "Unite says stoppages at Broughton and Filton factories could disrupt production of wings and delay deliveries\n\nBusiness live – latest updates\n\nThousands of Airbus workers in the UK are to go on strike for 10 days in September in a row over pay that threatens to disrupt the production of aircraft wings.\nA series of two-day strikes are planned to begin on 2 September and continue throughout the month at the company’s factories in Broughton, north Wales, and Filton, near Bristol, according to Unite.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "906a1feb4c5eb7947139b45194cde396dd3b3823",
      "title": "South African MP opens fire to fend off attack during attempted hijacking",
      "url": "https://www.bbc.com/news/articles/cm2k167kge2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T14:13:02.000Z",
      "summary_90w": "",
      "raw": "Two teens, aged 16 and 18, have been arrested over the attack as police search for a third suspect.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "94b5d31700a4a5d696f8071c34471fc58d548f24",
      "title": "Cutting two of Wales' four pro clubs is WRU's 'radical' option",
      "url": "https://www.bbc.com/sport/rugby-union/articles/c9d0nwepedeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T14:11:48.000Z",
      "summary_90w": "",
      "raw": "The Welsh Rugby Union backs reducing the number of professional teams from four to two but insists no final decision has been made.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c09c08f5fd7b41adc55f6b3c89ef39a647248a3",
      "title": "Thousands of Grok chats are now searchable on Google",
      "url": "https://techcrunch.com/2025/08/20/thousands-of-grok-chats-are-now-searchable-on-google/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T14:04:43.000Z",
      "summary_90w": "",
      "raw": "Whenever a Grok user clicks the “share” button on a conversation with the chatbot, it creates a unique URL that the user can use to share the conversation via email, text or on social media. According to Forbes, that also makes the URL indexable by search engines like Google, Bing, and DuckDuckGo, which in turn lets anyone look up those conversations on the web.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2ccb7525fa36ce6efa640027505235d987bde9bd",
      "title": "Israel’s Gaza City plan is killing prospect of peace in Middle East, says Jordan",
      "url": "https://www.theguardian.com/world/2025/aug/20/israel-is-killing-prospect-of-peace-in-the-middle-east-says-jordans-foreign-minister",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T14:03:00.000Z",
      "summary_90w": "",
      "raw": "Criticism adds to international outrage over Israel’s plans for new Gaza offensive and West Bank settlements\n\nMiddle East crisis live\n\nIsrael is “killing all prospects” for peace in the Middle East, Jordan’s foreign minister has said amid escalating international outrage over Israel’s plans for a new large-scale offensive in Gaza City and its intention to massively expand Jewish settlements in the West Bank.\nAyman Safadi made his remarks during a visit to Moscow on the same day that the Israeli defence minister, Israel Katz, approved a plan to conquer Gaza City, an urban area that is home to hundreds of thousands of people in the north of the Palestinian territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2ca4d3356c0f7f164b0c42f1168802f6d38416b",
      "title": "New zero-day startup offers $20 million for tools that can hack any smartphone",
      "url": "https://techcrunch.com/2025/08/20/new-zero-day-startup-offers-20-million-for-tools-that-can-hack-any-smartphone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T14:03:00.000Z",
      "summary_90w": "",
      "raw": "Prices for hacking tools that allow governments to break into mobile phones keep going up, thanks to efforts by tech firms shoring up their cybersecurity.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b14db364f2d096abf2497dc969419d68e1827751",
      "title": "Russia says it must be part of international talks on Ukraine’s security",
      "url": "https://www.theguardian.com/world/2025/aug/20/russia-international-talks-ukraine-security-putin-europe",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T14:02:26.000Z",
      "summary_90w": "",
      "raw": "Foreign minister Sergei Lavrov dismisses European diplomacy as ‘clumsy effort to sway Trump’\n\nRussia-Ukraine war – live updates\n\nMoscow has said it must be part of any international talks on Ukraine’s security, as Russia continues to stall on Donald Trump’s push for a meeting between Vladimir Putin and Volodymyr Zelenskyy.\nRussia’s foreign minister, Sergei Lavrov, said on Wednesday that Moscow must be included in any talks on Ukraine’s security guarantees, dismissing European diplomacy as “aggressive escalation” and a “clumsy effort to sway Trump”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb36dea2b00ee1e5357880ef65ce056bb0f346aa",
      "title": "Some Florida farmers reduce crops as deportation fears drive workers away",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5496668/some-florida-farmers-reduce-crops-as-deportation-fears-drive-workers-away",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T14:00:30.000Z",
      "summary_90w": "",
      "raw": "U.S. farmers are feeling the impact of Trump's immigration crackdown. In some communities, immigration raids have slowed farm operations. NPR reports from Central Florida's strawberry region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e67c2a9923ac65cc364a932609ab5aa13313e5df",
      "title": "Why are food prices still rising by so much?",
      "url": "https://www.bbc.com/news/articles/cyvn9z3y78lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T14:00:07.000Z",
      "summary_90w": "",
      "raw": "Food and drink prices have risen by 4.9% over the last year, according to ONS inflation data.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d0eec4c77e41629b13adebb32bc5364177e8227",
      "title": "FieldAI raises $405M to build universal robot brains",
      "url": "https://techcrunch.com/2025/08/20/fieldai-raises-405m-to-build-universal-robot-brains/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T14:00:00.000Z",
      "summary_90w": "",
      "raw": "FieldAI builds foundational AI models that help all kinds of robots learn and adapt to new environments using physics.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c58f559d5fc1f6d30cb721b842a95fe2c9448d6c",
      "title": "Greetings from the Dubai airport, where a long layover can also be a destination",
      "url": "https://www.npr.org/2025/08/20/g-s1-77081/dubai-airport-layovers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T13:51:10.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca9dc3e79708726084045a1b585cddef480086c2",
      "title": "Uganda denies reports that it has struck deal with Trump to take in US deportees",
      "url": "https://www.theguardian.com/us-news/2025/aug/20/uganda-trump-deal-immigration",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T13:01:24.000Z",
      "summary_90w": "",
      "raw": "Ugandan official said the east African country does not have the capability to take in undocumented immigrants\nUganda said it has not reached any agreement with the US to take in undocumented immigrants, contradicting reports that the east African country had struck a deal with the Trump administration to do so.\nHenry Oryem Okello, Uganda’s state minister for foreign affairs, told Reuters the country does not have the capability to take in immigrants. It comes as the US has deported migrants convicted of crimes in the US to non-native countries including South Sudan and Eswatini.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "699c10a62b2ceb299e88b46822cc0bed6cf63ad3",
      "title": "England name unchanged XV for World Cup opener",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cvg432dnkjvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T13:00:28.000Z",
      "summary_90w": "",
      "raw": "England have named an unchanged starting XV for Friday's opening game of the Women's Rugby World Cup against the United States in Sunderland.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "751aa19a824fb2abaa39b14dcbfe872e2bbf506d",
      "title": "Y Combinator alum SRE.ai raises $7.2M for DevOps AI agents",
      "url": "https://techcrunch.com/2025/08/20/sre-ai-launches-to-automate-complex-enterprise-workflows/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The company helps automate complex enterprise workflows (like continuous integration and testing) — or, in other words, it makes DevOps capabilities more efficient as AI technology takes hold.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5f478e67682a2f523fabfebb6c76555335977e83",
      "title": "YC-backed Garage raises $13.5M to help firefighters buy equipment",
      "url": "https://techcrunch.com/2025/08/20/embargo-tomorrow-yc-backed-garage-raises-13-5m-to-help-firefighters-buy-equipment/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Garage is a marketplace that sells specialized equipment commonly used in local governments and public safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "074a09f6a386b145debeab328e8aeb74b4b9b051",
      "title": "Zoox taps ex-UberPool exec’s startup for routing software help",
      "url": "https://techcrunch.com/2025/08/20/zoox-taps-ex-uberpool-execs-startup-for-routing-software-help/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T13:00:00.000Z",
      "summary_90w": "",
      "raw": "It's the latest in a series of deals that have seen robotaxi companies look outward for help in scaling their fledgling networks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9bf11feed4f8cfa76d9994383b7dd26842836552",
      "title": "South Korea tells tourists on holiday island Jeju to behave",
      "url": "https://www.bbc.com/news/articles/c939j4n2274o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T12:55:26.000Z",
      "summary_90w": "",
      "raw": "The island has issued visitor guidelines for the first time as it sees an increasing number of tourists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb14f806fc0e9cddfe22f88dbb7364666c65fc4d",
      "title": "Aerial footage shows final leg of Swedish church's move to new home",
      "url": "https://www.bbc.com/news/videos/c4g0e1nj2pqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T12:31:30.000Z",
      "summary_90w": "",
      "raw": "It took two days to move the church in Sweden's Kiruna, which was at risk at risk from ground subsidence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "945261dfaf1f8418ea66fad04728c9e0e752a069",
      "title": "How long can Trump's D.C. takeover last? Here's what to know",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5505987/trump-dc-takeover-timing-national-guard-police",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T12:24:10.000Z",
      "summary_90w": "",
      "raw": "President Trump needs Congress' permission to use D.C.'s police for over 30 days, but there are no such limits on its National Guard. Experts spoke to NPR about how the takeover could end.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8486084a46d74aa042ce15bc3bc96a3628549cb",
      "title": "Man sets fire to check-in area at Milan's Malpensa airport",
      "url": "https://www.bbc.com/news/articles/ce934lgp3lmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T12:14:49.000Z",
      "summary_90w": "",
      "raw": "The incident saw the partial evacuation of the terminal and may have a knock-on effect on departures.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd93505c111c87fef020e6e45e9e5ad5b01ed4bb",
      "title": "After the CDC shooting, federal workers pressure RFK Jr. for more protections",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5507208/after-shooting-cdc-workers-demand-more-protections-from-hhs-secretary",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T12:09:55.000Z",
      "summary_90w": "",
      "raw": "More than 750 current and former HHS employees signed a letter to Health Secretary Robert F. Kennedy, Jr. demanding he stop spreading inaccurate information and guarantee the safety of the workforce.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1735f3b12c0d3ecd828e9f4a9278b3bcbdc90f34",
      "title": "French streamer dies live online after months of apparent mistreatment",
      "url": "https://www.theguardian.com/world/2025/aug/20/french-government-investigating-death-of-man-during-live-stream",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T12:07:52.000Z",
      "summary_90w": "",
      "raw": "Jean Pormanove featured regularly in videos in which he appeared to be assaulted or humiliated as viewers watched\nFrench authorities are investigating the death of a man during a live video stream on the Kick platform, where he had regularly been shown enduring violence and humiliation.\nProsecutors ordered an autopsy and opened an investigation into the death of the man, 46, in the village of Contes, north of Nice, on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34813e0f1f26d76786862ca068e099b13644362d",
      "title": "Human rights regulator criticises Met's use of facial recognition cameras",
      "url": "https://www.bbc.com/news/articles/c1kzgx4v2pko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T12:06:58.000Z",
      "summary_90w": "",
      "raw": "The Equality and Human Rights Commission says it believes the Met's use of the tech is unlawful.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e44be966c716d54db18bfe8ce9fefb303fe2ce5",
      "title": "Amanda Knox joins forces with Monica Lewinsky to bring her story to television",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5471356/amanda-knox-hulu-show-monica-lewinsky",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Amanda Knox was just 20 years old in 2007 when her British roommate was found dead in their apartment. A new Hulu series dramatizes the story of her wrongful murder conviction.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ac412824f00d6550e1b20bf9bb9f96d23ad0ffe",
      "title": "Pine nuts and goat's milk among foods that should have allergy labels, experts say",
      "url": "https://www.bbc.com/news/articles/c5ypgrzxx9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T11:58:27.000Z",
      "summary_90w": "",
      "raw": "Warnings for some 'emerging' food allergens should be added to food packaging, researchers suggest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e8ad48e69ffa3d01a289305fe7a98d8366649a6",
      "title": "Man run over by own bulldozer while fighting Portugal fires",
      "url": "https://www.bbc.com/news/articles/c5y264ennmro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T11:53:46.000Z",
      "summary_90w": "",
      "raw": "The man was fighting fires that have spread through the country as Europe battles heatwaves.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "116598572afed1552f21c01d6d8ac3a47264e97a",
      "title": "Six states to send troops to D.C. And, Texas lawmakers to vote on redistricting today",
      "url": "https://www.npr.org/2025/08/20/g-s1-83907/up-first-newsletter-national-guard-dc-ukraine-russia-texas-redistricting",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T11:30:25.000Z",
      "summary_90w": "",
      "raw": "Six Republican governors are sending National Guard troops to the nation's capital to help with the president's crime crackdown. And, Texas lawmakers set to vote on a new congressional map today.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc158d1b433d5dbb88f3b9200b5003540168575a",
      "title": "'He has to go, and now' - heat on Martin after Rangers shambles",
      "url": "https://www.bbc.com/sport/football/articles/crlz4y36jwko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T11:18:37.000Z",
      "summary_90w": "",
      "raw": "Rangers supporters call for manager Russell Martin's exit after the 3-1 humbling against Club Brugge in the Champions League qualifier.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea48a62f634837d6d0a6d09b8f55188a88844503",
      "title": "Finally, Notion now works without an internet connection",
      "url": "https://techcrunch.com/2025/08/20/finally-notion-now-works-without-an-internet-connection/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-20T11:16:57.000Z",
      "summary_90w": "",
      "raw": "For years, one of the most annoying issues with using Notion was that you couldn't get much done offline because of its cloud-first architecture. The company has finally solved that problem, adding support for an offline mode to its apps.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1824cba5956b22ecce6497829fe987671ffc4d02",
      "title": "Ticks are migrating, but scant surveillance may leave doctors in the dark on patient treatment",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5507076/ticks-are-migrating-but-scant-surveillance-may-leave-doctors-in-the-dark-on-patient-treatment",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Health departments struggle to adequately survey for ticks to warn doctors about new species and the diseases they carry.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "077e03855e9857b79ecf1348f63a3806eaa4c572",
      "title": "Australia’s peak Jewish group condemns Netanyahu’s ‘clumsy’ attack on Albanese and calls for end to ‘spat’",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/ecaj-letters-to-benjamin-netanyahu-anthony-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T10:11:32.000Z",
      "summary_90w": "",
      "raw": "Executive Council of Australian Jewry says Australian and Israeli governments should use ‘diplomacy rather than public posturing’\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s peak Jewish group has lambasted Benjamin Netanyahu’s attack on Anthony Albanese as “inflammatory and provocative”, adding that the “clumsy intervention” showed a “woeful lack of understanding of social and political conditions in Australia” – notwithstanding what the group describes as “unseemly” conduct from Australia’s leader.\nThe concerned intervention by the Executive Council of Australian Jewry (ECAJ) came as Australia and Israel entered the third day of a diplomatic tit-for-tat prompted by Australia’s visa cancellation of far-right Israeli politician Simcha Rothman on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffd3f610b15a0112184339ff6b7aea13ec0cc707",
      "title": "Actress Aubrey Plaza says grief is a 'giant ocean of awfulness'",
      "url": "https://www.bbc.com/news/articles/c30z944q42do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T09:47:33.000Z",
      "summary_90w": "",
      "raw": "The US actress says life is \"a daily struggle\", seven months after husband Jeff Baena's suicide.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1cb30a04afeed0dc4c9e53072e8408221e46eb8",
      "title": "DR Congo rebels killed 140 civilians despite peace process, rights group says",
      "url": "https://www.bbc.com/news/articles/c8x5y2zvzk0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T09:40:44.000Z",
      "summary_90w": "",
      "raw": "Attacks were carried out in more than a dozen villages last month, Human Rights Watch says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33608c51b45b57a766acec6d31039aa5ed38f1c1",
      "title": "Trump administration wants government to have an equity stake in chipmaker Intel",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507038/trump-administration-wants-government-to-have-an-equity-stake-in-chipmaker-intel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-20T09:15:33.000Z",
      "summary_90w": "",
      "raw": "The Trump administration is pursuing an unusual deal that would make the U.S. government a major stakeholder in chipmaker Intel. NPR unpacks the proposal with Bloomberg reporter Mackenzie Hawkins.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "76a26502b7d85fb5f1fb1b9d78cfd1ad0f72ff97",
      "title": "Josh Willie named new Tasmanian Labor leader after party officially concedes election defeat",
      "url": "https://www.theguardian.com/australia-news/2025/aug/20/josh-willie-tasmania-labor-leader-dean-winter-state-election",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T09:03:49.000Z",
      "summary_90w": "",
      "raw": "Leadership spill comes day after Dean Winter bid to form government via no-confidence motion in parliament fell flat\n\nGet our breaking news email, free app or daily news podcast\n\nTasmanian Labor has replaced Dean Winter as parliamentary leader, with Josh Willie elected unopposed to serve as the state’s new opposition leader.\nThe party, which has been in opposition for 11 years, met for more than seven hours on Wednesday before announcing Willie’s appointment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ea88f622219d5c5046ad96cb50dd939125654e4c",
      "title": "Family of NZ fugitive on the run with children pleads for return",
      "url": "https://www.bbc.com/news/articles/c3v37ye0l0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T08:44:20.000Z",
      "summary_90w": "",
      "raw": "Tom Phillips and his children have been missing since 2021, in a case that has gripped New Zealand.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "81d48bac771ff4897bce370e79ce48fcf0b2eb82",
      "title": "Dozens of Afghan deportees from Iran killed in bus crash",
      "url": "https://www.bbc.com/news/articles/c336jj5xkvko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T08:31:53.000Z",
      "summary_90w": "",
      "raw": "At least 17 children were among those killed after the bus crashed and caught fire on its way to Kabul.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d1276875310896003db93303bd06ec3bb1b4ce44",
      "title": "Fireball lights up sky over western Japan",
      "url": "https://www.theguardian.com/science/2025/aug/20/fireball-lights-up-sky-japan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T08:21:21.000Z",
      "summary_90w": "",
      "raw": "Flash of light visible for hundreds of miles was an exceptionally bright meteor, say experts\nA huge fireball dashed across the skies of western Japan, shocking residents and dazzling stargazers, though experts said it was a natural phenomenon and not an alien invasion.\nVideos and photos emerged online of the extremely bright ball of light visible for hundreds of miles shortly after 11.00pm local time (1400 BST) on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27ca658b5c0fbd4a1731de6a8ee774f584d04e91",
      "title": "Jewellery, cash or first cars: Do rewards boost exam grades?",
      "url": "https://www.bbc.com/news/articles/cgqnzy9ej0do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T07:38:42.000Z",
      "summary_90w": "",
      "raw": "Some parents offer money and gifts ahead of exams results - but does the promise of a reward work?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e01092f21a6dd0a7ac3b46d3103bc76d86f761cb",
      "title": "'He fixes what needs fixing' - why Raducanu turned to Nadal's ex-coach ",
      "url": "https://www.bbc.com/sport/tennis/articles/c5ypke1n361o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T07:06:58.000Z",
      "summary_90w": "",
      "raw": "Emma Raducanu recently appointed another full-time coach in Spaniard Francisco Roig - BBC Sport speaks to those who know him best.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e01092f21a6dd0a7ac3b46d3103bc76d86f761cb",
      "title": "'He fixes what needs fixing': Why Raducanu turned to Nadal's ex-coach",
      "url": "https://www.bbc.com/sport/tennis/articles/c5ypke1n361o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T07:06:58.000Z",
      "summary_90w": "",
      "raw": "Emma Raducanu recently appointed another full-time coach in Spaniard Francisco Roig - BBC Sport speaks to those who know him best.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e9ecebfef7217ccba8f71dbe87236cd4c6a308d",
      "title": "Heavy rain paralyses India's financial capital Mumbai",
      "url": "https://www.bbc.com/news/articles/cx29jw7488go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T06:52:13.000Z",
      "summary_90w": "",
      "raw": "Nearly 600 people were rescued from a stalled monorail system and 350 others have been shifted to shelters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d878abc47011950c1db1e8d6d11ffdf056ecf28c",
      "title": "US in talks over 10% Intel stake, White House confirms",
      "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T06:37:52.000Z",
      "summary_90w": "",
      "raw": "The potential deal could involve swapping government grants for shares in the chip making giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a768fc767ed38e299fe3d1771a01b695845d41ce",
      "title": "Walmart recalls possibly radioactive shrimp after public warned not to eat",
      "url": "https://www.bbc.com/news/articles/c5ypg4rgnrno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T06:05:55.000Z",
      "summary_90w": "",
      "raw": "US consumers are being advised to throw away shrimp with the supermarket's Great Value label.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc3ed04036b3539e666dfbc3cfe221574abfb68c",
      "title": "US strikes deportation deals with Honduras and Uganda",
      "url": "https://www.bbc.com/news/articles/cn02eezlykdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T05:53:37.000Z",
      "summary_90w": "",
      "raw": "Uganda and Honduras have agreed to accept migrants of other nationalities who have been deported from the US, CBS reports.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6c56987f3e126fa2a83dce39a13901930115a36",
      "title": "Malaysian state threatens to jail Muslim men who skip Friday prayers",
      "url": "https://www.theguardian.com/world/2025/aug/20/malaysian-state-threatens-to-jail-muslim-men-who-skip-friday-prayers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T05:50:34.000Z",
      "summary_90w": "",
      "raw": "Under the new laws in Malaysia’s Terengganu state, first-time offenders could be imprisoned for up to two years and fined\nThe Malaysian state of Terengganu has threatened to jail men who skip Friday prayers without a valid reason for up to two years.\nUnder sharia law in the state, first-time offenders could be imprisoned for up to two years, and fined 3,000 ringgit (£527), or both, according to new rules that came into effect this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4ba1e658887c50df9642cf490b109f962d033b",
      "title": "Walmart recalls frozen shrimp over potential radioactive contamination",
      "url": "https://www.npr.org/2025/08/20/nx-s1-5507971/walmart-recall-frozen-shrimp-radioactive",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-20T05:18:08.000Z",
      "summary_90w": "",
      "raw": "The risk from the recalled shrimp is \"quite low,\" said Donald Schaffner, a food safety expert at Rutgers University. Cesium-137 is a byproduct of nuclear reactions.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7f8732ad6cd12eb2d55b54ed5de31902d79bfc82",
      "title": "Watch: Moment fireball lights up night sky in Japan",
      "url": "https://www.bbc.com/news/videos/cwy0x2dngj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T05:12:32.000Z",
      "summary_90w": "",
      "raw": "The skies above southern Japan were illuminated late on Tuesday evening after dust or asteroid fragments burnt up in the atmosphere.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0d9d08fbb28f5ab988c8aa27173b98eb7a7e66a",
      "title": "Leaked report shows 10,000 shortfall in probation staff to manage offenders",
      "url": "https://www.bbc.com/news/articles/cy7yj0gkl3zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T05:00:14.000Z",
      "summary_90w": "",
      "raw": "There is a shortage of probation staff to manage offenders serving sentences in the community, a report shows.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92cf5d79f3ae674aaf360b42b7f84bb21c2fd7e1",
      "title": "MND left her without a voice. Eight seconds of scratchy audio gave it back to her",
      "url": "https://www.bbc.com/news/articles/c1ejvxne7elo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T04:51:38.000Z",
      "summary_90w": "",
      "raw": "Sarah Ezekiel was 34 with two children when motor neurone disease took away her ability to speak.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Is Bristol cooler than Berlin? Play BBC Weather’s new guessing game Cooler Than Me?",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-20T04:24:40.000Z",
      "summary_90w": "",
      "raw": "The new guessing game from BBC Weather",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54cd80a183ed6d003ccff740ac131232e71678f3",
      "title": "Chinese man jailed in US for sending weapons to North Korea",
      "url": "https://www.bbc.com/news/articles/cg4xg0dlzwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T04:12:21.000Z",
      "summary_90w": "",
      "raw": "Shenghua Wen received around $2m (£1.5m) from North Korean officials to ship weapons from California.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "897cd5a949e85f1ba5853a425cd114d7c6fb6fe4",
      "title": "Family of New Zealand fugitive on the run for almost four years with his children plead for his return",
      "url": "https://www.theguardian.com/world/2025/aug/20/new-zealand-fugitive-tom-phillips-children-hiding-nearly-four-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-20T02:41:25.000Z",
      "summary_90w": "",
      "raw": "In a New Zealand television interview, relatives spoke of their anguish since Tom Phillips disappeared with his three children in late 2021\nThe family of a fugitive father who has been hiding for more than three years in New Zealand’s rugged wilderness with his three children has pleaded with the man to come home, in some of their first public comments since he vanished.\nJust before Christmas 2021, Tom Phillips fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a dispute with their mother. Phillips does not have legal custody of his children.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9ca2e55ad84c4ca9f7af96c394b272ba4d79f9d",
      "title": "Watch: Competitors walk slackline 400m above Chinese gorge",
      "url": "https://www.bbc.com/news/videos/c4glq8d35n3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T01:46:37.000Z",
      "summary_90w": "",
      "raw": "Participants walked between two peaks more than a kilometre apart on a slackline just 2cm wide.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11bc84a3a9589c12ec2420c2c92b1f2c2db48fb3",
      "title": "Six severed heads found on road in Mexico",
      "url": "https://www.bbc.com/news/articles/c8ry1m202nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-20T01:07:45.000Z",
      "summary_90w": "",
      "raw": "Police have not given a motive for the killings in a large peaceful region of central Mexico.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bad964bc7a725c6f3fe915cfbc371b2230581b55",
      "title": "Empty homes are on the rise. So why aren't they being used to solve the housing shortage?",
      "url": "https://www.bbc.com/news/articles/c3r413l5n57o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:08:39.000Z",
      "summary_90w": "",
      "raw": "There are almost 720,000 empty homes in England. And many more on social housing waiting lists - so why aren't we better using one to help solve the other, and is it a case of a missed opportunity?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93e5c4b97fa991c092f6d9f61052fb2748ae28b2",
      "title": "Sanex shower gel ad banned over racial stereotype",
      "url": "https://www.bbc.com/news/articles/cn92znzx8zzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-19T23:05:29.000Z",
      "summary_90w": "",
      "raw": "The TV ad depicted two black models with skin problems and a white model without.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89147b794a94cb5c9271cf89f52b520682ceec13",
      "title": "'The danger is not over in Pakistan' after flash floods",
      "url": "https://www.bbc.com/news/videos/ckgj8kwrvxgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T21:14:13.000Z",
      "summary_90w": "",
      "raw": "Emergency teams searching for the missing are struggling through mud and debris, following flash flooding in Khyber Pakhtunkhwa province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b2ad3bdacc5dc1dd0b032cae42d844bc8d3c82c",
      "title": "Trump under pressure as obstacles to progress on Ukraine persist",
      "url": "https://www.bbc.com/news/articles/c776edpr10eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T20:48:56.000Z",
      "summary_90w": "",
      "raw": "Meetings in Alaska and Washington were high on pomp and low on breakthroughs, but there were two potentially significant developments.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07ae72a57aca8d210e3bfb2fbe31cab2c31739ed",
      "title": "Chili's has staged a remarkable revival in sales",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5506272/chilis-has-staged-a-remarkable-revival-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T20:21:58.000Z",
      "summary_90w": "",
      "raw": "The 50-year-old casual dining chain Chili's has posted five straight quarters of double digit sales increases. NPR's Mary Louise Kelly talks with Slate's Dan Kois about what's behind the brand's turnaround.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "078f4ee105358c0200b970baadd4ab1b5a835f7e",
      "title": "Watch: Moment debris skyrockets after gas line explosion",
      "url": "https://www.bbc.com/news/videos/c9qy51xwxwqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T19:49:19.000Z",
      "summary_90w": "",
      "raw": "Three firefighters were injured in the North Carolina explosion, which resulted from a car crashing into a building's gas line.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T19:37:56.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jeanpormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "93e6d03c7c4e4531f649edf86d10c6cdf123c005",
      "title": "Peruvian woman accused of trying to smuggle cocaine into Bali using sex toy",
      "url": "https://www.theguardian.com/world/2025/aug/19/peruvian-woman-bali-cocaine-smuggling",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T19:23:25.000Z",
      "summary_90w": "",
      "raw": "Officers say they found 1.4kg of drug inside toy in woman’s underwear and also accused her of hiding ecstasy pills\nA Peruvian woman has been arrested in Bali after allegedly trying to smuggle cocaine into the Indonesian resort island using a sex toy and hiding drugs in her underwear, police said.\nThe 42-year-old, identified only by her initials NS, arrived at Bali’s international airport from Qatar on 12 August when authorities became suspicious.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "05652f0296eef23ac43f283c2f5203c0500df8e0",
      "title": "Home Depot keeps quiet on immigration raids outside its doors",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5504124/home-depot-earnings-immigration-raids-day-laborers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T18:32:19.000Z",
      "summary_90w": "",
      "raw": "The home-improvement chain is now one of the companies most caught up in Trump's immigration crackdown. The retailer's history with day laborers is long. So far, it's choosing to keep its distance.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1237a488c7fed6bba5b67688d94e11d570a1e3fc",
      "title": "Why Oval Office map has played crucial role in Trump's view of Ukraine war",
      "url": "https://www.bbc.com/news/articles/cjeynw8jppdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T17:06:59.000Z",
      "summary_90w": "",
      "raw": "Ukraine's leader has taken issue with the American map, because of the amount of control it gives Russia.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc595540d80662f85fbc4697aadf01a3a421a495",
      "title": "Diphtheria cases spiralling in Somalia, health officials warn",
      "url": "https://www.theguardian.com/world/2025/aug/19/diphtheria-cases-spiralling-somalia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:46:12.000Z",
      "summary_90w": "",
      "raw": "MSF says low vaccination coverage and poor living conditions driving spread of deadly bacterial disease\nDiphtheria cases are rapidly increasing across Somalia, officials and humanitarians warn, with children accounting for more than 97% of the cases.\nDiphtheria, a highly contagious and deadly bacterial disease that mainly affects children, is preventable by a vaccine. While Somalia has improved vaccination rates in recent years, the medical charity Médecins Sans Frontières (MSF) blames the uptick in cases on persisting immunisation gaps.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a69509bcd96ce8786a899f4a9734c85aef21c2ae",
      "title": "Brazil issues last-ditch plea for countries to submit climate plans ahead of Cop30",
      "url": "https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T16:38:38.000Z",
      "summary_90w": "",
      "raw": "Only 28 countries have submitted carbon-cutting proposals to the UN, with some of the biggest emitters yet to produce plans\nBrazil has issued an urgent call for all countries to come forward with strengthened national plans on the climate, in a last-ditch attempt to meet a key September deadline.\nOnly 28 countries have so far submitted carbon-cutting proposals to the UN, with some of the biggest emitters of greenhouse gases – including China and the EU – still to produce their plans.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a14344caf7151994169632bcfb6d0f9797a9d04d",
      "title": "Finnish politician dies in parliament in Helsinki",
      "url": "https://www.bbc.com/news/articles/cqxgde2gv31o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T16:01:42.000Z",
      "summary_90w": "",
      "raw": "Eemeli Peltonen's sudden death shocks Finland, with politicians on all sides expressing their sadness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c83215dd1b60362dbf7df75be0608a4595067a50",
      "title": "Air Canada flights slowly resume after flight attendants agree to end their strike",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5507052/air-canada-flights-resume-flight-attendants-union-strike",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T15:25:59.000Z",
      "summary_90w": "",
      "raw": "The flight attendants' union said a new agreement guarantees members will be paid for work performed while planes are on the ground, resolving one of the major issues that drove the strike.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "267dc77071083d12db91173e312a9f0de4142fe4",
      "title": "Conservative leader wins Canada byelection, regaining parliament seat",
      "url": "https://www.theguardian.com/world/2025/aug/19/pierre-poilievre-wins-canada-parliament",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T15:11:51.000Z",
      "summary_90w": "",
      "raw": "Pierre Poilievre returns to House of Commons after shock April loss and narrower margin in Tory stronghold\nCanada’s Conservative leader, Pierre Poilievre, has won a closely watched byelection in the province of Alberta, giving him a chance to return to parliament after suffering a shock defeat in April’s federal election.\nPoilievre finished with 80.4% of the vote after Monday’s election in the riding of Battle River-Crowfoot, in the deeply Conservative western province.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97f7fdde2d1b3b6f064f429e0e6ee1f92721a11b",
      "title": "Mediators optimistic Israel will accept ceasefire deal that is ‘almost identical’ to one they earlier agreed – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/19/aid-ship-food-gaza-cyprus-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T14:09:04.000Z",
      "summary_90w": "",
      "raw": "Qatar says no breakthrough has yet been made but Hamas has given ‘positive response’\nThe UN’s human rights office on Tuesday condemned a far-right Israeli minister for taunting a Palestinian prisoner in his cell and sharing the footage online, Reuters reports.\nNational security minister Itamar Ben-Gvir published a video on Friday last week showing him confronting Marwan Barghouti, the most high-profile Palestinian detainee in Israeli custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76f7c791877dd96391ea7d2443d0f28f19c3cdc0",
      "title": "Air Canada flight attendants reach ‘tentative’ deal with airline to end strike",
      "url": "https://www.theguardian.com/world/2025/aug/19/air-canada-strike-tentative-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T13:31:37.000Z",
      "summary_90w": "",
      "raw": "Strike over wages and ground work has cancelled travel for 500,000 people worldwide\nAir Canada flight attendants say they have reached a “tentative” deal with the airline to end a strike over wages and ground work that has cancelled travel for half a million people worldwide.\nRoughly 10,000 flight attendants walked off the job after midnight Saturday, insisting Air Canada had failed to address their demands for higher pay and compensation for unpaid ground work, including during boarding.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a43d3245a58c4a9f971d980091296e45bb0f598a",
      "title": "Israel to respond by Friday over Gaza truce plan accepted by Hamas",
      "url": "https://www.theguardian.com/world/2025/aug/19/israel-to-respond-by-friday-gaza-truce-plan-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T12:31:11.000Z",
      "summary_90w": "",
      "raw": "Israel under pressure to accept ceasefire proposal that is said to be almost identical to earlier US-backed plan\n\nMiddle East crisis – live updates\n\nIsrael has said it will deliver its response to international mediators by Friday over a new Gaza ceasefire plan accepted by Hamas amid mounting pressure for a truce in a war that has claimed more than 62,000 Palestinian lives.\nAfter mass protests in Israel demanding a deal to secure the release of the remaining 20 living Israeli hostages held in Gaza, it appeared that Hamas had reduced its demands over a prisoners-for-hostages exchange as well as over the scope of an Israeli-demanded “security buffer zone”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d95b26375170b67026e0a2943112402cf398546",
      "title": "Watch: Two presidents, two very different Oval Office encounters",
      "url": "https://www.bbc.com/news/videos/c74173p9nexo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T09:39:52.000Z",
      "summary_90w": "",
      "raw": "Onlookers gasped as Trump and Zelensky's meeting in Washington in February descended into chaos, but times have changed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c4dd89487e14038f0d6692c2b2472b307a2a0d1",
      "title": "Businesses face 'chaos' as EPA aims to repeal its authority over climate pollution",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5501576/climate-pollution-epa-regulation-endangerment-finding",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-19T09:39:04.000Z",
      "summary_90w": "",
      "raw": "A lot of companies want the EPA in charge of setting national climate regulations because it helps shield them from lawsuits and creates a predictable environment in which to make investments.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d640e1f9f9f58b02ea920a08075c342215f40662",
      "title": "Watch: Zelensky's 'fabulous' suit and other moments from Trump meeting",
      "url": "https://www.bbc.com/news/videos/crlzey2j406o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T05:37:10.000Z",
      "summary_90w": "",
      "raw": "Ukraine's president and other European leaders met at the White House to talk peace.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b73820569f15be3b03831e14bc5c89997e3d438d",
      "title": "Four key takeaways from Ukraine talks in Washington",
      "url": "https://www.bbc.com/news/articles/c5yp4jggrj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-19T01:01:32.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky managed to avoid another disastrous Oval Office meeting with Donald Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0323e285f2514b9889070e1eea4f3b299dda1df",
      "title": "Soldier found guilty of attempted espionage in New Zealand’s first spying conviction",
      "url": "https://www.theguardian.com/world/2025/aug/19/new-zealand-military-court-finds-soldier-guilty-of-attempted-espionage",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-19T00:06:24.000Z",
      "summary_90w": "",
      "raw": "Court martial heard soldier was caught offering to share military base maps and photographs to an undercover officer of an unnamed foreign nation\nA military court has convicted a New Zealand soldier of attempted espionage for a foreign power – the first spying conviction in the country’s history.\nThe soldier was caught offering to pass military base maps and photographs to an undercover officer posing as an agent for the foreign nation, the court martial heard.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62103f76e3604615beb5a2edb0f1a55719d63a89",
      "title": "Has Trump convinced Zelensky to meet Putin?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lxq70r?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-18T23:57:00.000Z",
      "summary_90w": "",
      "raw": "And can Trump convince Putin to meet Zelensky?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ff38cd0bea88df8d5c6b29a0a1612692a7f7b505",
      "title": "'No-one comes for us': The women trapped in Afghanistan's mental health system",
      "url": "https://www.bbc.com/news/articles/c80dg700dego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T22:19:29.000Z",
      "summary_90w": "",
      "raw": "Accessing treatment in an Afghan mental health facility is difficult - but getting out can be harder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d97caa4623f1eeef8d23be5edec308c858628351",
      "title": "'SNL' castmember Bowen Yang shares a piece of 'cultural contraband' from his youth",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5503406/bowen-yang-snl-wicked-las-culturistas",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T18:45:34.000Z",
      "summary_90w": "",
      "raw": "Growing up with immigrant parents, first in Canada and then in the U.S., Yang was \"obsessed\" with pop culture and Saturday Night Live. Now he's up for an Emmy for his performances on the venerated sketch series.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "2e2f2cf4dc59303eb3e623bda9307732ab1cdc03",
      "title": "Flight attendant union leaders ‘ready to go to jail’ as Air Canada strike outlawed",
      "url": "https://www.theguardian.com/world/2025/aug/18/air-canada-flight-attendants-strike-illegal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:58:06.000Z",
      "summary_90w": "",
      "raw": "Arbitrator orders 10,000 striking staff back to work after government intervenes – unconstitutionally, union says\nUnion leaders representing 10,000 striking flight attendants have said they would be willing to go to jail rather than comply with an order to return to work, as Canada’s federal government seeks to end a bitter contract dispute that has halted hundreds of summer flights and stranded travellers around the world.\nSpeaking to reporters on Monday, the national president of the Canadian Union of Public Employees said members would remain on the picket lines as part of a work stoppage that has halted Air Canada’s national and international operations during its busiest season.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08ccd99774c3563781864bf5565d2da7215b123b",
      "title": "Zambian president’s feud with late rival continues over funeral plans",
      "url": "https://www.theguardian.com/world/2025/aug/18/zambian-presidents-feud-with-late-rival-continues-over-site-of-funeral",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:50:07.000Z",
      "summary_90w": "",
      "raw": "Family of Edgar Lungu trying to prevent repatriation of his body for state funeral presided over by his successor\nA furious row is raging over whether the Zambian president, Hakainde Hichilema, will preside over the funeral of his predecessor, Edgar Lungu, as the former president’s family wage a legal battle in South Africa to try to prevent his body from being repatriated.\nThe legal fight marks the latest twist in a feud between the two men that goes back at least a decade and has now outlasted the former president, who died in South Africa in June aged 68 while being treated for an undisclosed illness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "facc3062cf8edcf54b3e448d7a5c14915d4d29bc",
      "title": "Hamas tells mediators it approves latest Gaza ceasefire proposal – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/18/israel-protests-government-new-offensive-gaza-city-middle-east-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-18T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Hamas official tells Reuters news agency it has approved latest Gaza ceasefire proposal. This live blog is closed\n\nHamas says it accepts proposal for Gaza ceasefire and release of hostages\n\nNorway’s sovereign wealth fund, the world’s largest, said on Monday it had decided to exclude six companies with connections to the West Bank and Gaza from its portfolio, following a review of its Israeli investments.\nThe $2tn wealth fund did not name the companies it had decided to exclude, but said these would be made public once the divestment was completed, Reuters reports.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "94858bd9a9da78f38ea9290ae97f6310aa984ad2",
      "title": "BBC at Rafah crossing as queues of aid trucks wait to enter Gaza",
      "url": "https://www.bbc.com/news/videos/cev2nmwxe1po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T16:11:47.000Z",
      "summary_90w": "",
      "raw": "The BBC's Chief International Correspondent Lyse Doucet is travelling with Palestinian Prime Minister Mohammad Mustafa and Egypt’s Foreign Minister Badr Abdelatty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ebeba55e5936b3ddf9dbaeab1d28216b860c4ac7",
      "title": "'No-one was expecting this': European leaders rush to US to help Ukraine avoid 'capitulation'",
      "url": "https://www.bbc.com/news/articles/c9d0v8ljw3no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T15:31:36.000Z",
      "summary_90w": "",
      "raw": "The heads of state hope to stop Trump from threatening long-term European security, writes James Landale.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8df0cdecbec83f45ba9c846e7fef2baa83c3362",
      "title": "Newsmax pays $67 million to settle defamation case linked to 2020 election coverage",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5506062/newsmax-pays-67-million-to-settle-defamation-case-linked-to-2020-election-coverage",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-18T14:37:16.000Z",
      "summary_90w": "",
      "raw": "The right-wing news channel Newsmax has agreed to pay $67 million to Dominion Voting Systems over its coverage of the 2020 presidential election. A trial had been scheduled for October.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d91c7f44192f3bdf5878dae3145b62c6abf303",
      "title": "'The water had no mercy': Hundreds killed as floods ravage north Pakistan",
      "url": "https://www.bbc.com/news/articles/ce3jeed2798o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-18T11:00:34.000Z",
      "summary_90w": "",
      "raw": "BBC visited villages which were wiped out overnight by rains, flash floods and landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3ed07098c713b5cb859bf771414823048530fe7e",
      "title": "Air Canada suspends restart plans after union defies return to work order",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5505416/air-canada-suspends-restart-plans",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-17T18:38:41.000Z",
      "summary_90w": "",
      "raw": "Air Canada will resume flights Monday evening, claiming the union illegally directed flight attendants to defy a return-to-work order.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "304d6ee1d5b04aea5df2df87bb2e56240dbe22a0",
      "title": "Washington's hydropower has created a data center boom. Some are concerned about its future.",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5501579/washington-hydropower-data-center-boom-sustainability-climate-change",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-17T09:00:59.000Z",
      "summary_90w": "",
      "raw": "In small town Washington — where hydropower is plentiful — data centers are creating jobs and funding amenities. But water and energy aren't unlimited — and some worry about long-term sustainability.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "879b2765ebd2f6259e75ae633936c8047d006b43",
      "title": "Class-action suit claims Otter AI secretly records private work conversations",
      "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-16T00:44:21.000Z",
      "summary_90w": "",
      "raw": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b3b5ec2736204927f9273609bb6ff0a286aa9c2",
      "title": "Brain implants that decode a person's inner voice may threaten privacy",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5500191/brain-implants-that-decode-a-persons-inner-voice-may-threaten-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-15T20:46:33.000Z",
      "summary_90w": "",
      "raw": "A new brain-computer interface can decode a person's inner monologue. That could help paralyzed people communicate, but also suggests scientists are one step closer to reading a person's thoughts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47bb015d5e19f4ced0ced7ff1933626dbeb9a687",
      "title": "New drama from acclaimed writer Jimmy McGovern",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002g7zb?at_mid=93AqQATdig&at_campaign=Unforgivable&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002g7zb&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Unforgivable&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-07-24T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Critically acclaimed one-off drama from the multi-award-winning screenwriter",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}