{
  "version": "1756896709907",
  "generatedAt": "2025-09-03T10:51:49.907Z",
  "items": [
    {
      "id": "88e9e1a85e6e151f1a7dc479bdb70043200387e4",
      "title": "Online speech laws need to be reviewed after Linehan arrest, says Streeting",
      "url": "https://www.bbc.com/news/articles/cx2922w73e1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T10:42:23.000Z",
      "summary_90w": "",
      "raw": "The health secretary says ministers wanted police to focus on street crime rather than posts on social media.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20734de9be72d9662dfcda04a60d7fdca24067c1",
      "title": "At least 24 Palestinians killed by Israeli military across Gaza on Wednesday, say health officials – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T10:30:46.000Z",
      "summary_90w": "",
      "raw": "Head of Unrwa says Gaza is becoming ‘graveyard of international humanitarian law’ as Israel continues its offensive on Gaza City\nYemen’s Houthis have claimed responsibility for a missile launched at Israel (see 8.17am BST), saying they fired two ballistic missiles at Tel Aviv in what they said was an initial response to Israeli attacks on Yemen.\nThe Israeli military moved deeper into Gaza City on Wednesday, with soldiers and tanks pushing into Sheikh Radwan, one of the urban centre’s largest and most crowded neighbourhoods, reports Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9122eaec0d3c3caa2eb5e06cd8a21774dc756b3",
      "title": "Hitler's bunker is now just a parking lot. But it's a 'dark tourism' attraction anyway",
      "url": "https://www.npr.org/sections/planet-money/2025/09/03/g-s1-86572/hitlers-bunker-is-now-just-a-parking-lot-but-its-a-dark-tourism-attraction-anyway",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Why evil histories sell. A visit to Hitler's bunker, and a deep dive into the economics and ethical quandaries of \"dark tourism.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd811092ffec04dff96c6db0448907ab246d9d96",
      "title": "UK cement production drops to lowest levels since 1950s",
      "url": "https://www.bbc.com/news/articles/clyryzpx7g5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T09:47:12.000Z",
      "summary_90w": "",
      "raw": "The Mineral Products Association says the decline threatens to impact the government's housing plans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "681204107cb37a5031873434f19107c94ec4bd3e",
      "title": "Jamaicans head to polls for election as ruling party faces corruption concerns",
      "url": "https://www.theguardian.com/world/2025/sep/03/jamaican-general-election",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:45:19.000Z",
      "summary_90w": "",
      "raw": "Polls point to ‘very close election’ between the Jamaica Labourparty and the opposition People’s National party\nJamaicans head to the polls on Wednesday for a closely fought general election which has been overshadowed by an investigation into potential corruption in the ruling Jamaica Labour party (JLP) which is seeking a third term in office.\nThe latest local poll put the opposition People’s National party (PNP) 3.1% lead over the JLP, but political analyst Damion Gordon cautioned that the lead was barely larger than the margin of error.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31591fc0835ac37803c4c9adbfd4f535de6d2219",
      "title": "Neo-nazi Thomas Sewell will continue to commit violent offences that could lead to death, police tell court",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/neo-nazi-thomas-sewell-will-continue-to-commit-violent-offences-that-could-lead-to-death-police-tell-court-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:35:05.000Z",
      "summary_90w": "",
      "raw": "Sewell, who has been charged over alleged attack on Indigenous protest site, described in court as having ‘at his disposal a large group of followers’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-nazi Thomas Sewell – who allegedly led an attack on a First Nations encampment in Melbourne over the weekend – will continue to commit violent offences that could lead to death, a court heard.\nSewell, 32, applied to be freed on bail on Wednesday after being charged over an alleged attack on Melbourne’s Camp Sovereignty on Sunday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a079a9294ea0636a9ae4517446356559accf6f7b",
      "title": "Four Chinese carmakers enter Australian top 10 for first time, while Tesla sales slump",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/chinese-car-makers-byd-gwm-chery-mg-australian-top-10-sales-tesla-slump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:32:23.000Z",
      "summary_90w": "",
      "raw": "BYD overtakes Mitsubishi after nearly quadrupling sales in past year, according to official figures, as GWM, MG and Chery also surge\n\nGet our breaking news email, free app or daily news podcast\n\nAustralians bought more than 20,000 Chinese-made vehicles in August, putting four Chinese brands into the top 10 for the first time, while Tesla sales have slumped by more than a third.\nBYD came in sixth for the month, overtaking Mitsubishi, after its sales nearly quadrupled compared with August 2024, while GWM, MG and Chery each outsold Isuzu Ute in the month to round out the top 10.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4190dc6ee79e29462b23ccc66433afca076bb47",
      "title": "Alleged Porepunkah killer shown ranting at police in pandemic-era footage as manhunt continues",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/alleged-porepunkah-killer-dezi-freeman-shown-ranting-at-police-pandemic-era-footage-as-manhunt-continues-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:29:17.000Z",
      "summary_90w": "",
      "raw": "Videos show Dezi Freeman arguing about Covid-19 mask mandates and telling police they have ‘intelligence of kindergarten children’\n\nGet our breaking news email, free app or daily news podcast\n\nMore than 100 properties have been searched in the hunt for the alleged Porepunkah police killer, as footage of the fugitive arguing about mask mandates with police during the pandemic emerges.\nOn the ninth day of the search Victoria’s police chief commissioner, Mike Bush, would not be drawn on where they think Dezi Freeman is after he allegedly shot and killed two officers at a property in Porepunkah, about 300km north-east of Melbourne last Tuesday. Police teams were on Wednesday seen working on the south-eastern side of the valley under Mount Buffalo.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4827aec408e374f42ee2a797f5cf51ab212876cb",
      "title": "Australia could pay up to $2.5bn to Nauru over 30 years to take noncitizens, home affairs department says – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:18:49.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nHusic rebukes PM’s assertion ‘good people’ went to March for Australia rallies as Nampijinpa Price walks back immigration claim\n\nGet our breaking news email, free app or daily news podcast\n\nRowland denies government trying to put more information out of public’s reach\nSo what about the Albanese government’s promise that it’s open and transparent?\nAs we found out through robodebt, which was another example of a lack of transparency which cost people lives under the previous government, just labelling something cabinet in confidence does not make it so and we intend to enshrine that in this law.\nWe’ve had cases where FoI requests have been generated, sometimes around 600 of them in one instance, going to a small agency, which tied up the services of that agency for over two months. Now, you might think that’s not important, but let me tell you what that agency was. That was eSafety. That is an organisation responsible for ensuring the safety, particularly of young people, online getting tied up, doing 600 frivolous FoI requests that they are required by law to deal with.\nI would point out that there is currently a charging regime in the Freedom of Information Act, and every state and territory bar the ACT actually imposes a modest application fee of somewhere between $30 and the mid-50s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca88188114a1190628367f04f5c933d17d2d9e15",
      "title": "Husic rebukes PM’s assertion ‘good people’ went to March for Australia rallies as Nampijinpa Price walks back immigration claim",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/ed-husic-anthony-albanese-jacinta-nampijinpa-price-march-for-australia-immigration-comments-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:11:29.000Z",
      "summary_90w": "",
      "raw": "Federal politicians express concern at anti-immigration sentiment targeting Indian Australians\n\nGet our breaking news email, free app or daily news podcast\n\nThe former Labor minister Ed Husic has rebuked Anthony Albanese’s assertion that “good people” attended last weekend’s anti-immigration rallies, saying “I haven’t seen a good fascist yet”.\nAsked on Wednesday if he agreed with the prime minister’s suggestion that among the neo-Nazis and far-right activists at Sunday’s rallies would have been “good people” concerned about immigration, the now Labor backbencher pushed back.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on drug-carrying vessel from Venezuela",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T09:10:59.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e86b9f97448a1099fc747a1f3156f8d5dca8a0d1",
      "title": "What new weapons on show at huge parade say about China's military strength",
      "url": "https://www.bbc.com/news/articles/cjr1reyr059o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T09:07:04.000Z",
      "summary_90w": "",
      "raw": "Beijing has unveiled a range of military hardware in a show of might to Western powers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded1eba6568cb83acb1b0db7a34aa4a6154c7d25",
      "title": "Food giant Kraft Heinz to split into two companies",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525657/food-giant-kraft-heinz-to-split-into-two-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T09:02:02.000Z",
      "summary_90w": "",
      "raw": "Food giant Kraft Heinz is splitting up into two companies a decade after the merger that was arranged by billionaire investor Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b2614fa0d6d6c0c69ad84e8a84b0ff8cd3abd0d",
      "title": "Acer gives its 18-inch Predator Helios gaming laptop a 4K screen and top GPU",
      "url": "https://www.theverge.com/news/769243/acer-gives-its-18-inch-predator-helios-gaming-laptop-a-4k-screen-and-top-gpu",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "It looks just like the current Predator Helios 18 laptop, but the new 18P model has a 4K screen and even higher-end graphics.\t\n\nAcer is refreshing some of its gaming laptops for IFA 2025, with a big new Predator Helios 18P AI at the high end and pair of more affordable Nitro V 16 models.\nThe Predator Helios 18P will have up to an RTX 5090 GPU and Intel Core Ultra 9 285HX processor, though in any configuration it should come with a 18-inch 4K / 120Hz Mini LED display and two Thunderbolt 5 ports (among many other ports). The 18P’s availability and North American price is still TBD, but it’s sure to be up there since it’ll start at 4,999 euros.\nAt the more affordable end, the new Acer Nitro V 16 and 16S are launching in October and November, respectively. The 16 starts at $999.99 / 1,299 euros and the slightly smaller and lighter 16S starts at $1,099.99 / 1,399 euros. Both 16-inchers can go up to an Intel 270H processor and RTX 5070 GPU.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bcfa90a3631e64289a0e71e0d294dfa75c44091b",
      "title": "Acer’s new Amadana and CE270 monitors are unusually, strikingly stylish",
      "url": "https://www.theverge.com/desktop-computers/769759/acer-amadana-ce270u-z-monitors-design",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Amadana 27ART0 P1. | Image: Acer\t\n\nDid you know Acer acquired a Japanese design firm called Amadana late last year that makes classy coffee gear, retro calculators, air purifiers, and all manner of minimalist low-fi tech? Neither did I till today — but it goes a long way to explaining why a few of Acer’s new monitors at IFA 2025 are leaping off the page. \nUnfortunately for stateside readers, Acer has no current plans to ship its Amadana branded products below in the US. The 27-inch 27ART0 P1 desktop monitor — whose display is just 8mm thick — and the 16-inch, 1.4-pound 16APM1QJ portable monitor, are headed to EMEA regions in Q1 for €169 and €119 respectively.\n\nThey’re not heavy on tech, anyhow: they’re 1080p IPS screens, at just 250 nits of brightness, and only the desktop monitor reaches 144Hz. The portable panel, with USB-C and mini-HDMI input, is limited to 60Hz, though both monitors offer variable refresh rate.\nBut the Acer CE270U Z, below and atop this story, will come to North America for $700 in Q1, and feature a 26.5-inch 1440p OLED panel at 280Hz. It also has AMD’s flavor of variable refresh rate (FreeSync Premium Pro) and peak brightness of 1000 nits in HDR (250 nits typical), with two HDMI 2.1 ports and one DisplayPort 1.4. \nHere’s a look at some earlier Amadana products, courtesy of Acer. Amadana writes that it’s named after a location in Japan’s Edo period where fine lacquerware was sold.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d9688bb5dfd322916ed11dd2ad710f028d6d228",
      "title": "Acer&#8217;s 16-inch Air weighs even less than a 13-inch MacBook Air",
      "url": "https://www.theverge.com/news/769784/acer-swift-air-16-amd-lightweight-macbook-ifa-2025-specs-price",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "There are laptops out there with power adapters heavier than this entire 16-inch laptop.\t\n\nAcer is announcing a new Swift Air 16 at IFA 2025, and it’s an absolute featherweight of a 16-inch laptop. Weighing in at 2.18 pounds / 0.99kg with an IPS display or 2.43 pounds / 1.1kg with its optional OLED, the Swift Air is lighter than even a 13-inch MacBook Air. It also packs more ports than the MacBook, and will start at a lower price of €999 when it launches in November. (North American availability and pricing is still TBD.)\nIt kind of boggles my mind that the Swift Air 16 fits this much screen into such a light package, as it’s even lighter than the LG Gram — a laptop defined by its lightness. But the reality checks start coming in once you notice some of the Swift’s specs, like its thickness of 0.63 inches / 15.9mm (0.65 inches / 16.5mm for the OLED version). By contrast, the 13- and 15-inch MacBook Airs are just 0.44 inches and 0.45 inches, respectively.\nAlso, while the Swift Air’s AMD Ryzen AI 300-series chip options will be more than competent for everyday productivity tasks, I’ve seen firsthand that Apple’s M4 chip outperforms them while maintaining better battery life. The Swift Air’s starting config will come with a Ryzen AI 5 330 chip, and the top-end version uses the Ryzen AI 7 350. I tested the latter chip in the latest Framework Laptop 13 and it’s very capable, even for a touch of light gaming.\nBut the parts of the Swift Air 16 that give me the biggest pause are its HDMI spec and battery size. It’s got a decent port selection with two USB-C, one USB-A 3.2, and a 3.5mm audio jack, but its video-out port is HDMI 1.4. That’s very outdated for 2025, when you expect just about any $1,000-plus laptop to drive an external monitor at 4K / 60Hz or greater. HDMI 1.4 can only do 4K at a sub-par 24 or 30Hz. \nAnd while the Swift’s starting IPS display has a respectable 1920 x 1200 resolution at 60Hz and the optional OLED sports a 2880 x 1800 resolution with 120Hz refresh, the laptop’s battery is only 50Wh. That’s a smaller capacity than the 13-inch MacBook Air, and much smaller than the 75Wh battery in the Acer Swift 14 AI I tested earlier this year. That 14-inch Swift cousin has great battery life for a machine sporting AMD’s more power hungry chips, and the large battery was a big reason why. Acer’s own promotional materials rate the Swift 14 AI at “up to 27 hours battery life” in a video playback test. The Swift Air 16’s rated battery life in similar video playback tests? Just 13 hours — less than half. Ouch.\nOh, and did you notice the Swift Air’s gapless keyboard?\nI’ve already poked plenty of holes in the hull of the Swift Air 16 before it’s even taken its maiden voyage. But I’m still interested to see it shove off, and I’m hoping it’ll land on our shores here in the US. Despite my concerns, it’s an intriguing machine. And I’m all for a company taking some chances. But naming your laptop “Air” is going to draw the inevitable comparisons.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "96310cdef94d276758712267e65f8e7d1cfbc038",
      "title": "My brief hands-on with Acer’s new convertible Chromebook has me cautiously optimistic",
      "url": "https://www.theverge.com/hands-on/769834/acer-chromebook-plus-spin-514-2in1-mediatek-kompanio-ifa-2025-price-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "I took the Spin 514 for an early spin, and I’m looking forward to testing it further.\t\n\nAcer's new Chromebook Plus Spin 514, announced at IFA 2025 in Berlin, is the company's first laptop to use the Arm-based MediaTek Kompanio Ultra 910 processor. That chip was used in the Lenovo Chromebook Plus 14 that launched earlier this summer, and it was key to delivering excellent performance and marathon battery life in that fanless laptop. I dubbed the Lenovo \"the new king of Chromebooks,\" and this $699.99 Acer, launching this month, seems poised to be a solid alternative - especially if you prefer a touchscreen convertible and don't mind hearing a fan on occasion.\nAcer sent me the new Chromebook Plus Spin 514 for early testing, and a …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2c0d58da3655c9a3d77fd527541f80864f7d33e",
      "title": "So um, why do we say 'um' so much?",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521388/um-filler-word-of-the-week",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Who knew two letters could spark so much conversation? This week, we're breaking down the many uses of \"um\" and why the word is so controversial.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4fb004f51fcbd1ecd185543051c147299ff1558",
      "title": "The PartyBox 720 is JBL’s largest battery-powered party speaker",
      "url": "https://www.theverge.com/news/768543/jbl-partybox-720-grip-boombox-4-price-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The PartyBox 720 can run on battery power, allowing you to blast music without being tied to an outlet.\t\n\nJBL has expanded its lineup of flashy Bluetooth speakers with three new models that let you blast tunes without being tied to a power source. The launch includes the new $1,099 PartyBox 720,  which is JBL’s largest battery-powered speaker to date, weighing 7 pounds (3kg) more than the visually similar PartyBox 710 that was released in 2021.\nThe PartyBox 720 measures 16.4 x 37.1 x 16 inches, compared to 15.7 x 35.6 x 17.2 inches for the smaller 710, and expands the two 8-inch subwoofers to 9 inches. Unlike the 710, the 720 can also run on battery power, so users don’t need to hunt for an outlet. It comes with two of JBL’s rechargeable 600 batteries, which provide up to 15 hours of playtime, according to the company’s press release.\nAside from the larger dimensions and battery support, both party speakers have similar features — both provide 800 watts of power, customizable lights, an IPX4 resistance to splashing water, and they include built-in wheels and a carry handle to pull them around despite the additional weight.\nJBL is also launching the $550 Boombox 4 and the more portable $100 Grip — the latter being a new JBL product line that resembles its colorful Flip series, but with customizable ambient lighting built in. Both the Boombox 4 and Grip speakers feature an IP68 rating, making them “waterproof, dustproof, and drop-proof,” according to JBL.\nAll three speakers are available to preorder now. The PartyBox 720 is expected to be available at in-store retailers on September 21st, with the Grip and Boombox 4 arriving later on September 28th.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c075e76bb6de6d9ca1afc44db0be3efed3158b2e",
      "title": "With federal money in doubt, California's high-speed train seeks a new path forward",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5494532/california-high-speed-rail-change-of-direction",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The leaders of California's high-speed rail project say they've learned from past mistakes. But the troubled megaproject faces an uncertain future with $4 billion in federal funding tied up in court.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c9db350851553c4a7bea99939f5b62c8489db1d",
      "title": "Europe’s population crisis: see how your country compares – visualised",
      "url": "https://www.theguardian.com/world/ng-interactive/2025/feb/18/europes-population-crisis-see-how-your-country-compares-visualised",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:42:04.000Z",
      "summary_90w": "",
      "raw": "How anti-immigration politics across the EU clashes with demographic reality\nAnti-immigration politics is on the rise across Europe. France’s National Rally and Germany’s Alternative für Deutschland (AfD) each have significant representation in their country’s legislatures, meanwhile the UK’s Reform party is topping the polls.\nBut the rise of the far-right could speed up the population decline of Europe, projections show, creating economic shocks including slower growth and soaring costs from pensions and elderly care.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5debd60595c533c7f34df6227b2e6380f4d5af44",
      "title": "Hundreds of women with brooms join protests as Indonesia leader flies to China",
      "url": "https://www.bbc.com/news/articles/c7vlv2gpvvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:48.000Z",
      "summary_90w": "",
      "raw": "Hundreds of women brandishing broomsticks marched to parliament during fierce nationwide rallies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5537e990f31c1f228c4a3699c17b275fa407c5c2",
      "title": "Google will reveal its Gemini smart home plans (and hardware) next month",
      "url": "https://www.theverge.com/news/769848/google-teases-new-nest-cam-gemini-home",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T08:37:13.000Z",
      "summary_90w": "",
      "raw": "This sure does look exactly like every other Nest Cam out there.\t\n\nGoogle is overdue an update to its smart home setup, and now we know when it’ll come: October 1st. The company has teased some sort of launch or announcement for that day, promising that “Gemini is coming to Google Home.”\nThe company announced Gemini for Home at last month’s Made by Google event, promising early access would begin in October, so a dedicated event with more details before things kick off makes sense. Google’s AI assistant will eventually replace Google Assistant across the smart home, theoretically enabling natural language interactions and more intuitive controls.\nWe’re not only expecting an assistant announcement. Google’s teaser includes a glimpse of a Nest Cam, and while it looks the spitting image of existing hardware, we expect it’s a new model, rumored to launch soon alongside a new Nest Doorbell, both featuring 2K camera support. There’s also the small matter of the unknown Nest speaker glimpsed during the recent launch stream, which we expect to be at the center of Google’s new home hardware.\n\n\nIs that you, Gemini? Come in and make yourself at Home 🏠 \nSign up for updates: https://t.co/V85WgPJvQN pic.twitter.com/JJaVRW385A\n— Made by Google (@madebygoogle) September 2, 2025",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82e610cca10f41f87777ee7339defdd579cc4003",
      "title": "Asylum protests putting police under chronic pressure, chief says",
      "url": "https://www.bbc.com/news/articles/c6272r550w3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T08:31:49.000Z",
      "summary_90w": "",
      "raw": "Chief Constable Gavin Stephens says police were notified about over 3,000 summer protests and warns against an \"increase in tension and polarity\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0401e9d2081d4f99d62e71998ecf04b1f4099bc",
      "title": "Energy drinks to be banned for under-16s in England",
      "url": "https://www.bbc.com/news/articles/c707074qdnko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T08:18:26.000Z",
      "summary_90w": "",
      "raw": "Health and Social Care Secretary Wes Streeting said he was acting on concerns for children's health.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9dcf43076631b3c2c6573bfa4a1ac5edbdb782d9",
      "title": "Putin thanks Kim for North Koreans fighting in Ukraine",
      "url": "https://www.bbc.com/news/articles/cj9w9m1xz1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:14:39.000Z",
      "summary_90w": "",
      "raw": "Thousands of North Korean soldiers are thought to have died while fighting for Russia during its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd29d4c25dd3d6233a26bf157fc37ed9c60069b3",
      "title": "Ooni’s newest pizza oven adds AI to your slice",
      "url": "https://www.theverge.com/news/768542/ooni-volt-2-pizza-oven-ai-pizza-intelligence",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T08:00:00.000Z",
      "summary_90w": "",
      "raw": "Cheese, red sauce, and a sprinkling of AI.\t\n\nHave you ever looked at your pizza oven and wished it was just a little bit smarter? Ooni has, and so its new Volt 2 comes loaded with “Pizza Intelligence,” an adaptive heating system designed to deliver a more even and consistent cooking temperature.\nThe Volt 2 is an indoor oven, able to cook pizzas up to 13 inches in diameter, but it’s still small enough to fit on a countertop — though we’ve found other indoor pizza ovens too smoky to really use inside. Pizza Intelligence is new to the Volt 2 and uses sensor data to adjust the top and bottom heating elements, “minimizing temperature fluctuations and cold spots.” It’s a little less exciting than the name suggests.\nThe Volt 2 has a max temperature of 450 Celsisus (842F), right in the recommended range for cooking traditional Neapolitan pizza, which Ooni says should take about 90 seconds. That’s one of the three presets, with New York and deep-pan pizza, too, and the oven “adjusts temperature and crisping intensity” to suit each style. You can also add programmable custom presets if you prefer a different type of pie.\nThe Volt 2 will be available from October 1st for £499 (about $670). We’ll update this with US pricing when we have it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a07222328a14b6a71c8969b4f7e9c200d67a1613",
      "title": "Shell scraps construction of biofuels plant in Rotterdam",
      "url": "https://www.theguardian.com/business/2025/sep/03/shell-scraps-construction-of-biofuels-plant-in-rotterdam",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T07:56:33.000Z",
      "summary_90w": "",
      "raw": "Oil firm, which paused project in 2024, will not restart work because facility deemed ‘insufficiently competitive’\nShell has axed the construction of its biofuels plant in the Netherlands, ending what would have been one of the biggest converters of waste into green jet fuel in Europe.\nThe oil company, which paused construction at the site in July last year to tackle technical problems, said it had decided not to restart building after it found the plant would be “insufficiently competitive” to meet demand for “affordable, low-carbon products”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b8b15d412eccab9d79741ed92f1605d734af66e8",
      "title": "People assume you're not trying, says England forward Lauren James",
      "url": "https://www.bbc.com/sport/football/articles/cz605zqzyjgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T06:30:11.000Z",
      "summary_90w": "",
      "raw": "Chelsea and England forward Lauren James has criticised fans as \"too quick to judge\" during her struggles at Euro 2025.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de0e062ec6e6aede6d5bbe684aaeb1a28f8eaef8",
      "title": "Floods kill 30 and submerge 1,400 villages in Indian state",
      "url": "https://www.bbc.com/news/articles/cvg4g95y7pjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T06:23:23.000Z",
      "summary_90w": "",
      "raw": "More than 354,000 people have been affected by the worst floods since 1988, as rescue efforts continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d27437f91defdbeae26dc28641c69c54124a40a",
      "title": "'A clear message to Trump': BBC correspondents react to China's military parade",
      "url": "https://www.bbc.com/news/articles/c7545p2px5no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T06:21:08.000Z",
      "summary_90w": "",
      "raw": "The display of might comes as Beijing positions itself as a global counterweight to the United States.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db1887e99abec7b7b7f9db593e85b981b234faa1",
      "title": "Charged atmosphere at US Open sparks debate over tennis etiquette",
      "url": "https://www.bbc.com/sport/tennis/articles/c4gzgv1mg2ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T05:18:02.000Z",
      "summary_90w": "",
      "raw": "Is apologising for a net cord courteous or meaningless? BBC Sport looks at why tennis etiquette is back on the agenda at the US Open.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73d35113143e4631d5210620aa3fe4ad3ed1ddb6",
      "title": "Trump cannot use Alien Enemies Act to deport Venezuelan gang members, appeals court rules",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526773/trump-alien-enemies-act-venezuela-gangs-ruling",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T05:10:08.000Z",
      "summary_90w": "",
      "raw": "The administration deported people designated as Tren de Aragua members to a notorious prison in El Salvador where, it argued, U.S. courts could not order them freed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8e892e6608af0d86ce3d3c9accae4933e250d7f",
      "title": "Toddler murdered by grandparents 'failed' by system",
      "url": "https://www.bbc.com/news/articles/c4gmg3e4lr3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T05:07:43.000Z",
      "summary_90w": "",
      "raw": "Ethan Ives-Griffiths was murdered by his grandparents Michael and Kerry Ives at their home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b5df07f5139894edd78f5d4f7d7efa963b6de99",
      "title": "Death penalty for Indian man who burnt alive wife over skin colour",
      "url": "https://www.bbc.com/news/articles/clyryrwwdj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T05:06:03.000Z",
      "summary_90w": "",
      "raw": "The judge said the murder fell in the category of \"rarest of the rare\" and was \"a crime against humanity\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T04:45:44.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7404343c2da6faf4684e77af35d988edee6e036d",
      "title": "North Korea: Kim Jong-un’s daughter makes international debut fuelling succession speculation",
      "url": "https://www.theguardian.com/world/2025/sep/03/north-korea-kim-jong-uns-daughter-makes-international-debut-fuelling-succession-speculation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:40:29.000Z",
      "summary_90w": "",
      "raw": "Kim Ju-ae’s arrival in Beijing ahead of China’s victory day military parade show she is her father’s preferred successor, experts say\nThe appearance of Kim Jong-un’s daughter in China ahead of Xi Jinping’s “victory day” parade in Beijing has added to speculation that she is being groomed to become the first female ruler of North Korea.\nPhotos released by North Korean state media showed Kim Ju-ae, who is believed to be in her early teens, stepping off her father’s heavily armoured train in the Chinese capital, where she was greeted by Chinese officials at the start of her debut on the international stage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99fa8ead2efdd79c9f5b45e5a20f4827ff27b0e6",
      "title": "Daniel Andrews criticised after attending China military parade and posing with Kim Jong-Un and Vladimir Putin",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/dan-andrews-china-military-parade-poses-with-kim-jong-un-vladimir-putin",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:20:57.000Z",
      "summary_90w": "",
      "raw": "Former Victorian Labor premier earlier filmed shaking Chinese president Xi Jinping’s hand\n\nFull report: Xi Jinping appears with Vladimir Putin and Kim Jong-un at China military parade\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nDaniel Andrews has been criticised by the opposition for posing alongside North Korean dictator Kim Jong-un and the Russian president, Vladimir Putin, at a military parade in Beijing’s Tiananmen Square.\nThe former Victorian Labor premier stood several rows behind the North Korean semi-recluse (who is facing complaints of alleged crimes against humanity) during the photo opportunity for leaders from the so-called “axis of upheaval”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "678c1de7491f05191cd475ec9128809ed46041de",
      "title": "China's Xi displays military might and global ambitions at elaborate parade",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5524923/china-xi-parade-putin-kim",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T04:20:32.000Z",
      "summary_90w": "",
      "raw": "It was a grand display of China's ambitions as thousands of goose-stepping soldiers marched through Tiananmen Square in the heart of Beijing, as Chinese President Xi Jinping looked on from above.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95a398b4549b780449b69fa72fb64f9b270be41b",
      "title": "Thailand tycoon who championed cannabis laws takes lead in race for PM",
      "url": "https://www.theguardian.com/world/2025/sep/03/thailand-elections-tycoon-championed-cannabis-legalisation-takes-lead-pm-race",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:08:49.000Z",
      "summary_90w": "",
      "raw": "Anutin Charnvirakul gets main opposition party’s conditional backing to form interim government\nThe tycoon turned politician Anutin Charnvirakul appears to have taken the lead in a chaotic race to become Thailand’s next prime minister, after days of tense negotiations.\nAnutin, who is leader of the conservative Bhumjaithai party and perhaps best known for championing medical cannabis legalisation, has the backing of MPs from the main opposition People’s party to form an interim government, provided he signs an agreement laid out by its leaders.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d4c8253a35a3d55bd4fa1b0b4514cf77311fdd4",
      "title": "Leaders gather in Beijing for military display – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/china-victory-day-military-parade-80th-japan-surrender-live-updates-xi-jinping-putin-kim-jong-un-latest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:05:46.000Z",
      "summary_90w": "",
      "raw": "This blog is closed\n\nFull report: Xi, Kim and Putin appear together in Beijing\n\nThe parade has commenced, they are singing the Chinese national anthem.\nPhotos have emerged showing North Korean leader Kim Jong-un stepping off his armoured train at Beijing Railway Station accompanied by his daughter, Kim Ju-ae.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b15a2e067e5341f9a6fab8e872f8a38e5f98ea5c",
      "title": "Pedro Sánchez: Europe’s response to war in Gaza has been a failure",
      "url": "https://www.theguardian.com/world/2025/sep/03/sanchez-europes-response-to-war-in-gaza-has-been-a-failure",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T04:00:14.000Z",
      "summary_90w": "",
      "raw": "Spanish prime minister says double standards over Gaza and Ukraine threaten to undermine west’s global standing\n\n‘You need solidarity and consistency’: Pedro Sánchez on the EU, Trump and fighting the far right\n\n\n​Europe and the west’s double standards over the wars in Ukraine and Gaza threaten to undermine its global standing, the Spanish prime minister, Pedro Sánchez, has warned, describing the response to Israel’s assault on the Palestinian territory as one of the darkest episodes of international relations in the 21st century.\nIn an interview with the Guardian before talks with the UK prime minister, Keir Starmer, in London on Wednesday, the socialist leader also said the US under Donald Trump was trying to end the post-second world war, rules-based global order it had originally created.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ace766178d2ad238f44e43eb9ee36a2d98145e72",
      "title": "Trump accuses Xi of conspiring against US with Putin and Kim",
      "url": "https://www.bbc.com/news/articles/c1dxd9eyy71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:45:58.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b19907959fae91b037286af0c679b1c96289fded",
      "title": "Xi, Putin and Kim: behind the choreographed image that could symbolise a shift in the global balance of power",
      "url": "https://www.theguardian.com/world/2025/sep/03/xi-putin-kim-choreographed-image-that-could-symbolise-shift-global-balance-power",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T03:45:29.000Z",
      "summary_90w": "",
      "raw": "In an unprecedented spectacle the leaders of Russia, China and North Korea led a group of more than 20 world leaders at a victory day parade in Beijing\n\nFull report: Xi Jinping appears with Vladimir Putin and Kim Jong-un at China military parade\n\nIt is an image that, had it been published just a few years ago, would have been dismissed as a piece of mischievous photo-shopping: the leaders of Russia and China, accompanied by the head of a pariah regime whose mission to arm his country with nuclear weapons had been opposed at the United Nations by his two companions.\nBut dramatic shifts in the geopolitical landscape – Russia’s invasion of Ukraine and, crucially, the re-election of Donald Trump – have combined to bring Xi Jinping, Vladimir Putin and North Korean leader Kim Jong-un together in what many observers are calling a dramatic redrawing of the global balance of power.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4797c9a7e5dd808d65c909097b9a96e5bae3b474",
      "title": "Watch: Key moments from China's big show of strength",
      "url": "https://www.bbc.com/news/videos/c62n2mm6ngjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T03:35:24.000Z",
      "summary_90w": "",
      "raw": "The military parade was attended by world leaders including Vladimir Putin and Kim Jong Un and showcased China’s new weapons.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4797c9a7e5dd808d65c909097b9a96e5bae3b474",
      "title": "Watch: Key moments from Xi's showcase of military might",
      "url": "https://www.bbc.com/news/videos/c62n2mm6ngjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T03:35:24.000Z",
      "summary_90w": "",
      "raw": "The military parade was attended by world leaders including Vladimir Putin and Kim Jong Un and showcased China’s new weapons.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb04e52aa7da6a76d28b5616e418fee79c43827d",
      "title": "Moment Xi, Putin and Kim pose with world leaders",
      "url": "https://www.bbc.com/news/videos/cly6ylk070zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T02:20:57.000Z",
      "summary_90w": "",
      "raw": "It's the first time the three world leaders have been seen together in public.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df6292318cff9f48c879b31767d4a501c2af5851",
      "title": "Indonesia embassy official’s shooting in Lima probably a ‘contract killing’, says Peru government",
      "url": "https://www.theguardian.com/world/2025/sep/03/indonesian-embassy-official-shooting-lima-likely-contract-killing-says-peru-government-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T02:11:57.000Z",
      "summary_90w": "",
      "raw": "Interior minister says ‘they were waiting for’ official who was shot at point-blank range outside his home in killing that has shocked Peru\nPeru’s government has said the fatal shooting of an Indonesian embassy official in Lima on Monday night was likely a “contract killing”.\nZetro Leonardo Purba, 40, an official at the Indonesian embassy in Peru, was shot dead outside his block of flats in Lima’s Lince neighbourhood while riding a bicycle home from work on Monday evening.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f8aa17ecd8380ddeed0b8af5c055ec41f544019",
      "title": "Disney will pay $10 million to settle FTC claim it used cartoons to collect YouTube data on kids",
      "url": "https://www.theverge.com/policy/769771/disney-ftc-coppa-settlement-kids-data",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T02:01:35.000Z",
      "summary_90w": "",
      "raw": "Disney has agreed to pay $10 million to settle allegations from the Federal Trade Commission that it violated federal law by misleadingly labeling cartoons on YouTube so it could illegally collect children’s personal data.\nThe FTC alleges that Disney failed to label some videos of its popular kids cartoons it uploaded to YouTube as “Made for Kids” — a designation that makes such videos ineligible for certain features, like the collection of personal information. It’s a way YouTube makes it harder to target kids with personalized ads. But rather than mark individual videos as either “Made for Kids” or “Not Made for Kids,” the FTC alleges, Disney left the default designation at the channel level, so any video uploaded to a “Not Made for Kids” channel would bear that “Not Made for Kids” label instead. \nThe result was that videos with content from kid-friendly movies like “The Incredibles,” “Toy Story,” and “Frozen” would be marked as “Not Made for Kids,” according to the government, circumventing YouTube’s heightened restrictions, including allowing YouTube to autoplay other “Not Made for Kids” videos after the Disney ones finished. That resulted in Disney collecting information on kids and serving them targeted ads on videos that were technically designed at not for kids, the FTC alleges, in violation of the Children’s Online Privacy Protection (COPPA) Rule, which requires parental consent to collect information on kids under 13. \nYouTube implemented the labeling system after its own 2019 settlement with the FTC over alleged violation of the COPPA Rule. \nDisney should have known that some of its videos were marked incorrectly, the government alleges, since YouTube already told Disney in 2020 that it was labeling its videos incorrectly,  changing the labels on over 300 of its videos from “Not Made for Kids” to “Made for Kids” at that time, according to the complaint. But Disney continued to upload videos with only the default designation at the channel level, the FTC says.\nUnder the proposed settlement, Disney will pay a $10 million civil settlement, obtain parents’ consent for collecting data from kids under 13 as required by law, and create a new program to review whether videos uploaded to YouTube should be marked as made for kids or not which it must maintain for the next ten years — unless YouTube comes up with its own system “to determine the age, age range, or age category of all YouTube users.” If so, Disney will no longer need its own system to figure out how videos should be labeled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "19748ab56d2566a698991b9886df485db53e89a0",
      "title": "US House panel releases 33,000 pages of Epstein files",
      "url": "https://www.bbc.com/news/articles/cp949lrj373o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T01:12:07.000Z",
      "summary_90w": "",
      "raw": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd9711cb196a8a00d95830cc9302c67960583c10",
      "title": "Jury clears Cardi B of assault on security guard in Los Angeles",
      "url": "https://www.bbc.com/news/articles/cgjyj0dp3ego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T00:19:19.000Z",
      "summary_90w": "",
      "raw": "A number of viral moments thrust the civil case into the spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07f8b0cb89a5ba28cead6ee8b73d58f6be205e1f",
      "title": "Google critics think the search remedies ruling is a total whiff",
      "url": "https://www.theverge.com/news/769738/google-doj-antitrust-remedies-ruling-critics",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-03T00:06:24.000Z",
      "summary_90w": "",
      "raw": "The remedies ruling in the Department of Justice’s antitrust case against Google finally landed on Tuesday. Last year, Judge Amit Mehta ruled that Google was a monopolist in the search and advertising markets, but while today’s ruling says that Google will have to share some search data with competitors, Google doesn’t have to spin off Chrome and it can keep paying for deals like the one that lets it be the default search in Safari.\nMany Google critics aren’t happy with the remedies that have been handed down, saying that they don’t go far enough to slow Google’s dominance and restore competition in the market. Here are some statements from critics:\nSenator Amy Klobuchar (D-MN):\nToday’s ruling is a reminder of Google’s sweeping power over the online economy, but the limited remedies ordered by the court demonstrate why we need additional rules of the road for Big Tech. That’s why we must pass my bipartisan American Innovation and Choice Online Act to stop dominant platforms like Google from continuing to unfairly preference their own products over competitors’ — which hurts consumers and entrepreneurs, and stifles innovation. Through three administrations, our antitrust enforcers have proven that Google’s tactics endanger the future of a free and open internet and risk choking off innovation in critical areas like artificial intelligence. I will continue to work across the aisle to ensure even the most powerful tech companies have to play by the rules.\nDuckDuckGo CEO Gabriel Weinberg:\nWe do not believe the remedies ordered by the court will force the changes necessary to adequately address Google’s illegal behavior. Google will still be allowed to continue to use its monopoly to hold back competitors, including in AI search. As a result, consumers will continue to suffer. We believe Congress should now step in to swiftly make Google do the thing it fears the most: compete on a level playing field.\nNews / Media Alliance president and CEO Danielle Coffey:\nWe are disappointed in today’s decision. Judge Mehta’s ruling did not address the ability of Google to further cement its market power through its AI offerings. Google is forcing content creators to give away their content to be used in its AI offerings in order to remain in Google Search. This is a no-win scenario that will continue to harm publishers that invest in high-quality, journalistic and creative content. Giving publishers the ability to opt out of Google’s AI is critical to preserving an open internet free from anti-competitive behavior, and preserving a fair playing field for companies across a variety of industries. This ruling is not the end, but it is a missed opportunity.\nThe Tech Oversight Project executive director Sacha Haworth:\nWhile Judge Amit Mehta’s decision blocks some of Google’s predatory practices, it fails to meet this historic moment and shows that his decision was made based on speculative arguments about generative AI, in which Google, because of its interlocking monopolies and distribution advantage, is already a dominant player. Search is one of the largest avenues for future AI queries, and it’s crystal clear that rather than doing the hard thing, Judge Mehta was far more willing to let Google continue bending the internet and our economy to its will than enforcing the law, which is designed to create a level playing field that benefits the American people and innovative, new companies.\nAmerican Economic Liberties Project executive director Nidhi Hegde:\nThe Court found Google liable for maintaining one of the most consequential and damaging monopolies of the internet era, yet has bizarrely decided to leave its power almost fully intact. Imposing liability in name only is pure judicial cowardice. This ruling leaves the public unprotected, crucial and evolving markets concentrated, and worse, sends a signal that will embolden monopolists everywhere.\nNot everyone is fully opposed, with some speaking in favor of Judge Mehta not breaking up Google. However, some have also expressed concerns over the data-sharing portion of the remedies.\nComputer & Communications Industry Association president and CEO Matt Schruers:\nThe District Court’s ruling rightly rejected the drastic breakup proposed by the DOJ regarding Chrome and Android, which would have altered antitrust precedent and harmed competition and consumers. As the Court stated, the DOJ overreached in seeking the forced divestiture of these key assets. For consumers, the ruling means that Google will be compelled to share search queries and other data with certain competitors, which could significantly impact privacy and national security.\nCompetitive Enterprise Institute Center for Technology and Innovation director Jessica Melugin:\nToday’s ruling in the Google search case wisely avoids most of the requests from the Department of Justice, including a forced divestiture of Chrome and Android, overly broad payment bans, and other requested overreaches. But the mandated data sharing introduces questions about who might qualify as a ‘qualified competitor’ and if that benefits consumers, or just Google competitors.\nNetChoice vice president of public affairs Robert Winterton:\nThe court’s nuanced approach has prevented the DOJ from dismantling a leading American tech company at a pivotal time in history, ensuring President Trump’s administration stays true to its promise to empower American innovation.\nChamber of Progress CEO Adam Kovacevic:\nGoogle’s rivals wanted Judge Mehta to throw the book at Google, but he repeatedly cited the Microsoft antitrust precedent that remedies should be narrowly tailored to fit the offense. He spent 29 pages discussing how generative AI is now a competitive threat to traditional search engines. Innovation is a hare while antitrust law is a tortoise.\nGoogle plans to appeal the first ruling that found the company was an illegal monopolist.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2198325404ec05b6690bef29cfd7a60f3bba5d8f",
      "title": "Government unable to calculate Afghan data breach cost, watchdog says",
      "url": "https://www.bbc.com/news/articles/cm2k25dx1z3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:56:06.000Z",
      "summary_90w": "",
      "raw": "The National Audit Office says it has not been given enough information to have \"confidence\" a relocation scheme cost £850m.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "becc1608a39480c6ab122531f566e2f5351865a4",
      "title": "US film-maker in legal battle over 'Downton Shabby'",
      "url": "https://www.bbc.com/news/articles/cr4ey262365o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:50:22.000Z",
      "summary_90w": "",
      "raw": "Hopwood DePree takes Rochdale council to the High Court over control of his ancestral stately home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac6e637aea2e03155e61ab66063e3b5b6e89d840",
      "title": "Seven claims made in new royal book from Brexit to Coronation",
      "url": "https://www.bbc.com/news/articles/c78z84d3gdgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:47:00.000Z",
      "summary_90w": "",
      "raw": "A new book on the connections between the royals and politics has revealed some eye-catching stories.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1be008a4cce520232e3bbb3f293735bb69f77fe",
      "title": "A scheme helped prevent sex offenders committing more crimes - then it closed. Why?",
      "url": "https://www.bbc.com/news/articles/cgqnqzkg83jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:40:29.000Z",
      "summary_90w": "",
      "raw": "The case raises difficult questions about how best to protect potential victims.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5bbe882f5c32980c0db615e01ac63766ae09113",
      "title": "Don't pay a fake parking fine – four ways to protect yourself from scams",
      "url": "https://www.bbc.com/news/articles/cn8438ngpe1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:37:07.000Z",
      "summary_90w": "",
      "raw": "Four simple tips to make sure you don't fall victim to fake texts or payment demands from BBC expert Nick Stapleton.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3530436b320d6ff4c37d98a45ea7d27948abcda5",
      "title": "'A bullet went through my skull': Tanzania abduction survivor",
      "url": "https://www.bbc.com/news/articles/c78zdzvgw90o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:32:11.000Z",
      "summary_90w": "",
      "raw": "Activist Edgar Mwakabela describes his ordeal after he says he was kidnapped and shot by suspected state agents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "afad8bf2be71a718e1a725e0e02831f9066c42e8",
      "title": "Thames Water bidders ready to clear out top managers",
      "url": "https://www.bbc.com/news/articles/cp8z8djjml5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:58.000Z",
      "summary_90w": "",
      "raw": "Sources close to the deal accept that the government needs to be seen to be tough with the company.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7a68a331a49b9b4892ef7c9ad493a7664760f13",
      "title": "Watch: Captain Scott’s famous polar shipwreck as never seen before",
      "url": "https://www.bbc.com/news/articles/cpwyvyqkx9yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:27.000Z",
      "summary_90w": "",
      "raw": "The Terra Nova carried Captain Scott and his men on their doomed expedition to the South Pole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e355c68b37a3fb7359bb77b3f60e468f33b9fa1",
      "title": "Ousted Democratic FTC commissioner can return (again) for now",
      "url": "https://www.theverge.com/news/769683/fired-democratic-ftc-commissioner-rebecca-slaughter-reinstated",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T23:19:51.000Z",
      "summary_90w": "",
      "raw": "Rebecca Kelly Slaughter, the Democratic Federal Trade Commissioner fired by President Donald Trump without cause, can at least temporarily return to work while her legal case plays out. \nThis happened once before when Slaughter briefly returned to her office months after Trump claimed to fire her, when US District Court Judge Loren AliKhan found her dismissal unlawful. Trump broke with decades of Supreme Court precedent known as Humphrey’s Executor, preventing presidents from firing independent commissioners without cause. But her return was short-lived — a few days later the appeals court temporarily paused the order reinstating Slaughter.\nThis latest order, approved 2-1 by a panel of appeals court judges, dissolves that stay and lets Slaughter get back to work until they decide on the merits of the case. While the majority judges don’t actually rule on the case, they write that the government is not likely to win, since “any ruling in its favor from this court would have to defy binding, on-point, and repeatedly preserved Supreme Court precedent.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b3a8a7e44df85bb3e631614f1e7bb8979c0f1a8f",
      "title": "Trump confirms U.S. strike on alleged Venezuelan drug boat",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525984/venezuela-trump-drugs-caribbean",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T23:07:53.000Z",
      "summary_90w": "",
      "raw": "President Trump says the U.S. military has struck a drug-laden vessel in the southern Caribbean after it left Venezuela. The strike comes a week after Washington deployed warships to the region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b48d6aa7902484f6161edb09926a7623411adc51",
      "title": "Compassion v fear: Delhi divided over feeding stray dogs",
      "url": "https://www.bbc.com/news/articles/c0kzkzvx848o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:04:26.000Z",
      "summary_90w": "",
      "raw": "Activists are pushing for the welfare of stray dogs, while anxious residents cite safety risks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "464e9fe0d3287700f5827f0ab6d4850271d64bf9",
      "title": "Why is Trump targeting America's most powerful bank?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0fw7d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:01:00.000Z",
      "summary_90w": "",
      "raw": "Can he take control of the Federal Reserve?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b1c6fcf6b0eb902c6ee4beaf7014de6d55646ad",
      "title": "Chris Mason: How Polanski's Green leadership could impact UK politics",
      "url": "https://www.bbc.com/news/articles/c9d0d32q0eno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T22:49:49.000Z",
      "summary_90w": "",
      "raw": "Zack Polanski's landslide victory is the latest example of a shake up in the country's politics.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1a85b2cd28ef41b47c910e085725e38a0071bb1",
      "title": "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T22:16:18.000Z",
      "summary_90w": "",
      "raw": "Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions \nThe US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between Washington and Caracas.\nTrump trailed the announcement during an address at the White House on Tuesday afternoon, telling reporters the US had “just, over the last few minutes, literally shot out … a drug-carrying boat”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a56676df663ab832e550668815ce2b54c1b2d91",
      "title": "Australia-Israel relations have hit a low point. Behind the scenes, it's business as usual",
      "url": "https://www.bbc.com/news/articles/cdd31vnygemo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T22:02:46.000Z",
      "summary_90w": "",
      "raw": "The two democratic allies have had a spectacular falling out - but what has actually changed?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53112f74c4bcaee6abbc430c1a5584946e8182f3",
      "title": "Watch: Timelapse shows Northern Lights display over North Sea",
      "url": "https://www.bbc.com/news/videos/ckglgp9q2nno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T21:47:48.000Z",
      "summary_90w": "",
      "raw": "Monday night's dazzling sight was filmed from Flamborough in East Yorkshire, over three hours and 40 minutes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c08b57592134ecabac0d1d7637ad82c99b5e603",
      "title": "How three businesses are coping with tariff limbo",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525791/how-three-businesses-are-coping-with-tariff-limbo",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:08:39.000Z",
      "summary_90w": "",
      "raw": "US importers are in a kind of tariff limbo. A federal appeals court has struck down most of President Trump's import taxes. But the tariffs are still being collected, for now, until there's a final decision from the Supreme Court.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dcf71c63cee7c52bc78112f84e9f86ac64ba7280",
      "title": "After Hurricane Katrina, evacuees changed Houston and the city changed them",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5456230/houston-new-orleans-hurricane-katrina-evacuees",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T21:00:31.000Z",
      "summary_90w": "",
      "raw": "It's hard to know how many people who lost their home in New Orleans made Houston their permanent home.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe3ea0609a814b72cff681d5788c7defd3c9a0b2",
      "title": "Electric vehicle sales increase as federal tax credits for them come to an end",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650-e1/electric-vehicle-sales-increase-as-federal-tax-credits-for-them-come-to-an-end",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T20:52:12.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7f2bb8b23b878380bd0e4d29f64be437073fcf5b",
      "title": "Waymo expands to Denver and Seattle with its Zeekr-made vans",
      "url": "https://techcrunch.com/2025/09/02/waymo-expands-to-denver-and-seattle-with-its-zeekr-made-vans/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:48:09.000Z",
      "summary_90w": "",
      "raw": "Add another two cities to the growing list where Waymo is looking to deploy its robotaxis. The company will start with manual testing but is eyeing a commercial launch in both cities.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26c6c9f1fceb7746b5ccf887c3e09f63125372ec",
      "title": "Google avoids break up, but has to give up exclusive search deals in  antitrust trial",
      "url": "https://techcrunch.com/2025/09/02/google-avoids-break-up-faces-new-oversight-in-search-antitrust-trial/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:45:20.000Z",
      "summary_90w": "",
      "raw": "U.S. District Court Judge Amit P. Mehta outlined remedies on Tuesday that would bar Google from entering or maintaining exclusive deals that tie the distribution of Search, Chrome, Google Assistant, or Gemini to other apps or revenue arrangements.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a26107a3bda8ac62ac81d675007ef9c502047bb1",
      "title": "Military lawyers called up to relieve a shortfall in immigration judges",
      "url": "https://www.npr.org/2025/09/02/g-s1-86691/military-lawyers-immigration-judges-jag",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T20:33:37.000Z",
      "summary_90w": "",
      "raw": "The move comes after the Justice Department last week made changes to who could qualify as a temporary immigration judge —effectively lowering the requirements and removing the need to have prior immigration experience.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "060597fc354558c19ae50394ae87621f9045f7bd",
      "title": "OpenAI to route sensitive conversations to GPT-5, introduce parental controls",
      "url": "https://techcrunch.com/2025/09/02/openai-to-route-sensitive-conversations-to-gpt-5-introduce-parental-controls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:13:04.000Z",
      "summary_90w": "",
      "raw": "OpenAI said Tuesday it plans to route sensitive conversations to reasoning models like GPT-5 and roll out parental controls within the next month – part of an ongoing response to recent safety incidents involving ChatGPT failing to detect mental distress.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "364368d0c7fdddfffc65ebbf6ed7a407659e52b8",
      "title": "Judges side with Trump EPA over canceled Inflation Reduction Act grants to nonprofits",
      "url": "https://techcrunch.com/2025/09/02/judges-side-with-trump-epa-over-canceled-inflation-reduction-act-grants-to-nonprofits/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:53:50.000Z",
      "summary_90w": "",
      "raw": "An appellate court found that the Trump administration was within its rights to cancel billions of dollars in grants. The nonprofits that had their grants canceled are expected to appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "69edbfd4529d6be1c0e4cf8b3c6608e549424d40",
      "title": "The big Putin, Xi and Kim Jong Un meeting",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0gh4d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T19:52:00.000Z",
      "summary_90w": "",
      "raw": "Russia’s Vladimir Putin and North Korean leader Kim Jong Un head to Beijing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19c9d71fe33d74644215f33e9dcea203c275498e",
      "title": "Amazon launches Lens Live, an AI-powered shopping tool for use in the real world",
      "url": "https://techcrunch.com/2025/09/02/amazon-launches-lens-live-an-ai-powered-shopping-tool-for-use-in-the-real-world/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:42:23.000Z",
      "summary_90w": "",
      "raw": "Lens Live will not replace Amazon's existing visual search tool, Amazon Lens, which lets you take a picture, upload an image, or scan a barcode to discover products. Instead, it brings a real-time component to Amazon Lens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5408d8decba8751b9b8bb5e6702c9e5e6725d8b4",
      "title": "Trump addresses online health rumours in Oval Office",
      "url": "https://www.bbc.com/news/videos/c62724wdxzwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T19:30:43.000Z",
      "summary_90w": "",
      "raw": "In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d83ca70fc5399376184426b5ac11daa2f344a7",
      "title": "OpenAI acquires product testing startup Statsig and shakes up its leadership team",
      "url": "https://techcrunch.com/2025/09/02/openai-acquires-product-testing-startup-statsig-and-shakes-up-its-leadership-team/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:04:05.000Z",
      "summary_90w": "",
      "raw": "OpenAI is bringing on the founder of Statsig as its CTO of Applications, and making changes to other leadership roles at the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7711054b51bf0367bbca9cf52c5dab71776daaf6",
      "title": "Afghan quake victims buried on mountain top as aftershocks continue",
      "url": "https://www.bbc.com/news/videos/cd9j9g5n92do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:46:09.000Z",
      "summary_90w": "",
      "raw": "The BBC's Yama Bariz travelled to a region devastated by the 6.0 magnitude earthquake.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871e468947017c14e79f6657c777c3af7e6b7830",
      "title": "Astro Teller, ‘Captain of Moonshots,’ joins TechCrunch Disrupt 2025 this October",
      "url": "https://techcrunch.com/2025/09/02/astro-teller-is-joining-us-at-techcrunch-disrupt-2025-in-october/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T18:44:48.000Z",
      "summary_90w": "",
      "raw": "TechCrunch is thrilled to announce that Astro Teller, the head of Alphabet’s X (aka the Moonshot Factory), will take the stage at TechCrunch Disrupt 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c762575c02c0050e081f400ca742b4cdd720504",
      "title": "What do we know about Kim Jong Un's daughter - and potential successor?",
      "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:07.000Z",
      "summary_90w": "",
      "raw": "Kim Ju Ae's visit to China with her father is likely to further fuel speculation she may succeed him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bdd52b1720cf8f7b1156fda93a00dbd27bfe7f43",
      "title": "Trump's use of National Guard in Los Angeles was illegal, judge rules",
      "url": "https://www.bbc.com/news/articles/c5ylyd9lkkqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T17:48:32.000Z",
      "summary_90w": "",
      "raw": "The ruling comes as Trump seeks to use National Guard troops in order to crack down on crime in other US cities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40a3d29eca31a80068ccb02d3c0a0b95fb653582",
      "title": "Argentina couple under house arrest amid search for painting stolen by Nazis",
      "url": "https://www.theguardian.com/world/2025/sep/02/argentina-painting-nazis-house-arrest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:20:35.000Z",
      "summary_90w": "",
      "raw": "Daughter of former Nazi official and her husband to be questioned after raid on home failed to find masterpiece\nA federal court in Argentina has ordered house arrest for the daughter of a former Nazi official and her husband after a raid failed to locate a painting stolen from a Jewish art dealer in Amsterdam.\nAuthorities raided a home in the coastal city of Mar del Plata last week after a Dutch newspaper identified a painting seen in a real estate photo as an Italian masterpiece registered on a database of lost wartime art.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dea386d8cdddc41b883e3c81287e76feb67f6f5",
      "title": "Tesla’s 4th ‘Master Plan’ reads like LLM-generated nonsense",
      "url": "https://techcrunch.com/2025/09/02/teslas-4th-master-plan-reads-like-llm-generated-nonsense/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T17:18:12.000Z",
      "summary_90w": "",
      "raw": "Tesla's fourth \"Master Plan\" lacks an important building block of plans: specifics. Even Elon Musk agrees it was too generic.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ccee5dd1b0e243054368010ece26c049d5a13e6",
      "title": "Outcry as Swedish ‘cultural canon’ snubs Abba and anything since 1975",
      "url": "https://www.theguardian.com/world/2025/sep/02/outcry-as-swedish-cultural-canon-snubs-abba-and-anything-since-1975",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:45:54.000Z",
      "summary_90w": "",
      "raw": "Critics argue ‘shared map’ of Swedish culture is ‘very exclusionary’ and a ‘nationalist education project’\nThe Gustav Vasa 1541 bible, Pippi Longstocking, Ikea, the right to roam, paternity leave, Sámi joiks, the Nobel prize and works by Ingmar Bergman and August Strindberg all made it into Sweden’s long-awaited, much-criticised proposal for a “cultural canon”.\nHowever, notable omissions from the list of 100 works and references that have formed Sweden’s culture and history – intended, its creators said in Uppsala on Tuesday, to establish a “shared map and compass” for Swedish citizens and new arrivals to Sweden – included Abba and anything from after 1975, a period that has seen Sweden transform into an international, multicultural society.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07715646549620450e4b081adaa0d3b069b4a69",
      "title": "Margaret Atwood releases short story critiquing book bans in Canada",
      "url": "https://www.theguardian.com/world/2025/sep/02/margaret-atwood-alberta-canada-book-ban",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:44:53.000Z",
      "summary_90w": "",
      "raw": "Author quipped she wrote ‘suitable’ piece after Alberta school ban included her novel The Handmaid’s Tale\nMargaret Atwood has released a new short story critiquing elected officials for a wide-ranging book ban in the Canadian province of Alberta. The controversial decision to remove books purportedly containing “explicit sexual content” has seen numerous works of literature swept up in the dragnet, including Atwood’s dystopian work The Handmaid’s Tale.\nIn a social media post, Atwood wrote that since her famed work was no longer permissible in Alberta schools, she had written a “suitable” short work for teens, adding the work was necessary because the province’s minister of education thought students were “stupid babies”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3261c1ce6e289d0c2c892a031887da26050e4df9",
      "title": "Tesla’s Dojo, a timeline",
      "url": "https://techcrunch.com/2025/09/02/teslas-dojo-a-timeline/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:39:01.000Z",
      "summary_90w": "",
      "raw": "Musk teased Dojo for years and ramped up discussions about the supercomputer throughout 2024. But Dojo is now out, and another supercomputer called Cortex has entered the chat.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2ea109f825065079513d3bc6892866ac98ffb56",
      "title": "Vogue promotes Chloe Malle to top editor spot",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525663/vogue-chloe-malle-anna-wintour",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T16:38:09.000Z",
      "summary_90w": "",
      "raw": "Malle takes over as the leader of American Vogue immediately. Malle, who has been with the publication since 2011, will still report to Anna Wintour who remains Condé Nast's chief content officer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "19d472e6b6f9866bc55467838678a9da55e96db0",
      "title": "Anthropic raises $13B Series F at $183B valuation",
      "url": "https://techcrunch.com/2025/09/02/anthropic-raises-13b-series-f-at-183b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:34:16.000Z",
      "summary_90w": "",
      "raw": "AI firm Anthropic's $13 billion Series F round will be used to grow its enterprise adoption, deepen safety research, and support international expansion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f142f2f1ec1e1b3ad2c32f4683177278c1e67425",
      "title": "WordPress shows off Telex, its experimental AI development tool",
      "url": "https://techcrunch.com/2025/09/02/wordpress-shows-off-telex-its-experimental-ai-development-tool/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:26:48.000Z",
      "summary_90w": "",
      "raw": "WordPress CEO Matt Mullenweg introduced the new WordPress AI tool, called Telex, at the company's WordCamp US 2025 conference in Portland last week, alongside other AI experiments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e97c95b340cc7d9d0ebced2db4b426d303c1ad7b",
      "title": "Tesla Dojo: The rise and fall of Elon Musk’s AI supercomputer",
      "url": "https://techcrunch.com/2025/09/02/tesla-dojo-the-rise-and-fall-of-elon-musks-ai-supercomputer/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:18:46.000Z",
      "summary_90w": "",
      "raw": "Dojo was going to be Tesla’s custom-built supercomputer. Here's what Elon Musk had in mind, what happened, and what's coming next.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d46869ae69d440200183c86e14c507c85ddb92b2",
      "title": "ICE reactivates contract with spyware maker Paragon",
      "url": "https://techcrunch.com/2025/09/02/ice-reactivates-contract-with-spyware-maker-paragon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:11:25.000Z",
      "summary_90w": "",
      "raw": "The Israeli spyware maker now faces the dilemma of whether to continue its relationship with U.S. Immigration and Customs Enforcement and help fuel its mass deportations program.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba854e3deded012457b724f56c45bc747a499de6",
      "title": "MrBeast reportedly plans to launch a phone company",
      "url": "https://techcrunch.com/2025/09/02/mrbeast-reportedly-plans-to-launch-a-phone-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:58:30.000Z",
      "summary_90w": "",
      "raw": "MrBeast, the 27-year-old popular YouTuber, plans to launch a phone company as he diversifies his brand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ae0e1ce7630b5acd0f10dcc27910a2cdc730112",
      "title": "Five children in Gaza among those killed by Israeli strike while fetching water",
      "url": "https://www.theguardian.com/world/2025/sep/02/children-among-those-killed-in-gaza-while-fetching-water-by-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:32:50.000Z",
      "summary_90w": "",
      "raw": "Latest attack comes as Israel’s military urges people to leave Gaza City with 60,000 more reservists to be called up\nAt least nine people, including five children, have been killed in an Israeli strike while fetching water in al-Mawasi, an area of southern Gaza which Israel has designated as a safe zone, health officials said.\nA doctor from al-Nasser hospital shared a picture of the children’s bodies in the hospital, as well as a picture of water jugs left in a pool of blood at the site of the attack on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d203ebfab4aa685fce025a5c48b071284b5130",
      "title": "Instagram tests Picture-in-Picture viewing for reels",
      "url": "https://techcrunch.com/2025/09/02/instagram-tests-picture-in-picture-viewing-for-reels/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:31:11.000Z",
      "summary_90w": "",
      "raw": "The move comes as apps like TikTok and YouTube have had support for Picture-in-Picture for quite some time now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88909bf9a463d2ae9be300a55d52875cd23e2daf",
      "title": "Putin claims he never opposed EU membership for Ukraine but draws line at Nato – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:28:22.000Z",
      "summary_90w": "",
      "raw": "Russian leader, continuing China visit, is joined by Slovakia’s Robert Fico. This live blog is closed\nIn the meantime, we have had an update from Ukraine where a man accused of murdering a pro-western Ukrainian politician in the city of Lviv last weekend admitted that he carried out the killing but denied working for Russia, describing the attack as “personal revenge,” AFP reported.\n“This is my personal revenge on the Ukrainian authorities,” the suspect told reporters in a video published by Ukrainian media outlets, denying he worked directly with Russian special services.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "580ffe349db445b1879e290804a721aabe3351d4",
      "title": "My rent's gone up by almost 20% - and my landlord wants to evict me",
      "url": "https://www.bbc.com/news/articles/cjw6w32z07zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T15:17:09.000Z",
      "summary_90w": "",
      "raw": "Glasgow tenant Elle Glenny says the impact of a rent increase has been catastrophic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "529fb53dc0cb1d411612c1e3abb35c9f16a14c63",
      "title": "Klarna revives IPO plans, aims to raise $1.27B",
      "url": "https://techcrunch.com/2025/09/02/klarna-revives-ipo-plans-aims-to-raise-1-27b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:30:52.000Z",
      "summary_90w": "",
      "raw": "Swedish buy now, pay later (BNPL) startup Klarna and its shareholders are reviving its initial public offering, hoping to raise as much as $1.27 billion in a listing that would value the company at up to $14 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b7a8a37e3db8455f33980e1ecb1bc638c314a6",
      "title": "Just 4 days left to exhibit at TechCrunch Disrupt 2025 — 10 tables remain",
      "url": "https://techcrunch.com/2025/09/02/just-4-days-left-to-exhibit-at-techcrunch-disrupt-2025-10-tables-remain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The clock is ticking, and exhibit space at TechCrunch Disrupt 2025 is moving fast. With just 4 days and 10 table left to book, now’s the time to stop circling the idea and claim your spot on the show floor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24cd045a7276ab858581db6792ace812b83c0436",
      "title": "Kraft Heinz is splitting up, separating hot dogs from ketchup",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5464951/kraft-heinz-split-breakup",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T11:26:42.000Z",
      "summary_90w": "",
      "raw": "One of the world's largest food brands is splitting apart a decade after a messy megamerger staged by Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b016be77d542ad20842b37dd9878a0d42e93294c",
      "title": "Billy Bragg releases song in support of Palestine and Greta Thunberg aid flotilla",
      "url": "https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T10:40:02.000Z",
      "summary_90w": "",
      "raw": "Hundred Year Hunger – which has a chorus in Arabic – has been released by the British protest singer to coincide with a humanitarian aid flotilla heading for Gaza\nBilly Bragg has released a new original song to show his support for the people of Palestine. The title of Hundred Year Hunger was inspired by a new book of the same name by E Mark Windle about the history of chronic malnutrition and deprivation in Gaza and will raise money for the Amos Trust’s Gaza Appeal.\nWriting on Instagram, the British protest singer said that the song “looks at the current famine that Israel has created in Gaza through the lens of a century of enforced food insecurity and malnutrition imposed on the Palestinian people, firstly by British imperialism, then as a weapon of mass displacement by the state of Israel”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "412aa03368e77abdc17146130a428eacb10acfcf",
      "title": "Federal tax credits for electric vehicles are ending, leading to spike in sales",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650/federal-tax-credits-for-electric-vehicles-are-ending-leading-to-spike-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T08:59:57.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "513444dfa843e2ed963274b891736ebe8f13c954",
      "title": "BMW, I am so breaking up with you",
      "url": "https://techcrunch.com/2025/09/01/bmw-i-am-so-breaking-up-with-you/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T06:07:36.000Z",
      "summary_90w": "",
      "raw": "I’m driving my i4 back to the dealership as soon as my lease is over. I'm surprised to say I can't wait.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8173a2881ad5fc29a63310a224b2a0a4e43aa596",
      "title": "Indian grocery startup Citymall raises $47M to challenge ultra-fast delivery giants",
      "url": "https://techcrunch.com/2025/09/01/indian-grocery-startup-citymall-raises-47m-to-challenge-ultra-fast-delivery-giants/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T04:30:00.000Z",
      "summary_90w": "",
      "raw": "Citymall's funding comes at a time of a quick-commerce frenzy in the Indian market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bbd5ddade2f3b4c8ec87a973c5fd34539ccc944",
      "title": "Starter homes are scarce, so Utah set a target to build more. Here's how it's going",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5431545/starter-homes-utah-housing-cost-affordable-target",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T04:01:00.000Z",
      "summary_90w": "",
      "raw": "In one of the country's priciest housing markets, Utah's leaders worry young people are shut out from building wealth. But despite new incentives, few developers are signing on to build smaller homes.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c4629edf45809674f00a41f8fc05add6df351804",
      "title": "US and Indian VCs just formed a $1B+ alliance to fund India’s deep tech startups",
      "url": "https://techcrunch.com/2025/09/01/u-s-and-indian-vcs-just-formed-a-1b-alliance-to-fund-indias-deep-tech-startups/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T03:30:00.000Z",
      "summary_90w": "",
      "raw": "Eight U.S. and Indian VC and PE giants are teaming up to fuel India's deep tech boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a3e022afdd2256a34c3a6e280d1c8816a7b3554",
      "title": "Body seen in secret mortuary could solve 50-year mystery of vanished religious leader",
      "url": "https://www.bbc.com/news/articles/clyr1qr529xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T00:18:28.000Z",
      "summary_90w": "",
      "raw": "Compelling evidence to suggest Lebanese Shia leader Musa al-Sadr was killed in Libya is uncovered by BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0e6d0c8ef09900d8d54bd5f5af91eea6830e085",
      "title": "Watch: Buildings destroyed and rescue efforts under way after deadly Afghanistan earthquake",
      "url": "https://www.bbc.com/news/videos/cqxgx8d14wwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:29:23.000Z",
      "summary_90w": "",
      "raw": "At least 800 people have been killed and thousands injured in the east of the country after a 6.0 magnitude earthquake struck on Sunday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68105a770ce0bbb71d9718bdd33c6fe1ec26154f",
      "title": "How the death of a delivery driver ignited Indonesia",
      "url": "https://www.bbc.com/news/articles/c2dj9w306wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:08:13.000Z",
      "summary_90w": "",
      "raw": "Protests over corruption and inequality have spiralled into violence, arson and deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89d4226069d5468002f6233efedff9644e32bfd9",
      "title": "Leaked ‘Gaza Riviera’ plan dismissed as ‘insane’ attempt to cover ethnic cleansing",
      "url": "https://www.theguardian.com/world/2025/sep/01/leaked-gaza-riviera-plan-dismissed-as-insane-attempt-to-cover-ethnic-cleansing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T17:08:16.000Z",
      "summary_90w": "",
      "raw": "Prospectus proposes forced displacement of entire population and puts territory into US trusteeship\nA plan circulating in the White House to develop the “Gaza Riviera” as a string of high-tech megacities has been dismissed as an “insane” attempt to provide cover for the large-scale ethnic cleansing of the Palestinian territory’s population.\nOn Sunday the Washington Post published a leaked prospectus for the plan, which would involve the forced displacement of Gaza’s entire population of 2 million people and put the territory into a US trusteeship for at least a decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b922ff820e9ad58307010f6072b7e31bb43110a",
      "title": "How Trump is decimating federal employee unions one step at a time",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5515633/trump-federal-workers-labor-unions-va",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump has ended collective bargaining rights for more than 1 million federal workers. Unions have sued to block the move, but agencies are terminating contracts as litigation continues.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37aa811eccb417ff986e00dff34d9c6a9bedb670",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "url": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:00:25.000Z",
      "summary_90w": "",
      "raw": "Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing\nMalawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.\nIt comes just months after the World Health Organization (WHO) revealed that the country had successfully reduced tuberculosis (TB) cases by 40% over the past decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}