{
  "version": "1756977339932",
  "generatedAt": "2025-09-04T09:15:39.932Z",
  "items": [
    {
      "id": "caa890f6f0f606b901b8d900822c98f38d915655",
      "title": "RFK Jr. to face questions about chaos at the CDC",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/04/nx-s1-5525885/rfk-cdc-hhs-senate-finance",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:01:00.000Z",
      "summary_90w": "",
      "raw": "Democratic lawmakers and more than a thousand current and former HHS staff say Kennedy's actions are endangering America's health. Kennedy says he came to clean house and he's delivering.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c78c3443949087aa6c9ef4bb34a7a0b0cda26ee",
      "title": "A literary center named for author Larry McMurtry breathes life into his Texas hometown",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5493469/larry-mcmurtry-books-literary-archer-city-texas-western",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A literary center in Archer City, a tiny ranching town in Texas, keeps alive the legacy of famed Western author Larry McMurtry.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8b995b61d90b1c7350df20aa7d2fed7d2e75644",
      "title": "Fox bosses privately called U.S. Attorney Jeanine Pirro 'reckless maniac' and more",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526879/fox-news-jeanine-pirro-reckless-maniac",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Her colleagues made those remarks after the 2020 presidential election, when Pirro used her platform to amplify baseless claims of election fraud. She is now the U.S. attorney for Washington, D.C.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db67fa530b19db4f498b6547b1b1f589c93e3f58",
      "title": "How the Education Department is using civil rights laws to bring schools to heel",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5500262/trump-civil-rights-schools-students",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Trump administration is using decades-old laws, meant to prevent discrimination, to threaten school districts and states with cuts to vital federal funding.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f472c03bb8c1e51ff0e0294e4fd38ca99f3d416e",
      "title": "Sell it, donate it — recycle it? A beloved old minivan faces a fork in the road",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5492399/old-car-sell-donate-recycle",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "After 20 years of service, an NPR reporter's beloved minivan is on the fritz. But what is its best and highest calling now: Pass it on to another family, or recycle it into parts?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "32f54c95784ba164002ef372212e16d838b60737",
      "title": "Leaders gather for ‘Coalition of the Willing’ talks on Ukraine security guarantees – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/04/ukraine-russia-security-guarantees-coalition-of-the-willing-paris-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T08:52:05.000Z",
      "summary_90w": "",
      "raw": "Emmanuel Macron says Europe ready to provide such guarantees at meeting in Paris today\nThe Dutch prime minister Dick Schoof is next.\nBelgium’s Bart de Wever, Finland’s Alexander Stubb, and the EU’s Ursula von der Leyen and António Costa are the first leaders arriving at the Élysée Palace, welcomed by Macron on the doorstep.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38dff43542faebcbc53025f0f71d459adb5b7b72",
      "title": "Decision to close Meanjin criticised as act of ‘utter cultural vandalism’",
      "url": "https://www.theguardian.com/books/2025/sep/04/meanjin-close-melbourne-university-publishing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T08:48:34.000Z",
      "summary_90w": "",
      "raw": "Shutting long-running literary journal, which published emerging writers as well as the cream of Australia’s literary talent, described as ‘enormous loss’\n\nGet our breaking news email, free app or daily news podcast\n\nOne of Australia’s longest running literary journals has been scrapped, in what has been described as an act of “utter cultural vandalism” on the part of the University of Melbourne.\nAfter 85 years, Meanjin, run by the university’s subsidiary Melbourne University Publishing (MUP), will publish its last edition in December. Although the journal’s editor, Esther Anatolitis, worked her last day at Meanjin on Thursday, the spring and summer quarterly editions of the journal are already at the printers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f15644036527e25e9cea1c569b3489786d06b416",
      "title": "Anker stuffed its awesome Nebula X1 projector into a party speaker",
      "url": "https://www.theverge.com/news/765735/anker-nebula-x1-pro-party-speaker-price-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:30:00.000Z",
      "summary_90w": "",
      "raw": "The Soundcore Nebula X1 Pro is a party on wheels. | Image: Anker\t\n\nAnker took its portable and incredibly bright Nebula X1 projector and jammed it into a 30 x 17 x 13.5-inch box with a 160W subwoofer to create the Soundcore Nebula X1 Pro. The resulting Google TV party projector — announced at IFA 2025 — weighs 72.4 pounds, so Anker also gave it a retractable handle and wheels to keep it mobile.\nThe sub — which produces “chest thumping base,” according to Anker — is configured to float inside the assembly to avoid rattling the 4K image. A pair of 80W soundbar speakers fold out on the left and right sides and can be detached to optimize placement at the front of the room, with a pair of 40W wireless satellites for the rear channels, as well. There is a promise of 7.1.4 surround sound, including support for Dolby Atmos, which would be a first for a portable projector. But good luck on deciphering those upward firing channels when using the X1 Pro outdoors. You can also put the X1 Pro into Bluetooth speaker mode when music is the only entertainment required.\n\n\n\n\n\n\nOtherwise, we’re looking at the same all-in-one Nebula X1 projector that I recently reviewed and loved, thanks to its impressive image, great sound, all-glass lens mounted on a motorized swivel, optical zoom, quiet operation, and bright 3,500 ANSI lumen output from its triple laser light source. Only now, everything is rated at IP43 to help protect it from light rain and dust.\nAnker’s Nebula X1 Pro — now under its Soundcore brand — is expected to have a Kickstarter debut on September 22nd, with a price somewhere between $4,000 and $5,000. It’ll hit retail channels around March 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "27ad166a60676a6d31ab491c7f4ad4e6e75aa668",
      "title": "Anker’s fastest power bank launches alongside new Prime family",
      "url": "https://www.theverge.com/news/765778/anker-fastest-power-bank-launches-new-prime-family",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:30:00.000Z",
      "summary_90w": "",
      "raw": "Starting from the left: the Prime docking station, power bank, power bank with base, wall charger, and 3-in-1 bedside charger. | Image: Anker\t\n\nJust one week after EcoFlow launched the fastest 99Wh power bank yet, Anker is firing back at IFA 2025 with a souped-up portable battery of its own. Anker’s Prime Power Bank (26k, 300W) supports 250W of input, or up to 300W of output to charge multiple devices simultaneously, making it a decent runner-up. It arrives alongside a revamped Prime series of devices that includes a Qi2 25W charging station, a small but powerful GaN wall charger, and a 14-in-1 docking station that supports up to three displays.\nAnker’s Prime Power Bank (26k, 300W) holds an airline-friendly capacity of 26,250mAh (99.75Wh at 3.8V). It features two bidirectional USB-C ports capable of 140W each, in addition to a 22.5W USB-A jack. The total output is 300W, which is enough to charge two power-hungry laptops and a phone simultaneously. Unfortunately, it lacks the “find device” feature from earlier Prime power banks.\nIf you reverse the flow of electrons, then it can accept a charging input of up to 250W when plugged into a pair of 140W USB-C PD 3.1 chargers, reportedly taking it from zero to 80 percent in 35 minutes. It can also be charged at 150W through the pogo-pin connector on the bottom when placed on top of Anker’s Prime Charging Base. The Charging Base (sold separately for an undisclosed price and date) can also charge three other devices at the same time from a 140W max USB-C port, 100W max USB-C port, and 22.5W max USB-A port. But the total output is capped at 150W.\nThe Anker Prime Bank (26k, 300W) has a display that shows what’s happening on each port, which can also be monitored remotely through the Anker companion app. It measures 159.9 x 38 x 62.7mm, and it is expected to be available on September 25th for a price that’s yet to be determined.\nAnker’s 14-in-1 Prime Docking Station is priced at $299.99 / €349.99 / £299.99 and comes slathered in USB-C, USB-A, HDMI, DisplayPort, Ethernet, audio, and SD / TF slots — the USB-C ports all support fast charging and up to 10Gbps data transfer. The dock supports a triple monitor setup (up to 8K / 4K / 4K) for macOS and Windows laptops with a built-in display that shows USB-C power draw, data transfer status, display signal, and temperature. There’s even a PC app to manage and monitor the ports. It’s expected to be available on September 5th.\nAnker says its new Prime Charger is 43 percent smaller than Apple’s 140W charger. All three USB-C ports support 140W output, but it can only produce a total of 210W (140W + 35W + 35W) when charging three devices simultaneously. The plug folds flat when not in use, and the display shows detailed power specs for each port that can also be viewed over Bluetooth in Anker’s companion app. The price is $149 / €129, with availability set for September 25th.\nLast is Anker’s 3-in-1 Prime Wireless Charging Station, which is built around active cooling to keep the charging surfaces below 36 degrees Celsius — a trick meant to maximize charging power while reducing heat in order to prolong battery health. It can charge a Qi2 25W (aka Qi2.2) phone, Apple Watch (5W), and AirPods (5W) simultaneously. That cooling tech also creates noise from a device that might live next to your bed. Anker promises a whisper-quiet 29dB during operation and a near-silent “sleep mode.” Price is TBD, with an expected release date of September 25th.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "824f2f7ba8146c2a11f2095de88c021e3a112ae6",
      "title": "Anker&#8217;s new AI voice recorder is the size of a coin",
      "url": "https://www.theverge.com/news/769467/anker-soundcore-work-ai-recorder-gpt-4o",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:30:00.000Z",
      "summary_90w": "",
      "raw": "The coin-sized Work is designed to be discreet but includes LEDs that indicate when it’s recording. | Image: Anker\t\n\nAnker is the latest company to announce an AI-powered voice recorder designed to transcribe, summarize, and highlight important moments from a conversation or meeting. Its functionality is similar to what’s offered by devices like the Bee or Plaud NotePin, but the Soundcore Work manages to further shrink the hardware down to an even smaller coin-sized wearable.\nLaunching in September with a wider global rollout expected later this year, the Work measures just 0.91 inches across — and while that’s less than the diameter of a quarter, the recorder is actually a bit thicker than a coin. It’s priced at $99.99, which includes “basic services,” but Anker will also be offering a $15.99 per month subscription that includes additional features not yet revealed.\nThe Work is designed to be attached to a lanyard or worn on your clothing using a magnetic clip. Weighing just 10 grams, it’s small and lightweight but still manages up to eight hours of battery life, according to Anker. If that’s not enough, the Work’s proprietary charger has a battery of its own that will keep it powered for up to 32 hours.\nInstead of capturing every interaction you have all day long, the Work only starts recording audio through its dual mics when tapped, while a double tap lets you mark important parts of a conversation that are highlighted later in transcripts.\nThe recorder uses on-device GPT-4o to transcribe audio recordings in more than 100 languages. Both the transcripts and audio recordings are available in the Soundcore mobile app and can be searched or exported to other formats. Anker says recordings are encrypted and processed locally for privacy reasons but can be bounced through the cloud if you desire to share them with someone.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b7072468ed51cc4814a35594f56e6ceba888f5a9",
      "title": "Eufy built a stairlift for its robovacs",
      "url": "https://www.theverge.com/ifa-berlin/769976/eufy-marswalker-stair-climbing-robotic-vacuum-price-specs-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:30:00.000Z",
      "summary_90w": "",
      "raw": "Eufy’s MarsWalker can transport a robot vacuum up and down stairs.\t\n\nWho needs legs? Eufy, Anker’s smart home brand, believes it has solved the problem of how a single robot vacuum can clean multiple floors in your home. Its new MarsWalker robot is equipped with four arms to carry a vacuum between levels, so you don’t have to lug it up the stairs yourself or buy a robot for each floor. However, you’ve now got two robots, so perhaps it’s not really solving that problem.\nEquipped with a drive-track system, the MarsWalker acts like a stairlift for your robot vacuum. The vacuum docks in the MarsWalker, which carries it to the next floor using four independently controlled arms. From there, the vacuum exits to resume cleaning or head to its base station to wash its mop, empty its bin, or recharge.\nEufy says the MarsWalker can tackle straight, L-shaped, and U-shaped stairs and builds a 3D map of your home to understand where the vacuum needs to go. It’s a standalone unit with its own charging base, and the company says it will work with several models of Eufy robot vacuums, although exact specs and compatibility haven’t been released. It’s slated to launch in the spring of 2026, but no pricing has been announced.\nOne compatible model will be the new Eufy RoboVac Omni S2, which is also on show at IFA. Due to launch in the US in January for $1,599, the S2 is an upgraded version of the Eufy S1 Pro.\n\n<em>The Eufy S2 Pro Omni, the company’s newest flagship robot vacuum, “joining” with the MarsWalker.</em>\n\nThe S2 features a large, self-cleaning roller mop, 30,000Pa suction power, 3.3lbs of downward mopping pressure, and can extend its mop out up to 15mm to clean along baseboards. It has a new DuoSpiral brush to prevent tangling, while improved obstacle detection enables the vacuum to avoid rug tassels as well as over 200 other objects. It can also elevate its mop up to 2 inches to avoid getting carpets wet. \nIt also features a built-in fragrance system that releases various scents while cleaning, including citrus, basil, bergamot, and lychee. The futuristic cleaning station automatically empties the bin, washes and dries the mop, and refills the onboard water tank.\nI’ll be getting a look at the new MarsWalker this week at IFA and will report back with first impressions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6be1eb37e70115192ee7346b84601e71fc4634a9",
      "title": "Eufy&#8217;s latest security camera can see everywhere all at once",
      "url": "https://www.theverge.com/news/769518/anker-eufycam-s4-4k-ai-core",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:30:00.000Z",
      "summary_90w": "",
      "raw": "An hour of direct sunlight can fully recharge the new Eufycam S4. | Image: Eufy\t\n\nEufy, Anker’s smart home brand, has announced a new outdoor security solution with a stationary 4K wide-angle camera that can spot intruders and then trigger a pair of 2K cameras to pan, tilt, and zoom in to get a closer look at their faces, even when they’re up to 164 feet away.\nPriced at $299, the new Eufycam S4 includes a 5.5W solar panel that can fully charge the camera with an hour of direct sunlight, but features like 24/7 continuous recording are only available while it’s connected to a permanent power source. The S4 uses a combination of radar and a passive infrared sensor to detect motion, while four LED spotlights facilitate color night vision. Its 32GB of storage can be upgraded to 256GB with a microSD card or further expanded to up to 16TB with Anker’s HomeBase S380 accessory.\nEufy also announced another accessory for its security cameras. Expected to launch in November, the AI Core uses an on-device AI model to quickly detect and classify more than 100 different behaviors and events from multiple live camera feeds in an attempt to predict what a subject might do. By eliminating the delays of analyzing footage in the cloud, the AI Core is supposed to provide faster alerts to users so they have more time to react to potential problems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4995b2623a0231d14e2840cfed8de25bf8827bf2",
      "title": "Allies ready to support Ukraine before and after peace deal, says UK",
      "url": "https://www.bbc.com/news/articles/c5y85x58nj4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T08:26:02.000Z",
      "summary_90w": "",
      "raw": "The UK and other allies hope to obtain clear US backing for their efforts to shore up Ukraine's defences.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6fca5ca0d1ba218713d8af908cddf123a9559ab4",
      "title": "Aqara announces Apple-friendly doorbell, outdoor camera, video hub, and more",
      "url": "https://www.theverge.com/news/771071/aqara-announces-apple-friendly-doorbell-outdoor-camera-video-hub-and-more",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:16:11.000Z",
      "summary_90w": "",
      "raw": "Aqara’s smart home lineup announced at IFA. | Image: Aqara\t\n\nAqara’s at IFA in Berlin where it just announced a slew of new smart home products, highlighted by a new wired doorbell camera, a video recording hub for Aqara cameras, and the company’s first battery-powered camera for outdoor use. \nThe new Doorbell Camera G400 is only available for wired installations, and works with Apple’s HomeKit Secure Video for secure cloud-based recordings and facial recognition. The 2k sensor promises 165-degree “head-to-toe” video capture, alongside motion, package, vehicle, animal, and person detection. It can be powered by a PoE cable or traditional low voltage power supply.\nThe Camera G510 is Aqara’s first battery-powered outdoor camera. It includes a built-in solar panel to keep its battery topped up, and a 2.5k resolution to help with on-device person, vehicle, and package detection. \nThe Home Station M410 is a multi-functional security hub that creates a central point of access for Aqara’s cameras, while also helping to extend their operating range. It supports 24/7 recording to a local hard disk, SSD, or microSD card, while doubling as a Matter hub.\nAqara’s also got a new multi-protocol Hub M200 that can serve as a Matter controller, Thread border router, Matter bridge for Aqara’s Zigbee devices, and a 360-degree IR blaster. Rounding things out are a Radiator Thermostat W600 with support for both Thread and Zigbee connectivity, and a handful for H2-series power management smart plugs and outlets for the EU and UK markets.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c64757572eba6b5f747847ecaccaa9bd5bffb3f1",
      "title": "Portugal observes national day of mourning as Lisbon streetcar death toll rises to 17",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5528599/portugal-streetcar-accident-deadly-mourning",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T08:11:47.000Z",
      "summary_90w": "",
      "raw": "The streetcar's crumpled wreckage was still on the downtown road where it crashed Thursday. Officials declined to speculate on whether a faulty brake or a snapped cable may have caused the accident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b84e4e6a5782d33861a44628917d679d7ce9ec4",
      "title": "Nigel Farage urges US to oppose UK on free speech laws",
      "url": "https://www.bbc.com/news/articles/ce9rzngd9k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T08:02:28.000Z",
      "summary_90w": "",
      "raw": "The Reform UK leader gives evidence to US lawmakers but gets a rough reception from some Democrats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5d2d615281a5cbdb4be3a727090ed6d1a04d5f",
      "title": "Belkin’s cheap wired earbuds give you ANC without battery anxieties",
      "url": "https://www.theverge.com/news/768621/belkin-soundform-earbuds-anc-price-launch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:00:00.000Z",
      "summary_90w": "",
      "raw": "Belkin is launching four new affordable earbuds, including a wired option that provides active noise cancellation (ANC) for users who don’t want to worry about battery life. The SoundForm USB-C Wired Earbuds with ANC will be available sometime in October for $34.99, according to Belkin’s press release, and come in white or black.\nThey feature a 4-foot-long cable with a built-in microphone and volume adjuster toggle, and carry an IPX5 rating — meaning the earbuds can survive being splashed with water. The cable is flat to help prevent tangles. They provide 12mm audio drivers and three equalizer presets to adjust the listening experience. Belkin’s wired SoundForm earbuds draw power for the ANC feature from whatever device it’s connected to.\nThe rest of Belkin’s new earphone products are wireless and will all be available for $34.99 “beginning September 2025,” according to Belkin. The SoundForm Rhythm ANC includes 10mm drivers and two microphones per earbud, Bluetooth 5.3 support, an IPX5 rating for splash resistance, and three listening modes: ANC, Hear-Thru, and Standard. The earbuds last up to eight hours per charge, with up to 20 additional hours of playtime provided by the included charging case.\nThe SoundForm ActiveFit feature silicone ear hooks to keep them in place during physical activity, as well as a water and dust-resistant IP54 rating. You don’t get any ANC features, but they do include Standard and Hear-Thru listening modes for training in both indoor and outdoor environments. The ActiveFit batteries provide up to nine hours of playback, with up to 27 additional hours provided by the case.\nThe SoundForm Anywhere is the most compact of Belkin’s new earbud launches, featuring multipoint connectivity for pairing with two devices and up to 26 hours of total battery life — six provided on a single charge, and 20 from the charging case.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9aa0079dd7d440292573558bcdc2e4eaa47513d9",
      "title": "This Belkin Qi2 charging puck comes with a kickstand and cooling",
      "url": "https://www.theverge.com/news/770539/belkin-ultracharge-magnetic-charger-qi2-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T08:00:00.000Z",
      "summary_90w": "",
      "raw": "The UltraCharge is a 3-in-1 grip, stand, and charger.\t\n\nBelkin has announced new charging accessories at the IFA tech show in Berlin, Germany, including a wireless charging puck that doubles as a kickstand for your devices. The UltraCharge Magnetic Charger features a collapsible ring-shaped stand on the back that can either be used to prop up your phone, allowing you to stream hands-free content while it’s charging, or utilized like a magnetic phone grip that makes the device easier to hold.\nThe UltraCharge uses the new Qi2.2 wireless standard, delivers up to 25W of power, and was designed with passive cooling technology for “optimal performance and battery protection,” according to Belkin’s press release. The UltraCharge Magnetic Charger comes in either black or white color options, and includes an integrated 6.6 feet / 2 meter USB-C cable, which might be a little restrictive if you want to use the ring grip to carry your phone around while it’s charging.\nThat ring grip could still come in handy if you’re used to using accessories like PopSockets, though, and it’s a neat feature you don’t typically find on Google’s or Apple’s puck chargers. The only thing to consider is price and availability; Belkin says the UltraCharge Magnetic Charger is launching in the US sometime in either November or December, but it’s arriving in other regions in October. The US price also isn’t set, but will fall between $29.99 and $39.99, according to Belkin.\n\n\n\n\nThis is the most interesting of Belkin’s new charger launches, which also include a $29.99 75W BoostCharge Retractable Car Charger that doesn’t currently have a US release date. These were announced alongside two versions of the BoostCharge Pro Dual USB-C GaN charger: a 50W model that will be available in September for $39.99, and a 67W version for $49.99 that’ll launch in the US market early next year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b4db75cbe58602f55def216965c64bd0e950ab0f",
      "title": "Ben Roberts-Smith’s final appeal bid rejected by high court – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T07:40:22.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nDaniel Andrews defends decision to attend China military parade alongside Vladimir Putin and Kim Jong-un\n\nGet our breaking news email, free app or daily news podcast\n\nSenator continues calls to criminalise burning Australian flag\nJacinta Nampijinpa Price is tripling down on her call for the burning of the Australian flag to be criminalised, and has called for Anthony Albanese to only stand in front of the Australian flag.\nI think in recent times, a lot of Australians have been vilified and the suggestion is that they’re somehow racist if they take pride in who we are as a country and in our flag that represents us as a country. I find that our prime minister standing in front of three flags divides us.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6df1ed0c14622fc39d8b9ed7f9a92047db13a14b",
      "title": "Inside Philips Hue’s plans to make all your lights motion sensors",
      "url": "https://www.theverge.com/smart-home/768585/philips-hue-motion-aware-rf-sensing-lights-motion-ivani",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T07:30:00.000Z",
      "summary_90w": "",
      "raw": "The Hue Bridge Pro, Philips Hue’s first new Zigbee hub in a decade, is the brains behind its new motion-sensing technology.\t\n\nPhilips Hue has announced that its smart light bulbs - both new and existing models - are being upgraded to feature built-in motion sensing. The new feature, called Hue MotionAware, uses radio-frequency (RF) sensing to detect changes in the Zigbee signal between bulbs, allowing them to respond to movement without the need for separate motion sensors.\nIt's a major upgrade for Hue users, introducing a powerful new capability to existing hardware at no extra cost - though to activate the feature, you will need Hue's new Bridge Pro ($90), which also launched this week at the IFA 2025 tech show. According to Signify, Hue's parent company, Motion …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6390bf231ce786aa7202ebf707caccbf226ba78b",
      "title": "Philips Hue responds to cheaper competitors with major product overhaul",
      "url": "https://www.theverge.com/smart-home/768554/philips-hue-essentials-smart-lighting-cheaper-support-matter-thread",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T07:30:00.000Z",
      "summary_90w": "",
      "raw": "All the new Hue Essentials line white and color ambiance LED bulbs cost $25 each, or as low as $15 each, if you buy a multipack.\t\n\nPhilips Hue has announced the biggest revamp of its smart lighting line in years, introducing lower-cost lights, support for Matter over Thread, and a new generation of brighter light strips. The update includes the launch of a new Essentials line, motion-sensing technology across all Hue lights, and what the company calls the \"brightest and best light strip money can buy.\" \nPhilips Hue is well known for high-quality smart lights that are super expensive but super reliable, thanks to its mature Zigbee network. Now, the Dutch lighting company, owned by Signify, is looking to more directly compete with its increasing number of budget rivals,  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3f3f10d3812de2a801ac7fd533797813e87076f8",
      "title": "Guyana President Irfaan Ali claims victory in general election",
      "url": "https://www.bbc.com/news/articles/cevzj1yldl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T07:05:25.000Z",
      "summary_90w": "",
      "raw": "The incumbent president claimed victory in an election dominated by how to manage the country's vast oil reserves.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "025e824153d407459d6bc2817d859382fa25c598",
      "title": "The teen aiming to be youngest undisputed champion",
      "url": "https://www.bbc.com/sport/boxing/articles/cp94zlr8z2po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T06:52:55.000Z",
      "summary_90w": "",
      "raw": "She's still only 19, but Britain's Tiah-Mai Ayton has set her sights on becoming the youngest ever undisputed champion in boxing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "46738b286eaed4ae5ffbc04ea33dc6bf97adaa64",
      "title": "What we know about Rayner's tax admission - and the unanswered questions",
      "url": "https://www.bbc.com/news/articles/c62n366q306o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T06:50:14.000Z",
      "summary_90w": "",
      "raw": "The deputy PM has admitted underpaying stamp duty on her £800,000 flat in Hove, East Sussex.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90c6f290e870aa1d25f039fd30ee359afe18a644",
      "title": "Labor and Coalition pass deportation laws set to make Nauru a ‘penal colony’ for Australia, critics say",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/labor-coalition-pass-deportation-laws-naura-australia-penal-colony-australia-critics-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:35:59.000Z",
      "summary_90w": "",
      "raw": "Legislation validates flawed decisions, cuts off appeals and gives government sweeping powers to deport people, campaigners claim\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe major parties have been accused of “stitching up” a deal to transform Nauru into Australia’s “dumping ground and penal colony” as parliament passed laws stripping basic legal rights from a group of noncitizens set to be deported.\nThe home affairs legislation passed the Senate on Thursday, after a snap three-hour parliamentary hearing the night before.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1af249c12366fdf1eba296deed3e4dc59132612",
      "title": "Jacinta Nampijinpa Price blames ABC for her claim that government is prioritising Labor-voting migrants",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/jacinta-nampijinpa-price-blames-abc-for-claim-government-prioritising-labor-voting-migrants",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:32:31.000Z",
      "summary_90w": "",
      "raw": "Liberal says she believes she doesn’t have ‘anything to apologise for’ and says broadcaster’s reporter ‘pushed the issue’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nFirebrand Liberal senator Jacinta Nampijinpa Price has blamed the ABC for her comments claiming Labor was bringing Indian migrants into Australia to boost its electoral chances, insisting she has nothing to apologise for.\nThe Northern Territory senator said on Wednesday sections of the Australian community were concerned at “the core number, or the type, of migrants that are coming in”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "593cecfb8f53b16538d88ada5dd6aa8512d42bac",
      "title": "Martha's rule rolled out to all acute hospitals in England after hundreds of lives saved",
      "url": "https://www.bbc.com/news/articles/c8e1zw28766o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T06:20:58.000Z",
      "summary_90w": "",
      "raw": "Hundreds of patients have been helped by rule, which makes it easier to get an urgent second opinion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2dce6c9709a994f49a4d71bf559bab6405171ca4",
      "title": "Failure to tackle antisemitism should see organisations’ funding cut like subpar childcare centres, special envoy says",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/failure-tackle-antisemitism-organisations-funding-cut-subpar-childcare-centres-special-envoy-jillian-segal-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:16:16.000Z",
      "summary_90w": "",
      "raw": "At a Gold Coast conference, Jillian Segal declined to address the presence of neo-Nazis at Sunday’s anti-immigration marches\n\nFollow our Australia live politics blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s antisemitism envoy says if the government is prepared to cut funding to childcare centres that fail to keep kids safe from sexual assault, it should do the same for organisations that refuse to address antisemitism.\nJillian Segal has also declined to specifically address the presence of neo-Nazis at anti-immigration marches on the weekend, during a speech at a Gold Coast conference organised by the US-based Combat Antisemitism Movement and during a subsequent press conference.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1e2a126696f02c551928711b4878bdfb76a9a7d",
      "title": "Israeli military database indicates only a quarter of Gaza detainees are fighters",
      "url": "https://www.theguardian.com/world/2025/sep/04/israeli-military-database-indicates-only-a-quarter-of-gaza-detainees-are-fighters",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:00:46.000Z",
      "summary_90w": "",
      "raw": "Elderly woman with Alzheimer’s, medical workers and children among 6,000 Palestinians held\nOnly one in four detainees from Gaza are identified as fighters by Israel’s military intelligence, classified data indicates, with civilians making up the vast majority of Palestinians held without charge or trial in abusive prisons.\nThose jailed for long periods without charge or trial include medical workers, teachers, civil servants, media workers, writers, sick and disabled people and children.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5af2f24b58f60cb124e0287037fd95c6505f148a",
      "title": "Jamaica election results: Andrew Holness leads Labour party to third term",
      "url": "https://www.theguardian.com/world/2025/sep/04/jamaica-election-results-andrew-holness-leads-labour-party-to-third-term",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:42:26.000Z",
      "summary_90w": "",
      "raw": "Incumbent prime minister says country on right trajectory, as opposition leader concedes defeat \nJamaicans have voted to give Andrew Holness and the Jamaica Labour party (JLP) a third consecutive term in government after a nail-biting race with the opposition People’s National party (PNP).\nHolness beat PNP’s Mark Golding after polls in the final days of the intense campaign projected a narrow lead for the PNP. Of the 63 seats being contested, preliminary results showed the JLP winning 34 seats and the PNP 29.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "694b253e92d177568d4c78ce03686c245a440282",
      "title": "Thursday briefing: China flexes its muscle in the tussle for global dominance",
      "url": "https://www.theguardian.com/world/2025/sep/04/thursday-briefing-china-flexes-its-muscle-in-the-tussle-for-global-dominance",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:37:32.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: In hosting anti-western leaders at its largest ever military parade, Beijing sent a defiant message that will be heard loud and clear across the world\n\nGood morning. All eyes have been on China this week as the second biggest global economy flexed its muscles.\nDozens of world leaders, including from the global south, authoritarian pariah states and the EU, attended China’s largest ever military parade on Wednesday to mark the 80th anniversary of the end of the second world war, which China calls the war of resistance against Japanese aggression.\nUK news | Deputy PM Angela Rayner has admitted she underpaid stamp duty on her £800,000 seaside flat, after coming under intense pressure to be more transparent about her property arrangements.\nRussia | Vladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nPolice | The Metropolitan police have declined to drop their investigation into the comedy writer Graham Linehan for tweets about trans issues, and said that the law used by officers to detain him needs reviewing.\nIsrael | Israeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nPortugal | A day of national mourning has been declared in Portugal after at least 15 people were killed when Lisbon’s well-known Gloria funicular railway car derailed and crashed on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a16b9ecdb6dfe4150ff4f596d460eb1045f05782",
      "title": "The tech staff going back to school to teach the next generation",
      "url": "https://www.bbc.com/news/articles/c5y3y5pzxxeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:18:46.000Z",
      "summary_90w": "",
      "raw": "A new project hopes to boost the dwindling number of computing science teachers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4265f842da06287b6f942cb75dc14ce7b6562730",
      "title": "Murder charge 20 years after man vanished in Crete",
      "url": "https://www.bbc.com/news/articles/ckgqw31eyl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:06:03.000Z",
      "summary_90w": "",
      "raw": "Steven Cook vanished in Crete in 2005 before his remains were eventually found at the bottom of a well.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb4dcd3f9af31aad61ae4ed3bcfbbad04aa355b9",
      "title": "Counting rings reveals Sycamore Gap tree age range",
      "url": "https://www.bbc.com/news/articles/ckgygex6k87o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:04:46.000Z",
      "summary_90w": "",
      "raw": "There has been a lack of clarity over the age of the Hadrian's Wall tree which was illegally felled.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T04:59:05.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "959222f718a6eea7540ddf4e098ec2b798de4e32",
      "title": "Trump asks Supreme Court to reverse tariffs ruling finding them illegal",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5528573/trump-supreme-court-tariffs-ruling",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T04:32:49.000Z",
      "summary_90w": "",
      "raw": "The government called on the court to reverse an appeals court ruling that found most of President Donald Trump's tariffs are an illegal use of an emergency powers law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f804c14fc24feb1b8ba11269a64e53b49a1d108c",
      "title": "Rayner 'clings on' as she 'fights for political survival'",
      "url": "https://www.bbc.com/news/articles/cn0x25kwqrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T04:24:12.000Z",
      "summary_90w": "",
      "raw": "Angela Rayner's admission that she underpaid stamp duty on her flat in Hove dominates Thursday's papers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d55798207b8e128a1cebc2b9d9d4c61928310f5d",
      "title": "Record payout for victims of 'illegal and immoral' Australian welfare scheme",
      "url": "https://www.bbc.com/news/articles/clyx3jvk4zeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T04:16:14.000Z",
      "summary_90w": "",
      "raw": "Hundreds of thousands of Australians were forced to repay debts, many of which did not even exist.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23332494d39d5e8082ee4de982292694f4850b3d",
      "title": "Spain and Portugal wildfire weather made 40 times more likely by climate crisis, study finds",
      "url": "https://www.theguardian.com/environment/2025/sep/04/spain-portugal-wildfire-weather-climate-crisis-study",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T04:00:43.000Z",
      "summary_90w": "",
      "raw": "Wildfires were 30% more intense than would have been expected without global heating, scientists say\nThe extreme weather that fuelled “astonishing” blazes across Spain and Portugal last month was made 40 times more likely by climate breakdown, early analysis suggests.\nThe deadly wildfires, which torched 500,000 hectares (1.2m acres) of the Iberian peninsula in a matter of weeks, were also 30% more intense than scientists would have expected in a world without climate change, according to researchers from the World Weather Attribution network.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T03:43:30.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb25f13a2d2684e7e10ed48fbc222bc31eecabd3",
      "title": "China spectacle shows dangers of Trump's high-risk trade policy",
      "url": "https://www.bbc.com/news/articles/c98d5gplj52o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T03:31:55.000Z",
      "summary_90w": "",
      "raw": "Beijing's military parade shows how Trump has created new international bedfellows in just months, writes Anthony Zurcher.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d0cc80fb967f85718dbc34c33ba731b730bdabd5",
      "title": "Judge overturns Trump administration funding cuts to Harvard",
      "url": "https://www.bbc.com/news/articles/c4g2x7x03gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T03:30:16.000Z",
      "summary_90w": "",
      "raw": "A court rules the Ivy League college's free speech rights were violated, but the White House vows to appeal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a2be6595855038550ad1d17b438f8026feeea70",
      "title": "Guyana’s president claims victory in election held amid newfound oil riches",
      "url": "https://www.theguardian.com/world/2025/sep/04/guyana-election-president-claims-victory-amid-newfound-oil-riches",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T02:46:08.000Z",
      "summary_90w": "",
      "raw": "Irfaan Ali will be tasked with turning the profits of Guyana’s 2019 oil boom into prosperity for its citizens\nGuyana’s president, Irfaan Ali, has proclaimed victory in this week’s general and regional elections after his party won more than 240,000 votes and seven of the country’s ten electoral districts.\n“The results are all out there, as published by the Guyana elections commission. The numbers are clear. The people have spoken in an overwhelming way. We have won these elections with a remarkable margin,” he told the Guardian on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ac6cbb192b3f120995526f31174f98d5eeb174c",
      "title": "Epstein accusers say they are compiling list of his associates",
      "url": "https://www.bbc.com/news/articles/c5yvpgyjed8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T02:11:32.000Z",
      "summary_90w": "",
      "raw": "Victims of the disgraced financier give emotional accounts of abuse in a news conference on the steps of the US Capitol.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59bc4ea3464d1b0a8ae8def2aef19d4d865ae76c",
      "title": "Portugal declares day of mourning for 15 people killed in Lisbon funicular railway crash",
      "url": "https://www.theguardian.com/world/2025/sep/03/at-least-three-people-killed-many-injured-in-lisbon-funicular-crash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T01:41:24.000Z",
      "summary_90w": "",
      "raw": "Another 18 people injured when Gloria funicular railway car derails and apparently crashed into a building\n\nExplainer: what is Lisbon’s funicular railway Elevador da Glória and how does it work?\n\nA day of national mourning has been declared in Portugal after at least 15 people were killed when Lisbon’s well-known Gloria funicular railway car derailed and crashed on Wednesday.\nAn emergency services spokesperson said some foreign nationals were among the dead but would not identify the victims or disclose their nationalities. At least 18 people, including a child, were injured, five of them seriously.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e44d89db7b4bc12a4b3aea5c13c574d3b7fa957e",
      "title": "American Eagle shares soar as Sydney Sweeney ads seen driving sales",
      "url": "https://www.bbc.com/news/articles/cddm7z3p2vlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T01:20:00.000Z",
      "summary_90w": "",
      "raw": "The US actress was part of the company's controversial \"Great Jeans\" campaign which drew a backlash.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6aecbeed8c9d9042f3814c92141fa6e2ef0e864c",
      "title": "Old master painting looted by Nazis recovered a week after being spotted in Argentinian property listing",
      "url": "https://www.theguardian.com/world/2025/sep/04/nazi-looted-old-master-painting-giuseppe-ghislandi-recovered-argentina-property-listing-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T00:33:55.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady by the Italian master Giuseppe Ghislandi handed over by daughter of the late Nazi financier Friedrich Kadgien\nAuthorities in Argentina have recovered an 18th-century painting stolen more than 80 years ago by the Nazis from a Jewish art dealer in Amsterdam, a week after it was spotted by chance in a real estate listing.\nThe painting, the long-lost Portrait of a Lady (Contessa Colleoni) by the Italian master Giuseppe Ghislandi, was looted in the second world war. It was handed over on Wednesday to the Argentinian judiciary by the daughter of the late Nazi financier Friedrich Kadgien, Patricia Kadgien, who has been under house arrest with her husband since Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ae0ba8a27b441ad4403fa758878981e01935636",
      "title": "Trump administration illegally froze billions in Harvard funds, judge rules",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527314/trump-harvard-court-ruling-funding-boston",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T23:52:10.000Z",
      "summary_90w": "",
      "raw": "The ruling is a legal victory for Harvard but the White House says it will appeal the decision.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99ad25b592514af7b418d3648164e467d6da66c9",
      "title": "TUC urges chancellor to consider wealth taxes in November Budget",
      "url": "https://www.bbc.com/news/articles/cx27nxex9dlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:48:04.000Z",
      "summary_90w": "",
      "raw": "TUC boss Paul Nowak says the chancellor should not take \"anything off the table\" ahead of November Budget.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4647493f99a07420a1ef4cfae23d16464abeb4",
      "title": "Painting looted by Nazis recovered in Argentina",
      "url": "https://www.bbc.com/news/articles/cdx26z142vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:42:37.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady had been missing for 80 years before it was spotted on an estate agent's website.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e0188df51044e2a6afe43803b87b36f9321b3c7",
      "title": "UAE warns Israel that annexing West Bank would cross 'red line'",
      "url": "https://www.bbc.com/news/articles/cx2rgjk87y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:37:50.000Z",
      "summary_90w": "",
      "raw": "The warning came after a far-right Israeli minister unveiled a proposal for the annexation of four-fifths of the occupied territory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1245c62348617cc726c1a1d4a245f8c55f34a7a8",
      "title": "Big Ben tower, home extension and science lab up for prestigious architecture award",
      "url": "https://www.bbc.com/news/articles/cx27nmj77xzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:32:19.000Z",
      "summary_90w": "",
      "raw": "The restoration of London's famous Elizabeth Tower is nominated for the prestigious Stirling Prize.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d21dcfce966a4585da6687b24e696aad8505ecad",
      "title": "Don't say sorry - the six things you should do if you're in a car accident",
      "url": "https://www.bbc.com/news/articles/c5ypypy2jk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:27:50.000Z",
      "summary_90w": "",
      "raw": "I've attended many car accidents for work, but being directly involved in one gave me a different perspective.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a577c40318caccf450a6d84e21b750da2e09a3fa",
      "title": "How this Afghan family ended up held by ICE in bureaucratic limbo",
      "url": "https://www.bbc.com/news/articles/c206vj3826lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:19:53.000Z",
      "summary_90w": "",
      "raw": "Three migrants - a man who worked for the US in Afghanistan and his son and daughter - hope to be reunited with family in Canada.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98b7072e63f65cb8f8e5db7a287fbfb6be2cb18f",
      "title": "It's 4,000 miles from Ukraine - but even this Asian city is part of Russia's war",
      "url": "https://www.bbc.com/news/articles/cvg0e54z7x8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:18:55.000Z",
      "summary_90w": "",
      "raw": "In Vladivostok, a city on China's and North Korea's border, Russia's war on Ukraine looms large.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cfc09d6ab9a52c9395b11757d33eee114660204",
      "title": "My toddler's constipation wasn't taken seriously until he reached crisis point",
      "url": "https://www.bbc.com/news/articles/cgr9zg17n5yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:11:04.000Z",
      "summary_90w": "",
      "raw": "The number of children being admitted to hospital with constipation is at a 10-year high.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7066acc7c5ce39f5f1ce120c5e9791411fce232",
      "title": "30,000 homes fitted with botched insulation under government schemes, ministers admit",
      "url": "https://www.bbc.com/news/articles/c8606gp4711o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:00:20.000Z",
      "summary_90w": "",
      "raw": "The government has documented the number of homes blighted by sub-standard work for the first time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e30ac63c5ded5f6739856896686adebb199c1db4",
      "title": "Can India retaliate against Trump's 50% tariffs?",
      "url": "https://www.bbc.com/news/articles/cn76llny57zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T22:31:49.000Z",
      "summary_90w": "",
      "raw": "Prolonged 50% tariffs could shave off as much as 0.8% of India's GDP - so what are Delhi's options?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b53717c5c6cdde27c9160090f2d00c6d1e7cc50",
      "title": "Mistral, the French AI giant, is reportedly on the cusp of securing a $14B valuation",
      "url": "https://techcrunch.com/2025/09/03/mistral-the-french-ai-giant-is-reportedly-on-the-cusp-of-securing-a-14-billion-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T22:13:51.000Z",
      "summary_90w": "",
      "raw": "The two-year-old OpenAI rival, founded by former DeepMind and Meta researchers, develops open source language models and Le Chat, its AI chatbot built for European audiences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b72ad38efe78e755fca9889d2957a89466b9c50c",
      "title": "Israel intensifies Gaza City attacks as UN warns of 'horrific' consequences for displaced families",
      "url": "https://www.bbc.com/news/articles/c740lm33wyeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T22:03:18.000Z",
      "summary_90w": "",
      "raw": "Strikes reportedly kill 31 people in the city, home to a million people and where a famine was declared last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "How did Lisbon's iconic funicular derail? What we know so far",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:33:06.000Z",
      "summary_90w": "",
      "raw": "At least 16 people died after a car on Lisbon's famous Glória funicular railway derailed and crashed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "What we know about deadly Lisbon funicular crash",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T21:33:06.000Z",
      "summary_90w": "",
      "raw": "At least 16 people died after a car on Lisbon's famous Glória funicular railway derailed and crashed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c699e70ea35239222c9c4bfa861a7fb5a238bbd9",
      "title": "Scale AI is suing a former employee and rival Mercor, alleging they tried to steal its biggest customers  ",
      "url": "https://techcrunch.com/2025/09/03/scale-ai-is-suing-a-former-employee-and-rival-mercor-alleging-they-tried-to-steal-its-biggest-customers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T21:21:30.000Z",
      "summary_90w": "",
      "raw": "Scale is clearly concerned enough about the threat of Mercor, and the poaching of one of its employees, to pursue legal action.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98b5084e74c414dfa3446f027f4d8bb72c4b3660",
      "title": "Migrant crisis: How Europe went from Merkel's 'We can do it' to pulling up the drawbridge",
      "url": "https://www.bbc.com/news/articles/cn5e5q7w41eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:00:06.000Z",
      "summary_90w": "",
      "raw": "A number of European governments are proposing restrictive measures on migrants in response to public concern",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89f59d31c354d6e17539bc89780fa6ae073b4b09",
      "title": "Apple’s Siri upgrade could reportedly be powered by Google Gemini",
      "url": "https://techcrunch.com/2025/09/03/apples-siri-upgrade-could-reportedly-be-powered-by-google-gemini/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:50:38.000Z",
      "summary_90w": "",
      "raw": "An AI Siri is in the works and it could be running Gemini under the hood.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "608102d1cdc7f5e8b6c4110e029582303678f921",
      "title": "xAI’s CFO is the latest executive to leave Elon Musk’s AI firm",
      "url": "https://techcrunch.com/2025/09/03/xais-cfo-is-the-latest-executive-to-leave-elon-musks-ai-firm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:27:06.000Z",
      "summary_90w": "",
      "raw": "While at xAI, Mike Liberatore helped orchestrate the company's $5 billion debt raise, alongside another $5 billion in equity — almost half of which came from SpaceX.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf98919d51795ddc07cb82891d7d5cfa15d71007",
      "title": "FirstClub bucks India’s speed obsession, quickly triples valuation to $120M with premium approach",
      "url": "https://techcrunch.com/2025/09/03/firstclub-bucks-indias-speed-obsession-quickly-triples-valuation-to-120m-with-premium-approach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:21:08.000Z",
      "summary_90w": "",
      "raw": "FirstClub has raised $23 million in a Series A round co-led by Accel and RTP Global to expand its premium quick commerce platform.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "daef7037a86ef02959286be9afc053f4a09ae261",
      "title": "Is £3bn Premier League spending cause for concern?",
      "url": "https://www.bbc.com/sport/football/articles/cvgr35xgvjdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T20:20:58.000Z",
      "summary_90w": "",
      "raw": "Sports editor Dan Roan assesses a summer during which Premier League clubs spent more than ever.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8b771c6ebed60f2170cedca352d4f0352bcf630",
      "title": "A spine-tingling discovery: This dinosaur had spiked body armor",
      "url": "https://www.npr.org/2025/09/03/g-s1-86846/spiked-dinosaur-discovered-spicomellus",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T20:05:07.000Z",
      "summary_90w": "",
      "raw": "In a new paper, researchers describe a bizarre dinosaur with thorny spines along its neck and back that made its home in Africa more than 165 million years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "60f63920bc1218b34be171af49182de80b50c614",
      "title": "Angela Rayner Admits Underpaying Tax",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0p6d8?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T19:46:00.000Z",
      "summary_90w": "",
      "raw": "How did the housing secretary pay the wrong amount of stamp duty?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c70923c675b74837f6096d78a5bef59430d9d8de",
      "title": "CoreWeave acquires agent-training startup OpenPipe",
      "url": "https://techcrunch.com/2025/09/03/coreweave-acquires-agent-training-startup-openpipe/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T19:38:36.000Z",
      "summary_90w": "",
      "raw": "CoreWeave hopes the YC-backed startup will help it expand up the stack and cash in on enterprises developing AI agents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "295d2c34a4380cee11e95a8ab2f5dbc49137757e",
      "title": "How Trump's latest crypto launch enriches his family",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527047/trump-crypto-family-world-liberty-financial",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-03T19:36:02.000Z",
      "summary_90w": "",
      "raw": "The president and his sons made $5 billion on paper as their cryptocurrency started trading — highlighting the extraordinary degree to which they are personally profiting from Trump's return to the Oval Office.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a34fb40907479b89130d9441396279060faf843",
      "title": "SpaceX gets a green light to more than double its Florida launches",
      "url": "https://techcrunch.com/2025/09/03/spacex-gets-the-green-light-to-more-than-double-its-florida-launches/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:36:59.000Z",
      "summary_90w": "",
      "raw": "SpaceX is one step closer to nearly tripling the number of Falcon 9 launches from Florida.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a67922731a4d2f341e0bc3fa19ee0e08803c518",
      "title": "Scotland bans arms companies that supply IDF from receiving financial aid",
      "url": "https://www.theguardian.com/uk-news/2025/sep/03/scotland-government-defence-israel-military-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:35:28.000Z",
      "summary_90w": "",
      "raw": "Devolved government says contractors seeking support must prove products will not be used by Israeli military \nThe Scottish government has banned arms companies which supply the IDF from getting grants and investment support, and will freeze support for trade with Israel.\nJohn Swinney, the first minister, said on Wednesday any defence contractors who wanted financial help in Scotland would have to prove their products would not be used by the Israel Defense Forces.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9855fd9603f3aa45f4f5efd5a662d51d0d9a0692",
      "title": "Trump says ‘you’ll see things happen’ if US is unhappy with Putin’s decisions – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:28:03.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. For the latest on the Trump-Nawrocki meeting, you can read our full report here:\n\nTrump pledges to ‘stand with Warsaw’ in meeting with Polish president\n\nPutin was also asked about the prospect of more EU sanctions against Russia or its allies, including China and India.\nHe said the leaders did not discuss this during their recent conversations.\n“I think there’s a light at the end of the tunnel. We will see.\nOtherwise, we will be forced to resolve all our objective objectives through military means.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3802f6fd2bee9d8ee61c711ac7fde5acd34e24f6",
      "title": "Kim Jong-un promises to do ‘everything to assist’ Moscow after Putin meeting",
      "url": "https://www.theguardian.com/world/2025/sep/03/kim-jong-un-promises-to-do-everything-to-assist-moscow-vladimir-putin-russia-north-korea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:19:19.000Z",
      "summary_90w": "",
      "raw": "North Korean leader invited to visit Russia as Zelenskyy says Putin is displaying ‘impunity’ with new Ukraine strikes \n\nEurope live – latest updates\n\nVladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nNorth Korea has supported Russia in its war against Ukraine with weapons and troops, and the Russian president praised North Korean fighters for acting “courageously and heroically”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af68edbf9f6bb8ab4fa969df7a091068a361887a",
      "title": "In a brawl over right-wing TV, Newsmax sues Fox News",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527077/newsmax-sues-fox-news",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T18:14:43.000Z",
      "summary_90w": "",
      "raw": "Right-wing TV news outlet Newsmax sued Fox News on antitrust grounds, alleging the conservative media powerhouse had illegally sought to suppress its smaller rival's growth in cable news.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6023382567017df0bca69e13add09e70cf8b7a0b",
      "title": "Pornhub owner pays $5M settlement to FTC over historic failure to block abusive content",
      "url": "https://techcrunch.com/2025/09/03/pornhub-owner-pays-5m-settlement-to-ftc-over-historic-failure-to-block-abusive-content/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:12:21.000Z",
      "summary_90w": "",
      "raw": "Pornhub owner Aylo will pay a $5 million settlement to the FTC and Utah over allegations that the company knowingly profited off of illegal materials.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e6cbb96dc149ad762d5baa2b8b164817e5025ac",
      "title": "Google brings Material 3 Expressive to Pixel 6 and newer devices, along with other features",
      "url": "https://techcrunch.com/2025/09/03/google-brings-material-3-expressive-to-pixel-6-and-newer-devices-along-with-other-features/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Google announced on Wednesday that it's bringing a slew of new features to the Android ecosystem and Pixel devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe4623dd6dfdd273b3a458c2fd443e30d7d549fd",
      "title": "Nuclear triad and ‘robot wolves’: parade shows off array of Chinese weapons",
      "url": "https://www.theguardian.com/world/2025/sep/03/nuclear-triad-robot-wolves-china-weapons-parade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T17:38:40.000Z",
      "summary_90w": "",
      "raw": "On display in Beijing were nuclear weapons launched by air, sea and land, laser weapons and four-legged drones\nIt was hardly a subtle attempt to project power. China showed off air-, sea- and land-launched nuclear weapons in its parade on Wednesday, a triad intended to demonstrate that Beijing’s long-term aspiration is to match US military might.\nAlso on display were large underwater torpedo-like drones, intended to threaten western warships, as well as anti-drone lasers and four-legged “robot wolves”, all designed to be noticed, regardless of their actual military effectiveness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f83daf3a017ddf3a870df3eeb4aa2aeb745d116c",
      "title": "Orchard Robotics, founded by a Thiel fellow Cornell dropout, raises $22M for farm vision AI ",
      "url": "https://techcrunch.com/2025/09/03/orchard-robotics-founded-by-a-thiel-fellow-cornell-dropout-raises-22m-for-farm-vision-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:30:00.000Z",
      "summary_90w": "",
      "raw": "The startup uses truck-mounted cameras to collect and analyze data about crop health.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "920eef3436c861dd0f375411b60299a89e501522",
      "title": "Google’s NotebookLM now lets you customize the tone of its AI podcasts",
      "url": "https://techcrunch.com/2025/09/03/googles-notebooklm-now-lets-you-customize-the-tone-of-its-ai-podcasts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:29:03.000Z",
      "summary_90w": "",
      "raw": "When generating an Audio Overview, users can now choose whether they want their AI podcasts to be formatted like a \"Deep Dive,\" \"Brief,\" \"Critique,\" or \"Debate.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "319a7a22278147fae972cf96226ea85b3d806c65",
      "title": "'Ketamine Queen' pleads guilty in Matthew Perry overdose case",
      "url": "https://www.bbc.com/news/articles/c2dng3rrzjdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T17:25:21.000Z",
      "summary_90w": "",
      "raw": "Jasveen Sangha, 42, pleads guilty to five charges relating to the actor's death in Los Angeles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13c94be78189f3935cdbfbe670647f55244e2071",
      "title": "Why the US government is taking a stake in Intel",
      "url": "https://techcrunch.com/2025/09/03/why-the-us-government-is-taking-a-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:22:36.000Z",
      "summary_90w": "",
      "raw": "The U.S. government's recent stake in Intel comes after a long period of floundering at the company's foundry business.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "847cdf520201641f774d1f1a7dc23443011f151a",
      "title": "Democrats blast state department for lack of ‘basic oversight’ of controversial Gaza food organization",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-democrats-gaza-humanitarian-foundation-letter",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:55:29.000Z",
      "summary_90w": "",
      "raw": "Letter by senior Democrats asks state department to reveal details behind financing of Gaza Humanitarian Foundation\nSenior Democratic senators have called on the US secretary of state, Marco Rubio, and the US ambassador to Israel, Mike Huckabee, to reveal details behind the financing and oversight of the Gaza Humanitarian Foundation (GHF) amid concerns over rising death tolls near aid sites, the group’s apparent coordination with the Israeli army and its reported use of private military contractors linked to intelligence operations.\nThe letter, co-signed by senators Elizabeth Warren, Chris Van Hollen and Peter Welch, accuses the state department of an “inability to answer basic questions about GHF in a timely manner” and said that the department’s “overriding of internal protocol and staff warnings is particularly concerning given it is unlikely to be able to conduct basic oversight of the funds it provided to GHF”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "120d64af2dfb7dfb6fb4a3fc8eb9b9309b435b54",
      "title": "Hot mic catches Xi and Putin discussing organ transplants and immortality",
      "url": "https://www.bbc.com/news/articles/cr70rvrd41ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T16:51:50.000Z",
      "summary_90w": "",
      "raw": "The Chinese and Russian leaders have been in power for 13 and 25 years respectively, with neither expressing any intention of stepping down.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98d024e06fb98ebf0f6fe23522c10d3e006427ef",
      "title": "Charges against Brazil's Bolsonaro are political, says lawyer",
      "url": "https://www.bbc.com/news/articles/ce83881001eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T16:44:00.000Z",
      "summary_90w": "",
      "raw": "The former Brazilian president denies conspiring to overturn his 2022 election loss to his left-wing rival, Luiz Inácio Lula da Silva.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5ec774211d5e8c3171f2dda0016d398b822f70c",
      "title": "Top Obama-era Latin American expert warns of ‘disastrous’ US intervention in Venezuela",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-military-venezuela-strike-guerrilla-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:39:43.000Z",
      "summary_90w": "",
      "raw": "US military buildup and attack on alleged narco boat spark fears of protracted guerrilla war in South America\n\nTrump’s Venezuela gunboat diplomacy: sabre-rattling or prelude to invasion?\n\nThe White House’s former top Latin America official has said he fears the US could stumble into a protracted guerrilla war in Venezuela after Donald Trump ordered a military strike on a boat in the Caribbean Sea, killing 11 alleged drug traffickers.\nTuesday’s controversial strike off the Venezuelan coast – which was reportedly carried out by an attack helicopter or Reaper drone – came after the US president ordered a major naval deployment to the region, ostensibly to combat South American drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb3eb7b94623fc51ae1c08c10752296a5d7e4fc",
      "title": "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade",
      "url": "https://www.theguardian.com/world/2025/sep/03/china-military-parade-xi-jinping-appears-with-vladimir-putin-kim-jong-un",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:30:18.000Z",
      "summary_90w": "",
      "raw": "Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to the west\nXi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance to the west.\nPutin and Kim, the authoritarian leaders of Russia and North Korea, were among dozens of world leaders who attended the parade, a massive display of military hardware and personnel, orchestrated to mark the 80th anniversary of the end of the second world war, which China calls the War of Resistance against Japanese Aggression.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4faf372ef14ce0458581ba779fffd0f15ef82fa1",
      "title": "Roblox expands use of age-estimation tech and introduces standardized ratings",
      "url": "https://techcrunch.com/2025/09/03/roblox-expands-use-of-age-estimation-tech-and-introduces-standardized-ratings/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:27:08.000Z",
      "summary_90w": "",
      "raw": "Roblox says it's expanding its use of age-estimation technology and entering a partnership with the IARC to standardize its game ratings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "44e20053e8af3095361e86cdceca817ee1005727",
      "title": "Hot mic catches Putin and Xi discussing organ transplants and immortality",
      "url": "https://www.theguardian.com/world/2025/sep/03/hot-mic-catches-vladimir-putin-xi-jinping-discussing-organ-transplants-immortality",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:21:25.000Z",
      "summary_90w": "",
      "raw": "Live footage of private conversation between Russian president and Chinese leader aired at Beijing military parade\nThe authoritarian strongmen Vladimir Putin and Xi Jinping have mused on how organ transplants might lead to immortality, during a brief exchange of small talk caught on a hot mic at a military parade.\nThe Russian president was in Beijing on Wednesday with the Chinese leader, who hosted allies for a ceremony to mark the 80th anniversary of the end of the second world war.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10587fbf7ffd4ee0dec75ed68a9b8396edcf704e",
      "title": "Netflix CPO Eunice Kim joins TechCrunch Disrupt 2025 to talk scaling product and reimagining entertainment",
      "url": "https://techcrunch.com/2025/09/03/netflix-cpo-eunice-kim-is-coming-to-techcrunch-disrupt-2025-to-talk-tech-tools-and-yes-its-password-sharing-strategy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:15:00.000Z",
      "summary_90w": "",
      "raw": "At TechCrunch Disrupt 2025, Netflix chief product officer Eunice Kim will be joining the Disrupt Stage to share Netflix's evolving story and what's to come.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76db61ca2aab9ea9206f6c937ff185ef2831d74e",
      "title": "Instagram is finally launching an iPad app",
      "url": "https://techcrunch.com/2025/09/03/instagram-is-finally-launching-an-ipad-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Until now, Instagram on iPad was just a blown-up iOS app, which wasn't pleasant to look at. The company said that it has now revamped the experience to suit the big screen.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7782a9740391ba664ec1d8c06d9568db34f0627a",
      "title": "Venezuela’s president thinks American spies can’t hack Huawei phones",
      "url": "https://techcrunch.com/2025/09/03/venezuelas-president-thinks-american-spies-cant-hack-huawei-phones/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:44:20.000Z",
      "summary_90w": "",
      "raw": "Huawei phones, given their custom hardware and operating system, may actually be easier to hack than other brands.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1416ef0c89ba604e38a7502a56771d6f0c565655",
      "title": "How to watch Apple announce the iPhone 17",
      "url": "https://techcrunch.com/2025/09/03/how-to-watch-apple-announce-the-iphone-17/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:27:01.000Z",
      "summary_90w": "",
      "raw": "Apple is debuting the iPhone 17 at its annual hardware event on September 9.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "78845bb166ba25e7cd36ac79eea70ab4480b058a",
      "title": "These 20- and 22-year-olds raised $5M from YC, General Catalyst to study online behavior using vision AI",
      "url": "https://techcrunch.com/2025/09/03/these-20-and-22-year-olds-raised-5m-from-yc-general-catalyst-to-study-online-behavior-using-vision-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:03:32.000Z",
      "summary_90w": "",
      "raw": "Founded by a 20-year-old and two 22-year-olds, Human Behavior uses vision AI to give companies a real understanding of how people use their products.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e70cfe0aefb978ed2fa6bb3574bd9a40d9edfadd",
      "title": "Warp brings new diff-tracking tools to the AI coding arms race",
      "url": "https://techcrunch.com/2025/09/03/warp-brings-new-diff-tracking-tools-to-the-ai-coding-arms-race/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The AI coding tool Warp is releasing a new set of features designed to give users more oversight over command-line coding agents, with more extensive difference tracking and a clearer view of what the coding agent is doing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4143ea5ced0cb43e6c2f5996452803c6cef67896",
      "title": "3 days left to lock in your exhibit table at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/03/3-days-left-to-lock-in-your-table-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Time is running out to showcase your startup in front of the most influential eyes in tech. In just 3 days, the exhibitor table deadline closes for TechCrunch Disrupt 2025 in San Francisco. And with only 10 tables still available (or fewer by the time you read this), every minute matters. If you’ve been on […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20734de9be72d9662dfcda04a60d7fdca24067c1",
      "title": "Middle East crisis: at least 21,000 children disabled in Gaza during war, says UN committee – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:55:30.000Z",
      "summary_90w": "",
      "raw": "More than 40,000 have suffered ‘new war-related injuries’ with more than half left disabled, says UN Committee on the Rights of Persons with Disabilities\nYemen’s Houthis have claimed responsibility for a missile launched at Israel (see 8.17am BST), saying they fired two ballistic missiles at Tel Aviv in what they said was an initial response to Israeli attacks on Yemen.\nThe Israeli military moved deeper into Gaza City on Wednesday, with soldiers and tanks pushing into Sheikh Radwan, one of the urban centre’s largest and most crowded neighbourhoods, reports Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d644e189ccfca378169b39abe9c5397dc4cdc763",
      "title": "China's Xi steals the limelight in a defiant push against US-led world order",
      "url": "https://www.bbc.com/news/articles/cn0rllxld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:20:11.000Z",
      "summary_90w": "",
      "raw": "President Xi shows off his power and influence in an open challenge to US supremacy and the world order.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4b320d7c559404ee6a9e86f76846ac5cc80f3b5",
      "title": "Xi, Putin and Kim show united front at huge Chinese military parade",
      "url": "https://www.bbc.com/news/articles/cp8z83np4xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:00:42.000Z",
      "summary_90w": "",
      "raw": "Speaking during the spectacle in Beijing, China's President Xi Jinping said the world faced a choice between peace and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06aa1975d4538ca33b10208bfacf5a7f5dcd9730",
      "title": "Race to find survivors after Sudan landslide kills hundreds",
      "url": "https://www.bbc.com/news/articles/cdj2jygzzk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T12:24:51.000Z",
      "summary_90w": "",
      "raw": "Sunday's landslide followed heavy rain and \"levelled\" a remote village, a local armed group says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba0eaca95165227d0d96eda644426c5cdcaeca1",
      "title": "Israeli drones dropped grenades near peacekeepers in south Lebanon, UN says",
      "url": "https://www.theguardian.com/world/2025/sep/03/israeli-drones-drop-grenades-near-peacekeepers-in-south-lebanon-un-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T12:17:48.000Z",
      "summary_90w": "",
      "raw": "Unifil condemns ‘serious attack’ on Tuesday morning as it was clearing a road and adds that no one was hurt \nIsraeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nThe UN peacekeeping force in Lebanon, Unifil, said the Tuesday morning attack came as it was clearing a road to a UN position close to the Israeli border, adding that no one was hurt.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9122eaec0d3c3caa2eb5e06cd8a21774dc756b3",
      "title": "Hitler's bunker is now just a parking lot. But it's a 'dark tourism' attraction anyway",
      "url": "https://www.npr.org/sections/planet-money/2025/09/03/g-s1-86572/hitlers-bunker-is-now-just-a-parking-lot-but-its-a-dark-tourism-attraction-anyway",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Why evil histories sell. A visit to Hitler's bunker, and a deep dive into the economics and ethical quandaries of \"dark tourism.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "681204107cb37a5031873434f19107c94ec4bd3e",
      "title": "Jamaicans head to polls for election as ruling party faces corruption concerns",
      "url": "https://www.theguardian.com/world/2025/sep/03/jamaican-general-election",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T09:45:19.000Z",
      "summary_90w": "",
      "raw": "Polls point to ‘very close election’ between the Jamaica Labour party and the opposition People’s National party\nJamaicans head to the polls on Wednesday for a closely fought general election which has been overshadowed by an investigation into potential corruption in the ruling Jamaica Labour party (JLP) which is seeking a third term in office.\nThe latest local poll put the opposition People’s National party (PNP) 3.1% lead over the JLP, but political analyst Damion Gordon cautioned that the lead was barely larger than the margin of error.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on 'drug-carrying vessel from Venezuela'",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:10:59.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded1eba6568cb83acb1b0db7a34aa4a6154c7d25",
      "title": "Food giant Kraft Heinz to split into two companies",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525657/food-giant-kraft-heinz-to-split-into-two-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T09:02:02.000Z",
      "summary_90w": "",
      "raw": "Food giant Kraft Heinz is splitting up into two companies a decade after the merger that was arranged by billionaire investor Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5debd60595c533c7f34df6227b2e6380f4d5af44",
      "title": "Hundreds of women with brooms join protests as Indonesia leader flies to China",
      "url": "https://www.bbc.com/news/articles/c7vlv2gpvvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:48.000Z",
      "summary_90w": "",
      "raw": "Hundreds of women brandishing broomsticks marched to parliament during fierce nationwide rallies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9dcf43076631b3c2c6573bfa4a1ac5edbdb782d9",
      "title": "Putin thanks Kim for North Koreans fighting in Ukraine",
      "url": "https://www.bbc.com/news/articles/cj9w9m1xz1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:14:39.000Z",
      "summary_90w": "",
      "raw": "Thousands of North Korean soldiers are thought to have died while fighting for Russia during its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de0e062ec6e6aede6d5bbe684aaeb1a28f8eaef8",
      "title": "Floods kill 30 and submerge 1,400 villages in Indian state",
      "url": "https://www.bbc.com/news/articles/cvg4g95y7pjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T06:23:23.000Z",
      "summary_90w": "",
      "raw": "More than 354,000 people have been affected by the worst floods since 1988, as rescue efforts continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ace766178d2ad238f44e43eb9ee36a2d98145e72",
      "title": "Trump accuses Xi of conspiring against US with Putin and Kim",
      "url": "https://www.bbc.com/news/articles/c1dxd9eyy71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T03:45:58.000Z",
      "summary_90w": "",
      "raw": "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19748ab56d2566a698991b9886df485db53e89a0",
      "title": "US House panel releases 33,000 pages of Epstein files",
      "url": "https://www.bbc.com/news/articles/cp949lrj373o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T01:12:07.000Z",
      "summary_90w": "",
      "raw": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd9711cb196a8a00d95830cc9302c67960583c10",
      "title": "Jury clears Cardi B of assault on security guard in Los Angeles",
      "url": "https://www.bbc.com/news/articles/cgjyj0dp3ego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T00:19:19.000Z",
      "summary_90w": "",
      "raw": "A number of viral moments thrust the civil case into the spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7a68a331a49b9b4892ef7c9ad493a7664760f13",
      "title": "Captain Scott’s famous polar shipwreck as never seen before",
      "url": "https://www.bbc.com/news/articles/cpwyvyqkx9yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:27.000Z",
      "summary_90w": "",
      "raw": "The Terra Nova carried Captain Scott and his men on their doomed expedition to the South Pole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "464e9fe0d3287700f5827f0ab6d4850271d64bf9",
      "title": "Why is Trump targeting America's most powerful bank?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0fw7d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:01:00.000Z",
      "summary_90w": "",
      "raw": "Can he take control of the Federal Reserve?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "17e7d39ae2faa39d2f10de1ed3722bba3e01e76d",
      "title": "Trump's tariffs are in limbo. So what now? How 3 businesses are adjusting — again",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525791/appeals-court-tariffs-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:08:39.000Z",
      "summary_90w": "",
      "raw": "A federal appeals court struck down most of President Trump's import taxes. But the tariffs are still being collected for now — leaving U.S. importers in a kind of tariff limbo.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "fe3ea0609a814b72cff681d5788c7defd3c9a0b2",
      "title": "Electric vehicle sales increase as federal tax credits for them come to an end",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650-e1/electric-vehicle-sales-increase-as-federal-tax-credits-for-them-come-to-an-end",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T20:52:12.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "673bb3efe1c54a50e50b0d3cac69138b47323da5",
      "title": "From building dream careers to losing everything",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002d2kp/footballs-financial-shame-the-story-of-the-v11?at_mid=OgibwZ9HpE&at_campaign=Footballs_Financial_Shame_The_Story_of_the_V11&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002d2kp&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Footballs_Financial_Shame_The_Story_of_the_V11&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Unveiling a hidden scandal affecting a group of former Premier League players.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "95a8c83c019e1d53f2cde83b3510e1c354708b55",
      "title": "A psychological thriller directed by Christopher Nolan",
      "url": "https://www.bbc.co.uk/iplayer/episode/b00z0f1d/the-prestige?at_mid=3GtaP6hiAK&at_campaign=The_Prestige&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=b00z0f1d&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Prestige&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-23T00:05:47.000Z",
      "summary_90w": "",
      "raw": "A magician tries to uncover the secret of how his rival performs the ultimate trick.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}