{
  "version": "1757511176452",
  "generatedAt": "2025-09-10T13:32:56.452Z",
  "items": [
    {
      "id": "b61c5f9e1827e1b90b6c610d8c76d2509e1223da",
      "title": "Jaguar Land Rover says data stolen in disruptive cyberattack",
      "url": "https://techcrunch.com/2025/09/10/jaguar-land-rover-says-data-stolen-in-disruptive-cyberattack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:19:29.000Z",
      "summary_90w": "",
      "raw": "The cyberattack at Jaguar Land Rover, which began on September 2, has ground vehicle assembly lines to a standstill.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f46fd62eb33bd94a37683832d0239447685b72b5",
      "title": "More embarrassing Epstein exchanges to come, says Mandelson as Tories press Starmer at PMQs",
      "url": "https://www.bbc.com/news/articles/c5yevwvvneyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T13:09:54.000Z",
      "summary_90w": "",
      "raw": "The UK's ambassador to the US likens his past association with the convicted paedophile to \"an albatross around my neck\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cd8690be21917a29a371e6101fece498d2d723f4",
      "title": "RSS co-creator launches new protocol for AI data licensing",
      "url": "https://techcrunch.com/2025/09/10/rss-co-creator-launches-new-protocol-for-ai-data-licensing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:07:26.000Z",
      "summary_90w": "",
      "raw": "A new system called Real Simple Licensing would allow AI companies to license training data at a massive scale — if they're willing to pay for it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86930cf8dcb8d0002a141956106ee004328f5e28",
      "title": "Poland closer to conflict than any time since second world war, PM says, as Russia claims drone incursion was unintentional – live",
      "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T13:05:48.000Z",
      "summary_90w": "",
      "raw": "Donald Tusk says there were 19 violations of Polish airspace overnight and most likely that four drones shot down\n\nFull report: Poland shoots down drones over its territory amid Russian attack on Ukraine, says military\n\nLubelskie region governor Krzysztof Komorski is leading an emergency meeting with the police this morning. \n\r\n In a post on X, he urged residents to follow the guidance from the relevant authorities.\nPrime minister Donald Tusk meanwhile said in his latest update that he is in “constant contact” with Nato secretary general Mark Rutte.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "637bf42c7bd8cea9b26baa21ca2e995383fa2f80",
      "title": "Children feared among three dead in Channel crossing attempt",
      "url": "https://www.bbc.com/news/articles/ckgy0n4d99jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T13:02:38.000Z",
      "summary_90w": "",
      "raw": "Calais authorities say the three who died were likely crushed to the bottom of the boat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "182605071b77d2a7879cb3410e4841e1613d96cd",
      "title": "New French PM takes office as ‘Block Everything’ protests rock country – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T13:02:31.000Z",
      "summary_90w": "",
      "raw": "Sébastien Lecornu appointment comes amid protests across France including 1,000 demonstrators trying to enter Gare du Nord station in Paris\nEmmanuel Macron appoints his third prime minister in a year\nA teacher taking part in the protests in Paris said he was against the ousted government’s planned budget cuts. “[François]Bayrou was ousted, [now] his policies must be eliminated,” Christophe Lalande told Reuters, calling for more funding for schools and hospitals.\nAt another protest in the city, unionist Amar Lagha told the news agency:\nThis day is a message to all the workers of this country: that there is no resignation, the fight continues, and a message to this government that we won’t back down, and if we have to die, we’ll die standing.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aa7e9305139bd6082166ca3e6b8d50571f651392",
      "title": "AI gaming startup Born raises $15M to build ‘social’ AI companions that combat loneliness",
      "url": "https://techcrunch.com/2025/09/10/born-maker-of-virtual-pet-pengu-raises-15m-to-launch-a-new-wave-of-social-ai-companions/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Born, maker of cute virtual pet Pengu, believes the current chatbot landscape isn't the final form factor for AI friends. The Berlin-based startup raised $15M on the idea that AI companions should have a social component.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "953d83e2803be1e929e5cb4490903ae14444a410",
      "title": "Grammarly can now fix your Spanish and French grammar",
      "url": "https://www.theverge.com/news/775144/grammarly-new-languages",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "For 16 years, a team of linguists carefully crafted and honed the grammar editing software Grammarly to match natural English language patterns. Now, the company is getting a big assist from AI to expand similar offerings to five more languages: Spanish, French, Portuguese, German, and Italian. This expansion caters to what has been the “number one feature request” since the company’s founding, according to Grammarly’s VP of enterprise product, Luke Behnke. \nIn addition to catching spelling mistakes, the app reworks sentences and paragraphs to match the tone of native speech and improve the overall clarity — now in six languages. Grammarly also translates the six core languages into 19 different languages “without having to leave the tool and go to another translation provider,” Behnke says. \nThe competition for AI-based software for languages other than English is heating up, with Google Search’s AI Mode just broadening the number of languages by five and Apple’s latest AirPods debuting a live language translation feature. \nGrammarly indicated a broader ambition to become an AI productivity app, starting with the acquisition of the buzzy email application Superhuman in July, followed by the launch of nine AI agents designed for students and educators.\nThe company says that its software has been built on machine learning from the get-go. “We call it an agent. … I know that’s maybe an overused AI word at this point, but it is kind of the first agent that people ever used,” Behnke says of Grammarly’s proofreading product. Large language models entered the picture in 2023. The software is built on open-source large language models that are fine-tuned by analytical linguists. \nThe number of new linguist teams did not “linearly scale” with the increased number of languages offered by Grammarly, Behnke said. The company used “a smaller group of people” in addition to internal feedback and evaluations of the new languages, Behnke says. Suggestions and paragraph rewrites emerge from these in-house models “hosted on our infrastructure with our own security controls and very tight training rules,” Behnke says.\nIn the beta rollout to “about a million” users, native speakers of the five new languages accepted Grammarly’s suggestions at rates similar to English speakers. The rollout took some users by surprise when the familiar red lines suddenly appeared under text written in their native language, Behnke says.\nGrammarly also uses third-party LLMs for advanced features. Users can choose to incorporate an external LLM from major companies such as OpenAI, Behnke says. While third-party LLMs cannot train on Grammarly user data, Grammarly does train its own models on user data. Enterprise and education customers automatically have training turned off, while other users have to opt out of training. \nWhile the company has not disclosed which languages are in the pipeline, Behnke says that Grammarly customers specializing in customer support services have requested more languages in the global areas where offshore call centers are located.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02286458d93ebba7a362c5fcc7de80357055d898",
      "title": "Grammarly now offers spelling and grammar check for five more languages",
      "url": "https://techcrunch.com/2025/09/10/grammarly-now-offers-spelling-and-grammar-check-for-five-more-languages/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Grammarly built its reputation on being a tool for checking spelling, grammar, and writing tips in English. The company is now expanding the scope of these features to support five new languages: Spanish, French, Portuguese, German and Italian.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2195f22fad5cda0e7589a485398bd395411b3101",
      "title": "Hands-on: Nvidia’s GeForce Now RTX 5080 is better and worse than I hoped",
      "url": "https://www.theverge.com/hands-on/775222/nvidia-geforce-now-rtx-5080-hands-on",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Today, Nvidia is soft-launching its latest gaming GPUs in the cloud - upgrading its $20-a-month GeForce Now Ultimate cloud gaming service with RTX 5080 graphics for select games, with more to come down the road. At the same time, it's also adding thousands more titles to the bring-your-own-games service by letting you install them yourself, while also unlocking a 360Hz mode for ultra-fast desktop monitors, launching a 90Hz version of its Steam Deck app, and more.\nDo all these changes make GeForce Now fundamentally better? Absolutely, and it was already pretty good! But while playing I couldn't escape the thought: it's a good thing Nvidia is …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d32193fcc4c99c45ad2c6792971ad069f2f9972",
      "title": "Lyft and May Mobility launch robotaxis in Atlanta",
      "url": "https://techcrunch.com/2025/09/10/lyfts-modest-robotaxi-launch-highlights-growing-gap-with-uber-and-waymo/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Lyft is trying to carve out a presence in the autonomous vehicle market. But the ride-hailing company still lags far behind Uber.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "97857e351a407ffc87bf29ba4a0974fdcd1cbfde",
      "title": "Rendezvous Robotics exits stealth with $3M to build reconfigurable space infrastructure",
      "url": "https://techcrunch.com/2025/09/10/rendezvous-robotics-exits-stealth-with-3m-to-build-reconfigurable-space-infrastructure/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Rendezvous Robotics wants to scale the space industry by changing the way structures are built on orbit.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "769ca66f50336ba383c77098ea30618439f32579",
      "title": "The web has a new system for making AI companies pay up",
      "url": "https://www.theverge.com/news/775072/rsl-standard-licensing-ai-publishing-reddit-yahoo-medium",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "A new licensing standard aims to let web publishers set the terms of how AI system developers use their work. On Wednesday, major brands like Reddit, Yahoo, Medium, Quora, and People Inc. announced support for Really Simple Licensing (RSL), an open content licensing standard that enables publishers to outline how bots should pay to scrape their sites for AI training data. They’re hoping the collective action gives them leverage to get AI companies on board.\nThe RSL Standard builds upon the robots.txt protocol, which has long allowed publishers to provide instructions to web crawlers about what parts of their site they can and can’t access. But instead of just saying yes or no to specific bots, websites can now add licensing and royalty terms to their robots.txt file. They can also embed the terms in online books, videos, and training datasets that they may want compensation for.\nBehind the RSL Standard is a newly formed rights organization called the RSL Collective, helmed by Eckart Walther, a co-creator of the Really Simple Syndication (RSS) standard and former CardSpring CEO, and Doug Leeds, the former CEO of IAC Publishing and Ask.com. “The goal is to create a new, scalable business model for the web,” Walther tells The Verge. “RSL takes some of those early RSS ideas and creates a new layer for the entire internet where licensing rights and compensation rights are defined.”\nThe RSL Standard supports a variety of licensing models, including free ones. Site owners can ask AI companies to pay a subscription or assign a pay-per-crawl fee through the RSL Standard, which companies must pay each time an AI bot crawls the website. They can also implement a pay-per-inference fee, allowing sites to receive compensation when an AI model references their work to generate a response. Bots that are crawling sites for other purposes, like archival or search engine inclusion, can proceed as usual.\n\n“What we’re doing is not reinventing wheels or inventing wheels.”\n\n\nSeveral media companies, including The Verge parent company Vox Media, The Wall Street Journal owner News Corp, and The New York Times, have struck licensing agreements with individual AI companies such as OpenAI and Amazon. But the RSL Collective aims to simplify this process by allowing any website owner or creator to get paid for their work rather than negotiating separate deals.\nLike a lot of standards, RSL’s success depends on major industry players — in this case, AI companies — buying into it. AI model builders have repeatedly been accused of ignoring sites’ robots.txt files, and there’s no simple way to tally something like the inference fee without their participation. The RSL Collective is betting that bringing together some of the biggest web publishers will make adopting the standard more appealing. “Our job is to go out and get a big group of people to say it’s in your interest, both efficiently, because you can negotiate with everybody at once, and legally, because if you don’t, you’re violating everybody at once,” Leeds says.\nThe RSL Standard by itself also can’t block bots from visiting a website, unlike the “pay per crawl” system already offered by Cloudflare. The RSL Collective is currently working with Fastly, a content delivery network, to admit AI bots to websites based on whether they’ve agreed to license content. Fastly is “the bouncer at the door to the club, and they won’t let people in unless they have the right ID,” Leeds says. “RSL is issuing the IDs. So we say, ‘Hey, you’ve agreed to license this content,’ and Fastly says, ‘Come on, in your ID checks out.’” Publishers who don’t use Fastly can still ask AI companies to license their content, but they’ll be unable to block AI crawlers until more providers build a solution.\nLeeds believes that the RSL Collective can legally enforce licenses as well, as he says “all participants in the collective rights organization participate in the enforcement of any infringement,” spreading the legal costs. He compares the system to existing digital rights organizations, like the music rights group ASCAP, which collects licensing fees and distributes them to members. While conventional music licensing benefits from a particularly strong and well-established legal precedent for copyright protection, however, unauthorized scraping and the use of media for training AI systems still land in a legal gray area, with major AI players currently fighting lawsuits from Reddit, Getty Images, and many online publishers.\n“There has always been a question of whether bots have agreed to terms that they don’t see,” Leeds and Walther added in an emailed statement. “RSL changes that fundamentally, putting crawlers on notice of what the terms are before they access a site.”\nEven so, Leeds hopes the system can create an intuitive way to navigate licensing works for AI training. “What we’re doing is not reinventing wheels or inventing wheels — we’re just bringing them to a place that they haven’t existed before,” Leeds says. “The reason they haven’t existed here before is because they haven’t had a standard that we could build on. So that’s why RSL Standard is so important: it gives the infrastructure to then create the things that have worked in every other media industry that hasn’t happened yet.”\nThe RSL Collective is free for publishers and creators to join, with other big brands like O’Reilly, wikiHow, and IGN owner Ziff Davis also on board.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2326ad0ca194fcf2ca4864c968fcbcec8ef65fd7",
      "title": "This app just raised $14M to take on the loneliness epidemic",
      "url": "https://techcrunch.com/2025/09/10/this-gen-z-founded-app-just-raised-14m-to-take-on-the-loneliness-episdemic/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Clyx is social platform that helps users find IRL community events to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3f9fb1a9ae6b2643d98bfd51e972e401dde7a3bf",
      "title": "Zoox opens its Las Vegas robotaxi service to the public",
      "url": "https://techcrunch.com/2025/09/10/zoox-opens-its-las-vegas-robotaxi-service-to-the-public/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "But it's not quite a commercial service just yet. These rides are free — for now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b13baba09a2166be6abeed7906607f3792833643",
      "title": "Zoox’s robotaxis are open for business in Las Vegas",
      "url": "https://www.theverge.com/news/774748/zoox-amazon-robotaxi-las-vegas-public",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Amazon’s Zoox announced today that it’s making its robotaxis available to all customers in Las Vegas. The company says it is the first to operate with a purpose-built autonomous vehicle in commercial service. And the news comes a few weeks after federal regulators gave the company the green light to expand the use of its robotaxis for demonstration purposes. \nZoox says that its toaster-shaped AVs will be available for passenger trips on the Las Vegas Strip starting today. The vehicles are limited to pickups and dropoffs at only a handful of destinations, including Resort World Las Vegas, AREA15, Topgolf, and other “resort and entertainment properties.” The company says it will be adding new destinations as it gradually expands it service. \nZoox’s robotaxis are fully driverless insofar as they lack traditional controls like pedals and steering wheels. Instead, the interior of the vehicle features bench seats positioned on either side, so passengers face each other while they ride. The exterior is covered in sensors, including cameras, lidar, and radar. The vehicles typically won’t exceed 45 mph when in operation. \nZoox is also inviting interested riders to join its waitlist for a robotaxi service in San Francisco. Zoox has a permit to test its driverless vehicles in two cities, San Francisco and Foster City, under certain circumstances, but has yet to receive a permit for a commercial robotaxi service in the state. The company is also testing vehicles in Los Angeles, Seattle, and Austin. Zoox plans to deploy a total of 50 vehicles across both Las Vegas and San Francisco. “Over time, this will scale to meet increased demand,” spokesperson Marissa Wigam said.\nIn Las Vegas, Zoox’s robotaxis will pickup and dropoff passengers from designated zones at its partnering destination. Resort World and AREA15, in particular, have created Zoox-only zones with a “Zoox concierge” onsite to help with passenger with questions they may have. \nRides can be requested in the Zoox app, where customers will find a bevy of Uber-like details, like wait times, license plate numbers of arriving vehicles, and options to submit feedback. For those in need of assistance, a “help” button in both the app and vehicle will connect them to remote operators. \nVerge contributor Abigail Bassett tested Zoox’s robotaxis at CES earlier this year, and found the seats in particular to be too thin and uncomfortable. (Others who have tested the vehicles have made similar criticisms.) But aside from a few “pucker” moments, the robotaxi did relatively well. The route was predetermined, and with today’s announcement, it sounds like those waiting for a truly dynamic, go-anywhere, 24/7, purpose-built robotaxi service will have to wait a bit longer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b70e8456a1017fae26d04b586fb5d56937d0a0",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:56:42.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice\nA court in South Korea has acquitted a woman convicted six decades ago for biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.\nChoi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae. He pinned her to the ground and repeatedly forced his tongue into her mouth, at one point blocking her nose to stop her from breathing, according to court records.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d419850870765f0051c95b57e13ec916ed95efb",
      "title": "Strictly's Thomas Skinner sorry for grabbing reporter's phone",
      "url": "https://www.bbc.com/news/articles/c1l8vnzmeqpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:46:42.000Z",
      "summary_90w": "",
      "raw": "The ex-Apprentice star says he walked out of interviews after seeing a message on a journalist's screen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d30e64d94e18bd426d9221454301eec1c632092",
      "title": "Reddit is dropping subscriber counts on subreddits",
      "url": "https://www.theverge.com/news/775524/reddit-subreddit-member-count-vistors-contributions",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T12:44:30.000Z",
      "summary_90w": "",
      "raw": "Reddit users can no longer see how many people are subscribed to their favorite subreddit communities. The platform has announced that it’s removing the member count metric that appears on subreddit pages — located under the page bio on the right for desktop users, or at the top under the subreddit name on mobile — to better focus on real-time engagement.\nThe member count is being replaced by two metrics. One shows how many users have visited a subreddit in the past seven days, “based on a rolling 28-day average,” according to Reddit, and the other displays how many contributions have been made in the past seven days, excluding any posts or comments that have been removed. The change aims to provide a better glimpse at how active a subreddit actually is, as Redditors may simply be “lurking” in these communities without adding content or engaging in conversations.\n“Member counts don’t tell the whole story. In most cases, Redditors don’t need to be a member of a community to post or comment, which means member totals have never fully reflected true engagement,” Reddit said in its announcement. “By emphasizing active participation over passive membership, we’re continuing to highlight what makes Reddit unique: real people engaging in real conversations.”\nThis update is part of Reddit’s goal to improve moderation on the platform, because allowing individuals to moderate an unlimited number of large communities isn’t “sustainable,” according to Reddit. The new visitor counts will be used to limit how many busy subreddits each moderator can oversee, restricting them to a maximum of five communities with over 100k visitors. Reddit says that communities with fewer than 100k visitors “won’t count toward this limit,” and that the change will only impact 0.1 percent of active mods.\nModerators can still view the total number of subscribers by looking at the subreddit insights, but this isn’t something that regular Reddit users will be able to see. The changes haven’t gone down well, judging by the comments on Reddit’s post on r/modnews, but the new metrics do seem useful for users who want a more accurate look at how active a subreddit actually is.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2b0615520663f609bb01d6849f514cc2e5d7b6e7",
      "title": "Sacked referee David Coote accused of making indecent image of child",
      "url": "https://www.bbc.com/news/articles/c80g5v1lg0eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:40:20.000Z",
      "summary_90w": "",
      "raw": "The former Premier League referee is due in court in Nottingham on Thursday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a021628643fc5c868efed3feb41393d64f2c7b47",
      "title": "UK's first 'super-university' to be created as two merge from 2026",
      "url": "https://www.bbc.com/news/articles/cy85905dj2wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:34:59.000Z",
      "summary_90w": "",
      "raw": "Universities are facing ongoing financial worries, with the regulator saying other mergers could follow.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fb309309a9468af62804db8cba280746e0ba862",
      "title": "Jihadists 'summarily executed' 127 people in Niger, says rights group  ",
      "url": "https://www.bbc.com/news/articles/c4gkx78xeg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:29:01.000Z",
      "summary_90w": "",
      "raw": "Worshippers have been gunned down in mosques and homes have been torched in escalating violence, Human Rights Watch says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fd76b83c01aa4823edba66f9883959b72c9b5fd",
      "title": "Weleda launches inquiry into Nazi camp skin test claims",
      "url": "https://www.bbc.com/news/articles/cy7pgd5nkr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:23:34.000Z",
      "summary_90w": "",
      "raw": "A new study alleges the skincare brand's product was used for human experiments by a Nazi doctor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09dc1a17ec670bfdc1ac04057e487bb29a122b12",
      "title": "Chinese nationals jailed for human trafficking in South Africa",
      "url": "https://www.bbc.com/news/articles/c20v3n7wllzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:18:13.000Z",
      "summary_90w": "",
      "raw": "A raid on a Johannesburg factory found 91 Malawians, including 37 children, living in appalling conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "220c941ab8c89c56cc1f04ff6ec0b8dfd99133e3",
      "title": "Banksy mural scrubbed from Royal Courts of Justice",
      "url": "https://www.bbc.com/news/articles/cm2z30p033ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:13:54.000Z",
      "summary_90w": "",
      "raw": "The artwork of a judge hitting a protester with a gavel has been removed from the listed building.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59e7ad23370909f02190e43e1e7c360caa34c32e",
      "title": "Ursula von der Leyen calls for suspension of EU trade with Israel",
      "url": "https://www.theguardian.com/world/2025/sep/10/ursula-von-der-leyen-suspension-eu-trade-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:12:15.000Z",
      "summary_90w": "",
      "raw": "Commission president cites illegal West Bank settlement plans, Gaza and attempts to ‘undermine two-state solution’\nThe European Commission president, Ursula von der Leyen, has called for a suspension of trade with Israel, as she spoke of Europe’s “painful” inability to respond to the war on Gaza and ensuing humanitarian disaster.\nIn her most extended condemnation yet of the Israeli government, von der Leyen criticised plans for illegal settlements that would split the occupied West Bank in half, as well as incitement of violence by extremist Israeli ministers, as a “clear attempt to undermine the two-state solution”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d15d9a5891ad997b6c2babf039c4a54231edf42b",
      "title": "By listening to these birds for decades, scientists track signs of a changing forest",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535788/songbirds-experimental-forest-change-new-hampshire",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T12:09:53.000Z",
      "summary_90w": "",
      "raw": "Scientists tracking the birds in an experimental forest in New Hampshire have also tracked changes in the forest ecosystem over decades.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec8cb123cee9b8311c15dba57253af2f89d57bb6",
      "title": "Starmer’s meeting with Israeli president could set relations back further",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-president-isaac-herzog-meeting-keir-starmer-analysis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:09:17.000Z",
      "summary_90w": "",
      "raw": "Two leaders have competing visions for Israel’s security and Palestinian self-rule with little chance of finding common ground\nA meeting in London between Keir Starmer and the Israeli president, Isaac Herzog, could not come at a more difficult time for either leader, and far from easing British-Israeli relations, the encounter risks setting them back yet further.\nOnce the meeting on Wednesday was in the diary, there was a faint hope within Downing Street that the two men would at least listen to each other about their competing visions for Israel’s future, including a two-state solution to the Palestinian conflict, a vision Herzog once shared.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5442a524c38cdfcaa396e60d2c4a53b31b783ce1",
      "title": "Protests hit France as new PM takes office",
      "url": "https://www.bbc.com/news/articles/c8643qg252lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:01:20.000Z",
      "summary_90w": "",
      "raw": "A grassroots movement is encouraging people to protest against the political class and proposed budget cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e739e106e2e3c845f3d93b4651f0570dbb9ab276",
      "title": "Blade’s air taxis are coming to the Uber app",
      "url": "https://www.theverge.com/news/774485/joby-blade-uber-evtol-helicopter-air-taxi",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Last month, Joby Aviation purchased Blade Air Mobility’s helicopter taxi business for $125 million, with the goal of eventually replacing those noisy, polluting helicopters with its more quiet, battery-powered air taxis. But while it waits for FAA certification, Joby is teaming up with Uber to get more passengers in its newly acquired fleet of helicopters. \nJoby announced today that Uber customers will soon be able to reserve a helicopter ride on the ridehailing company’s app. The integration will launch “as soon as next year,” at which point Uber customers will be able to book helicopter trips from any of Blade’s Manhattan-based landing pads to a short list of destinations, including JFK and Newark airports as well as the Hamptons. Blade also serves several locales along the French Riviera, including Cannes, Saint-Tropez, Nice, and Monaco. \n\nThe integration will launch “as soon as next year”\n\n\nBlade, which formed in 2014, has a robust helicopter transportation business, having flown more than 50,000 passengers in New York and Southern Europe in 2024. But some experts believe that helicopters could become obsolete as more electric vertical takeoff landing (eVTOL) aircraft are given clearance to fly. Joby, meanwhile, bought itself a leg up over its competitors by acquiring a company with established routes, customers, and infrastructure.\nAnd now, through this Uber partnership, the company will be able to introduce an influential swath of the ridehailing company’s customer base to “the magic of seamless urban air travel,” said JoeBen Bevirt, CEO of Joby, in a statement.  \nJoby is in the process of acquiring FAA certification for its eVTOL aircraft, which looks like an oversized drone and can carry up to four passengers. The vehicle can take off vertically, like a helicopter, and then shift into forward flight using tilt rotors. Joby says it can reach a top speed of 200mph, travel 100 miles on a single battery charge, and is 100 times quieter than a conventional aircraft. Its pouch-style lithium-ion batteries can power the craft’s six electric motors for at least 10,000 flight cycles. \nThe company has been working with Uber for a while, first linking up in 2019, and then eventually acquiring the ridehailing company’s Elevate air taxi division in 2020. Joby plans on launching its first commercial service in Dubai in 2026, and has announced plans to operate in New York, Los Angeles, Florida, the UK, and Japan.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b034ae8d28a0d40ae5a3589cd3327a296e3d9d4",
      "title": "Ex-Google X trio wants their AI to be your second brain — and they just raised $6M to make it happen",
      "url": "https://techcrunch.com/2025/09/10/ex-google-x-trio-wants-their-ai-to-be-your-second-brain-and-they-just-raised-6m-to-make-it-happen/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T12:00:00.000Z",
      "summary_90w": "",
      "raw": "TwinMind, available on Android and iOS, passively captures background audio to gain context and deliver on-the-go summaries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d9a8118f6c0eb043a198bdfc134d36ae2167355f",
      "title": "Lyft’s first ‘robotaxis’ are live in Atlanta",
      "url": "https://www.theverge.com/news/775074/lyft-may-mobility-robotaxi-atlanta-public",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T12:00:00.000Z",
      "summary_90w": "",
      "raw": "For months, Lyft has watched while its rival Uber made deals with seemingly every autonomous vehicle operator under the sun. But the smaller ridehail company has been quietly building a fleet of its own, and Lyft is ready to launch its first customer-ready robotaxi pilot in Atlanta. \nLyft is teaming up with May Mobility, an Ann Arbor, Michigan-based company that is backed by Toyota and BMW. The fleet is comprised of Toyota Sienna minivans equipped with sensors like cameras, radar, and lidar. The vehicles will operate on both city and suburban streets around Midtown Atlanta in a service area that is approximately 7 square-miles. Lyft customers who request rides within the service area will be given the option to match with a May Mobility autonomous vehicle if they choose. \nLyft is also proceeding cautiously with its first customer-ready AV service in the US. The vehicles will feature “standby operators” — Lyft’s term for safety drivers — in the driver seat. These operators are trained to “take the wheel and drive manually during initial trips, as needed, and will intervene less over time as service is optimized,” the company’s press release states. They will also answer customer questions and ensure the ride is comfortable. In other words, they’re Lyft drivers — that is, until the companies feels confident enough in the safety of their technology to remove them from the vehicle. \nThe use of safety drivers during the initial phases of a robotaxi rollout is fairly standard by this point. Waymo has used them, and Tesla is currently using safety monitors in its two markets in California and Texas. Currently, only Waymo and Zoox operate fully driverless vehicles without safety drivers in a commercial service. \nLyft has several robotaxi partnerships brewing right now, in addition to today’s launch with May Mobility. The company is working with Benteler Mobility to launch a self-driving shuttle service in late 2026. And it plans to deploy a fleet of robotaxis, using self-driving technology from Intel’s Mobileye, in Dallas also in 2026, with plans to scale to ”thousands” of vehicles in additional markets in the months to follow.\nWhile its lagged in the number of deals behind its rival, Lyft is also taking a similar approach as Uber by offering its ridehail platform to different self-driving developers who want to connect with customers without having to build their own customer-facing operation. Like Uber, Lyft’s interest is staying as “asset light” as possible, needing other companies to own, operate, and maintain the robotaxi fleet for its customers.\nOf course, this isn’t Lyft’s first robotaxi rodeo. The ridehail company had thought to develop its own autonomous vehicles, but eventually sold off its AV research and development division to a subsidiary of Toyota back in 2021.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26a8181fb9fbef48bd6195b76ce8504d02d0b857",
      "title": "Uber will add Blade’s helicopters to its platform as early as 2026",
      "url": "https://techcrunch.com/2025/09/10/uber-will-add-blades-helicopters-to-its-platform-as-early-as-2026/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The move comes just one month after Uber partner Joby acquired Blade's passenger business.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b9c822700bff9edf965aaef661bc3c2b7256f65",
      "title": "Tinder evolves some features into dating ‘modes’",
      "url": "https://techcrunch.com/2025/09/10/tinder-evolves-some-features-into-dating-modes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T11:46:17.000Z",
      "summary_90w": "",
      "raw": "The app is getting two new modes, Double Date and College Mode — essentially extensions of existing features — alongside a \"For You\" mode on the home screen that presents the classic Tinder experience. The company said it will add more dating modes that will lean into interests, dating intentions, and different ways to connect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cfdc2ebe92c1a2e61a4b35c79c7cedd236560592",
      "title": "Gaza aid flotilla carrying Greta Thunberg reports second drone attack in 24 hours",
      "url": "https://www.theguardian.com/world/2025/sep/10/gaza-aid-flotilla-carrying-greta-thunberg-reports-second-drone-attack-on-boat-at-tunisian-port",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T11:46:06.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says no passengers or crew harmed by alleged incendiary device dropped on boat in Tunisian port\nA flotilla seeking to break Israel’s aid blockade of Gaza has said it was attacked by a drone for the second time in less than 24 hours.\nThe Global Sumud Flotilla (GSF), which is carrying pro-Palestinian activists, including Greta Thunberg, said in a statement early on Wednesday that it had been attacked by another drone, which dropped an incendiary device on one of its boats, the Alma, as it was moored in the port of Sidi Bou Said in Tunisia. None of the passengers or crew were harmed and no structural damage was caused, it said\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef0cd82f539a356143e316ff5c05a92b60e6b42f",
      "title": "Shock as Kenyan lawyer killed in drive-by shooting in Nairobi",
      "url": "https://www.bbc.com/news/articles/c20v34qpr98o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T11:36:34.000Z",
      "summary_90w": "",
      "raw": "Kyalo Mbobu was driving home when a gunman on a motorbike shot him dead on a busy street in the capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cd03dcf3f6dfaaf24ceda5c3010b2e85edbc360",
      "title": "UN inspectors can resume work at Iran nuclear sites after breakthrough deal",
      "url": "https://www.theguardian.com/world/2025/sep/10/un-inspectors-iran-nuclear-sites-breakthrough-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T11:36:01.000Z",
      "summary_90w": "",
      "raw": "Rafael Grossi, IAEA director general, says agreement with Tehran is ‘important step in the right direction’\nTehran and the UN nuclear inspectorate have reached an agreement that will allow UN inspectors to return to inspect all of Iran’s nuclear sites, including those bombed by Israel and the US in June.\nThe breakthrough, confirmed by Rafael Grossi, the director general of the International Atomic Energy Agency, came during a three-hour meeting on Monday between Grossi and the Iranian foreign minister, Abbas Araghchi, in Cairo.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd272ba7260163fc20d79d00929d20250c493ce8",
      "title": "Childhood obesity: The South African campaigners fighting for healthy food",
      "url": "https://www.bbc.com/news/articles/ce84n6zpxx9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T11:35:03.000Z",
      "summary_90w": "",
      "raw": "The UN says the number of obese teenagers has nearly tripled globally in the last two decades.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a394d24cbb37857d0e4d7c062802add69609198c",
      "title": "Trump is used to shaking off criticism - but the Epstein story is different",
      "url": "https://www.bbc.com/news/articles/cp8j3e5g74no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T11:33:53.000Z",
      "summary_90w": "",
      "raw": "While there is no suggestion of criminal wrongdoing by Trump, the political consequences of the Epstein saga on the US president are very real",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e33163f88b726341f7665fb60df09f51a9edec9",
      "title": "Nepal protests 'hijacked', Gen Z claim, as army patrols the streets",
      "url": "https://www.bbc.com/news/articles/cjd1ndmrej0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T11:18:42.000Z",
      "summary_90w": "",
      "raw": "Fierce protests against corruption and nepotism spiralled into arson and violence on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03c730fbc3c7289d1769090ae65ac6a18d0f9cc7",
      "title": "Dr. Peter Hotez takes the war against science very personally",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/10/g-s1-87614/dr-peter-hotez-science-rfk-jr",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T11:18:41.000Z",
      "summary_90w": "",
      "raw": "In an interview about the new book he co-authored, Science Under Siege, Hotez talks about forces driving the anti-science movement, the risks it poses — and why he won't debate RFK Jr.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0dd5761c38bd67a7dc247b2c7cf94061439f9acd",
      "title": "Apple&#8217;s misunderstood crossbody iPhone strap might be the best I&#8217;ve seen",
      "url": "https://www.theverge.com/report/775498/apple-iphone-crossbody-strap-magnetic-reaction",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T11:05:59.000Z",
      "summary_90w": "",
      "raw": "The $59 price is pretty reasonable, at least by Apple standards.\t\n\nThe skepticism I had about Apple's rumored crossbody iPhone strap can be put to rest now that it's officially announced as part of yesterday's big iPhone 17 event. I'm suitably impressed. And if we can clear up some of the confusion about why it exists in the first place, then I think more people will be too.\nFirstly, crossbody straps are supremely useful for those of us who are denied deep pockets and don't want to carry a bag. It gives the person quick access to their phone on a bike, at a festival, in a shop to make payments, or when tapping into public transport. They're for the old and young who fear their phones being dropped or stole …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "62d9d5e99a42d0a044e9b69101e8735f0ced7ad0",
      "title": "Israel targets Hamas Qatar strike. And, JB Pritzker on Trump's threats to Chicago",
      "url": "https://www.npr.org/2025/09/10/g-s1-87939/up-first-newsletter-israel-qatar-hamas-trump-jb-pritzker-maha-election-citizenship",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T11:05:10.000Z",
      "summary_90w": "",
      "raw": "Israel says it carried out an airstrike targeting senior Hamas officials in Qatar's capital of Doha. And, Trump says he wants to fight crime in Illinois. Gov. JB Pritzker sees a power grab.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "602b27a8c8c186b2e6cb749f7d8da4f2a23403ba",
      "title": "Google’s former security leads raise $13M to fight email threats before they reach you",
      "url": "https://techcrunch.com/2025/09/10/googles-former-security-leads-raise-13m-to-fight-email-threats-before-they-reach-you/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T11:00:00.000Z",
      "summary_90w": "",
      "raw": "The startup is using real-time AI agents that inspect, analyze, and neutralize email threats.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "779c843f5b44d69ad8a4c616f6041f00ecbd65f2",
      "title": "Spotify adds lossless streaming after 8 years of teasing",
      "url": "https://www.theverge.com/spotify/775189/spotify-lossless-streaming-flac-audio",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T11:00:00.000Z",
      "summary_90w": "",
      "raw": "It’s been a long time coming but Spotify is finally getting lossless audio. Rumors have been circulating about a high-fidelity offering since as early as 2017. In 2021, Spotify claimed it was “coming later this year.” And by May of 2024 it was “almost ready.” So, when rumors started picking up again in June of this year, they were met with skepticism, especially amid announcements over the launch of features nobody was asking for, like direct messaging.\nWell, it’s here. For real. And there’s some good news — Lossless won’t be confined to a new higher-priced tier. There’s no new Spotify HiFi membership or Music Pro subscription. Instead lossless audio will be rolling out to all Premium subscribers in 50 markets (starting with Australia, Austria, Czechia, Denmark, Germany, Japan, New Zealand, the Netherlands, Portugal, Sweden, the US, and the UK) over the next two months. \nThere shouldn’t be any guessing, either. Spotify says subscribers should receive a notification in the app as lossless becomes available to them. You’ll then be able to head into your settings and enable lossless from the media quality menu. And if you’re actively listening to lossless audio there will be an indicator in the Now Playing bar and via the Connect Picker for compatible hardware. To start that will include devices from Sony, Bose, Samsung, and Sennheiser, with Sonos and Amazon support expected to be added next month.\nThere is a catch, however. Spotify’s lossless option tops out at 24-bit / 44.1 kHz FLAC. Apple Music, Tidal, and Qobuz all offer HiRes FLAC support at up to 24-bit / 192 kHz. Granted, once you start entering 24-bit FLAC territory it can get pretty hard to tell the difference unless you’re a particularly demanding audiophile with a soundsystem priced in the same range as a used sedan. But it does leave room for Spotify to add on one of those rumored “deluxe” tiers to squeeze a bit more money out of. \nThis leaves YouTube as the only major streaming music service (and I’m using the term “major” loosely here) that doesn’t support lossless streaming. And, there’s been no indication from Google that it’s going to change its tune anytime soon.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c6b201a05a80694ef220257a5b9c1b4ea4f50744",
      "title": "Spotify is finally launching support for lossless music streaming",
      "url": "https://techcrunch.com/2025/09/10/spotify-is-finally-launching-support-for-lossless-music-streaming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Spotify is finally launching lossless music streaming support after consumers demanded it for years.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "be6d83df217707f1805493a67684147d2d84177b",
      "title": "The MechaHitler defense contract is raising red flags",
      "url": "https://www.theverge.com/x-ai/775411/grok-xai-safety-musk-warren-hegseth-dod",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Ask someone their worst fears about AI, and you'll find a few recurring topics - from near-term fears like AI tools replacing human workers and the loss of critical thinking to apocalyptic scenarios like AI-designed weapons of mass destruction and automated war. Most have one thing in common: a loss of human control. \nAnd the system many AI experts fear most will spiral out of our grip? Elon Musk's Grok. \nGrok was designed to compete with leading AI systems like Anthropic's Claude and OpenAI's ChatGPT. From the beginning, its selling point has been loose guardrails. When xAI, Musk's AI startup, debuted Grok in November 2023, the announceme …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drones, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:43:54.000Z",
      "summary_90w": "",
      "raw": "Organisers said two boats were hit in separate incidents; Tunisian authorities disputed the first and have not commented yet on the second.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7cfa2cc57204c1bc1cf197b07fdfa5045262aeae",
      "title": "TV presenter Jay Blades denies rape charges",
      "url": "https://www.bbc.com/news/articles/c9318dj1q22o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T10:34:44.000Z",
      "summary_90w": "",
      "raw": "The TV presenter faces a trial at Shrewsbury Crown Court in September 2027",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3342c14e145cfb08b793be98d54fe88805dfa992",
      "title": "Hong Kong lawmakers say no to more rights for same-sex couples",
      "url": "https://www.bbc.com/news/articles/c5yqeggvwgpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:34:10.000Z",
      "summary_90w": "",
      "raw": "The law would have recognised some rights for couples who were married overseas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b4126d807cd49b32ea1f69ba280e14cc476f1cb",
      "title": "Four dead, including two children, attempting to cross Channel to UK in last 24 hours",
      "url": "https://www.theguardian.com/uk-news/2025/sep/10/four-dead-including-two-children-attempting-to-cross-channel-to-uk-in-last-24-hours",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:32:11.000Z",
      "summary_90w": "",
      "raw": "Number of attempts to cross Channel has been particularly high for several days, say French authorities\nFour people including two children have died in two separate incidents while trying to cross the Channel to the UK in the last 24 hours, while three others are missing in a third incident.\nOn Tuesday night off the coast of Sangatte, France, three people lost their lives while travelling on a dinghy with 38 people onboard. Three others are missing after an incident in Neufchâtel-Hardelot, France, on a boat with 115 people onboard.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33bc623fa4b98469ed6d7eeb3ca66f79faa83a4e",
      "title": "Watch: Army patrols streets of Kathmandu after fierce protests",
      "url": "https://www.bbc.com/news/videos/cyv647g63gvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:32:09.000Z",
      "summary_90w": "",
      "raw": "Charlotte Scarr reports from the Kathmandu where deadly protests against corruption and nepotism took place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef95c7eba627dce8e41fef5eb513669ce3ed052e",
      "title": "James McAvoy reportedly assaulted  in Toronto bar",
      "url": "https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:12:49.000Z",
      "summary_90w": "",
      "raw": "Actor promoting his directorial debut California Schemin’ at the city’s film festival is reported to have been punched by another drinker\nThe actor James McAvoy was assaulted in a bar in Toronto, it has been reported.\nAccording to People magazine, McAvoy was “sucker punched” by another visitor to Charlotte’s Room bar on Monday evening, two days after the premiere of his directorial debut, California Schemin’, at the Toronto film festival.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "118fff44b04a5553dcca46b5835a7821395e2ba4",
      "title": "Poland shoots down drones over its territory amid Russian attack on Ukraine",
      "url": "https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:09:58.000Z",
      "summary_90w": "",
      "raw": "Donald Tusk says operation was launched after ‘repeated violations of Polish airspace’\n\nFollow the latest updates live\n\nPoland scrambled its own and Nato air defences to shoot down several drones that entered its airspace on Wednesday morning, as Russia’s attack on Ukraine spread to Nato territory in the most significant way since the full-scale invasion more than three years ago.\nDonald Tusk, Poland’s prime minister, convened an emergency meeting of the council of ministers at 8am local time, and said he was in “constant contact” with Nato’s secretary general, Mark Rutte.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "644620eb6a3a106df5cbdf9b296169debce82997",
      "title": "Trump says he's fighting crime. Illinois Gov. Pritzker sees a power grab before 2026",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5533120/pritzker-trump-chicago-troops",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Steve Inskeep speaks with Illinois Governor JB Pritzker about President Trump's threats to send National Guard troops to Chicago and the future of the Democratic Party.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "742180f7cb3a46027c5faf7ad8cc6b49e713d3e4",
      "title": "The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/jacinta-nampijinpa-price-sussan-ley-indian-migration-comments-repercussions-for-coalition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T09:51:57.000Z",
      "summary_90w": "",
      "raw": "Price’s refusal to endorse Sussan Ley’s leadership on Wednesday was a deliberate provocation that left the opposition leader no choice\n\nReport: Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments\n\nGet our breaking news email, free app or daily news podcast\n\nFor much of her short career in Canberra, the usual rules of political gravity have appeared not to apply to Jacinta Nampijinpa Price.\nA firebrand, outspoken and unapologetic about almost everything, she went from a first-term backbencher from the Northern Territory to a member of the shadow cabinet in less than a term. Easily the most prominent opponent of the Indigenous voice to parliament, Price used the referendum campaign to build her political brand exponentially.\nTom McIlroy is Guardian Australia’s chief political correspondent\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "01c3d5b8c6847addd86bb352dd406be45d7d1b0d",
      "title": "Police should stop logging non-crime hate incidents, watchdog says",
      "url": "https://www.bbc.com/news/articles/c0kn54vj55xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T09:44:13.000Z",
      "summary_90w": "",
      "raw": "Sir Andy Cooke says the current legislation puts police officers in an \"invidious position\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5fdd844ac676fca636098ba65f930bfa462e2ae5",
      "title": "Pulp, CMAT and Wolf Alice nominated for Mercury Prize",
      "url": "https://www.bbc.com/news/articles/ckg3n15l7ygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T09:37:21.000Z",
      "summary_90w": "",
      "raw": "Past winners Pulp and Wolf Alice are up for the music award alongside CMAT, PinkPantheress and Pa Salieu.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73c38ae9e8056f3b2216b55d0c5e2adbfd64dcd3",
      "title": "Contactless card payments could become unlimited",
      "url": "https://www.bbc.com/news/articles/czjv7jy2r9vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T09:24:15.000Z",
      "summary_90w": "",
      "raw": "Card providers would be allowed to set their own contactless card payment limit, under the regulator's plans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1af6d8f31dc8f641fd2e03813b1ae929b6631a77",
      "title": "Abbott says dumped frontbencher ‘will be a big loss’ - as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T09:16:53.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nLey dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments\n\nAnalysis: The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo\n\nGet our breaking news email, free app or daily news podcast\n\nMatt Thistlethwaite, the assistant minister for foreign affairs and trade, said Israel’s strikes against top Hamas members in Qatar violated the nation’s sovereignty and imperilled ceasefire talks, adding the Australian government was not informed of the actions beforehand.\nThistlethwaite told RN Breakfast this morning the government condemned the strikes, adding:\nThese strikes violate Qatar’s sovereignty and they imperil a ceasefire and the release of the Israeli hostages. And unfortunately, they risk further escalation in the conflict.\nQatar’s been working quite hard behind the scenes alongside the United States and Egypt to try and broker a ceasefire and a release of hostages deal. So these strikes will imperil that. Nonetheless, it’s encouraging to hear Qatari leaders say that they remain committed to trying to broker an agreement and a ceasefire.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc0fcf4fcde822583cc7381deb1e60f171da217c",
      "title": "Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise for migration comments",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/jacinta-namipijinpa-price-refuses-to-back-sussan-ley-leadership-apologise-indian-migration-comments",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T09:01:59.000Z",
      "summary_90w": "",
      "raw": "Coalition leader says firebrand Northern Territory senator ‘failed to uphold the standards I have set’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nSussan Ley has sacked Jacinta Nampijinpa Price from the shadow ministry after the firebrand senator refused to express support for the Liberal leader or apologise for her comments about Indian migrants.\nLey said Price’s frontbench position had become “untenable” after the Country Liberal senator fronted a dramatic press conference in Perth earlier in the day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5f7bd78ca39fa302ac879fc431ad2a1235ae06",
      "title": "Who is Lachlan Murdoch, the anointed media tycoon?",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535569/lachlan-murdoch-rupert-news-corp-fox",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T09:01:00.000Z",
      "summary_90w": "",
      "raw": "His position in leading News Corp. and Fox is now secure, as his father ends a dramatic succession battle. Lachlan grew up in New York City but has lived in Australia for much of his adult life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9de68978e719dc44efdbde5be2d100a778d8028",
      "title": "33 million voters have been run through a Trump administration citizenship check",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5477367/save-election-citizenship-data-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Tens of millions of voters have had their information run through the tool — a striking portion of the U.S. public, considering little has been made public about the tool's accuracy or data security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f1a820b19be359973be49a834f0e26dc4b55feb4",
      "title": "Trump's control of the D.C. police is due to expire tonight. Then what?",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535534/trump-dc-police-control-expire",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump needs an extension from Congress to control D.C. police for more than 30 days. Some Republican lawmakers are focused on pursuing legislation that would exert power over D.C. in other ways.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1ccb39c3dc969dbd7dea8c41d4abc2de97a0eea",
      "title": "You're more likely to reach for that soda when it's hot outside",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5529399/sugar-health-climate-change",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People drink more sugary beverages when it's hot, researchers found, significantly increasing their sugar intake. That impact could grow as climate change raises the world's temperatures.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7114bf6194f1cddff2d7d7dfa7ea08b601d92ca4",
      "title": "Watch: Mandelson says he regrets falling for Epstein's lies",
      "url": "https://www.bbc.com/news/videos/c5y5v8l14p6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T08:51:03.000Z",
      "summary_90w": "",
      "raw": "Watch: Mandelson says he regrets falling for Epstein's lies",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3dae5db8ecaa3c4d1cf2664358ae0f482b04fc10",
      "title": "The candidates vying to replace Angela Rayner as Labour deputy leader",
      "url": "https://www.bbc.com/news/articles/c8jm9lk19v3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T08:49:16.000Z",
      "summary_90w": "",
      "raw": "The winning candidate - voted for by Labour members - will be announced on 25 October.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89b9fd369f714d6ba1933aefa71a4bad8442074c",
      "title": "Emptying olive oil an ‘act of faith’, accused say, after pleading guilty to damaging Sydney’s Anzac Memorial",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/olive-oil-damaging-sydney-anzac-memorial-accused-plead-guilty-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T08:30:06.000Z",
      "summary_90w": "",
      "raw": "Two born-again Christians admit damaging war memorial but argue their behaviour is a show of faith rather than disrespect\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nEmptying bottles of olive oil on a war memorial in broad daylight is an act of faith, say two men who have admitted recklessly damaging the sacred site.\nAbel Clark and Peter McMaster, both 61, may have permanently stained the granite walls and steps of Sydney’s Anzac Memorial when they “blessed” them with olive oil about midday on 4 September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be4015c491089f6f6755409cba778b582049d57f",
      "title": "Tornado in central NSW and flood rescues in Sydney as wild weather soaks state",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/tornado-in-central-nsw-and-flood-rescues-in-sydney-as-wild-weather-soaks-south-east-of-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T08:21:25.000Z",
      "summary_90w": "",
      "raw": "Heavy rainfall forecast to continue in Sydney on Thursday as low pressure weather system heads for parts of Queensland\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nTwo groups have been rescued from flooding while a tornado warning for central New South Wales has been downgraded as large parts of the state brace for a further battering of rainfall and heavy winds from a low pressure system off the Tasman Sea.\nThe NSW State Emergency Service said it had responded to more than 90 incidents in the past 24 hours, including flood rescues for a motorist who had driven off a cliff face at Camden Bypass and a group of bushwalkers trapped by flood waters at Wattamolla.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c95bac699d5528c6081fbb10aa2f4da08d94460",
      "title": "US influencer investigated over wild croc wrestling videos",
      "url": "https://www.bbc.com/news/articles/cn953l9e3gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T08:09:41.000Z",
      "summary_90w": "",
      "raw": "Wildlife experts say Mike Holston's actions in Far North Queensland were dangerous and cruel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f358cfc6f2ffbd50c4cc3725e48231412e2b94f0",
      "title": "Poland says it shot down Russian drones that violated its airspace",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5536450/poland-russia-drones-airspace-ukraine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T07:55:39.000Z",
      "summary_90w": "",
      "raw": "Poland said Wednesday that it and its NATO allies had shot down Russian drones that violated Polish airspace in what it called an \"act of aggression\" as Russia launched aerial attacks on Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fdcf43bd41e1462082cf51354af827b1fd0ebe6",
      "title": "Trump reportedly asks EU to impose 100% tariffs on India and China",
      "url": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T07:46:41.000Z",
      "summary_90w": "",
      "raw": "In effort to end Russia’s war in Ukraine, US president reportedly proposes tariffs of up to 100% targeting Putin allies and trade partners\n\nBusiness live – latest updates\n\nEurope live – latest updates\n\nDonald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine, according to reports.\nThe US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to the Financial Times, BBC and Bloomberg, who cited sources familiar with the discussions.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca54d46f94d5dbc1392b82407ff727cdfbd54523",
      "title": "Woman who bit off attacker's tongue acquitted after 61 years",
      "url": "https://www.bbc.com/news/articles/ckgezkrdjeko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T06:53:33.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja only managed to break free after biting off about 1.5cm of her alleged attacker's tongue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d2dc749311b26b3a8323d703766f50549f55f47",
      "title": "How 'BMX in a wheelchair' became an online sensation",
      "url": "https://www.bbc.com/sport/articles/cvg3px16zlmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T05:50:17.000Z",
      "summary_90w": "",
      "raw": "WCMX - short for wheelchair motocross - is the para-sport taking social media by storm. So what is it, and what is its future?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d2656caf5b61b0264a1b2533e0508ddfb637a47",
      "title": "Anti-Islamic US biker gang members run security at deadly Gaza aid sites",
      "url": "https://www.bbc.com/news/articles/cm2zy4l8jgeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T05:00:09.000Z",
      "summary_90w": "",
      "raw": "BBC identifies members of Infidels MC gang hired as armed security at US and Israel-backed aid sites.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T04:49:54.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c707135a5dc4ad725b77f9a5320af5f33f495c72",
      "title": "Robinhood embraces copy trading after warning competitors about regulatory risks",
      "url": "https://techcrunch.com/2025/09/09/robinhood-embraces-copy-trading-after-warning-competitors-about-regulatory-risks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T04:17:09.000Z",
      "summary_90w": "",
      "raw": "Roughly nine months after suggesting that a young copy trading platform could only operate because it flew \"under the radar\" of regulators, Robinhood has announced its own entry into the space with \"Robinhood Social,\" a new feature that will allow users to follow and manually replicate the trades of prominent investors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "287c411f5c9d2dffd614472f3d254fb6313dfbdc",
      "title": "Trump appears sidelined as the US caught unawares by Israel’s unprecedented strikes on Qatar",
      "url": "https://www.theguardian.com/world/2025/sep/10/trump-us-israel-hamas-strike-qatar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T04:00:04.000Z",
      "summary_90w": "",
      "raw": "The White House is caught between supporting Israel’s war against Hamas and  patching up relations with a key US ally in the region\n\nFull report: Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks\n\nIn the aftermath of Israeli airstrikes targeting Hamas negotiators in the heart of Qatar’s capital Doha, the White House appeared sidelined from halting a conflict that Donald Trump has claimed only he could mediate.\nAs details of the diplomatic flurry before Tuesday’s extraordinary strike were revealed, it was claimed that the White House had little say in how Israel opened its latest front in its war against Hamas – this one on a US ally hosting negotiations days after Trump had claimed he was close to reaching a deal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7314c5d1c78502f4efe20b8d90ba421798102985",
      "title": "Federal judge blocks Trump from firing Fed Governor Lisa Cook, for now",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5529281/appeals-court-lisa-cook-federal-reserve-independence-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T03:29:38.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve Governor Lisa Cook won a round in federal court in her bid to keep her job despite President Trump's effort to fire her.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6f917466683095255dab3a4e1782a394f7c187e9",
      "title": "Discovery of new campsite shows fugitive Tom Phillips had ‘outside help,’ NZ police say",
      "url": "https://www.theguardian.com/world/2025/sep/10/tom-phillips-new-zealand-man-fugitive-father-outside-help-nz-police-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T02:57:50.000Z",
      "summary_90w": "",
      "raw": "Phillips had spent nearly four years hiding in the wilderness with his three children before he was killed in an exchange of fire with police on Monday\nFugitive father Tom Phillips was receiving outside help during his years on the run before he was killed in a police shoot-out this week, New Zealand police said on Wednesday as they released images that show a newly discovered campsite.\nPhillips had spent nearly four years hiding in the wilderness with his three children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio, in the central North Island, on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1a9f709fc757ff66b4c8b2cee393b6ddbe992ea9",
      "title": "Six takeaways from book of birthday messages to Epstein",
      "url": "https://www.bbc.com/news/articles/c20vw2de8y0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T02:32:48.000Z",
      "summary_90w": "",
      "raw": "The latest batch of Epstein files released by Congress give an insight into the convicted sex offender's sprawling and elite social circle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c8806bc79f439f27ac2774b287d7319b8a569d12",
      "title": "Hamas claims leadership survived Israeli attack in Doha, but confirms six deaths",
      "url": "https://www.bbc.com/news/articles/ced58zywdwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T02:06:16.000Z",
      "summary_90w": "",
      "raw": "Meanwhile, the White House says the Israeli strike \"does not advance Israel or America's goals\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Nepal anti-corruption protests explained",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T01:38:31.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned  deadly after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8fc2364c6fa80503822808df0f43f1462360bf8",
      "title": "Sources: AI training startup Mercor eyes $10B+ valuation on $450 million run rate",
      "url": "https://techcrunch.com/2025/09/09/sources-ai-training-startup-mercor-eyes-10b-valuation-on-450-million-run-rate/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T01:36:51.000Z",
      "summary_90w": "",
      "raw": "The two-year-old startup has been in discussions with investors for a Series C round.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e15d07cdec29c9330fddd7f401a970fa8d6d82f5",
      "title": "Trump says move 'does not advance Israel or America's goals'",
      "url": "https://www.bbc.com/news/articles/cx25711r8jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T00:52:21.000Z",
      "summary_90w": "",
      "raw": "The US president says he feels \"very badly\" about the location of the attack and calls Qatar a \"close ally\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2e6aa52f4c884c36ffed1ff202583bab55424a8",
      "title": "See stunning shots of Chappell Roan, Charli XCX and Doja Cat up for music photo award",
      "url": "https://www.bbc.com/news/articles/c306n1ve8y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T00:17:44.000Z",
      "summary_90w": "",
      "raw": "Abbey Road studios' nominees for its Music Photography Awards had 20,000 submissions from 30 countries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0c422100f50c5b7296cd3a56b2078cb7846e313",
      "title": "White House says US military informed Trump about Doha strikes–  as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:55:12.000Z",
      "summary_90w": "",
      "raw": "This blog has now closed. You can read our full report on the Israeli attack on Hamas leaders in Qatar here and all our reporting on Israel’s war on Gaza here\nDan Sabbagh is the Guardian’s defence and security editor\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74be2170965f824bcd846a2f56e98d9ad805ff3c",
      "title": "This 'tough guy' president says he's tackling corruption. Rivals say he's silencing opposition",
      "url": "https://www.bbc.com/news/articles/ckgqzk31qyzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T23:02:46.000Z",
      "summary_90w": "",
      "raw": "Erdogan's critics claim that he has become a latter-day Sultan in Turkey, dismantling human rights, cracking down on dissent and weaponising the courts",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de7353c9a46bb96e135017d8e31da835679c92ff",
      "title": "British jockeys, trainers and owners are on strike - why?",
      "url": "https://www.bbc.com/sport/articles/c626vk77r5ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T23:02:37.000Z",
      "summary_90w": "",
      "raw": "British horse racing is staging a one-day strike on Wednesday over a proposed rise in betting taxes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03737e7cfa351fca37c036ce88d33c01ca29a4dc",
      "title": "From mixers to pitch-offs — your brand event belongs at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/09/from-mixers-to-pitch-offs-your-brand-event-belongs-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T22:40:47.000Z",
      "summary_90w": "",
      "raw": "Each Side Event can unlock new opportunities for the hosts: investor deal flow, talent connections, and brand exposure with the startup community.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "321a54aab387992f7d616809a8ec2978fa88237d",
      "title": "Help, I have been charmed by the iPhone Air",
      "url": "https://techcrunch.com/2025/09/09/help-i-have-been-charmed-by-the-iphone-air/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T22:07:42.000Z",
      "summary_90w": "",
      "raw": "Apple's sleek iPhone Air has a powerful processor and large display, but its battery life and camera might be a problem.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dbfa6840189ef6b0abde8217328c3b41afcf0ed8",
      "title": "Abducted Israeli-Russian researcher Elizabeth Tsurkov freed in Iraq",
      "url": "https://www.bbc.com/news/articles/cx2xydl9pdjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T21:45:29.000Z",
      "summary_90w": "",
      "raw": "A Princeton student \"tortured for many months\" by Iraqi militia is now in the US embassy, President Trump says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a34d0b55b0d1d2f4820146fc56bd47558e421906",
      "title": "Why SpaceX made a $17B bet on the direct-to-cell market",
      "url": "https://techcrunch.com/2025/09/09/why-spacex-made-a-17b-bet-on-the-direct-to-cell-market/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T21:44:20.000Z",
      "summary_90w": "",
      "raw": "The deal is the most aggressive signal yet that SpaceX wants to rule the satellite-to-phone market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf4a56d44ef7fdeb4cd2eccd77400c36a6c59d82",
      "title": "First two Brazilian judges vote to convict Jair Bolsonaro in coup plot trial",
      "url": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T21:30:45.000Z",
      "summary_90w": "",
      "raw": "Three more supreme court justices to cast their votes in coming days, with verdict expected by Thursday\n\n‘He’s always on the attack’: the Brazilian judge prosecuting Bolsonaro inspires both love and hate\n\nJair Bolsonaro led a criminal organisation that sought to plunge Brazil back into dictatorship with a murderous power grab involving special forces assassins and a vast disinformation campaign, the supreme court judge presiding over the former president’s trial has claimed as he voted for Bolsonaro’s conviction.\nAlexandre de Moraes was the first supreme court justice of five to announce his decision on Tuesday, as the trial of Bolsonaro and seven alleged co-conspirators – including four senior members of the military and the former head of Brazil’s answer to MI6 – entered its final stretch.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e970153e0a8833cb3ab7905dd82e0bea6daf83eb",
      "title": "I want to love Apple’s new iPhone Air, but the iPhone 17 is a better deal",
      "url": "https://techcrunch.com/2025/09/09/i-want-to-love-apples-new-iphone-air-but-the-iphone-17-is-a-better-deal/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T21:21:14.000Z",
      "summary_90w": "",
      "raw": "I was within a heartbeat of preordering the new iPhone Air. But a closer looks at the specs changed my mind.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "198630dd44b630000875484fd779bafc90eaba77",
      "title": "Starmer to meet Israel's president in Downing Street",
      "url": "https://www.bbc.com/news/articles/cly9jgmgqe8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T21:10:49.000Z",
      "summary_90w": "",
      "raw": "The PM will stress the \"the action Israel must take to end the horrific suffering\" in Gaza, No 10 said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af0bd3238973b03e67bcd48cf2d3be2573adb540",
      "title": "Pressure mounts on Bolsonaro as two out of five judges find him guilty",
      "url": "https://www.bbc.com/news/articles/ceq2lv20rp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:54:49.000Z",
      "summary_90w": "",
      "raw": "The Brazilian ex-president is accused of plotting a coup to cling to power, which he denies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "147efeea67aea93f276f37a14b2d4fea1b8c886f",
      "title": "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535813/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:47:28.000Z",
      "summary_90w": "",
      "raw": "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4594d1aba0cfe8215d7c138089f20cd34937c619",
      "title": "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535806/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:43:10.000Z",
      "summary_90w": "",
      "raw": "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e91d45d92e13eeac88ffa27aa92e3fb153140722",
      "title": "Russian air strikes get deadlier and bigger, hitting Ukraine's very heart",
      "url": "https://www.bbc.com/news/articles/cgrqwpee05ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:20:36.000Z",
      "summary_90w": "",
      "raw": "Ukraine says Russia deliberately hit the main government building in Kyiv with a missile last Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c81a9c1c15a710e7d5c0c66b64ccc8df019ef3c",
      "title": "Apple’s creator-centric iPhone 17 Pro will make the vlogging camera obsolete",
      "url": "https://techcrunch.com/2025/09/09/apples-creator-centric-iphone-17-pro-will-make-the-vlogging-camera-obsolete/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T20:18:25.000Z",
      "summary_90w": "",
      "raw": "The iPhone camera has long checked all the boxes for anything that a casual user might need, making a digital camera obsolete for most consumers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e7d2f29e26637ce4c23acfcd8c9663e5b1ba977a",
      "title": "Israel Strikes Hamas In Qatar",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1tc3m?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:07:00.000Z",
      "summary_90w": "",
      "raw": "Hamas says six people killed in air strike but its leadership team survived.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab57dffe2f1e167f72af1643fea1f785c951095c",
      "title": "Bowen: Diplomacy in ruins after Israel strikes Hamas leaders in Qatar",
      "url": "https://www.bbc.com/news/articles/cm2zepgp5neo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T19:06:52.000Z",
      "summary_90w": "",
      "raw": "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab57dffe2f1e167f72af1643fea1f785c951095c",
      "title": "Jeremy Bowen: Diplomacy in ruins after Doha strike",
      "url": "https://www.bbc.com/news/articles/cm2zepgp5neo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T19:06:52.000Z",
      "summary_90w": "",
      "raw": "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What's in the book of birthday messages to Epstein",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T18:08:42.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e8da303c0ae690bcabf79ae59862e52da45f4e2",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "url": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:45:02.000Z",
      "summary_90w": "",
      "raw": "Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged\nA Canadian beekeeper has described fending off thousands of “robber bees” as they raided her shop in a brazen attempt to steal honey.\nChristine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07b34831be5e4cb07a32f4935262aa84c1d532e",
      "title": "A government building struck in Kyiv and a new threat from Trump",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1srdr?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:39:00.000Z",
      "summary_90w": "",
      "raw": "Trump says he'll respond after Ukraine's main cabinet building was hit",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73f065a0ff97169913df5471d003c050292c6048",
      "title": "More than a dozen robbers storm jewellery shop in California",
      "url": "https://www.bbc.com/news/videos/c1edl9qppelo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T17:11:04.000Z",
      "summary_90w": "",
      "raw": "An 88-year-old jewellery store owner in San Jose is recovering after being assaulted during a violent smash-and-grab robbery.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d8367446560e74fd3d933da3af90ca689377839",
      "title": "CCTV captures moment of attack",
      "url": "https://www.bbc.com/news/videos/c1dq39204wro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:44:34.000Z",
      "summary_90w": "",
      "raw": "Qatar, which has mediated indirect negotiations between Israel and Hamas, calls the attack a \"blatant violation\" of international law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23860b3f9f961d5b7f8a07f1a387073adbdf2088",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "url": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:19:28.000Z",
      "summary_90w": "",
      "raw": "Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts\nEthiopia has inaugurated Africa’s largest hydroelectric dam, a project that could transform the country’s energy sector but may also aggravate tensions with neighbouring Egypt.\nState media showed the Ethiopian prime minister, Abiy Ahmed, touring the site of the Grand Ethiopian Renaissance Dam (GERD) in Guba district with the Kenyan president, William Ruto, the Somali president, Hassan Sheikh Mohamud, and the African Union chairperson, Mahmoud Ali Youssouf.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b6c653830a09a7b83e60d235b433366ef9d4cb9",
      "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
      "url": "https://www.bbc.com/news/articles/cr4qx6377qgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T15:33:01.000Z",
      "summary_90w": "",
      "raw": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b7bbe56c335a5284801381e0fb0268841ce0acb",
      "title": "'The Office' creators deliver 'The Paper,' a sharp mockumentary about journalism",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535137/the-office-creators-deliver-the-paper-a-sharp-mockumentary-about-journalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:54:18.000Z",
      "summary_90w": "",
      "raw": "The issues facing journalism these days — from online clickbait to corporate interference — run throughout The Paper. But it's primarily a comedy, with characters and actors that will win you over.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows annual hiring was overstated by 911,000 jobs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dca2ecd0afbc054bf1d12216cba5a31ed1155838",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "url": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:16:54.000Z",
      "summary_90w": "",
      "raw": "ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery\nAn international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.\nThe ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.\nReuters and Agence France-Presse contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32db2407a94e414f83c0b83b96fc7c1cdc34389d",
      "title": "White House denies Trump's alleged birthday message to Epstein is authentic",
      "url": "https://www.bbc.com/news/articles/cvgqnn4ngvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T12:48:55.000Z",
      "summary_90w": "",
      "raw": "The message purportedly written by Trump is inside a 238-page book released by a House committee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b3984b0d0eb2e510cdc51e291e349ccf3bdaca9",
      "title": "Israeli military orders all Gaza City residents to evacuate ahead of ground assault",
      "url": "https://www.bbc.com/news/articles/cvg47kvld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:48:49.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Netanyahu says recent strikes on high-rises are \"only the beginning of the main, intensive operation\" to capture the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1097d90ff1d8a06a7f69bf485cef26b33abb0a4a",
      "title": "Here's what happens when private equity buys homes in your neighborhood",
      "url": "https://www.npr.org/sections/planet-money/2025/09/09/g-s1-87699/private-equity-corporate-landlords",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T11:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes rents go down and neighborhood diversity go up? Corporate landlords. But they also make it harder to own for yourself.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e04a43f51845386c2aa2ce3b2add249a232808b5",
      "title": "Boris Johnson was paid £240,000 after Maduro meeting, invoice shows",
      "url": "https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:12:48.000Z",
      "summary_90w": "",
      "raw": "Johnson’s office sent invoice to hedge fund manager, which was paid, weeks after meeting Venezuelan leader last year\n\nRevealed: how Boris Johnson traded PM contacts for global business deals\n\nFrom a private jet somewhere over the Caribbean Sea in February last year, Boris Johnson called his old political adversary David Cameron, then the foreign secretary, to notify him of a visit.\nJohnson had taken a day out from a family holiday in the Dominican Republic for an unlikely meeting with the leftwing president of Venezuela, Nicolás Maduro, a man whom Johnson, when in office, had likened to a “dictator of an evil regime”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "Why the French PM had to go and what happens next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T17:18:52.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has lost a confidence vote, sending parliament into another period of chaos and uncertainty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a17d725e28af25ca18a225e04e46ddd1a9a797a8",
      "title": "Watch: Glitz, glamour and emotional speeches at VMAs 2025",
      "url": "https://www.bbc.com/news/videos/crl5ngr2069o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:04:06.000Z",
      "summary_90w": "",
      "raw": "The MTV Video Music Awards (VMAs) have taken place in New York, with high profile figures in the music industry taking to the red carpet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}