{
  "version": "1757974448306",
  "generatedAt": "2025-09-15T22:14:08.306Z",
  "items": [
    {
      "id": "939710fa784712adeaa5bc384ae951a8ae7483f4",
      "title": "Musk's language while addressing rally was abhorrent, says home secretary",
      "url": "https://www.bbc.com/news/articles/c0m4rz0pvmno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T22:01:40.000Z",
      "summary_90w": "",
      "raw": "Shabana Mahmood says the tech billionaire \"doesn't get to mess with British democracy\" after Musk calls for dissolution of Parliament.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a510821bddac3e95088f59b4be4b6cebe158182",
      "title": "The best Xbox controller to buy right now",
      "url": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T22:00:00.000Z",
      "summary_90w": "",
      "raw": "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing between several high-quality controllers from Microsoft as well as a plethora of great options from the likes of 8BitDo, PowerA, Razer, Scuf, GameSir, Nacon, and Turtle Beach. Some of them have drift-resistant Hall effect or TMR-based joysticks for improved longevity, yet all of them are good for one reason or another. The days of the cheap “little sibling” controller that looked cool, but barely worked, are over.\nWe’ve spent a ton of time playing all kinds of games (first-person shooters, fighters, third-person action-adventure, racing, indie roguelikes, etc.) to test a wide swath of Xbox controllers, and it may not be a surprise that the standard, Xbox Wireless Controller is the best option for most folks. It makes for a great PC and Steam Deck controller, too. The default Xbox gamepad strikes the right balance of quality, comfort, versatility, and price, but there are several alternatives worth considering.\nFeatured in this article\nBest overall: Xbox Wireless Controller\nThe official Xbox Wireless Controller has a dedicated share button for saving clips and screenshots and sharing them online, Bluetooth support, and a USB-C port for charging up Microsoft’s play-and-charge rechargeable battery.\n\nWhere to Buy:\n\n $64.99 $49.95 at Amazon\n $64.99 $49.95 at Walmart\n $59.99 at GameStop\n\nBest budget option: 8BitDo Ultimate Wired Controller for Xbox\nThe latest 8BitDo Ultimate Wired Controller for Xbox includes Hall effect analog sticks and triggers, plus two rear buttons, customizable mapping and sensitivity, and compatibility with PC and mobile devices.\n\nWhere to Buy:\n\n $44.99 $29.99 at 8BitDo\n $44.99 $33.74 at Amazon\n $44.99 $35.99 at Best Buy\n\n\n\n\n\n\nThe best Xbox controller for most people\nThe best cheap Xbox controller\nThe best “pro” Xbox controller\nA formidable alternative to the Elite\nAn affordable alternative to the Elite\nOther Xbox controllers we tested\nWhat’s coming next?\n\nThe best Xbox controller for most people\nXbox Wireless Controller\n\n\n\nProsCons\n\n\nIncredible value for Xbox Wireless support\nGreat ergonomic design\nSatisfying buttons and triggers\n\nLacks customization\nRequires AA batteries (or an optional rechargeable cell)\n\n\n\nWhere to Buy:\n\n $64.99 $49.95 at Amazon\n $64.99 $49.95 at Walmart\n $64.99 $59.99 at GameStop\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Power: AA batteries or add-on rechargeable\nOkay, I already know what you’re thinking. “The best controller for Xbox is the one that comes with the Xbox?” That may seem like a no-brainer, but this standard controller truly does earn this title as the best. It lacks some extras found on pricier options, but this controller is the distillation of all that has made the last 20 years of Xbox gamepads great, and it shows.\nThanks to Microsoft’s proprietary wireless protocol, this is the only affordable wireless Xbox controller out there. (Third-party wireless options have been trickling out in recent years, but they’re mostly at the high end.) While some hate the standard Xbox wireless controller for its use of AA batteries instead of a built-in rechargeable cell, that also means it’s flexible, allowing for rechargeable AAs or a battery pack. And user-replaceable batteries mean you’re not stuck with a controller that doesn’t hold its charge after years of use. It also works over a USB-C wired connection.\nBut the standard-issue Xbox pad isn’t just great because of its varied connectivity. The hardware itself is excellent for the controller’s $65 (and often less) asking price. The sticks, buttons, triggers, and the sunken dish-shaped D-pad all feel impeccably tight, with the latter having a satisfying clickiness to it. If you’re a hardcore fighting game fan, you’ll probably be best served by a dedicated fight stick or a controller geared toward that genre — one with a superb D-pad like Hori’s Horipad Pro — but the Xbox Wireless Controller is otherwise an extraordinary jack-of-all-trades.\nThe only things it really lacks compared to pricier options are extra, customizable buttons and software tuning for things like stick sensitivity (button remapping is available), though Microsoft does offer cosmetic customization through its Xbox Design Lab, which bumps the price from $79.99 to $124.93 depending on the configuration. There’s a lot to love about these controllers, whether you make your own or pick one from the many colors that Microsoft offers.\nThe best cheap Xbox controller\n8BitDo Ultimate Wired Controller for Xbox\n\n\n\nProsCons\n\n\nInexpensive\nLightweight and comfortable\nSatisfying buttons and Hall effect components\nProgrammable back buttons are easy to press\n\nLacks trigger stops\n\n\n\nWhere to Buy:\n\n $44.99 $29.99 at 8BitDo\n $44.99 $33.74 at Amazon\n $44.99 $35.99 at Best Buy\n\nConnectivity: Wired / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Wired\nThe 8BitDo Ultimate Wired Controller for Xbox is a fantastic budget model that typically retails for $44.99 but can often be found for as little as $29.99. The shape is reminiscent of Nintendo’s Switch Pro Controller, only a bit smaller, with hints of Xbox influence and a curvaceous design that feels great to hold.\nOn the hardware front, the Ultimate Wired Controller features Hall effect sticks with satisfying tension. It also uses Hall effect triggers with dedicated vibration motors, though it lacks trigger stops, unlike our previous budget pick, the PowerA Advantage Wired. Its D-pad, face buttons, and bumpers are nice and clicky, too, despite being smaller than we’d typically like. It has two rear paddles, remappable buttons, and the ability to save up to three profiles, which you can switch between on the fly using a dedicated button. There’s even a built-in mute switch for audio, which isn’t common on cheaper controllers. You can download the 8BitDo Ultimate Software X app on PC or Xbox to fully customize this controller.\nThe 8BitDo Ultimate Wired works as a wired controller with your PC, but if you prefer wireless connectivity, the company also makes a three-mode wireless version for $69.99 with support for both Bluetooth and 2.4GHz wireless (via a dongle). The wireless version is a bit more expensive, however, and it’s still limited to wired connectivity on Xbox consoles. \nThe best “pro” Xbox controller\nXbox Elite Wireless Controller Series 2\n\n\nScore: 8.5\n\nProsCons\n\n\nExtensive modular customization\nPremium look and feel\nRechargeable battery lasts an incredible 40 hours\n\nPricey\nQuestionable quality control\nNo Hall effect components\n\n\n\nWhere to Buy:\n\n $179.99 $153 at Walmart\n $199.99 $157.95 at Microsoft\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Up to four / Software customization: Yes / Power: Built-in rechargeable\nThe Xbox Elite Wireless Controller Series 2 is Microsoft’s fanciest controller, and it’s got a lot of nice extras, like better build quality, extra buttons, user-swappable sticks and D-pad, a built-in rechargeable battery, and loads of software customization. Where the standard Xbox controller is constructed entirely of unassuming plastic, the Elite mixes higher quality soft-touch plastic, rubberized grips, and metallic touches for a superior fit and finish. This makes it heftier than the stock controller, and as a result, it just feels nicer in your hands. It also comes with a charging dock and zip-up case with passthrough charging, completing a really nice package for $199.99 (or sometimes less, if it’s on sale). \nThere’s also the stripped-down Elite Series 2 “Core” version with an MSRP of $149.99, which ditches the add-ons but is equally customizable. You can buy them separately in a $59.99 accessories pack, but you’ll end up paying more that way, barring sales or discounts.\nA pricey controller like an Xbox Elite is a bit of a splurge purchase. Most of us are not competing at e-sports levels that require its high-end features. Nevertheless, it’s fun to use something that feels nicer, offers ways to custom-tailor it to your liking, and maybe gives you a slight competitive edge thanks to features like hair triggers and removable rear paddles. In theory, you may be able to get shots off faster in an online shooter with the hair triggers, and you can map the paddles to functions like jump, crouch, reload, etc., while keeping your thumb on the right stick. You could teach yourself claw grip to accomplish the latter with even a cheap wired controller, sure, but it just won’t feel as cool or easy as when using an Elite.\nWhile the Elite is still a great controller in 2025, you should keep in mind that it’s been around since 2019 and a Series 3 revision is feeling long overdue. The Series 2 also has a bit of a reputation for lackluster quality control — with horror stories from users about going through multiple replacements under warranty. Microsoft extended the controller’s warranty from 90 days to a year in late 2020 to help address concerns, but buying an Elite Series 2 may still feel like a slightly risky proposition. It also predates the current-gen implementation of a dedicated Share button, and its potentiometer-based sticks run the risk of stick drift after long-term use (something third parties are addressing with controllers that use drift-free Hall effect sticks, unlike all three big console manufacturers). \nEven so, the Elite 2 remains by far the most well-rounded option for a step-up Xbox controller — thanks in large part to its impressive build and expansive software experience. If all these caveats give you pause, though, there is another promising option.\nRead our Xbox Elite Wireless Controller Series 2 review.\nA formidable alternative to the Elite\nRazer Wolverine V3 Pro\n\n\n\nProsCons\n\n\nSupports Xbox Wireless protocol\nHall effect sticks use replaceable tops\nFour rear buttons smartly positioned for comfort\nTwo extra shoulder buttons add unique versatility\nTrigger stops and back buttons offer a satisfying mouse-like click\n\nExpensive\nRequires a USB dongle\nRazer Synapse software needs work\n\n\n\nWhere to Buy:\n\n $199.99 at Amazon\n $199.99 at Best Buy\n $199.99 at GameStop\n\nConnectivity: Wireless USB dongle (Xbox / PC), wired / Connector type: USB-C / Mappable rear buttons: Four / Software customization: Yes / Power: Built-in rechargeable\nAt $199.99, Razer’s Wolverine V3 Pro controller is as expensive (or more, depending on available deals) than the Elite Series 2, but it’s worth the cost if you want a high-end controller with drift-free sticks. Not only is the V3 Pro Razer’s first foray into using Hall effect sticks, it’s the company’s first fully wireless Xbox gamepad. It also sports some of the best hair-trigger lockouts around, yielding a mouse-like click usually found on even pricier Scuf controllers (a previous high-ranking pick of ours). \nOther than that, the V3 Pro is similar to the previous V2 Pro, with six remappable buttons — four rear paddles in new, angled orientations and two extra shoulder buttons — and some RGB lighting. The buttons and D-pad still have that satisfying micro-switch tactility and audible clickiness like the previous-gen V2 Pro, but the RGB lighting is more subtle this time around.\nThe Wolverine V3 Pro’s biggest shortcomings compared to Microsoft’s Elite Series 2 are its more basic software customization, its lack of Bluetooth, and the fact that it needs a USB dongle to work wirelessly. The V3 Pro is otherwise the better pick if you can justify its high price, which, unlike the Series 2, is rarely subjected to discounts. Luckily, if you can’t, there’s also the $99.99 Wolverine V3 Pro Tournament Edition that has a nearly identical set of features in a wired configuration.\nAn affordable alternative to the Elite\nGameSir G7 Pro\nGameSir’s G7 Pro is a wired Xbox controller with remapable rear buttons, adjustable triggers, and TMR joysticks. It can also be connected wirelessly to a PC (via a 2.4Ghz dongle) or Android (via Bluetooth).\n\nWhere to Buy:\n\n $79.99 at Amazon\n $79.99 at Best Buy\n $79.99 at Walmart\n\nConnectivity: Wired (Xbox), wireless USB dongle (PC), Bluetooth (Android)  / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Built-in rechargeable\nIf you don’t mind using a wired controller, GameSir’s G7 Pro offers some features of the splurge-worthy Xbox Elite Controller 2 for under $100. It has remappable buttons, smooth-feeling drift-resistant TMR control sticks, a satisfying weight, and textured grips that made it feel comfortable to hold even with sweaty palms.\nThe G7 Pro is actually a battery-powered wireless controller, but its cable free connectivity is limited to PC (via an included 2.4Ghz dongle) and Android (via Bluetooth). You’ll need to plug the controller into the Xbox with a cable, and GameSir provides a lengthy USB-C to USB-A cord. The cable was long enough that I could play games from my couch (roughly six feet away) without feeling tethered.\nI was impressed with the G7 Pro’s overall build quality, especially the triggers, which could be locked by flipping switches on its back. GameSir includes three swappable direction pads with the G7 Pro, which can be swapped by lifting the front of the controller’s shell and popping them in and out. However, its face buttons felt noticeably cheaper than the ones on the Elite 2, which makes sense given their price difference.  Button feel aside, the controller never dropped an input, even when I mashed buttons to string together elaborate combos in Tony Hawk’s Pro Skater, or continuously cast spells, dodged, and healed in Diablo IV. If an action was mistimed, it was on me.\nWhat the controller lacks in face button quality is more than made up for in customizability. GameSir Nexus, a free app on the Xbox Store, allowed me to remap any button (including the L4 and R4 buttons on its backside), adjust the vibration intensity of both triggers, enable two flavors of hair trigger mode, and set the deadzone for each control stick. You can save up to four profiles with different settings, and quickly switch between them by pressing the controller’s M button along with one of the face buttons. You never need to touch these options, or even download the GameSir Nexus app for the G7 Pro to work, but doing so will unlock its full potential.\nThe GameSir G7 Pro is an excellent Xbox controller, especially in its price range. I’d have liked the option to use it wirelessly, but that wasn’t a dealbreaker for me. That said, it’s something to consider depending on how far away you are from your Xbox when playing. If you’re a multi-platform gamer and want a controller to use with both an Xbox and PC (or Android device), it’s an even better choice.\nOther Xbox controllers we tested\nThe Scuf Valor Pro is the company’s first Xbox controller with Hall effect sticks, as well as its cheapest at $109.99. Scuf emulates Microsoft’s winning ergonomics while implementing redesigned remappable rear buttons (two are removable) and shoulder bumpers that are more comfortable to reach. It also has trigger stops that produce a satisfying click with next to no travel when pressed. The D-pad produces a similarly satisfying click, one we prefer over the softer tactile feel of the Instinct. The Valor Pro is not the most exciting controller on paper, but it’s a solid option for Scuf faithful or anyone who wants more durable analog sticks. Read our hands-on impressions.\nWe tested PowerA’s latest pro-style Xbox controllers, including the Fusion Pro 4 Wired ($74.99) and PowerA Fusion Pro Wireless ($159.99). They’re standard fare for pro-style controllers these days, with height-adjustable Hall effect sticks, four remappable rear buttons, three-way trigger locks, and onboard volume controls. They’re similar, but the Pro Wireless has four trippy Lumectra lighting zones that respond to your button presses. Both controllers are satisfying to use and a clear step up from PowerA’s older products in terms of overall quality, but they ultimately don’t stand out much at these price points.\nNacon’s Revolution X ($25.90) remains one of the most customizable wired controllers you can get (it even has removable weights in its handles), and its software is nearly as expansive as Microsoft’s first-party app.\nIf you’re the nostalgic type, the Hyperkin Duke ($89.99), DuchesS ($49.99), and Xenon ($49.99) are faithful wired recreations of Xbox gamepads from Microsoft’s first two console generations. They’re kind of dumb but endearing (especially the chunky Duke), but they’re unique collector pieces you can also use on modern games.\nWhat’s coming next?\nHyperkin’s Competitor controller, which it announced in January at CES, will be released in October for $49.99. The wired gamepad looks almost identical to the PlayStation 5’s DualSense controller, with a pair of analog sticks next to one another at the bottom of the controller, glassy buttons, and a non-contiguous D-pad. Hyperkin is offering the Competitor in five colors, but only the black and white controllers will be available in the US at launch.  \nUpdate, September 15th: Updated to reflect current pricing / availability, additional details about Hyperkin’s Competitor controller and added GameSir’s G7 Pro controller. Brandt Ranj also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c8b56231a9a3d0e2f12d4231b7f8a2ad9b08f456",
      "title": "Rodatherm Energy wants to make geothermal more efficient, but will it be cheaper?",
      "url": "https://techcrunch.com/2025/09/15/rodatherm-energy-wants-to-make-geothermal-more-efficient-but-will-it-be-cheaper/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T21:48:02.000Z",
      "summary_90w": "",
      "raw": "Rodatherm Energy emerged from stealth with $38 million in Series A funding. It plans to build a closed-loop geothermal power plant that uses refrigerants to move heat to the surface.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6029111fbdb7101fa9b6a60090a0869c22dcc24d",
      "title": "Australia news live: Sydney airport plans big expansion; social media giants given rules on how child ban must work",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T21:41:11.000Z",
      "summary_90w": "",
      "raw": "Sydney airport to double in size and add 14 new international gates. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nInfant dies and child seriously injured after crash in Sydney\nAn infant died and a child is in serious condition after a crash in Sydney’s south-west yesterday.\nEveryone is whispering that anyway, so I may as well just say it out loud. I’ve nailed my colours in the mast. I went on Four Corners, and I said the net zero policy is a straitjacket for our economy and our country, and I believe that. I’m actually quite passionate about it.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "807471822fbc881653f70b5ce196c5d7b39c3e37",
      "title": "Gulf leaders call on Trump to rein in Israel after Qatar emergency summit",
      "url": "https://www.theguardian.com/world/2025/sep/15/gulf-leaders-call-on-trump-to-rein-in-israel-after-qatar-emergency-summit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T21:38:01.000Z",
      "summary_90w": "",
      "raw": "Arab states say US should use its leverage and influence as they promise to ‘activate joint defence mechanisms’ \nGulf leaders meeting at an emergency summit in Qatar have called on the Trump administration to use its leverage to rein in Israel following the unprecedented Israeli attempt last Tuesday to assassinate Hamas negotiators in Doha.\nSpeaking after the meeting of the Gulf Cooperation Council (GCC), the group’s secretary general, Jasem Mohamed al-Budaiwi, said: “We … expect our strategic partners in the United States to use their influence on Israel in order for it to stop this behaviour … they have leverage and influence on Israel, and it’s about time that this leverage and influence be used.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "84bfd7f45b9b307f0d9e824e51a55860513e4a8a",
      "title": "Trump says military carried out strike on alleged Venezuelan drug cartel vessel",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T21:32:06.000Z",
      "summary_90w": "",
      "raw": "US president says three men were killed in the strike, adding that it occurred in international waters\n\nUS politics live – latest updates\n\nDonald Trump said on Monday that the United States had carried out a strike on a second Venezuelan boat and killed three alleged terrorists he claimed were transporting drugs, expanding his administration’s war against drug cartels and the scope of lethal military force to stop them.\nThe US president gave few details about the strike, saying in a social media post that the action was on his orders and that it had happened earlier in the morning. The post was accompanied by a video clip showing the boat, which appeared to be stationary, erupting into a fireball.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d75492610f9e1ab79f9bad28b6be26f61f7c2027",
      "title": "Hillsborough Law will include duty of candour ",
      "url": "https://www.bbc.com/news/articles/czrpvrrrmj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T21:30:22.000Z",
      "summary_90w": "",
      "raw": "The proposed law would force public bodies to co-operate with investigations into major disasters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3182fc45ac7521b62cff3ea64e9d1254c629219",
      "title": "Hillsborough Law - what is it and how did we get here?",
      "url": "https://www.bbc.com/news/articles/c98d930p50no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T21:30:17.000Z",
      "summary_90w": "",
      "raw": "Following the news that an agreement has been reached on the long-awaited Public Authority (Accountability) Bill, the BBC's Judith Moritz looks at its history.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f605730952359712a80a838c9eb1a47006f30c1",
      "title": "Italian skier Matteo Franzoso dies at the age of 25 after training crash in Chile",
      "url": "https://www.theguardian.com/sport/2025/sep/15/italian-skier-matteo-franzoso-dies-at-25-after-training-crash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T21:26:52.000Z",
      "summary_90w": "",
      "raw": "Franzoso suffered ‘major head trauma’ in accident\n\nLindsey Vonn: ‘This is incredibly sad … RIP Matteo’\n\nThe Italian skier Matteo Franzoso has died at the age of 25 following a crash during pre-season training in Chile at the weekend, his country’s winter sports federation (FISI) has confirmed.\nAfter suffering “a major head trauma” in the accident at the La Parva track on Saturday, Franzoso was taken by helicopter to the intensive care unit of a clinic in Santiago and placed in an induced coma. The FISI confirmed on Monday that he did not recover after “cranial trauma” and a subsequent swelling of his brain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6cd9623a9a09d20ddb32d1df65ab4370d513a85",
      "title": "With no DOJ breakup, Alphabet becomes a $3 trillion company ",
      "url": "https://techcrunch.com/2025/09/15/with-no-doj-breakup-alphabet-becomes-a-3-trillion-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T21:23:14.000Z",
      "summary_90w": "",
      "raw": "Investors continue to reward Alphabet's stock after a judge declined to break up Google earlier this month.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30e2ba68d93555e0c259ac0587e6455fedad7354",
      "title": "5 new members added to CDC vaccine advisory panel ahead of key meeting ",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/15/nx-s1-5542390/cdc-vaccine-advisers-committee",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T21:04:32.000Z",
      "summary_90w": "",
      "raw": "Health Secretary Robert F. Kennedy Jr. picks more new vaccine advisers to the Centers for Disease Control and Prevention, days before a two-day meeting to consider COVID and hepatitis B shots.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f8e7e98cf47162095bcef6e4088429cea341853",
      "title": "Here are the best AirPods deals you can get right now",
      "url": "https://www.theverge.com/21302051/best-apple-airpods-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T21:03:35.000Z",
      "summary_90w": "",
      "raw": "The latest AirPods Pro 3 aren’t yet on sale, but their predecessor is. | Photo: Chris Welch / The Verge\t\n\nIf you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, though you can still find great deals throughout the year.\n \n\nThe best AirPods 4 deals\nThe best AirPods Pro (third-gen) deals\nThe best AirPods Max deals\n\nBelow, we’ve rounded up the best deals currently available on each model, including both iterations of the AirPods 4, the latest AirPods Pro, and the AirPods Max. \nThe best AirPods 4 deals\nApple AirPods 4\n\nWhere to Buy:\n\n $129 $116 at Amazon\n $129 $116 at Walmart\n $129.99 $119 at Best Buy\n\n\nAirPods 4 with Active Noise Cancellation\n\nWhere to Buy:\n\n $179 $168.99 at Amazon\n $179 $168.99 at Walmart\n $179.99 $172 at Best Buy\n\nAt its September 2024 event, Apple introduced the AirPods 4, a pair of wireless earbuds available in two variations: a $129 standard model and a $179 noise-canceling model. Both versions represent significant upgrades over the third-gen AirPods, with a more comfortable design and improved audio performance. They’re also better for taking calls thanks to Apple’s Voice Isolation feature, which focuses the mics on your voice so you can be heard more clearly in noisy environments.\nThe $179 AirPods 4 with Active Noise Cancellation offer a surprisingly effective noise-canceling mode, a helpful transparency mode, and several other Pro-level features. The latest AirPods Pro do a better job of tuning out noise, but the AirPods 4 with ANC still do a good job of reducing sound. They also feature other perks formerly reserved for Apple’s top-of-the-line earbuds, including wireless charging and a case with a built-in speaker that allows you to easily track it down via Apple’s Find My app.\nGiven they’ve been out for nearly a year, we consistently see discounts on both versions of the AirPods 4. Right now, for instance, the standard AirPods 4 are on sale at Amazon and Walmart for $116 ($13 off), which is $27 shy of their all-time low. The AirPods 4 with ANC, meanwhile, are available at Amazon and Walmart for their typical sale price of $168.99 (also $10 off), which is a far cry from their Prime Day low of $119.\nRead our full AirPods 4 review.\nThe best AirPods Pro (third-gen) deals\nAirPods Pro 3\nThe third-gen AirPods Pro add a new built-in heart rate sensor and live translation feature. They also improve upon their predecessor with twice the noise cancellation, better sound, and a fifth swappable ear tip option.\n\nWhere to Buy:\n\n $249 at Amazon\n $249 at Best Buy\n $249 at Walmart\n\nAt its recent “Awe Dropping” event, Apple introduced the new AirPods Pro 3. In addition to improved noise cancellation and sound, the earbuds now include a built-in heart rate sensor that syncs with the iPhone Fitness app to track your pulse and calories burned across more than 50 workout types — essentially doubling as a fitness tracker. They’re also more comfortable and secure than their predecessor, thanks to a redesigned, more angled fit and five ear tip sizes, including a new XXS option. On top of that, they carry a more robust  IP57 rating for dust, water, and sweat resistance and debut a live translation feature that generally conveys the gist well, though with enough errors that it can’t beat a human interpreter.\nBecause the AirPods Pro 3 are brand new and won’t hit shelves until September 19th, there aren’t any deals available yet. For now, you can only pick them up at their full $249 price from Amazon, Best Buy, and Walmart.\nRead our full AirPods Pro 3 review.\nApple AirPods Pro (second-gen) with USB-C charging case\n\nWhere to Buy:\n\n $249 $199 at Amazon\n $249 $199 at Walmart\n $249.99 at Best Buy\n\nHowever, if you’re looking to save, the second-gen AirPods Pro with USB-C remain a solid option and are still widely available despite no longer being part of Apple’s official lineup. They’re currently available at Amazon and Walmart for $199 ($50 off), which is their typical sale price and a relatively minor discount compared to previous sales. While they lack the AirPods Pro 3’s heart rate sensor, live translation feature, and new XXS ear tips, the second-gen AirPods Pro still deliver excellent noise cancellation that outperforms the first-gen model. They also add swipe-based controls and an extra-small fourth ear tip. Apple additionally updated them in 2023 with a USB-C charging case and an upgraded IP54 rating for water and dust resistance, while the latest version also supports lossless audio when used with Apple’s Vision Pro headset and doubles as a pair of FDA-approved hearing aids.\n\n\n\nRead our AirPods Pro with USB-C impressions.\nThe best AirPods Max deals\nApple AirPods Max\n\nWhere to Buy:\n\n $549 $499.99 at Amazon (USB-C)\n $549 $499.99 at Walmart (USB-C)\n $549 $499.99 at Best Buy (USB-C)\n\nThe AirPods Max aren’t the iconic in-ears that have become synonymous with the AirPods name. They’re large and luxurious, comprised of aluminum, steel, and mesh fabric that remains comfortable during extended listening sessions. They also sport excellent noise cancellation, Apple’s spatial audio feature, and expansive, balanced sound, even if they lag behind some of their peers when it comes to bass response and features. They’re not the best noise-canceling headphones for most people — blame the sticker price — but it’s hard to find a better pair of Bluetooth headphones if you’re an iPhone user.\nToward the end of last year, Apple replaced the first-gen Max with a new model that features support for USB-C charging and a few new color options. As of this writing, they’re on sale at Amazon, Best Buy, and Walmart in select colors starting at $499.99 ($50 off), which isn’t nearly as low as the $399 asking price we saw during Prime Day.\nRead our original AirPods Max review.\nUpdate, September 15th: Updated to reflect current pricing / availability and to mention the new AirPods Pro 3.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf1959e95c53db7f79f4c02808d5a1630218cd63",
      "title": "Facebook gave our data to Cambridge Analytica and all I got was this $38.36",
      "url": "https://www.theverge.com/tech/778472/facebook-gave-our-data-to-cambridge-analytica-and-all-i-got-was-this-38-36",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T20:59:46.000Z",
      "summary_90w": "",
      "raw": "Remember back in 2023, when we told you how to get your cut of a $725 million class action settlement? A couple of years later, that money is going out.\nI received an email earlier this week saying my claim had been approved in In re: Facebook, Inc. Consumer Privacy User Profile Litigation, a class action settlement that covered anyone who had a Facebook account between 2007 and 2022. The agreement settled a variety of privacy accusations against Facebook (now Meta), including that it allowed Cambridge Analytica and others to improperly access user data. Earlier today I got the money through PayPal: a total of $38.36. A few other Verge staf …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4994b4856888b010dbc2d1cc01cffa8b224c62d8",
      "title": "First group of children from Gaza arrive in UK for life-saving NHS treatment",
      "url": "https://www.theguardian.com/world/2025/sep/15/first-group-of-children-from-gaza-arrive-in-uk-for-life-saving-nhs-treatment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T20:46:05.000Z",
      "summary_90w": "",
      "raw": "Care and support package, including housing, will help 30-50 young Palestinians for an initial two years\nThe first group of children from Gaza have arrived in the UK for specialist life-saving treatment on the NHS, the Guardian understands.\nYvette Cooper, the foreign secretary, informed the parliamentary Labour party on Monday evening about the news. On arrival in the UK, the patients and their families have been granted access to NHS treatment, appropriate housing and comprehensive support services for an initial two-year period.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9aabd502037a29c365488a57d2706ec178d539fb",
      "title": "Divergent raises $290M to expand production of specialized military parts",
      "url": "https://techcrunch.com/2025/09/15/divergent-raises-290m-to-expand-production-of-specialized-military-parts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:39:23.000Z",
      "summary_90w": "",
      "raw": "Divergent Technologies' new round will help the company expand its manufacturing footprint across the U.S.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e1254be8121c873a7ef6c4f3d607027e1d4da515",
      "title": "Eden Project architect Sir Nicholas Grimshaw dies",
      "url": "https://www.bbc.com/news/articles/cj079z4lgn4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T20:33:03.000Z",
      "summary_90w": "",
      "raw": "The architect is remembered as having \"endless curiosity about how things are made\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ad9214823cfd04c43105d40546694c877a121a8",
      "title": "US destroys alleged Venezuelan drug boat, killing three",
      "url": "https://www.bbc.com/news/articles/cx2jel4gyezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T20:31:06.000Z",
      "summary_90w": "",
      "raw": "The attack came after the Venezuelan president said Caracas would defend itself against US \"aggression\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49c3e141e936b87d24aa9bcf64b86b1537622bde",
      "title": "Robinhood plans to launch a startups fund open to all retail investors ",
      "url": "https://techcrunch.com/2025/09/15/robinhood-plans-to-launch-a-startups-fund-open-to-all-retail-investors/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:22:16.000Z",
      "summary_90w": "",
      "raw": "The “Robinhood Ventures Fund I” is intended to allow any retail investor to make money on startups, but the details are scant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d8e6bd9aea55bd102738758bb098e710e73281f5",
      "title": "The 9 most sought-after startups from YC Demo Day",
      "url": "https://techcrunch.com/2025/09/15/the-9-most-sought-after-startups-from-yc-demo-day/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:11:51.000Z",
      "summary_90w": "",
      "raw": "We asked YC-focused investors to name the startups from the Summer 2025 batch that generated the most interest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb97c5b2f3738ed9b4cd571c26923f860fa802b4",
      "title": "Company that owns Gucci, Balenciaga, other brands confirms hack",
      "url": "https://techcrunch.com/2025/09/15/company-that-owns-gucci-balenciaga-other-brands-confirms-hack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:03:09.000Z",
      "summary_90w": "",
      "raw": "Kering said the hackers did not steal credit card numbers and that it has contacted the customers whose data is part of the breach, without saying how many were affected.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "178270cec200de03e445b4d1a9eb52ff65ad3afb",
      "title": "Do startups still need Silicon Valley? Founders and funders debate at TechCrunch Disrupt 2025.",
      "url": "https://techcrunch.com/2025/09/15/do-startups-still-need-silicon-valley-hear-from-the-founders-and-funders-challenging-old-assumptions-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:00:00.000Z",
      "summary_90w": "",
      "raw": "Does Silicon Valley still give founders an edge? At TechCrunch Disrupt 2025 (Oct 27–29, SF), Anh-Tho Chuong (Lago), David Hall (Revolution), and Tawni Nazario-Cranz (SignalFire) debate whether location still drives startup success.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "48420a56651552b90ef35fd380fe94eb0f64bbac",
      "title": "The Supreme Court is Google’s last hope to avoid an Epic reckoning in October",
      "url": "https://www.theverge.com/news/778332/google-epic-play-store-lawsuit-30-days-supreme-court",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T19:56:24.000Z",
      "summary_90w": "",
      "raw": "The Ninth Circuit Court of Appeals is done with its role in the Epic Google case, and Google won’t be happy with the result. On Friday, the court completely denied its petition to have its Epic v. Google case re-heard — and pressed play on a permanent injunction that will force Google to begin cracking open its Android app store.\nUnless or until the US Supreme Court decides to hear the case, Google will be forced to let developers bypass its Google Play Billing app store payment system, and let them link to outside app store downloads, within 30 days. And that’s just the start. Google will also be forced to carry rival app stores inside the Google Play Store and share its full catalog of apps with those stores by summer 2026 unless the Supreme Court grants a stay.\nEpic already won its case at the Ninth Circuit on July 31st, when a three-judge panel decided not to overturn the unanimous jury verdict from 2023 that Google’s app store and payment systems had become illegal monopolies. But Google argued that the Supreme Court might see things differently, and asked for what’s called an “en banc” review where the whole Ninth Circuit weighs in. \nBut not a single additional Ninth Circuit judge wanted to re-hear the case, the court wrote on Friday, denying Google’s petition. And with that, the Ninth Circuit also restarted the clock on forcefully cracking open Android, giving the company a new deadline of just 30 days to begin complying, and 10 months until Google must open up its app store to rivals. That’s up from 14 days and 8 months previously.\nSo, what must Google do by October? Here’s the TL;DR:\nStop Google from forcing app developers to use Google Play Billing\nLet Android developers tell users about other ways to pay from within the Play Store\nLet Android developers link to ways to download their apps outside of the Play Store\nLet developers set their own prices\nStop sharing money or perks with phonemakers, carriers, and app developers in exchange for Google Play exclusivity or preinstallation\nWork with Epic to resolve any disputes as Google builds a system to let rival app stores in\nDon’t take my word for it; here’s the full text directly out of Judge Donato’s original permanent injunction for the parts that now have a 30-day deadline:\n4. For a period of three years ending on November 1, 2027, Google may not share revenue generated by the Google Play Store with any person or entity that distributes Android apps, or has stated that it will launch or is considering launching an Android app distribution platform or store.\n5. For a period of three years ending on November 1, 2027, Google may not condition a payment, revenue share, or access to any Google product or service, on an agreement by an app developer to launch an app first or exclusively in the Google Play Store.\n6. For a period of three years ending on November 1, 2027, Google may not condition a payment, revenue share, or access to any Google product or service, on an agreement by an app developer not to launch on a third-party Android app distribution platform or store a version of an app that includes features not available in, or is otherwise different from, the version of the app offered on the Google Play Store.\n7. For a period of three years ending on November 1, 2027, Google may not condition a payment, revenue share, or access to any Google product or service, on an agreement with an original equipment manufacturer (OEM) or carrier to preinstall the Google Play Store on any specific location on an Android device.\n9. For a period of three years ending on November 1, 2027, Google may not require the use of Google Play Billing in apps distributed on the Google Play Store, or prohibit the use of in-app payment methods other than Google Play Billing. Google may not prohibit a developer from communicating with users about the availability of a payment method other than Google Play Billing. Google may not require a developer to set a price based on whether Google Play Billing is used.\n10. For a period of three years ending on November 1, 2027, Google may not prohibit a developer from communicating with users about the availability or pricing of an app outside the Google Play Store, and may not prohibit a developer from providing a link to download the app outside the Google Play Store.\n13. Within thirty days of the date of this order, the parties will recommend to the Court a three-person Technical Committee. Epic and Google will each select one member of the Technical Committee, and those two members will select the third member. After appointment by the Court, the Technical Committee will review disputes or issues relating to the technology and processes required by the preceding provisions. If the Technical Committee cannot resolve a dispute or issue, a party may ask the Court for a resolution. The Technical Committee may not extend any deadline set in this order, but may recommend that the Court accept or deny a request to extend. Each party will bear the cost of compensating their respective party-designated committee member for their work on the committee. The third member’s fees will be paid by the parties in equal share.\nWe have asked Google to confirm or deny whether it will remove the requirement for Google Play Billing, allow other payment methods, and let developers link outside the Play Store by October. I’ve also asked both Epic and Google to confirm whether they’re now working together on that joint Technical Committee. Neither company immediately responded to our requests for comment.\nSo far, Epic CEO Tim Sweeney has tweeted: “Now Google Play has 30 days to free ALL DEVELOPERS to offer competing payments in the USA — as Apple is required to do — free of scare screens, junk fees, and restrictions!” and “With super strong precedent in Epic v Apple, there’s no room for malicious compliance this time.” He also suggested that Epic doesn’t oppose Google’s new Android developer verification requirements in principle, but “we do oppose any use of such verification processes to block, stifle, or tax competing stores.”\nGoogle has not yet said whether it will appeal to the Supreme Court, and we’ve asked about that as well. According to the Ninth Circuit, Google said that if it did appeal, it would do so within 45 days. \nHere’s the Ninth Circuit’s latest decision:",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa98abf78dadac074c05faf25aae9673b67b272a",
      "title": "JD Vance hosts 'The Charlie Kirk Show,' paying tribute with top White House officials",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542176/jd-vance-charlie-kirk-show",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T19:51:28.000Z",
      "summary_90w": "",
      "raw": "The broadcast was a striking reminder of Kirk's influence, both as a leader in the young conservative space and a behind-the-scenes political player who helped shape President Trump's agenda.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71ccee1da1eeea8fd7637927f8a6734f2fe8960b",
      "title": "Boy, 15, dies after stabbing in Manchester",
      "url": "https://www.bbc.com/news/articles/ce3y9v8e7eqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T19:50:14.000Z",
      "summary_90w": "",
      "raw": "Police got reports of a \"disturbance\" in the area and found the teenager with stab wounds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "833cf00f0e7e352619c93b7093dc27b29b346815",
      "title": "Charlie Kirk suspect linked to crime scene by DNA, says FBI chief",
      "url": "https://www.bbc.com/news/articles/c203qgn61geo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T19:26:54.000Z",
      "summary_90w": "",
      "raw": "Kash Patel says Tyler Robinson's DNA was found on towel wrapping suspected murder weapon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T19:19:26.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform' s American operations, according to the US treasury secretary.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b78db30f3c655ea8d83ab07e408b0282b0af483",
      "title": "Meta leaks its new smart glasses with a display",
      "url": "https://www.theverge.com/news/778354/meta-smart-glasses-display-ray-ban-oakley-sphaera-connect",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T19:13:46.000Z",
      "summary_90w": "",
      "raw": "An unlisted and now-removed video from Meta showed off a new pair of Ray-Ban branded smart glasses with a display and a wristband to help control them, as reported by UploadVR. The video also features a new pair of wraparound “Sphaera” Oakley smart glasses with a camera on the nose, meaning that Meta itself may have inadvertently leaked two of its biggest announcements from its Connect event this week.\nFor the glasses with a display, the video includes branding that says “Meta | Ray-Ban” and “Display,” so perhaps Meta will call them the Meta Ray-Ban Display. Based on a brief clip included in UploadVR’s article, the actual display is in the right lens of the glasses, and the clip shows how the glasses will let you do things like ask Meta AI a question, look at a map on the glasses to help you navigate, translate a sign, or use your hand with the wristband to “write” a reply to a chat.\nEarlier this year, CNBC reported that the wristband for Meta’s codenamed “Hypernova” glasses with a display would use surface electromyography (sEMG) technology to interpret signals from hand movements to help you control the device, so the clip is presumably showing that tech in action.\nMeta CEO Mark Zuckerberg will be hosting a Connect keynote at 8PM ET on Wednesday, where it seems like these new glasses will make their official debut. The Verge will be covering the keynote live.\nCorrection, September 15th: An earlier version of this article speculated about translucent versions of the HSTN Oakley glasses, but those are already on sale.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41d0022ed7b0000dbcaceaf17872198bbb5f7b10",
      "title": "Awake’s new app requires heavy sleepers to complete tasks in order to turn off the alarm",
      "url": "https://techcrunch.com/2025/09/15/awakes-new-app-requires-heavy-sleepers-to-complete-tasks-in-order-to-turn-off-the-alarm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T19:00:59.000Z",
      "summary_90w": "",
      "raw": "Unlike traditional alarm clocks that can be silenced with a simple tap, Awake is intended to actively engage users' brains to ensure they fully wake up.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c56f390678654222cfa8a79a41e9630a44469653",
      "title": "Kim Beazley defends Australian War Memorial decision to exclude Ben Roberts-Smith book from prize",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/kim-beazley-defends-australian-war-memorial-decision-to-exclude-ben-roberts-smith-book-from-prize",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T18:58:44.000Z",
      "summary_90w": "",
      "raw": "The former foreign minister says the Les Carlyon award is ‘explicitly for emerging authors’, disqualifying Chris Masters’ biography of the alleged war criminal\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nKim Beazley has defended the Australian War Memorial’s decision to not award a prestigious literary prize to journalist Chris Masters for a book about alleged war criminal Ben Roberts-Smith, insisting the rules prevent established authors from being considered.\nThe memorial chair told Guardian Australia the prize is “explicitly for emerging authors” and not for those who have previously published major titles.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9c7f61527ec20745bebc86f34c5d28d403dda3",
      "title": "Snap unveils Snap OS 2.0 with native browser, WebXR support, and more",
      "url": "https://techcrunch.com/2025/09/15/snap-unveils-snap-os-2-0-with-native-browser-webxr-support-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T18:46:13.000Z",
      "summary_90w": "",
      "raw": "The launch comes as the company rolled out its fifth-generation Snap Spectacles for developers last year and plans to launch a consumer version sometime in 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa98de14632f17a3f2a84cda9e7ea665d6819509",
      "title": "RAF Typhoon jets ready to shoot down drones over Poland, UK says",
      "url": "https://www.theguardian.com/uk-news/2025/sep/15/raf-typhoon-jets-ready-to-shoot-down-drones-over-poland-uk-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T18:40:14.000Z",
      "summary_90w": "",
      "raw": "‘Nato is responding with unity and strength’ to Russian threats, says John Healey\nRAF Typhoon jets will be deployed within days to shoot down drones over Poland and other Nato allies in eastern Europe if necessary, after last week’s incursion of 19 uncrewed Russian aircraft into Poland.\nThe British fighters, based at Coningsby in Lincolnshire, will join Nato’s new Eastern Sentry mission working alongside French, German and Danish counterparts who are acting as reinforcements for Dutch F-35s and Polish F-16s.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6c0846e9399dfe48895decfb13cb0703b3cae54",
      "title": "Trump says foreign workers are &#8216;welcome&#8217; after ICE raid in Georgia targets hundreds of South Koreans",
      "url": "https://www.theverge.com/news/778334/trump-ice-hyundai-raid-korean-workers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T18:39:52.000Z",
      "summary_90w": "",
      "raw": "Protesters gathered in South Korea’s Incheon International Airport while hundreds of deported workers arrived. | Image: SeongJoon Cho/Bloomberg via Getty Images\t\n\nPresident Donald Trump is trying to smooth things over with South Korea after his administration arrested hundreds of workers at a Hyundai plant in Georgia earlier this month. Just hours after reports indicated that South Korea would open a human rights investigation into the detention of Korean employees, Trump said he doesn’t “want to frighten off” foreign investment into the US — something he has made a priority during his second administration.\nOn September 4th, Immigration and Customs Enforcement (ICE) agents descended on the electric vehicle battery plant operated by Hyundai and LG Energy Solutions, detaining nearly 500 workers, including around 300 workers from South Korea. ICE officials claimed the workers overstayed their visas or weren’t permitted to work in the US, according to NBC News.\nWorkers interviewed by The Korea Times say they were “shackled and handcuffed” and then brought to the ICE detention center in Folkston, Georgia, while their belongings and phones were confiscated. It’s not clear whether the workers were even eligible for deportation, as The New York Times reported on Friday that “in at least one instance, officials admitted a worker was employed legally and forced him to leave the country anyway.”\nAs noted by the Times, many of the workers entered the US on a B1 visa for business travel, allowing them to stay in the US for less than six months, or on a visa waiver program, permitting them to stay for up to 90 days. Some companies use short-term visas instead of H-1B visas, which allow foreign workers to stay in the US for up to six years, because they’re cheaper, faster to obtain, and less restrictive. “Previous US administrations had largely turned a blind eye to the practice,” according to The Guardian.\nTrump has called on foreign companies to invest more money into the US to avoid paying costly tariffs. Hyundai responded with the announcement in March that it would spend $21 billion in the US from 2025 to 2028, with plans to expand car production in the US to 1.2 million vehicles each year and improve its facilities. The removal of hundreds of workers could delay these plans, as Hyundai has already pushed back the opening of its Georgia factory.\nThe raid sparked outrage from South Korean President Lee Jae Myung, who called the move “extremely bewildering” and said companies in the country will be “very hesitant” about pouring more money into the US. South Korea’s security advisor Wi Sung-Lac added that the government would work with the US to carve out clearer guidelines for visa requirements, as well as potentially develop a new category for Korean workers, according to Reuters.\nThe incident puts the Trump administration on shaky ground with South Korea, which has long remained an ally of the US. In a post on Truth Social, President Trump wrote that he would like to bring foreign workers to the US to “teach and train” employees based in the US. “We welcome them, we welcome their employees, and we are willing to proudly say we will learn from them, and do even better than them at their own ‘game,’ sometime into the not too distant future!”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11ce3f51984463257897114260a62d1797c8729f",
      "title": "Does Israel face a 'South Africa moment' over Gaza?",
      "url": "https://www.bbc.com/news/articles/cx2xe5v70evo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T18:37:26.000Z",
      "summary_90w": "",
      "raw": "BBC diplomatic correspondent Paul Adams looks at parallels between reactions to Israel and apartheid-era South Africa.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6026cc8859de8bc9a81914aae63649a61cdf2493",
      "title": "Why Trump wants companies to report earnings less frequently",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542137/trump-corporate-earnings-sec",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T18:34:22.000Z",
      "summary_90w": "",
      "raw": "President Trump would like companies to report their earnings less frequently. Executives have long called for that -- but some financial experts worry it would go badly.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a72cf81c7379445ca0b060d65b763f8df8d5d858",
      "title": "Are The Conservatives 'Over'?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m30j0b?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T18:34:00.000Z",
      "summary_90w": "",
      "raw": "Tory MP and shadow minister Danny Kruger defects to Reform.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7234e4c9c2fdb1bae3650536a01eff10ac2b8ed8",
      "title": "Google thinks it can have AI summaries and a healthy web, too",
      "url": "https://www.theverge.com/news/778306/google-ai-summaries-penske-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T18:05:39.000Z",
      "summary_90w": "",
      "raw": "One of Google’s top executives defended its use of AI summaries in search results during an AI summit in New York on Monday. \nWhen asked about a new lawsuit by Rolling Stone’s parent company, Penske Media Corporation, over Google’s AI Overviews, the company’s vice president of government affairs and public policy Markham Erickson said user preferences are shifting away from “factual answers” provided by original websites to the contextual summaries provided by AI Overviews, which appear at the top of the main page of search results. The company’s goal, Erickson said, is to maintain a “healthy ecosystem” with both AI summaries and regular search results, sometimes referred to as 10 blue links.\nEvidence has emerged recently that suggests that search traffic plummets with AI summaries. In its lawsuit, Penske alleged that this drop in search traffic leads to a decline in revenue for online publishers. \nHere is what Erickson said when asked about the lawsuit: \nSo, I don’t want to speak about the specifics of the lawsuit, but I can speak to our philosophy here, which is, look, we want a healthy ecosystem. The 10 blue links serve the ecosystem very well, and it was a simple value proposition. We provided links that directed users free of charge to billions of publications around the world. We’re not going to abandon that model. We think that there’s use for that model. It’s still an important part of the ecosystem. \nBut user preferences, and what users want, is also changing. So, instead of factual answers and 10 blue links, they’re increasingly wanting contextual answers and summaries. We want to be able to provide that, too, while at the same time, driving people back to content, valuable content, on the Internet. Where that valuable content is for users, is shifting. And so it’s a dynamic space. Ultimately, our goal is to ensure that we have an overall healthy ecosystem.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e21bc95ccaf942d9107d4e79b6de67ef30ebabaa",
      "title": "UK jets to defend Polish skies after Russian drone incursion",
      "url": "https://www.bbc.com/news/articles/c80gk57x9rpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:53:01.000Z",
      "summary_90w": "",
      "raw": "Tensions have risen across Europe after 19 drones entered Poland's territory earlier this month",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5615e8c30214ca08fbe7062eb02f463f90e82be",
      "title": "Apple’s iOS 26 with the new Liquid Glass design is now available to everyone",
      "url": "https://techcrunch.com/2025/09/15/apples-ios-26-with-the-new-liquid-glass-design-is-now-available-to-everyone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:45:19.000Z",
      "summary_90w": "",
      "raw": "Other features include a call screening assistant, a new gaming and preview app, in-app translation across the system, and updates to Genmoji and Image Playground apps.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f78b54253d79365a7019d02bad9f7d7378af5cce",
      "title": "Indian billionaire family's private zoo cleared of 'foul play'",
      "url": "https://www.bbc.com/news/articles/c147kzpy113o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T17:40:45.000Z",
      "summary_90w": "",
      "raw": "India's top court had formed a special team to investigate allegations that animals were mistreated at Vantara.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48341e22cf197b930c55378266f1044034e5ce18",
      "title": "Who is Fed nominee Stephen Miran, and why is he so controversial?",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542126/stephen-miran-fed-reserve-board",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T17:39:32.000Z",
      "summary_90w": "",
      "raw": "Stephen Miran, who has served in both Trump administrations, said he will not resign from the White House if confirmed to the Federal Reserve Board, further stoking concerns about its independence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6bde3edff6aa061eaa1cfbd72718f18d4fa52fe3",
      "title": "Microsoft’s Office apps now have free Copilot Chat features",
      "url": "https://www.theverge.com/news/778272/microsoft-office-free-copilot-ai-features-copilot-chat",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:32:55.000Z",
      "summary_90w": "",
      "raw": "Microsoft is adding the free Microsoft 365 Copilot Chat and agents to Office apps for all Microsoft 365 business users today. Word, Excel, PowerPoint, Outlook, and OneNote are all being updated with a Copilot Chat sidebar that will help draft documents, analyze spreadsheets, and more without needing an additional Microsoft 365 Copilot license.\n“Copilot Chat is secure AI chat grounded in the web—and now, it’s available in the Microsoft 365 apps,” explains Seth Patton, general Manager of Microsoft 365 Copilot product marketing. “It’s content aware, meaning it quickly understands what you’re working on, tailoring answers to the file you have open. And it’s included at no additional cost for Microsoft 365 users.”\nWhile this free version of Copilot will rewrite documents, provide summaries, and help create slides in PowerPoint, the $30 per month, per user Microsoft 365 Copilot license will still have the best integration in Office apps. The Microsoft 365 Copilot license is also not limited to a single document, and can reason over entire work data.\n“Users with a Microsoft 365 Copilot license get priority access to features like file upload and image generation, along with the latest technology like GPT-5, including faster response times and more consistent availability—even during peak usage periods,“ explains Patton.\nMicrosoft previously bundled its AI-powered Copilot features into Office apps for consumer Microsoft 365 plans earlier this year, but it raised the prices of subscriptions at the same time. Microsoft isn’t doing any price adjustments for businesses with Copilot Chat being added to Office apps. Microsoft is also getting ready to bundle its sales, service, and finance Copilots into the Microsoft 365 Copilot subscription in October, reducing the price for some businesses that rely on Microsoft’s latest AI tools.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a750454b4f8fe9d2b245e0ab6f117c319a4be65",
      "title": "PM says he would never have appointed Mandelson had he known full Epstein links",
      "url": "https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:29:26.000Z",
      "summary_90w": "",
      "raw": "The PM says a due diligence process was gone through before Lord Mandelson was appointed US ambassador.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64818ba30a0c60188e0771285de8c2e100c0665f",
      "title": "China accuses Nvidia of violating anti-monopoly laws",
      "url": "https://www.bbc.com/news/articles/cj9zedgkm21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T17:28:53.000Z",
      "summary_90w": "",
      "raw": "The accusation comes as the US and China hold talks to de-escalate the trade war between the two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6751768c571aea67186d4dbd011b194f90236c39",
      "title": "Starmer aide resigns after explicit texts about Abbott surface",
      "url": "https://www.bbc.com/news/articles/ckgy79yr74do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:25:54.000Z",
      "summary_90w": "",
      "raw": "Downing Street said the messages about the veteran MP were \"appalling and unacceptable\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be3758589548d1dc21f863630c31eac67575d8c7",
      "title": "Telling stories of gun violence deaths almost cost this reporter his life",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539315/trymaine-lee-a-thousand-ways-to-die",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T17:22:34.000Z",
      "summary_90w": "",
      "raw": "Trymaine Lee spent years reporting on the deaths of men who look just like him. His new memoir, A Thousand Ways to Die, chronicles the impact of gun violence in Black communities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cab26b92019fd670400a1222a05ca0b2c78a4077",
      "title": "Inside the Shift at Disrupt: Building Community and Scaling in the AI Era",
      "url": "https://techcrunch.com/2025/09/15/on-stage-at-techcrunch-disrupt-2025-how-ai-is-forcing-late-stage-startups-to-rewire-gtm-or-be-left-behind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:15:00.000Z",
      "summary_90w": "",
      "raw": "Nirav Tolia (Nextdoor), Jane Alexander (CapitalG), and Vanessa Larco (Premise, NEA) join TechCrunch Disrupt 2025 (Oct 27–29, SF) to share strategies for building resilient companies and scaling in the AI era.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b5a514c60d00853c8804a1745b1fec6b4554b3af",
      "title": "The best phone to buy right now",
      "url": "https://www.theverge.com/22163811/best-phone",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:14:53.000Z",
      "summary_90w": "",
      "raw": "The best screens for screen time. | Image: Cath Virginia / The Verge\t\n\nHaven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable in my recommendations below.\nBut even if you’re looking for something a little more extra, you’ve got some great options. They’re going to be pretty iterative compared to whatever you’re using now — we’re in more of a software era than a hardware innovation cycle these days — but you can find a delightful new device. We finally have a folding phone that feels like the right size and shape, flip phones offer a lot more than just nostalgia, and you can still buy a phone with no fewer than four cameras on the back. Not bad for a boring season of phone hardware.\nA lot of people in the US get their phones through carrier deals, and no judgment here if that’s the route you take — it’s how I bought mine. Just be sure you know what you’re getting into and how many years you’ll need to stay on that Super 5G Everything Unlimited Plus plan to keep the monthly device reimbursements coming.\nIf you’re looking to spend a little less and still get the best smartphone on a budget, you can find something really good for under $600. For those recommendations, check out our guide to budget smartphones.\n\n\n\n\n\nThe best iPhone for most people\nThe best Android phone for most people\nThe best high-end Android phone\nThe best phone for around $500\nThe best high-end iPhone\nThe best flip phone\nThe best folding phone\nOther phones we tested\nWhat’s coming next\n\nThe best iPhone for most people\nApple iPhone 16\n\n\nScore: 8\n\nProsCons\n\n\nReliable camera with versatile photographic styles\nHandy new Action Button\nMore RAM and a current-gen chipset\n\nStandard refresh rate screen\nCamera Control is a mixed bag\n\n\n\nWhere to Buy:\n\n $699 at Apple\n $729.99 at Best Buy\n\nScreen: 6.1-inch, 2556 x 1179 OLED, 60Hz refresh rate / Processor: A18 Cameras: 48-megapixel f/1.6 main with sensor-shift IS; 12-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W wireless MagSafe, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nFrom a hardware perspective, the iPhone 16 (or the 16 Plus) is an easy upgrade choice. If you’re switching from an iPhone 13, 12, or even older, those four or five years of incremental performance improvements add up. But there’s something entirely new this time around — well, two things: the Action Button and the Camera Control button.\nThe customizable Action Button, which replaces the mute switch on the left edge of the phone, is a hand-me-down from the 15 Pro series. You can set it to open a particular app, turn on the flashlight, or almost anything else you might want at the press of a button. On the other side of the phone is the Camera Control, which you can use to launch the camera app. With the camera open, it acts as a shutter button with a full press, and a light press brings up other exposure options you can adjust. Even if you only ever use it to launch the camera, it’s pretty handy, and it frees up the Action Button.\nThe iPhone 16 and its larger 16 Plus sibling use Apple’s A18 chipset, which is in the same family as the 16 Pro’s processor. That bodes well for the phones staying on the same software upgrade cycle. They both received Apple Intelligence last fall, which included AI-powered writing tools and notification summaries in its earliest iteration, and eventually grew to support ChatGPT and a new Visual Intelligence feature. But despite the similarities, the regular 16 models lag behind the Pros in two important departments: the screen and the camera.\nThe Pros come with dedicated 5x lenses and updated main cameras that do a little better in low light. And you’ll only get a ProMotion display on the Pro models; the regular 16 features a slower 60Hz screen. Basically every other high-end phone on the market offers a 120Hz display, so that’s a disappointment given the price. If those two drawbacks don’t bother you — and most people probably won’t mind them — then the iPhone 16 makes for a great upgrade.\nRead our full iPhone 16 review.\nThe best Android phone for most people\nGoogle Pixel 10 (128GB)\nGoogle’s Pixel 10 has a 6.3-inch OLED display, Google Tensor G5 processor, 12GB of RAM, support for Pixelsnap wireless charging, and a triple-lens camera system that includes a new 5x telephoto.\n\n\nScore: 8\n\nProsCons\n\n\nQi2 wireless charging with magnets is great\nAI is actually kind of useful, finally\nTelephoto camera is a nice addition\n\nMain and ultrawide cameras aren’t quite as good as the Pro\nBattery life is just okay\n\n\n\nWhere to Buy:\n\n $799 at Amazon\n $799 at Best Buy\n $799 at Google\n\nScreen: 6.3-inch, 1080p 120Hz OLED / Processor: Tensor G5 / Cameras: 48-megapixel f/1.7 main with OIS; 13-megapixel f/2.2 ultrawide; 10.8-megapixel 5x telephoto with OIS; 10.5-megapixel selfie / Battery: 4,970mAh / Charging: 30W wired, 15W wireless / Weather resistance: IP68\nThe Pixel 10 is an easygoing Android phone that offers some handy upgrades over its predecessor. The addition of Qi2 with built-in magnets is a delight, making it easier than ever to quickly charge up without plugging in. AI features like Magic Cue, which can proactively suggest information based on what you’re doing on your phone, are finally showing promise. And for the first time ever, the base model features a dedicated telephoto lens.\nBut, alas, there’s a catch: The Pixel 10 no longer features the same main and ultrawide camera hardware as the Pro. You’re essentially getting the two rear cameras found in the midrange Pixel 9A, plus a telephoto lens. Still, as a whole, the device’s triple camera system produces images that are totally fine. Beyond the cameras, the Pixel 10 features the same Tensor G5 chipset that’s found in the Pro phones — handy for those aforementioned AI features.\nOverall, the Pixel 10 mostly improves upon what made last year’s Pixel 9 such a solid release. We’re not thrilled with the downgraded camera, but the addition of Qi2 and a telephoto lens helps to soften the blow. If you can live with the camera trade-offs, the Pixel 10 is still a smart pick for anyone who wants a flagship experience at a more approachable price.\nRead our full Pixel 10 review.\nThe best high-end Android phone\nSamsung Galaxy S25 Ultra\n\n\nScore: 8\n\nProsCons\n\n\nExcellent screen\nImproved ultrawide camera\nRounded corners are comfier\n\nExpensive\nBulky\nAI is (still) hit or miss\n\n\n\nWhere to Buy:\n\n $1299.99 $1048 at Amazon (256GB)\n $1299.99 $1049.99 at Best Buy (256GB)\n $1299.99 at Samsung(256GB)\n\nScreen: 6.9-inch, 1440p, 120Hz OLED / Processor: Qualcomm Snapdragon 8 Elite / Cameras: 200-megapixel main with OIS; 50-megapixel 5x telephoto with OIS; 10-megapixel 3x telephoto with OIS; 50-megapixel ultrawide; 12-megapixel selfie / Battery: 5,000mAh / Charging: 45W wired, 15W wireless, Qi2 ready / Weather resistance: IP68\nSamsung’s “Ultra” S-series phone is still your best bet for a maximalist Android phone, even if ultra doesn’t quite mean what it once did. You still get four rear cameras — including a 3x and 5x telephoto — a massive screen, and a built-in S Pen stylus. The battery goes all day, the processor is top-notch, and there are AI features aplenty if you’re into that sort of thing. There’s just no other phone quite like it. \nThis year, Samsung removed the Bluetooth features from the stylus. That stings a little, especially considering that the company swapped a 10x zoom for the shorter 5x camera the year before. It still amounts to a great phone, but it’s one of the priciest slab-style phones you can buy, and Samsung seems to be cutting features without adding back any extra value. It’s still “ultra” alright, but it doesn’t feel quite as special as it used to.\nRead my full Galaxy S25 Ultra review.\nThe best phone for around $500\nGoogle Pixel 9A\n\n\nScore: 8\n\nProsCons\n\n\nRobust IP68 rating\nSeven years of software updates\nBrighter, bigger screen\n\nMissing a couple of AI features\nAI is occasionally handy, usually weird\n\n\n\nWhere to Buy:\n\n $499 at Amazon\n $499 at Best Buy\n $499.99 at Google\n\nScreen: 6.3-inch, 1080p OLED, 120Hz / Processor: Tensor G4 / Cameras: 48-megapixel f/1.7 with OIS, 13-megapixel ultrawide, 13-megapixel selfie / Battery: 5,100mAh / Charging: 23W wired, 7.5W wireless / Weather-resistance rating: IP68\nEvery year, we’re pleasantly surprised by how much Google packs into its midrange Pixel A-series devices. Last year, it was the Pixel 8A, and this year, it’s the even better Pixel 9A. For $500, the 9A offers Google’s fourth-gen custom Tensor G4 chipset (the very same chip that’s in the pricier Pixel 9 and Pixel 9 Pro), a brighter and larger 6.3-inch OLED display, and an IP68 rating for improved durability. Plus, you get the benefit of seven years of software updates and security support. What you end up with is a device that delivers fantastic value, especially compared to other inexpensive devices.\nThe Pixel 9A offers a handful of other features that put it above the pack, like a 120Hz refresh rate, wireless charging, and the largest battery across the Pixel line. It does fall short in a few areas, though — the camera’s low light performance and Portrait mode could be better. That said, the 9A’s camera is still great for everyday snaps, and for the price, the device is an easy recommendation as the best in this category.\nRead my full Pixel 9A review.\nThe best high-end iPhone\nApple iPhone 16 Pro\n\n\nScore: 8\n\nProsCons\n\n\nNew tone control in camera lets you dial back HDR processing\nWho doesn’t love a physical shutter button?\nYour video director friends will spend hours gleefully taking 4K120 video portraits of people at street festivals\n\nCamera Control button is a little fiddly\nDefault photo processing is more aggressive than ever\nThe most incremental of incremental upgrades over the iPhone 15 Pro\n\n\n\nWhere to Buy:\n\n $999 $745.06 at Amazon (Renewed)\n $999.99 $899.99 at Best Buy\n\nScreen: 6.3-inch, 2622 x 1206 OLED, 120Hz refresh rate / Processor: A18 Pro Cameras: 48-megapixel f/1.8 with sensor-shift IS; 12-megapixel 5x telephoto with OIS; 48-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W MagSafe wireless, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nLike all mainline iPhone 16 models, the 16 Pro gained the new Camera Control button, but it got another important update, too: a 5x telephoto lens. In the 15 series, that longer telephoto lens was reserved for the bigger Pro Max model. This time around, it’s on the smaller Pro, too, making it a great option for someone who wants to upgrade without upsizing their phone.\nLike the Pro Max, the iPhone 16 Pro uses an A18 Pro chipset designed to support Apple Intelligence, which started rolling out in the fall of 2024. The first update included things like notification summaries and the new glowing-border Siri UI, which Apple centered its launch event on. Subsequent updates brought ChatGPT integration and Visual Intelligence. But don’t expect anything radical — at least at first.\nOutside of AI, the 16 Pro is a fairly iterative update. The new Camera Control makes it easier to launch the camera and get right to taking photos, and it also frees up the Action Button if you were using it as a camera shortcut. The screen is a little bigger at 6.3 inches compared to 6.1 inches, even though the phone is basically the same size. You can record 4K video at 120fps now. And the new Photographic Styles, which are available on all iPhone 16 models, let you take more control over your photos than ever.\nThere’s nothing here that someone with an iPhone 15 Pro should upgrade for, but it’s an all-around solid device that will please Apple devotees, especially those who prefer a phone that isn’t too big.\nRead our full iPhone 16 Pro review.\nThe best flip phone\nSamsung Galaxy Z Flip 7\n\n\nScore: 8\n\nProsCons\n\n\nSamsung finally adopted the big cover screen\nAll-day battery\nReliable camera\n\nMore susceptible to dust than your average phone\nStill too hard to run full apps on the cover screen\n\n\n\nWhere to Buy:\n\n $1099.99 $949.99 at Amazon (256GB)\n $1099.99 $949.99 at Best Buy (256GB)\n $1099 at Samsung (256GB)\n\nScreen: 6.9-inch, 1080p, 120Hz OLED inner screen; 4.1-inch, 948p, OLED cover screen / Processor: Samsung Exynos 2500 / Cameras: 50-megapixel f/1.8 main with OIS; 12-megapixel ultrawide; 10-megapixel selfie (inner screen) / Battery: 4,300mAh / Charging: 25W wired, 15W wireless, 4.5W reverse wireless / Weather resistance: IP48\nSamsung finally got the memo with the Galaxy Z Flip 7’s cover screen. The company’s latest flip phone ditches the file folder-shaped look of its predecessor for a 4.1-inch, edge-to-edge display that wraps around the cameras. With more outer screen real estate, it’s easier to respond to texts and punch in a coffee order without flipping open the phone and getting sucked into a digital rabbit hole.\nThe Flip 7 still makes you jump through a few hoops if you want to run full apps on the cover screen, but once you’ve wrangled the settings, it unlocks a lot of convenience for everyday tasks. That said, the cover screen isn’t perfect for every app. Sometimes a button hides behind the camera cutout, forcing you to change the app’s window size. But most tasks are a breeze, and opening the phone is always an option.\nUnder the hood, Samsung swapped out Qualcomm’s processor for an in-house Exynos chip, though we didn’t notice any hits to performance. The new 4,300mAh battery will last you all day with moderate use, but heavy gaming and hotspot use will significantly impact battery life. The camera system, meanwhile, remains unchanged from the Z Flip 6, which isn’t a bad thing. You still get a 50-megapixel main shooter and all the fun flex mode tricks, which are great for capturing candids.\nUnfortunately, the Flip 7 still offers no protection against fine particles like dust or sand, which might work their way into the hinge and cause damage. This raises concerns about how the device hold up over time. But Samsung’s beefed-up warranty and repair program can provide extra peace of mind. Plus, with seven years of OS and security updates, the Flip 7 should prove reliable until you decide to upgrade.\nRead our full Galaxy Z Flip 7 review.\nThe best folding phone\nSamsung Galaxy Z Fold 7\n\n\nScore: 8\n\nProsCons\n\n\nRidiculously slim and light for a foldable\nAll-day battery with moderate use\nOuter screen finally feels normal\n\nIt’s $2,000\nDurability still a concern\nCamera bump makes it wobble on a table\n\n\n\nWhere to Buy:\n\n $1999.99 at Amazon(256GB)\n $1999.99 at Best Buy (256GB)\n $2119.99 at Samsung (512GB)\n\nScreen: 8-inch, 1968p, 120Hz OLED inner screen; 6.5-inch, 1080p, 120Hz OLED cover screen / Processor: Qualcomm Snapdragon 8 Elite / Cameras: 200-megapixel f/1.7 main with OIS; 10-megapixel 3x telephoto with OIS; 12-megapixel ultrawide; 10-megapixel selfie (cover screen); 10-megapixel inner selfie camera / Battery: 4,400mAh / Charging: 25W wired, 15W wireless, 4.5W reverse wireless / Weather resistance: IP48\nOne of our biggest criticisms of the Z Fold series has been that it feels too narrow and cramped when closed. The Galaxy Z Fold 7 fixes that. With a more familiar 21:9 aspect ratio, it no longer feels like you’re holding a TV remote control. The result is a book-style foldable that mostly feels like a regular slab-style phone. It’s nearly as slim, too, so it doesn’t feel as bulky in your pocket.\nThe Z Fold 7’s reworked proportions make it easier to wield when replying to texts and Slack messages. When you start craving more screen real estate, the device opens to reveal a spacious 8-inch inner display, giving you an entirely different experience that’s perfect for managing multiple tabs in Chrome and playing games like Diablo Immortal. It’s great for multitasking — being able to track your Uber driver’s arrival time on one half of the screen while replying to emails on the other half is incredibly useful.\nThe bad news? The Z Fold 7 costs $1,999, making the barrier of entry very high. It also has one of the largest camera bumps we’ve encountered in a phone and doesn’t carry a formal dust resistance rating, meaning even a small amount of dust has the potential to cause significant damage to the hinge. Despite these shortcomings, however, Samsung has created a luxurious foldable that’s thinner, lighter, and incredibly nice to use.\nRead our full Galaxy Z Fold 7 review.\nOther phones we tested\nThe Samsung Galaxy S25 is a very good device, and it’s basically the last small-ish Android phone you can buy in the US. I find the software to be fussier and more cluttered than the Pixel 9’s, so it’s not my overall pick, but it’s a reliable device — and your best bet for a phone that isn’t gigantic. Read our review.\nThe iPhone 16E is a great phone that makes a lot of interesting trade-offs. Apple’s latest entry-level phone starts at $599 and comes with the company’s latest A18 processor, USB-C and wireless charging, a 60Hz OLED display, and the customizable Action Button found on Apple’s more premium handsets. The 6.1-inch phone doesn’t have MagSafe support or a Camera Control button, though, and it’s limited to a single 48-megapixel Fusion camera (sorry, ultrawide stans). That makes it hard for us to recommend over the standard iPhone 16, even if it does start at $200 less. Read our review.\nThe Motorola Razr Ultra 2025 is an excellent foldable that exemplifies what makes the brand’s phones so unique. It’s one of the best-looking phones you can buy, thanks to its gold-bronze chassis and wooden back. Plus, it features a spacious cover screen that’s handy for quickly performing tasks without opening the device. However, as much as we enjoy the Razr Ultra, Motorola’s promise of three OS upgrades and four years of security updates is on the shorter side. Read our review.\nThe Samsung Galaxy S25 Edge is an ultra-thin alternative to the big, chunky flagships we’ve seen over the past year. At just 5.8mm thick, it packs a 6.7-inch 1440p OLED display with a refresh rate of up to 120Hz, a 3,900mAh battery, and a Snapdragon 8 Elite processor. Despite its thinner frame, battery life is surprisingly acceptable, though it won’t last as long as other flagship devices. The S25 Edge also lacks a telephoto camera, so it’s not the best phone for portrait photos. Read our review.\nThe OnePlus 13R stands out in two key ways: battery life and screen. The 6.78-inch OLED display has a variable refresh rate of up to 120Hz and a resolution of 1264 x 2780, both of which are great specs for a midrange phone. Meanwhile, its 6,000mAh battery can last for a long time — most people are likely to squeeze out two days before the device needs to be recharged. That said, the 13R lacks features like wireless charging and more robust water resistance, and OnePlus is only promising four major OS upgrades and six years of security updates, which is fewer than the seven years of OS upgrades on the Google Pixel 9A. Read our review.\nThe Nothing Phone 3 is the brand’s “first true flagship phone,” with a 6.67-inch OLED screen, a Snapdragon 8S Gen 4 chip, and a 5,150mAh battery. It also features four cameras — three on the back and one on the front — all of which are 50 megapixels. Additionally, the Phone 3 ditches Nothing’s signature light strips for a small dot-matrix LED display on the back, which can display images or emoji tied to specific apps and contacts. Read our review.\nThe Pixel 9 Pro Fold is an impressive sophomore effort from Google. Like the Z Fold 7, the outer screen matches the dimensions of a regular slab-style phone, while the inner screen is great for multitasking. The whole package is also light enough that it sometimes doesn’t feel like you’re holding a foldable, though it does suffer from a slightly downgraded camera system compared to other Pixel 9 devices. There’s also no formal dust resistance, so long-term durability remains a concern. Read our review.\nThe Pixel 10 Pro is Google’s most refined flagship yet, blending a premium design with meaningful hardware upgrades like the Tensor G5 chip and Pixelsnap wireless charging. Magic Cue delivers genuinely useful on-device AI that can surface helpful info in real-time, while the camera’s portrait mode is much improved over its predecessor. Battery life is just average, though, and some AI features still feel like they’re being shoved into corners of the device where it doesn’t really need to be. Most readers will be better served by the cheaper Pixel 10. Read our review.\nWhat’s coming next\nGoogle’s Pixel 10 Pro Fold is the first foldable to earn an IP68 rating, meaning it offers robust water and dust resistance. The device also features Google’s new Tensor G5 chipset, improved inner and outer displays, and Pixelsnap wireless charging. We got a brief hands on with the 10 Pro Fold following its announcement, though we’re not ready to share a final verdict until we’ve performed more extensive real world testing. For now, you can preorder the base 256GB model at Amazon, Best Buy, or directly from Google starting at $1,799, with a release to come on Thursday, October 9th.\nAt its fall hardware keynote, Apple announced the iPhone 17, iPhone 17 Pro, iPhone 17 Pro Max, and the slimmed down iPhone Air. The Air is Apple’s thinnest device yet at 5.6mm, while the entry-level iPhone 17 got an upgraded 6.3-inch ProMotion display, making it a really great deal. Meanwhile, the Pro models boast a powerful A19 Pro chip and a three-camera system — all of which are 48-megapixels. The 17 Pro Max also features the biggest battery ever in an iPhone, promising up to 39 hours of video playback. The latest iPhones are available to preorder now, with a launch set for Friday, September 19th.\nUpdate, September 15th: Adjusted pricing / availability, added the Google Pixel 10 as the “best Android phone for most people,” and added insights for the Pixel 10 Pro, Pixel 10 Pro Fold, and the 2025 iPhone lineup. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a72592586edf0ffa2cad6101499ce902818ad0a5",
      "title": "I&#8217;ve been using macOS Tahoe 26 since June and here are the eight best things about it",
      "url": "https://www.theverge.com/apple-mac-os/777936/apple-macos-tahoe-26-final-release-testing-impressions-liquid-glass",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T17:08:41.000Z",
      "summary_90w": "",
      "raw": "Liquid Glass may polarize, but it’s here.\t\n\nApple's new version of macOS, Tahoe 26, launches today for all compatible Macs. I've already shared many feelings about Liquid Glass in my look at the developer and public betas, and my opinion on the new, polarizing UI remains lukewarm. But after using Tahoe through the beta periods to full release, I can confidently say that there are some decent improvements to macOS worth diving further into.\nThe updated Spotlight: power user lite\nCommand + Spacebar was always a helpful shortcut for calling up Spotlight and launching an app with just the keyboard. Now, you can do much more with it, and if you train up the muscle memory it  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "62454087fb76c0442f3d160f48342371d31588fc",
      "title": "Eight charged over Unite the Kingdom rally disorder",
      "url": "https://www.bbc.com/news/articles/cz7r0epn51zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:08:14.000Z",
      "summary_90w": "",
      "raw": "The Metropolitan Police also issued an appeal to trace 11 more people they want to speak to.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36ce4c998cc03a96b350913c6b67551c6ad45549",
      "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T17:04:38.000Z",
      "summary_90w": "",
      "raw": "This live blog is closed.\n\nRubio says Netanyahu has full support of US\n\nThat brings the press conference to a close, as Netanyahu takes a moment to acknowledge both his and Rubio’s staff who are sat in the front row.\nThe main takeaways from the event, which lasted just over half an hour, are that the US views international efforts to recognise the Palestinian state as a hindrance to peace efforts and that Netanyahu refuses to rule out future strikes on Hamas leaders – wherever they are.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fcfdc8182a52a69744a874c481e7899892c841ab",
      "title": "OpenAI upgrades Codex with a new version of GPT-5",
      "url": "https://techcrunch.com/2025/09/15/openai-upgrades-codex-with-a-new-version-of-gpt-5/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:03:40.000Z",
      "summary_90w": "",
      "raw": "OpenAI's AI coding agent, Codex, can now spend anywhere from a few seconds to several hours on a task, thanks to a new, customized version of GPT-5.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5888042c3b88c2cc200111948f2d1a3cd7b73aa3",
      "title": "Hackers steal private data of Gucci, Balenciaga and McQueen customers",
      "url": "https://www.theguardian.com/business/2025/sep/15/hackers-data-gucci-balenciaga-alexander-mcqueen-kering",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T17:02:32.000Z",
      "summary_90w": "",
      "raw": "Cybercriminals steal details of potentially millions of people in attack on labels’ parent company Kering\nHackers have stolen data from customers of the luxury fashion group Kering, whose brands include Gucci, Balenciaga and Alexander McQueen.\nCyber-attackers have stolen data of potentially millions of customers, including the names, phone numbers and email addresses of customers of the fashion group, it has emerged.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "382f9621accda930c69dae33f21b991d12f2be67",
      "title": "Rubio says Netanyahu has full support of US over plans to destroy Hamas",
      "url": "https://www.theguardian.com/world/2025/sep/15/rubio-says-netanyahu-has-full-support-of-us-over-plans-to-destroy-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T17:02:32.000Z",
      "summary_90w": "",
      "raw": "US secretary of state, who is visiting Jerusalem, warns of ‘Israeli counter reaction’ if allies recognise Palestine\nThe US secretary of state, Marco Rubio, has put the Trump administration’s full support behind Benjamin Netanyahu in a visit to Jerusalem, saying Washington’s priorities were the liberation of Israeli hostages and the destruction of Hamas.\nIn public remarks standing alongside Netanyahu, Rubio did not mention the possibility of a ceasefire, and did not repeat his earlier criticism of Israel for carrying out an airstrike last week aimed at Hamas leaders in Doha, the capital of another close US ally, Qatar.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "776dd2e5f01cf83232dec600ae1c576b3ea13b4a",
      "title": "Mum of Southport victim demands truth from inquiry",
      "url": "https://www.bbc.com/news/articles/cvgrq9v27q0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T17:00:34.000Z",
      "summary_90w": "",
      "raw": "The parents of the girls murdered in the attack demanded \"real change\" and \"accountability\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da88483c406faf61da49a6d5413f720ffde0885d",
      "title": "UK fighters to fly air defence missions over Poland – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:57:55.000Z",
      "summary_90w": "",
      "raw": "This live blog is closed.\n\nRussia-Belarus military exercise stirs up unease in Europe’s leaders\n\nEU trade spokesperson Olof Gill also defended the EU’s sanctions from criticism that they are not going far enough.\nHe said:\n“Our assessment is that the successive sanctions packages we have brought forward, which includes new initiatives plus additional initiatives to make the previous one stronger if that makes sense, our assessment is that those sanctions are working. \nThe economic evidence shows that they are having an impact on the Russian economy, and that is precisely what they intended to do. \n“Phasing out of Russian fossil fuels is something that we have been doing and are doing actively for a number already of years, since the beginning of the war, with a very clear roadmap, with now even a clear legislative proposal in order to phase out the remaining gas still entering the EU.\n… This is something on which the EU has been very actively and we have a very, very clear roadmap, and how to go about it.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd0f940d3c41248ad9122e0ea9f405cedb37aaee",
      "title": "Eurovision has never been about politics, says BBC boss Tim Davie",
      "url": "https://www.bbc.com/news/articles/cp8jd108e3qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:50:06.000Z",
      "summary_90w": "",
      "raw": "The director general says the corporation is \"aware of the concerns\" around Israel's participation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77d1a2117eb3304ee265211225eb3cca3ac5e5ff",
      "title": "China says Nvidia violated antitrust regulations",
      "url": "https://techcrunch.com/2025/09/15/china-says-nvidia-violated-antitrust-regulations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:44:02.000Z",
      "summary_90w": "",
      "raw": "China is investigating Nvidia's 2020 acquisition of Mellanox Technologies as trade tensions between the U.S. and China heat up.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b405ee8f33a223d2d4399337a5ad1fe5dede8a4",
      "title": "First objects retrieved from wreck of Titanic’s sister ship in Greece",
      "url": "https://www.theguardian.com/world/2025/sep/15/objects-retrieved-hmhs-britannic-wreck-titanic-sister-ship-greece",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:33:37.000Z",
      "summary_90w": "",
      "raw": "Transatlantic passenger liner HMHS Britannic sank in 1916 after striking German mine off island of Kea\nDeep-sea divers have retrieved a first batch of objects from the Titanic’s sister ship, which sank off the coast of Greece in 1916, including a signal lamp, ceramic tiles and a pair of binoculars.\nThe Greek culture ministry said on Monday that a research programme had involved “the retrieval of objects from the wreck site [of the HMHS Britannic] for the first time, from depths exceeding 120 metres [390ft].”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9d923e49e7d54391f6b437a4b3d538ebfa481390",
      "title": "Constance Marten and Mark Gordon jailed for 14 years over baby's death",
      "url": "https://www.bbc.com/news/articles/c931yq8lz19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:31:04.000Z",
      "summary_90w": "",
      "raw": "The couple were found guilty in July after a lengthy retrial at the Old Bailey.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "527fdeab0c29454d4bb55b0b837dabd6dac1c324",
      "title": "Man 'stole Banksy for collection of love hearts'",
      "url": "https://www.bbc.com/news/articles/cvgn75xjrrgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:18:44.000Z",
      "summary_90w": "",
      "raw": "Girl with Balloon, valued at £270,000, was taken from the Grove Gallery in central London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26d0075cfaf47c6294bbd4d12bcee4f8bf90abab",
      "title": "Tory MP and shadow minister Danny Kruger defects to Reform",
      "url": "https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:17:56.000Z",
      "summary_90w": "",
      "raw": "The East Wiltshire MP said the Conservatives were no longer the main party of opposition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67f7f463240fe96584bf63b0b10553d17a536cb5",
      "title": "'I'm just a mixed-race kid from Kirkby', says Stephen Graham after Emmys win",
      "url": "https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T16:14:25.000Z",
      "summary_90w": "",
      "raw": "Stephen Graham is emotional as he accepts an Emmy award for his role in the hit series Adolescence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2147bf84d6043c37b507082d91c5aca3c1103e5",
      "title": "Israel announces seizure of $1.5M from crypto wallets tied to Iran",
      "url": "https://techcrunch.com/2025/09/15/israel-announces-seizure-of-1-5-million-from-crypto-wallets-tied-to-iran/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:08:14.000Z",
      "summary_90w": "",
      "raw": "The Israeli government ordered the seizure of 187 wallets it said belong to the IRGC, which have over time received $1.5 billion in crypto, according to a blockchain analysis firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c186f3cf8bf6597e85fce82bf92abd6290d3db7",
      "title": "Time’s running out to volunteer at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/times-running-out-to-volunteer-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:05:17.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 takes place October 27–29 at Moscone West in San Francisco, and we’re looking for motivated, curious, and energetic volunteers to help make it all happen.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f24f9cf50f19530fdcdd2da95285d8e569f5a5dc",
      "title": "Cuban prisoners forced to work making cigars and charcoal for export to Europe, report claims",
      "url": "https://www.theguardian.com/world/2025/sep/15/cuba-prisoners-forced-labour-cigars-charcoal-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:01:13.000Z",
      "summary_90w": "",
      "raw": "Madrid-based NGO estimates at least 60,000 inmates subject to forced labour with little or no pay in Cuban jails\nPrisoners in Cuba are forced to work producing the country’s world-famous cigars and marabu charcoal sold to European consumers, according to a new report.\nThe Madrid-based NGO Prisoners Defenders estimates that at least 60,000 people are being forced to work with little or no pay, under threats, in exhausting conditions and without adequate equipment, with reports of violence including the sexual abuse of female detainees.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a26f39ea664acd863c12fd8080bfe97d0e704a0",
      "title": "PayPal adds new one-to-one payment links that will soon support crypto",
      "url": "https://techcrunch.com/2025/09/15/paypal-adds-new-one-to-one-payment-links-that-will-soon-support-crypto/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T15:58:26.000Z",
      "summary_90w": "",
      "raw": "The new PayPal Links allow customers to either request or make a payment to another person by selecting the link option, inputting the amount, and then copying the link into a conversation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d403c14dba9941c45d07f2a3f97e6cf9714311d",
      "title": "Belarus and Russia stage joint military drills",
      "url": "https://www.bbc.com/news/videos/cx2prn617nyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:57:14.000Z",
      "summary_90w": "",
      "raw": "The BBC's Russia editor, Steve Rosenberg, reports from joint manoeuvres by Russia and Belarus, as part of the Zapad 2025 (West 2025) military drills.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba1a69c28d42c1982858afe85fca23104d56d0f4",
      "title": "Israel demolishes more high-rise towers as Gaza City offensive ramps up",
      "url": "https://www.bbc.com/news/videos/cr5q8mj6nrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T15:40:30.000Z",
      "summary_90w": "",
      "raw": "BBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eee8d8b260d1c9436cb4fb0ee2c196cca114add9",
      "title": "Netanyahu does not rule out further strikes on Hamas leaders",
      "url": "https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:26:38.000Z",
      "summary_90w": "",
      "raw": "At a joint press conference with US Secretary of State Marco Rubio, Netanyahu said every country had the right \"to defend itself beyond its borders\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d47159d918f70d9f8b7ba0e4f6c53cd8827270f",
      "title": "Scam weight-loss drops marketed to Australians contain ‘basically salty water’, analysis finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/scam-weight-loss-product-marketed-australians-water-saline-solution-analysis-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:15.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Scientists from UNSW school of chemistry analyse sample of treatment, bought online and purported to mimic effects of Ozempic, and find nothing more than saline solution\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA scam weight-loss treatment marketed to Australians as an “oral solution” that mimics the effects of Ozempic contains nothing more than a watery saline solution similar to eye drops, analysis has revealed.\nGuardian Australia revealed last month that online “ghost stores” masquerading as Australian businesses had expanded into advertising weight-loss treatments and were impersonating real people to recommend their products.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "305330ee3d627852b37c80a944eee628218249be",
      "title": "Youth crime in regional NSW down 12% with even sharper drops in crime hotspots",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/youth-in-regional-nsw-down-12-with-even-sharper-drops-in-hotspots",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:14.000Z",
      "summary_90w": "",
      "raw": "New data shows far west and Orana region is down 42%, while car theft is down by almost 25% overall\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nYouth crime has dropped in regional New South Wales by more than 12% over the past two years, according to new data, with even sharper drops in crime hotspots including the area that takes in Moree.\nThe data from the Bureau of Crime Statistics and Research (Bocsar), which tracks the number of youth charged and issued a court attendance notice between June 2023 to June 2025, shows car theft in the regions has dropped by almost 25%, and break and enters and robbery offences have remained stable.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "406a7b208d86e7d05c1fa50963371fc4d8bb3ba4",
      "title": "The government has laid out the perils of the climate crisis – but will Albanese meet the moment?",
      "url": "https://www.theguardian.com/environment/2025/sep/16/the-government-has-laid-out-the-perils-of-the-climate-crisis-for-australia-but-will-it-meet-the-moment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:12.000Z",
      "summary_90w": "",
      "raw": "Grave remarks on the potential shocks to people, property and the economy are all too familiar. Putting a credible number on the emissions target is the harder part\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nIt is hard to imagine there will be a more important piece of work put out by the Albanese government in this term of parliament than the national climate risk assessment. It suggests that at more than 2C of global heating – a level we are headed towards on our current trajectory – the systems Australians rely on could start to crumble and collapse.\nThat’s an easy thing to say, but a hard thing to get your head around. There was a huge amount of information released on Monday, including an adaptation plan that is only the start of grappling with the problem, and it will take time to digest. But it is worth considering what the assessment led by the Australian Climate Service says about the country’s economic future if global emissions are not curbed and temperatures continue to rise.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f511cb5e98734050ed69f00865ef04b31c52c199",
      "title": "Shot dead for protesting against corruption in Nepal",
      "url": "https://www.bbc.com/news/articles/cm2zkmxlkm9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:57:52.000Z",
      "summary_90w": "",
      "raw": "Many young people were among more than 70 people killed in anti-corruption protests in Nepal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b70c9f777466deddfb2fcdaf1d9193dbf3b1d6",
      "title": "Who will win Champions League? BBC Sport experts make predictions",
      "url": "https://www.bbc.com/sport/football/articles/c1kwmjxwpkxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:37:36.000Z",
      "summary_90w": "",
      "raw": "BBC Sport experts predict their Champions League winners, which English team will get the furthest, a surprise package and which player excites them the most.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aa28ec246e79fbea659498ffe33b3d3cbb1ec608",
      "title": "Belarus and Russia's show of firepower appears to be a message to Europe",
      "url": "https://www.bbc.com/news/articles/cn95jxvn04eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:32:28.000Z",
      "summary_90w": "",
      "raw": "The Zapad-2025 military drills come just days after Poland accused Moscow of violating its air space with a drone incursion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ace77a88d8da2e30f26fe59956bfdf80512fc95",
      "title": "By popular demand: 10 extra exhibit tables open at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/by-popular-demand-10-extra-exhibit-tables-open-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Back by overwhelming demand, we’ve added 10 more exhibit tables to TechCrunch Disrupt 2025 — and this will be the final release before they sell out.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b239d1fbcf3bfa1eecd81682c90b95d4d1b397cc",
      "title": "Spanish PM calls for Israel to be barred from international sport",
      "url": "https://www.bbc.com/news/articles/c20e1m7vd2no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T14:25:18.000Z",
      "summary_90w": "",
      "raw": "Pedro Sánchez says Israel should be treated in the same way as Russia over its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "281ed7637d131be22ff995f95c90815475b1f969",
      "title": "'What a legend!' - Duplantis clears 6.30m to break pole vault world record",
      "url": "https://www.bbc.com/sport/athletics/videos/c237mlvl845o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:04:53.000Z",
      "summary_90w": "",
      "raw": "Armand Duplantis breaks the men's pole vault world record for the 14th time, clearing 6.30m attempt after winning gold at the World Athletics Championships in Tokyo.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc6f80b8dc824f2ea3ff3e065c0b715453e4277a",
      "title": "In first interview, Pope Leo XIV takes on billionaires, polarization and war",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542092/in-first-interview-pope-leo-xiv-takes-on-billionaires-polarization-and-war",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T14:01:46.000Z",
      "summary_90w": "",
      "raw": "Pope Leo XIV reflected on the legacy of Pope Francis and whether he sees himself as more U.S. American or Peruvian.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc20e754d1dbb524199e0e7eabb6017e33117031",
      "title": "Zoom’s Eric Yuan and Emergence’s Santi Subotovsky on navigating the second act, at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/zooms-eric-yuan-and-emergences-santi-subotovsky-on-navigating-the-second-act-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Zoom CEO Eric Yuan and Emergence Capital general partner Santi Subotovsky will join the Going Public Stage at Disrupt 2025 in a session called \"What Comes After Breakout Success?\" Join 10,000+ tech and VC leaders from October 27-29 in San Francisco.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "207ad0c999f105f5bfd383a842964f1b08d9245e",
      "title": "Men jailed for witchcraft murder plot against Zambia's president",
      "url": "https://www.bbc.com/news/articles/cjr57rr9598o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:36:02.000Z",
      "summary_90w": "",
      "raw": "The pair were sentenced to two years in prison after being found with charms, including a chameleon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98a71d5511b50e3bc45a8827ace99736f71a6e45",
      "title": "Conor McGregor ends bid to be Irish president",
      "url": "https://www.bbc.com/news/articles/cly9rnv54jno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:28:02.000Z",
      "summary_90w": "",
      "raw": "The MMA fighter says the decision comes after \"careful reflection\" and consultation with his family.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fe915159121b9ae3728fe6ccf3c677f50db91f8",
      "title": "US, China reach ‘framework’ deal for TikTok",
      "url": "https://techcrunch.com/2025/09/15/us-china-reach-framework-deal-for-tiktok/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T13:24:49.000Z",
      "summary_90w": "",
      "raw": "The \"framework\" deal with China is\n\"between two private parties, but the commercial terms have been agreed upon,\" CNBC quoted Bessent as saying on the sidelines of a meeting between the two countries in Madrid on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caeb16e649da1805e48e2c71fea5955e01b1a51d",
      "title": "India's top court suspends parts of contentious Muslim property law",
      "url": "https://www.bbc.com/news/articles/cgq4vx2l45no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:04:20.000Z",
      "summary_90w": "",
      "raw": "The court refused to strike down the entire law saying \"the grant of stay is only in the rarest of rare category\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bcd7a6ccc5a9b3f06b02a35b54ad3c88ae20ce6f",
      "title": "Spotify will now let free users pick and play tracks",
      "url": "https://techcrunch.com/2025/09/15/spotify-will-now-let-free-users-pick-and-play-tracks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "On Monday, the company announced that free users globally will now be able to search and play any song they want or play a song shared by a friend or an artist they follow on social media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3be4294a9ecdf25460a9ffbb87fe36626da181db",
      "title": "Cheating scandal rocks world stone skimming championships  ",
      "url": "https://www.bbc.com/news/articles/cp982r99rrmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T11:58:43.000Z",
      "summary_90w": "",
      "raw": "Several competitors on the Scottish island of Easdale used stones that were ground down to be perfectly circular.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17fd6e7987226a3829b516ca050181fdbfd3dea7",
      "title": "South Korea to review possible human rights violations in US raid on workers",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/south-korea-to-review-possible-human-rights-violation-after-us-raid-on-workers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T11:53:30.000Z",
      "summary_90w": "",
      "raw": "Lee Jae Myung says ‘bewildering’ incident may scare off future investment after Ice detained about 475 people\n\nUS politics live – latest updates\n\nSouth Korea’s government has said it will launch an investigation into whether human rights violations were committed when hundreds of its citizens were detained in a US immigration raid.\nAbout 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory in the US state of Georgia on 4 September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879dadf80061e3cff277e6fa1ea9b58dcdab064b",
      "title": "To save its rare birds, New Zealand is relying on a nation of backyard trappers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5508920/birds-new-zealand-conservation-invasive-species-predators-eradication",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T11:00:00.000Z",
      "summary_90w": "",
      "raw": "New Zealand's unique birds are at risk of extinction, like the kiwi. So the country is trying to eradicate the invasive species that prey on them. Everyday people are lining up to help.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f1a57b933a7bdf0fb3758e3a226f9dd3b801a63",
      "title": "What we know about the suspect arrested in Charlie Kirk's killing. And, Emmy takeaways",
      "url": "https://www.npr.org/2025/09/15/g-s1-88848/up-first-newsletter-charlie-kirk-shooting-investigation-middle-east-meetings-emmys-recap",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T10:42:32.000Z",
      "summary_90w": "",
      "raw": "Authorities say the suspect in the Charlie Kirk murder investigation is not cooperating. However, the people around him are. Here's what we know. And, takeaways from the 2025 Emmys.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e665ec773bbb259ec25a2513e1bd9fb2925d298b",
      "title": "Bali battles worst floods in more than a decade",
      "url": "https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:18:22.000Z",
      "summary_90w": "",
      "raw": "At least 17 dead as torrential downpours trigger landslides, while heavy rain lashes India, Pakistan and Australia\nAt least 17 people have been confirmed dead in Bali, Indonesia, after the island’s worst flooding in more than a decade.\nTorrential rain last Tuesday and Wednesday triggered widespread flooding and landslides, leaving a trail of destruction. Eight victims were found in Denpasar, the island’s capital, and rescue teams continue to search for several others who remain missing.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c76900fcf4ad49a2cb21c40c28f407a88e630ae6",
      "title": "A Utah church embarks on a healing journey in the aftermath of the Kirk assassination",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5541417/orem-utah-church-healing-charlie-kirk-assassination",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A church in Orem, Utah, the city where Charlie Kirk was killed, brings healing during its Sunday service. \"We're going to be navigating this as a community and as a church family for months to come.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db8b03e9757119836a6a0bf393b3b5bdbf922ef9",
      "title": "Democrats face an 'extinction moment' as strategists push them onto new platforms",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5484125/democrats-social-media-strategy-influencers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Prominent Democratic lawmakers and influencers are encouraging their fellow Democrats to embrace social media and online video to reach voters or risk being left behind.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ba9c6cffda714aa3cf269b6307e77264b840c9bc",
      "title": "Brazil's Lula hits back at Trump over Bolsonaro trial and tariffs",
      "url": "https://www.bbc.com/news/articles/cj3yxkkdlkvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:43:19.000Z",
      "summary_90w": "",
      "raw": "In an essay, he says Brazil's democracy and sovereignty \"are not on the table\" after clashes with the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7695f814927e386ec1b52d72640bd14608aac66",
      "title": "Monday briefing: Israel’s bombing of Qatar threatens the fabric of Gulf security",
      "url": "https://www.theguardian.com/world/2025/sep/15/monday-briefing-israels-bombing-of-qatar-threatens-the-fabric-of-gulf-security",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T05:36:33.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: For decades, Gulf states have believed that a close relationship with US will guarantee their safety. That is no longer the case\nGood morning. Last Monday, Israel’s foreign minister, Gideon Saar, announced that his country had accepted the US ceasefire proposal to end the devastating war in Gaza. The very next day, Israel attempted to kill Hamas’s negotiating team while they were in Qatar’s capital to discuss that same proposal.\nIsrael, initially bullish about the success of the operation, has since grown more doubtful that it killed any Hamas leaders in Doha. Hamas said that while six people were killed in the bombing – including the son of Khalil al-Hayya, the deputy head of its political bureau – the top leadership including the negotiating team survived.\nUK news | Britain will “never surrender” to far-right protesters who use the English flag as cover for violence and to instil fear, Keir Starmer has said, condemning attacks against police officers and racist harassment after more than 110,000 people attended an extremist London rally.\nCrime | Christian Brueckner, prime suspect in the disappearance of Madeleine McCann, has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, Scotland Yard has said.\nUS | The Utah governor, Spencer Cox, has said 22-year-old Tyler Robinson, the man accused of killing Turning Point USA executive director Charlie Kirk, “does come from a conservative family – but his ideology was very different than his family”. Robinson was not cooperating with authorities, said Cox.\nEurope | Poland’s foreign minister has said the Russian drone incursion into Polish airspace was an attempt by the Kremlin to test Nato’s reactions by incremental escalations without prompting a full-scale response, as Romania became the second Nato country to report an incursion in a matter of days.\nTelevision | It was a full sweep for Adolescence at the Emmys, winning every award in which the show was nominated tonight. Fifteen-year-old Owen Cooper made history as the youngest ever actor to win the Emmy for best supporting actor in a limited series. Emmy awards 2025 – full list of winners\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a877d42bb9dd3d18e601613b86e8c8bab0baa5a",
      "title": "Rising seas will threaten 1.5 million Australians by 2050 - report",
      "url": "https://www.bbc.com/news/articles/c930454e77xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T05:34:24.000Z",
      "summary_90w": "",
      "raw": "Australia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:51:12.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4aaf0b1519b1693ecda36ab19e69553918787683",
      "title": "Watch: Soda truck falls into sinkhole in Mexico City",
      "url": "https://www.bbc.com/news/videos/cj9zex1r3kjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T02:13:50.000Z",
      "summary_90w": "",
      "raw": "Initial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "812101fea2492226fe35c003b91ddef1c522d31c",
      "title": "Trump insists foreign workers are ‘welcome’ days after arrest of hundreds of South Koreans",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-foreign-workers-welcome-south-korea-arrests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T00:39:54.000Z",
      "summary_90w": "",
      "raw": "US president says he doesn’t want to ‘disincentivize investment’ after images of workers chained and handcuffed caused widespread alarm in South Korea\nPresident Donald Trump has said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platform, Trump wrote: “I don’t want to frighten off or disincentivize investment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d0baf61a59e44d4ce882f4771182b6f1cbe2e92",
      "title": "Madeleine McCann suspect refuses Met Police interview",
      "url": "https://www.bbc.com/news/articles/cr5qd18y8j5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:50:42.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner is due to be released from prison in Germany on a separate offence this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f20771bc1da7b4c5b72d164b114330cdf992415",
      "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
      "url": "https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:36:44.000Z",
      "summary_90w": "",
      "raw": "Why so many corn belt Americans continue to back Trump, even while feeling economic pressure driven partly by his trade policy",
      "topics": [
        "World"
      ]
    },
    {
      "id": "403bfa1b35100d874342d1236d3f7c72bc5db77c",
      "title": "'It's just scary': In Florida, parents ponder future with fewer vaccines",
      "url": "https://www.bbc.com/news/articles/cd07jn0m2y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:25:04.000Z",
      "summary_90w": "",
      "raw": "Florida is pushing to end vaccine mandates as RFK Jr, an immunisation sceptic, remakes US vaccine policy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c736b4edfca330c869707142f35cef62163afbc1",
      "title": "Struggling with brain fog? Here's how to fix it",
      "url": "https://www.bbc.com/news/articles/c87ydw7xdxvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:22:44.000Z",
      "summary_90w": "",
      "raw": "It's common to become forgetful or mentally sluggish but there are easy ways to cut through the haze.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee1bcd1710b1703ad3dc17e278c8fed6eeb14c6b",
      "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
      "url": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:02.000Z",
      "summary_90w": "",
      "raw": "Young Ugandan women tell BBC they are being lured to Dubai to take part in extreme sex acts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd12c04e0781a181213f7f387203dc7e0996d16a",
      "title": "'My wife died giving birth after Trump cut funding to our clinic'",
      "url": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T20:59:49.000Z",
      "summary_90w": "",
      "raw": "The BBC hears devastating accounts of Afghan mothers and babies dying after US-backed clinics shut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c32da42e9fdeae0a4b31d8d24406bc6fadbbb59",
      "title": "Brazilian musician identified as victim of 1976 killing by Argentina military",
      "url": "https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T09:00:29.000Z",
      "summary_90w": "",
      "raw": "The bossa nova pianist Francisco Tenório Cerqueira Júnior went out for cigarettes after a concert in Buenos Aires – a forensic team has finally revealed his fate\nEarly on 18 March 1976, Francisco Tenório Cerqueira Júnior, a Brazilian pianist who had played alongside some of Latin America’s greatest musicians, disappeared from the streets of Buenos Aires.\nFor nearly 50 years, his fate has remained a mystery, sparking desperate searches, raising suspicions of government complicity, and inspiring international documentaries. Now the mystery has been solved, with forensic scientists formally identifying Tenório Júnior’s body – and confirming he was a victim of Argentina’s bloody dictatorship.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c1f97911443d84721b26e55c9c27fa85500af2b",
      "title": "Chinese carmakers told to improve locking devices for UK market",
      "url": "https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T06:00:26.000Z",
      "summary_90w": "",
      "raw": "UK insurers require critical modifications for sale in country with higher levels of car theft than China\nBritish authorities may have certain concerns about the cyber-spying threat from vehicles made in China, but it turns out the country’s manufacturers have security worries of their own.\nInsurers have told Chinese carmakers they need critical modifications for vehicles on British streets: namely, tougher locking devices to make them harder to steal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac10d8c60c6fe1cc45f216508f7e0fc8a7c61df6",
      "title": "Malawi - where the petrol queue might overshadow the queue to vote",
      "url": "https://www.bbc.com/news/articles/cvgve3xnj02o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T00:05:43.000Z",
      "summary_90w": "",
      "raw": "With long petrol queues on city roads, everyday issues dominate in the run-up to Tuesday's vote.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73259b095d6d5210f90fba0eac436963f2ba28ac",
      "title": "'We knew the family': Utah town in disbelief after local resident accused of killing Charlie Kirk",
      "url": "https://www.bbc.com/news/articles/czew1nz17rro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:39:57.000Z",
      "summary_90w": "",
      "raw": "Tyler Robinson is accused of killing Charlie Kirk during an open-air speaking event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf87dacabbd7c88b7a4526ff5ddb23e836521f3c",
      "title": "Trump administration launches trial program to fast-track electric air taxis",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540722/faa-air-taxi-pilot-program",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T23:38:26.000Z",
      "summary_90w": "",
      "raw": "The FAA is seeking proposals for projects that will include piloted and unmanned operations with a focus on electric air taxis, also called an electric vertical takeoff and landing aircraft.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "47b3364a153c9626294b9d18d302d4ffead0140d",
      "title": "What to expect from the Emmys and how to watch the ceremony",
      "url": "https://www.bbc.com/news/articles/c1mxlm42l9vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:14:25.000Z",
      "summary_90w": "",
      "raw": "Owen Cooper and Stephen Graham from Netflix's Adolescence are among the nominees at this year's event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "927be21593572d03fe622495e4e91aafabd76d29",
      "title": "After fatal crash, Sikh truck drivers in the US fear backlash",
      "url": "https://www.bbc.com/news/articles/cy4rmymrl2ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:06:47.000Z",
      "summary_90w": "",
      "raw": "Sikh truck drivers say they've experienced an uptick in harassment after a fatal crash thrust them into the national spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd6ceb3988caed3aec42c88cbb7419d2377cf3aa",
      "title": "UN condemns reported Haitian village massacre by armed gangs",
      "url": "https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T22:26:51.000Z",
      "summary_90w": "",
      "raw": "Fishing village of Labodrie reportedly set on fire after killing of a gang leader in sign of rising violence outside capital\nThe UN secretary-general has condemned the reported killing of at least 40 people during an attack by armed gangs in a fishing village north of Haiti’s capital.\nMedia in Haiti widely reported that the attack took place on Thursday night in Labodrie. It is another sign of escalating gang violence that has spread outside the capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18893dcff66a1b089a75af6cffafc52b1e89584a",
      "title": "The Indian city that sparkles like Paris at night",
      "url": "https://www.bbc.com/news/articles/c14704vj4r2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T22:11:22.000Z",
      "summary_90w": "",
      "raw": "In 21 months, citizens have lit up 92 Kolkata landmarks with a simple model: your property, their lights.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db6fb4e100a8587a10354226fa8af622dde02f46",
      "title": "Mexican congressional staffer resigns after TV comments about Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T19:59:09.000Z",
      "summary_90w": "",
      "raw": "News network Milenio releases public apology after US deputy secretary of state threatens to revoke Mexican visas\nA congressional staffer from Mexico’s ruling party has resigned after being called out online for comments he made on a major Mexican television news program about Turning Point USA executive director Charlie Kirk’s murder.\nThe news network, Milenio, also released a public apology after the United States’ deputy secretary of state – a former ambassador to Mexico – evidently threatened to have Donald Trump’s presidential administration revoke any US visas on which it may count.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a87619aabc325ecc5b17cbadff1d38ab6cbc762",
      "title": "FAA seeks to fine Boeing $3.1 million for safety violations, door plug blowout",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540728/boeing-faa-safety-fines-door-plug-blowout",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T17:45:16.000Z",
      "summary_90w": "",
      "raw": "The FAA said it identified hundreds of quality system violations at Boeing's 737 factory in Renton, Wash., and Boeing subcontractor Spirit AeroSystems' 737 factory in Wichita, Kan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4976f072389d6e6b108dd1494ba10e71543b0f3",
      "title": "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540691/fed-governor-lisa-cook-vacation-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T15:23:53.000Z",
      "summary_90w": "",
      "raw": "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1b43aaf67255fc1b1bcb96fdd3a99b1aa69ed84e",
      "title": "'We escaped certain death': Israel intensifies Gaza City bombardment, forcing families to flee",
      "url": "https://www.bbc.com/news/articles/c20v15j9l3wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T13:15:19.000Z",
      "summary_90w": "",
      "raw": "A wave of heavy aerial attacks in recent days have triggered a surge in civilian displacement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db91a37c50ce90393fc7e83d725007b9a10be203",
      "title": "Kashmir's young are preserving history -  one post at a time",
      "url": "https://www.bbc.com/news/articles/crr2vq1r7w4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-12T23:50:39.000Z",
      "summary_90w": "",
      "raw": "Young Kashmiris are using social media to preserve language, heritage and identity through storytelling.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4b56e156c650fb548ddba8c7fddab2551c1b24e8",
      "title": "What's costing you more lately, and how is it affecting you? NPR wants to hear",
      "url": "https://www.npr.org/2025/09/12/g-s1-88442/cost-of-living-prices",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T22:03:20.000Z",
      "summary_90w": "",
      "raw": "The NPR Network is working on a series about the rising cost of living. We want to hear from you: What costs are going up, and how are you coping? How is it changing the way you live?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c62f31224017c8df6b4e1f818633947cd36e5ddf",
      "title": "Tipper Gore, Twisted Sister and the fight to put warning labels on music",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5460888/music-parental-advisory-sticker-tipper-gore",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T17:03:34.000Z",
      "summary_90w": "",
      "raw": "40 years ago, musicians faced off against a Washington committee over whether to warn parents about explicit lyrics.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f86ebe78fc516febccb7bb6e228cd3b49e564cbe",
      "title": "The Aristocrat, the Convict and the Missing Baby",
      "url": "https://www.bbc.co.uk/iplayer/live/bbctwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-07-14T14:30:00.000Z",
      "summary_90w": "",
      "raw": "An aristocrat and her convict partner go on the run with their newborn, ending in tragedy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}