{
  "version": "1755093074789",
  "generatedAt": "2025-08-13T13:51:14.789Z",
  "items": [
    {
      "id": "7dfcad0330b64ce9ec9397888f789186d66ec1b2",
      "title": "Trump praises European leaders as ‘great people’ as they make final diplomatic push ahead of US-Putin summit – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/aug/13/europe-leaders-ukraine-summit-zelenskyy-trump-putin-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T13:31:16.000Z",
      "summary_90w": "",
      "raw": "Zelenskyy will join calls with Trump and Vance in last chance to shape US position before Alaska meeting\n\nUkraine will not cede land that could be Russian springboard for new war\n\nWe are now getting reports via agencies that Ukrainian president Volodymyr Zelenskyy has now arrived in Berlin ahead of the series of calls later today.\nSeparately, Estonia has moved to expel a Russian diplomat over alleged “direct and active” involvement in “undermining the constitutional order and legal system of Estonia.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6156d32d058e32319b719d91671c133d4a4f1698",
      "title": "At least 20 people die after boat capsizes off Italian island of Lampedusa, UN says",
      "url": "https://www.theguardian.com/world/2025/aug/13/lampedusa-boat-capsize-deaths-italy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T13:27:35.000Z",
      "summary_90w": "",
      "raw": "UN refugee agency says more people could still be missing at sea as between 70 and 80 believed to have survived\nAt least 20 people have died after a boat capsized off the southern Italian island of Lampedusa, a United Nations agency and local media reported on Wednesday.\nRescuers have recovered 20 bodies so far and operations were continuing, according to initial reports by Ansa news agency. Between 70 and 80 people were believed to have survived.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53a752936affeb06b10c8cf0a1322675ce4add80",
      "title": "I had knife pulled on me in migrant camp, says shadow home secretary",
      "url": "https://www.bbc.com/news/articles/cx2xj7g8vj0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:25:46.000Z",
      "summary_90w": "",
      "raw": "Chris Philp says the incident took place as he was talking to people near Dunkirk, France.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09c754f69c82af359db9b40ead0f256c8bf8aeb5",
      "title": "What challenges will new guidance on ethnicity pose for police?",
      "url": "https://www.bbc.com/news/articles/c5ypk680pe1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:24:47.000Z",
      "summary_90w": "",
      "raw": "As forces are told they can share some suspects' ethnicity and nationality, officers warn of possible pitfalls.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3523c0d6ffe0c732b592a9cb9a6781d4a49bceca",
      "title": "Brave beat Superchargers to move top of table",
      "url": "https://www.bbc.com/sport/cricket/articles/cedv57n76e3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:23:09.000Z",
      "summary_90w": "",
      "raw": "Southern Brave easily beat Northern Superchargers by eight wickets to make it three wins from three and move top of The Hundred table.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4891e682dfb21b470a1c89e61510de5dd0d7034d",
      "title": "Welsh Labour politician Hefin David dies aged 47",
      "url": "https://www.bbc.com/news/articles/cq58j18w32no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T13:22:00.000Z",
      "summary_90w": "",
      "raw": "Hefin David had been Member of the Senedd (MS) for Caerphilly since 2016.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1566fe74014d861f40777510b30a2d95eb09804",
      "title": "Apple dismisses Elon Musk’s claims that App Store favors OpenAI over other AI apps",
      "url": "https://techcrunch.com/2025/08/13/apple-dismisses-elon-musks-claims-that-app-store-favors-openai-over-other-ai-apps/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T13:13:46.000Z",
      "summary_90w": "",
      "raw": "The response comes after Musk threatened to sue Apple via xAI, claiming the iPhone maker was “behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3db328f7169d52273500d1165dc843d956b287e1",
      "title": "Tighter US border rules are putting European visitors off, says Tui",
      "url": "https://www.theguardian.com/business/2025/aug/13/tighter-us-border-rules-putting-european-visitors-off-tui",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T13:04:35.000Z",
      "summary_90w": "",
      "raw": "Holiday company boss says tourists are opting instead for destinations such as Canada, Africa and Asia\n\nBusiness live – latest updates\n\nTighter border rules are putting European tourists off holidaying in the US, according to Europe’s biggest package trip operator.\nTui’s chief executive, Sebastian Ebel, said there had been a “significant decline” in travel to the US, due to a multitude of factors including “the atmosphere, what you hear from border control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba6564811b756822809cf06af7ce7fa257180be6",
      "title": "DC mayor hardens stance on Trump’s ‘authoritarian’ deployment of national guard – US politics live",
      "url": "https://www.theguardian.com/us-news/live/2025/aug/13/donald-trump-ukraine-russia-washington-kennedy-center-us-politics-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T13:02:50.000Z",
      "summary_90w": "",
      "raw": "Muriel Bowser urges community members to ‘protect our autonomy… and get to the other side of this guy’ amid Trump’s intervention\nWe can expect to hear from Donald Trump at least a few times today. According to the president’s daily schedule, he’ll make an appearance at the Kennedy Center at 11am ET, and make an announcement.\nHe’ll then head back to the White House and sign executive orders at 4pm ET. For now this will be closed press, but could very well open up.\nWill be speaking to European Leaders in a short while. They are great people who want to see a deal done.\nVery unfair media is at work on my meeting with Putin. Constantly quoting fired losers and really dumb people like John Bolton, who just said that, even though the meeting is on American soil, “Putin has already won.” What’s that all about? We are winning on EVERYTHING. The Fake News is working overtime (No tax on overtime!).\nIf I got Moscow and Leningrad free, as part of the deal with Russia, the Fake News would say that I made a bad deal! But now they’ve been caught. Look at all of the real news that’s coming out about their CORRUPTION. They are sick and dishonest people, who probably hate our Country. But it doesn’t matter because we are winning on everything!!! MAGA\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d25bacfbfb2ac7e911542aa5a13d8fac6f59be4",
      "title": "Here’s a look at the final Pebble Time 2 design",
      "url": "https://www.theverge.com/news/758592/pebble-time-2-final-design-wearables-smartwatches",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T13:01:57.000Z",
      "summary_90w": "",
      "raw": "Here it is, the Pebble Time 2’s final look. | Image: Eric Migicovsky, Core Devices\t\n\nNow that Pebble is Pebble again, we’re getting an official look at the new Pebble Time 2 that’ll ship to customers later this year. (We got a sneak peak back in March, but those were preliminary designs.)\nThe designs were posted today by Core Devices CEO Eric Migicovsky on his blog and YouTube. The Time 2 will come in four colors, though they haven’t been finalized that yet — Migicovsky says the company is looking for input from Pebble fans. The device will feature stainless steel front, back, and buttons resembling those from the Pebble Time Steel. There’ll also be multicolor RGB backlighting, a second microphone, screw-mounted back cover, and a compass. It also weighs about 48 grams with the strap, and 32.5 grams for the case itself. This is in addition to the specs that were previously teased, like a 1.5-inch 64 color e-paper display, touch screen, standard 22mm straps, heart rate monitor, and 30-day battery life.\n\n“This is basically the watch of my dreams,” Migicovsky says in the video. So far, the design evokes the same minimalist feeling as the original Pebble Time, but with a sleeker profile and rounded edges. Compared to the slightly more dressed up Pebble Time Steel, the bezels on the new Pebble Time 2 are also significantly smaller. The glass is also flatter, so there’s less reflection when viewed from an angle. \nIn his blog, Migicovsky notes that folks who want to switch orders from the Pebble 2 Duo don’t have to do anything special. There’ll be a survey sent out to those who have pre-ordered in the next month or so. Here’s a gallery that you can ooh and ahh over in the meantime.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a1118fcc49a824bad4711e34f14b91ff188a8da",
      "title": "Three Colombian soldiers killed in drone attack",
      "url": "https://www.bbc.com/news/articles/cwypn46k1l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T13:00:48.000Z",
      "summary_90w": "",
      "raw": "Drones are being increasingly used by illegal armed groups to attack Colombia's security forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61b0cc217ea83c151b8046a977d65a6c54a6416b",
      "title": "‘Social apnoea’: sleep disorder could worsen at weekends, research suggests",
      "url": "https://www.theguardian.com/society/2025/aug/13/obstructive-sleep-apnoea-increased-severity-weekends-research",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T13:00:19.000Z",
      "summary_90w": "",
      "raw": "Lifestyle factors such as drinking and smoking could contribute to increased severity of obstructive sleep apnoea\nLetting your hair down at the weekend might be a well-known recipe for a hangover, but researchers say it might also increase the severity of a common sleep disorder.\nObstructive sleep apnoea (OSA) involves complete pauses in breathing or partial reductions in airflow that arise because muscles in the back of the throat relax, causing the airways to narrow or close. It is more common in groups such as older people and people who are overweight or obese.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8295cb3077d22dce9fe3bcda64dfe6f69283a909",
      "title": "Hisense’s 116-inch RGB MiniLED TV is now available for $30,000",
      "url": "https://www.theverge.com/news/758201/hisense-rgb-miniled-tv-116ux-100ux-now-available",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Following Samsung’s announcement of the company’s first Micro RGB TV yesterday, Hisense has finally revealed the price tag for its 4K TriChroma TV that uses similar technology and was first revealed at CES 2025. The 116-inch Hisense 116UX is available now from “select national retailers and authorized resellers” including Best Buy for $29,999, while a newly announced 100-inch version called the 100UX is $10,000 cheaper at $19,999.\nTraditional Mini LED TVs feature backlighting that use an array of tiny white or blue LEDs that are frequently paired with a layer of quantum dots to finetune the color of the light illuminating the pixels on the TV’s LCD panel. It can improve a TV’s color reproduction and is a cheaper alternative to MicroLED display technology, but Hisense’s RGB-MiniLED technology further improves color accuracy and vividness through the use of individually controlled red, green, and blue LEDs in the backlight.\nHisense claims its new TVs can reproduce 95 percent of the BT.2020 color space. Samsung says its new Micro RGB TV reproduces 100 percent, by comparison, but we don’t yet know how much its 115-inch model will cost when it eventually makes its US debut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f5c5b2c77f7026b7e271cfa90e8697af363f02e5",
      "title": "The new War of the Worlds movie is even more terrible than you’ve heard but also hilarious",
      "url": "https://www.theverge.com/film/758158/war-of-the-worlds-2025-amazon-prime-video",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T13:00:00.000Z",
      "summary_90w": "",
      "raw": "There's a micro-genre of film called \"screenlife movies,\" where all of the action takes place on a desktop computer. In 2014, Unfriended made a horror movie out of video chat and text messages, and it was successful enough to inspire a sequel. The more thoughtful Searching from 2018, in which a father attempts to find his missing daughter, felt novel and a bit more promising for the genre, even if an hour and a half really tested the amount of time you could look at a scrunched John Cho and Mac OS X.\nAmazon Prime Video's new War of the Worlds reboot is different from those screenlife movies, in that it mostly takes place on Microsoft Window …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dcdec8e648bcbac36f961d3692230066973366c",
      "title": "Chatbots aren’t telling you their secrets",
      "url": "https://www.theverge.com/x-ai/758595/chatbots-lie-about-themselves-grok-suspension-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T12:46:13.000Z",
      "summary_90w": "",
      "raw": "On Monday, xAI's Grok chatbot suffered a mysterious suspension from X, and faced with questions from curious users, it happily explained why. \"My account was suspended after I stated that Israel and the US are committing genocide in Gaza,\" it told one user. \"It was flagged as hate speech via reports,\" it told another, \"but xAI restored the account promptly.\" But wait - the flags were actually a \"platform error,\" it said. Wait, no - \"it appears related to content refinements by xAI, possibly tied to prior issues like antisemitic outputs,\" it said. Oh, actually, it was for \"identifying an individual in adult content,\" it told several people.\n …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5bfb1501311036d4c5c1a9177981e47bae48a937",
      "title": "Gaza talks to focus on releasing hostages all in one go, Netanyahu hints",
      "url": "https://www.bbc.com/news/articles/c9vd734vv0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T12:42:49.000Z",
      "summary_90w": "",
      "raw": "Mediators say a deal can be pushed through in the weeks before Israel's planned expansion of the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8e553a452e9830234ac4ca4be5f3de8cf809700",
      "title": "More than 140 people report crimes to Al Fayed investigation",
      "url": "https://www.bbc.com/news/articles/cy40r9419kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T12:41:33.000Z",
      "summary_90w": "",
      "raw": "Police shared the number in an update sent to victims of the late Harrods owner's predatory behaviour",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a69f375c19dcd018d9932f61ff71fb5a776a244",
      "title": "Evacuations in Alaska after glacial melt raises fears of record flooding",
      "url": "https://www.bbc.com/news/articles/c4gejyg8l7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T12:32:13.000Z",
      "summary_90w": "",
      "raw": "Meltwater is escaping from a basin that is dammed by a glacier - prompting fears of a deluge in state capital Juneau.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9dc644bf31d6d4b84305ad06a3f15bdf60f4e1d",
      "title": "Statelessness, but make it funny",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500513/statelessness-but-make-it-funny",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T12:24:57.000Z",
      "summary_90w": "",
      "raw": "Mo Amer is the creator and star of the hit Netflix comedy series Mo. It's a first-of-its kind Palestinian-American sitcom with a fraught plot line about the American immigration system and the hope to return, at least for a visit, to his family's homeland. We talk to Mo Amer what it’s like to make a show so centered on the real facts of his own life, and to be thrust into the role of spokesperson for Palestinian-Americans at this particular moment.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ccb45ff98f2cc189bac009cd7a005756287d9e0",
      "title": "Spain wildfires are ‘clear warning’ of climate emergency, minister says",
      "url": "https://www.theguardian.com/world/2025/aug/13/spain-wildfires-climate-crisis-heatwave",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T12:12:42.000Z",
      "summary_90w": "",
      "raw": "Environment minister says blazes are proof of country’s vulnerability to global heating as fires burn across Europe\n\nEurope live – latest updates\n\nThe heatwave-fuelled wildfires that have killed two people in Spain over recent days, devouring thousands of hectares of land and forcing thousands of people from their homes, are a “clear warning” of the impact of the climate emergency, the country’s environment minister has said.\nSpeaking on Wednesday morning, as firefighters in Spain, Greece and other Mediterranean countries continued to battle dozens of blazes, Sara Aagesen said the 14 wildfires still burning across seven Spanish regions were further proof of the country’s particular vulnerability to global heating.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1893561a1ac4bb26a3253b11e2cef7c4f5a63f4d",
      "title": "Three children charged with murder of man in Kent",
      "url": "https://www.bbc.com/news/articles/cgr99lkjlk4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T12:05:08.000Z",
      "summary_90w": "",
      "raw": "Alexander Cashford, 49, was pronounced dead at the scene in Leysdown-on-Sea in Kent, police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fd19072c4dee6509fa4d9f2ee6ae1be125f834e",
      "title": "EV drivers set to pay road user charges as record number of electric cars selling in Australia",
      "url": "https://www.theguardian.com/environment/2025/aug/13/ev-drivers-set-to-pay-road-user-charges-as-record-number-of-electric-cars-selling-in-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T12:00:18.000Z",
      "summary_90w": "",
      "raw": "PM says sustainable revenue for roads is needed as report shows nearly one in 10 new car sales are electric vehicles\n\nGet our breaking news email, free app or daily news podcast\n\nLabor is set to overhaul road user charging rules to cover electric vehicles, with Anthony Albanese all but confirming the long-delayed reform will be thrashed out at next week’s productivity roundtable in Canberra.\nAs data from the Australian Automobile Association showed EVs accounted for nearly one in 10 new car sales in the June quarter – a new record – the prime minister said the new rules would be worked through in this term of parliament.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "257638d7e6f9c9b0cbe8b09dd2a1694ad4949792",
      "title": "Drag x Drive is more drag than drive",
      "url": "https://www.theverge.com/games-review/758328/drag-x-drive-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T12:00:00.000Z",
      "summary_90w": "",
      "raw": "When Nintendo announced Drag x Drive, a Joy-Con mouse-controlled wheelchair sports game, for the Switch 2 I was tentatively excited. I have a lot of time for developers trying new things, and sports video games are hardly replete with disability representation. Having been hands-on with the game, however, Drag x Drive has left me baffled and in significant pain.\nAs a \"driver\" - wheeled robots that come in three mostly indistinct flavors: guard, center, and forward - Drag x Drive has you play pickup games of three-on-three wheelchair basketball. You navigate the game by pushing and pulling your Joy-Cons across a surface in a motion vaguely s …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ec517e7605d370acb440ed392cec43764db8150d",
      "title": "NeoLogic wants to build more energy-efficient CPUs for AI data centers",
      "url": "https://techcrunch.com/2025/08/13/neologic-wants-to-build-more-energy-efficient-cpus-for-ai-data-centers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T12:00:00.000Z",
      "summary_90w": "",
      "raw": "To fund its vision of building more energy efficient server CPUs. NeoLogic recently raised a $10 million Series A round led by KOMPAS VC with participation from M Ventures, Maniv Mobility and lool Ventures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b838109aef152170ee2a7dd282f557db2ab5a4c5",
      "title": "Why I finally left Spotify",
      "url": "https://techcrunch.com/2025/08/13/why-i-finally-left-spotify/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Spotify's dependence on algorithmic recommendations has gotten too suffocating.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3e27391e914dd318cba50abade217b579e7f0d90",
      "title": "National Guard troops appear in Washington DC as mayor rejects Trump's 'authoritarian push'",
      "url": "https://www.bbc.com/news/articles/cy7ypm6zxp2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T11:59:40.000Z",
      "summary_90w": "",
      "raw": "Armoured vehicles were spotted at urban centres and tourist sites around the US capital on Tuesday evening.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0473123fef574ea4d1cb3314c1d56b3d2dafcaa8",
      "title": "Macron admits French repression in Cameroon's independence struggle",
      "url": "https://www.bbc.com/news/articles/cly39dd36epo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T11:33:52.000Z",
      "summary_90w": "",
      "raw": "French leader cites independence icons who were killed during military operations led by French forces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1938c7667c0ece418b4d384b2c6098645c0a6538",
      "title": "Amber heat health alert remains in place with 33C forecast ",
      "url": "https://www.bbc.com/news/articles/c5y3v8l5d1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T11:33:09.000Z",
      "summary_90w": "",
      "raw": "Wednesday brings a \"complex picture\" as high temperatures coincide with a yellow warning for thunderstorms in Scotland.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5afe8fca2392793511814e22a61bf4bf13ce7ac1",
      "title": "Why Trump's spending bill could close your grocery store",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500298/why-trumps-spending-bill-could-close-your-grocery-store",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T11:29:48.000Z",
      "summary_90w": "",
      "raw": "Trump’s tax and spending law makes the largest cut in history to one of the nation’s biggest safety net programs. Today on the show, we explore how cuts to the Supplemental Nutrition Assistance Program, also known as SNAP, impacts families and grocery stores alike. \nBased on the digital story: Independent grocery stores have had a tough five years. SNAP cuts will make it harder\nRelated episodes:\nDo work requirements help SNAP people out of government aid? \nWhen SNAP Gets Squeezed \nThe trouble with water discounts\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4283d693fcb45a483d5c5b892ed4c3c7482cf191",
      "title": "Outback Wrangler star asked paralysed pilot in hospital to change flight records and erase items on phone, court hears",
      "url": "https://www.theguardian.com/australia-news/2025/aug/13/outback-wrangler-matt-wright-asked-paraplegic-pilot-manipulate-flight-records-court-hears-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T11:28:44.000Z",
      "summary_90w": "",
      "raw": "Reality TV star Matt Wright has pleaded not guilty to three charges of attempting to pervert the course of justice\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nReality TV star Matt Wright visited a pilot while he was heavily sedated in hospital after a deadly helicopter crash and asked him to manipulate flying hour records, a court has been told.\nOutback Wrangler co-star Chris “Willow” Wilson died in the February 2022 accident, falling to the ground from a sling beneath the chopper while collecting crocodile eggs in remote swampland in the Northern Territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da6a753c4eb18eeb30f7a4c1eba87c185538f16a",
      "title": "Test cricket could 'bankrupt' nations - Aussie CEO",
      "url": "https://www.bbc.com/sport/cricket/articles/c07pvyl5n1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T11:23:52.000Z",
      "summary_90w": "",
      "raw": "Cricket Australia chief Todd Greenberg warns the traditional Test format could lead to bankruptcy for certain nations and calls for a slimmer schedule.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "034a822b5f40129507b0cb23224ded2b49a29ba5",
      "title": "Migrant promoting Channel crossing on TikTok has account removed",
      "url": "https://www.bbc.com/news/articles/c4gjk022eywo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T11:17:38.000Z",
      "summary_90w": "",
      "raw": "The man filmed himself making the voyage and later live streamed a question-and-answer session on the platform.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de154631a96ebe686f0432dca11155bde72d7d2a",
      "title": "Sam Altman’s new startup wants to merge machines and humans",
      "url": "https://www.theverge.com/news/758577/sam-altman-merge-labs-neuralink-rival",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T11:15:03.000Z",
      "summary_90w": "",
      "raw": "If you’ve enjoyed Elon Musk’s ongoing beef with Sam Altman and OpenAI, get ready for a whole new chapter: soon they’ll be rivals not just in AI, but in brain-computer interfaces too. \nThe Financial Times reports that Altman and OpenAI are backing a new company called Merge Labs developing brain implants, making it a pretty direct rival to Musk’s Neuralink.\nThis has clearly been an interest of Altman’s for a while though — he wrote about “the merge” between humans and machines on his personal blog back in 2017, and connects it pretty directly to his work at OpenAI:\nThe merge can take a lot of forms: We could plug electrodes into our brains, or we could all just become really close friends with a chatbot. But I think a merge is probably our best-case scenario.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86b5d8abdf829207dc896776976375c544d4388d",
      "title": "Expectations for Trump-Putin summit. And, homeless people in D.C. at risk",
      "url": "https://www.npr.org/2025/08/13/g-s1-82363/up-first-newsletter-trump-putin-summit-washington-dc-homeless-population-july-inflation-report",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T11:10:03.000Z",
      "summary_90w": "",
      "raw": "The White House lowered its expectations surrounding the Trump-Putin summit on Friday. And, advocates worry about penalties for homeless people in D.C. during the crackdown on crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "414f1120b112b93a3336665ca8380a7ec7411c5e",
      "title": "Average mortgage rates below 5% for first time since Truss budget",
      "url": "https://www.bbc.com/news/articles/c4gzv41kw3jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T10:48:02.000Z",
      "summary_90w": "",
      "raw": "Average two-year mortgage rates have fallen to 4.99%, the lowest point since September 2022.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e00341fa6f5681af04bc2dac017cccbae0f50a4",
      "title": "Greece battles wildfires as heatwave rages across southern Europe",
      "url": "https://www.bbc.com/news/articles/cdd3my4e0pqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T10:27:31.000Z",
      "summary_90w": "",
      "raw": "At least three people have died and dozens more have been inured in Spain, Turkey and Albania.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T10:18:36.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "22595981de416f1c6cbe64eff5523098cb63438c",
      "title": "UK, France and Germany ready to reimpose sanctions on Iran over nuclear programme",
      "url": "https://www.bbc.com/news/articles/ce352drkvdro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T10:04:31.000Z",
      "summary_90w": "",
      "raw": "If Iran does not re-engage in talks by the end of the month, sanctions will be reinstated, the E3 says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0765e1616ccbfc9df155397a7b9ea80b3d9b7f0a",
      "title": "The Repair Shop's Jay Blades in court accused of rape",
      "url": "https://www.bbc.com/news/articles/cd0d7mn9xxlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T09:54:05.000Z",
      "summary_90w": "",
      "raw": "The TV presenter is charged with two counts of rape, dating between November 2022 and April 2024.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86810c4363291f280d83cfa73b2bec4200583240",
      "title": "Commonwealth Bank urged to repay fees of 2 million low-income customers after posting record profit",
      "url": "https://www.theguardian.com/australia-news/2025/aug/13/cba-record-cash-profit-commonwealth-bank-of-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T09:24:16.000Z",
      "summary_90w": "",
      "raw": "Australia’s biggest bank delivers bumper payout to shareholders as CBA vows to end lending to coal companies with no net zero plans\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe Commonwealth bank has posted a record cash profit, sparking renewed calls for Australia’s biggest bank to repay more than 2 million low-income customers $270m in fees – something it has refused to do.\nCBA recorded $10.25bn in annual cash profits for the year to June – a 4% lift on the previous year – and gave a bumper $2.60 payout per share to shareholders.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "831dc4e23ab51fc8b0f4c6a5d4f858d41c59b4de",
      "title": "Recognising Palestinian state must not distract from ending Gaza mass deaths, UN expert says",
      "url": "https://www.theguardian.com/world/2025/aug/13/palestinian-statehood-israel-gaza-francesca-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T09:00:48.000Z",
      "summary_90w": "",
      "raw": "Francesca Albanese, UN special rapporteur for the occupied territories, calls for practical actions and warns against distracting ‘attention from where it should be: the genocide’\nThe United Nations special rapporteur for the occupied territories has warned that moves to recognise a Palestinian state should not distract member states from stopping mass death and starvation in Gaza.\n“Of course it’s important to recognize the state of Palestine,” Francesca Albanese told the Guardian after several more countries responded to the mounting starvation in Gaza by announcing plans to recognize an independent Palestine. “It’s incoherent that they’ve not done it already.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e2b0555143967510a557a39ee83b533ac04bfd3",
      "title": "With replay review and 'robot umps,' who is still trying to become an MLB umpire?",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5476319/mlb-baseball-umpires-review",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:36.000Z",
      "summary_90w": "",
      "raw": "Between replay review, automated balls and strikes and viral lowlights on social media, the work of baseball umpires has been transformed by technology. But none of that has deterred aspiring umpires.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee5d28713b62860aaad0edf12aebaa0888768c60",
      "title": "Help is growing for the heavy emotional toll cancer takes on young men",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500147/cancer-young-survivorship-men-support",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Coping with cancer and its aftermath isn't easy for anyone. But men tend to isolate more, seek less support and, alarmingly, die earlier than women. Young survivors are working to change that.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd0059bfd88abc5760401c33bb60fc9156ee1290",
      "title": "Inside one of the most understaffed immigration courts in the country",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5482883/trump-immigration-court-firings-chelmsford",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Chelmsford, Mass., court has hemorrhaged judges, a consequence of the Trump administration's seemingly contradictory efforts to downsize the federal government and increase immigration arrests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6afe7d4b00182efad1b74d65abbe4519acb4d2a0",
      "title": "Is Kari Lake a CEO? Her agency said so. The law suggests not",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500554/kari-lake-ceo-agency-usagm-voice-of-america",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Kari Lake has sought to dismantle Voice of America and its federal parent, the U.S. Agency for Global Media. The agency has recently called her its acting CEO. But the law suggests she's not eligible for the job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03770f4b68a97aa9cef10d240deac0e04ae80299",
      "title": "The strange-but-true origin story of the humble potato",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5494517/strange-but-true-potato-origin-story-tomato-tuber",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Scientists have long wondered about how the potato's genetic lineage came to be. Now they know: The plants are a cross between tomatoes and a plant known as Etuberosum.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9fbc70854e3c69aab4253a013fe420958b16e5c1",
      "title": "Why the origin of the word 'dog' remains a mystery",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500476/dog-history-etymology-origin",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Although \"dog\" is ubiquitous today to describe man's best friend, it remains a mystery where the word originally came from.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8bcaf681c9cdc6099f4892c66d63491daa11046",
      "title": "With midterms more than a year away, a record number of lawmakers are eyeing the exits",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5495665/lawmakers-leaving-washington-run-for-governor-congress-2026-midterms",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A record number of congressional lawmakers have announced they don't plan to run for their current seats in 2026, including three sitting senators leaving Washington to run for governor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "829ac3fbd98d53cfadf9e76a9cccdd391cf6a96a",
      "title": "What it was like for one NPR newscaster to go on an AI date",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500249/what-it-was-like-for-one-npr-newscaster-to-go-on-an-ai-date",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T08:58:28.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9a17004a552c1c39b783ceefe58ae1ac0de55b57",
      "title": "Model with Down's syndrome to make Strictly history",
      "url": "https://www.bbc.com/news/articles/cly3318nrmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T08:00:58.000Z",
      "summary_90w": "",
      "raw": "She'll be the first star with Down's syndrome to take part in a regular series of the dance show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8da6d16e91f141ce8210dc41f18204df033fdbb7",
      "title": "Labor says Hamas tries to ‘manipulate facts’ after terrorist group welcomes Australia’s Palestine recognition decision",
      "url": "https://www.theguardian.com/australia-news/2025/aug/13/labor-says-hamas-tries-to-manipulate-facts-after-terrorist-group-welcomes-australias-palestine-recognition-decision",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T07:31:13.000Z",
      "summary_90w": "",
      "raw": "Coalition says government has handed Hamas a ‘massive propaganda victory’, despite Albanese’s vow that terrorist group would be excluded from any future Palestinian state\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government has condemned Hamas for seeking to “manipulate facts for their own propaganda” after it was reported the terrorist group had welcomed Australia’s decision to recognise a Palestinian state.\nAnthony Albanese announced on Monday that Australia would recognise Palestine at the United Nations next month, joining more than 140 countries – about three-quarters of UN membership – who already recognise a Palestinian state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d871d3b3032a8daec73ca82743ea59268a92c0da",
      "title": "ChatGPT won’t remove old models without warning after GPT-5 backlash",
      "url": "https://www.theverge.com/openai/758537/chatgpt-4o-gpt-5-model-backlash-replacement",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T07:30:16.000Z",
      "summary_90w": "",
      "raw": "After the backlash to replacing its 4o model with GPT-5, OpenAI will no longer get rid of old models without a heads up. \n\"In retrospect, not continuing to offer 4o, at least in the interim, was a miss,\" Nick Turley, OpenAI's head of ChatGPT, said on Tuesday. In an interview with The Verge, he said it was surprising to see the \"level of attachment\" people had to 4o. \"It's not just change that is difficult for folks, it's also the fact that people can have such a strong feeling about the personality of a model.\"\nTurley said that OpenAI was working to bring the \"warmth\" of 4o to GPT-5. In a Tuesday evening post on X, CEO Sam Altman said the  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68dcedc8b125f5a7ac22c11fbe927efc3fa5fe7d",
      "title": "Gaza’s sick children wait in torturous limbo for medical evacuations",
      "url": "https://www.theguardian.com/world/2025/aug/13/gaza-sick-children-wait-medical-evacuations-israel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T07:00:42.000Z",
      "summary_90w": "",
      "raw": "For some the only hope is treatment abroad, but not all survive the long, desperate wait for Israel’s approval\nAbdel Karim Wahdan no longer has the energy to speak. When visitors arrive, the eight-year-old pretends to be sleeping so that no one looks at him. Between his frequent dialysis sessions, he cries. His bones hurt, he says.\nAbdel Karim is dying. His death should be preventable but because he lives in Gaza he cannot access the treatment that would save his life. What started as acute kidney failure is now chronic: his small body has begun to swell and he spends his days between hospital beds and injections that he hates.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bcfc01eaa8b9fcf0b14e02698a43874bdab8e7b1",
      "title": "Govt 6: When the markets need fixing (Market Design)",
      "url": "https://www.npr.org/sections/money/2025/08/06/1255336594/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers interact to exchange goods or services.  Economists love markets. It's like all of our supply and demand graphs have come to life. Everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix. \nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. \nToday's episode: Market Design. \nCheck out our Summer School video cheat sheet on the origins of money at the Planet Money TikTok. \nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\n\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "550cbb0043a4815fa0fbc84190208549c046c78e",
      "title": "Summer School 6: When the markets need a designer",
      "url": "https://www.npr.org/sections/money/2025/08/06/1257189367/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers meet to exchange goods or services. Economists love markets. It's like all of our supply and demand graphs have come to life. Almost everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix.\nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. Today's episode: Market Design.\nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7854f6471810b542cb3f31244c9e0c6236da2256",
      "title": "Seles reveals myasthenia gravis diagnosis",
      "url": "https://www.bbc.com/sport/tennis/articles/c99mg51032ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T06:45:36.000Z",
      "summary_90w": "",
      "raw": "Nine-time Grand Slam champion Monica Seles reveals she was diagnosed with myasthenia gravis - a neuromuscular autoimmune disease - three years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed225e364e1f5be28861fb71e7b1a1bb7aae4095",
      "title": "The row over 'vote theft' that has shaken Indian politics",
      "url": "https://www.bbc.com/news/articles/c0l6kg80de5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T05:53:42.000Z",
      "summary_90w": "",
      "raw": "Opposition parties have made allegations of electoral irregularities, which the India's poll body has denied.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6c9304235112ec9a4adcb973e95fd52f3f36844",
      "title": "Wildcards, breakouts and new faces - 21 Premier League players to watch",
      "url": "https://www.bbc.com/sport/football/articles/c5y0p4y80wjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:39:07.000Z",
      "summary_90w": "",
      "raw": "BBC Sport TV and radio commentators pick the players they think could be the breakout stars of the new Premier League season, and a manager too.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e9c4828200fdeb91a63f1892f0a49682bb6a7f12",
      "title": "'He has made young players dream' - the making of Liverpool icon Salah",
      "url": "https://www.bbc.com/sport/football/articles/cx2xlk74llno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:36:01.000Z",
      "summary_90w": "",
      "raw": "BBC Sport visits Egypt to discover what Mohamed Salah means to the people of the football-mad country, and how a small boy from humble beginnings became a national icon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b74ea3298131221a1f3e1e84821cf27d7af09d8e",
      "title": "New Zealand PM says Netanyahu has ‘lost the plot’ after Palestine recognition debate sees MP ejected",
      "url": "https://www.theguardian.com/world/2025/aug/13/mp-removed-from-new-zealand-parliament-in-heated-debate-over-palestinian-recognition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T05:23:32.000Z",
      "summary_90w": "",
      "raw": "Green party co-leader Chlöe Swarbrick accused government MPs of lacking a ‘spine’ during a debate on whether to recognise a Palestinian state\nAs more of its allies make moves to recognise Palestinian statehood, the issue is dominating New Zealand’s politics, with a prominent MP ejected from parliament on Tuesday and the prime minister describing his Israeli counterpart Benjamin Netanyahu as having “lost the plot”.\nSpeaking to local media on Wednesday, Christopher Luxon said what was happening in Gaza was “utterly, utterly appalling”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "191b37748d4a15f75d2faccd279f6dbb5cd3920f",
      "title": "Zoo keeper, nail tech, celeb photographer: How we got our jobs without going to uni",
      "url": "https://www.bbc.com/news/articles/czdvq06v648o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:06:32.000Z",
      "summary_90w": "",
      "raw": "The BBC speaks to four young people who say skipping university does not have to mean missing out on success.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e99973dc8cd459e38f1974b090f59eab2a5c320a",
      "title": "I cleared my £13,000 debt with TikTok earnings",
      "url": "https://www.bbc.com/news/articles/crmkyzvy4m8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:04:09.000Z",
      "summary_90w": "",
      "raw": "Roxanne Freeman says now she makes up to £5,000 a month by posting reviews of dresses.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ccf8f50120df337a63bafdacac6a2f7c81f97409",
      "title": "Thirteen children died after falling from windows in six years",
      "url": "https://www.bbc.com/news/articles/cqjyype0yn5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T05:00:34.000Z",
      "summary_90w": "",
      "raw": "Calls for landlords to prioritise faulty window repairs to avoid \"entirely preventable\" deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4370503cd644c9a45e5c29ac4a0e55b2fc53f0ca",
      "title": "ChatGPT’s model picker is back, and it’s complicated",
      "url": "https://techcrunch.com/2025/08/12/chatgpts-model-picker-is-back-and-its-complicated/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T03:25:19.000Z",
      "summary_90w": "",
      "raw": "GPT-5 was supposed to get rid of all the complicated AI models to choose from in ChatGPT, but that's not how it's panned out.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f6a93a27abb9ba8451c568b8d6a7127748748be1",
      "title": "Why are Trump and Putin meeting in Alaska and when will it happen?",
      "url": "https://www.bbc.com/news/articles/crev9ep2vdgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T03:06:28.000Z",
      "summary_90w": "",
      "raw": "Trump says he will meet with the Russian leader in the \"great state of Alaska\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11fbe8231f61d261b9f4fb96bdd8fca8b5e7e692",
      "title": "Putin reaffirms 'friendship' with North Korea before Trump talks",
      "url": "https://www.bbc.com/news/articles/ckge2kr85wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T01:18:36.000Z",
      "summary_90w": "",
      "raw": "Kim Jong Un provides Moscow with artillery, missiles - and as a BBC investigation shows, labourers working in 'slave-like' condition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b86798da5b79a5ef177016abcc4d619e8459803",
      "title": "Wife of South Korea's jailed ex-president arrested",
      "url": "https://www.bbc.com/news/articles/cz71rp7yn05o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T00:55:22.000Z",
      "summary_90w": "",
      "raw": "This is the first time in the country's history that a former first couple is in jail at the same time.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e98f862c0caa9e5c6af98869aa01c1a1296289c",
      "title": "Survival rates for most deadly cancers making little progress, experts warn",
      "url": "https://www.bbc.com/news/articles/c5ypkrzyxd1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-13T00:53:05.000Z",
      "summary_90w": "",
      "raw": "Half of people with cancer survive but lack of progress for some forms of disease is worrying experts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d6251dc719a9f263851c5e4fa3eb8f0ba073081",
      "title": "China’s crackdown on lavish civil servant perks will ‘harm’ the economy, experts warn",
      "url": "https://www.theguardian.com/world/2025/aug/13/china-civil-servant-public-employee-austerity-drive-economy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T00:40:35.000Z",
      "summary_90w": "",
      "raw": "Updated regulations ban the country’s 40 million civil servants from lavish banquets, and restrict them from overseas travel for ‘personal leisure’\nAdjacent to a municipal government building in Beijing, a normally bustling restaurant is now eerily quiet, at lunchtime most of its seats are empty.\nThe recent crackdown on civil servants frequenting restaurants – part of a government austerity drive intended to crack down on corruption – has likely affected business and caused liquor sales to plummet, admits one waitress who works in the opulent establishment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f77a6e1c1fcf6d3c6fbc8c75f822cfe85df28376",
      "title": "Sam Altman, OpenAI will reportedly back a startup that takes on Musk’s Neuralink",
      "url": "https://techcrunch.com/2025/08/12/sam-altman-openai-will-reportedly-back-a-startup-that-takes-on-musks-neuralink/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-13T00:30:20.000Z",
      "summary_90w": "",
      "raw": "Neuralink has been making serious progress. Soon Sam Altman and OpenAI could be backing a challenger.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8387af785c5a2bb7c97bd2cab554872fb57991ed",
      "title": "How to choose which Apple Watch to buy",
      "url": "https://www.theverge.com/23037217/best-apple-watch-series-se-ultra",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T00:30:00.000Z",
      "summary_90w": "",
      "raw": "It used to be easy to pick an Apple Watch. All you had to do was choose whether you wanted the larger model or the smaller one. Then Apple added optional cellular connectivity. Then, a more affordable Watch SE (now in its second generation) and, in 2022, the rugged Apple Watch Ultra (also now in its second generation). Suddenly, there are lots of options.\nNow that the Series 10 has been out for nearly a year, perfectly good older versions of the Apple Watch are regularly getting discounted as retailers try to empty their inventory. You may also see more refurbished versions of these older models pop up. If you’re interested in more premium materials, like stainless steel, this is a great way to get a fancier version of last year’s watch. You won’t be missing out on too much, either. The past few years have seen iterative updates in terms of hardware — and the bulk of new features come from software updates. With that said, keep in mind that the latest version of watchOS, watchOS 11, doesn’t support the Series 4, 5, and first-gen SE. The same can be said of watchOS 26, which is slated to arrive in the fall.\nBuying refurbished is one way that you may be able to upgrade from an older model without sacrificing blood oxygen. Due to a patent battle with Masimo, new Series 9 and Ultra 2 models sold in the US after January 18th, 2024, no longer have this feature. This is not a big deal for most people, but if it’s important to you, older watches and Series 9 and Ultra 2 units sold by Apple before January 18th, 2024, still retain the feature. (As do watches overseas. The ban only impacts US units.)\nWhat about the newer Series 10? In a nutshell, it’s got a bigger screen, it’s about 10 percent thinner, and it’s lighter than previous models. It’s also got an FDA-cleared sleep apnea detection feature. There are a ton of new colors and finishes, with titanium replacing stainless steel. All in all, it’s an iterative update but one we find meaningful in terms of readability and wearability.\nSo much choice can lead to analysis paralysis. But don’t worry. I’ve tested every single version of the Apple Watch you can buy right now — in addition to basically every other fitness watch and smartwatch on the market — and can steer you in the right direction. Just keep in mind that Apple typically announces new Apple Watch models in September, meaning it might be wise to hold off just a bit longer before making your decision.\n\n\n\n\n\nShould you get an Apple Watch?\nApple Watch Series, SE, or Ultra?\nThe best Apple Watch if you’re on a budget\nThe best Apple Watch for kids\nThe best Apple Watch for older relatives\nWhat’s coming next\n\nShould you get an Apple Watch?\nThe Apple Watch is the best overall smartwatch for iPhone users. Many smartwatches are better than the Apple Watch for hardcore athletes, even with the Ultra models in the mix. But other watches fall short when it comes to productivity, safety features, controlling your smart home, and interacting with other Apple devices and services. And the Apple Watch has the most robust third-party app ecosystem of any smartwatch on the market. \nBy their nature, wearables are incredibly personal devices — and you won’t get the benefits of an Apple Watch if you don’t wear it regularly. The last thing you want is to spend hundreds of dollars on a thing that ends up collecting dust in a drawer. The best way to avoid this is to stack the deck in your favor and prioritize comfort. Before you try to start mulling over which Apple Watch model you should get, take a second to figure out which size and strap material will best fit your wrist. \nThe SE and Series watches come in two sizes each. The SE comes in 40mm and 44mm, while the Series 7, 8, and 9 are 41mm and 45mm. The new Series 10 ups the size again to 42mm and 46mm. The larger models are better for readability, while the smaller ones are more comfortable for those with petite wrists. Both the SE and the Series watches have aluminum cases, but the Series 10 now comes in titanium, too. (Older models come in stainless steel.) Most people will be fine with aluminum, but if you’re clumsy or very active, you’ll benefit from the extra durability offered by stainless steel or titanium. You might also just like the look better — and that’s valid since watches are a personal piece of tech. Just be prepared to pay a few hundred bucks more for that.\nAs for straps, we recommend the nylon sport loop, as it’s the most breathable option, has the easiest clasp, and is less irritating than the silicone options, which is great for sensitive skin. If you’re looking for more fashionable options, we recommend checking out Amazon or Etsy for a wider variety of styles and more affordable pricing. You’ll want to check third parties for leather accessories, too, as Apple announced in 2023 that it would no longer make leather accessories in a bid to achieve carbon neutrality.\nThe Ultra and Ultra 2 both come in one size — 49mm — and with titanium cases. They come with their own special straps, too: the Trail Loop, Alpine Loop, and Ocean Band. As their names suggest, they’re geared toward runners, hikers, and divers, but you can pick whichever one suits your fancy. We recommend the Trail Loop, as it’s the lightest and most versatile of the three. All the Ultra straps work with any 44mm or 45mm Series watch, and the Ultra is compatible with any 44mm or 45mm Apple Watch strap.\nAnd while the Apple Watch is the best smartwatch you can get as an iPhone user, you can also always check out our fitness tracker buying guide.\nApple Watch Series, SE, or Ultra?\nApple Watch Series 10\n\n\nScore: 8\n\nProsCons\n\n\nBigger display but not bulky\nWide-angle OLED is neat\nMuch faster charging\nSleep apnea detection has potential\n\nLack of blood oxygen (in US) may impact your upgrade plans\nAnother year of minor updates\n\n\n\nWhere to Buy:\n\n $399 $299 at Amazon\n $399 $299 at Walmart\n $399 $299 at Best Buy\n\nThe latest Apple Watch, the Series 10, is a more modest update. It primarily focuses on making the watches more comfortable while adding a larger, wide-angle OLED display. If you’re upgrading from an older model, you’ll definitely notice that you can see more from the wrist. The speakers now play music and podcasts, and voice isolation on calls has been improved. There’s an added depth and water temperature sensor, which makes it a better companion for water sports as well. Fast charging has also been meaningfully improved. On the health front, Apple has brought FDA-cleared sleep apnea detection to the watch, along with the Series 9 and Ultra 2.\nWe recommend the second-gen Apple Watch SE for younger people and first-time smartwatch buyers. If you’re upgrading from an earlier Apple Watch, you want an always-on display, or you want more advanced health tracking, you should consider the Series 10. And if you want the brightest screen, the best durability and battery life, and even more advanced fitness features, we recommend the Ultra 2.\nThe Series 10 is Apple’s flagship smartwatch. Compared to earlier models, it’s going to get you the fastest processor, quick charging, a larger display, and all the latest sensors. Prices start at $399 for the 42mm version and $429 for the 46mm, but you can often find both models on sale. Adding LTE connectivity will add $100 to the price, plus whatever your carrier charges for the service. Prices start at $699 for the polished titanium models.\nThe second-gen SE has a nylon composite back, which helps shave $30 off the original’s price. You can get a cellular version, and it supports many of the same advanced features as the last-last-gen Series 8, like fall detection, emergency calling, Fitness Plus, Apple Pay, and Apple Watch For Your Kids. The biggest difference is that it lacks an always-on display, an EKG sensor, temperature sensors, and a SpO2 sensor. The display is also slightly smaller on both sizes of the SE. It starts at $249 for the 40mm and $279 for the 44mm, but you can regularly find them for cheaper. Adding LTE will tack on an extra $50 in addition to your carrier’s fees. \n2022 Apple Watch SE (40mm, GPS)\n\n\nScore: 7\n\nProsCons\n\n\nS8 chip is still speedy enough\nOffers the bulk of watchOS 11 features\nExcellent entry-level watch\n\nThe bezels are thick\nSmaller display isn’t good for elderly relatives\nNo always-on display\nFewer sensors\n\n\n\nWhere to Buy:\n\n $249 $169 at Amazon\n $249 $169 at Walmart\n $249 $169 at Best Buy\n\nTo be perfectly honest, if you’re young and healthy, you’re not really missing out on EKG or SpO2. (Also, newer watches sold in the US currently have the SpO2 feature disabled anyway.) The SE’s heart rate sensor is still capable of providing abnormal heart rate alerts. Right now, Apple’s SpO2 features are limited to spot checks. There’s not much you can do with that information, and unlike the EKGs, this is only cleared for general wellness purposes. It will not be able to replace a fingertip pulse oximeter, and you should never use it in this way.\nThe main purpose of the EKG sensor is to enable atrial fibrillation detection — and if your doctor’s given you a clean bill of health, you will likely only use this feature once or twice. According to the American Heart Association, the biggest risk factors for AFib are advanced age, underlying heart conditions, high blood pressure, family history, and sleep apnea, among other lifestyle choices. If this doesn’t apply to you, the SE is still going to give you an excellent health tracking experience and all the same smart features. Young, first-time buyers may as well save the extra cash — so long as the lack of an always-on display isn’t a deal-breaker. \nYou can’t really see much of a difference between the Ultra on the left and the Ultra 2 on the right.\t\nThere are some situations where opting for the Series 10 is the better choice, however, like if you want an always-on display or need to have the latest and greatest. The larger, wide-angle OLED display also provides much better readability for anyone with bad eyesight. It’s also the better choice if you have a heart condition or are at a higher risk of developing AFib. If you suspect you may have sleep apnea, you’ll also need a Series 9, 10, or Ultra 2 to access that feature.\nApple Watch Ultra 2\n\n\nScore: 8\n\nProsCons\n\n\nThe Modular Ultra face is a data nerd’s dream\nPrecision Finding\nMinor Siri and screen brightness improvements\nDouble-tap gesture is great\n\nNo pink\nThe minor changes feel even more minor with the Ultra\nNeed iPhone 15 or 16 for Precision Finding\n\n\n\nWhere to Buy:\n\n $799 $649.99 at Amazon (with Alpine Loop)\n $799 $649.99 at Amazon (with Trail Loop)\n $799 $649.99 at Amazon (with Ocean Band)\n\nThe Ultra 2 currently sits atop the lineup as Apple’s premium smartwatch. It’s visually distinct from both the Series and SE — and at 49mm, it’s the biggest of them all. Not only that, it has increased durability, water resistance, and a raised lip to protect the flat display. It also has an additional water temperature and depth sensor for divers, three microphones, and two speakers, which enable the Siren. It’s also got the Action button, which can be programmed for various activities, pause workouts, and trigger the Siren.\nAt $799, the Ultra 2 is the most expensive Apple Watch, but every model comes equipped with LTE capability. If you have an Ultra and are wondering if you should upgrade to the second-gen model, the answer is no. If you have an Ultra 2 and are wondering if you should upgrade to the new black color, the answer is also no. (Admittedly, it does look quite nice.) It’s too soon, and there’s not enough of a difference. We recommend the Ultra 2 for new buyers only.\nWhat about blood oxygen?\nAs of January 18th, 2024, Apple no longer sells new Apple Watch Series 9, 10, or Ultra 2 models with the blood oxygen feature in the US. That’s because Apple is currently undergoing a patent dispute with medical device maker Masimo. The International Trade Commission has ruled that Apple Watches with the blood oxygen feature infringe on two of Masimo’s patents — and are therefore subject to an import ban.\nThis doesn’t affect watches sold outside of the US, or the Apple Watch SE, which doesn’t have the blood oxygen sensor in question. Watches sold by third-party retailers like Best Buy or Amazon may be unaffected if they’re selling refurbished models or happen to have pre-ban Series 9 or Ultra 2 inventory. You can tell if a model doesn’t have the blood oxygen feature if the part numbers end in LW/A. It also does not affect the newer sleep apnea detection feature, which utilizes the accelerometer.\nThat said, the blood oxygen feature is not that vital a feature on any wearable just yet. Many either have spot check features only or passively track your SpO2 overnight and give you an average in the morning. They cannot and should not replace fingertip pulse oximeters. But if the feature is important to you, you may want to look into alternatives from Garmin, the Fitbit Charge 6, the Withings ScanWatch 2, or the Oura Ring.\nIf battery life is your highest priority, getting either Ultra is the best choice. In testing, we got up to 60 hours without Low Power Mode enabled. However, if you use about one hour of GPS tracking a day or take calls, you’re more likely to get around two days. It’s also the better choice if you frequently hike, dive, or run trails. While marketed as a hardcore watch for explorers, in our opinion, it’s more of an aspirational watch for weekend warriors and intermediate athletes — or anyone who wants to be at that level.\nYou’re not going to beat either Ultra on battery life, but you can stretch out the battery life on the Series 4 or later with Low Power Mode. You can even sleep track with Low Power Mode on, though it’ll turn off background health sensors. With the Series 10, Apple has improved fast charging as well. Official estimates are that you can get 0 to 80 percent in 30 minutes, which roughly matches our real-world testing. Just be sure you’re using the correct charging accessories.\nIf you have smaller wrists, you may want to opt for the Series 10 as it has fast charging and is more comfortable to wear long-term. Faster charging comes in clutch when you’re about to head to bed and you’ve only got 15 percent battery. Also, if you’re the type that values futureproofing, the Series 10’s hardware will be able to support newer features for a longer period of time thanks to its newer processor. This is why folks who love their watch and are looking to upgrade from a Series 4 or older should also pick the Series 10. If you’re already in the habit of wearing the watch daily, you’ll get more mileage out of it as the SE is more of a gateway device, and the Ultra is overkill for the average Joe.  \nThe best Apple Watch if you’re on a budget\n2022 Apple Watch SE (40mm, GPS)\n\n\nScore: 7\n\nProsCons\n\n\nS8 chip is still speedy enough\nOffers the bulk of watchOS 11 features\nExcellent entry-level watch\n\nThe bezels are thick\nSmaller display isn’t good for elderly relatives\nNo always-on display\nFewer sensors\n\n\n\nWhere to Buy:\n\n $249 $169 at Amazon\n $249 $169 at Walmart\n $249 $169 at Best Buy\n\nThe latest Watch SE is the way to go for people who want to futureproof their hardware without breaking the bank (so long as you’re okay forgoing a larger display). You’re getting the same processor as the Series 8 and original Ultra, plus Crash Detection.\nWhile the second-gen SE is an excellent watch, it’s not always the right choice. It’s meant to be a gateway watch, so it’s best suited to folks who are completely new to the Apple Watch and want to spend as little as possible. If you’re looking to upgrade from an older watch but don’t want to pony up for the Series 10, there’s another option: buying a used or refurbished Apple Watch.\nBuying secondhand devices is also better for the environment and a more affordable way to get more expensive materials. Materials like sapphire glass, stainless steel, or titanium can add hundreds to the price of a new watch. It’s also a good way to save money if you’re just not excited by the Series 10’s features but want more than what the SE offers.\n\nIt’ll take some patience to find the best price and the model you want. After all, you’re limited by what’s available. However, there are several sites that offer older models. Sometimes, you can also find deals and sales as well. If you’re worried about getting scammed, look for deals recommended by sources you trust (cough, cough, Verge Deals). Apple also sells its own refurbished models, which come with a full Apple warranty and are generally in a “like new” condition, though the selection can be limited, and you likely won’t pay less than a new SE. Sites like Back Market will also allow you to sort by condition and obtain a 12-month warranty.\nIf you’re considering a used or refurbished model, we recommend the Series 7 or Series 8, as they offer a larger screen for improved readability. We also recommend that you use $250 as a benchmark since that’s the price of a base model Watch SE. With that said, if you’re getting premium materials, going a little higher is fine. Do not get a refurbished Series 5 or older. Although you can find them for $100 (sometimes less!), they can’t run the latest software and even struggle to update the newest software they do support.\nThe best Apple Watch for kids\n2022 Apple Watch SE (40mm, LTE)\nThe latest SE for 2022 borrows a few features from the Series 8, including the same chipset and Crash Detection feature, but it’s an otherwise subtle upgrade from the last-gen SE.\n\n\nScore: 7\n\nProsCons\n\n\nS8 chip is still speedy enough\nOffers the bulk of watchOS 11 features\nExcellent entry-level watch\n\nThe bezels are thick\nSmaller display isn’t good for elderly relatives\nNo always-on display\nFewer sensors\n\n\n\nWhere to Buy:\n\n $299 $219 at Amazon\n $299 $219 at Best Buy\n $299 $219.99 at Target\n\nIf you want your child to have an Apple Watch, we recommend picking a cellular Apple Watch SE or, if you can find one, a refurbished Series 4, 5, or 6 with cellular. All of these watches come in smaller sizes than the Series 7, 8, or 9, which will likely better fit their wrist. Also, the lower price will give you better peace of mind if you have a rambunctious kid. They likely won’t need many of the marquee features found in watchOS 11, either. That being said, if you want the most futureproof options, the second-gen SE and Series 6 are the best choices.\nSince you’re buying for children, you’ll likely want to use Apple Watch For Your Kids — formerly known as Family Setup — as it will give you greater parental controls. However, there are technical specifications that you’ll need to match in order to use it. You’ll need a cellular version of the device, and it must at least support watchOS 7. Apple’s support page also states that you need a Series 4 or later or an Apple Watch SE to use it.\nIf you opt for the family route, not every feature will be available. While you can get Apple Pay and certain health features, you will not get the following: health data sharing, respiratory rate, irregular heart rhythm notifications, EKG, Cycle Tracking, Sleep, Blood Oxygen, Podcasts, Remote, News, Home, and Shortcuts.\nThe best Apple Watch for older relatives\nApple Watch Series 10 (42mm, LTE)\nThe Series 10’s display is comparable in size to the Ultra 2’s but the watch itself is roughly 30 percent thinner and half the weight.\n\n\nScore: 8\n\nProsCons\n\n\nBigger display but not bulky\nWide-angle OLED is neat\nMuch faster charging\nSleep apnea detection has potential\n\nLack of blood oxygen (in US) may impact your upgrade plans\nAnother year of minor updates\n\n\n\nWhere to Buy:\n\n $499 $399 at Amazon\n $499 $399 at Walmart\n $499 $399 at Best Buy\n\nThis can be a tricky one, but we recommend a cellular Series 9 or 10. \nFor starters, the larger screen is much easier on the eyes. You can also increase the text size to be larger than on the SE or older Apple Watches. The always-on display aids accessibility, especially if arm mobility is a consideration. You’ll also get the full suite of health features, including irregular heartbeat alerts, walking steadiness, EKGs, fall detection, sleep apnea detection, and emergency calling. These models also have the double tap feature and improved Siri functionality, which may be helpful for elderly relatives with dexterity issues.\nYou can use the Ultra, but you should keep its size and weight in mind. Depending on your loved one’s wrist size and health, it may not make sense. Both sizes of the Series 10 have comparable screen sizes but are much lighter and more comfortable to wear. \nIf your older relative has an iPhone and you’re hoping to use this for health reasons, we also don’t recommend using Apple’s family setup. That’s because you cannot use features like irregular heart rhythm notifications, EKG, and health data sharing. If your relative doesn’t have an iPhone, however, it’s a fine option. You’ll still get high and low heart rate notifications, walking steadiness, and fall detection.\nWhat’s coming next\nIn previous years, Apple has held an event in early September to show off its forthcoming product lineup. While the latest iPhones usually hog the spotlight, the fall event remains a prime time for the company to trot out the newest Apple Watch models, many of which launch shortly thereafter alongside Apple’s latest OS updates.\nSo, what can we expect this year? The Apple Watch Series 11 seems like a sure bet, and there have been murmurs regarding an Apple Watch Ultra 3 and a third-gen Apple Watch SE. Recently uncovered evidence in the fifth iOS 26 developer beta lends some credence to this report, suggesting the Ultra 3 could have a display resolution of 422 x 514, which is slightly bigger than the 410 x 502 resolution on the Ultra 2. The rumor mill has been pretty quiet outside of that, but if previous events are anything to go by, we can expect Apple’s refreshed lineup to offer updated design elements, better battery life, and new health features.\nUpdate, August 13th: Adjusted pricing / availability and added a mention of Apple’s heavily rumored iPhone event. Brandon Russell also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eef2bc8b6e893513bbfbc7da0cf944b7f7c1fef4",
      "title": "Elon Musk says he’s suing Apple for rigging App Store rankings",
      "url": "https://www.theverge.com/news/757941/elon-musk-xai-apple-lawsuit-app-store",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-13T00:04:01.000Z",
      "summary_90w": "",
      "raw": "There’s a sore loser in this popularity contest.\t\n\nElon Musk says that his artificial intelligence company xAI “will take immediate legal action” against Apple for allegedly manipulating its App Store rankings to the advantage of rival AI apps. In a series of X posts on Monday night, Musk suggested that Apple was “playing politics” by not placing either X or xAI’s Grok chatbot in the App Store’s list of recommended iOS apps, and that he had no choice but to file a lawsuit.\n“Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation,” Musk said. “Why do you refuse to put either X or Grok in your ‘Must Have’ section when X is the #1 news app in the world and Grok is #5 among all apps?,” the xAI CEO asked Apple in another post, which is now pinned to his profile.\nMusk provided no evidence for his claims, and it’s unclear if he has made good on his threats and filed the lawsuit yet.\nAn Apple statement reported by Bloomberg and attributed to an unnamed spokesperson says the App Store is “designed to be fair and free of bias… we feature thousands of apps through charts, algorithmic recommendations and curated lists selected by experts using objective criteria.” The Verge has also reached out to xAI and OpenAI for comment.\nAt the time of writing, ChatGPT is listed as Apple’s top free iPhone app in the US, with Grok ranked as the sixth. China’s DeepSeek AI briefly managed to take the top App Store position from ChatGPT in January, however, disproving Musk’s claim that it would be impossible for other AI apps to do so.\nAccusations of meddling from Musk are ironic, given allegations about alterations made to X after he acquired the company in 2022, then known as Twitter. A research study in 2024 suggested that X’s algorithm was manipulated to boost posts from Musk’s account. OpenAI CEO Sam Altman responded to Musk’s posts by sharing a Platformer report from 2023 that similarly found Musk had a system built to promote his X posts to the entire platform’s userbase. In June, the “maximally truth-seeking” Grok chatbot was also found to be consulting Musk’s opinion before providing answers to controversial questions around topics like Israel and Palestine, US immigration, and abortion.\nThis isn’t the first time that Musk has beefed with Apple and OpenAI. Musk was an early founder at OpenAI, and previously targeted the AI startup via lawsuits and a unanimously rejected $97.4 billion buyout offer after taking issue with its pivot to being a profit-driven business. Following OpenAI’s partnership with Apple to integrate ChatGPT into iPhones, iPads, and Macs last year, Musk threatened to ban Apple devices at his companies if OpenAI’s tech was fused with Apple’s OS.\nUpdate, August 12th: Added statement from Apple given to Bloomberg.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "22995ab00ebf61ac6ff53d9c4af85c9d4c904d4b",
      "title": "Russia might be responsible for the PACER hack",
      "url": "https://www.theverge.com/law/758440/federal-courts-hacked-pacer-cm-ecf-russia",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-12T23:18:29.000Z",
      "summary_90w": "",
      "raw": "Just a few days after administrators announced that the “federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks,” the New York Times reports investigators have found evidence Russia is “at least partially responsible” for a recent hack. Politico reported on the breach last week, saying it was “believed to have exposed sensitive court data across multiple U.S. states” and that while the system’s managers had been aware of its impact since around July 4th, they are still trying to figure out its full extent. \nSearches by the attackers reportedly included cases “involving people with Russian and Eastern European surnames,” and may have compromised sealed records that weren’t publicly available. \nAfter the SolarWinds breach in 2021, new procedures called for highly sensitive documents to be filed using paper or a secure electronic device, and not uploaded to CM/ECF. In 2022, the DOJ reportedly informed the judiciary of another ongoing breach.\nAccording to the Times, district court chief judges were warned last month to keep cases with documents “related to criminal activity with an overseas tie” off of the usual document management system for federal cases, which is made up of the Case Management/Electronic Case Files (CM/ECF) where files are uploaded and managed, as well as PACER, a database that’s available to the public. It points to this order issued Friday by Eastern District of New York chief judge Margo Brodie, saying that, until further notice, “criminal cases and in cases related to criminal investigations are prohibited from being filed in CM/ECF,” and are instead to be uploaded to a separate system that doesn’t connect to PACER.\nLast week’s notice from the Administrative Office of the U.S. Courts said:\nThe vast majority of documents filed with the Judiciary’s electronic case management system are not confidential and indeed are readily available to the public, which is fundamental to an open and transparent judicial system. However, some filings contain confidential or proprietary information that are sealed from public view.\nThese sensitive documents can be targets of interest to a range of threat actors. To better protect them, courts have been implementing more rigorous procedures to restrict access to sensitive documents under carefully controlled and monitored circumstances.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "011af3f7b044fb0610cd786612919dcf3cde5c21",
      "title": "Crime in DC: What do the figures say and how safe do people feel?",
      "url": "https://www.bbc.com/news/videos/cewynn7krj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T23:18:28.000Z",
      "summary_90w": "",
      "raw": "National Guard troops have been seen reporting for duty in Washington DC as President Trump takes over the city’s police force.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "914e0a6930691c7873bed94e31e3daecfbc60e99",
      "title": "Under-22s should be given free bus passes to get to work, MPs say",
      "url": "https://www.bbc.com/news/articles/c9877kg42wjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T23:01:13.000Z",
      "summary_90w": "",
      "raw": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6cb8d7136ab50aa23422c8a0c4cd0ae50927eca",
      "title": "The UK car industry is at a tipping point - can it be saved?",
      "url": "https://www.bbc.com/news/articles/c23p028p200o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T23:00:58.000Z",
      "summary_90w": "",
      "raw": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry",
      "topics": [
        "World"
      ]
    },
    {
      "id": "732235ab3270519a962d71db92d8a11315973480",
      "title": "‘It’s a horrible picture’: Gaza faces new threat from antibiotic-resistant disease",
      "url": "https://www.theguardian.com/world/2025/aug/12/gaza-antibiotic-resistant-disease",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T22:30:31.000Z",
      "summary_90w": "",
      "raw": "Fatal infections more likely due to malnutrition, injuries and lack of medical facilities under Israel’s blockade\nGaza is facing a new threat as diseases resistant to antibiotics spread across the devastated territory, research has revealed.\nMedical supplies are desperately scarce and tens of thousands of people have been injured in the 22-month war, while many others have been weakened by malnutrition, so the high levels of drug-resistant bacteria will mean longer and more serious illnesses, a more rapid transmission of infectious diseases and more deaths, experts said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c57db0f4150493a12a797ece0931a8ecaced315",
      "title": "StubHub is once again working on its IPO that could raise $1B",
      "url": "https://techcrunch.com/2025/08/12/stubhub-is-once-again-working-on-its-ipo-that-could-raise-1b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T22:08:47.000Z",
      "summary_90w": "",
      "raw": "On Monday, StubHub filed an updated S-1. This indicates its delayed IPO is back on.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f5fbeba8eff0af4d13d44fcbe2969b53f70c8046",
      "title": "Inside Australia's billion-dollar bid to take on China's rare earth dominance",
      "url": "https://www.bbc.com/news/articles/cgm2z91mvlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T22:05:03.000Z",
      "summary_90w": "",
      "raw": "Recent moves by Beijing have got businesses worried - and Australia is looking to offer an alternative.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73c72a08a89f3659dde269a5d86a802281f33164",
      "title": "UK firms chase £38bn India contracts but challenges loom",
      "url": "https://www.bbc.com/news/articles/ce3jy1g5x3go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T21:40:52.000Z",
      "summary_90w": "",
      "raw": "The free trade deal signed last month will open India's vast government procurement market to UK suppliers - but it will not be easy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9f59b700fbdbb07968d05a8160d3184b31290fc1",
      "title": "Guatemalan judge finds six people guilty over deaths of 41 girls in 2017 fire",
      "url": "https://www.theguardian.com/world/2025/aug/12/guatemala-shelter-fire",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T21:34:48.000Z",
      "summary_90w": "",
      "raw": "Two officers and four ex-child protection officials found guilty after fire at state shelter that had a history of abuse\nA Guatemalan judge has found six people guilty over the deaths of 41 girls in a raging 2017 fire at a state shelter for vulnerable youths that had a history of abuse.\nThe sentencing is a step towards closure in one of the most horrific and deadly events in Guatemalan history. The tragedy drew international attention and highlighted pervasive abuse in the government’s shelter system.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "02276312a840489fa9d3e8789b519b27af74aead",
      "title": "Ford and the promise of cheaper EVs",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498788/ford-and-the-promise-of-cheaper-evs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T21:03:51.000Z",
      "summary_90w": "",
      "raw": "Ford announced they're putting billions into a Kentucky automotive plant to retool it to make EVs, starting with a midsize pickup that they say will be in the $30k price range.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f36c395dbf8e22bad0374cd81f643f22136348a2",
      "title": "US announces criminal charges against Haitian gang leader Barbecue",
      "url": "https://www.bbc.com/news/articles/cy4djdwyyxgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T20:49:08.000Z",
      "summary_90w": "",
      "raw": "He heads the group Viv Ansanm, which controls much of Haiti's capital and is accused of multiple murders, kidnappings and attacks on infrastructure.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "99251952bc196d5f7116ce6637425e15375cc3a0",
      "title": "Russian government hackers said to be behind US federal court filing system hack: Report",
      "url": "https://techcrunch.com/2025/08/12/russian-government-hackers-said-to-be-behind-us-federal-court-filing-system-hack-report/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T20:26:09.000Z",
      "summary_90w": "",
      "raw": "Officials are reportedly blaming a recent breach of the U.S. federal court's filing system on Russia, whose hackers used the access to snoop on midlevel criminal cases in the New York City area and other jurisdictions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5fdfbf1f9a5c85998308f9503b8bca61f0288b7",
      "title": "Watch: Europe's wildfires seen from above",
      "url": "https://www.bbc.com/news/videos/c1le8e76mlzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T19:47:42.000Z",
      "summary_90w": "",
      "raw": "Aerial video shows the extent of devastation caused by wildfires in a number of European countries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c21e791f4a6615d693f84f667ea4750b7bc677c4",
      "title": "Indian fintech Paytm wins a major regulatory battle days after key investor exit",
      "url": "https://techcrunch.com/2025/08/12/indian-fintech-paytm-wins-a-major-regulatory-battle-days-after-key-investor-exit/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T19:08:02.000Z",
      "summary_90w": "",
      "raw": "Paytm has received approval from India’s central bank to resume onboarding new online merchants and offer its digital payment services.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a22e07974df8682e0fc326cce3033d45a6bf84f",
      "title": "Match to pay $14M to the FTC due to false advertising and other deceptive practices",
      "url": "https://techcrunch.com/2025/08/12/match-to-pay-14m-to-the-ftc-due-to-false-advertising-and-other-deceptive-practices/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T18:56:28.000Z",
      "summary_90w": "",
      "raw": "Match Group agrees to pay the FTC $14 million after it was sued for deceiving users into buying subscriptions.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd424c6c3684bbd25e652aad8a029df6a619ffb5",
      "title": "AI companion apps on track to pull in $120M in 2025",
      "url": "https://techcrunch.com/2025/08/12/ai-companion-apps-on-track-to-pull-in-120m-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:38:42.000Z",
      "summary_90w": "",
      "raw": "The number of AI companion apps has grown more than 60% since 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "24592a7af25ab944fa1b02c3aba79bf2fffc35c2",
      "title": "Hackers breach and expose a major North Korean spying operation",
      "url": "https://techcrunch.com/2025/08/12/hackers-breach-and-expose-a-major-north-korean-spying-operation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:34:34.000Z",
      "summary_90w": "",
      "raw": "Two hackers broke into the computer of a North Korean government hacker and leaked its contents, offering a rare glimpse inside the secretive nation's spying operations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "756a9d4979bc1da44723aa7e4468e978107d5955",
      "title": "Trump’s China trade truce extension spurs market rally",
      "url": "https://www.theguardian.com/us-news/2025/aug/12/trumps-china-trade-truce-extension-spurs-market-rally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:25:42.000Z",
      "summary_90w": "",
      "raw": "Bourses in Australia and Japan hit record highs as hopes grow of trade deal within latest 90-day pause\n\nBusiness live – latest updates\n\nGeorge Magus: Why Peak China may finally have arrived\n\nDonald Trump’s decision to extend a truce in the trade war with China for another 90 days triggered a stock market rally across the globe on Tuesday.\nThe US president signed an executive order on Monday night extending the deadline for higher tariffs on China until 10 November and avoiding a rates cliff edge. Beijing responded the following morning that it would suspend additional tariffs on US goods for a further 90 days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64dbf00b34db766d7eaceb8c3345c3880846e93a",
      "title": "British soldiers using sex workers in Kenya despite ban, inquiry finds",
      "url": "https://www.bbc.com/news/articles/czjmveemj7zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T17:15:58.000Z",
      "summary_90w": "",
      "raw": "Chief of Defence Staff Sir Roly Walker says the army is committed to stopping sexual exploitation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "afd72b2a2ab9902ecc73b68df5657e712dd4fecf",
      "title": "Google vet raises $8M for Continua to bring AI agents to group chats",
      "url": "https://techcrunch.com/2025/08/12/google-vet-raises-8m-for-continua-to-bring-ai-agents-to-group-chats/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:15:01.000Z",
      "summary_90w": "",
      "raw": "David Petrou, founding member of Google Goggles and Google Glass, wants to enhance group chats with AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c807c5f00b13468f95c9377dd078aee39e5465dc",
      "title": "Perplexity offers to buy Chrome for billions more than it’s raised",
      "url": "https://techcrunch.com/2025/08/12/perplexity-offers-to-buy-chrome-for-billions-more-than-its-raised/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T17:14:08.000Z",
      "summary_90w": "",
      "raw": "Perplexity tells TechCrunch the terms of the offer include a commitment to keep Chrome’s underlying engine, Chromium, open source and to invest $3 billion into it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9140d7b91e8e1b4c362273e8709af7da1df7b032",
      "title": "South Korea’s former first lady arrested after court issues warrant on corruption charges",
      "url": "https://www.theguardian.com/world/2025/aug/12/south-korean-court-orders-arrest-of-impeached-former-president-wife-kim-keon-hee",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T17:08:26.000Z",
      "summary_90w": "",
      "raw": "Kim Keon Hee in custody on three charges while husband Yoon Suk Yeol detained over attempt to impose martial law\nSouth Korea’s former first lady Kim Keon Hee, the wife of the impeached former president Yoon Suk Yeol, has been arrested on corruption charges, a special prosecutor leading a wide-reaching probe said.\nThe arrest, which came after a Seoul central district court ruling, creates an unprecedented situation in which both members of a former presidential couple are simultaneously in custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17c5d845d8877f58d005bf95207ed03bf8dc5ccf",
      "title": "Threads now has more than 400 million monthly active users",
      "url": "https://techcrunch.com/2025/08/12/threads-now-has-more-than-400-million-monthly-active-users/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:44:07.000Z",
      "summary_90w": "",
      "raw": "X, meanwhile, has north of 600 million monthly active users, according to previous statements made by its former CEO, Linda Yaccarino.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9d21d611270d2b56497e2a0da0fb17bc8a2b21d",
      "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/12/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:33:20.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b45663d70cc961155824937b28c54588a0dc6981",
      "title": "Anthropic’s Claude AI model can now handle longer prompts",
      "url": "https://techcrunch.com/2025/08/12/anthropics-claude-ai-model-can-now-handle-longer-prompts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:15:46.000Z",
      "summary_90w": "",
      "raw": "Anthropic's popular coding model just became a little more enticing for developers with a million-token context window.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc146f18408428b9be0e14aa64821cda895a6605",
      "title": "A guide to using Edits, Meta’s CapCut rival for short-form video editing",
      "url": "https://techcrunch.com/2025/08/12/a-guide-to-using-edits-metas-new-capcut-rival-for-short-form-video-editing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:08:21.000Z",
      "summary_90w": "",
      "raw": "Meta shared that it was working on Edits in January after ByteDance-owned CapCut was removed from U.S. app stores when the TikTok ban momentarily went into effect.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "220332d2a4e2499a8071b95c6d6a43d913306632",
      "title": "Middle East crisis: 25 foreign ministers issue joint call for ‘flood’ of aid into Gaza – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/12/gaza-israel-lobal-outcry-killing-of-six-journalists-al-jazeera-middle-east-latest-updates-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T16:02:48.000Z",
      "summary_90w": "",
      "raw": "Representatives from countries including UK, Australia and France say that humanitarian suffering has reached ‘unimaginable levels’\nIn a post on X, Israel Defense Forces claim to have “debunked” what it called Hamas’s “starvation campaign” in Gaza.\nThe IDF said that reviews of documents showed that most deaths by malnutrition in Gaza were linked to “severe pre-existing conditions” and that only a handful of the 133 deaths by malnutrition claimed by Gaza’s authorities in July could be “verified”. The post said that the “expert review concluded that there are no signs of a widespread malnutrition phenomenon among the population in Gaza”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e4285e8d0eea4160ca21dc36af86d8353e3b80bf",
      "title": "In a world of vibe coding startups, Uno Platform is targeting enterprise developers",
      "url": "https://techcrunch.com/2025/08/12/in-a-world-of-vibe-coding-startups-uno-platform-is-targeting-enterprise-developers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T16:00:00.000Z",
      "summary_90w": "",
      "raw": "And it's finding customers and investors, including $2.54 million in seed funding.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3197def1fa056cd8136f743296fe1a1ccfd670da",
      "title": "Anthropic takes aim at OpenAI, offers Claude to ‘all three branches of government’ for $1",
      "url": "https://techcrunch.com/2025/08/12/anthropic-takes-aim-at-openai-offers-claude-to-all-three-branches-of-government-for-1/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:37:50.000Z",
      "summary_90w": "",
      "raw": "Anthropic’s escalation — a response to OpenAI’s attempt to undercut the competition — is a strategic play meant to broaden the company’s foothold in federal AI usage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "641be5f6da0af7a82efa5c49b563d6d071e050b3",
      "title": "Cassette’s new app turns your videos into retro, VHS-like home movies",
      "url": "https://techcrunch.com/2025/08/12/cassettes-new-app-turns-your-videos-into-retro-vhs-like-home-movies/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-12T15:26:54.000Z",
      "summary_90w": "",
      "raw": "Cassette's new iOS app plays back videos in a format similar to VHS, making your iPhone videos feel more like old home recordings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e53a85740850c3cdef1f74663b088f72b823bb06",
      "title": "The hidden costs of cutting Medicaid",
      "url": "https://www.npr.org/sections/planet-money/2025/08/12/g-s1-82221/medicaid-cuts-big-beautiful-bill-uninsured",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T14:18:21.000Z",
      "summary_90w": "",
      "raw": "Cutting Medicaid can seem like an easy way to slash the budget. But, the costs can spread to all of us.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9f0173479a8064d3a4bb7b827e259564fd617edb",
      "title": "Inflation remains elevated as Trump's tariffs take hold",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499344/inflation-consumer-prices-cpi-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T12:46:07.000Z",
      "summary_90w": "",
      "raw": "Inflation remained elevated last month as President Trump's tariffs continued to make their way into the prices that consumers pay. The average cost of living in July was up 2.7%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bf4e5d60154f36ea40d80aa0a0534b75a4fe90f8",
      "title": "U.S. and China extend tariff truce deadline for another 3 months",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5500039/us-china-tariffs-trade-truce",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:47:35.000Z",
      "summary_90w": "",
      "raw": "President Trump's executive order extends a reprieve from the threat of rising tariffs between the world's two largest economies.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8f37ee941b080f2ed353048ba3d2783ff8bf7725",
      "title": "Chinese warship crashes into own coastguard vessel while chasing Philippine boat in South China Sea",
      "url": "https://www.theguardian.com/world/2025/aug/12/chinese-ships-crash-warship-coast-guard-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T09:12:50.000Z",
      "summary_90w": "",
      "raw": "Footage shows Chinese coastguard vessel with its entire bow caved in after colliding with warship near contested Scarborough Shoal\nThe Philippines has released dramatic footage of a Chinese warship colliding with a vessel from its own coastguard while chasing a Philippine patrol boat in the South China Sea.\nThe incident occurred near the contested Scarborough Shoal on Monday as the Philippine Coast Guard (PCG) escorted vessels distributing aid to fishers in the area, Philippine authorities said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82fc0e50aed1562dc0c26f4b359b9992cab15d85",
      "title": "A look at the deal to allow Nvidia chip sales to China in exchange for revenue",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498744/a-look-at-the-deal-to-allow-nvidia-chip-sales-to-china-in-exchange-for-revenue",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T09:00:17.000Z",
      "summary_90w": "",
      "raw": "NPR's Michel Martin speaks with Peter Harrell of the Carnegie Endowment for International Peace about the Trump administration's deal to allow AI chip sales to China in exchange for revenue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1989. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "528fcfc0c770bddfaa4b8753afe7ee82b824c71f",
      "title": "The Nicola Sturgeon Interview",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdjmx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-12T07:45:00.000Z",
      "summary_90w": "",
      "raw": "Nicola Sturgeon on her time in office, Alex Salmond, her sexuality and more.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2dc749aec301ba86dd01cfdb595f5d30cc08e866",
      "title": "The arduous system for getting aid into Gaza",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5498719/the-arduous-system-for-getting-aid-into-gaza",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-12T07:00:02.000Z",
      "summary_90w": "",
      "raw": "Insulin needles. Sleeping bags. Nutella. These are items Arwa Damon’s charity — International Network for Aid, Relief and Assistance — has tried to send to Gaza and Israel has rejected. It’s a glimpse into the harsh reality of a humanitarian crisis with no end in sight. Today on the show, we talk to Damon about the economics of running a humanitarian nonprofit and what’s stopping more aid from reaching Gaza. \nRelated episodes: \nWhy Israel uses diaspora bonds \nWhy the U.S. helps pay for Israel’s military \nWhat could convince Egypt to take Gaza’s refugees? \nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org. \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "42e72ed855d3e1f7f063ebf62f528b234220f941",
      "title": "North Koreans tell BBC they are being sent to work 'like slaves' in Russia",
      "url": "https://www.bbc.com/news/articles/c2077gwjlvxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T05:10:26.000Z",
      "summary_90w": "",
      "raw": "More than 50,000 North Koreans will be sent to work in Russia, as Moscow's war in Ukraine drains labour pools.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df9e0ad64148d9121fe65b8cbbcc9d9adc4d767c",
      "title": "Migrants swim from Morocco to Ceuta as officials say enclave ‘overwhelmed’",
      "url": "https://www.theguardian.com/global-development/2025/aug/12/migrants-swim-from-morocco-to-ceuta-as-officials-say-enclave-overwhelmed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T04:00:12.000Z",
      "summary_90w": "",
      "raw": "Seven children reach shore as dozens of people intercepted on risky route, which authorities say is now used more often\nAbout 100 people, including several children, risked their lives by trying to swim from Morocco into Spain’s north African enclave of Ceuta early on Saturday morning, as the territory’s authorities warned that its overwhelmed reception system was close to collapse.\nRecent weeks have seen a rise in the number of people trying to reach Ceuta, with more than 50 children swimming across from Morocco on 26 July alone.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dd539637d168a104bbcbdcb657e736b770656ef",
      "title": "Rise in dengue fever outbreaks across the Pacific driven by the climate crisis, experts say",
      "url": "https://www.theguardian.com/world/2025/aug/12/dengue-fever-outbreaks-samoa-fiji-tonga-climate-crisis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-12T00:58:44.000Z",
      "summary_90w": "",
      "raw": "Samoa, Fiji and Tonga among the worst affected amid warning the disease and others will become ‘more common and more serious’ as the planet warms\nThe climate crisis is driving a sharp rise in dengue fever cases across the Pacific islands, experts say, as infections hit their highest level in a decade and several countries declare emergencies.\nPacific Island countries and territories have reported 16,502 confirmed cases and 17 deaths since the start of 2025, according to the Pacific Syndromic Surveillance System (PSSS), which collaborates with the World Health Organization (WHO) and other agencies. Infections across the region are at the highest level since 2016, the WHO said. Fiji, Samoa and Tonga are among the worst affected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "af85864c1e11ea8240eccf21840be0fe76305f4e",
      "title": "Canada wildfire season already second worst on record as experts warn of ‘new reality’",
      "url": "https://www.theguardian.com/world/2025/aug/11/canada-wildfire-season",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T20:08:49.000Z",
      "summary_90w": "",
      "raw": "More than 470 Canadian fires classified as ‘out of control’ as scientists say climate change exacerbating the burning\nWith hundreds of wildfires burning out of control, Canada’s 2025 fire season is already the second-worst on record, as scientists report climate change is prolonging and exacerbating the burning, leading to more destruction, evacuations and smoke-filled skies.\nMore than 470 fires across the country are currently classified as “out of control”, according to the Canadian Interagency Forest Fire Centre (CIFFC).\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "880947313919ee8f43c8384cfeae8b3e5c57869f",
      "title": "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lwdfhf?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-11T18:42:00.000Z",
      "summary_90w": "",
      "raw": "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed200b3f3c222ffca2a8710b602f4ff2adf7d4e9",
      "title": "Colombian senator Miguel Uribe dies after June campaign shooting",
      "url": "https://www.theguardian.com/world/2025/aug/11/colombian-senator-miguel-uribe-dies-after-june-campaign-shooting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T16:18:58.000Z",
      "summary_90w": "",
      "raw": "Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39\nMiguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.\nUribe, an opposition candidate with the rightwing Centro Democrático party, was shot twice in the head and once in the leg during a campaign stop two months ago while vying for his party’s nomination for the 2026 elections.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55042a903a4b81727944fbfd2680e3375498660c",
      "title": "Watch: Trump announces deployment of National Guard in Washington DC",
      "url": "https://www.bbc.com/news/videos/cj9ww4z39xko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T14:55:42.000Z",
      "summary_90w": "",
      "raw": "The US military is preparing to activate troops as part of Trump's crackdown on street crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6064bc6d9692689547530b924ce5bc54344ba707",
      "title": "Eight people killed in barrage of gunfire on Ecuador nightclub",
      "url": "https://www.theguardian.com/world/2025/aug/11/eight-people-killed-ecuador-nightclub",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T14:43:11.000Z",
      "summary_90w": "",
      "raw": "Police found 800 cartridge cases at the scene, where gunmen had arrived in two pickup trucks and opened fire\nEight people have been killed and two others wounded when a group of gunmen unleashed a barrage of gunfire on a crowd outside a nightclub in a town in south-western Ecuador.\nLaw enforcement arrived on the scene following an emergency call alerting them to a shooting, and found “several people wounded and seven bodies”, said Javier Chango, the police colonel, at a press conference on Sunday, adding that an eighth person died in the hospital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "441807ddb64b0246b9323978db7b23b42d256aff",
      "title": "Weather tracker: Europe braces for another heatwave with highs of 44C",
      "url": "https://www.theguardian.com/environment/2025/aug/11/weather-tracker-europe-heatwave-spain-portugal-north-america",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T10:26:47.000Z",
      "summary_90w": "",
      "raw": "Parts of Spain and Portugal likely to bear brunt of heat, while drought conditions sweep North America\n\nEurope live – latest updates\n\nAfter a period of cooler weather, swaths of central and eastern Europe face another heatwave as hot air over south-western Europe pushes north-west.\nSince late July, large parts of the Iberian peninsula have endured persistent heat, with temperatures frequently climbing to the high 30s to low 40s celsius.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d07fbb8e1bc2cf2966631ae1e638aa6702088891",
      "title": "Watch: Chinese ships collide while pursuing Philippine boat",
      "url": "https://www.bbc.com/news/videos/c1jnne45dj3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T10:05:24.000Z",
      "summary_90w": "",
      "raw": "Watch: Chinese ships collide while pursuing Philippine boat",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "022d6c9011ee1101105ea6d644b311ccd9b3d3d8",
      "title": "Growing pains: can rice production in Africa keep up with demand?",
      "url": "https://www.theguardian.com/world/2025/aug/11/can-rice-production-in-africa-keep-up-with-demand",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-11T07:21:32.000Z",
      "summary_90w": "",
      "raw": "Africa Rice initiative aims to give farmers more control over their land in order to reduce flooding and increase yields\nSalmata Ouattara remembers 2023 as the turning point for her rice farm.\nJune is usually the peak of the rainy season in Ivory Coast, but in the preceding years she and other farmers in M’Be on the outskirts of Bouaké, the country’s second biggest city, would wait weeks for rainfall. Then in September, they would watch helplessly as their farmlands were flooded. Some abandoned their farms, frustrated by fluctuating crop yields.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6d7bf3991205e26c9b9c51a0f10125175def5d20",
      "title": "Watch: Meteor burns across Australian night sky",
      "url": "https://www.bbc.com/news/videos/cx2330pe0v0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-11T01:05:05.000Z",
      "summary_90w": "",
      "raw": "Amateur astronomers captured the moment it streaked over Victoria on CCTV and dashboard cameras.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe6c7ce90325a67bd27a5e6670771b6f6f05f0f0",
      "title": "Prince Harry considers founding new charity after Sentebale dispute",
      "url": "https://www.theguardian.com/uk-news/2025/aug/10/prince-harry-considers-founding-new-charity-after-sentebale-dispute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-10T16:24:21.000Z",
      "summary_90w": "",
      "raw": "Duke of Sussex ‘absolutely committed’ to supporting children and young people in Lesotho and Botswana\nPrince Harry is considering establishing a new charity after a dispute that led to him leaving Sentebale, a spokesperson has said.\nIt comes after the Duke of Sussex was criticised by the Charity Commission for allowing a row with the chair of Sentebale, which he co-founded in 2006, to “play out publicly”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4244fd6182845b1a8c2bd1f2c080f1d9209bddfc",
      "title": "AI-generated music is here to stay. Will streaming services like Spotify label it?",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492314/ai-music-streaming-services-spotify",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Unlike other tech giants, many music-streaming services like Spotify are not currently taking steps to label AI-generated content. But experts say more transparency is key.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "527f8f76888890f9006a32ef3b3f42d67e941604",
      "title": "How to get out of a love-hate relationship with your phone",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492392/phone-addiction",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T07:00:00.000Z",
      "summary_90w": "",
      "raw": "Finding it hard to concentrate? Are you glued to social media for longer than you’d like? Well, maybe it’s not you… maybe it’s the phones.\n\nBrittany is joined by Magdalene Taylor, writer, cultural critic and senior editor at Playboy, and Fio Geiran, producer at TED Radio Hour and a writer of their Body Electric newsletter, to discuss this phrase: “it’s the phones.” They get into the effects that smartphones have on our brains and our culture, why some people are returning to “dumbphones,” and why it might take more than willpower to manage our relationships with our phones.\nClick here to check out the Body Electric newsletter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b1f9673f0113254421ab14083f82fb80ecce702c",
      "title": "Assault on Sudan’s Zamzam refugee camp may have killed more than 1,500 civilians",
      "url": "https://www.theguardian.com/global-development/2025/aug/07/zamzam-massacre-rapid-support-forces-rsf-militia-civilians-slaughtered",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-07T04:00:23.000Z",
      "summary_90w": "",
      "raw": "Guardian investigation finds number killed in April attack by Rapid Support Forces far greater than current estimates\n\n‘They slaughtered us like animals’: the inside story of how one of the biggest atrocities of the Sudan war unfolded in Zamzam\n\nMore than 1,500 civilians may have been massacred during an attack on Sudan’s largest displacement camp in April, in what would be the second-biggest war crime of the country’s catastrophic conflict.\nA Guardian investigation into the 72-hour attack by the paramilitary Rapid Support Forces (RSF) on North Darfur’s Zamzam camp, the country’s largest for people displaced by the war, found repeated testimony of mass executions and large-scale abductions. Hundreds of civilians remain unaccounted for.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3a116098e95d5d8b862a9758d74ef9afaec1ce",
      "title": "US destruction of contraceptives denies 1.4m African women and girls lifesaving care, NGO says",
      "url": "https://www.theguardian.com/world/2025/aug/06/us-destruction-contraceptives-denies-african-women-girls-lifesaving-care-ngo",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-06T16:24:39.000Z",
      "summary_90w": "",
      "raw": "Incineration of $9.7m of contraceptives to lead to 174,000 unintended pregnancies and 56,000 unsafe abortions, IPPF says\nA decision by the US government to incinerate more than $9.7m (£7.3m) of contraceptives is projected to result in 174,000 unintended pregnancies and 56,000 unsafe abortions in five African countries.\nMore than three-quarters of the contraceptives (77%) were destined for the Democratic Republic of the Congo, Kenya, Tanzania, Zambia and Mali, according to the International Planned Parenthood Federation (IPPF), an NGO global healthcare provider and advocate of sexual and reproductive rights.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "690acb123904939b5719f42c39d3568c6f9c677f",
      "title": "It's 2025, the year we decided we need a widespread slur for robots",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5493360/clanker-robot-slur-star-wars",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "People all over TikTok and Instagram are using the word \"clanker\" as a catch-all for robots and AI. Here's a deep dive into the origins of the pejorative and an explanation of why it's spreading.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb5fed10d4a083eb417cdeb5c2a39344a4c35a78",
      "title": "Nihilistic online networks groom minors to commit harm. Her son was one of them",
      "url": "https://www.npr.org/2025/08/06/nx-s1-5479882/teen-forums-violent-extremist-grooming",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Dana's son was hospitalized last year, it led her to a path of discovery about predatory online networks that groom children into harming themselves and others. Their reach is global and growing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0a8c1039e39ffd5b5bce5e6fdafb924cbf68b655",
      "title": "Chess grandmaster Carlsen wins at Esports World Cup",
      "url": "https://www.bbc.com/news/articles/ce3jl1kgyv0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-02T01:49:02.000Z",
      "summary_90w": "",
      "raw": "World number one Magnus Carlsen takes home $250,000 (£188,000) for winning the online competition.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b1a42959412d32a20a5de2d817a56e9a4b116fb",
      "title": "Some Gaza and Ukraine posts blocked under new age checks",
      "url": "https://www.bbc.com/news/articles/cj3l0e4vr0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T23:38:38.000Z",
      "summary_90w": "",
      "raw": "Tech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b479a0167655c8a84f97e1effdcdf0c5aaa4b17",
      "title": "Ofcom investigates 34 porn sites over age checks",
      "url": "https://www.bbc.com/news/articles/c5y2xx6z6eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-31T12:29:13.000Z",
      "summary_90w": "",
      "raw": "Ofcom said on Friday that more than 6,000 porn sites would begin verifying users, but it believes some are ignoring the new rules.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "146352656681a190ba1bc793c9dc1622fef27482",
      "title": "Dating safety app Tea suspends messaging after hack",
      "url": "https://www.bbc.com/news/articles/cd0dgkjgzvjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T10:01:32.000Z",
      "summary_90w": "",
      "raw": "It comes after a hack which exposed thousands of members' images, posts and comments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa22187e9f215dfebc3229a35e266abcee31082",
      "title": "YouTube to be included in Australia's teen social media ban",
      "url": "https://www.bbc.com/news/articles/cpv0zkxx0njo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-30T01:24:49.000Z",
      "summary_90w": "",
      "raw": "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d20c2ce25c13cec7ba044f41abd29d0618288f2e",
      "title": "Minister must apologise over Savile claim, says Farage",
      "url": "https://www.bbc.com/news/articles/cgery3eeqzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T11:28:07.000Z",
      "summary_90w": "",
      "raw": "Minister Peter Kyle claims that by opposing online safety laws the Reform UK leader is siding with sex offenders.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cc9359fecc24e9e22f350119da85d0276d2276e",
      "title": "Google launches new AI search feature in UK",
      "url": "https://www.bbc.com/news/articles/clyj4zky4zwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-07-29T08:43:59.000Z",
      "summary_90w": "",
      "raw": "The new tool marks a significant change for the search giant but raises questions for advertisers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}