{
  "version": "1756845698184",
  "generatedAt": "2025-09-02T20:41:38.184Z",
  "items": [
    {
      "id": "a26107a3bda8ac62ac81d675007ef9c502047bb1",
      "title": "Military lawyers called up to relieve a shortfall in immigration judges",
      "url": "https://www.npr.org/2025/09/02/g-s1-86691/military-lawyers-immigration-judges-jag",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T20:33:37.000Z",
      "summary_90w": "",
      "raw": "The move comes after the Justice Department last week made changes to who could qualify as a temporary immigration judge —effectively lowering the requirements and removing the need to have prior immigration experience.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f005205d7b2bf2ec47fd8ffccf3142bcad7d0939",
      "title": "Silksong: all of the updates about the Hollow Knight sequel",
      "url": "https://www.theverge.com/news/769489/hollow-knight-silksong-news-updates",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T20:24:36.000Z",
      "summary_90w": "",
      "raw": "A screenshot from Hollow Knight: Silksong.\t\n\nAfter years of development and pent-up anticipation from fans, Hollow Knight: Silksong, the full sequel to the indie classic Hollow Knight, will finally be released on September 4th. It will cost $19.99 and include new zones, more than 200 enemies, over 40 bosses, and an orchestral score from the composer of the first game.\nSilksong was first announced in 2019, two years after the release of Hollow Knight, but developers Team Cherry have stayed pretty quiet about the sequel in the years since — even after a planned launch window was announced in 2022, which was followed by a delay months later. In an interview with Bloomberg, Team Cherry co-founders Ari Gibson and William Pellen said that the game was “never stuck”; instead, the small team working on Silksong was just taking its time.\nTeam Cherry announced Silksong‘s release date just two weeks ahead of the game’s launch. The game is launching on PC, Nintendo Switch, Xbox, and PlayStation.\nHere’s all of our coverage of Silksong.\n\n\n\t\t\t\t\t\nSilksong is only $19.99\n\t\t\t\nSilksong is out soon, and indie games are getting out of the way\n\t\t\t\nA Silksong September.\n\t\t\t\nSilksong finally launches in September\n\t\t\t\n“Silksong is real.”\n\t\t\t\nGet ready for Silksong’s ‘special announcement’ on Thursday\n\t\t\t\nReal Silksong news is imminent.\n\t\t\t\nSilksong will also be at Nintendo’s Gamescom booth.\n\t\t\t\nXbox will let you play Silksong at Gamescom in August\n\t\t\t\nSilksong spotted!\n\t\t\t\nHollow Knight: Silksong is launching in 2025\n\t\t\t\nTime to get your hopes up about a Silksong release date.\n\t\t\t\nIs the Silksong release date in the room with us right now?\n\t\t\t\nHollow Knight: Silksong has been delayed\n\t\t\t\nNo Silksong.\n\t\t\t\nSilksong when?\n\t\t\t\nHollow Knight: Silksong is coming to PlayStation, too\n\t\t\t\nHollow Knight: Silksong is coming to Xbox, and it will be out within the next year",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T20:13:30.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "060597fc354558c19ae50394ae87621f9045f7bd",
      "title": "OpenAI to route sensitive conversations to GPT-5, introduce parental controls",
      "url": "https://techcrunch.com/2025/09/02/openai-to-route-sensitive-conversations-to-gpt-5-introduce-parental-controls/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T20:13:04.000Z",
      "summary_90w": "",
      "raw": "OpenAI said Tuesday it plans to route sensitive conversations to reasoning models like GPT-5 and roll out parental controls within the next month – part of an ongoing response to recent safety incidents involving ChatGPT failing to detect mental distress.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "874d8f638c530c94473380152c2f8818dc82aaf0",
      "title": "Trump says Space Command will move to Alabama, after long battle over its HQ",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525899/trump-space-force-command-alabama-colorado",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T20:09:54.000Z",
      "summary_90w": "",
      "raw": "President Trump announced he intends to move U.S. Space Command headquarters to Huntsville, Ala., after a protracted battle over whether it would stay in Colorado, as former President Joe Biden advocated.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f9e374ae173080de07fc2f21060a516f8f80f70a",
      "title": "How the Democrats keep copying the MAGA influencer playbook (and failing)",
      "url": "https://www.theverge.com/regulator-newsletter/769232/democrats-chorus-influencer-program-regulator",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T20:00:02.000Z",
      "summary_90w": "",
      "raw": "Hello and welcome to Regulator. Today, I will attempt to regulate my own apoplexy.\n\nRecently, Wired published an article revealing the existence of a secret Democrat influencer incubator that trained liberal and progressive content creators to push coordinated messaging across their shared social media platforms and paid them handsomely to do so. The fallout has been chaotic, at least in the left-wing influencer world: creators are shanking their rivals for participating in the program, and the paid influencers are trying to defend themselves for taking the money. But the controversy around the Chorus Creator Incubator Program stems from the …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "364368d0c7fdddfffc65ebbf6ed7a407659e52b8",
      "title": "Judges side with Trump EPA over canceled Inflation Reduction Act grants to nonprofits",
      "url": "https://techcrunch.com/2025/09/02/judges-side-with-trump-epa-over-canceled-inflation-reduction-act-grants-to-nonprofits/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:53:50.000Z",
      "summary_90w": "",
      "raw": "An appellate court found that the Trump administration was within its rights to cancel billions of dollars in grants. The nonprofits that had their grants cancelled are expected to appeal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5b4f323610455da78e2e14ba456092538c691cd7",
      "title": "Trump is moving Space Command to Alabama",
      "url": "https://www.theverge.com/news/769475/trump-space-command-alabama-headquarters",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T19:44:24.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump is moving US Space Command’s headquarters from Colorado to Alabama, he announced during a press conference on Tuesday. The change reverses former President Joe Biden’s 2023 decision to leave it in Colorado Springs, where its temporary headquarters have been established.\nDuring the press conference, Rep. Mike Rogers (R-AL), chair of the House Armed Services Committee, called Biden’s decision to keep Space Command in Colorado “political,” though Trump claimed Colorado’s mail-in ballot policy was a “big factor” in choosing Alabama.\nWhen asked why the administration chose Alabama for the Space Command, Trump said, “…it just works, because we have so much else there,” referencing the presence of NASA, SpaceX, and the Jeff Bezos-owned Blue Origin in the state. He also said the Space Command headquarters will “play a key role” in building the Golden Dome missile defense system.\nFollowing the shutdown of Space Command in 2002, President Trump passed a law to reestablish it during his first term in 2019, beginning a search for its next headquarters. Trump planned to bring the Space Command to Huntsville, Alabama, but President Joe Biden opted to keep its headquarters in Colorado Springs, Colorado, where Space Command originally formed.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "19c9d71fe33d74644215f33e9dcea203c275498e",
      "title": "Amazon launches Lens Live, an AI-powered shopping tool for use in the real world",
      "url": "https://techcrunch.com/2025/09/02/amazon-launches-lens-live-an-ai-powered-shopping-tool-for-use-in-the-real-world/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:42:23.000Z",
      "summary_90w": "",
      "raw": "Lens Live will not replace Amazon's existing visual search tool, Amazon Lens, which lets you take a picture, upload an image, or scan a barcode to discover products. Instead, it brings a real-time component to Amazon Lens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7c63d8d95ef3e3db3a49e74e4c4ef93db50366a1",
      "title": "The tariff apocalypse is here",
      "url": "https://www.theverge.com/analysis/769427/trump-tariffs-online-shopping-shipping-suspended-de-minimis",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T19:34:13.000Z",
      "summary_90w": "",
      "raw": "As President Donald Trump's August 29th deadline for new tariffs rolled around, the first thing that I thought of was 2026 planners. In July, Trump signed an executive order essentially killing a little-known but highly consequential trade rule, which meant that purchases coming from abroad - like $100 in planners and accessories - could enter the US duty-free. My preferred planner, the Hobonichi Techo, is printed and shipped from Japan. With the de minimis exemption removed, my tax bill could be between $15 and $100 - or more, depending on how the increased costs are factored. Was I willing to risk paying as much in fees, duties, and shippi …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5408d8decba8751b9b8bb5e6702c9e5e6725d8b4",
      "title": "Trump addresses online health rumours in Oval Office",
      "url": "https://www.bbc.com/news/videos/c62724wdxzwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T19:30:43.000Z",
      "summary_90w": "",
      "raw": "In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5408d8decba8751b9b8bb5e6702c9e5e6725d8b4",
      "title": "Watch: Trump addresses online health rumours in Oval Office",
      "url": "https://www.bbc.com/news/videos/c62724wdxzwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T19:30:43.000Z",
      "summary_90w": "",
      "raw": "In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "214535bf158ba5b4b9fd1af6c5a859128f9293e7",
      "title": "Trump administration blocks groups from voter registration at naturalization events",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525875/trump-naturalization-voter-registration-uscis",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T19:16:29.000Z",
      "summary_90w": "",
      "raw": "Nongovernmental groups like the League of Women Voters are now barred from registering new voters at naturalization ceremonies, the U.S. Citizenship and Immigration Services has announced.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14b16917e684b02308b4e4087d9f22d5bbe0a805",
      "title": "Clegg accuses Vance of 'hypocrisy' over free speech criticism",
      "url": "https://www.bbc.com/news/articles/c2l7lg84780o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T19:12:03.000Z",
      "summary_90w": "",
      "raw": "Many senior right-wing US figures attack UK free speech laws while \"intimidating and bullying\" critics, Sir Nick says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d83ca70fc5399376184426b5ac11daa2f344a7",
      "title": "OpenAI acquires product testing startup Statsig and shakes up its leadership team",
      "url": "https://techcrunch.com/2025/09/02/openai-acquires-product-testing-startup-statsig-and-shakes-up-its-leadership-team/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T19:04:05.000Z",
      "summary_90w": "",
      "raw": "OpenAI is bringing on the founder of Statsig as its CTO of Applications, and making changes to other leadership roles at the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f8e7e98cf47162095bcef6e4088429cea341853",
      "title": "Here are the best AirPods deals you can get right now",
      "url": "https://www.theverge.com/21302051/best-apple-airpods-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T18:51:52.000Z",
      "summary_90w": "",
      "raw": "If you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, though you can still find great deals throughout the year.\n \n\nThe best AirPods 4 deals\nThe best AirPods Pro (second-gen) deals\nThe best AirPods Max deals\n\nBelow, we’ve rounded up the best deals currently available on each model, including both iterations of the AirPods 4, the latest AirPods Pro, and the AirPods Max. Just keep in mind that Apple’s next big event is scheduled for September 9th, meaning it’s possible that we’ll see a new pair of AirPods Pro before October rolls around, possibly with heart rate monitoring and a slew of AI-based features.\nThe best AirPods 4 deals\nApple AirPods 4\n\nWhere to Buy:\n\n $129 $119 at Amazon\n $129 $119 at Walmart\n $129.99 at Best Buy\n\n\nAirPods 4 with Active Noise Cancellation\n\nWhere to Buy:\n\n $179 $168.99 at Amazon\n $179 $168.99 at Walmart\n $179.99 at Best Buy\n\nAt its September 2024 event, Apple introduced the AirPods 4, a pair of wireless earbuds available in two variations: a $129 standard model and a $179 noise-canceling model. Both versions represent significant upgrades over the third-gen AirPods, with a more comfortable design and improved audio performance. They’re also better for taking calls thanks to Apple’s Voice Isolation feature, which focuses the mics on your voice so you can be heard more clearly in noisy environments.\nThe $179 AirPods 4 with Active Noise Cancellation offer a surprisingly effective noise-canceling mode, a helpful transparency mode, and several other Pro-level features. The latest AirPods Pro do a better job of tuning out noise, but the AirPods 4 with ANC still do a good job of reducing sound. They also feature other perks formerly reserved for Apple’s top-of-the-line earbuds, including wireless charging and a case with a built-in speaker that allows you to easily track it down via Apple’s Find My app.\nGiven they’ve been out for nearly a year, we consistently see discounts on both versions of the AirPods 4. Right now, for instance, the standard AirPods 4 are on sale at Amazon and Walmart for $119 ($10 off), which is $30 shy of their all-time low. The AirPods 4 with ANC, meanwhile, are available at Amazon and Walmart for their typical sale price of $168.99 (also $10 off), which is a far cry from their Prime Day low of $119.\nRead our full AirPods 4 review.\nThe best AirPods Pro (second-gen) deals\nApple AirPods Pro (second-gen) with USB-C charging case\n\nWhere to Buy:\n\n $249 $199 at Amazon\n $249 $199 at Walmart\n $249.99 at Best Buy\n\nIn 2022, Apple released the second-gen AirPods Pro, which feature a similar build to the first-gen model but offer better noise cancellation, swipe-based controls, and an extra-small pair of swappable silicone ear tips for smaller ears. Apple followed up a year later with a minor refresh, one that features a USB-C charging case and an upgraded IP54 rating for water and dust resistance. The newest model also supports lossless audio when used with Apple’s Vision Pro headset and doubles as a pair of FDA-approved hearing aids.\nAs far as deals go, Apple’s updated AirPods Pro with USB-C are currently available at Amazon and Walmart for $199 ($50 off), which is their typical sale price and a relatively minor discount compared to previous sales.\nRead our AirPods Pro with USB-C impressions.\nThe best AirPods Max deals\nApple AirPods Max\n\nWhere to Buy:\n\n $549 $479.99 at Amazon (USB-C)\n $549 $529 at Walmart (USB-C)\n $549 $529.99 at Best Buy (USB-C)\n\nThe AirPods Max aren’t the iconic in-ears that have become synonymous with the AirPods name. They’re large and luxurious, comprised of aluminum, steel, and mesh fabric that remains comfortable during extended listening sessions. They also sport excellent noise cancellation, Apple’s spatial audio feature, and expansive, balanced sound, even if they lag behind some of their peers when it comes to bass response and features. They’re not the best noise-canceling headphones for most people — blame the sticker price — but it’s hard to find a better pair of Bluetooth headphones if you’re an iPhone user.\nToward the end of last year, Apple replaced the first-gen Max with a new model that features support for USB-C charging and a few new color options. As of writing, they’re on sale at Amazon in select colors starting at $479.99 ($70 off), which isn’t nearly as low as the $399 asking price we saw during Prime Day.\nRead our original AirPods Max review.\nUpdate, September 2nd: Updated to reflect current pricing / availability and mention Apple’s forthcoming iPhone 17 launch event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8029d4954875f1fd57dd6c192c3f7d58f57d721",
      "title": "Tick tock: Congress has 14 legislative days to stop a government shutdown",
      "url": "https://www.npr.org/2025/09/02/g-s1-86626/congress-return-shutdown-epstein",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T18:50:38.000Z",
      "summary_90w": "",
      "raw": "Congressional lawmakers return to D.C. with a massive September agenda, including efforts to avoid a government shutdown and a debate on whether to change the rules for confirming nominees.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f0350435fa0adf83934683764432299bab74e1",
      "title": "Microsoft gave Perfect Dark’s developers a chance to save the game — after it was already canceled",
      "url": "https://www.theverge.com/news/769372/microsoft-perfect-dark-revival-take-two-deal",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T18:49:00.000Z",
      "summary_90w": "",
      "raw": "In July, Microsoft’s sweeping layoffs hit Xbox hard, and shuttered the entire game studio that was building Perfect Dark. Officially, the game was canceled. But unofficially, reports Bloomberg’s Jason Schreier, Microsoft gave Perfect Dark’s other set of developers — Tomb Raider studio Crystal Dynamics — a chance to revive the game. \nHere’s where it gets potentially confusing: Microsoft doesn’t own Crystal Dynamics — that studio belongs to the Embracer Group, which has had many troubles of its own. So Embracer was trying to cut a deal with yet another publisher, the giant Take-Two, to buy, fund, and publish the game. But, Schreier reports:\nthe talks collapsed at least in part because the companies involved were unable to come to terms over long-term ownership of the Perfect Dark franchise, said the people, who requested anonymity because they were not authorized to speak about sensitive negotiations.\nWhen that deal fell through, it reportedly led to the new round of layoffs at Crystal Dynamics that IGN reported last week, and Schreier writes that Crystal Dynamics has now “fully” abandoned the game.\nSeems Microsoft didn’t want to give up the rights to Perfect Dark, which it presumably obtained when it bought Rare in 2002. (For the uninitiated, Perfect Dark was a spiritual successor to Rare’s hit Goldeneye 007 on the Nintendo 64, a game that itself went many decades without a revival because of a complicated licensing situation.) That feels like a crummy reason for the game to stay canceled, but we don’t know the details. \nMicrosoft was able to broker a previous deal to save Hi-Fi Rush developer Tango Gameworks by selling it to PUBG giant Krafton, but it was under a lot of pressure there. Hi-Fi Rush had already been released, had become a “break out hit” that won “prestige and awards”, and gamers were pissed that Microsoft had rewarded its developers with layoffs. \nFor now, you can still watch the new Perfect Dark’s trailers and developer interview.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7711054b51bf0367bbca9cf52c5dab71776daaf6",
      "title": "Afghan quake victims buried on mountain top as aftershocks continue",
      "url": "https://www.bbc.com/news/videos/cd9j9g5n92do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:46:09.000Z",
      "summary_90w": "",
      "raw": "The BBC's Yama Bariz travelled to a region devastated by the 6.0 magnitude earthquake.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871e468947017c14e79f6657c777c3af7e6b7830",
      "title": "Astro Teller, ‘Captain of Moonshots,’ joins TechCrunch Disrupt 2025 this October",
      "url": "https://techcrunch.com/2025/09/02/astro-teller-is-joining-us-at-techcrunch-disrupt-2025-in-october/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T18:44:48.000Z",
      "summary_90w": "",
      "raw": "TechCrunch is thrilled to announce that Astro Teller, the head of Alphabet’s X (aka the Moonshot Factory), will take the stage at TechCrunch Disrupt 2025.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c0eb25c3cf324b6eae79b70c6b25c5f979b68fe",
      "title": "Thousands of Israeli reservists report for duty ahead of Gaza City offensive",
      "url": "https://www.bbc.com/news/articles/cyvnv5lv4zpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:15:46.000Z",
      "summary_90w": "",
      "raw": "Ground forces are already pushing into the city, where hospitals say more than 50 people were killed by Israeli strikes on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "375a988fd188e396218b96ad30279d434e081629",
      "title": "OpenAI starts building out its app team",
      "url": "https://www.theverge.com/openai/769325/openai-statsig-acquisition-executive-moves",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T18:02:08.000Z",
      "summary_90w": "",
      "raw": "OpenAI has started to build out its Applications team under Fidji Simo, its new CEO of Applications, who left her former position as Instacart’s CEO to start in the executive role on August 18th. On Tuesday, the company confirmed it’s shuffling executive roles, bringing on a new CTO of applications, and acquiring a product analytics company for $1.1 billion.\nStatsig, the company OpenAI is acquiring, specializes in A/B testing and other features for companies looking to improve their products, and OpenAI is bringing on its founder and CEO, Vijaye Raji, as a new C-suite executive. Raji will be OpenAI’s CTO of Applications, heading up product engineering for both ChatGPT and Codex, “with responsibilities that span core systems and product lines including infrastructure and Integrity,” OpenAI wrote in a blog post. He’ll report directly to Simo.\n“Once the acquisition is finalized, Statsig employees will become OpenAI employees,” OpenAI wrote in the blog post, noting that the deal’s close will be subject to regulatory approval. “It will continue operating independently and serving its customer base out of its Seattle office. We’ll take a measured approach to any future integration, ensuring continuity for current customers and enabling the team to stay focused on what they do best.”\nOpenAI also announced it was shuffling some other executive positions. \nSrinivas Narayanan, who heads up the company’s engineering and oversaw the development of ChatGPT, developer APIs, and more, is being promoted to another brand-new C-suite executive role: CTO of B2B Applications. Narayanan will oversee all the business-side applications, covering startups, enterprises, and government, and he’ll report directly to OpenAI COO Brad Lightcap. \nKevin Weil, OpenAI’s CPO, will be transitioning onto the research side of OpenAI’s business, the company confirmed. He’ll be spinning up a new team at the company as its VP of AI for Science, working closely with Mark Chen, OpenAI’s chief research officer. As part of that transition, Weil’s former product team, including head of ChatGPT Nick Turley, will now report directly to Simo.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55dbacbc65114ab6617267060d0ec213c017d361",
      "title": "North Korea's Kim arrives in Beijing with daughter to attend massive military parade",
      "url": "https://www.bbc.com/news/articles/c78z2p6gg1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:25.000Z",
      "summary_90w": "",
      "raw": "The \"Victory Day\" parade on Wednesday will see Kim rub shoulders with China's Xi Jinping, Russia's Vladimir Putin and others.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "544523ca7ec0528c0a9369df50cedfd8b838be6a",
      "title": "Reform boss denies press ban applied to councillors",
      "url": "https://www.bbc.com/news/articles/cqxgxzzjx3zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:11.000Z",
      "summary_90w": "",
      "raw": "Mick Barton banned the Nottingham Post over a disagreement about a story about local government reorganisation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c762575c02c0050e081f400ca742b4cdd720504",
      "title": "What do we know about Kim Jong Un's daughter - and potential successor?",
      "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T18:01:07.000Z",
      "summary_90w": "",
      "raw": "Kim Ju Ae's visit to China with her father is likely to further fuel speculation she may succeed him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bdd52b1720cf8f7b1156fda93a00dbd27bfe7f43",
      "title": "Trump's use of National Guard in Los Angeles was illegal, judge rules",
      "url": "https://www.bbc.com/news/articles/c5ylyd9lkkqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T17:48:32.000Z",
      "summary_90w": "",
      "raw": "The ruling comes as Trump seeks to use National Guard troops in order to crack down on crime in other US cities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "46e5896f4eb741aeaf91168dc91c93a10663394a",
      "title": "Google is having ‘productive discussions’ with Trump lawyers about his deplatforming suit",
      "url": "https://www.theverge.com/news/769285/google-trump-youtube-ban-january-6th-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T17:41:11.000Z",
      "summary_90w": "",
      "raw": "Critics of Big Tech and President Donald Trump are on high alert as Google and Trump’s legal teams are engaged in what look like potential settlement discussions.\nLawyers for Trump and Google’s YouTube recently told a federal judge they “continue to engage in productive discussions regarding next steps” in a lawsuit Trump filed over YouTube’s decision to ban Trump’s account in the wake of the January 6th riot at the US Capitol. The lawyers expect “additional discussions … in the near future.” Trump also sued then-Facebook and Twitter over their bans, and Meta recently paid $25 million to settle its suit. Sen. Elizabeth Warren (D-MA) now warns that Google might be next to follow its lead.\nGoogle is still untangling itself from a mess of legal battles, including two separate anti-monopoly lawsuits the Justice Department won against it. It’s awaiting decisions on how those judges see fit to remedy its harms to competition in the online search and ad tech markets, which could include forcing it to sell its Chrome browser. Meanwhile, recent chaos at the DOJ Antitrust Division has left former enforcers fearing that the agency appears susceptible to outside corporate influence. “This could be another example of how giant corporations are enabling Trump’s authoritarianism,” Warren warns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "329e97fdd6cc10d4607f64aebe23768d0b18bfcb",
      "title": "A live-action Call of Duty film is on the way  ",
      "url": "https://www.bbc.com/news/articles/cewyw8j4rgqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T17:23:21.000Z",
      "summary_90w": "",
      "raw": "The hugely popular video game series is being turned into a live-action film by film studio Paramount.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "40a3d29eca31a80068ccb02d3c0a0b95fb653582",
      "title": "Argentina couple under house arrest amid search for painting stolen by Nazis",
      "url": "https://www.theguardian.com/world/2025/sep/02/argentina-painting-nazis-house-arrest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:20:35.000Z",
      "summary_90w": "",
      "raw": "Daughter of former Nazi official and her husband to be questioned after raid on home failed to find masterpiece\nA federal court in Argentina has ordered house arrest for the daughter of a former Nazi official and her husband after a raid failed to locate a painting stolen from a Jewish art dealer in Amsterdam.\nAuthorities raided a home in the coastal city of Mar del Plata last week after a Dutch newspaper identified a painting seen in a real estate photo as an Italian masterpiece registered on a database of lost wartime art.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1dea386d8cdddc41b883e3c81287e76feb67f6f5",
      "title": "Tesla’s 4th ‘Master Plan’ reads like LLM-generated nonsense",
      "url": "https://techcrunch.com/2025/09/02/teslas-4th-master-plan-reads-like-llm-generated-nonsense/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T17:18:12.000Z",
      "summary_90w": "",
      "raw": "Tesla's fourth \"Master Plan\" lacks an important building block of plans: specifics. Even Elon Musk agrees it was too generic.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4a4ec58825c978539b587cd58ff45fbee71600d5",
      "title": "Tesla’s new ‘Master Plan’ sounds like AI slop",
      "url": "https://www.theverge.com/tesla/769009/tesla-master-plan-4-ai-robotics-abundance",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T17:12:59.000Z",
      "summary_90w": "",
      "raw": "Tesla’s Optimus robots briefly served popcorn at the company’s diner — before going offline.\t\n\nTesla's latest \"Master Plan\" makes a few things clear right out of the gate: the company that was once known for accelerating the push toward a brighter future by popularizing electric vehicles and renewable energy is no longer interested in that quotidian stuff. Now, it's all about artificial intelligence, humanoid robots, self-driving cars, and the new buzzy catchphrase that is currently lighting up the tech world: \"sustainable abundance.\"\nAt a breezy 983 words, Master Plan 4 is the shortest entry in the company's ongoing series of mission statements. It's the first one to be posted on X, Elon Musk's social media platform, rather than on  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dcf4dbd954a035980cfa5cbf263e9a5ee454ed61",
      "title": "How rural hospitals are banding together to survive",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/02/nx-s1-5519257/rural-hospitals-independent-health-networks",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T17:11:16.000Z",
      "summary_90w": "",
      "raw": "Independent and rural hospitals are collaborating with their neighbors to shore up their finances instead of joining larger health systems to stay afloat.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "45b7d543b72c63eec04ab278e56b5d85ecbd9fcf",
      "title": "Putin hails ties with China as Kim Jong-un arrives in Beijing on eve of parade",
      "url": "https://www.theguardian.com/world/2025/sep/02/vladimir-putin-xi-jinping-russia-china-ties-kim-jong-un-beijing-parade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T17:10:54.000Z",
      "summary_90w": "",
      "raw": "Russian president says relations at ‘unprecedentedly high level’ as dozens of leaders gather for Victory Day events\nVladimir Putin has hailed Russia’s “unprecedentedly” high level of ties with China, as dozens of leaders including the North Korean dictator, Kim Jong-un, arrived in Beijing on the eve of a massive military parade intended to showcase a Chinese-led global order.\nPutin called China’s leader, Xi Jinping, a “dear friend” after the two held talks at the Great Hall of the People and then at Xi’s personal residence. “Our close communication reflects the strategic nature of Russia-China relations, which are at an unprecedentedly high level,” Putin told Xi, according to a video on the Kremlin’s Telegram channel. “We were always together then, and we remain together now.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d45e58c568bf439536406a5510255c55b204d2e",
      "title": "Father Ted co-creator Graham Linehan arrested at Heathrow over his X posts",
      "url": "https://www.bbc.com/news/articles/c07p7v2nn8mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T17:05:30.000Z",
      "summary_90w": "",
      "raw": "Graham Linehan was arrested on suspicion of inciting violence and bailed pending further investigation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a86fb99c1aff90636771d8c9a474fa379798525",
      "title": "Killer jailed for 45 years for prison officer 'execution' over seized phone",
      "url": "https://www.bbc.com/news/articles/c9d0d63pnw2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:56:16.000Z",
      "summary_90w": "",
      "raw": "Armed robber Elias Morgan waited four years to take revenge on father-of-three Lenny Scott.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cfb50ee759eb74b0c05650fe76f204f1c92bc7d6",
      "title": "Adults with learning disabilities die 20 years early, report finds",
      "url": "https://www.bbc.com/news/articles/c939311dpn1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:55:49.000Z",
      "summary_90w": "",
      "raw": "People with learning disabilities and autism die almost 20 years younger than the rest of the population.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fce0b53c8dcb92cac540487c4a8dc1a3969a1b37",
      "title": "Uber Eats partners with Best Buy to deliver your tech",
      "url": "https://www.theverge.com/news/769183/uber-eats-best-buy-partnership-deliveries",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-02T16:50:47.000Z",
      "summary_90w": "",
      "raw": "Uber Eats is teaming up with Best Buy to offer deliveries of the store’s selection of tech products, like headphones, chargers, laptops, gaming gear and small appliances. Starting today, you can order a product at Best Buy through the Uber Eats app and have it delivered to your doorstep the same day, adding to store’s existing partnerships with Instacart and DoorDash.\nUber Eats will house products from more than 800 Best Buy stores, a little less than the over 1,000 locations the retail chain says it operates in North America. The announcement doesn’t state whether pricing between the Uber Eats app and inside Best Buy stores will differ to make up for the delivery platform’s fees, but we’ve reached out to Best Buy with a request for more information.\nYou can find Best Buy in the Uber Eats app by going to the “Retail” or “Electronics” category, searching for Best Buy, and then browsing your local store’s selection.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14d85b4c6cecd8e73155181bb2e6476a879d675f",
      "title": "UK borrowing costs hit 27-year high adding to pressure on Reeves",
      "url": "https://www.bbc.com/news/articles/cy989njnq2wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:46:17.000Z",
      "summary_90w": "",
      "raw": "The interest rate on UK 30-year bonds hits the highest since 1998 as concerns over the economic outlook continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ccee5dd1b0e243054368010ece26c049d5a13e6",
      "title": "Outcry as Swedish ‘cultural canon’ snubs Abba and anything since 1975",
      "url": "https://www.theguardian.com/world/2025/sep/02/outcry-as-swedish-cultural-canon-snubs-abba-and-anything-since-1975",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:45:54.000Z",
      "summary_90w": "",
      "raw": "Critics argue ‘shared map’ of Swedish culture is ‘very exclusionary’ and a ‘nationalist education project’\nThe Gustav Vasa 1541 bible, Pippi Longstocking, Ikea, the right to roam, paternity leave, Sámi joiks, the Nobel prize and works by Ingmar Bergman and August Strindberg all made it into Sweden’s long-awaited, much-criticised proposal for a “cultural canon”.\nHowever, notable omissions from the list of 100 works and references that have formed Sweden’s culture and history – intended, its creators said in Uppsala on Tuesday, to establish a “shared map and compass” for Swedish citizens and new arrivals to Sweden – included Abba and anything from after 1975, a period that has seen Sweden transform into an international, multicultural society.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07715646549620450e4b081adaa0d3b069b4a69",
      "title": "Margaret Atwood releases short story critiquing book bans in Canada",
      "url": "https://www.theguardian.com/world/2025/sep/02/margaret-atwood-alberta-canada-book-ban",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T16:44:53.000Z",
      "summary_90w": "",
      "raw": "Author quipped she wrote ‘suitable’ piece after Alberta school ban included her novel The Handmaid’s Tale\nMargaret Atwood has released a new short story critiquing elected officials for a wide-ranging book ban in the Canadian province of Alberta. The controversial decision to remove books purportedly containing “explicit sexual content” has seen numerous works of literature swept up in the dragnet, including Atwood’s, dystopian work The Handmaid‘s Tale.\nIn a social media post, Atwood wrote that since her famed work was no longer permissible in Alberta schools, she had written a “suitable” short work for teens, adding the work was necessary because the province’s minister of education thought students were “stupid babies”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3261c1ce6e289d0c2c892a031887da26050e4df9",
      "title": "Tesla’s Dojo, a timeline",
      "url": "https://techcrunch.com/2025/09/02/teslas-dojo-a-timeline/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:39:01.000Z",
      "summary_90w": "",
      "raw": "Musk teased Dojo for years and ramped up discussions about the supercomputer throughout 2024. But Dojo is now out, and another supercomputer called Cortex has entered the chat.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2ea109f825065079513d3bc6892866ac98ffb56",
      "title": "Vogue promotes Chloe Malle to top editor spot",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525663/vogue-chloe-malle-anna-wintour",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T16:38:09.000Z",
      "summary_90w": "",
      "raw": "Malle takes over as the leader of American Vogue immediately. Malle, who has been with the publication since 2011, will still report to Anna Wintour who remains Condé Nast's chief content officer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19d472e6b6f9866bc55467838678a9da55e96db0",
      "title": "Anthropic raises $13B Series F at $183B valuation",
      "url": "https://techcrunch.com/2025/09/02/anthropic-raises-13b-series-f-at-183b-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:34:16.000Z",
      "summary_90w": "",
      "raw": "AI firm Anthropic's $13 billion Series F round will be used to grow its enterprise adoption, deepen safety research, and support international expansion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f142f2f1ec1e1b3ad2c32f4683177278c1e67425",
      "title": "WordPress shows off Telex, its experimental AI development tool",
      "url": "https://techcrunch.com/2025/09/02/wordpress-shows-off-telex-its-experimental-ai-development-tool/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:26:48.000Z",
      "summary_90w": "",
      "raw": "WordPress CEO Matt Mullenweg introduced the new WordPress AI tool, called Telex, at the company's WordCamp US 2025 conference in Portland last week, alongside other AI experiments.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e97c95b340cc7d9d0ebced2db4b426d303c1ad7b",
      "title": "Tesla Dojo: The rise and fall of Elon Musk’s AI supercomputer",
      "url": "https://techcrunch.com/2025/09/02/tesla-dojo-the-rise-and-fall-of-elon-musks-ai-supercomputer/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:18:46.000Z",
      "summary_90w": "",
      "raw": "Dojo was going to be Tesla’s custom-built supercomputer. Here's what Elon Musk had in mind, what happened, and what's coming next.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d46869ae69d440200183c86e14c507c85ddb92b2",
      "title": "ICE reactivates contract with spyware maker Paragon",
      "url": "https://techcrunch.com/2025/09/02/ice-reactivates-contract-with-spyware-maker-paragon/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T16:11:25.000Z",
      "summary_90w": "",
      "raw": "The Israeli spyware maker now faces the dilemma of whether to continue its relationship with U.S. Immigration and Customs Enforcement and help fuel its mass deportations program.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf1e1af10a193104faba1b24b371529db2a86de8",
      "title": "Sting sued by ex-Police bandmates over royalties",
      "url": "https://www.bbc.com/news/articles/cgjyjn9j74go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T16:03:47.000Z",
      "summary_90w": "",
      "raw": "Two of his former bandmates say they are owed £1.5m backdated payments, court documents show.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba854e3deded012457b724f56c45bc747a499de6",
      "title": "MrBeast reportedly plans to launch a phone company",
      "url": "https://techcrunch.com/2025/09/02/mrbeast-reportedly-plans-to-launch-a-phone-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:58:30.000Z",
      "summary_90w": "",
      "raw": "MrBeast, the 27-year-old popular YouTuber, plans to launch a phone company as he diversifies his brand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f2b488d253d88cfaf030df4c4e494c7df91d2095",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:36:02.000Z",
      "summary_90w": "",
      "raw": "Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’. This live blog is closed\nAt least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.\nAt least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "ChatGPT to tell parents when their child is in 'acute distress'",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T15:35:38.000Z",
      "summary_90w": "",
      "raw": "It's one of a number of parental controls being introduced by OpenAI, which is being sued over the death of a teenager in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0ae0e1ce7630b5acd0f10dcc27910a2cdc730112",
      "title": "Five children in Gaza among those killed by Israeli strike while fetching water",
      "url": "https://www.theguardian.com/world/2025/sep/02/children-among-those-killed-in-gaza-while-fetching-water-by-israeli-strike",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:32:50.000Z",
      "summary_90w": "",
      "raw": "Latest attack comes as Israel’s military urges people to leave Gaza City with 60,000 more reservists to be called up\nAt least nine people, including five children, have been killed in an Israeli strike while fetching water in al-Mawasi, an area of southern Gaza which Israel has designated as a safe zone, health officials said.\nA doctor from al-Nasser hospital shared a picture of the children’s bodies in the hospital, as well as a picture of water jugs left in a pool of blood at the site of the attack on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92d203ebfab4aa685fce025a5c48b071284b5130",
      "title": "Instagram tests Picture-in-Picture viewing for reels",
      "url": "https://techcrunch.com/2025/09/02/instagram-tests-picture-in-picture-viewing-for-reels/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T15:31:11.000Z",
      "summary_90w": "",
      "raw": "The move comes as apps like TikTok and YouTube have had support for Picture-in-Picture for quite some time now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88909bf9a463d2ae9be300a55d52875cd23e2daf",
      "title": "Putin claims he never opposed EU membership for Ukraine but draws line at Nato – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:28:22.000Z",
      "summary_90w": "",
      "raw": "Russian leader, continuing China visit, is joined by Slovakia’s Robert Fico. This live blog is closed\nIn the meantime, we have had an update from Ukraine where a man accused of murdering a pro-western Ukrainian politician in the city of Lviv last weekend admitted that he carried out the killing but denied working for Russia, describing the attack as “personal revenge,” AFP reported.\n“This is my personal revenge on the Ukrainian authorities,” the suspect told reporters in a video published by Ukrainian media outlets, denying he worked directly with Russian special services.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "229fcf7532720280f150841b701f282bc1f4c0bc",
      "title": "British teen accused of drug smuggling told 'substantial' sum could free her from jail",
      "url": "https://www.bbc.com/news/articles/cd0d04gjk19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T15:23:40.000Z",
      "summary_90w": "",
      "raw": "Bella Culley could face up to 20 years in jail or life imprisonment if convicted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "580ffe349db445b1879e290804a721aabe3351d4",
      "title": "My rent's gone up by almost 20% - and my landlord wants to evict me",
      "url": "https://www.bbc.com/news/articles/cjw6w32z07zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T15:17:09.000Z",
      "summary_90w": "",
      "raw": "Glasgow tenant Elle Glenny says the impact of a rent increase has been catastrophic.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65c5e55f7913737ad615deb04b9b807ea24450db",
      "title": "As many as 1,000 killed in Sudan landslide",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525607/sudan-mudslide",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T15:16:49.000Z",
      "summary_90w": "",
      "raw": "Up to 1,000 dead after a landslide levels a village in western Sudan, as displaced residents flee famine and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "483d0edba69eb0fb9f49b19bedfa86d7a4b237bc",
      "title": "Mining magnate Andrew Forrest’s Minderoo charity makes undisclosed donation to the Australia Institute",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/mining-magnate-andrew-forrest-minderoo-charity-makes-undisclosed-donation-to-the-australia-institute",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:01:01.000Z",
      "summary_90w": "",
      "raw": "Exclusive: The progressive thinktank, which has championed a ‘real zero’ emissions policy, says it protects privacy of donors to avoid them being targeted\nGet our breaking news email, free app or daily news podcast\nAndrew Forrest’s charity has made an undisclosed donation to the Australia Institute, raising transparency concerns about the funding of influential advocacy groups.\nThe donation to the progressive thinktank, which has been confirmed by several sources familiar with the deal but not authorised to comment, highlights differing disclosure standards across the research and advocacy sector.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a85224c71c02aef3bd82ebc531d5258a55a9817",
      "title": "Australian politicians reveal their housing portfolios, with some owning as many as six homes",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/australian-politicians-reveal-their-housing-portfolios-with-some-owning-as-many-as-six-homes",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:01:00.000Z",
      "summary_90w": "",
      "raw": "Dozens of politicians are landlords, having also declared rental income from their investment properties\n\nGet our breaking news email, free app or daily news podcast\n\nMore than half the politicians in federal parliament have disclosed owning investment properties or multiple homes, with at least 50 receiving rental income as landlords.\nThe enviable property portfolios of some of the nation’s most powerful parliamentarians have been revealed – including holiday homes, beach shacks, second houses interstate and overseas real estate – as the federal government considers ways to fix Australia’s housing shortage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f34878384201a9cc04d921dd7a41c04f66cbc30",
      "title": "There are just 150 of these creamy-flowered shrubs left in the world – and Victoria’s fire plan may decimate a third",
      "url": "https://www.theguardian.com/australia-news/2025/sep/03/victoria-bushfire-plan-could-push-endangered-round-leaf-pomaderris-plants-into-extinction",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T15:00:59.000Z",
      "summary_90w": "",
      "raw": "More than 40 round-leaf pomaderris discovered by environmental community group inside the area earmarked for fire break in July\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nA mere 150 round-leaf pomaderris are thought left in the world and a planned fire break in Victoria could decimate almost 30% of those last remaining plants.\nThe critically endangered shrub, which bursts into cascades of creamy flowers, is known to exist in only a handful of locations in central Victoria’s hill country.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e0a3deafb967140559e6790fd5d34e8310c625d7",
      "title": "Up to 80,000 people in Australia may be affected by ‘sledgehammer’ powers to deport non-citizens to Nauru, lawyers warn",
      "url": "https://www.theguardian.com/australia-news/2025/sep/02/misleading-80000-people-in-australia-may-be-affected-by-proposed-powers-to-deport-non-citizens-to-nauru-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T14:58:21.000Z",
      "summary_90w": "",
      "raw": "Greens senator David Shoebridge accused Tony Burke of ‘doing his Peter Dutton impression, dog-whistling and punching down on migrants’ \nUp to 80,000 people in Australia may be affected by the Albanese government’s proposed powers to strip basic legal protections from the non-citizens it plans to deport to Nauru, refugee lawyers warn.\nThe proposed federal powers, revealed last Wednesday, are expected to pass parliament this week with the Coalition’s support at a snap two-hour committee hearing scheduled for Wednesday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb9cf641bcfe1fe3bc66f98e582ed087613061bf",
      "title": "Neo-Nazi Thomas Sewell charged with violent disorder over alleged attack on Indigenous protest site",
      "url": "https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T14:55:42.000Z",
      "summary_90w": "",
      "raw": "The 32-year-old has been charged along with two associates  hours after he confronted Victorian premier Jacinta Allan at a press conference\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nNeo-Nazi Thomas Sewell has been charged with violent disorder and affray over an alleged attack on Camp Sovereignty, a sacred Aboriginal burial ground in Kings Domain and longstanding protest site on Sunday.\nSewell, 32, from Balwyn, was charged with violent disorder, affray, assault by kicking, discharge missile and other offences by detectives from the Melbourne crime investigation unit, police said on Tuesday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba000e4c403761382b7e2ddf8d814db92aacc87e",
      "title": "Burkina Faso's parliament votes to outlaw homosexual acts",
      "url": "https://www.bbc.com/news/articles/c2060er4062o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T14:46:32.000Z",
      "summary_90w": "",
      "raw": "People could face up to five years in prison for breaking the new measure once signed into law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a8e83f4b1c2aebd9a96217509f8f8446a89c9da",
      "title": "Ex-actor Zack Polanski's unusual path to become Green Party's new leader",
      "url": "https://www.bbc.com/news/articles/clyrev00lwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T14:38:46.000Z",
      "summary_90w": "",
      "raw": "Zack Polanski has stormed to victory on a platform promising bold communication and \"eco-populism\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "529fb53dc0cb1d411612c1e3abb35c9f16a14c63",
      "title": "Klarna revives IPO plans, aims to raise $1.27B",
      "url": "https://techcrunch.com/2025/09/02/klarna-revives-ipo-plans-aims-to-raise-1-27b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:30:52.000Z",
      "summary_90w": "",
      "raw": "Swedish buy now, pay later (BNPL) startup Klarna and its shareholders are reviving its initial public offering, hoping to raise as much as $1.27 billion in a listing that would value the company at up to $14 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f5aebe63d3e84e946a7f7f19216060a7d95c1cc",
      "title": "A California judge rules that Trump's deployment of the guard to LA was illegal",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525647/a-california-judge-rules-that-trumps-deployment-of-the-guard-to-la-was-illegal",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T14:22:15.000Z",
      "summary_90w": "",
      "raw": "President Trump took control of the state's National Guard in June and deployed it to Los Angeles to face anti-immigration protestors and assist officers making detentions and deportations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "14b7a8a37e3db8455f33980e1ecb1bc638c314a6",
      "title": "Just 4 days left to exhibit at TechCrunch Disrupt 2025 — 10 tables remain",
      "url": "https://techcrunch.com/2025/09/02/just-4-days-left-to-exhibit-at-techcrunch-disrupt-2025-10-tables-remain/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The clock is ticking, and exhibit space at TechCrunch Disrupt 2025 is moving fast. With just 4 days and 10 table left to book, now’s the time to stop circling the idea and claim your spot on the show floor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2f7dbb58839b7d5f096d79cb02cf486220c06933",
      "title": "What's causing the UK's long-term borrowing costs to rise?",
      "url": "https://www.bbc.com/news/articles/clyry4rg9wyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:38:10.000Z",
      "summary_90w": "",
      "raw": "The cost of government borrowing has risen again - what does it mean for the public finances and upcoming Budget?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42373b97478dbdee5bf76454f7a93c836fc92e83",
      "title": "The Office spin-off turns comic spotlight on hapless newsroom",
      "url": "https://www.bbc.com/news/articles/c7vl2pv4p7po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:36:00.000Z",
      "summary_90w": "",
      "raw": "The deadpan US mockumentary follows a struggling Midwestern newspaper, the Toledo Truth-Teller.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49468c6f61aa45f7746a676e94b1aa556229c449",
      "title": "Gérard Depardieu to face trial over rape and sexual assault allegations ",
      "url": "https://www.bbc.com/news/articles/cm2v2w8m88no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T13:35:40.000Z",
      "summary_90w": "",
      "raw": "His accuser, Charlotte Arnould, says she is relieved the case is going to court, seven years after she filed a complaint.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "15d56ac5fce1033896de9416cb5260a786388161",
      "title": "Chloe Malle to become top editor at American Vogue ",
      "url": "https://www.bbc.com/news/articles/c0l6lw6je7lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:19:34.000Z",
      "summary_90w": "",
      "raw": "The 39-year-old's appointment marks a new era for one of the most influential and glamorous fashion publications.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8d2fc469147045cdde414505343391cb2a3b347",
      "title": "Sainsbury's to trial facial recognition to catch shoplifters",
      "url": "https://www.bbc.com/news/articles/c15l5p4zwdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T13:15:50.000Z",
      "summary_90w": "",
      "raw": "Sainsbury's says the technology is part of efforts to identify shoplifters to curb retail crime.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d8f6f56e84ce0719da49c43e25e83b94dfee295",
      "title": "These scientists found Alzheimer's in their genes. Here's what they did next",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/02/nx-s1-5522371/alzheimers-risk-apoe4-genes-scientists-treatment-advocacy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T13:09:33.000Z",
      "summary_90w": "",
      "raw": "Three scientists learned they carry genes that dramatically increase their risk for Alzheimer's disease. Now they're working to keep their brains healthy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4ccffc1fde4f9fb4d9308685761f164a52aa953d",
      "title": "Italy considers hiding state flight paths after jamming of von der Leyen plane",
      "url": "https://www.theguardian.com/world/2025/sep/02/italy-looks-at-hiding-state-flight-paths-after-jamming-of-von-der-leyen-plane",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T13:02:42.000Z",
      "summary_90w": "",
      "raw": "EU member states debate how to make leaders’ flights more secure as Russia blamed for GPS loss\nItaly is considering keeping state flights secret after the satellite signal of the aircraft carrying the European Commission president, Ursula von der Leyen, was allegedly jammed by Russia, Italian defence ministry sources said.\nVon der Leyen, a fierce critic of the Russian president, Vladimir Putin, and Moscow’s war in Ukraine, was flying to Bulgaria on Sunday when her charter plane lost satellite navigation aids, delaying its arrival in Plovdiv, and reportedly forcing it to circle an airport for an hour.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "450385798164892a1edeb802864365634d8b0789",
      "title": "China drilling for oil and gas inside Taiwan’s exclusive economic zone",
      "url": "https://www.theguardian.com/world/2025/sep/02/china-drilling-oil-gas-inside-taiwan-exclusive-economic-zone",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T13:00:54.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Experts say the move could be part of Beijing’s ‘greyzone’ grab for disputed territory\nChina is drilling for oil and gas inside Taiwan’s exclusive economic zone (EEZ), a move that analysts believe is likely part of Beijing’s unilateral grab for disputed territory that could also aid a future invasion of Taiwan.\nDuring July and August at least 12 oil and gas vessels and permanent structures were detected inside Taiwan’s EEZ – including one within 50km of the restricted-waters border of the Taiwan-controlled Pratas Islands – as well as several steel supports for fixed offshore drilling platforms, called jackets. Their presence inside Taiwan’s EEZ have not been previously reported.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df4dbc2a62f62d2d5bce797304aa2b695abc9818",
      "title": "Dozens of scientists find errors in a new Energy Department climate report",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5521384/energy-report-scientists-climate-change",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-02T13:00:00.000Z",
      "summary_90w": "",
      "raw": "More than 85 scientists say that a recent U.S. Department of Energy report is full of errors and misrepresents climate science.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1bfe024eabe41479e19d419f512eb7f0e277e07",
      "title": "Police officers win payout over Tallia Storm picture",
      "url": "https://www.bbc.com/news/articles/c9qyqy19vj9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T12:38:59.000Z",
      "summary_90w": "",
      "raw": "An employment tribunal found Police Scotland directly discriminated against the pair who had their firearms removed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bb911816af7d9e9f92fae4f38df366e63d335ba",
      "title": "Germany's far-right AfD suffers series of candidate deaths ahead of local vote",
      "url": "https://www.bbc.com/news/articles/c5ykyewrerpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T12:12:54.000Z",
      "summary_90w": "",
      "raw": "Police say there is no evidence of foul play, ahead of local elections in western Germany.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "892bb402d5b33b30d9eb9ef0a20c157d80d0ca44",
      "title": "Jair Bolsonaro faces justice over alleged attempt to usurp Brazilian democracy",
      "url": "https://www.theguardian.com/world/2025/sep/02/jair-bolsonaro-faces-justice-over-alleged-attempt-to-usurp-brazilian-democracy",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:12:38.000Z",
      "summary_90w": "",
      "raw": "Former president in court along with seven others accused of failed power grab after losing 2022 election\nBrazil’s former president Jair Bolsonaro and seven of his allies, including four senior members of the military, have gone on trial for allegedly attempting to stage a coup – the first time in Brazilian history such powerful figures have faced justice for seeking to topple the country’s democracy.\nBolsonaro, a paratrooper turned far-right populist who governed from 2019 until 2023, stands accused of masterminding a failed power grab after losing the 2022 election to the leftist Luiz Inácio Lula da Silva.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d1598cf1217e9e63639539aff5fc34eff9051da",
      "title": "Kim Jong-un arrives for Beijing military parade on special armoured train",
      "url": "https://www.theguardian.com/world/2025/sep/02/north-koreas-kim-jong-un-to-arrive-in-beijing-for-military-parade-on-special-armoured-train",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:05:56.000Z",
      "summary_90w": "",
      "raw": "Slow but specialised form of transport has been used by the reclusive country’s leaders for decades\nNorth Korea’s leader, Kim Jong-un, has arrived in Beijing on his signature green train to attend a military parade in China celebrating the formal surrender of Japan in the second world war.\nKim left Pyongyang for China on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "42c431dbf6d49382d6adc81880a2cfb8157b19a1",
      "title": "Whisky maker Suntory’s CEO resigns amid investigation into suspected illegal supplements",
      "url": "https://www.theguardian.com/business/2025/sep/02/whisky-suntory-ceo-resigns-takeshi-niinami",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T11:52:37.000Z",
      "summary_90w": "",
      "raw": "Takeshi Niinami bought supplements in the belief that they were legal, says Jim Beam and Laphroaig owner\nTakeshi Niinami, one of Japan’s best-known business leaders, has resigned as chief executive of the drinks company Suntory after police raided his home as part of an investigation into suspected illegal supplements.\nHis resignation from the owner of the Jim Beam whisky brand has sent shockwaves through Japan’s corporate world, with Suntory executives attempting to reassure investors and consumers at a hastily arranged news conference.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24cd045a7276ab858581db6792ace812b83c0436",
      "title": "Kraft Heinz is splitting up, separating hot dogs from ketchup",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5464951/kraft-heinz-split-breakup",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T11:26:42.000Z",
      "summary_90w": "",
      "raw": "One of the world's largest food brands is splitting apart a decade after a messy megamerger staged by Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "06aa1975d4538ca33b10208bfacf5a7f5dcd9730",
      "title": "Hundreds killed in Sudan landslide, UN  says",
      "url": "https://www.bbc.com/news/articles/cdj2jygzzk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T10:45:30.000Z",
      "summary_90w": "",
      "raw": "Sunday's landslide followed heavy rain and \"levelled\" a remote village, a local armed group says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b016be77d542ad20842b37dd9878a0d42e93294c",
      "title": "Billy Bragg releases song in support of Palestine and Greta Thunberg aid flotilla",
      "url": "https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T10:40:02.000Z",
      "summary_90w": "",
      "raw": "Hundred Year Hunger – which has a chorus in Arabic – has been released by the British protest singer to coincide with a humanitarian aid flotilla heading for Gaza\nBilly Bragg has released a new original song to show his support for the people of Palestine. The title of Hundred Year Hunger was inspired by a new book of the same name by E Mark Windle about the history of chronic malnutrition and deprivation in Gaza and will raise money for the Amos Trust’s Gaza Appeal.\nWriting on Instagram, the British protest singer said that the song “looks at the current famine that Israel has created in Gaza through the lens of a century of enforced food insecurity and malnutrition imposed on the Palestinian people, firstly by British imperialism, then as a weapon of mass displacement by the state of Israel”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c6c346e2a8e935580af4be06c7a136a230de45a",
      "title": "Archaeologists in Peru discover 3D mural that could date back 4,000 years",
      "url": "https://www.theguardian.com/world/2025/sep/02/archaeologists-peru-discover-mural-4000-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T10:30:33.000Z",
      "summary_90w": "",
      "raw": "The unprecedented find has shifted archaeological understanding about the first civilisations in the Americas\nArchaeologists in Peru have discovered a multicoloured three-dimensional wall that could date back 4,000 years, in an unprecedented find that has shifted archaeological understanding about the first civilisations in the Americas.\nThe centrepiece of the three-by-six metre wall carving is a stylistic depiction of a large bird of prey with outstretched wings, its head adorned with three-dimensional diamond motifs that visually align the south and north faces of the mural. It is covered with high-relief friezes and features designs painted in blue, yellow, red and black.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3bbe066f9ca264069dd0d492f08ca06849b7d8f",
      "title": "UK could see second night of dazzling Northern Lights ",
      "url": "https://www.bbc.com/news/articles/c5yey8l59p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T10:04:25.000Z",
      "summary_90w": "",
      "raw": "The lights put on a strong display on Monday and could continue into Tuesday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "412aa03368e77abdc17146130a428eacb10acfcf",
      "title": "Federal tax credits for electric vehicles are ending, leading to spike in sales",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650/federal-tax-credits-for-electric-vehicles-are-ending-leading-to-spike-in-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T08:59:57.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b0afda85cdeb6c3935cb399073b567879e6a5aae",
      "title": "Russia's Putin hails 'unprecedented' ties with China at talks in Beijing",
      "url": "https://www.bbc.com/news/articles/cr4e4ngvvnro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T08:51:33.000Z",
      "summary_90w": "",
      "raw": "The two leaders are seeking to promote \"a more just and reasonable global governance system\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ddb4583e1d68cd78a8f4eaac843bcb10178d0cdb",
      "title": "How oil has brought Russia, China and India closer",
      "url": "https://www.bbc.com/news/articles/c627p49lp40o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T08:28:59.000Z",
      "summary_90w": "",
      "raw": "Russia's Vladimir Putin met China's and India's leaders in Tianjin in a show of solidarity.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70d57a67fb82f005c30fec4598a2ea029e8a9aaa",
      "title": "How real is Love Is Blind? Behind the pods, edits and drama",
      "url": "https://www.bbc.com/news/articles/c939edkn4j4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T07:59:15.000Z",
      "summary_90w": "",
      "raw": "Thirty hopefuls entered the pods, five couples got engaged, three were married but only one remains together.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7789d37b5c798382871e02e48886c6dee9e86066",
      "title": "Beijing tightens control ahead of Xi's big moment on world stage",
      "url": "https://www.bbc.com/news/articles/cn020wrnw78o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T06:37:27.000Z",
      "summary_90w": "",
      "raw": "It is a big week for Xi Jinping, who will host Vladimir Putin and Kim Jong Un in Beijing at a massive military parade.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "513444dfa843e2ed963274b891736ebe8f13c954",
      "title": "BMW, I am so breaking up with you",
      "url": "https://techcrunch.com/2025/09/01/bmw-i-am-so-breaking-up-with-you/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T06:07:36.000Z",
      "summary_90w": "",
      "raw": "I’m driving my i4 back to the dealership as soon as my lease is over. I'm surprised to say I can't wait.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3104d87a5bd662056b24e30dd277002d2f0a57c4",
      "title": "Twenty missing in Indonesia protests, rights group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/indonesia-protests-twenty-missing-rights-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T04:59:50.000Z",
      "summary_90w": "",
      "raw": "Mass protests first erupted last week, prompted by anger over the perks and benefits given to lawmakers, including a controversial housing allowance\nAt least 20 people are missing following violent protests that have gripped cities across Indonesia over the past week, a human rights group has warned.\nMass protests first erupted on 25 August, prompted by anger over the perks and benefits given to lawmakers, including a controversial housing allowance. Public fury escalated further when a motorcycle taxi driver, 21-year-old Affan Kurniawan, was run over by a police vehicle at a protest site.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8173a2881ad5fc29a63310a224b2a0a4e43aa596",
      "title": "Indian grocery startup Citymall raises $47M to challenge ultra-fast delivery giants",
      "url": "https://techcrunch.com/2025/09/01/indian-grocery-startup-citymall-raises-47m-to-challenge-ultra-fast-delivery-giants/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T04:30:00.000Z",
      "summary_90w": "",
      "raw": "Citymall's funding comes at a time of a quick-commerce frenzy in the Indian market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T04:08:12.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5bbd5ddade2f3b4c8ec87a973c5fd34539ccc944",
      "title": "Starter homes are scarce, so Utah set a target to build more. Here's how it's going",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5431545/starter-homes-utah-housing-cost-affordable-target",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T04:01:00.000Z",
      "summary_90w": "",
      "raw": "In one of the country's priciest housing markets, Utah's leaders worry young people are shut out from building wealth. But despite new incentives, few developers are signing on to build smaller homes.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c4629edf45809674f00a41f8fc05add6df351804",
      "title": "US and Indian VCs just formed a $1B+ alliance to fund India’s deep tech startups",
      "url": "https://techcrunch.com/2025/09/01/u-s-and-indian-vcs-just-formed-a-1b-alliance-to-fund-indias-deep-tech-startups/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T03:30:00.000Z",
      "summary_90w": "",
      "raw": "Eight U.S. and Indian VC and PE giants are teaming up to fuel India's deep tech boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "55abcc58b765874002cccc0e12e0c9f1be960d7b",
      "title": "India’s Offgrid raises $15M to make lithium optional for battery storage",
      "url": "https://techcrunch.com/2025/09/01/indias-offgrid-raises-15m-to-make-lithium-optional-for-battery-storage/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-02T00:30:00.000Z",
      "summary_90w": "",
      "raw": "India's Offgrid Energy Labs has developed proprietary zinc battery tech as a safer, more cost-effective alternative to lithium for energy storage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a3e022afdd2256a34c3a6e280d1c8816a7b3554",
      "title": "Body seen in secret mortuary could solve 50-year mystery of vanished religious leader",
      "url": "https://www.bbc.com/news/articles/clyr1qr529xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T00:18:28.000Z",
      "summary_90w": "",
      "raw": "Compelling evidence to suggest Lebanese Shia leader Musa al-Sadr was killed in Libya is uncovered by BBC.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b464925ff52c8e202576772a8fe3172bfa6f1051",
      "title": "Trial of Brazil's ex-President Bolsonaro enters final phase",
      "url": "https://www.bbc.com/news/articles/c4gzgq9n8xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T23:29:57.000Z",
      "summary_90w": "",
      "raw": "The former president is accused of plotting a coup to remain in power after he lost the 2022 election.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e755e93284072beddf13a0715f3d1b6f8a24915b",
      "title": "LayerX uses AI to cut enterprise back-office workload, scores $100M in Series B",
      "url": "https://techcrunch.com/2025/09/01/layerx-uses-ai-to-cut-enterprise-back-office-workload-scores-100m-in-series-b/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-01T23:00:00.000Z",
      "summary_90w": "",
      "raw": "This Japanese AI startup just raised $100M to cut businesses’ admin burden.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c0e6d0c8ef09900d8d54bd5f5af91eea6830e085",
      "title": "Watch: Buildings destroyed and rescue efforts under way after deadly Afghanistan earthquake",
      "url": "https://www.bbc.com/news/videos/cqxgx8d14wwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:29:23.000Z",
      "summary_90w": "",
      "raw": "At least 800 people have been killed and thousands injured in the east of the country after a 6.0 magnitude earthquake struck on Sunday night.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "68105a770ce0bbb71d9718bdd33c6fe1ec26154f",
      "title": "How the death of a delivery driver ignited Indonesia",
      "url": "https://www.bbc.com/news/articles/c2dj9w306wzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T22:08:13.000Z",
      "summary_90w": "",
      "raw": "Protests over corruption and inequality have spiralled into violence, arson and deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c53797258bf907dbbb347ef267bf701ba52b936",
      "title": "The Downing Street Shake-Up",
      "url": "https://www.bbc.co.uk/sounds/play/p0m08tdx?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-01T19:32:00.000Z",
      "summary_90w": "",
      "raw": "The Prime Minister says he’s in “phase two” of government.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f316b9681a24d40b1cf17b7e37459bdc772ccd1",
      "title": "Nestlé sacks CEO over ‘undisclosed romantic relationship’",
      "url": "https://www.theguardian.com/business/2025/sep/01/nestle-fires-ceo-after-investigation-into-undisclosed-romantic-relationship",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T18:42:34.000Z",
      "summary_90w": "",
      "raw": "Swiss multinational finds Laurent Freixe breached code of conduct as it names Philipp Navratil as his replacement\nNestlé has dismissed its chief executive, Laurent Freixe, after an investigation into an “undisclosed romantic relationship” with a subordinate that was found to have breached its code of business conduct.\nThe Swiss-headquartered multinational named Philipp Navratil as his replacement.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f65a37ff4654a963c0a7f61affc3937c5a5b32b2",
      "title": "Guatemala says it is willing to receive hundreds of deported children from US",
      "url": "https://www.theguardian.com/world/2025/sep/01/guatemala-to-receive-deported-children-from-us",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T17:36:33.000Z",
      "summary_90w": "",
      "raw": "Announcement comes a day after a US federal judge halted the deportation of 10 unaccompanied Guatemalan minors\nGuatemala is ready and willing to receive about 150 unaccompanied children of all ages each week from the United States, the country’s president has said, a day after a US federal judge halted the deportation of 10 Guatemalan children.\nThose children had already boarded a plane when a court responded to an emergency appeal on Sunday. They were later returned to the custody of the Office of Refugee Resettlement.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89d4226069d5468002f6233efedff9644e32bfd9",
      "title": "Leaked ‘Gaza Riviera’ plan dismissed as ‘insane’ attempt to cover ethnic cleansing",
      "url": "https://www.theguardian.com/world/2025/sep/01/leaked-gaza-riviera-plan-dismissed-as-insane-attempt-to-cover-ethnic-cleansing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T17:08:16.000Z",
      "summary_90w": "",
      "raw": "Prospectus proposes forced displacement of entire population and puts territory into US trusteeship\nA plan circulating in the White House to develop the “Gaza Riviera” as a string of high-tech megacities has been dismissed as an “insane” attempt to provide cover for the large-scale ethnic cleansing of the Palestinian territory’s population.\nOn Sunday the Washington Post published a leaked prospectus for the plan, which would involve the forced displacement of Gaza’s entire population of 2 million people and put the territory into a US trusteeship for at least a decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34dfaa5776a575338c0a898a4ad04f6ae908c6e0",
      "title": "Americanswers…on 5 Live! Why did the internet think Trump was dead?",
      "url": "https://www.bbc.co.uk/programmes/p0m081ky?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-01T16:56:00.000Z",
      "summary_90w": "",
      "raw": "And why is RFK Jr reshaping America’s top health agency?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76acbd403178bf2d6b224298d92f08b2b69fe4ba",
      "title": "‘Coalition of willing’ to discuss security guarantees for Ukraine in meeting on Thursday – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T16:10:54.000Z",
      "summary_90w": "",
      "raw": "Meeting, co-chaired by France’s Emmanuel Macron and UK’s Keir Starmer, will focus on Russia’s refusal to end war. This live blog is closed\nEU transport spokesperson Anna-Kaisa Itkonen also offered a bit more detail on the issue of GPS jamming and its impact on operations.\nShe said:\n“Generally, we have been seeing a quite a lot of such jamming and spoofing activities, notably in the eastern flank of Europe.\nEurope is the most concerned region in the or most affected region globally, on this.\n“We are, of course, aware and used to somehow to the threats and intimidations that are [a] regular component of Russia’s hostile behaviour.\nOf course, this will only reinforce even further our unshakable commitment to ramp up defence capabilities and support for Ukraine.”\n“This incident actually underlines the urgency of the mission that the President is carrying out in the frontline member states.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aa7118af58788058a39f4d1853814349b14ee1c3",
      "title": "BBC reports from scene as Afghanistan earthquake rescue mission gets under way",
      "url": "https://www.bbc.com/news/videos/c3v3gg6zr3yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T13:53:10.000Z",
      "summary_90w": "",
      "raw": "Rescuers are having to travel by helicopter to the worst-hit areas, as they have been cut off by the earthquake.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7fbb69296862962575dedc4b2b68fb610fef448e",
      "title": "Israel committing genocide in Gaza, world’s top scholars on the crime say",
      "url": "https://www.theguardian.com/world/2025/sep/01/israel-committing-genocide-in-gaza-worlds-top-scholars-on-the-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-01T12:06:16.000Z",
      "summary_90w": "",
      "raw": "International Association of Genocide Scholars resolution backed by 86% of members who voted\nThe world’s leading genocide scholars’ association has backed a resolution stating that Israel’s actions in Gaza meet the legal definition of the crime.\nOut of the International Association of Genocide Scholars’s (IAGS) 500 members, 28% took part in the vote. Of those who voted, 86% supported the resolution. The resolution states that “Israel’s policies and actions in Gaza meet the legal definition of genocide in article II of the United Nations convention for the prevention and punishment of the crime of genocide (1948).”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b922ff820e9ad58307010f6072b7e31bb43110a",
      "title": "How Trump is decimating federal employee unions one step at a time",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5515633/trump-federal-workers-labor-unions-va",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump has ended collective bargaining rights for more than one million federal workers. Unions have sued to block the move, but agencies are terminating contracts as litigation continues.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "25420189fc3ebb65efbc241c35d6fdee0cf226b0",
      "title": "Korean skincare industry expected to be hit hard by end of 'de minimus' exemption",
      "url": "https://www.npr.org/2025/09/01/nx-s1-5519724/korean-skincare-industry-expected-to-be-hit-hard-by-end-of-de-minimus-exemption",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-01T08:56:33.000Z",
      "summary_90w": "",
      "raw": "On Friday, the \"de minimis\" exemption ended -- meaning that imports worth $800 or less won't be able to enter the country tax-free. One of the industries bracing for the impacts is Korean skincare.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cfedc51d287bfd56cf87870ed940b50af617bf9f",
      "title": "Spirit Airlines files for bankruptcy for 2nd time in less than a year",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5522901/spirit-airlines-bankruptcy-filing",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T12:26:13.000Z",
      "summary_90w": "",
      "raw": "The budget carrier filed for fresh bankruptcy protection months after emerging from a Chapter 11 reorganization. The airline said it plans to keep flying as usual during the restructuring process.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b65f7e3d48d2caf1048c46364fb2b06ae7fca123",
      "title": "How colorful do we want our food to be? American shoppers have a say",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5452278/how-colorful-do-we-want-our-food-to-be-american-shoppers-have-a-say",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T11:44:15.000Z",
      "summary_90w": "",
      "raw": "As more major food brands commit to phasing out chemical dyes from snacks and cereals in the U.S., some are struggling to find natural replacements. Many consumers say they want bright colors.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ffe6e27ea56bb28e8d852c29ad02e7aeda0eac93",
      "title": "AI and Nvidia have been bright spots in an uncertain economy, but there are doubts now",
      "url": "https://www.npr.org/2025/08/30/g-s1-86377/ai-nvidia-economy-stocks",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T09:00:00.000Z",
      "summary_90w": "",
      "raw": "This past week, AI darling Nvidia reported blockbuster financial results that beat analysts' expectations. But investors weren't impressed and the stock price dropped.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1ca0ab8c6f56c940793465a1d373e9a2097e433e",
      "title": "Dear Life Kit: Do I have to buy birthday gifts for my 18 nieces and nephews?",
      "url": "https://www.npr.org/2025/08/30/g-s1-86361/dear-life-kit-do-i-have-to-buy-birthday-gifts-for-my-18-nieces-and-nephews",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-30T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Experts answer a round of finance questions from NPR's audience, including how to financially support a friend with Stage 4 cancer and how to stop paying for your parents.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37aa811eccb417ff986e00dff34d9c6a9bedb670",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "url": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T06:00:25.000Z",
      "summary_90w": "",
      "raw": "Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing\nMalawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.\nIt comes just months after the World Health Organization (WHO) revealed that the country had successfully reduced tuberculosis (TB) cases by 40% over the past decade.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}