{
  "version": "1757544720711",
  "generatedAt": "2025-09-10T22:52:00.711Z",
  "items": [
    {
      "id": "f86ebe78fc516febccb7bb6e228cd3b49e564cbe",
      "title": "T20 Cricket",
      "url": "https://www.bbc.co.uk/iplayer/live/bbctwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T23:02:40.000Z",
      "summary_90w": "",
      "raw": "Highlights of the first game of the T20 series between England and South Africa.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d88f503704b38df98b3d37f5de735e77d2fb502",
      "title": "Charlie Kirk, who forged a conservative youth movement, dead aged 31",
      "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T22:42:18.000Z",
      "summary_90w": "",
      "raw": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92549df85c8f60d3f350d908ec5e12f9f729667d",
      "title": "Australia news live: NSW lashed by wild weather; MPs condemn Charlie Kirk shooting",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T22:38:17.000Z",
      "summary_90w": "",
      "raw": "Heavy rain continues in NSW capital after state hit by thunderstorms and tornado warning. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nWild weather is lashing Australia’s east coast, with heavy downpours triggering a surge in calls for assistance, AAP reports.\nMultiple severe weather warnings remain in place, including alerts for damaging winds and hazardous surf across NSW. At least two tornadoes were reported across the state, including one captured on camera from a fire tower at Young as it tore through a field.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f115cfeaad35bf8d6ad3ed222f76d21c480fa0d8",
      "title": "Amazon drivers could be wearing AR glasses with a built-in display next year",
      "url": "https://www.theverge.com/news/776155/amazon-augmented-reality-glasses-jayhawk-launch-rumors",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T22:30:08.000Z",
      "summary_90w": "",
      "raw": "The new glasses would go beyond Amazon’s Echo Frames.\t\n\nAmazon, like Meta, Google, Samsung, and Snap, is working on a new pair of augmented-reality (AR) glasses, according to a report from The Information. The AR glasses, codenamed Jayhawk, could reportedly come with a full-color display in one eye, along with built-in microphones, speakers, and a camera.\nThe report comes just before Meta is expected to reveal its “Hypernova” smart glasses at its Connect event. Meta’s glasses are rumored to be a step above its Ray-Ban smart glasses, offering a small display for mini apps and alerts on the right lens, according to Bloomberg. Meta is also working on a pair of AR glasses known as Orion.\nAmazon launched its third-gen Echo Frame smart glasses in 2023, but their features fall flat when compared to Meta’s Ray-Bans. Though Amazon may launch its first AR glasses in late 2026 or early 2027, The Information reports that Amazon could release a pair made for delivery drivers even earlier.\nAmazon initially plans on making 100,000 units of the glasses for delivery drivers, called “Amelia” internally, The Information reports. They will reportedly have a bulkier design when compared to the consumer version, along with a display designed to provide instructions to drivers about where to deliver packages. Reuters reported on the glasses last year, saying they would offer drivers “turn-by-turn navigation on a small embedded screen.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1156edad10d423f6b48941059bef396d8fc7820",
      "title": "England beaten by SA in rain-reduced opening T20",
      "url": "https://www.bbc.com/sport/cricket/articles/cly65123mjgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T22:03:16.000Z",
      "summary_90w": "",
      "raw": "South Africa win a chaotic, rain-affected opening T20 in Cardiff by 14 runs as England fail to chase 69 in five overs.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c5bfee09a7c91efbb0f35e336ab5a160c18e697",
      "title": "Trump to visit late Queen's tomb during UK state visit",
      "url": "https://www.bbc.com/news/articles/cjedxl0qxyjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T22:00:07.000Z",
      "summary_90w": "",
      "raw": "The US president's second state visit to the UK is an unprecedented gesture towards a US leader.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59a0e5ce91eb58b22e3d1465eb065af8daac0190",
      "title": "Gary Lineker ends Ant and Dec's 23-year winning streak at TV awards",
      "url": "https://www.bbc.com/news/articles/cg7dgd394kno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T21:32:22.000Z",
      "summary_90w": "",
      "raw": "Lineker left the the BBC after 26 years at the end of the Premier League season in May.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57ce8bf756e4f328ac6e32ad22b8e1e712b2e460",
      "title": "Thinking Machines Lab wants to make AI models more consistent",
      "url": "https://techcrunch.com/2025/09/10/thinking-machines-lab-wants-to-make-ai-models-more-consistent/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T21:30:11.000Z",
      "summary_90w": "",
      "raw": "In a blog post shared Wednesday, Mira Murati's startup offered a rare glimpse into some of work its doing to improve AI models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e828f4a0a47ccf8bb84c8482b468b6390475c8b1",
      "title": "Ted Cruz’s new bill would let AI companies set their own rules for up to 10 years",
      "url": "https://www.theverge.com/ai-artificial-intelligence/776130/senator-ted-cruz-ai-sandbox-bill",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T21:25:20.000Z",
      "summary_90w": "",
      "raw": "On Wednesday, Sen. Ted Cruz introduced legislation to create a regulation \"sandbox\" that would allow artificial intelligence companies to experiment with minimal federal oversight. \nThe SANDBOX Act, if passed by Congress, would allow companies to apply for modifications to or waivers from any \"obstructive regulations\" to the testing and deployment of products or services that use or contain \"in whole or in part\" at least one AI system. In return, companies would be required to disclose plans to mitigate consumer safety and financial risks. \nThe waivers would last for two years at a time, up to 10 years, harkening back to the failed morator …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef68cf68717ca35f3a60f509f239c9b4dc7cb4b5",
      "title": "Students flee as Kirk shot in front of crowd of hundreds",
      "url": "https://www.bbc.com/news/videos/c2ejgzyggpmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T21:20:58.000Z",
      "summary_90w": "",
      "raw": "Video from the campus in Utah shows how the event turned to chaos after a single shot rang out.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03ef311f97f5ed8090c474813cb132b42592f748",
      "title": "How to turn off autoplay on your social media feeds",
      "url": "https://techcrunch.com/2025/09/10/how-to-turn-off-autoplay-on-your-social-media-feeds/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T21:02:52.000Z",
      "summary_90w": "",
      "raw": "Here's how you can turn off autoplaying videos and GIFs on Facebook, Instagram, X, Twitter, and Threads.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3e40d82fe69fc25c0e24e5362af314f270473e7d",
      "title": "Fire breaks out at Battersea block of flats",
      "url": "https://www.bbc.com/news/articles/cpvlmk9pw40o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T21:00:18.000Z",
      "summary_90w": "",
      "raw": "The four-storey block on Maysoule Road is evacuated as flames rip through roof and top floor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db72f25a2e68af3cc516efa4426ced6d2806424d",
      "title": "Charlie Kirk has died after being shot at Utah university event, Trump says",
      "url": "https://www.bbc.com/news/articles/c0r0q1x74qqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T20:59:57.000Z",
      "summary_90w": "",
      "raw": "Kirk, a staunch supporter of President Donald Trump, was known for his controversial speeches at US college campuses.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54febd6702c512994ee07d54f1b4dd44e3e8fab5",
      "title": "Charlie Kirk fatally shot at Turning Point USA event in Utah",
      "url": "https://www.theverge.com/news/776079/charlie-kirk-shooting",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T20:52:21.000Z",
      "summary_90w": "",
      "raw": "Charlie Kirk, the influencer and activist who cofounded right-wing group Turning Point USA, has died at the age of 31 after being shot while speaking at an event at Utah Valley University, according to his spokesperson Andrew Kolvet, speaking to The New York Times. Deseret News had earlier reported Kirk’s death, according to Utah House Speaker Mike Schultz, and President Donald Trump said Kirk is dead in a post on Truth Social at 4:40PM ET.\nAccording to media reports, he appeared to have been hit in the neck. A spokesperson for the university, Ellen Treanor, said in a statement that “shots were fired from a building about 200 yards from the speaker.”\nFollowing the shooting, videos on social media seemed to show the arrest of an alleged suspect. Utah Valley University initially said that a suspect was in custody, but Deseret News reported that, according to officials, the status of the shooter is unclear. A spokesperson has also told The New York Times that a person taken into custody after the shooting was not actually the shooter.\nEllen Treanor, Utah Valley University: \nIt is with tremendous sadness and shock that Charlie Kirk, who was invited by the student group TPUSA, was shot at about 12:20 when he began speaking at his planned event on the Utah Valley University Orem Campus. Kirk was immediately transported by his security team to a local hospital. \nCampus was immediately evacuated. Campus is closed and classes have been canceled until further notice. We are asking those still on campus to secure in place until police officers can safely escort them off campus.  The incident is currently being investigated by four agencies: Orem Police, UVU Police, FBI, and Utah Department of Public Safety.  \nAt the time of the shooting, Kirk was speaking at the first event of a scheduled 15-stop American Comeback Tour, and seated at a “Prove Me Wrong Table” taking questions from the crowd, according to The New York Times.\nWe will continue to update this post as the situation develops.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "196048fe871d2b10813a47a4e3bbfd4eb73768ff",
      "title": "Right-wing activist Charlie Kirk fatally shot during Utah college event",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5537068/charlie-kirk-shot-utah-university-campus",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T20:45:09.000Z",
      "summary_90w": "",
      "raw": "\"The Great, and even Legendary, Charlie Kirk, is dead,\" President Trump wrote in a Truth Social Post. Kirk was shot during an outdoor speaking event at Utah Valley University on Wednesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb4d558b63b110bad4703c9e66439f7a9507c93e",
      "title": "Starmer facing pressure over Mandelson's Epstein links",
      "url": "https://www.bbc.com/news/articles/cwy9jqn0vyjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T20:32:59.000Z",
      "summary_90w": "",
      "raw": "The Tories and some Labour MPs have called for Lord Mandelson to be sacked but Sir Keir has stood by him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "385e85cd80f82595c6d96f65c22938f3dcd49130",
      "title": "Israel's attacks on Hamas in Qatar stun the Gulf and dash chances for a Gaza ceasefire",
      "url": "https://www.npr.org/2025/09/10/g-s1-87942/qatar-israeli-strikes-hamas-gaza-ceasefire",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T20:29:19.000Z",
      "summary_90w": "",
      "raw": "Qatar slams Israeli attacks on Hamas leaders in Doha as \"state terrorism\" after the bombardment rocks the tiny U.S. ally and dashes hopes of a ceasefire in Gaza",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d103319e8cda30fd0b94f4ac494f7051c34d002",
      "title": "Trump is slowing — but not stopping — US greenhouse gas reductions",
      "url": "https://www.theverge.com/news/776032/us-greenhouse-gas-emissions-trump-forecast-rhodium-group",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T20:22:44.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump has cast his shadow over the latest forecast on US greenhouse gas emissions. Reductions in planet-heating pollution are already expected to slow over the next decade, setting the US and the world back in efforts to stop climate change.\nHere’s what could have been. Taking previous climate policies into account, research firm Rhodium Group forecast last year that US greenhouse gas emissions would fall by up to 56 percent by 2035. Alas, fortunes have changed. Following “the most abrupt shift in energy and climate policy in recent memory” during the first seven months of the Trump administration, according to a new Rhodium Group report published today, we can expect a significantly slower pace of progress — a 26–35 percent reduction in emissions over the next decade compared to pollution levels in 2005. \n\nThat falls far short of the action needed to stop global temperatures from rising\n\n\nThat falls far short of the action needed to stop global temperatures from rising, a problem that is already leading to more extreme weather and other climate-related disasters across the US. The gloomier outlook reflects obstacles the Trump administration has created for wind and solar energy in the US on top of sweeping efforts to wipe federal environmental protections off the books. \nIt’s been a whiplash change since 2024. Former President Joe Biden set a goal of slashing US greenhouse gas emissions by at least 50 percent this decade as part of the nation’s commitment to the global Paris climate agreement. The Inflation Reduction Act Biden signed into law in 2022 was projected to get the US most of the way to that goal, with generous tax incentives for carbon pollution-free energy and electric vehicles projected to shrink emissions about 40 percent by 2030. The Environmental Protection Agency under Biden also introduced policies to strengthen limits on pollution from power plants and transportation. \nTrump has done the opposite. With the One Big Beautiful Bill Act, Trump is phasing out tax credits for electric vehicles and solar and wind projects. He’s been particularly combative with wind energy developers, going as far as to order a nearly complete project off the coast of Rhode Island to halt construction over purported national security concerns. \nThe EPA, meanwhile, no longer wants to regulate greenhouse gas emissions at all. In July, it proposed rescinding the landmark 2009 finding that allows the agency to regulate gases under the Clean Air Act because they endanger public health. The EPA says that if they finalize the rule change, which faces legal challenges, it would “repeal all resulting greenhouse gas emissions regulations for motor vehicles and engines, thereby reinstating consumer choice.” \nTrump, after receiving tens of millions of dollars in campaign contributions from the fossil fuel industry, tapped a former oil and gas company executive, Chris Wright, to lead the Department of Energy. This week, Wright called efforts to reach net zero greenhouse gas emissions — which researchers have found needs to happen by the middle of this century to stop global average temperatures from rising much higher than they already are — a “colossal train wreck” and a “monstrous human impoverishment program.” The US, however, has managed to maintain economic growth while limiting greenhouse gas emissions. US greenhouse gas pollution was 17 percent lower in 2022 than they were in 2005, according to the EPA. \nRhodium Group’s emissions forecast includes a range of outcomes based on whether Trump’s proposed policies come to fruition, as well as other economic factors, including oil and gas prices and costs for clean energy technologies. Even without subsidies, renewable energy is still cost competitive with gas, Rhodium Group notes. Wind and solar and related energy storage projects make up a staggering 95 percent of new electricity generation capacity queued up to connect to power grids in the US. With electricity demand suddenly on the rise because of data centers, AI, and electric vehicles, utilities are racing to add as much capacity as they can. In short, renewables aren’t going away in this forecast and will continue to cut down US greenhouse gas emissions.\nBut that’s likely to happen at a slower pace as the Trump administration works to push the scales in favor of more fossil fuels to meet that growing electricity demand. US greenhouse gas emissions have shrunk by an average of 1.1 percent annually since 2005, according to Rhodium Group. In the firm’s most pessimistic scenario, that could fall in half to a pace of just a 0.4 percent reduction each year through 2040.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "40c5bdfd3062333c9e0e75ff3ef4374eb614f910",
      "title": "Life on Mars? NASA says a rock sample shows potential signs of ancient life",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5536552/nasa-mars-rover-life-biosignature-rock-sample",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T20:14:56.000Z",
      "summary_90w": "",
      "raw": "Ancient organisms may have left microscopic \"biosignatures\" on Mars. That's according to NASA scientists, who say a rock sample offers the most concrete proof yet that the red planet once hosted life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab8c93b2e0264eab408a3ec70f7b41916e0cca7f",
      "title": "Planned weekend bus strike partly called off ",
      "url": "https://www.bbc.com/news/articles/c708qwer1wko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T19:49:30.000Z",
      "summary_90w": "",
      "raw": "Some Unite union members have accepted a pay offer following negotatiations",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f685ce70e92f92303d88958421fbbea0ad357920",
      "title": "Putin and Netanyahu present twin challenges to Trump's diplomacy",
      "url": "https://www.bbc.com/news/articles/cvg9pnpqm2jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T19:44:52.000Z",
      "summary_90w": "",
      "raw": "Israel's strikes in Doha and the Russian drone incursion could present major affronts to his authority.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37b4a474cc2f6f17ece8a2cfcf1f457e17cc3de0",
      "title": "Countdown champion stabbed rival at fans' event",
      "url": "https://www.bbc.com/news/articles/cj072jg59m0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T19:41:40.000Z",
      "summary_90w": "",
      "raw": "Jurors decide John Cowen attacked a rival with a knife at a Countdown-themed event in Blackpool.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86930cf8dcb8d0002a141956106ee004328f5e28",
      "title": "Poland dismisses Russia’s claim drone incursion was unintentional as Ukraine calls for joint European air defence system – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:31:13.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. For the latest updates on this story, read our full report:\n\nPoland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to drone incursion\n\nLubelskie region governor Krzysztof Komorski is leading an emergency meeting with the police this morning. \n\r\n In a post on X, he urged residents to follow the guidance from the relevant authorities.\nPrime minister Donald Tusk meanwhile said in his latest update that he is in “constant contact” with Nato secretary general Mark Rutte.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f669446916e1e964d117b5e69b0d08621f116518",
      "title": "Israeli airstrikes ‘killed any hope’ for hostages in Gaza, says Qatari prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:27:05.000Z",
      "summary_90w": "",
      "raw": "Mohammed bin Abdulrahman bin Jassim al-Thani calls for Benjamin Netanyahu to be ‘brought to justice’\nQatar’s prime minister has said that Benjamin Netanyahu “killed any hope” for the remaining hostages in Gaza following Israel’s extraordinary strike on Hamas negotiators in Doha on Tuesday.\nIn an interview with CNN on Wednesday, Mohammed bin Abdulrahman bin Jassim al-Thani called the deadly strike in the Qatari capital an act of “state terror”. Israel’s attack the previous day killed six members of Hamas who were negotiating a ceasefire deal brokered by the US and other Gulf countries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4af0c3e7688c3503f00f63cc20194a1017b9ed51",
      "title": "While US stalls, Australia and Anduril move to put XL undersea vehicle into service",
      "url": "https://techcrunch.com/2025/09/10/while-u-s-stalls-australia-and-anduril-move-to-put-xl-undersea-vehicle-into-service/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:12:11.000Z",
      "summary_90w": "",
      "raw": "Anduril has landed a lucrative contract and is bringing its uncrewed undersea vehicle Ghost Shark to Australian waters next year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d48ceee8b5edf664df74d7365a4014b7c8e2a3a5",
      "title": "Klarna’s IPO pops, raising $1.4B, with Sequoia as the biggest winner",
      "url": "https://techcrunch.com/2025/09/10/klarnas-ipo-pops-raising-1-4b-with-sequoia-as-the-biggest-winner/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:11:44.000Z",
      "summary_90w": "",
      "raw": "Of the 34.3 million shares Klarna sold, only 5 million were sold by the company, it said. The rest were sold by existing investors.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ea132f7941d86ace33277764e7c4ce89ca3e0e8",
      "title": "'Netanyahu, we're not leaving': Defiance in Gaza City as Israel shows aid sites planned for evacuees",
      "url": "https://www.bbc.com/news/articles/c0lkz0l4x51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T19:05:25.000Z",
      "summary_90w": "",
      "raw": "As Israel insists the whole population of Gaza City must leave, the BBC visits new aid sites the army claims will help them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a16ca0b2e40e53757452bd2a8742fc4d4d854e84",
      "title": "Prince Harry meets King Charles for first time in more than a year",
      "url": "https://www.bbc.com/news/articles/cly14jq42djo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T19:04:28.000Z",
      "summary_90w": "",
      "raw": "There had been no face to face meeting between father and son since February 2024.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c30d16306c0d90ee60df5323f815af9c45a84471",
      "title": "OpenAI and Oracle reportedly ink historic cloud computing deal",
      "url": "https://techcrunch.com/2025/09/10/openai-and-oracle-reportedly-ink-historic-cloud-computing-deal/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T19:00:34.000Z",
      "summary_90w": "",
      "raw": "OpenAI and Oracle reportedly signed a deal that includes OpenAI buying $300 billion of compute over a five-year span.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "118fff44b04a5553dcca46b5835a7821395e2ba4",
      "title": "Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to Russian drones",
      "url": "https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:00:02.000Z",
      "summary_90w": "",
      "raw": "Donald Tusk says Poland dealing with a large-scale provocation after at least 19 violations of Polish airspace\nPoland’s prime minister, Donald Tusk, said the country is closer to military conflict “than at any time since the second world war” as Warsaw and Nato allies weighed a response to an incursion of Russian drones into Polish airspace.\nPoland scrambled its own and Nato air defences, shooting down at least three drones, as Russia’s attack on Ukraine spread to Nato territory early on Wednesday in the most significant way since the full-scale invasion more than three years ago.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13ea08e07d8c36122cf44bf22c52cea93e421323",
      "title": "Accidental or deliberate? Russia's drone incursion into Poland is a test for Nato",
      "url": "https://www.bbc.com/news/articles/clydk8821nro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T18:56:48.000Z",
      "summary_90w": "",
      "raw": "Whether the drone incursion was deliberate or accidental, Moscow will be watching Nato's response to it closely.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "917520d4206bc749989cdf4716b74eca9b1e8626",
      "title": "Phillipson cements status as Labour deputy frontrunner",
      "url": "https://www.bbc.com/news/articles/c5yvdxvx449o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T18:48:21.000Z",
      "summary_90w": "",
      "raw": "The education secretary becomes the first Labour deputy leader contender to gain enough support to run.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "248e6cd5e26e136bfeea4168c717ed42959bb004",
      "title": "The best iPad to buy",
      "url": "https://www.theverge.com/23639378/best-ipad-apple-buy-model-price",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T18:31:58.000Z",
      "summary_90w": "",
      "raw": "The iPad is still the best tablet on the market. | Image: Cath Virginia / The Verge\t\n\nThere are no bad iPads. That’s the best news about Apple’s tablet lineup: 15 years after Steve Jobs first debuted the device, the iPad is the best tablet on the market, and it’s not particularly close. Apple’s App Store is enormous and filled with great apps, Apple’s performance and battery life are consistently excellent, and the iPad is still the company’s most versatile device. That’s one easy answer to your question: yes, if you want a tablet you should buy an iPad. Even last year’s iPad, or heck, last-last year’s iPad is still a solid device. Buying an older but better device — last year’s Pro instead of this year’s Air, for instance — is a tried and true iPad formula.\nBut which of all those good iPads should you buy? That’s never been more complicated. Apple sells six different iPads — the Pro in two sizes, the Air in two sizes, the Mini, and the regular ol’ iPad — all of which come with different specs and accessory options. It’s all too much.\n \n\nThe best iPad value\nThe best long-term iPad\nThe best iPad, period\nThe best iPad Mini\nAn aside on specs and extras\nWhat’s coming next\n\nI’ve tested every iPad currently on the market and have been an iPad user and reviewer since the very first model. (I’m pretty sure I got a job in 2010 because I had a brand-new iPad with me at the interview, but that’s another story.) After using all these tablets and accessories, I think I can help you make the choice.\nThe simplest way to pick an iPad is by process of elimination. First, there’s your budget: you can spend $350 on an iPad, you can spend $2,728 on an iPad Pro, or you can spend just about anything in between. You should also decide whether you need an Apple Pencil and which one has the features you need, because not every iPad supports every model. The same goes for the keyboard attachments. Between price and accessories, your choice might be instantly obvious.\nMore broadly, though, your iPad-buying journey starts with two crucial questions. The first is: what kind of iPad user are you? There are roughly two types. The first and most common iPad user mostly uses it like a larger iPhone: it’s a bigger screen on which to send emails, do the crossword, watch Netflix, and other fairly casual activities. The second type of iPad user, on the other hand, uses it like a touchscreen Mac: it’s for video editing, 3D modeling, creating presentations, crushing spreadsheets, and generally Doing Work of all sorts. You’ll also email and Netflix, of course, but you want your iPad to be a primary computing device. \nI think most people fall into the first category. (Honestly, I also think a lot of people who believe they fall into the second category… mostly don’t.)\nThe second question is more complicated to answer, and it’s what makes the iPad-buying process so tricky right now: how long do you expect to keep your iPad? If you’re looking for a device for the kids to beat up or something that will be your travel companion until you inevitably leave it somewhere, you’re going to end up with a very different device than if you’re shopping for your main computer for the next decade. In general, if you take care of your iPad, I think you can reasonably expect it to last at least five years — so that’s the timeline I have in mind as we go through this guide. \nI used to say that almost everyone should just get the base iPad. Now, I think there are two options worth seriously considering. No matter which one you choose, all the models on this list will receive Apple’s iPadOS 26 update, which launches on September 15th (and may be out by the time you read this).\nThe best iPad value\nApple iPad (11th generation)\nApple’s 11th-gen iPad is the successor to the previous 10-gen model. It has a new A16 chip and few other changes — and is the only Apple tablet to not support Apple Intelligence.\n\n\nScore: 6\n\nProsCons\n\n\nThe cheapest iPad by far\nComes in lots of fun colors\nPlenty capable for casual use\n\nThe worst screen in the lineup\nMuch older chip\nNo Pencil Pro support\n\n\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $349 $299 at Walmart (128GB, Wi-Fi)\n $349 $299 at Best Buy (128GB, Wi-Fi)\n\nScreen: 11-inch, 2360 x 1640 resolution / Processor: Apple A16 / Storage: 128GB to 512GB Port: USB-C / Cellular: 5G (optional) / Speakers: stereo / Compatible accessories: Apple Magic Keyboard Folio, Apple Pencil (USB-C)\nApple’s base model is still a really good tablet and a pretty good deal: you could buy the $349 tablet and the (wildly overpriced but still very nice) $250 Magic Keyboard Folio for the price of the iPad Air. Now that it comes with at least 128GB of storage, I have few complaints with this device.\nThe 11-inch screen is the right size for most iPad things, the camera is good and is located in the right place, it supports the Apple Pencil — though not the newer Pencil Pro — and even its A16 chip is plenty for most casual iPad uses. All the other iPads have slightly nicer screens, particularly the antireflective coating that helps mitigate glare, but that’s almost certainly not worth the additional price for most buyers.\nHere’s my reservation: the base model iPad is further behind the Air than ever before, and I worry about how that’ll play out over the next few years. If you decide to start using your iPad for more creative tasks, then you might regret not getting the Air’s M3 chip. If, by some miracle, Apple Intelligence becomes awesome in the next few years, you won’t be able to use it. \nIf you only wanted an iPad to last a couple years, for everyday iPad tasks, I’d tell you to buy this one without a second’s hesitation. But there’s a chance this one will feel old and outdated long before the Air does.\nRead our full iPad (11th-gen) review.\nThe best long-term iPad\n11-inch iPad Air M3\nThe latest 11-inch iPad Air features Apple’s fast M3 chip with GPU upgrades like dynamic caching for smoother performance in demanding apps. It also supports the Apple Pencil Pro and the new Magic Keyboard, which features a larger build and a 14-key function row. Read our review.\n\n\nScore: 8\n\nProsCons\n\n\nM3 chip is fast\nExcellent accessory support\nBetter display than the base model\n\nHas Touch ID, not Face ID\nMuch more expensive than the base model\nAI is not an upgrade so far\n\n\n\nWhere to Buy:\n\n $599 $537 at Amazon (128GB, Wi-Fi)\n $599 $549 at Best Buy  (128GB, Wi-Fi)\n $599 at Target (128GB, Wi-Fi)\n\nScreen: 11-inch, 2360 x 1640 resolution; 13-inch, 2732 x 2048 resolution / Processor: Apple M3 / Storage: 128GB to 1TB / Ports: USB-C / Cellular: 5G (optional) / Speakers: stereo / Compatible accessories: Apple Magic Keyboard for iPad Air, Apple Pencil Pro, Pencil USB-C\nThe iPad Air is supposed to be the perfect middle ground of the iPad lineup, and this year’s model gets pretty close. The M3 chip is only a tiny upgrade over the M2 — I don’t even notice it in day-to-day use — but I’ll never complain about having newer chips. The biggest upgrade to the Air this year is actually the new Magic Keyboard, which adds a row of function keys and makes the setup a much more credible laptop replacement. (The new keyboard also works with the M2 Air, and if you can find that device on sale somewhere, it’s still a great tablet.)\nThe base iPad to iPad Air upgrade is straightforward enough. You get better accessories, a somewhat better screen, and a noticeably better processor for $250. (You also get the option of a 13-inch device for another $200, but I think an 11-inch iPad is the right size for most people — the 13-inch models start to feel more like laptops than tablets.) If you’re playing Netflix and browsing the web, that $250 won’t get you much, but as soon as you start noodling around in Final Cut or even GarageBand, you’ll notice the difference. There’s a lot of room to grow into the Air, whereas the base iPad may hit its ceiling much sooner.\nThe other thing the Air offers that the base iPad doesn’t is Apple Intelligence. Right now, this is not a problem: there is exactly nothing in Apple Intelligence worth spending $250 on. But if you’re an AI believer, you should know that the base iPad won’t get whatever’s coming.\nRead our full iPad Air M3 review.\nThe best iPad, period\n13-inch iPad Pro M4\nThe newest iPad Pro comes in either an 11- or 13-inch configuration with Apple’s M4 processor. Both models also feature an OLED display, a much thinner and lighter build, new horizontal placement for the front camera, and support for the Apple Pencil Pro.\n\n\nScore: 8\n\nProsCons\n\n\nOutrageously powerful\nGorgeous screen and design\nFull accessory support\n\nOutrageously expensive\nLike, MacBook Pro-level expensive\n\n\n\nWhere to Buy:\n\n $1299 $1194.5 at Amazon (256GB, Wi-Fi)\n $1499 $1399 at Amazon (512GB, Wi-Fi)\n $1899 $1723 at Amazon (1TB, Wi-Fi)\n\nScreen: 11-inch, 2420 x 1668 resolution 120Hz OLED; 13-inch, 2752 x 2064 resolution 120Hz OLED; nano-texture glass optional / Processor: Apple M4 / Storage: 256GB–2TB / Ports: USB-C / Cellular: 5G (optional) / Speakers: four / Compatible accessories: Apple Magic Keyboard, Apple Pencil Pro, Pencil USB-C\nIf you’re not worried about price tags, this is easy: the latest iPad Pro is my favorite tablet of all time. The Tandem OLED screen is bright and crisp, the tablet is barely thicker than its USB-C port, it’s light, it’s thin, and it’s about as well made as you could expect a tablet to be. The M4 chip is plenty fast even for high-end games and ultra-complex creativity apps. It supports the new, lighter, better Magic Keyboard case and the Pencil Pro. I have plenty of qualms about how powerful iPadOS is, and the limits it places on just how powerfully you can use an iPad, but the M4 Pro is everything you’d want in a tablet.\nBut oh boy, the price. The Pro starts at $999 for the 11-inch model, and if you want a keyboard, a Pencil, and even a single storage upgrade, you’re quickly looking at a $2,000 purchase. If we’re just talking about a Netflix and email machine, we’re long past the point of diminishing returns. But if you don’t care, and you just want the best thing money can buy? Here it is. You won’t be disappointed.\nRead our full iPad Pro review.\nThe best iPad Mini\n2024 iPad Mini\nThe seventh-gen iPad Mini comes with Apple’s A17 Pro chip and support for Apple Intelligence. It’s also compatible with the Apple Pencil Pro and offers faster Wi-Fi and USB-C speeds. Read our review.\n\n\nScore: 6\n\nProsCons\n\n\nIdeal for one-handed use\nWorks with the Pencil Pro\n\nMissing some accessory support\nCamera’s in the wrong spot\n\n\n\nWhere to Buy:\n\n $499 $474 at Amazon (128GB, Wi-Fi)\n $599 $574.3 at Walmart (256GB, Wi-Fi)\n $799 $749 at Amazon (512GB, Wi-Fi)\n\nScreen: 8.3-inch, 2266 x 1488 resolution 60Hz Mini LED / Processor: Apple A17 Pro / Storage: up to 2TB / Port: USB-C / Cellular: 5G (optional) / Speakers: quad / Compatible accessories: Apple Pencil Pro, Pencil USB-C, Smart Folio\nYou’re either an iPad Mini person or you’re not. I very much am: I’ve used a Mini for years as my device for reading in bed, watching movies on airplanes, and playing games on the go. The latest Mini is a bit of a disappointment, with a slightly underpowered processor and an old design that could have used smaller bezels and a relocated camera. But it’s still the iPad Mini, and it’s still good enough for most tablet things. If you want an iPad Mini, this is it.\nRead our full iPad Mini review.\nAn aside on specs and extras\nOnce you’ve picked an iPad model, you still have a bunch of decisions to make. And many of them are about specs and features that will cost you hundreds of dollars. Here are my recommendations for some of the things you’ll encounter:\nCellular coverage: You probably don’t need this. Unless you live in a really remote place, Wi-Fi is available in most places. That said, I’ve found that I use cell-equipped iPads far more often when I can just pull them out and know they’re connected — there’s something about busting it out in the park or on the subway that just feels great. Plus, it’s a really useful hotspot for other devices. This isn’t the first place I’d spend my money, though.\nStorage: This is the first place I’d spend my money. All the iPads now come with at least 128GB of storage, which is a big upgrade — 64GB was just never enough. Even now, though, I recommend springing for 256GB if you can afford it; you’d be surprised at how quickly your photos, videos, and Netflix downloads add up.\nEngraving: Don’t do this. It screws up returns and makes selling or giving it away harder. Just don’t do it.\nApple Pencil: As much as I’d love for this to be an all-purpose accessory, it’s really not. Buy it (either the USB-C or the Pro) if you plan to handwrite or draw a lot. Otherwise, skip it.\nMagic Keyboard: This is the first accessory I’d recommend to most people — many people type a lot on their iPads, and it’s also a handy stand and dock for the tablet. You can find cheaper keyboard docks than Apple’s, but I haven’t found one I like better. It’s expensive no matter which model you buy, though.\nMy gadget shopping advice is always to buy the best thing you can afford and hold it for as long as possible, and that’s more doable with an iPad than almost any other device category. If you have the extra $100 to spend on storage, do it. If you want to upgrade because you think AI will get more powerful in the next few years, go for it! Just make sure you know which kind of iPad user you really are, and get the best one you’ll actually make use of. Hopefully for a long time to come.\nWhat’s coming next\nFor the first time in a while, the iPad lineup feels fairly up to date. The Air, Mini, and base model have all been updated in the last several months. The Pro is actually the oldest device in the lineup, and Bloomberg has reported that an M5-powered Pro could be coming as soon as this year. \nApple does appear to be updating its devices more often than before, sometimes on an iPhone-style annual schedule. Obviously, your iPad doesn’t need to be upgraded that often, and the year-to-year upgrades tend to be small. So our advice still holds: if you need a new one, now’s a good time. If you don’t, there seems to always be an upgrade just around the corner.\nUpdate, September 10th: Adjusted prices and availability.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5b72491c99dc0f871e0430d00964a830a93d690",
      "title": "You can preorder the AirPods Pro 3 right now",
      "url": "https://www.theverge.com/tech/775719/airpods-pro-3-third-gen-preorder-buy-amazon-best-buy-walmart",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T18:29:39.000Z",
      "summary_90w": "",
      "raw": "The AirPods Pro 3 will hit stores on September 19th for $249.\t\n\nApple’s most impressive wireless earbuds are now available to preorder from Amazon, Best Buy, Walmart, and Target for $249. The new AirPods Pro 3 won’t arrive until September 19th, but you can place your order from the retailer of your choice, then be among the first to dig into their premium features on launch day.\nAirPods Pro 3\nThe third-gen AirPods Pro add a new built-in heart rate sensor and live translation feature. They also improve upon their predecessor with twice the noise cancellation, better sound, and a fifth swappable ear tip option.\n\nWhere to Buy:\n\n $249 at Amazon\n $249 at Best Buy\n $249 at Walmart\n\nWe’ve gone into detail about how the AirPods Pro 3 stack up against the rest of Apple’s AirPods lineup of earbuds and over-ear headphones in our comparison guide. The most notable change is a new built-in heart rate sensor that lets iPhone owners track calories burned and track progress in over 50 types of workouts from the Fitness app. Also of note, Apple claims that the new buds can deliver ANC that’s twice as effective as the last-gen model, while battery life has increased. But there are more features beyond improved bass and better active noise cancellation.\nThe buds’ case is a little lighter, and there’s a fifth ear tip option in the box (XXS) for a more secure, comfortable fit for those with tiny outer ears. To top it off, they feature an improved IP57 rating for dust and water (and sweat) resistance.\nWe’ll be publishing our full review of the AirPods Pro 3 as soon as we can, so stay tuned. In the meantime, be sure to check out our coverage if you’re also looking to preorder the new iPhones or new Apple Watches.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a3915ee104632b8078a61f6f391cc2643690e00c",
      "title": "Human remains found in Tesla linked to singer D4vd",
      "url": "https://www.bbc.com/news/articles/cp98npjkje2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T18:29:11.000Z",
      "summary_90w": "",
      "raw": "The grim discovery was made in the front trunk of the vehicle after it was towed from the Hollywood Hills area.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c9cca73a52661287451931d0270f05c1cf85d21",
      "title": "Apple isn&#8217;t packing a charging cable in with the AirPods Pro 3",
      "url": "https://www.theverge.com/news/775981/apple-airpods-pro-3-no-charging-cable-in-box",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T18:17:55.000Z",
      "summary_90w": "",
      "raw": "The AirPods Pro 3 seem like a solid upgrade, but they have one significant drawback: Apple isn’t including a charging cable in the box, MacRumors reports. Apple spells it out right on the AirPods Pro 3 tech specs page, saying in the “In the Box” section that “USB‑C Charge Cable sold separately.” That means that if you want to charge the case for the AirPods Pro 3, you’ll need to use a charging cable you already have, buy a new one, or use a wireless charger.\nFor a lot of people, this may not be a huge issue, especially if you already have a bunch of USB-C cables lying around the house. It’s arguably a little more environmentally friendly, since it might mean fewer people lose or throw away yet another cable.\nBut I’m the type of person who likes to stash away the additional cables I get with my tech, even if I don’t need them at the time — having an extra cable in storage has come in handy more times than I care to admit. And with Apple having already stopped packing in things like wall plugs and headphones with iPhones, and now I’m wondering if it may someday stop including a charging cable in the box with iPhones, too.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7aaf7d2d8b9f38e144f9e2f2b0783864316b33bf",
      "title": "Poland says it shot down Russian drones after airspace violation",
      "url": "https://www.bbc.com/news/articles/c147065pzdzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T18:15:03.000Z",
      "summary_90w": "",
      "raw": "Nato jets were deployed to respond to drones that entered Polish airspace during Russian strikes on Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74f3528a701a386a6b900c3fa8104322368cfdd3",
      "title": "Almost all German pilots admit to napping during flights in union survey",
      "url": "https://www.theguardian.com/world/2025/sep/10/about-93-of-pilots-admit-napping-during-flights-in-german-survey",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T18:08:51.000Z",
      "summary_90w": "",
      "raw": "Pilots’ union says the issue has become a ‘worrying reality’ as a result of staff shortages and operation pressure\nA German pilots’ union has said that napping during flights has become a “worrying reality” for its members, as it sounded the alarm over “increasing fatigue” in the sector.\nThe Vereinigung Cockpit union said it had carried out a survey of more than 900 pilots in recent weeks, which found that 93% of them admitted to napping during a flight in the past few months.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0c530c0888212e92b4f6a6371a20c41c35dc20d",
      "title": "Anti-Islamic biker gang members hired to run security at controversial Gaza aid sites",
      "url": "https://www.theguardian.com/world/2025/sep/10/anti-islamic-biker-gang-infidels-mc-gaza-aid-sites",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T18:00:45.000Z",
      "summary_90w": "",
      "raw": "More than 10 Infidels MC members deployed to sites run by US- and Israeli-backed Gaza Humanitarian Foundation\nSenior members of an anti-Islamic biker gang have been hired by US contractors and deployed to Gaza to oversee security at food distribution sites backed by the US and Israeli governments, according to a BBC investigation.\nThe investigation found that more than 10 members of Infidels MC, a US biker gang that uses the Crusader cross as its symbol and whose members have anti-Islamic tattoos, have been hired by UG Solutions and deployed to food aid sites run by the Gaza Humanitarian Foundation. According to the BBC, seven members of the gang are in “senior positions overseeing [GHF] sites”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "45e47eeba17b40783853f42f78d97ee8b27c5e8d",
      "title": "YouTube’s multi-language audio feature for dubbing videos rolls out to all creators",
      "url": "https://techcrunch.com/2025/09/10/youtubes-multi-language-audio-feature-for-dubbing-videos-rolls-out-to-all-creators/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:58:32.000Z",
      "summary_90w": "",
      "raw": "YouTube's multi-language audio feature is rolling out to millions of creators, helping them reach a wider global audience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e166c2bf37ff6c2640791480899fcdab0c6a77a1",
      "title": "New French PM Sébastien Lecornu promises ‘profound break’ with past politics",
      "url": "https://www.theguardian.com/world/2025/sep/10/new-french-pm-sebastien-lecornu-promises-profound-break-with-past-politics",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T17:49:11.000Z",
      "summary_90w": "",
      "raw": "Lecornu, 39, faces difficult task of gaining enough support from divided parliament to pass a budget\nThe new French prime minister, Sébastien Lecornu, has promised a “profound break” with past politics as he took over from the unpopular centrist François Bayrou, who was ousted this week over a proposed budget squeeze.\nLecornu, 39, who said “humility” was the key approach, now faces the difficult task of gaining enough support from France’s divided parliament to pass a budget if he is to avoid being swiftly ousted in the same way as Bayrou, and before him, the rightwing Michel Barnier, who only lasted three months.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7aaa438c51bbedb99211b556db59356aa36effe5",
      "title": "TechCrunch Disrupt 2025: Full agenda reveal for the brand-new Going Public Stage",
      "url": "https://techcrunch.com/2025/09/10/techcrunch-disrupt-2025-first-full-agenda-reveal-for-the-brand-new-going-public-stage/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:45:35.000Z",
      "summary_90w": "",
      "raw": "We recently unveiled the Going Public Stage at TechCrunch Disrupt 2025 — a new destination for founders navigating the complexities of company building, from early traction to IPO and beyond.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dc85351c3c39cf943d49f5c84a81a2a6cfb67976",
      "title": "PlayStation launches new app for parental controls",
      "url": "https://www.theverge.com/news/775918/playstation-family-parental-controls-ios-android-app",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:43:34.000Z",
      "summary_90w": "",
      "raw": "PlayStation is launching a new PlayStation Family app for iOS and Android to help parents manage their child’s playtime on PS5 and PS4. Parents can already set parental control features directly on a console, but this app gives parents another way to set limits and keep track of what their kid is playing.\n“The app includes a number of new customizable features for parents to manage their children’s playtime, including an activity report, more visibility into what their children are playing, and approving extra playtime requests,” according to a blog post. The app also has an onboarding experience to help parents set up a child account, lets parents manage a child’s spending on the PlayStation Store, and gives parents the ability to customize privacy settings for their children.\n\nNintendo and Microsoft also offer dedicated parental control apps for iOS and Android that lets parents manage playtime on the Nintendo Switch and Xbox.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e6823579d8dfe3f3e01dc8667e99f54f699d3e9",
      "title": "Arc gets its first major order for electric tugboats worth $160M",
      "url": "https://techcrunch.com/2025/09/10/arc-gets-its-first-major-order-for-electric-tugboats-worth-160m/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:43:09.000Z",
      "summary_90w": "",
      "raw": "It's a big step in the company's ambitous plan to electrify all watercraft.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c9df4697bccd46604cbd7f2c0bdb46c61486132",
      "title": "‘My first barricade’: French protests unite teachers, gilets jaunes and students",
      "url": "https://www.theguardian.com/world/2025/sep/10/my-first-barricade-latest-french-protests-unite-people-from-variety-of-backgrounds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T17:41:20.000Z",
      "summary_90w": "",
      "raw": "Thousands join Block Everything rallies across France to express anger at government and austerity\nAt 7am on the eastern edge of the busy Paris ring road at Montreuil, Jess, a 35-year-old hospital neurologist, had joined protesters attempting to stop traffic in order to show her anger at the French government.\n“Inequality is rife in France and this is the only way to be heard,” she said. Pushed back with teargas by riot police, Jess, who asked for her real name not to be published, said she was scared by police tactics but felt it was crucial to be on the streets.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6e57cb3624f608d238fe884380cd09a438d7f94",
      "title": "Bluesky brings age verification to South Dakota and Wyoming",
      "url": "https://www.theverge.com/news/775901/bluesky-age-verification-us-south-dakota-wyoming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:40:36.000Z",
      "summary_90w": "",
      "raw": "Bluesky will now check the ages of users located in South Dakota and Wyoming to comply with local online safety laws. The platform announced on Wednesday that users in both states will be able to prove their age using an ID, payment card, or other method.\nJust like Bluesky’s age verification launch in the UK, the social network will process age checks through Epic Games’ Kids Web Services (KWS), a tool that allows developers to integrate age verification and parental controls within their platforms.\nBoth South Dakota and Wyoming pushed ahead with their online safety laws after a Supreme Court ruling upheld a Texas law requiring age verification for porn sites. While many states only apply online safety laws to adult websites or platforms containing a certain threshold of harmful content, 404 Media points out that South Dakota and Wyoming’s laws don’t include this carveout. That means they could affect a much broader swatch of online platforms, including Reddit, X, and Discord, according to the Electronic Frontier Foundation.\nLast month, Bluesky and Mastodon stopped operating in Mississippi after the Supreme Court refused to block a “likely unconstitutional” law that forces platforms to verify the ages of users when they create an account. Bluesky said the law “would block everyone from accessing the site — teens and adults — unless they hand over sensitive information.”\nJust like in the UK, Bluesky spokesperson Elisabeth Diana confirmed to The Verge that the platform will restrict unverified and underage users in South Dakota and Wyoming from accessing adult content, as well as from using certain features, like direct messaging.\nUpdate, September 10th: Added information about the age verification process.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30f5344cf1a38cacd76c15aef6c8fd07e834127a",
      "title": "Windows developers can now publish apps to Microsoft’s store without fees",
      "url": "https://www.theverge.com/news/775877/windows-developers-microsoft-store-publishing-free",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:38:54.000Z",
      "summary_90w": "",
      "raw": "Microsoft is allowing developers to submit apps to its Windows store without having to pay any onboarding fees. Individual developers in nearly 200 countries can now sign up to publish apps on the Microsoft Store with just a personal Microsoft account, and no more one-time fees.\nMicrosoft started cutting its $19 one-time fee to publish apps to its Windows store in June in certain markets, and it’s now essentially removing this fee for all developers worldwide. Apple still charges an annual $99 fee to developers, and Google charges a one-time registration fee of $25. \n“Developers will no longer need a credit card to get started, removing a key point of friction that has affected many creators around the world,” explains Chetna Das, senior product manager at Microsoft. “By eliminating these one-time fees, Microsoft is creating a more inclusive and accessible platform that empowers more developers to innovate, share and thrive on the Windows ecosystem.”\nMicrosoft has been gradually upgrading its Windows store over the past few years, with standalone installers, an updated web version, and improvements to the user experience of downloading and installing apps. The Microsoft Store is now used by more than 250 million monthly active users, according to Microsoft.\nMicrosoft is now encouraging more developers to make use of the store, where they can publish a variety of Win32, UWP, PWA, .NET, MAUI, or Electron apps. Developers can even use their own in-app commerce system to keep 100 percent of their revenues on non-gaming apps.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5808d2c2569fd1dea340c0064521b16d9e33f6a2",
      "title": "Meta adds new features to Community Notes fact checks, including alerts for corrected posts",
      "url": "https://techcrunch.com/2025/09/10/meta-adds-new-features-to-community-notes-fact-checks-including-alerts-for-corrected-posts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:33:21.000Z",
      "summary_90w": "",
      "raw": "Now, users will be notified when they've interacted with a post on Facebook, Instagram, or Threads that receives a Community Note. Plus, anyone can now request a note or rate a note if it's been helpful to them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb590e000c72cbcdece0df51b42e5bff971cd5e6",
      "title": "Anthropic reports outages, Claude and Console impacted",
      "url": "https://techcrunch.com/2025/09/10/anthropic-reports-outages-claude-and-console-impacted/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:33:05.000Z",
      "summary_90w": "",
      "raw": "Anthropic reported a service outage impacting APIs, Console, and Claude earlier this afternoon.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b753a18ef96ba35248cb24f3ad10769eac3fc264",
      "title": "Sony rolls out new ‘PlayStation Family’ parental controls app",
      "url": "https://techcrunch.com/2025/09/10/sony-rolls-out-new-playstation-family-parental-controls-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:20:04.000Z",
      "summary_90w": "",
      "raw": "While Sony has long offered parental controls, the new app brings all of these tools into one dedicated place for easier access.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9fcb080251f1314b7294cb277b6249eaf59dbdb7",
      "title": "An election law expert weighs in on Trump's effort to reshape our democracy",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5536528/an-election-law-expert-weighs-in-on-trumps-effort-to-reshape-our-democracy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T17:01:03.000Z",
      "summary_90w": "",
      "raw": "Before 2026's midterms, President Trump wants to ban mail-in ballots and electronic voting machines, and change voting rules. Legal expert Richard Hasen discusses the future of free and fair elections.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23841b31c181359fada861e70c5d0819b46f8414",
      "title": "Humanoids, AVs, and what’s next in AI hardware at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/10/humanoids-avs-and-whats-next-in-ai-hardware-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:00:00.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 hits Moscone West in San Francisco from October 27 to 29, bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "168331069449903a4d7e5dc063cdcec4f5999bbe",
      "title": "Replit hits $3B valuation on $150 million annualized revenue",
      "url": "https://techcrunch.com/2025/09/10/replit-hits-3b-valuation-on-150-million-annualized-revenue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T16:54:48.000Z",
      "summary_90w": "",
      "raw": "Replit's annualized revenue has skyrocketed from $2.8 million to $150 million in less than a year, it said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f941aa6a42dc26e2886df058363f237cb352f6c",
      "title": "Israeli military kills at least 41 people as it continues to order evacuation of Gaza City",
      "url": "https://www.theguardian.com/world/2025/sep/10/israeli-military-kills-at-least-people-as-it-continues-to-order-evacuation-of-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:45:26.000Z",
      "summary_90w": "",
      "raw": "Many of 1 million residents say they will not leave as they do not believe al-Mawasi humanitarian zone is safe\nThe Israeli military has killed at least 41 people in Gaza, including 12 aid seekers, over the last 24 hours as it continued to order the population of Gaza City to evacuate before its planned offensive.\nThe evacuation orders were accompanied by intensified Israeli bombing of the city, the Israeli military interspersing orders with announcements of high-rise towers they had bombed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8b780f9b4c8d96d7c2cf50af863d5c134af51842",
      "title": "Trump makes a rare D.C. restaurant visit to tout his federal crackdown on crime",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5536570/trump-dc-restaurant-protests-joes-seafood",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T16:37:37.000Z",
      "summary_90w": "",
      "raw": "In his first term, President Trump only dined out at the steakhouse in his former hotel. He visited a steakhouse near the White House on Tuesday, saying, \"I wouldn't have done this three months ago.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac80bff6ea922455776c4e7a955e3e1fad7529fd",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "url": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:34:14.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Thousands of film workers join new boycott initiative criticized by Israeli producers’ group as ‘misguided’\nThousands of actors, directors and other film industry professionals have signed a new pledge vowing not to work with Israeli film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.\n“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” the pledge reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb68248c92c9258dd49995548514f71d695fcd25",
      "title": "Footage shows second claimed attack on Greta Thunberg Gaza flotilla",
      "url": "https://www.bbc.com/news/videos/cyv64eppj56o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T16:33:01.000Z",
      "summary_90w": "",
      "raw": "BBC Verify analyses footage of the suspected drone attacks and images of a device found after the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb68248c92c9258dd49995548514f71d695fcd25",
      "title": "Watch: Footage shows second claimed attack on Greta Thunberg Gaza flotilla",
      "url": "https://www.bbc.com/news/videos/cyv64eppj56o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:33:01.000Z",
      "summary_90w": "",
      "raw": "BBC Verify analyses footage of the suspected drone attacks and images of a device found after the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74ef81755aaea69195c7ae90890ff5d3e9b7b473",
      "title": "No 10 files raise questions over whether Tory donations were legal",
      "url": "https://www.bbc.com/news/articles/cp3qww29146o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:32:09.000Z",
      "summary_90w": "",
      "raw": "A foreign billionaire who met then-PM Boris Johnson at Downing Street was described in an official log as a \"donor\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae06b5148592ea1fb379588d750f8d85b8fbb500",
      "title": "'I didn't know I could ask for help': Bruce Willis's wife on caring for Hollywood actor",
      "url": "https://www.bbc.com/news/videos/cp8j2v458z8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:31:23.000Z",
      "summary_90w": "",
      "raw": "The actor, well known for his roles in the Die Hard franchise, was diagnosed with frontotemporal dementia, a condition his family publicly disclosed in 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae06b5148592ea1fb379588d750f8d85b8fbb500",
      "title": "Emma Heming Willis talks about husband Bruce's diagnosis and care",
      "url": "https://www.bbc.com/news/videos/cp8j2v458z8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T16:31:23.000Z",
      "summary_90w": "",
      "raw": "The actor, well known for his roles in the Die Hard franchise, was diagnosed with frontotemporal dementia, a condition his family publicly disclosed in 2023.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0f76ad215c1560219d8cc3921d269f7ef3a8809e",
      "title": "Cuba hit with fifth blackout in less than a year with 10m people in the dark",
      "url": "https://www.theguardian.com/world/2025/sep/10/cuba-electricity-power-blackout",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:28:09.000Z",
      "summary_90w": "",
      "raw": "Grid failure follows string of nationwide blackouts that plunged antiquated power system into near-total disarray\nEmergency crews were working to restore power to 10 million people on Wednesday as Cuba suffered its fifth nationwide blackout in under a year, the energy ministry announced.\n“There has been a total disconnection of the electric system,” the energy ministry and National Electric Union said early on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e33163f88b726341f7665fb60df09f51a9edec9",
      "title": "Nepal protests 'hijacked', Gen Z claim, as army patrols the streets",
      "url": "https://www.bbc.com/news/articles/cjd1ndmrej0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T16:15:28.000Z",
      "summary_90w": "",
      "raw": "Fierce protests against corruption and nepotism spiralled into arson and violence on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32ed87d8575a6e90fb892d17fe0bf939da4ac35f",
      "title": "Bluesky will comply with age-verification laws in South Dakota and Wyoming after exiting Mississippi",
      "url": "https://techcrunch.com/2025/09/10/bluesky-will-comply-with-age-verification-laws-in-south-dakota-and-wyoming-after-exiting-mississippi/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T16:12:14.000Z",
      "summary_90w": "",
      "raw": "Bluesky says the age-verification laws strike \"the right balance,\" so it won't have to exit the states as it did in Mississippi.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e18ebc844f64fa5414cf4ff3eb32f4455ad51e50",
      "title": "Fired FBI agents allege retribution, incompetence at top security agency",
      "url": "https://www.npr.org/2025/09/10/g-s1-87947/fbi-lawsuit-firing-retribution",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T16:03:09.000Z",
      "summary_90w": "",
      "raw": "The lawsuit from three senior and lauded FBI agents at the bureau says Trump administration demanded loyalty for those staying at the bureau.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47038f3a69f345b1ea3d6609fae7228ea666028f",
      "title": "Perfect your pitch: Investors share what really makes founders stand out at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/10/at-techcrunch-disrupt-2025-medha-agarwal-jyoti-bansal-and-jennifer-neundorfer-discuss-what-makes-a-pitch-land/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T16:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes a startup pitch stand out? At TechCrunch Disrupt 2025, October 27–29 in San Francisco, hear candid insights from Defy.vc’s Medha Agarwal, Harness CEO Jyoti Bansal, and January Ventures’ Jennifer Neundorfer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9fdcf43bd41e1462082cf51354af827b1fd0ebe6",
      "title": "Trump asks EU to impose tariffs of up to 100% on India and China",
      "url": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:59:45.000Z",
      "summary_90w": "",
      "raw": "In effort to end Russia’s war in Ukraine, US president proposes tariffs targeting Putin allies and trade partners\n\nBusiness live – latest updates\n\nEurope live – latest updates\n\nDonald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine.\nThe US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to a White House official.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a7816b715abea9b64511b5fbd8fa4350323f846d",
      "title": "Harris calls Biden's re-election bid reckless in new memoir",
      "url": "https://www.bbc.com/news/articles/cq5jgg1491do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:48:57.000Z",
      "summary_90w": "",
      "raw": "In her forthcoming memoir 107 Days, the former vice-president says it was reckless to let Biden make a re-election decision on his own.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f86e6bb1ea95fa0fe5e834a54f759950062e3f3",
      "title": "All of the iPhone 17 models compared",
      "url": "https://techcrunch.com/2025/09/10/all-of-the-iphone-17-models-compared/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T15:40:55.000Z",
      "summary_90w": "",
      "raw": "All four of the devices will be available to preorder on Friday and will be available on September 19.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4fd76b83c01aa4823edba66f9883959b72c9b5fd",
      "title": "Weleda investigates claims cream was tested on Nazi camp prisoners",
      "url": "https://www.bbc.com/news/articles/cy7pgd5nkr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:28:52.000Z",
      "summary_90w": "",
      "raw": "A new study alleges the skincare brand's product was used for human experiments by a Nazi doctor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fd76b83c01aa4823edba66f9883959b72c9b5fd",
      "title": "Weleda launches inquiry into Nazi camp skin test claims",
      "url": "https://www.bbc.com/news/articles/cy7pgd5nkr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T15:28:52.000Z",
      "summary_90w": "",
      "raw": "A new study alleges the skincare brand's product was used for human experiments by a Nazi doctor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b99a0852951b8286dd342eb5e3b963db0daa2cc",
      "title": "Reddit launches tools for publisher to track and share stories",
      "url": "https://techcrunch.com/2025/09/10/reddit-launches-tools-for-publisher-to-track-and-share-stories/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T15:17:06.000Z",
      "summary_90w": "",
      "raw": "These tools include article insights to see where stories have been shared and stats related to them, including views, upvotes, and clicks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "081a8f198a4278d360d26539e173d4f931377890",
      "title": "Teacher who hid with child from Southport killer feels 'crushing guilt'",
      "url": "https://www.bbc.com/news/articles/ckg3xnv1lq2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:01:05.000Z",
      "summary_90w": "",
      "raw": "Speaking publicly for the first time, dance teacher Heidi Liddle says she feels \"crushing guilt\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e333ed904760056e7117cb7b7803fdd999380f1",
      "title": "Life on Mars? 'Leopard-spot' rocks could be biggest clue yet",
      "url": "https://www.bbc.com/news/articles/cd725pj0g9ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:00:16.000Z",
      "summary_90w": "",
      "raw": "Unusual mudstones found on the Red Planet are potentially associated with ancient Martian microbes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0936eaa4ad7c06954a034a45fc5f80e02b54be67",
      "title": "Natural disasters forecast to cost Australia’s young people $100bn by 2060",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/natural-disasters-forecast-cost-australia-young-people-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:00:11.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Unicef-commissioned report shows being unable to finish high school – and the associated wage loss – is the most significant impact of increasingly frequent disasters on young people\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nKangaroo Valley was hit by raging fires and floods three times in three years.\nIn 2019, the black summer bushfires had forced Layla Wang’s family to flee their home. Then in 2022, after floods and landslides isolated the valley, she was trapped there, spending several “stressful” weeks isolated from school – in the middle of year 12, with no access to her classes and limited resources.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a526d1ea4edad82ca87f2bfe880a429882fd6086",
      "title": "Some of Australia’s biggest thinktanks refuse to reveal their biggest donors. Should they?",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/australia-influential-thinktanks-transparency-refuse-to-reveal-their-biggest-donors-financial-backers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:00:11.000Z",
      "summary_90w": "",
      "raw": "Several raise concerns that disclosing their donors exposes them to political attack but others warn not doing so can prompt legitimate questions about influence\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s biggest thinktanks are deeply divided on whether disclosing their financial backers is in the public interest, with several raising concerns that efforts to keep them secret may be undermining trust in the sector.\nThree influential policy groups that together receive almost $20m in donations a year refuse to reveal their key donors, including those whose commercial interests may overlap with their public advocacy campaigns.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2770069e4745ed4a0afc057a2267674de549b400",
      "title": "Tim Wilson has a long-held bet against Australia’s sharemarket – it has now lost him ‘quite a bit’ of money",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/tim-wilson-liberal-mp-etf-investment-bet-against-australia-sharemarket-lost-money",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:00:11.000Z",
      "summary_90w": "",
      "raw": "The Liberal MP bought the product, which profits when the ASX 200 falls, in early 2020, his register of interests shows, but an analysis and experts say it has been a poor investment\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nTim Wilson has a long-held bet against the national sharemarket.\nThe Liberal MP’s register of interests, disclosed in August after his tight victory for the seat of Goldstein at the federal election, shows Wilson has a leveraged investment that profits when the benchmark ASX 200 falls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7084d1b94e73758f1c8e13e9177ddae1441ceda4",
      "title": "Exploring the future of voice AI with Mati Staniszewski at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/10/exploring-the-future-of-voice-ai-with-mati-staniszewski-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T15:00:00.000Z",
      "summary_90w": "",
      "raw": "From audiobooks and dubbing to gaming and avatars, AI-generated voice is breaking into the mainstream — and Mati Staniszewski, CEO and co-founder of ElevenLabs, is helping lead the charge. At TechCrunch Disrupt 2025, he’ll take the stage to talk about what it takes to make voice AI truly human.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bfad7997234b2eb147230a7bfcca6f5ad4636b81",
      "title": "Dutch battery startup LeydenJar’s silicon anode tech could pose a challenge to China",
      "url": "https://techcrunch.com/2025/09/10/dutch-battery-startup-leydenjars-silicon-anode-tech-could-pose-a-challenge-to-china/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T14:56:55.000Z",
      "summary_90w": "",
      "raw": "LeydenJar raised €13 million along with €10 million from a U.S. consumer electronics company to scale production of its silicon anode material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ed193062af23e3ec14d5390608fbc31d7e541743",
      "title": "California considers allowing doctors to prescribe abortion drugs anonymously",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/10/nx-s1-5535877/california-shield-law-abortion-prescription-label",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T14:37:41.000Z",
      "summary_90w": "",
      "raw": "If passed, the law would protect doctors from legal risk by letting them omit their names from prescription labels for abortion pills. It would affect the many doctors who use California pharmacies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32cadb347ba7c34db799d556e8650ad6c729676c",
      "title": "After selling to Spotify, Anchor’s co-founders are back with Oboe, an AI-powered app for learning",
      "url": "https://techcrunch.com/2025/09/10/after-selling-to-spotify-anchors-co-founders-are-back-with-oboe-an-ai-powered-app-for-learning/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T14:27:55.000Z",
      "summary_90w": "",
      "raw": "Oboe is a new AI-powered learning platform that lets you create personalized courses on any topic with a prompt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "92e464b21e2c0889fc3a1ff771ae525e9a32a945",
      "title": "'I thought the world was going to end', Qatar strikes witness tells BBC",
      "url": "https://www.bbc.com/news/articles/cz9jeg7zv8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T14:06:03.000Z",
      "summary_90w": "",
      "raw": "Qatar's capital, Doha, is back to normal today, but there are new tensions across the Middle East.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db62ec71ad5bf351e04a1acac3d2a4cf8c8d7221",
      "title": "Israel is forcing us to leave Gaza City. We know they may never let us return",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-is-forcing-us-to-leave-gaza-city-we-know-they-might-never-let-us-return",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T13:57:08.000Z",
      "summary_90w": "",
      "raw": "The Guardian’s reporter in Gaza describes the dilemma facing her family and others, many hungry, penniless and without transport\nThe ninth of September is my sister Enas’s birthday, so we were happy this morning, drinking coffee as a family and telling jokes, until we saw the leaflets dropping down telling us to evacuate. So now, instead of preparing biscuits and cakes to celebrate, we are packing for another displacement.\nThe Israeli army’s plan to occupy Gaza City sent me back to memories of the early days of the war: the tension, the terror and the psychological pressure. I am afraid the cycle of displacement will repeat itself again.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b8f60069271615ef64737a70891308efce67271",
      "title": "Greetings from a peaceful woodland near the River Thames west of London",
      "url": "https://www.npr.org/2025/09/10/g-s1-87866/england-thames-woodland-london",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T13:38:26.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7b70e8456a1017fae26d04b586fb5d56937d0a0",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:56:42.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice\nA court in South Korea has acquitted a woman convicted six decades ago for biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.\nChoi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae. He pinned her to the ground and repeatedly forced his tongue into her mouth, at one point blocking her nose to stop her from breathing, according to court records.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fb309309a9468af62804db8cba280746e0ba862",
      "title": "Jihadists 'summarily executed' 127 people in Niger, says rights group  ",
      "url": "https://www.bbc.com/news/articles/c4gkx78xeg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:29:01.000Z",
      "summary_90w": "",
      "raw": "Worshippers have been gunned down in mosques and homes have been torched in escalating violence, Human Rights Watch says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09dc1a17ec670bfdc1ac04057e487bb29a122b12",
      "title": "Chinese nationals jailed for human trafficking in South Africa",
      "url": "https://www.bbc.com/news/articles/c20v3n7wllzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:18:13.000Z",
      "summary_90w": "",
      "raw": "A raid on a Johannesburg factory found 91 Malawians, including 37 children, living in appalling conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d15d9a5891ad997b6c2babf039c4a54231edf42b",
      "title": "By listening to these birds for decades, scientists track signs of a changing forest",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535788/songbirds-experimental-forest-change-new-hampshire",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T12:09:53.000Z",
      "summary_90w": "",
      "raw": "Scientists tracking the birds in an experimental forest in New Hampshire have also tracked changes in the forest ecosystem over decades.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5442a524c38cdfcaa396e60d2c4a53b31b783ce1",
      "title": "Protests hit France as new PM takes office",
      "url": "https://www.bbc.com/news/articles/c8643qg252lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:01:20.000Z",
      "summary_90w": "",
      "raw": "A grassroots movement is encouraging people to protest against the political class and proposed budget cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef0cd82f539a356143e316ff5c05a92b60e6b42f",
      "title": "Shock as Kenyan lawyer killed in drive-by shooting in Nairobi",
      "url": "https://www.bbc.com/news/articles/c20v34qpr98o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T11:36:34.000Z",
      "summary_90w": "",
      "raw": "Kyalo Mbobu was driving home when a gunman on a motorbike shot him dead on a busy street in the capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd272ba7260163fc20d79d00929d20250c493ce8",
      "title": "Childhood obesity: The South African campaigners fighting for healthy food",
      "url": "https://www.bbc.com/news/articles/ce84n6zpxx9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T11:35:03.000Z",
      "summary_90w": "",
      "raw": "The UN says the number of obese teenagers has nearly tripled globally in the last two decades.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a394d24cbb37857d0e4d7c062802add69609198c",
      "title": "Trump is used to shaking off criticism - but the Epstein story is different",
      "url": "https://www.bbc.com/news/articles/cp8j3e5g74no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T11:33:53.000Z",
      "summary_90w": "",
      "raw": "While there is no suggestion of criminal wrongdoing by Trump, the political consequences of the Epstein saga on the US president are very real",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03c730fbc3c7289d1769090ae65ac6a18d0f9cc7",
      "title": "Dr. Peter Hotez takes the war against science very personally",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/10/g-s1-87614/dr-peter-hotez-science-rfk-jr",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T11:18:41.000Z",
      "summary_90w": "",
      "raw": "In an interview about the new book he co-authored, Science Under Siege, Hotez talks about forces driving the anti-science movement, the risks it poses — and why he won't debate RFK Jr.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drones, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:43:54.000Z",
      "summary_90w": "",
      "raw": "Organisers said two boats were hit in separate incidents; Tunisian authorities disputed the first and have not commented yet on the second.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3342c14e145cfb08b793be98d54fe88805dfa992",
      "title": "Hong Kong lawmakers say no to more rights for same-sex couples",
      "url": "https://www.bbc.com/news/articles/c5yqeggvwgpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:34:10.000Z",
      "summary_90w": "",
      "raw": "The law would have recognised some rights for couples who were married overseas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33bc623fa4b98469ed6d7eeb3ca66f79faa83a4e",
      "title": "Watch: Army patrols streets of Kathmandu after fierce protests",
      "url": "https://www.bbc.com/news/videos/cyv647g63gvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:32:09.000Z",
      "summary_90w": "",
      "raw": "Charlotte Scarr reports from the Kathmandu where deadly protests against corruption and nepotism took place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef95c7eba627dce8e41fef5eb513669ce3ed052e",
      "title": "James McAvoy reportedly assaulted  in Toronto bar",
      "url": "https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:12:49.000Z",
      "summary_90w": "",
      "raw": "Actor promoting his directorial debut California Schemin’ at the city’s film festival is reported to have been punched by another drinker\nThe actor James McAvoy was assaulted in a bar in Toronto, it has been reported.\nAccording to People magazine, McAvoy was “sucker punched” by another visitor to Charlotte’s Room bar on Monday evening, two days after the premiere of his directorial debut, California Schemin’, at the Toronto film festival.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "742180f7cb3a46027c5faf7ad8cc6b49e713d3e4",
      "title": "The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/jacinta-nampijinpa-price-sussan-ley-indian-migration-comments-repercussions-for-coalition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T09:51:57.000Z",
      "summary_90w": "",
      "raw": "Price’s refusal to endorse Sussan Ley’s leadership on Wednesday was a deliberate provocation that left the opposition leader no choice\n\nReport: Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nFor much of her short career in Canberra, the usual rules of political gravity have appeared not to apply to Jacinta Nampijinpa Price.\nA firebrand, outspoken and unapologetic about almost everything, she went from a first-term backbencher from the Northern Territory to a member of the shadow cabinet in less than a term. Easily the most prominent opponent of the Indigenous voice to parliament, Price used the referendum campaign to build her political brand exponentially.\nTom McIlroy is Guardian Australia’s chief political correspondent\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5f7bd78ca39fa302ac879fc431ad2a1235ae06",
      "title": "Who is Lachlan Murdoch, the anointed media tycoon?",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535569/lachlan-murdoch-rupert-news-corp-fox",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T09:01:00.000Z",
      "summary_90w": "",
      "raw": "His position in leading News Corp. and Fox is now secure, as his father ends a dramatic succession battle. Lachlan grew up in New York City but has lived in Australia for much of his adult life.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ca54d46f94d5dbc1392b82407ff727cdfbd54523",
      "title": "Woman who bit off attacker's tongue acquitted after 61 years",
      "url": "https://www.bbc.com/news/articles/ckgezkrdjeko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T06:53:33.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja only managed to break free after biting off about 1.5cm of her alleged attacker's tongue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T04:49:54.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7314c5d1c78502f4efe20b8d90ba421798102985",
      "title": "Federal judge blocks Trump from firing Fed Governor Lisa Cook, for now",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5529281/appeals-court-lisa-cook-federal-reserve-independence-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T03:29:38.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve Governor Lisa Cook won a round in federal court in her bid to keep her job despite President Trump's effort to fire her.  On Wednesday, the Justice Department said Trump would appeal.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6f917466683095255dab3a4e1782a394f7c187e9",
      "title": "Discovery of new campsite shows fugitive Tom Phillips had ‘outside help,’ NZ police say",
      "url": "https://www.theguardian.com/world/2025/sep/10/tom-phillips-new-zealand-man-fugitive-father-outside-help-nz-police-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T02:57:50.000Z",
      "summary_90w": "",
      "raw": "Phillips had spent nearly four years hiding in the wilderness with his three children before he was killed in an exchange of fire with police on Monday\nFugitive father Tom Phillips was receiving outside help during his years on the run before he was killed in a police shoot-out this week, New Zealand police said on Wednesday as they released images that show a newly discovered campsite.\nPhillips had spent nearly four years hiding in the wilderness with his three children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio, in the central North Island, on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c8806bc79f439f27ac2774b287d7319b8a569d12",
      "title": "Hamas claims leadership survived Israeli attack in Doha, but confirms six deaths",
      "url": "https://www.bbc.com/news/articles/ced58zywdwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T02:06:16.000Z",
      "summary_90w": "",
      "raw": "Meanwhile, the White House says the Israeli strike \"does not advance Israel or America's goals\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Nepal anti-corruption protests explained",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T01:38:31.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned  deadly after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf4a56d44ef7fdeb4cd2eccd77400c36a6c59d82",
      "title": "First two Brazilian judges vote to convict Jair Bolsonaro in coup plot trial",
      "url": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T21:30:45.000Z",
      "summary_90w": "",
      "raw": "Three more supreme court justices to cast their votes in coming days, with verdict expected by Thursday\n\n‘He’s always on the attack’: the Brazilian judge prosecuting Bolsonaro inspires both love and hate\n\nJair Bolsonaro led a criminal organisation that sought to plunge Brazil back into dictatorship with a murderous power grab involving special forces assassins and a vast disinformation campaign, the supreme court judge presiding over the former president’s trial has claimed as he voted for Bolsonaro’s conviction.\nAlexandre de Moraes was the first supreme court justice of five to announce his decision on Tuesday, as the trial of Bolsonaro and seven alleged co-conspirators – including four senior members of the military and the former head of Brazil’s answer to MI6 – entered its final stretch.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af0bd3238973b03e67bcd48cf2d3be2573adb540",
      "title": "Pressure mounts on Bolsonaro as two out of five judges find him guilty",
      "url": "https://www.bbc.com/news/articles/ceq2lv20rp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:54:49.000Z",
      "summary_90w": "",
      "raw": "The Brazilian ex-president is accused of plotting a coup to cling to power, which he denies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "147efeea67aea93f276f37a14b2d4fea1b8c886f",
      "title": "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535813/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:47:28.000Z",
      "summary_90w": "",
      "raw": "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4594d1aba0cfe8215d7c138089f20cd34937c619",
      "title": "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535806/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:43:10.000Z",
      "summary_90w": "",
      "raw": "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e91d45d92e13eeac88ffa27aa92e3fb153140722",
      "title": "Russian air strikes get deadlier and bigger, hitting Ukraine's very heart",
      "url": "https://www.bbc.com/news/articles/cgrqwpee05ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:20:36.000Z",
      "summary_90w": "",
      "raw": "Ukraine says Russia deliberately hit the main government building in Kyiv with a missile last Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab57dffe2f1e167f72af1643fea1f785c951095c",
      "title": "Bowen: Diplomacy in ruins after Israel strikes Hamas leaders in Qatar",
      "url": "https://www.bbc.com/news/articles/cm2zepgp5neo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T19:06:52.000Z",
      "summary_90w": "",
      "raw": "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What's in the book of birthday messages to Epstein",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T18:08:42.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e8da303c0ae690bcabf79ae59862e52da45f4e2",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "url": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:45:02.000Z",
      "summary_90w": "",
      "raw": "Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged\nA Canadian beekeeper has described fending off thousands of “robber bees” as they raided her shop in a brazen attempt to steal honey.\nChristine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07b34831be5e4cb07a32f4935262aa84c1d532e",
      "title": "A government building struck in Kyiv and a new threat from Trump",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1srdr?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:39:00.000Z",
      "summary_90w": "",
      "raw": "Trump says he'll respond after Ukraine's main cabinet building was hit",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23860b3f9f961d5b7f8a07f1a387073adbdf2088",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "url": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:19:28.000Z",
      "summary_90w": "",
      "raw": "Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts\nEthiopia has inaugurated Africa’s largest hydroelectric dam, a project that could transform the country’s energy sector but may also aggravate tensions with neighbouring Egypt.\nState media showed the Ethiopian prime minister, Abiy Ahmed, touring the site of the Grand Ethiopian Renaissance Dam (GERD) in Guba district with the Kenyan president, William Ruto, the Somali president, Hassan Sheikh Mohamud, and the African Union chairperson, Mahmoud Ali Youssouf.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b6c653830a09a7b83e60d235b433366ef9d4cb9",
      "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
      "url": "https://www.bbc.com/news/articles/cr4qx6377qgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T15:33:01.000Z",
      "summary_90w": "",
      "raw": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b7bbe56c335a5284801381e0fb0268841ce0acb",
      "title": "'The Office' creators deliver 'The Paper,' a sharp mockumentary about journalism",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535137/the-office-creators-deliver-the-paper-a-sharp-mockumentary-about-journalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:54:18.000Z",
      "summary_90w": "",
      "raw": "The issues facing journalism these days — from online clickbait to corporate interference — run throughout The Paper. But it's primarily a comedy, with characters and actors that will win you over.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows annual hiring was overstated by 911,000 jobs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dca2ecd0afbc054bf1d12216cba5a31ed1155838",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "url": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:16:54.000Z",
      "summary_90w": "",
      "raw": "ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery\nAn international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.\nThe ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.\nReuters and Agence France-Presse contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1097d90ff1d8a06a7f69bf485cef26b33abb0a4a",
      "title": "Here's what happens when private equity buys homes in your neighborhood",
      "url": "https://www.npr.org/sections/planet-money/2025/09/09/g-s1-87699/private-equity-corporate-landlords",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T11:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes rents go down and neighborhood diversity go up? Corporate landlords. But they also make it harder to own for yourself.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "Why the French PM had to go and what happens next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T17:18:52.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has lost a confidence vote, sending parliament into another period of chaos and uncertainty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03b8fd0252e81ca33e69e04c5abb9c6184e01504",
      "title": "Protein: how much do we really need?",
      "url": "https://www.bbc.co.uk/sounds/play/m001xzrx?at_mid=JAhdrOsaPb&at_campaign=Protein_Powerhouse_or_Piffle&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=m001xzrx&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Protein_Powerhouse_or_Piffle&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2024-03-27T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Protein is having a moment in the spotlight. Should you be worried about getting enough?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "718896b0758d6c64e59ebada083240771ee61c61",
      "title": "Barry Humphries' funniest, rudest and most revealing moments",
      "url": "https://www.bbc.co.uk/iplayer/episode/m001mg0t/barry-humphries-at-the-bbc?at_mid=0YPJFFVFb6&at_campaign=Barry_Humphries_at_the_BBC&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m001mg0t&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Barry_Humphries_at_the_BBC&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2023-05-28T21:02:25.000Z",
      "summary_90w": "",
      "raw": "Alex Jones looks back at the highlights of Barry’s career on a selection of BBC shows.",
      "topics": [
        "World"
      ]
    }
  ]
}