{
  "version": "1757951521876",
  "generatedAt": "2025-09-15T15:52:01.876Z",
  "items": [
    {
      "id": "00bca9816f6e87321c9e55f19ecd80390b732898",
      "title": "Spotify&#8217;s free users can finally play the songs they want",
      "url": "https://www.theverge.com/news/778176/spotify-free-user-upgrade-play-specific-songs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T15:47:00.000Z",
      "summary_90w": "",
      "raw": "Spotify has removed restrictions that prevented free users from listening to specific tracks. With Lossless audio now finally rolling out to paying subscribers, the music streaming service has announced that it’s also allowing non-paying listeners to search, play, and share any song they want, without having to upgrade to a Premium subscription.\nThe update is being rolled out globally and addresses one of the most annoying limitations of Spotify’s shuffle-only free experience. Instead of playing the specific song a free user had searched for or selected in an album or playlist, Spotify would previously launch tracks in a randomized order that forced users to skip songs until they reached the one they actually wanted to play, with skips limited to six per hour.\nNow, non-paying users can “pick and play any song you want,” according to Spotify. There are still some restrictions in place, however, with CNET reporting that free users can only listen to one song before the app starts shuffling, and an undisclosed limit on how many on-demand minutes a user has per day, according to Music Business Worldwide. We’ve reached out to Spotify for comment and will update if the company responds.\nThe free experience will also still include ads, but this update gives free listeners fewer reasons to use rival streaming services like YouTube when they want to play a specific song without dancing around shuffle-skipping requirements. This also helps Spotify’s desire to get users sharing music links online, given that non-paying users previously couldn’t immediately play songs that friends had shared on social media platforms.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "eee8d8b260d1c9436cb4fb0ee2c196cca114add9",
      "title": "Netanyahu does not rule out further strikes on Hamas leaders",
      "url": "https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T15:26:38.000Z",
      "summary_90w": "",
      "raw": "At a joint press conference with US Secretary of State Marco Rubio, Netanyahu said every country had the right \"to defend itself beyond its borders\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36ce4c998cc03a96b350913c6b67551c6ad45549",
      "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:26:33.000Z",
      "summary_90w": "",
      "raw": "Secretary of state holds press conference with Benjamin Netanyahu during visit to Jerusalem\nThat brings the press conference to a close, as Netanyahu takes a moment to acknowledge both his and Rubio’s staff who are sat in the front row.\nThe main takeaways from the event, which lasted just over half an hour, are that the US views international efforts to recognise the Palestinian state as a hindrance to peace efforts and that Netanyahu refuses to rule out future strikes on Hamas leaders – wherever they are.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a750454b4f8fe9d2b245e0ab6f117c319a4be65",
      "title": "PM says he would never have appointed Mandelson had he known full Epstein links",
      "url": "https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T15:14:36.000Z",
      "summary_90w": "",
      "raw": "The PM says a due diligence process was gone through before Lord Mandelson was appointed US ambassador.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da88483c406faf61da49a6d5413f720ffde0885d",
      "title": "Russia and Belarus carry out military drills amid rising tension – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:12:57.000Z",
      "summary_90w": "",
      "raw": "Allies rehearsing scenarios of an attack on Belarus in the first such exercises since Russia invaded Ukraine\nEU trade spokesperson Olof Gill also defended the EU’s sanctions from criticism that they are not going far enough.\nHe said:\n“Our assessment is that the successive sanctions packages we have brought forward, which includes new initiatives plus additional initiatives to make the previous one stronger if that makes sense, our assessment is that those sanctions are working. \nThe economic evidence shows that they are having an impact on the Russian economy, and that is precisely what they intended to do. \n“Phasing out of Russian fossil fuels is something that we have been doing and are doing actively for a number already of years, since the beginning of the war, with a very clear roadmap, with now even a clear legislative proposal in order to phase out the remaining gas still entering the EU.\n… This is something on which the EU has been very actively and we have a very, very clear roadmap, and how to go about it.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f878871064d60aaa8c7aedbe17f1e2cf053a5e3",
      "title": "Samsung’s 2TB 990 Evo Plus SSD is $100 for a limited time",
      "url": "https://www.theverge.com/tech/778029/samsung-2tb-ssd-pcssd-fire-tv-4k-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T15:06:21.000Z",
      "summary_90w": "",
      "raw": "If you’ve been running out of storage on your PC or PS5, or you just want an SSD that’s faster than what you have, here’s a great deal: the PCIe Gen 5-compatible 990 Evo Plus M.2 SSD from Samsung is selling at a bargain today, with its 2TB and 4TB versions selling for $99.99 and $199.99, respectively, at B&H Photo. If you want to hop on this deal before the prices go back up, you have until the end of the day. The correct price will be reflected at checkout.\nSamsung 990 Evo Plus M.2 2280-sized SSD\n\nWhere to Buy:\n\n $129.99 $99.99 at B&H Photo\n $239.99 $199.99 at B&H Photo\n\nEven if you don’t have a PCIe Gen 5 rig, complete with the latest motherboard, processor, RAM, and GPU, you can still benefit from the 990 Evo Plus. That’s because all Gen 5 SSDs are backwards compatible with PCIe Gen 4 systems, meaning that it’ll work in PCs with available M.2 slots and PlayStation 5 consoles alike (although, in the case of the latter, you’ll need to install your own cheap heatsink to keep it running cool). \nIn terms of speed, this SSD sits below the flagship PCIe Gen 4 990 Pro that came out in 2022 (it’s currently $169.99 for 2TB), but not by a whole lot. The 990 Evo Plus can achieve sequential read speeds of up to 7,250MB/s, and write at up to 6,300MB/s. Even so, it sails past Sony’s 5,500MB/s requirements for SSD read speeds in a PS5, and if you’re upgrading from a PCIe Gen 3 or slower SSD in a PC, swapping it out for this should feel like you’re using a new machine.\nOther Verge-approved deals\nHop into the punishing roguelike action of Elden Ring Nightreign with a special discount on the deluxe edition on disc. Woot is selling the PS5 and Xbox Series X versions for just $34.99 (originally $54.99), which is a price you’d be lucky to find on the regular edition. Compared to the standard edition, this version includes additional playable characters, more bosses, plus a digital artbook, mini soundtrack, and an 11 x 17-inch poster in the box.\nYou can spend close (or over) $100 on a 4K-ready streaming device, but you certainly don’t have to. Amazon’s Fire TV Stick 4K Max — its most powerful HDMI stick — is just $29.99 instead of $39.99 when you enter the code 4KTVMAX or MAX4KUP at checkout. It’s likely that your account will show one of the two codes upon visiting the product page. In that case, enter the one you see (the other code likely won’t work, or at least, it didn’t for us). The 4K Max is a competent streaming gadget that supports Wi-Fi 6E, plus Dolby Vision, HDR10 Plus, and Dolby Atmos in content that supports it. In my experience, it’s a heck of a lot faster than the last-gen Chromecast 4K.\nI need to break the habit of recommending the M1 MacBook Air (8GB RAM, 256GB storage) to everyone looking for an affordable laptop, which is tough to do because it’s just $599 at Walmart. But it’s hard to deny that the 2025 MacBook Air is a significantly better deal at $799 (Amazon, Best Buy), given it has twice the RAM (though, the same amount of storage), a considerably faster M4 chip, plus an overall better design and enhanced webcam.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "150f0bbeab542b6b2feba78576c46cda81b12091",
      "title": "Elon Musk responds to Tesla pay proposal by buying $1 billion worth of stock",
      "url": "https://www.theverge.com/news/778103/elon-musk-tesla-shares-purchase-billion-dollars",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T15:02:42.000Z",
      "summary_90w": "",
      "raw": "Elon Musk is responding to the unprecedented pay package proposal from Tesla’s board of directors by slightly increasing his stake in the company. Musk bought $1 billion in Tesla stock through an irrevocable trust on September 12th, according to a regulatory filing released Monday. Tesla shares were trading up over 5 percent on the news, pushing the company’s value into positive territory for the year.\nIt was Musk’s first open-market purchase of Tesla stock in over five years, according to Bloomberg. He offloaded more than $20 billion of the company’s shares in 2022, which was the year he acquired Twitter. Other Tesla executives have similarly sold off some of their shares this year, including several board members. \nThe purchase comes more than a week after Tesla’s board proposed a pay package that, if enacted, would make Musk the world’s first trillionaire. Musk would need to meet a series of ambitious milestones to receive the compensation, including producing over a million robots, a million robotaxis, and creating $7.5 trillion in value for Tesla’s shareholders.  \n\nIt was Musk’s first open-market purchase of Tesla stock in over five years.\n\n\nMusk is currently Tesla’s largest shareholder, with a 13 percent stake in the company. But the CEO has said that he wants more control over the company in order to have more sway over its mission — which the board’s plans aims to produce. Musk’s purchase of 2.57 million shares  last week increases his stake in Tesla by less than 1 percent. \nTesla’s stock price has been on a rollercoaster this year, as rising competition in the EV market combined with Musk’s political activities have weighed on the once high-flying company. The company’s share of the EV market in the US slipped below 40 percent recently, as EV sales continue to slow and other models lure buyers away. \nMusk is betting the company’s future on AI and robotics, recently releasing a new master plan that appears to downplay Tesla’s core business of making and selling electric cars. But he has also cautioned that the company could be in for a “few rough quarters” as the US government phases out EV incentives and sales are expected to fall even more.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d47159d918f70d9f8b7ba0e4f6c53cd8827270f",
      "title": "Scam weight-loss drops marketed to Australians contain ‘basically salty water’, analysis finds",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/scam-weight-loss-product-marketed-australians-water-saline-solution-analysis-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:15.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Scientists from UNSW school of chemistry analyse sample of treatment, bought online and purported to mimic effects of Ozempic, and find nothing more than saline solution\n\nGet our breaking news email, free app or daily news podcast\n\nA scam weight-loss treatment marketed to Australians as an “oral solution” that mimics the effects of Ozempic contains nothing more than a watery saline solution similar to eye drops, analysis has revealed.\nGuardian Australia revealed last month that online “ghost stores” masquerading as Australian businesses had expanded into advertising weight-loss treatments and were impersonating real people to recommend their products.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "305330ee3d627852b37c80a944eee628218249be",
      "title": "Youth crime in regional NSW down 12% with even sharper drops in crime hotspots",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/youth-in-regional-nsw-down-12-with-even-sharper-drops-in-hotspots",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:14.000Z",
      "summary_90w": "",
      "raw": "Exclusive: New data shows far west and Orana region is down 42%, while car theft is down by almost 25% overall\n\nGet our breaking news email, free app or daily news podcast\n\nYouth crime has dropped in regional New South Wales by more than 12% over the past two years, according to new data, with even sharper drops in crime hotspots including the area that takes in Moree.\nThe data from the Bureau of Crime Statistics and Research (Bocsar), which tracks the number of youth charged and issued a court attendance notice between June 2023 to June 2025, shows car theft in the regions has dropped by almost 25%, and break and enters and robbery offences have remained stable.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "406a7b208d86e7d05c1fa50963371fc4d8bb3ba4",
      "title": "The government has laid out the perils of the climate crisis for Australia – but will it meet the moment?",
      "url": "https://www.theguardian.com/environment/2025/sep/16/the-government-has-laid-out-the-perils-of-the-climate-crisis-for-australia-but-will-it-meet-the-moment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T15:00:12.000Z",
      "summary_90w": "",
      "raw": "Grave remarks on the potential shocks to people, property and the economy are all too familiar. Putting a credible number on the emissions target is the harder part\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nGet our breaking news email, free app or daily news podcast\n\nIt is hard to imagine there will be a more important piece of work put out by the Albanese government in this term of parliament than the national climate risk assessment. It suggests that at more than 2C of global heating – a level we are headed towards on our current trajectory – the systems Australians rely on could start to crumble and collapse.\nThat’s an easy thing to say, but a hard thing to get your head around. There was a huge amount of information released on Monday, including an adaptation plan that is only the start of grappling with the issue, and it will take time to digest. But it is worth considering what the assessment led by the Australian Climate Service says about the country’s economic future if global emissions are not curbed and temperatures continue to rise.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bd6c1573fc8e5deacb4e5157371a24ddcf5fada9",
      "title": "Here&#8217;s why usage of Gemini&#8217;s Nano Banana image editor is growing",
      "url": "https://www.theverge.com/news/778106/google-gemini-nano-banana-image-editor",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T14:59:52.000Z",
      "summary_90w": "",
      "raw": "Google Gemini is breaking out of ChatGPT’s shadow, likely on the wings of its Nano Banana image editor and the viral trend of AI-generated, lifelike figurines. \nGoogle launched Nano Banana in late August. It hyped the model as a way to “transform images in amazing new ways” inside the Gemini app. To get the “perfect picture,” you simply pop an image into Gemini and “tell it what you’d like to change,” the company said. Google’s suggestions include redecorating your house, giving yourself a ’60s beehive, putting a tutu on your chihuahua, and seeing how many wrinkles you’ll have acquired in 10 years. You can also combine different pictures and create a “fun video” of your new reality by plugging the finished product back into Gemini. \nOn X, Gemini and Google Labs vice president Josh Woodward said the Gemini app had added 23 million users in the two weeks since the editing model launched. In the same time, he said Gemini has been used to transform 500 million images.  \nThe surge has likely propelled Gemini to the top of various app stores around the world. At the time of writing, Gemini is the leading iPhone app on Apple’s App Stores in the US, UK, Canada, France, Australia, Germany, and Italy. In many cases, it reached the prime position by surpassing OpenAI’s ChatGPT, which now sits in second place. \nOn September 11th, Woodward said “India has found” the image editor and later said that Google was going to have to implement “temporary limits” on usage in order to manage extreme demand. “It’s a full-on stampede to use” Gemini, he said, adding that the “team is doing heroics to keep the system up and running.” \nSo, what’s driving the surge? While a variety of edits have been popular, the runaway hit of Nano Banana has people turning themselves — or their pets — into 3D figurines. All you need to do is to give Gemini an image of yourself and some pretty detailed instructions to get a realistic miniature doll version of yourself on a desktop, complete with a box that it presumably came in and a wire-frame model presumably used to design it flashing on a computer screen behind it. While the prompt is detail-heavy, easily copied versions have spread online. Google has even supplied its own in order to keep the trend going.\n\n\nThe 3D figurine trend is taking over the internet.\nYou can generate the same using Nano banana.\nPrompt in the comments ⤵️ pic.twitter.com/R7ETkBN94P\n— Heisenberg (@rovvmut_) September 9, 2025\n\n\nAfter playing around with Nano Banana for a bit, it’s easy to see how Google has earned its viral AI moment. The image editor is simple and convenient to use inside the Gemini app. It’s also fast, with little of the waiting around for images that has turned me off other tools like ChatGPT. To be clear, there are still issues that frustrate me. Like other image apps, the results are not always what I imagined, and Gemini sometimes decided to just ignore my prompt entirely and return my image with no changes. \nDespite my troubles, there is one element of Nano Banana’s editing capabilities that amused me enough to think it has earned its time in the spotlight and will likely spawn a few new viral trends before a better model takes its place: the images that it gave me still look like me. While many AI editing tools have been infuriating for their tendency to change facial features and create creepy facsimiles of the original, Google’s Nano Banana swiftly returned a cutesy desktop doll that was still quite recognizably me.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "833cf00f0e7e352619c93b7093dc27b29b346815",
      "title": "Charlie Kirk suspect linked to crime scene by DNA, says FBI chief",
      "url": "https://www.bbc.com/news/articles/c203qgn61geo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:56:59.000Z",
      "summary_90w": "",
      "raw": "Kash Patel says Tyler Robinson's DNA was found on towel wrapping suspected murder weapon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d4a249f1e55b0dd00b2a3cff15f071b024264c92",
      "title": "The US and China might finally have a TikTok deal",
      "url": "https://www.theverge.com/news/778087/tiktok-ban-framework-deal-us-china-trump",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T14:33:45.000Z",
      "summary_90w": "",
      "raw": "The US and China have reached a “framework” deal to divest TikTok from its Chinese parent company, Treasury Secretary Scott Bessent told reporters during trade talks in Madrid on Monday. As noted by Reuters, Bessent confirmed that “the framework is for a switch to a U.S.-controlled ownership.” He said Trump will confirm the deal with Chinese President Xi Jinping on Friday — two days after the latest deadline to sell or ban the app.\nThe preliminary deal comes after months of rocky negotiations between TikTok and the Trump administration. The app faced a ban in January, but President Donald Trump granted TikTok an extension to work out a deal to sell its operations in the US, as required by the Protecting Americans from Foreign Adversary Controlled Applications Act. Trump granted TikTok two more extensions after that, giving it until September 17th to reach an agreement. It’s unknown whether he will formally extend the deadline or consider this announcement sufficient to count as a divestiture; it’s also unclear whether the deal will satisfy the requirements laid out in the law. \nBessent told reporters that the US and China are “very close” to reaching a deal, but that China had some “very aggressive asks,” according to The New York Times. (The parties were close to a deal earlier this year too, but it fell through thanks to Trump’s trade war.) In July, reports from The Information and Reuters suggested that Oracle and several other investors, including Susquehanna International Group and Andreessen Horowitz, would make a bid for TikTok, while its China-owned parent company, ByteDance, would get a minority stake. TikTok is reportedly working on a new version of the app with an algorithm trained only on data from US users. \nIn a post on Truth Social, Trump said the meeting between China and the US went “VERY WELL,” adding that “a deal was also reached on a ‘certain’ company that young people in our Country very much wanted to save.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ace77a88d8da2e30f26fe59956bfdf80512fc95",
      "title": "By popular demand: 10 extra exhibit tables open at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/by-popular-demand-10-extra-exhibit-tables-open-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T14:30:00.000Z",
      "summary_90w": "",
      "raw": "Back by overwhelming demand, we’ve added 10 more exhibit tables to TechCrunch Disrupt 2025 — and this will be the final release before they sell out. This is your last chance to showcase your company in front of 10,000+ founders, VCs, and tech innovators from October 27-29 at San Francisco’s Moscone West.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b239d1fbcf3bfa1eecd81682c90b95d4d1b397cc",
      "title": "Spanish PM calls for Israel to be barred from international sport",
      "url": "https://www.bbc.com/news/articles/c20e1m7vd2no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T14:25:18.000Z",
      "summary_90w": "",
      "raw": "Pedro Sánchez says Israel should be treated in the same way as Russia over its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "806d276038c984b3262c0e0bac419621deb730df",
      "title": "Bob Vylan gig in Netherlands cancelled after frontman makes comments about death of Charlie Kirk",
      "url": "https://www.theguardian.com/music/2025/sep/15/bob-vylan-gig-in-netherlands-cancelled-after-frontman-makes-comments-about-death-of-charlie-kirk",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:12:54.000Z",
      "summary_90w": "",
      "raw": "The 013 venue in Tilburg says ‘new statements go too far’, while band responds that ‘at no point was Kirk’s death celebrated’\nThe punk duo Bob Vylan have had a gig cancelled after their frontman Bobby Vylan called the far right commentator Charlie Kirk, who was fatally shot last week in Utah, “an absolute piece of shit of a human being” while performing in Amsterdam.\nThe Tilburg venue 013 has cancelled the Ipswich band’s 16 September show as a result, saying that the band went “too far” at the Paradiso venue in the Dutch capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "281ed7637d131be22ff995f95c90815475b1f969",
      "title": "'What a legend!' - Duplantis clears 6.30m to break pole vault world record",
      "url": "https://www.bbc.com/sport/athletics/videos/c237mlvl845o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T14:04:53.000Z",
      "summary_90w": "",
      "raw": "Armand Duplantis breaks the men's pole vault world record for the 14th time, clearing 6.30m attempt after winning gold at the World Athletics Championships in Tokyo.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc6f80b8dc824f2ea3ff3e065c0b715453e4277a",
      "title": "In first interview, Pope Leo XIV takes on billionaires, polarization and war",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542092/in-first-interview-pope-leo-xiv-takes-on-billionaires-polarization-and-war",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T14:01:46.000Z",
      "summary_90w": "",
      "raw": "Pope Leo XIV reflected on the legacy of Pope Francis and whether he sees himself as more U.S. American or Peruvian.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e2a4a720b1fd3f8129d34d7101fc966af05d588",
      "title": "How brands and creators are fighting for your attention — and your money",
      "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/776412/amy-lanzi-ceo-digitas-digital-marketing-creators-ai-hank-green",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Hello, and welcome to Decoder! This is Hank Green, the cofounder of Complexly, where we make SciShow, Crash Course, and a bunch of other educational YouTube channels. I’m back in the Decoder guest host chair for another couple of episodes while Nilay is out on parental leave.\nToday, I’m talking with Digitas CEO Amy Lanzi, who runs a major marketing and ad agency. You might remember Amy; Nilay interviewed her for Decoder live at an event in New York City almost a year ago. But Nilay, who runs what might be called the last website on Earth, has a very different perspective on the world of digital marketing than I do. So, as a career YouTuber, I had a lot of questions for someone in a position like Amy’s.\nI’ve been making videos on the internet for close to two decades now, and all the while, I’ve relied on advertising for a healthy chunk of the revenue my channels take in. I also run an e-commerce site, Good.Shop, and then, of course, my big online education brand, Complexly.\n\n\n\nListen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems. Subscribe here!\nOne might think I’m a marketing and advertising expert. But this stuff is really, really complicated — almost like they’re trying to make it that way, and, frankly, there is a whole lot of it that I do not understand. For a lot of us, I suspect the world of digital marketing is a bit of a mystery. So, I was happy to have Amy really break down how some of this works and why her industry feels like it sits at the center of almost everything that happens on the internet today.\nOn the surface, this all sounds pretty simple. You build a brand, you try to create a story around that brand so people associate ideas and loyalties and all sorts of other warm fuzzy feelings with the brand, and then you show them some ads to sell products or experiences or subscriptions or whatever it is you sell. But I know from experience that that is far from the whole story. And as you’ll hear Amy say, that old-school Mad Men-style of advertising is really a relic of the past.\nToday, marketing and advertising are increasingly digital and diversified, spread out across a lot of different channels and coming in all shapes and sizes. The ads you see are different from the ones I see, and the ways that brands market themselves online can involve everything from brand deals with creators like me, big TV and movie promotion tie-ins, and then really analytics-driven, algorithmic tech stuff that can feel almost impenetrable to the average person.\nYet, as you’ll hear Amy lay out, there is still a huge, expensive draw for what you might call a collective shared experience, something that resonates with a lot of different people all at once. Like, say, a Super Bowl commercial that plays on TV — even if more people might watch it after the fact on YouTube.\nThere’s also the AI of it all, which really seems like it’s on a collision course with both the creator economy and the entire economic structure of the open web. I know this because Nilay can’t stop talking about it on Decoder.\nSo, I also had Amy walk me through what a modern digital marketing company really does, how different kinds of ads operate in this ecosystem, and how she sees all this changing in the future. And we had to hash out the difference between influencer and creator, because that debate isn’t dying anytime soon.\nOkay: Digitas CEO Amy Lanzi. Here we go.\n\n\nThis interview has been lightly edited for length and clarity. \nAmy Lanzi, you are the CEO of Digitas. Welcome back to Decoder.\nThank you for having me. I’m thrilled to be back.\nI’ve been on Decoder. It’s kind of scary. Is it scary sometimes?\nIt’s not kind of scary, but it’s good scary, because it makes you, I don’t know, really be with it on what you’re going to be talking about, because we know the audience is very with it, so I like that.\nThey’re very with it.\nYes.\nI was just talking to your colleague before you showed up, and we were saying, “Hey, if the questions aren’t hard, you don’t get a chance to look smart.”\nThat’s right.\nWe have faith that you’re going to look smart. I have a question, though, that may be a weird one. I did a deep dive on your whole career, and I want to ask you a question. \nFor most of my life, I had assumed that the number of seats on an airplane determined the number of tickets sold for that airplane, and now I have in front of me a person who can tell me why that is not the case. So, of course, we all have heard that our airplane is in an oversold situation, and they start giving away free things in order for people not to use their ticket, and you used to be part of that system. \nHow does it work? And back when you did this decades ago, what was the algorithm? How did you decide this?\nWell, it was at a time when it was really all human, which is interesting. We did have models. It was my first job after college. I went to SMU, and I was a yield management analyst at American Airlines, and basically, that job is how do you extract the most yield out of each flight? And the assumption is that all seats are sold at the same price, as well as you can only sell the number of seats that exist, but have you ever missed a flight?\nI have. \nYes. That’s why there’s this whole team called yield management, and so you essentially look at the patterns of the flight. So I was assigned to LaGuardia, New York. I’m sorry, from Dallas to LaGuardia.\nOh, you had one flight?\nYeah, we would get assigned different routes.\nOr not a flight, but a route.\nYeah, you’d get assigned different routes, so I’ll give you two points here. The first was LaGuardia to Dallas, and so you assume a lot of business travel. Someone may, like you or me now, think, “Okay, I’m on the 6AM, maybe on the 7AM, or my meeting’s running late, so I’ll get on a later flight.” So, therefore, you get to make some assumptions on how many x-\nThat’s really specific.\nHow much can you overbook this flight?\nThis makes sense. So, if it’s like a bunch of families going to Orlando, it’s much less likely that they’re going to miss their flight.\nYes. So as a kid, I really didn’t pick up some of those consumer triggers as we would today, and I was assigned Dallas to Albuquerque. I didn’t really think much about it, but that was also when the hot air balloon festival was taking place. I did not calibrate accordingly, and we had a gigantic oversold problem because everyone showed up, because this is a big sojourn for many. I totally missed it.\nYeah. There’s a takeoff time. You have to make it.\nI missed that people were traveling and planning to go from Dallas to Albuquerque to make the flight, and they weren’t going to risk it like you and I might risk it if we are going for a business meeting or whatever it is. And so then you get into that oversold situation, and then you’re the one who’s figuring out how you are basically burning the profitability of this flight because you’re prompting people to get off a plane for a planned trip, which is very different now if you’re getting off for a business trip, for example. \nSo yeah, that was it, and what was great about that job — and I was also right out of college — was that it was non-revenue travel, so you could fly for free in the places that were a low load factor. You could basically just pay for the taxes on it, so we would play gate roulette, and we would pick places that we could all go to. For the weekend, we went to Des Moines, to all kinds of weird places we wouldn’t plan.\nYou never know where you’re going to go. I love a weird accidental travel trip, like you get stuck in Denver for 48 hours and you’re like, “I guess Denver. Sure. It’s got stuff. We’re going to Meow Wolf, I guess.”\nBut it was great, and my thing too is just wow, I had a front row seat to customer service and what that means.\nI bet they don’t do that anymore. I bet they don’t, because I read this, that they also were like, “And now you have to go and actually do the job of telling people that their flight is oversold.”\nYes. American Airlines was great about this. They had us go work at an airport, so I worked in Miami, which then all of a sudden, you’re like, “Hi, Hank. I see you’re a Super Whiz Bang traveler and you’re oversold, and I’m not going to get you on this flight.” And then you’re calling the people, and you’re like, “Oh, do me a solid. I got to get them on the flight.” \nSo yeah, it was great. It was a reminder of customer service, everything matters. Decisions you make in one place have a real impact on other people, even if they’re invisible to you in the moment. It was a fantastic experience.\nWell, now you’re the CEO of Digitas, which is an advertising agency inside of an advertising agency inside of an advertising agency, as far as I can tell, something like that. Is that right?\nSomething like that, yes.\n[Laughs] And your parent company has been around for 100 years.\nNext year is 100 years, yes.\nWow. Oh wow. So that’s real. I was guessing. \nNo, it’s real. Next year is 100 years.\nMy god. So I have to say, I don’t understand advertising, and I know that you also don’t, all the way, because what a mystery it all is to try and change people’s behavior with messages that are paid for. But I want you to explain something else that I have never understood, and I really want to know. \nSo, you’ve told me about how overbooked flights work, so now help me with this. I’ve been part of the advertising industry for 20 years now because I make stuff and then I sell ads on that stuff. It feels like magic, though, how any of this works. I guess, how does it work? What are you doing?\nThat’s a big, wide question.\nHow do you explain it? I don’t know. It feels like it’s all obvious and everybody’s seeing it all the time, but I’m in it and I still am very confused.\nYes. A couple of things. First, I would say there’s a bit of a reframe from advertising, like the Mad Men days, where you were in a room and you made a thing, and then you watched ABC, NBC, or CBS, and you saw this, or you saw a bus. Like in New York, it’s great to go see the Out-of-Home ad that was inside a bus, and those were the only things. We lived in a very static world.\nThere’s so much now, it’s so fractured now, which I feel like maybe is good for you?\nWell, so for me, Digitas is really a modern marketing agency versus an advertising agency, so that’s a shift — because the job is really building out a capability versus just the wallpaper you see. It’s so that I can figure out how much more I know about you through data, and I can magically surprise and delight Hank by understanding, “I think I can get Hank to do the one more thing.” Whether it’s buying a confectionery brand or booking a trip to wherever, I know a little bit about you because I’m picking up on the signals that you’re putting out there. Then I’m able to, one, create a relationship with you, but two, get you to do the thing that I think will make you better, faster, stronger. That’s how it works.\nIn the past, like 100 years ago, it was much more static. You had a story, you saw a thing, and most people did that thing. Now, everyone is so distributed. You talk a lot about this in terms of distribution when you think about where you and Nilay speak. This is really about understanding how to make meaning around the machines. This is what has become very hard. \nSo, if you are constantly just trying to win that algorithm, that gets hard unless you really stand for something in the world of AI. You need to actually make the market for yourself before you’re just trying to bid through terms to be able to beat the algorithms. It’s very difficult to do that. You have to really break through with real stories, but then you also have to be very smart about being in tune and picking up those signals to then say, “Okay, I see you. I see that you’re interested in something, and now I’m going to stay with you along that path to purchase or path to loyalty,” or whatever the job to be done is from the client.\nThis sounds extremely personalized. You’re going for me specifically, you’re talking about my story and how you connect with Hank Green, which is wild. Of course, you’re not theoretically marketing to any individual, though with certain products, it feels like maybe you’re aiming for a total of 25 people who make decisions, but whatever.\nWell, there are cohorts that exist that then enable us to do this in a scaled manner. It’s a very good question. That’s where the magic of media and creative come together, so I can start to understand that there’s a sizable group. I’m not going to be weird, and also, no one can afford to go find 25 people to be able to say, “Okay, how do I do a better job with first-time expectant moms? How do I become the brand of choice for first-time expectant parents?” \nThat’s the way to think about it, and there are a lot of people — and we think about ages and stages — that are in similar spots to create these big frameworks. So then you can start using the power of all the data and technology that’s in the market to be able to fine-tune those messages to feel relevant to you.\nAnd follow me through that. Can I ask a YouTuber-specific question, and then I’m going to zoom back out?\nSure, please.\nSo imagine that there are two ways to advertise, to show a 15-second spot, and one of those ways lets you target people with a ton of specificity, there are relatively fewer ads per minute of content. It’s newer, it’s a hipper place, it has higher-value demographics, and it has really good analytics for you. \nAnd then another place, you have no idea whether the people are watching the ads, the targeting is really broad. You’re often only able to hit people over 65 years old. Your ad’s going to be sandwiched between five other ads. Which one of those would you think would have a higher [cost-per-mille]? Which one of those would you think I would be getting paid more for as a creator on that platform?\nI would think that the first one.\nYeah. And yet I feel as if, and correct me if I’m wrong, but I get paid less per advertisement (by a lot) than somebody who’s making content for cable TV.\nI think this is where you get into the definition of, first of all, the way in. Did I find you on a creator platform, or did I find you because I went through and did a deal with one of these previously known as broadcast networks, or whatever? So now the entry point is much more around a media approach, versus I really want to find people who are into Hank. Those are two different ways in.\nI’m confused by the difference between those two things.\nSo, let’s say I want to do something on one of those major cable networks. I might go in because I’m going through the media partner that represents those assets that are on that cable network, and I’m going to do a media deal that also enables me to have access to one of their stars. \nOh, really? It’s like part of a package deal, and one of those stars is like a Property Brother or something.\nYeah, potentially, and you’re leveraging your position to be able to then create a special integration for the brand they’re representing. That’s one way to do it. That’s a different value, that’s a different pricing mechanism than going into a creator platform, which is, for us, we have Influential, and I want to find someone who is very into someone like you.\nI’m talking about buying just on YouTube, like buying through YouTube.\nWell, but the logic is a little similar in terms of how it happens, where YouTube is a whole different process in terms of the engagement model, on how you’re able to think about buying within that world.\nI’m going to act like a little baby and ask you to tell me what an engagement model is. I feel confused.\nThat means in terms of how I go out to the market and buy certain things. So if you’re asking about why one is more valuable than the other, the market controls what is priced at what level. Also, YouTube is very dynamic. \nAren’t you the market? Aren’t you the buyer? So you determine what the prices are. You determine what you’re willing to pay, right?\nWell, it’s a big market first of all.\nBut you, the advertising industry. I would assume it’s worth more to you to advertise on TV than it is to advertise on YouTube per 15-second spot. I know that because you pay more for it. Why is it worth more to be on TV?\nDo you think that the people in television are just better at selling you stuff? They work with you more, or it’s not an auction?\nI think it’s just a different market. So that’s what I mean by engagement model. So the model is different in terms of how we are able to buy things from different partners, just like it’s different when you buy something at Walmart versus somewhere else. \nSo, that’s why I’m saying the engagement model is different, and so biddable spaces are different. There’s so much more dynamic activity that’s happening on digitally native platforms versus some of the other ones, although they are starting to converge with the rise of [connected TV]. So you are seeing these worlds more blurred, but that doesn’t mean the commercial models have converged.\nThe models and measurements for each of these are different, so there’s a little bit of making all of those things work together. Because they’re not exactly all the same, but some companies use certain analytic modeling that is also favorable for certain channels. \nSo it’s not as simple as it seems, in terms of putting money in like it’s a calculator, and voila, this is what happens. That’s not how it works because they’re not all the same. Some are brand new. TikTok is relatively new versus some of these other partners you’re talking about, and so they’re all not exactly the same. Every impression isn’t the same, I guess, is the way to think of it, and they’re not all measured the same.\nFor sure. Yeah. Well, that is a real mess, like how you measure an impression. Maybe we should get into this for a second: what do you think of a platform where everybody can skip the ad instantaneously and has been trained by the platform to skip the ad? So with all these swipeable platforms, there’s no ad that you hit that you can’t swipe away from. Does that pose even some kind of threat to you? \nIt’s wild. And then what you see on those platforms, what you get, is just a preponderance of ads for things that you can really tightly measure how much you spend versus how much you make. So it’s a very Home Shopping Network kind of experience.\nYes, it is a threat, or compare that to someone who is watching a more traditional experience, and they have their phone in front of them, so they’re passively paying attention.  In one way, you’re actually legitimately measuring whether someone skips or not, if you think about it, versus if you’re like my mother’s phrase, “I leave my TV on for company.” That’s also a whole other thing that I don’t think we’ve talked about that exists.\nThat’s an amazing thing that makes me feel like YouTube is a really valuable place to advertise. Not to rep my home base here. For an unskippable ad on YouTube or… YouTube reports whether or not someone skipped a skippable ad; you know that that person is there. They could mute their phone or their monitor or TV or whatever, but they aren’t probably for the most part. And maybe for some of those mid-roll ads, people could be in the other room, and they’re leaving YouTube on for company, just like they did with TV. \nBut it just feels like, at this point, YouTube is TV, and it’s surprising. If I were an advertiser, I’d be like, “Why would I ever, ever — unless I was trying to reach a very specific demographic — go on TV, where it remains more expensive?”\nIt depends. If you’re in sports, that’s an interesting place. There are some moments that push you to not be on YouTube. I am a big fan of YouTube. Many of my clients love the YouTube experience. If you can search, shop, socialize, and have all of those things coexisting in one place, and it is the most watched thing that is horizontal in your living room. \nIf I look at my 11-year-old, where they spend time, it’s watching Minecraft creators on YouTube in our living room, when I would have watched whatever show was on. So, I agree with you, but sometimes you’re not going to get things like the Super Bowl.\nFor sure. Those things you can’t get, for sure. So help me understand what Digitas does, because I think that Digitas is a very interesting piece of the advertising industry. To really get down to the nuts and bolts, can you imagine for a moment that you are approached by a brand? They do about $10 million in business per year; they’re small. They donate all their profit to charity, and they sell a variety of products. The idea is they’re a store, maybe it’s Good.Store. This is a thing that I run. \nSo they have coffee and they have soap, and they’re to figure out how to do marketing. If they approached you and were like, “We’re going to go big. We’ve got some money. We’re going to try and get into this space,” what would Digitas do? What services would they provide? How would they start? How would we start working together? What does that look like?\nSure. So first, we would think about how we describe the value prop of this company. What is your right to win, and how do we start to tell our story?\nMy right to win?\nYes. Why are you better than somebody else?\nThat’s why you’re in this business. My right to win. I deserve your money. I deserve to destroy my competition.\n[Laughs] Yes. So what is the single thing that these consumers are going to rush to your connected ecosystem to purchase and tell everyone about? So what do we stand for? How are we going to tell our story to the world? That’s part one. \nSecond, how are we investing those dollars you might have to recruit and retain consumers? What makes sense? Are we spending all of our money on YouTube? It sounds like that’s what you would like to do. \n[Laughs] I’ve had success on a variety of platforms, but I don’t think that we’re going to hit HDTV anytime soon.\nSo then we think about how we are going to be able to both recruit and retain the consumers you want so that you can grow. Third, and I am guessing, but this feels like a very socially relevant type of organization, as well as the value prop you’re putting out there. We might want to have creators who are also loving this and want to make the market for you. That’s something we call “social as a system.” \nNow I’m going to go out and say, “We know that cat video makers and people that make cooking videos and travel videos, those that follow those types of creators are also going to want to come and buy something from our store, so we’re going to co-create with them so that they are then able to bring more understanding of our offering as well as eventually drive more sales,” as an example. \nIt’s interesting, and I like this, that you talk about the role of marketing in the acquisition of a customer, but also the retention of that customer, which I completely agree with. I often find that when I’m working with marketing agencies, it’s very acquisition cost-focused and not thought about later. Retention is on us. We think about retention, and that’s not really integrated into our marketing strategy.\nTo me, I grew up on the 80/20 rule. \nIn this context, what is the 80/20 rule?\nThat 80 percent of your sales come from 20% of your customer base. So, when you’re obsessed with acquisition, you might not be getting incremental value out of your core. You also might be losing them because you’re doing things to drive acquisition that may turn off your core audience. So you should be thinking about recruiting and retaining always as a way to think about creating your own brand flywheel.\nWell, thank you for my free consultation.\n[Laughs] No problem.\nSo tell me about Digitas. I guess we should Decoder it. You’ve been here before, but how is Digitas structured?\nDigitas is structured… We are a modern marketing agency. We have five different practices that work together to deliver what we call network experiences. That means, “How do I build experiences to be able to get Hank to move from like to love to loyalty with the brands that we represent?” The practices are creative experiences, integrated media, CRM, commerce, and social transformation. We are powered by data and analytics.\nOkay, I’ve got to make you define all those terms now.\nSo you asked me about creative experiences. You asked me about this mythical company. That means, what do I sound like? What do I look like? What are the types of creative that I need to be able to engage with the consumers? Integrated media: how am I able to take the money that you have to spend in media, and I’m going to tell you where to spend it. \nCRM, or customer relationship management — this is loyalty. How am I texting and sending you emails so that you do more things with me and like me even more? Commerce is about how I make sure that I’m showing up in easy and seamless ways for you to buy my things. And then the last one is social: how am I using creators? How am I showing up on social so I am making the market for myself?\nSo Digitas refers to itself, describes itself, as a networked experience agency.\nYes.\nAgain, I’ve got to ask you to define the terms. There are so many words in that order. I’m not quite sure. I think… actually, I’ve done a little research. So I think I know, but please tell me. \nSure. Networked experience is essentially how we’re delivering an experience around the consumer so that we earn our way into your networks. You can’t just put comms out there and put any communication out there and think that consumers are just going to take it. They’re very hard to find, and we are in an attention battle, so I have to earn my way in as a brand that you go to and you pay attention to. \nThat comes from a combination of the things I talked about, which is: what I stand for. How am I going to, as a brand, make you faster, smarter, stronger? How am I going to find you in the places you’re spending your attention, whether you’re watching sports or whatever that is? And then how do I bring in some of those other services I talked about so that I’m continuing to drive growth for the brands we work with?\nSo we have also noticed in our background research that things at Digitas are described as unicorns. Digitas AI is the unicorn of AI operating systems, and SWOT is run by our team of social unicorns. The headline on your careers page is “Unicorns welcome.” I was just talking to your colleague, and in the background, there was an inflatable unicorn.\n[Laughs] Yes. So our people are unicorns, and the people power the offerings from Digitas.\nPart of this… It’s a weird thing. So Publicis has a bunch of different agencies inside of it, so I assume to some extent, you’re competing with your colleagues for business.\nWe are not competing with each other. So that’s a very good question.\nDoes it ever feel like you are?\nNo, because the culture of Publicis Groupe is very much around, we have the promise of the power of one, which is what my boss’s boss’s boss says to our clients. What that means is we are committed to bringing the very best talent and solutions to clients, and those come from all different types of agencies, not just one agency. We’re not biased by the one agency perimeter. This is very true. This is not true for every holding company. This is very much the core of Publicis Groupe. Otherwise, it’s bad for clients. If I’m in a fight for revenue for me versus my sister agency, that’s just not good for clients. That’s a distraction.\nFor me, Digitas, when we think about ourselves as unicorns, the culture of Digitas is we’re fearless, inventive, and generous, and our role is really finding those new inventive things that clients that come to us want and expect. That’s a little different than some of the places my sister agencies sit and where they focus on.\nSo, I’ll give you an example. We worked with Reddit to build out their community insights AI product. This is something that we co-created with them, because we found so many of our strategic planners were coming in looking for unique insights around what’s going on on Reddit. How are people talking about these brands? What can we find that would help me understand my right to win? See, I used it again?\n[Laughs] Mm-hmm.\nSo then we said to Reddit, “Let’s make a product, because this is something that we can do more with.” That’s a little bit of the things that Digitas would do. Some of the other agencies may not focus on that, and then we build that into our value prop to clients. It also might be something that we give to other clients through the power of one model.\nSure. And can you explain that product to me? So, if I have a brand, if I sell candy, is Reddit providing you reports of the buzz of communication of what’s going on with M&Ms or whatever?\nThat’s exactly right, and it’s basically what I can learn from the chatter on Reddit that bubbles up into insights, so I can learn something that may not be expected but is showing up there. Reddit is the gossip channel of the internet.\nA lot of it, yeah. \nAnd so this is a place for you to be able to look for those insights that might be the edges that then help you break through for that confectionery brand, for example.\nAnd then you can do a Harry Styles-flavored Oreo, because that’s what everybody wants. \nExactly. I’ll give you a real example. When we were working on Rivian, we were pitching their business, and Rivian is one of the most talked-about auto brands on Reddit. You [wouldn’t] think that just because they’re an EV and they’re not as giant as some of the other brands you might think of, but because the core of Reddit is really quite tech-oriented, or the original power users of Reddit, it makes sense. \nA first adopter place.\nYeah. This is a place for Rivian. You may not spend more money on Reddit. You may spend more money on other places because they’re trying to get moms to buy their product, so don’t fish where you already have won the people. This is your recruit and retain story.\nInteresting.\nSo that was an example. And so we had a couple of those come our way, and then we said to Reddit, “Hey, we think this could be a really interesting product for us to build together so that we can get to these insights faster for our clients.”\nHave you thought about doing that with other platforms? Twitter, YouTube? It seems like there’s a lot of insight, a lot of what happens in comments and various places.\nWe have different engagement models and products with different partners. Four years ago, we built the TikTok community commerce effort. This was really before TikTok understood the power or potential of TikTok Shops.\nOh, I think they understood it. \nIn the US, this is a US story. So what does that mean if a brand wants to do something on TikTok Shops? What do they need? What does TikTok need to do? What do I, as a brand, need to do to be able to stand that up, etc.?\nSo we worked with them to build that out, and then part of it is being able to get the connection so that you’re able to understand what’s possible, and also, is it moving? What insights are driving that assortment I should be selling on TikTok shops, for example?\nAnd is that a revenue generator for Reddit? Are you paying for that insight? \nNo, it’s not something like that. It’s more like the more you use a product like that, the more partners want to do more things with Reddit. Whether it’s more media investment or more content, they’re creating content specific to Reddit. So think of it as more of a lead-gen opportunity for Reddit.\nRight. And that’s something that you helped Reddit build internally?\nYes, we helped them on the product roadmap.\nInteresting. Weird. We’re talking about AI. We’re talking about AI. Everybody’s talking about AI. We’ve brought up AI several times already.\nYes.\nI don’t know. First, is there a threat there? Is there a world where a lot of this work is just being done by machines?\nThis is the big hot topic in my industry, and of course, there is a threat that there is a CMO who decides they’re just going to pick an AI partner and dump everything into that, and let the robots take over. But I think we’ve also determined that humans matter. Humans matter to be able to come up with actual creative ideas, not just content. It also matters when you think about brand governance and brand safety. \nWhen you think about AI for creative, and if you’re familiar with programmatic and the amount of brand safety that’s required to make sure that you are putting content in the right areas, all of that is even more important. So there’s governance that’s required so that the brand is holding up to the integrity of what the brand should be and what it stands for, and that’s still humans that need to be able to do that.\nTo me, the future is around how these things work together. As you mentioned, Digitas AI, for me, we’ve been working on that for two years, and it really is about how we create agents to minimize low-value activity that our clients don’t care about, but we need to do. So then you’re freeing up your time to do things that are human-based and more strategic, and that’s more valuable to them.\nSo, like reporting, pulling a report. Sure, we did the report, great. The insights around the report come from your brain, so let’s make sure that, whether it’s through automation or it’s through AI agents, we are able to get to that level of output, but then be able to take the brand and our clients to the next place they should be based on what we’ve learned from this assessment because we’ve done that much faster.\nI don’t know, I’m of the opinion that this transition happens more slowly than we might expect it otherwise would, because people have relationships with people, and ultimately, Digitas, an advertising agency, might be able to introduce some efficiencies. \nBut ultimately, a lot of what I would be paying for if Good.Store was working with Digitas, would be someone whom I trust. [Someone] who can explain the choices that are being made with my money, and then start from a place of a little bit of trust and work toward a lot of trust. \nI guess I could probably develop that with an AI agent at some point, but I feel as if that is going to take a lot of time. And a lot of CMOs… I don’t know, you let me know, but maybe they’re not actually the most innovative thinkers? I’m sorry, I feel mean saying that.\nNo, no, I think it is a people business. Clients call me because they say, “I don’t know what to do. What should I do?” And that sometimes is a technical question, and to your point, CMOs need to now be full-stack operators, and that means you now need to be technically advanced to be able to choose between all these AI products that are coming at you, which is not really the core of most of them. \nIt’s not that they can’t get there. It’s just that they don’t have a new team as well as that. That’s a full other day job to be able to determine all of that and the modern tech stack. The promise of it is great, not to mention that brand managers aren’t trained in business school to figure out how to use the Adobe or Salesforce AI products.\nSo, let’s pretend everything turns over. Then all of a sudden, they graduate and they suddenly get out of business school or whatever, and they go to CPG XYZ. They don’t know how to use that. They don’t know how to use Adobe Journey Manager. It gets very technical very fast, and it’s important because we want to have — where we started the call — greater personalization. \nYou’re a busy person, so I would hope the communications I send you are more on par with what you need versus waste, but that doesn’t mean we don’t need to thoughtfully think about the brand, what it stands for, what you want to engage with through culture, or what you don’t. What kind of new products you want to make, that takes time. And so I agree with you. I think it’s an important thing to bring into the fold, but I don’t see it completely just collapsing in the next quarter.\nCan I hit you with an assumption, and you can tell me where my assumption lies in your view of the world? There’s this narrative that this has all gotten really hard for advertising agencies because it’s very fractured, and there’s so much more data. So instead of vibing and being like, “Well, this is the kind of advertisement that would resonate with me, so maybe it’s going to resonate with other people,” that has made it much more difficult for advertising agencies. \nBut I think that while that might be true, my assumption is that this is better for advertising agencies because when things are more complicated, people are more likely to need a partner who understands that world rather than trying to figure it all out themselves.\nSo, two things: it’s an exciting time to be in an agency because all of the complexity enables us to see what actually worked, because we have so much data. At the core of Digitas is data and analytics. It was born to compete with the more traditional creative agencies that were just making ads for TV, and it was born on the promise of direct marketing. If I know more about you, I can think about what I should be sending to your house. \nNow, when you think about what’s happening, it’s like I can tell you, no, no, no. Your question earlier was, “Did this perform? Is my investment in YouTube performing harder than my investment in other places?” When we think about closed-loop measurement, I can pretty much start to figure out what’s working and what isn’t. So that’s pretty exciting, and if you’re okay with following the data versus wanting to put out things you think are cool, you’re in the right business. And I think that’s a change in the market where you need big ideas, but the ability to be humble to say, “Well, that didn’t work,” and we need to do something else faster.\nI do not know you, but do you feel like on the scale of quant to creative, that you are more in the quant part?\nI’m a quant. My dad was a physicist.\nOkay.\nYeah, I’m a quant. I don’t know. I grew up in finance as an analyst and in yield management. \nBut then you’re managing a lot of creative people.\nSure.\nHow does that go? Is that ever a source of friction and conflict?\nNo, because the business is really about balancing art and science. So the founder that I worked for at an agency that was eventually acquired by Omnicom, he would say, “There are people who are linear thinkers and gut thinkers. Know the difference, and you need to be able to walk right down the middle.” \nSo if you’re always leaning on the data, you may do nothing that’s very interesting perhaps, but if you’re always focused on that gut feeling of “I think this is cool,” that may not be the thing that breaks through. You have to be able to harness both to really do something that’s going to deliver breakthrough thinking and growth.\nThe nice thing about being a creator in this day and age is that you can make something and then get direct feedback from an audience very quickly, and I assume that that is also the case for the creators who work for Digitas, making things with brands. \nI wanted to ask also, so there’s Publicis and there’s Omnicom, which are two giants in this space, and there’s a ton of smaller agencies that they now have gobbled up, and they’re part of them. When you get down to it, it’s basically just two very large companies controlling a lot of this world. What else is the competition for y’all?\nThe competition is wider than what I’ll call the holding companies, or holdcos, you’ve identified. So there’s Publicis, there’s Omnicom, there’s WPP, there’s a handful of them. I think there are about six that you would look at in terms of holdcos, then there are many independents that come in with a point solution that are fantastic at creative product, or they’re fantastic at CRM, and there are many of those that may be part of a holding company or are more independent.\nWhat is the advantage of the holding company? Can you articulate?\nScale. \nSo what’s the scale advantage? Just having HR and finance?\nNo, it’s like that Reddit example because they’re a gigantic partner of ours, so I’m able to work with them because we are a scaled partner, and I’m able to make things because of that scale. That is really important.\nSo in my world, if I don’t have that and a client calls me and says, “I want sports consulting,” that is not what we do. I can say, “Great, I can call Agency X, and I’m going to bring my friends into this session. They’re trusted partners.” I brief them, it’s much faster for the client. They don’t have to worry about all the other things.\nThis is such a complicated and multifaceted world with so much expertise necessary. It sounds like it would be very difficult to compete as a smaller agency.\nYou need to be very good to compete as a small agency, and if you’re very good, you can do well because most scaled clients also have determined a partner that’s large that can do the big things like media, your media partner, so then that enables some of these smaller players to come in and out because someone else has solved the big infrastructure need in the marketing world.\nOkay, last question, maybe a bit of a biggie. So I was listening to the last time you were talking to Nilay, and you talked last year about advertising being a thing that usually runs with some other kind of media, so it runs against a YouTube video, against a TV show, against a print magazine. \nI think we’re in a transitional moment, a bit of a crisis moment for media. I think media is getting passed over by Google. Those page views aren’t coming in because there are a lot of different ways that Google is eating up that traffic. [Journalism] has had its revenue eaten by platforms like Facebook and Google; that’s been going on for decades now. So, where does advertising go when there isn’t any media left for it to be placed upon?\nEvery brand has a different version of this depending on how they-\nEvery brand, like a partner, like someone you’re partnering with?\nYeah, think of a retailer versus a packaged good brand versus a travel partner. Some of them are more dependent on paid than others. So if you’re a brand today, you have to really be thinking about how you get closer to my consumers so that I can act as a brand, as a publisher. \nSo think about certain brands that you might’ve downloaded their app, and they’re already in your phone. You already have a relationship with that brand, and therefore, I’m not as dependent on investing more dollars in Meta or Google or whoever, because I have you already. I’ve won the battle of the storefront on your phone.\nGotcha. That is a battle.\nEspecially in the world of search and AI, this is an interesting thing when you’re watching that shift. You, as a brand, really have to be the answer for something. So then I know, “Oh, this brand is the answer for this, and then how they’re going to help me be a better runner, how they’re helping me to be a better parent.” I’m not dependent on what is fed to me through search platforms, and I’m going to make that decision: “Oh, I know that this brand is going to be my brand.” \nYou’re probably thinking of certain brands you just automatically go to, and you need to be able to figure out how you’re balancing out your need for paid to basically engage with those that are your fans, and then you keep them to be your superfans.\nWhat you just described is making content, right?\nContent distribution. Brands need to be content distribution systems to be able to play within and outside.\nDo you think that the bigger part of that will be partnering with influencers and creators and stuff?\nI do.\nOr will it be themselves as the internal content creation?\nI think that creator collabs are a must for modern brands. Bringing creators in is like bringing in a series of best friends. We all follow creators who feel like they’re your friend, and then all of a sudden, you’re believing them.\nBut even that is very fractional. It’s not like there’s a Michael Jordan anymore. If you’re working with creators on Instagram… In a market that I’m super interested in, like science communicators, there might be somebody who has 100,000 or 500,000 followers that I have never heard of, and that’s my business. So it’s crazy how much work that can be, and I assume that you’ve acquired or built a big thing like that internally.\nYes. We first acquired Influential and then Captivate. This enables us to have access to 15 million creators globally. And so then that enables you to quickly find these micro-influencers or creators, whatever language you want to use. We had a lot of debate about this the last time I was on.\nYeah, actually, I wanted to ask you about that.\nYeah, my position is the same. Every time I hear it and I see a client brief, it’s wildly “is it a creator? Is it an influencer?” I would say creators don’t want to be treated as influencers, but they all really want to be Hollywood stars eventually, so it is still a very interesting, fluid space. It hasn’t changed incidentally.\n[Laughs] I’ll push back against that. So “influencer” is a big pet peeve of mine, and I have appreciated that you don’t default to that term. And I think that there are definitely people who are influencers. I think that we may use that [label] differently, though. What I hear you say, influencer tends to mean that it’s a person with a larger following.\nYes.\nIs that how you consider it?\nThat’s how I consider it, and to me, the future is collaborating with creators big and small. Your brand has to show up with a place and a point of view so that the creator feels connected to it authentically, and then you co-create what makes sense. And then the community can feed back on how I should make the next product extension. What is that thing that I should be doing? The community is fantastic at feeding your pipeline, and I think the more you have a fluid relationship with creators, the more you will be successful, because consumers see themselves in creators before they see themselves in a brand.\nAgreed, yes. This is why creators are creating brands, because it’s easier to draw the line for your audience from, “This is me to this is the thing I made,” than it is from, “This is me to this is the thing someone else made that I like.”\nYes. But then I think some creators, that’s their hope and dream is to create a brand, but also you get into supply chain dynamics and distribution.\nOh yeah, it’s hard.\nIt gets hard. It sounds great, but it’s hard.\nNo, it is. It’s not something I would have gotten into if I hadn’t had 15 years of messing around in this space before.\nOf course.\nI’ll hit you with my influencer definition, which is that the reason I don’t like it is because it defines my job as what I do for you rather than what I do for my audience. So my job isn’t to influence my audience. My job is to make things that they will like, and then I am paid to influence them by companies sometimes. \nSo my job isn’t influencer, my job is a creator, but absolutely, I see that the job that I do when someone buys a brand deal on Hank’s channel, the job that I do for that person is influencing. But the job that I do for my audience is delighting and educating and having a good time, and giving them something that they’re part of and having fun with.\nYeah, I love that distinction. I’m going to steal it.\nGreat. This is the whole reason I agreed to do this for Nilay, so that that would happen.\nI’m starting today. But I would say that one of the main reasons I stay away from using the word influencer is when I watch my daughter, who’s in college, react, she’s like, “Ugh.” She can tell.\nRight. Well, that’s the good thing, is that the people whose whole job is working for marketing companies, they’re not making very authentic content.\nRight. So I don’t love the influencer concept. I like the idea of creators informing, and again, being a brand’s best friend and saying, “Hey, maybe you should do this.” That’s how I think of creators and how I counsel our brands, and how creators are a meaningful part of almost their marketing organization, really.\nOkay, last last question. Is advertising getting easier or harder right now?\nI think it’s the same.\nOkay. That is the hottest take I could have imagined you having. Everything feels like it’s changing so much right now.\nRight, but it’s always been changing, and here’s why I think it’s the same. My orientation is around: did this drive my client’s business? So if that’s always been your orientation and you’re using the data to say: did this sell more things, did I recruit more consumers in? It’s the same. If you’re holding on to what you think it used to be, which is that we’re setting culture, everyone will do exactly what we want them to do, then it’s really hard. \nAgain, I’m a quant. The founder that I work for picked people who weren’t really marketing and advertising people, and he trained all of us to have a consulting point of view. The only thing that matters is if you’re surprising and delighting consumers and if they’re buying more things, so if that’s always been your North Star, it’s the same.\nWell, but is it not harder to get people to buy more things? I guess not. People are buying. \nSo what’s harder now is determining what the single source of truth is and how you measure that. That’s hard because there are a lot of new ways to get to that same North Star.\nDo you mean the truth in terms of the message you’re getting to consumers?\nNo. When you think about all the different data and tech partners, everyone comes in with, “It did this, it did that, it did this, it did that.” And to our previous commentary on different media partners and how they measure things, it’s not all the same, so getting to the single point of truth is hard.\nThat’s got to be so frustrating.\nThat part is hard.\nWho’s the worst at it? Who do you trust the least with their data that they show you in terms of how your answers might-\n[Laughs] I can’t. I’ll get in trouble if I answer that.\nOkay. But there’s somebody in there?\nOf course. And my thing is that you can’t trust any of them. You need a healthy, unbiased partner to look across to be able to really have the right point of view on what happened in the market. And again, sales matter. Sales are a pretty good outcome of “Did we sell more things?”\nThat’s the easy one.\nVersus brand favorability or some of these other loose things that do matter, but can be a little squishy.\nYep. Yeah, I wish there were more brand-favorable advertising in my world. I feel like I’m really sales-focused. The partners that I work with are very much like, “I don’t really care how you did. As long as we made more money than it cost us to advertise with you, that’s all we care about,” which is understandable, but sometimes I just wish I could have a big old Toyota sponsorship or something.\nWell, brands need both. You need to be thinking fast and slow, because if everything is focused on, “Buy now, do this,” then you don’t remember that brand. So you do need to create these emotional structures with consumers.\nWell, keep me in mind, that’s all I’ll say.\nI’ll keep you in mind.\nI’ve got a whole company of educational media. It’s very brand safe, good people doing interesting things. A big halo around it. You can help make the world better. Just advertise with Complexly.\nAll right. I’m into it. Send me your stuff, okay?\nOh, well, of course. All right, Amy, thank you so much. For coming on Decoder.\nAbsolutely.\nI learned so much.\nIt was great. Thanks for having me.\nQuestions or comments about this episode? Hit us up at decoder@theverge.com. We really do read every email!",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bc20e754d1dbb524199e0e7eabb6017e33117031",
      "title": "Zoom’s Eric Yuan and Emergence’s Santi Subotovsky on navigating the second act at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/zooms-eric-yuan-and-emergences-santi-subotovsky-on-navigating-the-second-act-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Zoom CEO Eric Yuan and Emergence Capital General Partner Santi Subotovsky will join the Going Public Stage at Disrupt 2025 in a session called \"What Comes After Breakout Success?.\" Join 10,000+ tech and VC leaders from October 27-29 in San Francisco.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26e28a21414cdee22f11d8c220051fd4c5871ef0",
      "title": "Andrew Hastie threatens to quit Coalition frontbench over net zero",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/andrew-hastie-threatens-to-quit-coalition-frontbench-over-net-zero",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:50:27.000Z",
      "summary_90w": "",
      "raw": "In the latest blow for Sussan Ley’s leadership, shadow home affairs minister issues ultimatum over net zero policy\n\nGet our breaking news email, free app or daily news podcast\n\nAndrew Hastie says he would quit the shadow frontbench if the Liberals remain committed to a net zero by 2050 policy, spelling more trouble for Sussan Ley as the opposition leader looks to steady a rocky ship.\nThe shadow home affairs minister and Western Australian MP claimed the Albanese government’s target to reduce emissions to net zero on 2005 levels by 2050 in an appearance is being done in “the name of climate alarmism” on ABC Radio Perth on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:37:44.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform' s American operations, according to the US treasury secretary.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "207ad0c999f105f5bfd383a842964f1b08d9245e",
      "title": "Men jailed for attempting to bewitch and kill Zambia's president",
      "url": "https://www.bbc.com/news/articles/cjr57rr9598o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:36:02.000Z",
      "summary_90w": "",
      "raw": "The pair were sentenced to two years in prison after being found with charms, including a chameleon.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7c4e12a3583d778c62453bfbfe6a9e901a2fadd",
      "title": "Amazon announces its fall hardware event",
      "url": "https://www.theverge.com/news/778008/amazon-fall-hardware-event-announced-kindles-echo-alexa",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T13:35:46.000Z",
      "summary_90w": "",
      "raw": "Amazon sent out invites to a fall hardware event for its Devices & Services division today.\t\n\nAmazon has sent out invitations to its annual fall hardware event, where it traditionally launches a slew of new products, including Echo smart speakers, Fire TV devices, Kindles, and sometimes dozens of other gadgets. The event is scheduled for Tuesday, September 30th, 2025, in New York City. \nThe invitation hints at new Kindles — possibly a color Kindle Scribe? As well as new Echo devices, indicated by a blue Alexa light. Amazon CEO Andy Jassy said earlier this year that the company would be releasing beautiful new hardware this fall. The Verge will be on the ground at the event later this month to cover all the announcements. \nAssuming they do announce new hardware, it could be the first developed entirely under Panos Panay, who left Microsoft to take over Amazon’s Devices & Services division at the end of 2023. \nPanay hosted a small, Kindle-only event in October 2024, but the company skipped its traditional big hardware event that year, instead releasing new devices, such as the Echo Show 21, a mini LED Fire TV, and a Fire TV Stick HD, more quietly over a couple of months. Panay then hosted a major, hardware-free event in February 2025, where Amazon relaunched Alexa Plus, the LLM-powered version of its voice assistant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "26d0075cfaf47c6294bbd4d12bcee4f8bf90abab",
      "title": "Tory MP and shadow minister Danny Kruger defects to Reform",
      "url": "https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T13:32:18.000Z",
      "summary_90w": "",
      "raw": "The East Wiltshire MP said the Conservatives were no longer the main party of opposition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98a71d5511b50e3bc45a8827ace99736f71a6e45",
      "title": "Conor McGregor ends bid to be Irish president",
      "url": "https://www.bbc.com/news/articles/cly9rnv54jno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:28:02.000Z",
      "summary_90w": "",
      "raw": "The MMA fighter says the decision comes after \"careful reflection\" and consultation with his family.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald’s Trump trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fe915159121b9ae3728fe6ccf3c677f50db91f8",
      "title": "US, China reach ‘framework’ deal for TikTok",
      "url": "https://techcrunch.com/2025/09/15/us-china-reach-framework-deal-for-tiktok/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T13:24:49.000Z",
      "summary_90w": "",
      "raw": "The \"framework\" deal with China is\n\"between two private parties, but the commercial terms have been agreed upon,\" CNBC quoted Bessent as saying on the sidelines of a meeting between the two countries in Madrid on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "64818ba30a0c60188e0771285de8c2e100c0665f",
      "title": "China accuses Nvidia of violating anti-monopoly laws",
      "url": "https://www.bbc.com/news/articles/cj9zedgkm21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:24:39.000Z",
      "summary_90w": "",
      "raw": "The accusation comes as the US and China hold talks to de-escalate the trade war between the two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ad9214823cfd04c43105d40546694c877a121a8",
      "title": "Trump says Venezuela 'sending drugs, gang members' as tensions rise",
      "url": "https://www.bbc.com/news/articles/cx2jel4gyezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:15:21.000Z",
      "summary_90w": "",
      "raw": "Tension has been running high between the two countries since the US deployed war ships to the South Caribbean.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caeb16e649da1805e48e2c71fea5955e01b1a51d",
      "title": "India's top court suspends parts of contentious Muslim property law",
      "url": "https://www.bbc.com/news/articles/cgq4vx2l45no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T13:04:20.000Z",
      "summary_90w": "",
      "raw": "The court refused to strike down the entire law saying \"the grant of stay is only in the rarest of rare category\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65112a70f844bafb81168f59c51b4fc49c494209",
      "title": "Battling for the lead at an IRL version of Mario Kart",
      "url": "https://www.theverge.com/games/777737/rpm-raceway-kart-klash-mario-kart-irl",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T13:01:24.000Z",
      "summary_90w": "",
      "raw": "When it comes to mainstream gaming appeal, it's hard to beat Mario Kart. Break out some controllers at a party and you'll likely get a grid full of eager racers. The game's seamless way of balancing disparate levels of skill and aggression creates an addictive experience for just about everyone.\nReal-world karting, on the other hand, remains more of a niche affair. Sure, plenty of people race karts at theme parks and putt-putt parking lots, but this style of racing isn't on the radar for your average group of friends looking for a Friday diversion.\nWhat if you could do Mario Kart IRL without risking life and limb at some questionably safe  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dec7884f4a8c5e7d9fd304f03d8db34fd086b4e1",
      "title": "Snap OS 2.0 is a small step towards AR glasses you might actually wear",
      "url": "https://www.theverge.com/gadgets/777810/snap-os-2-spectacles-software-browser-spotlight-gallery",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Snap’s 2024 Spectacles are still only available to developers.\t\n\nLast September, Snap revealed its fifth-generation Spectacles, upgraded AR glasses with a twist: they were only ever released to developers. One year later, we still haven't seen even a glimpse of the consumer-ready version of those glasses, which the company still says is coming in 2026, but Snap is ready to show off Snap OS 2.0, a software update to those developer Spectacles that signals its plans for mainstream AR.\nThe big changes are actually surprisingly boring. A better web browser, a gallery app, some translation tools. These aren't the fun, whimsical AR experiences that Snap has pushed in the past - they're the functional things, t …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bcd7a6ccc5a9b3f06b02a35b54ad3c88ae20ce6f",
      "title": "Spotify will now let free users pick and play tracks",
      "url": "https://techcrunch.com/2025/09/15/spotify-will-now-let-free-users-pick-and-play-tracks/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Spotify is adding new features for free customers that let them pick and play tracks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9f6c188c3c6df24a1bb5f0700dca1536c6b6e4d6",
      "title": "Your iPhone is about to look way different",
      "url": "https://www.theverge.com/apple-ios/777383/iphone-ios-26-liquid-glass-redesign-look",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Apple’s latest major iPhone update, iOS 26, releases today, and it has a new design language that gives just about everything on your iPhone a new look.\nApple calls the design “Liquid Glass,” and it means that a lot of things on your iPhone will now have a glassy sheen. The edges of app icons look like they’re carved out of a chunk of glass. When you press and hold on text to get a closer look at it, a glass-like bulb will magnify what you’re looking at. As you’re scrolling websites in Safari, you’ll see content slide under the translucent search bar and back button. Clear notifications float in on your homescreen and while you’re browsing your phone. The edges of your app dock and the buttons in Control Center even catch light differently based on the way you hold your phone.  \nCheck out this gallery to get an idea of some of the ways that Liquid Glass shows up in iOS 26.\nIt all feels very Apple: a bold new design that looks splashy and fancy and is suddenly everywhere on your phone. But it might also be pretty jarring when you first start using it. Ever since iOS 7 — this new update would have been iOS 19 had Apple not jumped all the way to 26 — things on your iPhone have generally looked pretty flat. Liquid Glass adds a little bit of virtual texture, and while the translucency can be an impressive visual effect, it takes getting used to for your day-to-day activities.\nInitially, Liquid Glass had a few major legibility problems, and throughout many betas, Apple has tinkered with many elements of the OS. And once the software is officially rolled out to everyone, I imagine Apple will tweak things even further in response to broader opinions and critiques.\nI’ve been living with Liquid Glass on my primary iPhone since it was announced three months ago, and I’ve gotten used to it. It’s fine. Even though iOS 26 makes things look way different, your iPhone, for the most part, will still work the same as it did on iOS 18.\nI’m sure a lot of people are going to say the design is Liquid Ass, and I’m sure Apple will tweak elements of it in response to the criticisms, like it did over the course of the iOS 26 betas. But Apple seems committed to Liquid Glass — it’s showing up across Apple’s other products today, too — so like it or not, you might just have to find a way to get used to it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb9461a9d90ab7f659bb07f3d15350d6fe1d9d53",
      "title": "Spain’s PM calls for Israel to be banned from sports events after Gaza protests force end to Vuelta race",
      "url": "https://www.theguardian.com/world/2025/sep/15/spains-pm-criticised-after-vuelta-a-espana-race-abandoned-over-pro-palestinian-protests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T12:12:22.000Z",
      "summary_90w": "",
      "raw": "Speaking after Gaza protesters forced early end to cycle race, Pedro Sánchez says Israel should not be allowed to use sports to ‘whitewash’ its ‘barbarism’\nSpain’s prime minister, Pedro Sánchez, has called for Israel to be barred from international sports competitions for as long as its “barbarism” in Gaza continues, saying the country should not be allowed to use high-profile events to “whitewash” its offensive.\nSpeaking a day after pro-Palestinian demonstrators forced a premature end to the Vuelta a España cycle race amid chaotic scenes and clashes with police, Sánchez said he had “a deep admiration” for all those who had protested peacefully against the participation of the Israel-Premier Tech team.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7bf3c8b266fba79077bb08a728d39e60b75e664",
      "title": "Prince Harry says his 'conscience is clear' over Royal revelations",
      "url": "https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T12:12:12.000Z",
      "summary_90w": "",
      "raw": "The Duke of Sussex spoke to the Guardian about his family and the upcoming Associated Newspapers case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "beaf932ca3925c4b196e45c6d04160baef92439d",
      "title": "Harvard Law to AI: MarqVision lands $48M to combat brand abuse",
      "url": "https://techcrunch.com/2025/09/15/harvard-law-to-ai-marqvision-lands-48m-to-combat-brand-abuse/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T12:00:00.000Z",
      "summary_90w": "",
      "raw": "This LA-based startup raised $48M to tackle brand abuse",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "17fd6e7987226a3829b516ca050181fdbfd3dea7",
      "title": "South Korea to review possible human rights violations in US raid on workers",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/south-korea-to-review-possible-human-rights-violation-after-us-raid-on-workers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T11:53:30.000Z",
      "summary_90w": "",
      "raw": "Lee Jae Myung says ‘bewildering’ incident may scare off future investment after Ice detained about 475 people\n\nUS politics live – latest updates\n\nSouth Korea’s government has said it will launch an investigation into whether human rights violations were committed when hundreds of its citizens were detained in a US immigration raid.\nAbout 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory in the US state of Georgia on 4 September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a4792745f1377b58dc7496c2a0346f9fda5768c",
      "title": "UK and US unveil nuclear energy deal ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T11:20:33.000Z",
      "summary_90w": "",
      "raw": "Key among the plans is a proposal to build up to 12 advanced modular nuclear reactors in Hartlepool.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f78b54253d79365a7019d02bad9f7d7378af5cce",
      "title": "Indian billionaire family's private zoo cleared of 'foul play'",
      "url": "https://www.bbc.com/news/articles/c147kzpy113o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T11:15:21.000Z",
      "summary_90w": "",
      "raw": "India's top court had formed a special team to investigate allegations that animals were mistreated at Vantara.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8511e1812223ede424a8d13a1bea855d3ef0439e",
      "title": "Final stage of Vuelta abandoned because of protests",
      "url": "https://www.bbc.com/sport/cycling/articles/crl5dele2wro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T11:08:36.000Z",
      "summary_90w": "",
      "raw": "The final stage of the Vuelta a Espana is abandoned after pro-Palestinian protesters enter the course in the centre of Madrid.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879dadf80061e3cff277e6fa1ea9b58dcdab064b",
      "title": "To save its rare birds, New Zealand is relying on a nation of backyard trappers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5508920/birds-new-zealand-conservation-invasive-species-predators-eradication",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T11:00:00.000Z",
      "summary_90w": "",
      "raw": "New Zealand's unique birds are at risk of extinction, like the kiwi. So the country is trying to eradicate the invasive species that prey on them. Everyday people are lining up to help.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "309d58f696e0d3f8fcb2e94ff377a3f8a6dfb0f5",
      "title": "Charges dropped against two men accused of spying for China",
      "url": "https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:51:45.000Z",
      "summary_90w": "",
      "raw": "Christopher Cash, 30, and Christopher Berry, 33, had previously denied the allegations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "67f7f463240fe96584bf63b0b10553d17a536cb5",
      "title": "'I'm just a mixed-race kid from flats in Kirkby', says Stephen Graham in acceptance speech",
      "url": "https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:44:43.000Z",
      "summary_90w": "",
      "raw": "Stephen Graham is emotional as he accepts an Emmy award for his role in the hit series Adolescence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f1a57b933a7bdf0fb3758e3a226f9dd3b801a63",
      "title": "What we know about the suspect arrested in Charlie Kirk's killing. And, Emmy takeaways",
      "url": "https://www.npr.org/2025/09/15/g-s1-88848/up-first-newsletter-charlie-kirk-shooting-investigation-middle-east-meetings-emmys-recap",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T10:42:32.000Z",
      "summary_90w": "",
      "raw": "Authorities say the suspect in the Charlie Kirk murder investigation is not cooperating. However, the people around him are. Here's what we know. And, takeaways from the 2025 Emmys.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "25ad518d772bd54de3d167ff70a9ace9258d1f60",
      "title": "Strong winds and rain sweep across UK ",
      "url": "https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:08:41.000Z",
      "summary_90w": "",
      "raw": "There is a chance of travel disruption on Monday as wind and rain batter UK with a Met Office yellow warning for England and Wales.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57e08730e5c0ccf9cd1d6e3a65b55c9420525164",
      "title": "Ricky Hatton's family pay tribute, saying his heart was as big as his smile",
      "url": "https://www.bbc.com/sport/boxing/articles/cvg9q28l49no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:04:40.000Z",
      "summary_90w": "",
      "raw": "Ricky Hatton's family pay tribute to the former world champion, who was found dead at the age of 46 at his home in Manchester on Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92da274d7844b9a86cdf639a950e468463f02630",
      "title": "Human rights commissioner blasts Queensland government’s ‘hostile’ approach to First Nations people",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/human-rights-commissioner-blasts-queensland-government-hostile-approach-first-nations-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:36:42.000Z",
      "summary_90w": "",
      "raw": "Scott McDougall uses speech at parliament to warn the LNP is ‘walking us backwards’ on reconciliation as he prepares to exit role\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland’s human rights commissioner has blasted the state government’s “hostile”, “assimilationist” approach to First Nations people in a speech at Parliament House.\nScott McDougall, Queensland’s first-ever human rights commissioner, has consistently criticised both sides of politics over a range of issues, particularly the state’s youth law and order crackdown. His seven-year term in the role comes to an end next month.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e665ec773bbb259ec25a2513e1bd9fb2925d298b",
      "title": "Bali battles worst floods in more than a decade",
      "url": "https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:18:22.000Z",
      "summary_90w": "",
      "raw": "At least 17 dead as torrential downpours trigger landslides, while heavy rain lashes India, Pakistan and Australia\nAt least 17 people have been confirmed dead in Bali, Indonesia, after the island’s worst flooding in more than a decade.\nTorrential rain last Tuesday and Wednesday triggered widespread flooding and landslides, leaving a trail of destruction. Eight victims were found in Denpasar, the island’s capital, and rescue teams continue to search for several others who remain missing.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485a887f48deb1e5fbf1f88873cd6a4773a67618",
      "title": "Conor McGregor pulls out of Ireland’s presidential race",
      "url": "https://www.theguardian.com/world/2025/sep/15/conor-mcgregor-pulls-out-of-ireland-presidential-race",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:02:23.000Z",
      "summary_90w": "",
      "raw": "Former mixed martial arts fighter had vowed to curb immigration to shore up ‘Irish culture’ and give power ‘back to the people’\nThe former mixed martial arts fighter Conor McGregor has withdrawn from Ireland’s presidential election and complained that nomination rules were a “straitjacket” that prevented a true democratic contest.\n“Following careful reflection, and after consulting with my family, I am withdrawing my candidacy from this presidential race,” he posted on X on Monday morning. “This was not an easy decision, but it is the right one at this moment in time.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44a6d52d970d412aeba42e2da31ae9f78fc059af",
      "title": "A record number of congressional lawmakers aren't running for reelection in 2026. Here's the list",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534254/house-senate-retirement-tracker-2026",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR is tracking the record number of lawmakers in Congress who have already announced they don't plan to run for reelection ahead of the 2026 midterms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c76900fcf4ad49a2cb21c40c28f407a88e630ae6",
      "title": "A Utah church embarks on a healing journey in the aftermath of the Kirk assassination",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5541417/orem-utah-church-healing-charlie-kirk-assassination",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A church in Orem, Utah, the city where Charlie Kirk was killed, brings healing during its Sunday service. \"We're going to be navigating this as a community and as a church family for months to come.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db8b03e9757119836a6a0bf393b3b5bdbf922ef9",
      "title": "Democrats will 'either adapt or die' as strategists push them onto new platforms",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5484125/democrats-social-media-strategy-influencers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Prominent Democratic lawmakers and influencers are encouraging their fellow Democrats to embrace social media and online video to reach voters or risk being left behind.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "682f7fde67ac0b0c1fe241c4bb3ae3c40d37e492",
      "title": "Is it the magnesium or the massage? The facts about magnesium lotion for sleep",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5529375/magnesium-lotion-massage-sleep",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Social media influencers claim that using lotion with magnesium promotes sleep. But there's little evidence magnesium taken in this way is effective.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18e6666c8d85f6ac89abcc97a5f43729e644b6ff",
      "title": "Melting glaciers mean an uncertain future for Europe's rivers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5535161/europe-melting-glaciers-switzerland-alps",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Europe is warming faster than any continent. That's speeding up glacial melt, which is already threatening Europe's largest rivers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1486f9b96cae2b5e1f2628c86cd4f178799ed5be",
      "title": "Trump, fascinated by the royals, gets a rare second U.K. state visit",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5507253/trump-royals-uk-state-visit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump has long expressed fascination with the royal family. The U.K. government will tap into that this week during a state visit that combines pageantry and politics.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9c6cffda714aa3cf269b6307e77264b840c9bc",
      "title": "Brazil's Lula hits back at Trump over Bolsonaro trial and tariffs",
      "url": "https://www.bbc.com/news/articles/cj3yxkkdlkvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:43:19.000Z",
      "summary_90w": "",
      "raw": "In an essay, he says Brazil's democracy and sovereignty \"are not on the table\" after clashes with the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "History-making wins and heartfelt thank yous - highlights from the ceremony in LA",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93b867dff742cdf6387083e9cfa832d6a513aee3",
      "title": "Fourteen NHS trusts' maternity care to be investigated over 'failures'",
      "url": "https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T08:15:11.000Z",
      "summary_90w": "",
      "raw": "Families impacted have criticised the review, calling it \"not fit for purpose\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b79092c60c1bbfe618292fd8c5545606d73d6ac6",
      "title": "Watch: The winning speeches - in two minutes",
      "url": "https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T07:26:45.000Z",
      "summary_90w": "",
      "raw": "Adolescence star Owen Cooper became the youngest ever male winner and The Pitt took out the top drama series award.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35622f7a132dfb266b5843968526910d80568944",
      "title": "'Killer' child car seats still on sale 10 years on",
      "url": "https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T07:24:33.000Z",
      "summary_90w": "",
      "raw": "Which? advised families to buy approved seats with a clear orange label indicating they are safe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ac3b016c4c4ec03f354aceae5c11f89e54306cd",
      "title": "Qatar hosts Arab-Islamic emergency summit over Israeli strike on Doha",
      "url": "https://www.bbc.com/news/articles/c4gk8nx5nw3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T06:49:38.000Z",
      "summary_90w": "",
      "raw": "A draft resolution reportedly says Israeli \"hostile acts\" threaten peace in the Middle East.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "773eff430307ffb0d9281068cae5b2ad338acb0a",
      "title": "Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor",
      "url": "https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T06:28:30.000Z",
      "summary_90w": "",
      "raw": "This year's Strictly contestants spill the beans on the backstage gossip ahead of the show's launch.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7695f814927e386ec1b52d72640bd14608aac66",
      "title": "Monday briefing: Israel’s bombing of Qatar threatens the fabric of Gulf security",
      "url": "https://www.theguardian.com/world/2025/sep/15/monday-briefing-israels-bombing-of-qatar-threatens-the-fabric-of-gulf-security",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T05:36:33.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: For decades, Gulf states have believed that a close relationship with US will guarantee their safety. That is no longer the case\nGood morning. Last Monday, Israel’s foreign minister, Gideon Saar, announced that his country had accepted the US ceasefire proposal to end the devastating war in Gaza. The very next day, Israel attempted to kill Hamas’s negotiating team while they were in Qatar’s capital to discuss that same proposal.\nIsrael, initially bullish about the success of the operation, has since grown more doubtful that it killed any Hamas leaders in Doha. Hamas said that while six people were killed in the bombing – including the son of Khalil al-Hayya, the deputy head of its political bureau – the top leadership including the negotiating team survived.\nUK news | Britain will “never surrender” to far-right protesters who use the English flag as cover for violence and to instil fear, Keir Starmer has said, condemning attacks against police officers and racist harassment after more than 110,000 people attended an extremist London rally.\nCrime | Christian Brueckner, prime suspect in the disappearance of Madeleine McCann, has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, Scotland Yard has said.\nUS | The Utah governor, Spencer Cox, has said 22-year-old Tyler Robinson, the man accused of killing Turning Point USA executive director Charlie Kirk, “does come from a conservative family – but his ideology was very different than his family”. Robinson was not cooperating with authorities, said Cox.\nEurope | Poland’s foreign minister has said the Russian drone incursion into Polish airspace was an attempt by the Kremlin to test Nato’s reactions by incremental escalations without prompting a full-scale response, as Romania became the second Nato country to report an incursion in a matter of days.\nTelevision | It was a full sweep for Adolescence at the Emmys, winning every award in which the show was nominated tonight. Fifteen-year-old Owen Cooper made history as the youngest ever actor to win the Emmy for best supporting actor in a limited series. Emmy awards 2025 – full list of winners\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a877d42bb9dd3d18e601613b86e8c8bab0baa5a",
      "title": "Rising seas will threaten 1.5 million Australians by 2050 - report",
      "url": "https://www.bbc.com/news/articles/c930454e77xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T05:34:24.000Z",
      "summary_90w": "",
      "raw": "Australia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7058a6bba07238fb3117743b4a60acb79a26f08e",
      "title": "Cardiff man still in prison 20 years after stealing phone",
      "url": "https://www.bbc.com/news/articles/c5yev505n5wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T05:22:17.000Z",
      "summary_90w": "",
      "raw": "Leroy Douglas' dad says his son is effectively serving a \"life sentence\" after being handed an IPP.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aa9d15bf324a05cc36d9d2de63a6f97a63046f9a",
      "title": "Prime Madeleine McCann suspect refuses Met interview before German prison release",
      "url": "https://www.theguardian.com/uk-news/2025/sep/15/prime-madeleine-mccann-suspect-refuses-met-interview-before-german-prison-release",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T05:00:57.000Z",
      "summary_90w": "",
      "raw": "Scotland Yard made formal request to interview Christian Brückner, due for release from seven-year rape sentence\nThe prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, the force has said.\nThe Met confirmed it had submitted a formal international request to question Christian Brückner, the 49-year-old German national who has long been under investigation in connection with Madeleine’s disappearance, but the suspect declined.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda56fa31f970d69ff81f2e359c87e7b9940b7a1",
      "title": "Trade war and faltering economy - five challenges facing Canada's Mark Carney",
      "url": "https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:59:38.000Z",
      "summary_90w": "",
      "raw": "From a faltering economy to high expectation from the public, parliament's return could bring challenges for Canada's new PM.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:51:12.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90bf2b02a364567b8812f5ce2202fadf23424be5",
      "title": "Filmed in a single shot: How Adolescence pulled off an Emmys sweep",
      "url": "https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T03:40:13.000Z",
      "summary_90w": "",
      "raw": "The Netflix drama, starring Owen Cooper, explored the impact of smartphones on teenagers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00a7f4307afa99ddb5d740dbe2c0be9aaed877c1",
      "title": "Adolescence star Owen Cooper makes Emmys history as youngest male winner",
      "url": "https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T03:30:53.000Z",
      "summary_90w": "",
      "raw": "The 15-year-old has become the youngest male winner in Emmys history for his role in Netflix's drama.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4aaf0b1519b1693ecda36ab19e69553918787683",
      "title": "Watch: Soda truck falls into sinkhole in Mexico City",
      "url": "https://www.bbc.com/news/videos/cj9zex1r3kjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T02:13:50.000Z",
      "summary_90w": "",
      "raw": "Initial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c194725d1ea9696b0a5c61d7eec02f2b48bc2862",
      "title": "Bobby Hart, who co-wrote 'Last Train to Clarksville' and other Monkees hits, dies",
      "url": "https://www.npr.org/2025/09/14/nx-s1-5541399/bobby-hart-monkees-dead",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T00:45:42.000Z",
      "summary_90w": "",
      "raw": "Bobby Hart teamed with Tommy Boyce on such hits as \"Last Train to Clarksville\" and \"I'm Not Your Steppin' Stone.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "812101fea2492226fe35c003b91ddef1c522d31c",
      "title": "Trump insists foreign workers are ‘welcome’ days after arrest of hundreds of South Koreans",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-foreign-workers-welcome-south-korea-arrests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T00:39:54.000Z",
      "summary_90w": "",
      "raw": "US president says he doesn’t want to ‘disincentivize investment’ after images of workers chained and handcuffed caused widespread alarm in South Korea\nPresident Donald Trump has said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platform, Trump wrote: “I don’t want to frighten off or disincentivize investment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0687931e50fcdf7d4473c13d79732d68294470f",
      "title": "In pictures: Best looks from the Emmys red carpet in LA",
      "url": "https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T00:26:06.000Z",
      "summary_90w": "",
      "raw": "Sydney Sweeney, Jenna Ortega and Selena Gomez are among the stars who posed for pictures ahead of the event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d0baf61a59e44d4ce882f4771182b6f1cbe2e92",
      "title": "Madeleine McCann suspect refuses Met Police interview",
      "url": "https://www.bbc.com/news/articles/cr5qd18y8j5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:50:42.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner is due to be released from prison in Germany on a separate offence this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f20771bc1da7b4c5b72d164b114330cdf992415",
      "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
      "url": "https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:36:44.000Z",
      "summary_90w": "",
      "raw": "Why so many corn belt Americans continue to back Trump, even while feeling economic pressure driven partly by his trade policy",
      "topics": [
        "World"
      ]
    },
    {
      "id": "403bfa1b35100d874342d1236d3f7c72bc5db77c",
      "title": "'It's just scary': In Florida, parents ponder future with fewer vaccines",
      "url": "https://www.bbc.com/news/articles/cd07jn0m2y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:25:04.000Z",
      "summary_90w": "",
      "raw": "Florida is pushing to end vaccine mandates as RFK Jr, an immunisation sceptic, remakes US vaccine policy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c736b4edfca330c869707142f35cef62163afbc1",
      "title": "Struggling with brain fog? Here's how to fix it",
      "url": "https://www.bbc.com/news/articles/c87ydw7xdxvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:22:44.000Z",
      "summary_90w": "",
      "raw": "It's common to become forgetful or mentally sluggish but there are easy ways to cut through the haze.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "875f9e36e7dab6be16dfe2731be6172d1467cd8f",
      "title": "'Everybody wants to know what's going to happen' - Summer I Turned Pretty star on the finale of the breakout TV hit",
      "url": "https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:41.000Z",
      "summary_90w": "",
      "raw": "With 25 million viewers and a passionate fandom, season three of The Summer I Turned Pretty is a global sensation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee1bcd1710b1703ad3dc17e278c8fed6eeb14c6b",
      "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
      "url": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:02.000Z",
      "summary_90w": "",
      "raw": "Young Ugandan women tell BBC they are being lured to Dubai to take part in extreme sex acts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc72e58d54b03f9ecda2b3ed493e76146c23e328",
      "title": "Why Man Utd's problem is not the system, it's the personnel",
      "url": "https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T22:47:02.000Z",
      "summary_90w": "",
      "raw": "MOTD pundit Danny Murphy explains how Manchester United's defeat by Manchester City was not down to Red Devils coach Ruben Amorim's rigid 3-4-2-1 formation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd12c04e0781a181213f7f387203dc7e0996d16a",
      "title": "'My wife died giving birth after Trump cut funding to our clinic'",
      "url": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T20:59:49.000Z",
      "summary_90w": "",
      "raw": "The BBC hears devastating accounts of Afghan mothers and babies dying after US-backed clinics shut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1243e3bb82239cdf31f9a27d929dcb7b7c1aba01",
      "title": "OpenAI board chair Bret Taylor says we’re in an AI bubble (but that’s okay)",
      "url": "https://techcrunch.com/2025/09/14/openai-board-chair-bret-taylor-says-were-in-an-ai-bubble-but-thats-okay/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T19:33:22.000Z",
      "summary_90w": "",
      "raw": "Like OpenAI CEO Sam Altman, Bret Taylor thinks we're in an AI bubble — but he doesn't sound too worried about it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "45a48bf6f5f7e507ef89dec4ef3fadf8a6bf3051",
      "title": "Guy Pearce and Annie Lennox join call to end ‘normalised horror’ for children in Gaza",
      "url": "https://www.theguardian.com/world/2025/sep/14/guy-pearce-and-annie-lennox-join-call-to-end-normalised-horror-for-children-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T19:00:41.000Z",
      "summary_90w": "",
      "raw": "Stars read Michael Rosen’s 2014 poem Don’t Mention the Children in film released by Save the Children\nGuy Pearce, Annie Lennox and Vanessa Redgrave are among the celebrities calling for an end to the “normalised horror” of children being killed in Gaza, as part of new short film.\nReleased by Save the Children and Choose Love, it features the stars reciting the words to a poem by Michael Rosen. Titled Don’t Mention the Children, the poem was written in 2014 in response to a Guardian article about the Israeli government banning a radio advert naming children killed in Gaza. It begins:\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf97b38c63fc5e47b59479ba2c495a3dda116f1e",
      "title": "Vibe coding has turned senior devs into ‘AI babysitters,’ but they say it’s worth it",
      "url": "https://techcrunch.com/2025/09/14/vibe-coding-has-turned-senior-devs-into-ai-babysitters-but-they-say-its-worth-it/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T19:00:00.000Z",
      "summary_90w": "",
      "raw": "TechCrunch spoke to experienced coders about their time using AI-generated code about what they see as the future of vibe coding.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e4b9bd1395bf24c06c4549487476441ba4949ee",
      "title": "Users turn to chatbots for spiritual guidance",
      "url": "https://techcrunch.com/2025/09/14/users-turn-to-chatbots-for-spiritual-guidance/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T18:45:26.000Z",
      "summary_90w": "",
      "raw": "At least one website claims to allow users to chat with God.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "904251f1ce2565ad2a24283cd3b0e4842bdd9db2",
      "title": "Karen Hao on the Empire of AI, AGI evangelists, and the cost of belief",
      "url": "https://techcrunch.com/2025/09/14/karen-hao-on-the-empire-of-ai-agi-evangelists-and-the-cost-of-belief/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T17:00:34.000Z",
      "summary_90w": "",
      "raw": "OpenAI’s rise isn’t just a business story — it’s an ideological one. On Equity, Karen Hao, author of Empire AI, explores how the cult of AGI has fueled a billion-dollar race, justified massive spending on compute and data, and blurred the line between mission and profit.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a46d1579e465359b7bdb94317cbfb6ef660b22a6",
      "title": "Romania becomes second Nato country to report Russian drone in its airspace",
      "url": "https://www.bbc.com/news/articles/c80g7g5rmlno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T16:41:33.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky called the incursion \"an obvious expansion of the war by Russia\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8cf7a2fc5130b7dbf152e77a41df944d4bff50b",
      "title": "iPhone 17, iPhone Air, AirPods Pro 3, and everything else announced at Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/14/iphone-17-iphone-air-airpods-pro-3-and-everything-else-announced-at-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:32:39.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what was announced at this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d255e0d51c980977f1b46f94ea14e4793540e5a",
      "title": "Rolling Stone owner Penske Media sues Google over AI summaries",
      "url": "https://techcrunch.com/2025/09/14/rolling-stone-owner-penske-media-sues-google-over-ai-summaries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:20:00.000Z",
      "summary_90w": "",
      "raw": "Penske's lawsuit accuses Google of abusing its monopoly power in search to force publishers to support AI summaries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dc0dca23aed0dfd2bcb84fd574c38952b866731",
      "title": "Via raises $492.9M in IPO, and German automakers go on the offensive",
      "url": "https://techcrunch.com/2025/09/14/via-raises-492-9m-in-ipo-and-german-automakers-go-on-the-offensive/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:05:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c3a38529f8ffb404cc8894a0ab6c5077f60f11b1",
      "title": "Rubio in Israel for talks to limit diplomatic damage over Qatar strikes",
      "url": "https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T15:47:55.000Z",
      "summary_90w": "",
      "raw": "US secretary of state says Trump ‘not happy’ about Israeli attack that targeted Hamas officials in Doha for Gaza talks\nThe US secretary of state, Marco Rubio, has held talks in Israel with Benjamin Netanyahu aimed at limiting the diplomatic damage to both countries by Israel’s attempt to assassinate Hamas leaders in Qatar, its continued demolition of Gaza, and the accelerated expansion of settlements in the occupied West Bank.\nThe Israeli prime minister took Rubio on a tour of the Western Wall, where both men placed written prayers between the stones, before taking his American visitor underground to view archeological excavations.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2c598731d08b8a2c67883fcf9179abfff61f7e0",
      "title": "‘Selling coffee beans to Starbucks’ – how the AI boom could leave AI’s biggest companies behind",
      "url": "https://techcrunch.com/2025/09/14/selling-coffee-beans-to-starbucks-how-the-ai-boom-could-leave-ais-biggest-companies-behind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The competitive landscape of AI is changing in ways that undermine the advantages of the biggest AI labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e9c42ec2b7533e4dc9e060e2bdf6b91f36c40f4d",
      "title": "Zulu king challenges professor to stick fight",
      "url": "https://www.bbc.com/news/articles/c99gpg3jk80o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T13:23:10.000Z",
      "summary_90w": "",
      "raw": "Prof Musa Xulu tells the BBC he has received threats from hired assassins and has complained to the police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b7c164c4b8785b976a68aecf85502cf20773c708",
      "title": "Hermeto Pascoal, 'the wizard' of Brazilian music, dies at 89",
      "url": "https://www.bbc.com/news/articles/c98dgd2n5y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T12:30:19.000Z",
      "summary_90w": "",
      "raw": "Pascoal - famed for his blend of jazz and traditional music - wrote more than 2,000 instrumental pieces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7261f147f8155fbd6705a2f449556f093a156cc7",
      "title": "Medics in southern Gaza sound alarm over wave of newly displaced Palestinians",
      "url": "https://www.theguardian.com/world/2025/sep/14/southern-gaza-nasser-medics-displaced-palestinians-fleeing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T11:59:44.000Z",
      "summary_90w": "",
      "raw": "Doctors at Nasser medical complex say it will not be able to cope with large numbers of people fleeing Gaza City\nDoctors and medical staff at the largest hospital still functioning in Gaza say they will be overwhelmed by a wave of new wounded and sick patients if hundreds of thousands of Palestinians flee the north of the devastated territory in the face of an intensifying Israeli offensive.\nDr Mohammed Saqr, the director of nursing at the Nasser medical complex near Khan Younis, in the south of Gaza, said there were not enough staff to cope with even existing demand and that supplies of medicine and fuel were running low.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "499677522d068ec7dc5507989b39afd8fe89ac28",
      "title": "Pot breaks as Nigerian chef attempts to cook largest jollof rice dish",
      "url": "https://www.bbc.com/news/articles/c306m1j542po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T11:17:32.000Z",
      "summary_90w": "",
      "raw": "Hilda Baci and a team of assistants took nine hours to complete the popular West African dish.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c32da42e9fdeae0a4b31d8d24406bc6fadbbb59",
      "title": "Brazilian musician identified as victim of 1976 killing by Argentina military",
      "url": "https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T09:00:29.000Z",
      "summary_90w": "",
      "raw": "The bossa nova pianist Francisco Tenório Cerqueira Júnior went out for cigarettes after a concert in Buenos Aires – a forensic team has finally revealed his fate\nEarly on 18 March 1976, Francisco Tenório Cerqueira Júnior, a Brazilian pianist who had played alongside some of Latin America’s greatest musicians, disappeared from the streets of Buenos Aires.\nFor nearly 50 years, his fate has remained a mystery, sparking desperate searches, raising suspicions of government complicity, and inspiring international documentaries. Now the mystery has been solved, with forensic scientists formally identifying Tenório Júnior’s body – and confirming he was a victim of Argentina’s bloody dictatorship.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29c76de62f0c102c9d13a35815ef97261ffeb4d",
      "title": "Nepal's interim PM to hand over power within six months",
      "url": "https://www.bbc.com/news/articles/cp8wjz90z4no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T08:48:42.000Z",
      "summary_90w": "",
      "raw": "Sushila Karki said the government must heed protesters' demands for \"an end to corruption, good governance and economic equality\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c1f97911443d84721b26e55c9c27fa85500af2b",
      "title": "Chinese carmakers told to improve locking devices for UK market",
      "url": "https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T06:00:26.000Z",
      "summary_90w": "",
      "raw": "UK insurers require critical modifications for sale in country with higher levels of car theft than China\nBritish authorities may have certain concerns about the cyber-spying threat from vehicles made in China, but it turns out the country’s manufacturers have security worries of their own.\nInsurers have told Chinese carmakers they need critical modifications for vehicles on British streets: namely, tougher locking devices to make them harder to steal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73259b095d6d5210f90fba0eac436963f2ba28ac",
      "title": "'We knew the family': Utah town in disbelief after local resident accused of killing Charlie Kirk",
      "url": "https://www.bbc.com/news/articles/czew1nz17rro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:39:57.000Z",
      "summary_90w": "",
      "raw": "Tyler Robinson is accused of killing Charlie Kirk during an open-air speaking event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf87dacabbd7c88b7a4526ff5ddb23e836521f3c",
      "title": "Trump administration launches trial program to fast-track electric air taxis",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540722/faa-air-taxi-pilot-program",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T23:38:26.000Z",
      "summary_90w": "",
      "raw": "The FAA is seeking proposals for projects that will include piloted and unmanned operations with a focus on electric air taxis, also called an electric vertical takeoff and landing aircraft.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dd6ceb3988caed3aec42c88cbb7419d2377cf3aa",
      "title": "UN condemns reported Haitian village massacre by armed gangs",
      "url": "https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T22:26:51.000Z",
      "summary_90w": "",
      "raw": "Fishing village of Labodrie reportedly set on fire after killing of a gang leader in sign of rising violence outside capital\nThe UN secretary-general has condemned the reported killing of at least 40 people during an attack by armed gangs in a fishing village north of Haiti’s capital.\nMedia in Haiti widely reported that the attack took place on Thursday night in Labodrie. It is another sign of escalating gang violence that has spread outside the capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc55c8fb5db1f0f461db1f2d570226dd6fc4e13a",
      "title": "Tesla board chair calls debate over Elon Musk’s $1T pay package ‘a little bit weird’",
      "url": "https://techcrunch.com/2025/09/13/tesla-board-chair-calls-debate-over-elon-musks-1t-pay-package-a-little-bit-weird/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T21:33:34.000Z",
      "summary_90w": "",
      "raw": "Tesla's board chair is defending a proposed 10-year, $1 trillion compensation package for CEO Elon Musk.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf1875224740bc86f0fd3ee4e15b2da23e85d79d",
      "title": "Workers taken to hospital after FBI uses furnace to burn seized meth",
      "url": "https://www.bbc.com/news/articles/cly7wzp23lpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T20:22:03.000Z",
      "summary_90w": "",
      "raw": "Fourteen staff were hospitalised and 75 cats and dogs evacuated.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db6fb4e100a8587a10354226fa8af622dde02f46",
      "title": "Mexican congressional staffer resigns after TV comments about Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T19:59:09.000Z",
      "summary_90w": "",
      "raw": "News network Milenio releases public apology after US deputy secretary of state threatens to revoke Mexican visas\nA congressional staffer from Mexico’s ruling party has resigned after being called out online for comments he made on a major Mexican television news program about Turning Point USA executive director Charlie Kirk’s murder.\nThe news network, Milenio, also released a public apology after the United States’ deputy secretary of state – a former ambassador to Mexico – evidently threatened to have Donald Trump’s presidential administration revoke any US visas on which it may count.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93da0a2483a6b1aedc43689592f33bc7d5e8b16f",
      "title": "Trump 'ready' to sanction Russia if Nato nations stop buying its oil",
      "url": "https://www.bbc.com/news/articles/c62zxp1y5lwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T19:46:49.000Z",
      "summary_90w": "",
      "raw": "The US president has repeatedly threatened tougher measures against Moscow, but has so far failed to take action.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71b6764f64f9c3c75e2d76b7b26a40717d0476be",
      "title": "Pilot union urges FAA to reject Rainmaker’s drone cloud-seeding plan",
      "url": "https://techcrunch.com/2025/09/13/pilot-union-urges-faa-to-reject-rainmakers-drone-cloud-seeding-plan/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T19:10:43.000Z",
      "summary_90w": "",
      "raw": "Rainmaker wants to use flares to seed clouds — the airline pilots' union says it won't be safe.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8921d87eb87f72a7e8a0ffdc872db9ed0934d73",
      "title": "California lawmakers pass AI safety bill SB 53 — but Newsom could still veto",
      "url": "https://techcrunch.com/2025/09/13/california-lawmakers-pass-ai-safety-bill-sb-53-but-newsom-could-still-veto/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T18:56:50.000Z",
      "summary_90w": "",
      "raw": "The state's landmark safety bill sets new transparency requirements for large AI companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a87619aabc325ecc5b17cbadff1d38ab6cbc762",
      "title": "FAA seeks to fine Boeing $3.1 million for safety violations, door plug blowout",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540728/boeing-faa-safety-fines-door-plug-blowout",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T17:45:16.000Z",
      "summary_90w": "",
      "raw": "The FAA said it identified hundreds of quality system violations at Boeing's 737 factory in Renton, Wash., and Boeing subcontractor Spirit AeroSystems' 737 factory in Wichita, Kan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f5177bfc966e602ff2b32da90b59e84f6061a400",
      "title": "xAI reportedly lays off 500 workers from data annotation team",
      "url": "https://techcrunch.com/2025/09/13/xai-reportedly-lays-off-500-workers-from-data-annotation-team/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T15:50:50.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's AI startup says it's shifting focus from generalist AI tutors to specialists.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4976f072389d6e6b108dd1494ba10e71543b0f3",
      "title": "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540691/fed-governor-lisa-cook-vacation-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T15:23:53.000Z",
      "summary_90w": "",
      "raw": "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d82d63a404acfec7b75d5a21bbdf5620e3991ed4",
      "title": "Here’s the tech powering ICE’s deportation crackdown ",
      "url": "https://techcrunch.com/2025/09/13/heres-the-tech-powering-ices-deportation-crackdown/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T15:00:00.000Z",
      "summary_90w": "",
      "raw": "From phone spyware and facial recognition to forensic phone hacking technology to databases and more, this tech powers Trump's deportation machine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5bcbd26d3563339deda7664541cf3d6c14d9bae",
      "title": "Hike, once a unicorn, shuts down as India cracks down on real-money gaming",
      "url": "https://techcrunch.com/2025/09/13/hike-once-a-unicorn-shuts-down-as-india-cracks-down-on-real-money-gaming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T14:05:49.000Z",
      "summary_90w": "",
      "raw": "Hike, which started as a WhatsApp rival before pivoting to real-money gaming, is now sunsetting after India's sweeping ban.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f85f0496c8d31e128ccd0fd31785fa23b9dfaf9e",
      "title": "Woman held by Taliban warns British couple 'dying' in prison",
      "url": "https://www.bbc.com/news/articles/cm28jd2enz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T07:45:03.000Z",
      "summary_90w": "",
      "raw": "Faye Hall was arrested with Peter and Barbie Reynolds in February, and released after two months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f271005f7d7cf9fd9ed25251132159288c267d72",
      "title": "Ram ends EV pickup truck plans",
      "url": "https://techcrunch.com/2025/09/12/ram-ends-ev-pickup-truck-plans/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T22:56:16.000Z",
      "summary_90w": "",
      "raw": "Stellantis, the parent company of Ram, said Friday that it will no longer develop a battery-electric full-size pickup. The company cited low demand for full-size battery-electric trucks as the primary reason.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b56e156c650fb548ddba8c7fddab2551c1b24e8",
      "title": "What's costing you more lately, and how is it affecting you? NPR wants to hear",
      "url": "https://www.npr.org/2025/09/12/g-s1-88442/cost-of-living-prices",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T22:03:20.000Z",
      "summary_90w": "",
      "raw": "The NPR Network is working on a series about the rising cost of living. We want to hear from you: What costs are going up, and how are you coping? How is it changing the way you live?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c62f31224017c8df6b4e1f818633947cd36e5ddf",
      "title": "Tipper Gore, Twisted Sister and the fight to put warning labels on music",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5460888/music-parental-advisory-sticker-tipper-gore",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T17:03:34.000Z",
      "summary_90w": "",
      "raw": "40 years ago, musicians faced off against a Washington committee over whether to warn parents about explicit lyrics.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1ca38d2acdc84eff3f1b94733cc4a7018d68a94e",
      "title": "Brazilians take to the streets to celebrate Bolsonaro conviction",
      "url": "https://www.theguardian.com/world/2025/sep/12/brazilians-take-to-the-streets-to-celebrate-bolsonaro-conviction",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T14:54:33.000Z",
      "summary_90w": "",
      "raw": "Indigenous groups and other minorities praise verdict while US officials issue warnings of possible sanctions\n• Operation World Cup: the murder plot at the heart of Brazil’s trial of the century\n• Bolsonaro sentenced to 27 years for plotting military coup in Brazil\nThousands of Brazilians have taken to the streets to rejoice at Jair Bolsonaro’s conviction for plotting a coup, as progressive politicians celebrated the historic move and rightwing figures linked to Donald Trump responded with anger and threats.\nChile’s leftwing president, Gabriel Boric, led regional congratulations of the decision to jail Bolsonaro for 27 years for leading a criminal organisation that sought to seize power after the far-right populist lost the 2022 election.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "72a8355947940444b1920079eb33fd8f7f3b024c",
      "title": "Operation World Cup: the murder plot at the heart of Brazil’s trial of the century",
      "url": "https://www.theguardian.com/world/2025/sep/12/operation-world-cup-the-plot-at-the-heart-of-brazils-jair-bolsonaro-trial-of-the-century",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T12:32:28.000Z",
      "summary_90w": "",
      "raw": "Intricate plan to murder top judge, president- and vice-president elect was central to Jair Bolsonaro coup hopes\nThe conspirators used codenames to conceal their identities as they prepared for their mission: to plunge Brazil into chaos by assassinating a celebrity supreme court judge called Alexandre de Moraes.\nOn an encrypted messaging group, one plotter used the alias Brazil, another Japan and a third Austria.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c138099a2a36320e916a93ada7834aa80418ab5",
      "title": "Why mothers in the U.S. are scaling back on their work lives",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5537129/why-mothers-in-the-u-s-are-scaling-back-on-their-work-lives",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:02:37.000Z",
      "summary_90w": "",
      "raw": "Workforce participation for moms in the U.S. has been dropping for most of this year, and the reasons are more complicated than return-to-office mandates. The team from \"The Indicator\" explains why.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "854280c8db3007021237029f2f114f05856ba3e2",
      "title": "Health care costs are soaring. Blame insurers, drug companies — and your employer",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5534416/health-care-costs-soaring-blame-your-employer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Some 154 million people in the United States get health care through their employer — and for many, their costs are about to go way up.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}