{
  "version": "1756992526457",
  "generatedAt": "2025-09-04T13:28:46.457Z",
  "items": [
    {
      "id": "0f70db8aaa60892eb27ed70aa2af0a3ad3b6b987",
      "title": "Fifteen hospitalised as London bus mounts pavement",
      "url": "https://www.bbc.com/news/articles/c79vwrxn47eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T13:12:20.000Z",
      "summary_90w": "",
      "raw": "A bus driver is one of 17 people injured after the crash near Victoria Station in central London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32f54c95784ba164002ef372212e16d838b60737",
      "title": "Macron says ‘Coalition of the Willing’ will finalise ‘robust’ Ukrainian security guarantees – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/04/ukraine-russia-security-guarantees-coalition-of-the-willing-paris-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T13:05:05.000Z",
      "summary_90w": "",
      "raw": "Leaders who are gathered in Paris are expected to speak to Donald Trump this afternoon\nThe Dutch prime minister Dick Schoof is next.\nBelgium’s Bart de Wever, Finland’s Alexander Stubb, and the EU’s Ursula von der Leyen and António Costa are the first leaders arriving at the Élysée Palace, welcomed by Macron on the doorstep.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43a510a5e4ece7d79d7ae484a903b561c1684c17",
      "title": "Adobe to bring its video editing app Premiere to iPhones",
      "url": "https://techcrunch.com/2025/09/04/adobe-plans-to-bring-its-video-editing-app-premiere-to-iphones/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Adobe is planning to bring its video editing software Premiere to the iPhone. The company has listed the app on the App Store with a pre-order link and an expected release date of September 30.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "103503113876832585f0f57cda2dffcbf3e5ad17",
      "title": "Adobe’s Premiere video editor is coming to iPhone for free",
      "url": "https://www.theverge.com/news/771236/adobe-premiere-iphone-ios-video-editor-android",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Adobe is bringing its video editor Premiere to iPhone, promising “pro-level” editing on the go for free. The app will launch later this month, with an Android version also under development.\nThe Premiere app features a familiar multi-track timeline, with support for an unlimited number of video, audio, and text layers. There’s automatic captioning, 4K HDR support, and one-tap exporting to TikTok, YouTube Shorts, and Instagram — including automatic resizing that frames content for each platform.\nThe iOS version of Premiere will be free to download and use, though Adobe says there will be charges for additional cloud storage and generative AI credits. Speaking of, it includes support for Adobe’s generative sound effects and AI-powered speech enhancement, plus a wider range of AI assets generated through Adobe Firefly. If you’d rather not use AI content, there’s a selection of Adobe fonts, along with images, sounds, music, and video assets that are free to use.\nUntil now Adobe has only offered Premiere Rush on mobile, a simplified version of its video editor. The new Premiere promises something a little closer to the full Premiere Pro according to Mike Polner, vice president of creator product marketing, putting “pro-level creative control in your hands, without the pro-level complexity.”\n“With Premiere on iPhone, we’re bringing that same creative power that filmmakers, designers, animators, and YouTube creators use to produce hit commercials, iconic music videos, Oscar-winning films, and viral content to the most convenient place to move from capture to publish: your phone.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37c1051a7500147e1a07e26eddc4ff7e28b8a425",
      "title": "Here is Lego’s $1,000 Death Star, the most expensive Lego set ever",
      "url": "https://www.theverge.com/news/770770/lego-ucs-death-star-price-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Eight years after breaking every record with an $800, 7,541-piece Star Wars Millennium Falcon, the Lego Group is introducing its first $1,000 set.\nIt’s an intricately detailed Death Star nearly two feet tall (52.3cm), a foot and a half wide (48cm) and over a foot (38.3cm) deep, with enough compartments to re-enact nearly every iconic Death Star scene from Star Wars and Return of the Jedi. \nWe’ve never seen a Lego set anywhere near this expensive. When the $999.99, €999.99 or £899.99 price and images leaked in July, many wondered how the Lego Group could possibly justify such a price for plastic toys!\nWell, I’m here to tell you the company has been doing better than ever — record revenue and record profits outpacing the whole toy industry — ever since it started catering to nostalgic, deep pocketed adults and letting its prices and piece counts climb.\n“$850 Millennium Falcons and $680 Titanics: Grown-Ups Are Now a Gold Mine for Lego,” The Wall Street Journal wrote last year. “Lego bricks have won over adults, growing its $10 billion toy market foothold,” added Fortune, writing that roughly 15 percent of Lego’s sets are aimed at adults. In my experience, that isn’t just because adults like to play with minifigs. Building is a relaxing diversion, a way to de-stress, and then you have a piece of home decor and a sense of accomplishment when you’re done.\nBut whether you’re looking for decor or a playset, this Death Star looks like an incredible one. \nInstead of offering a spherical Death Star like earlier, blockier playsets, the new Ultimate Collectors Series (UCS) Death Star is a vertical slice, a diorama set like the Batcave Shadowbox that can live on a shelf with all rooms visible at once.\n\nAlmost every iconic scene is accounted for here, from the hangar bay where Darth Vader and a squad of stormtroopers can greet the Emperor arriving in the included Imperial Shuttle, to the detention block AA-23 shootout and escape, to the garbage compactor scare, to the comms room where R2-D2 and C-3PO wait and helpfully shut that compactor down.\nMeanwhile, Vader can find a disturbing lack of faith in the conference room, Obi-Wan Kenobi can go tackle the tractor beam, while Luke and Leia swing across the chasm overhead; you get superlaser targeting and control rooms for Leia to give up Dantooine, and a turbolift to take minifigs to each of six different levels. Then, Luke can have his Return of the Jedi showdown with Vader and the Emperor and his Red Guards in his throne room at the end.\n\n\n\n\n\n\n\n\nLuke and Han can also be multiple places simultaneously: the 38 minifigures include both “aren’t you a little short for a Stormtrooper” and Return of the Jedi versions of Luke as well as his original outfit, plus Stormtrooper and traditional vest versions of Han. Lego says there’s even a stormtrooper in a hot tub as an easter egg.\nAs excited as I am, I’m afraid it’s too rich for my blood, but I won’t echo some complaints that Lego isn’t even giving us a full spherical Death Star for $1,000. \nI would prefer it this way, if it didn’t cost so much — because unlike the $850 Millennium Falcon, I could actually fit it in my home. Even though there isn’t enough room inside the hangar bay for a minifig-scale Millennium Falcon, or a full platoon of Stormtroopers, I can place them right next to this set and imagine they’re enclosed within — just like I’d imagine the rest of the Death Star’s reactor shaft after I send the Emperor over the railing to his doom.\nThe UCS Death Star will go up for sale on October 1st for Lego Insiders (it’s a free signup) or October 4th for everyone else. There’s a chance for Lego Insiders to win one starting today by spending 50 rewards points, and there’s a “while supplies last” promo gift for the first buyers: a “set with a Tie Fighter with Imperial Hanger Rack.”\nThe Death Star isn’t the biggest Lego set ever made — that’s the Art World Map or the Eiffel Tower or the Titanic, depending on how you measure — but it does have the most mini-figs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d16e50e5d7882117d5b55d53cf7ad5d5c7c9ac34",
      "title": "Here’s how the Pixel’s AI zoom compares to a real 100x lens",
      "url": "https://www.theverge.com/tech/769360/google-pixel-10-pro-res-zoom-100x-sample-photos-nikon-coolpix-p1100",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Optical zoom takes on generative AI.\t\n\nIn case you missed it last week among other big news items, Google shipped a phone camera with a zoom feature that uses generative AI. That's right: the Pixel 10 Pro comes with AI right inside the camera app that cleans up otherwise crappy digital zoom images all the way up to 100x. It's a what-is-a-photo nightmare, but it's also pretty good - at least it seems to be. But it's hard to be completely sure what the thing you're photographing is supposed to look like when it's miles away. So I brought in a ringer for some side-by-side comparisons: the Nikon Coolpix P1100.\nFor those unfamiliar, the P1100 is a massive ultrazoom camera with an equ …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd6572948ce247e4840a9b16de600d712350fb50",
      "title": "LinkedIn takes on hiring scams with recruiter verification",
      "url": "https://www.theverge.com/news/771210/linkedin-recruiter-executive-verification-mandatory",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "LinkedIn is trying to help put a stop to recruitment scams by requiring anyone with a recruitment-related job title to verify their place of employment. Executives will have to go through the same process, while company page verification is now rolling out more widely too.\nExisting recruiters won’t need to go through verification immediately, but anyone who adds or updates their job title to something related to recruitment, such as “Recruiter” or “Talent Acquisition Specialist,” will need to verify themselves. Expect to see scammers adopting off-beat job titles that aren’t on LinkedIn’s list.\nVerification is free, and the simplest form only involves proving that you have a company email address. Oscar Rodriguez, LinkedIn’s vice-president of trust, wrote that the change “helps job-seekers identify legitimate recruiters and avoid scams.” LinkedIn already offers Verified recruiter labels, available to anyone with a paid LinkedIn recruiter license.\nExecutives will have to undergo the same process, with mandatory verification for job titles including “Executive Director” and “Vice President.” LinkedIn is also allowing more companies to verify their official pages on the platform. Previously limited access and only available by request, the verification badge is now open to any company with a Premium company page subscription.\nLinkedIn introduced verification in 2023, and the company says that more than 80 million users have verified themselves since then. Earlier this year it expanded verification beyond its network, allowing Adobe and other platforms to display “Verified on LinkedIn” badges on user profiles.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6f5d10086c3721b6faebad1afb4f7e5330e9d268",
      "title": "Nvidia’s RTX 5080 upgrade for GeForce Now arrives on September 10th",
      "url": "https://www.theverge.com/news/771273/nvidia-geforce-now-rtx-5080-upgrade-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Nvidia announced last month that it’s planning to upgrade its GeForce Now cloud gaming service to RTX 5080 GPUs. Now, we have a date for that upgrade: September 10th. The upgrade will allow GeForce Now subscribers to rent what’s effectively an RTX 5080 in the cloud, with a huge 48GB of memory and DLSS 4 support.\nNvidia’s RTX 5080 upgrade for GeForce Now will include support for 5K resolutions at 60fps and 120fps, or 1440p at 240fps and 1080p at 360fps. You’ll also be able to enable full ray-tracing support in games with Neural Rendering and Multi Frame Generation, all at the same $19.99 a month for GeForce Now Ultimate.\nThe reveal of the upgrade date for GeForce Now is part of Nvidia’s weekly GeForce Now announcements, which include 17 games set to be added to the service this month. Hollow Knight: Silksong arrives on GeForce Now today, with Borderlands 4, Dying Light: The Beast, Jump Space, Endless Legend 2, and Cloverpit all debuting on the streaming service later this month.\n“On Wednesday, September 10th, Nvidia Blackwell RTX is coming to GeForce Now,” says Nvidia. “To celebrate, next week’s GeForce Now announcements will come a day earlier to usher in the Blackwell era of GeForce Now.”\nNvidia is also bringing back the ability to install games on GeForce Now without waiting for Nvidia to formally curate them. This new “Install-to-Play” feature will greatly improve the GeForce Now library.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "85314e7bae70f616bd6f020d599c368ed5576491",
      "title": "Strava’s refreshed Apple Watch app adds Live Segments",
      "url": "https://www.theverge.com/news/771048/stravas-refreshed-apple-watch-app-adds-live-segments",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Apple Watch is getting an improved Strava interface and Live Segment support. | Photo by Thomas Ricker / The Verge﻿\t\n\nStrava is bringing what it calls a “cleaner and more intuitive” experience to the Apple Watch along with Live Segments. The changes are meant to address growing demand from athletes turning to Apple’s wearable, according to Strava:\nIn 2024, Strava saw a nearly 20 percent year-over-year increase in the share of device-uploading athletes using an Apple Watch, with Apple holding the top two spots for preferred devices among runners in Strava’s 2024 Year in Sport report. \nLive Segments are a Strava feature that provides real-time performance data on starred or popular sections of a route, allowing cyclists and runners to compete against themselves or others in an attempt to lay claim to King/Queen of the Mountain titles. The feature is already available on GPS-enabled watches and bike computers made by companies like Garmin, Hammerhead, Polar, and Suunto, so it’s good to see Apple finally join in on the motivational fun.\nWith the new app, athletes with an Apple Watch will be presented with a circle and banner showing the approaching segment. As they enter the segment, the circle updates in real time to reflect progress, and whether they are behind or ahead of their personal record. The results are shown at the end of the segment, before transitioning back to the standard recording screen.\n“Apple Watch has become an increasingly popular wearable for athletes on Strava,” said Strava’s chief product officer, Matt Salazar. “This investment in Apple Watch is more than just tracking a workout — it’s about delivering the real-time, game-like features athletes love to motivate them in the moment.”\nThe redesigned Strava Apple Watch app is available to download now, globally.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b470a237ca409bf5fcaa9504c826e08dbcc9cbc0",
      "title": "Who are the victims of the Lisbon funicular cable crash?",
      "url": "https://www.bbc.com/news/articles/cnvryg271ymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T12:55:42.000Z",
      "summary_90w": "",
      "raw": "A transport worker is among those killed, while a three-year-old German boy is reported to have escaped with minor injuries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b470a237ca409bf5fcaa9504c826e08dbcc9cbc0",
      "title": "Who are the victims?",
      "url": "https://www.bbc.com/news/articles/cnvryg271ymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T12:55:42.000Z",
      "summary_90w": "",
      "raw": "A transport worker is among those killed, while a three-year-old German boy is reported to have escaped with minor injuries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc4aafcd604b1f392f982da07551a1e248261761",
      "title": "Ukraine has unbreakable pledge from West with Trump's backing - Starmer",
      "url": "https://www.bbc.com/news/articles/czxwl15w2qko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T12:54:58.000Z",
      "summary_90w": "",
      "raw": "The UK prime minister tells a meeting of 30 Western countries that Russia's Vladimir Putin cannot be trusted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db39fd7efbf0280d095cea647381909ba2ac0fae",
      "title": "TCL’s fun little PlayCube projector is a Google TV concept no more",
      "url": "https://www.theverge.com/news/766615/tcls-fun-little-playcube-projector-is-a-google-tv-concept-no-more",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T12:53:24.000Z",
      "summary_90w": "",
      "raw": "PlayCube is a cross between a Rubik’s cube and TARS. | Image: TCL\t\n\nTCL is not a brand that typically elicits desire from me, yet here I am, looking at its IFA 2025 announcement of the PlayCube, wondering how a projector that pays homage to both a Rubik’s cube and TARS can fit into my life. The all-in-one Google TV projector with up to three hours of battery life — introduced as a concept in January — will be available to buy starting on September 5th. I’m just not sure it’s worth €799 (around $930), no matter how pretty it is.\nAs a long-time fan of cubes and The Verge’s resident vanlifer, TCL got my attention when it said the PlayCube was specifically designed for “camping projection.” I like that it’s Netflix-certified and that its quirky, twistable hardware lets you angle the image as needed, with built-in intelligence to automatically focus the image, avoid obstacles, align the image, and correct the keystone.\nHere’s a concept video with simulated images that show how the real projector might fit into your life.\n\nThe PlayCube measures just 5.9 x 3.8 x 3.8 inches, weighs 2.7 pounds, and features a glass lens and 1080p image lit by 750 ISO lumens — enough to create a tiny screen for casual viewing during the day and big-screen video at night. TCL says it produces less than 26 decibels of noise when running, which should easily be overcome by the projector’s lone 5W speaker or 3.5mm audio jack. Rounding out the specs are HDMI, USB, and Wi-Fi connectivity.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b62e0ae99f4392389aa544d3da745d6e25279d7f",
      "title": "Israel’s president to visit London next Thursday for expected talks with ministers",
      "url": "https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T12:52:38.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Isaac Herzog will make trip just weeks before UK is planning to recognise statehood of Palestine\nIsrael’s president will visit London next Thursday just weeks before the UK is expected to recognise the state of Palestine at the UN general assembly, the Guardian understands.\nTwo sources have confirmed Isaac Herzog is expected to meet UK ministers and senior political figures – the first time a senior Israeli leader has been in Britain since the foreign secretary, David Lammy, met his Israeli counterpart Gideon Sa’ar on an unannounced visit in the spring.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "95aa7eef53de3095540f8c0006bdb12507037d84",
      "title": "Atlassian to buy Arc developer The Browser Company for $610M",
      "url": "https://techcrunch.com/2025/09/04/atlassian-to-buy-arc-developer-the-browser-company-for-610m/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T12:45:06.000Z",
      "summary_90w": "",
      "raw": "Productivity software maker Atlassian has agreed to acquire The Browser Company, which makes the Arc and Dia browsers, for $610 million in cash.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "23f50d5dcbc345558ba51ef86120f65ebeca759d",
      "title": "William and Kate visit museum in first engagement since summer",
      "url": "https://www.bbc.com/news/articles/c7845x720y6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T12:42:21.000Z",
      "summary_90w": "",
      "raw": "The Prince and Princess of Wales have visited the Natural History Museum in London on their first official engagement since the summer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c5183fa357d289fd203d01cf6dc371bdfb285e1",
      "title": "'Erotic' Wuthering Heights revealed in film's first trailer",
      "url": "https://www.bbc.com/news/articles/c5yel29rvy8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T12:36:44.000Z",
      "summary_90w": "",
      "raw": "The trailer shows the characters engaged in longing stares, with sexualised imagery throughout.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bbac0bc7cc7a2f040f9cc2580ea5948a215fe259",
      "title": "Samsung’s Galaxy S26 series may ape the iPhone 17’s biggest design change",
      "url": "https://www.theverge.com/news/771261/samsungs-galaxy-s26-series-may-ape-the-iphone-17s-biggest-design-change",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T12:36:29.000Z",
      "summary_90w": "",
      "raw": "These could be the rough shapes of the Galaxy S26, S26 Edge, and S26 Ultra.\t\n\nAt least one phone in Samsung’s upcoming Galaxy S26 range may look a little different to what we were expecting, and a lot more like Apple’s iPhone 17 series. That’s going by a photo of dummy phones shared by leaker and journalist Sonny Dickson, who has a pretty good track record for sourcing accurate Apple and Samsung phone designs.\nDickson’s photo shows three phones, which we’re expecting to be the Galaxy S26, S26 Edge, and S26 Ultra — rumor has it that next year’s Plus model will be replaced by the follow-up to this year’s extra-thin S25 Edge. While both the S26 and S26 Ultra feature slight design changes to include a small camera island around the main lenses, the middle phone is far stranger, with a camera bump that goes all the way across the phone.\nIt’s a weird design, made a little less weird for the fact that we’ve seen something like it before: in images of the upcoming iPhone 17 range (including some shared by Dickson). We’ll find out for sure if that design is real at Apple’s iPhone launch next Tuesday, but will probably have to wait until January to see the S26 line. In the meantime, Samsung today announced the S25 FE and Tab S11.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "003feee166d17399ae52925ed11f4f9b5c48677f",
      "title": "Australia needs $530bn capital to meet 70% climate goal, Business Council claims ahead of new 2035 target",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/australia-needs-530bn-capital-to-meet-70-climate-goal-business-council-claims-ahead-of-new-2035-target",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T12:30:52.000Z",
      "summary_90w": "",
      "raw": "Modelling commissioned by lobby group comes as Climate Change Authority due to advise on new target – but does not factor in cost of inaction\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nThe Albanese government would need up to $530bn worth of capital investment and a potential curbing of coal and gas exports to achieve a 2035 emissions target of 70% or more, according to new modelling commissioned by the Business Council of Australia.\nThe Climate Change Authority – the commonwealth’s advisory body on emissions targets – is due to hand the government its recommendation on a 2035 target within days.\nSign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "650b2fea70c7b5d99d96a632e1f5b1ff79bc4757",
      "title": "How Wikipedia survives while the rest of the internet breaks",
      "url": "https://www.theverge.com/cs/features/717322/wikipedia-attacks-neutrality-history-jimmy-wales",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T12:30:04.000Z",
      "summary_90w": "",
      "raw": "When armies invade, hurricanes form, or governments fall, a Wikipedia editor will typically update the relevant articles seconds after the news breaks. So quick are editors to change “is” to “was” in cases of notable deaths that they are said to have the fastest past tense in the West. So it was unusual, according to one longtime editor who was watching the page, that on the afternoon of January 20th, 2025, hours after Elon Musk made a gesture resembling a Nazi salute at a rally following President Donald Trump’s inauguration and well into the ensuing public outcry, no one had added the incident to the encyclopedia.\nThen, just before 4PM, an editor by the name of PickleG13 added a single sentence to Musk’s 8,600-word biography: “Musk appeared to perform a Nazi salute,” citing an article in The Jerusalem Post. In a note explaining the change, the editor wrote, “This controversy will be debated, but it does appear and is being reported that Musk may have performed a Hitler salute.” Two minutes later, another editor deleted the line for violating Wikipedia’s stricter standards for unflattering information in biographies of living people.\nBut PickleG13 was correct. That evening, as the controversy over the gesture became a vortex of global attention, another editor called for an official discussion about whether it deserved to be recorded in Wikipedia. At first, the debate on the article’s “talk page,” where editors discuss changes, was much the same as the one playing out across social media and press: it was obviously a Nazi salute vs. it was an awkward wave vs. it couldn’t have been a wave, just look at the touch to his shoulder, the angle of his palm vs. he’s autistic vs. no, he’s antisemitic vs. I don’t see the biased media calling out Obama for doing a Nazi salute in this photo I found on Twitter vs. that’s just a still photo, stop gaslighting people about what they obviously saw. But slowly, through the barbs and rebuttals and corrections, the trajectory shifted.\nWikipedia is the largest compendium of human knowledge ever assembled, with more than 7 million articles in its English version, the largest and most developed of 343 language projects. Started nearly 25 years ago, the site was long mocked as a byword for the unreliability of information on the internet, yet today it is, without exaggeration, the digital world’s factual foundation. It’s what Google puts at the top of search results otherwise awash in ads and spam, what social platforms cite when they deign to correct conspiracy theories, and what AI companies scrape in their ongoing quest to get their models to stop regurgitating info-slurry — and consult with such frequency that they are straining the encyclopedia’s servers. Each day, it’s where approximately 70 million people turn for reliable information on everything from particle physics to rare Scottish sheep to the Erfurt latrine disaster of 1184, a testament both to Wikipedia’s success and to the total degradation of the rest of the internet as an information resource. \n\n“It’s basically the only place on the internet that doesn’t function as a confirmation bias machine.”\n\n\nBut as impressive as this archive is, it is the byproduct of something that today looks almost equally remarkable: strangers on the internet disagreeing on matters of existential gravity and breathtaking pettiness and, through deliberation and debate, building a common ground of consensus reality.\n“One of the things I really love about Wikipedia is it forces you to have measured, emotionless conversations with people you disagree with in the name of trying to construct the accurate narrative,” said DF Lovett, a Minnesota-based writer and marketer who mostly edits articles about local landmarks and favorite authors but later joined the salute debate to argue that “Elon Musk straight-arm gesture controversy” was a needlessly awkward description. “It’s basically the only place on the internet that doesn’t function as a confirmation bias machine,” he said, which is also why he thinks people sometimes get mad at it. Wikipedia is one of the few platforms online where tremendous computing power isn’t being deployed in the service of telling you exactly what you want to hear.\nWhether Musk had made a Nazi salute or was merely awkward, the editors decided, was not for them to say, even if they had their opinions. What was a fact, they agreed, was that on January 20th, Musk had “twice extended his right arm toward the crowd in an upward angle,” that many observers compared the gesture to a Nazi salute, and that Musk denied any meaning behind the motion. Consensus was reached. The lines were added back. Approximately 7,000 words of deliberation to settle, for a time, three sentences. This was Wikipedia’s process working as intended.\nIt was at this point that Musk himself cannonballed into the discourse, tweeting that the encyclopedia was “legacy media propaganda!”\nThis was not Musk’s first time attacking the site — that appears to have been in 2019, when he complained that it accurately described him as an early investor in Tesla rather than its founder. But recently he has taken to accusing the encyclopedia of a liberal bias, mocking it as “wokepedia,” and calling for it to be defunded. In so doing, he has joined a growing number of powerful people, groups, and governments that have made the site a target. In August, Republicans on the US House Oversight Committee sent a letter to the Wikimedia Foundation requesting information on attempts to “inject bias” into the encyclopedia and data about editors suspected of doing so.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen governments have cowed the press and flooded social platforms with viral propaganda, Wikipedia has become the next target, and a more stubborn one. Because it is edited by thousands of mostly pseudonymous volunteers around the world — and in theory, by anyone who feels like it — its contributors are difficult for any particular state to persecute. Since it’s supported by donations, there is no government funding to cut off or advertisers to boycott. And it is so popular and useful that even highly repressive governments have been hesitant to block it.\nInstead, they have developed an array of more sophisticated strategies. In Hong Kong, Russia, India, and elsewhere, government officials and state-aligned media have accused the site of ideological bias while online vigilantes harass editors. In several cases, editors have been sued, arrested, or threatened with violence.\nWhen several dozen editors gathered in San Francisco this February, many were concerned that the US could be next. The US, with its strong protections for online speech, has historically been a refuge when the encyclopedia has faced attacks elsewhere in the world. It is where the Wikimedia Foundation, the nonprofit that supports the project, is based. But the site has become a popular target for conservative media and influencers, some of whom now have positions in the Trump administration. In January, the Forward published slides from the Heritage Foundation, the think tank responsible for Project 2025, outlining a plan to reveal the identities of editors deemed antisemitic for adding information critical of Israel, a cudgel that the administration has wielded against academia. \n“It’s about creating doubt, confusion, attacking sources of trust,” an editor told the assembled group. “It came for the media and now it’s coming for Wikipedia and we need to be ready.”\nIn 1967, Hannah Arendt published an essay in The New Yorker about what she saw as an inherent conflict between politics and facts. As varieties of truth go, she wrote, facts are fragile. Unlike axioms and mathematical proofs that can be derived by anyone at any time, there is nothing necessary about the fact, to use Arendt’s example, that German troops crossed the border with Belgium on the night of August 4th, 1914, and not some other border at some other time. Like all facts, this one is established through witnesses, testimony, documents, and collective agreement about what counts as evidence — it is political, and as the propaganda machines of the 20th century showed, political power is perfectly capable of destroying it. Furthermore, they will always be tempted to, because facts represent a sort of rival power, a constraint and limit “hated by tyrants who rightly fear the competition of a coercive force they cannot monopolize,” and at risk in democracies, where they are suspiciously impervious to public opinion. Facts, in other words, don’t care about your feelings. “Unwelcome facts possess an infuriating stubbornness,” Arendt wrote.\nThis infuriating stubbornness turns out to be important, though. A lie might be more plausible or useful than a fact, but it lacks a fact’s dumb arbitrary quality of being the case for no particular reason and no matter your opinion or influence. History once rewritten can be rewritten again and becomes insubstantial. Rather than believe the lie, people stop believing anything at all, and even those in power lose their bearings. This gives facts “great resiliency” that is “oddly combined” with their fragility. Having a stubborn common ground of shared reality turns out to be a basic precondition of collective human life — of politics. Even political power seems to recognize this, Arendt wrote, when it establishes ideally impartial institutions insulated from its own influence, like the judiciary, the press, and academia, charged with producing facts according to methods other than the pure exercise of power.\n\n\n\n\n\n\n\n\n\n\nWikipedia has come to play a similar role of factual ballast to an increasingly unmoored internet, but without the same institutional authority and with its own methods developed piecemeal over the last two decades for arriving at consensus fact. How to defend it from political attacks is not straightforward. At the conference, many editors felt both that attacks from the Trump administration were a genuine threat and that being cast as “the resistance” risked jeopardizing the encyclopedia’s position of trusted neutrality.\n“I would really argue not to take the attack approach, to really take the passive approach,” said one editor when someone broached the idea of actively debunking some of the false information swamping the rest of the internet. “People see us as credible because we don’t attack, because we are just providing information to everyone all the time in a boring way. Sometimes boring is good. Boring is credible.”\nEven the editor at the summit who had been most directly affected by the Trump administration urged against a direct response. Jamie Flood had been a librarian and outreach specialist at the National Agricultural Library, where among other duties she led group trainings and uploaded research on topics like germplasm and childhood nutrition to Wikipedia. Museums and libraries around the world employ such “Wikipedians in residence” to act as liaisons with the encyclopedia’s community for the same reason that the World Health Organization partnered with Wikipedia during the covid-19 pandemic to make the latest information available: if you want research to reach the public, there is no better place.\nAlong with several other Wikipedians employed by the federal government, Flood had just been laid off by DOGE, collateral damage in a general dismantling of research and archival institutions. “I’m a casualty of this administration’s war on information,” Flood said.\n\n“‘Imagine a world where all knowledge is freely available to everyone.’”\n\n\nStill, Wikipedia absolutely should not counterattack, Flood said. “Wikipedia is always in the background. They’re not making a big statement, and I don’t think they should. I’ve been training people for a long time and I still go back to this early quote of Jimmy Wales, one of the founders: ‘Imagine a world where all knowledge is freely available to everyone.’ That’s enough. That’s a statement in and of itself. In a time of misinformation, in a time of suppression, having this place where people can come and bring knowledge and share knowledge, that is a statement.”\nWikipedia should be, in other words, as stubborn as a fact. But then, facts are fragile things. \nA common refrain among Wikipedians is that the site works in practice but not in theory. It seems to flout everything we’ve learned about human behavior online: anonymous strangers discussing divisive topics and somehow, instead of dissolving into factions and acrimony, working together to build something of value.\nThe project’s origins go back to 1999. Wales, a former options trader who had founded a laddish web portal called Bomis, wanted to start a free online encyclopedia. He hired an acquaintance from an Ayn Rand listserv that Wales previously ran, a philosophy PhD student named Larry Sanger. Their first attempt, called Nupedia, was not so different from encyclopedias as they have existed since Diderot’s Encyclopédie in 1751. Experts would write articles that went through seven stages of editorial review. It was slow going. After a year, Nupedia had just over 20 articles.\nIn an attempt to speed things along, they decided to experiment with wikis, a web format gaining popularity among open-source software developers that allowed multiple people to collaboratively edit a project. (Wiki is the Hawaiian word for “quick.”) The wiki was intended to be a forum where the general public could contribute draft articles that would then be fed into Nupedia’s peer-review pipeline, but the experts objected and the crowdsourced site was given its own domain, Wikipedia.com. It went live on January 15th, 2001. Within days, it had more articles than all of Nupedia, albeit of varying quality. After a year, Wikipedia had more than 20,000 articles.\n\n“…write about what people believe, rather than what is so”\n\n\nThere were few rules at first, but one that Wales said was “non-negotiable” was that Wikipedia should be written from a “neutral point of view.” The policy, abbreviated as NPOV, was imported from the “nonbias policy” Sanger had written for Nupedia. But on Wikipedia, Wales considered it as much a “social concept of cooperation” as an editorial standard. If this site was going to be open to anyone to edit, the only way to avoid endless flame wars over who is right was, provocatively speaking, to set questions of truth aside. “We could talk about that and get nowhere,” Wales wrote to the Wikipedia email list. “Perhaps the easiest way to make your writing more encyclopedic is to write about what people believe, rather than what is so,” he explained.\nIdeally, the neutrality principle would allow people of different views to agree, if not on the matter at hand, then at least on what it was they were disagreeing about. “If you’ve got a kind and thoughtful Catholic priest and a kind and thoughtful Planned Parenthood activist, they’re never going to agree about abortion, but they can probably work together on an article,” Wales would later say.\nThis view faced an immediate challenge, which is that people believe all sorts of things: that the Earth is 6,000 years old, that climate change is a scam, that the Holocaust was a hoax, that the Irish potato famine was overblown, that chiropractors are all charlatans, that they have discovered a new geometry, and that Mother Teresa was a jerk.\n\n\n\n\n\n\n\n\nIn response, the early volunteers added another rule. You can’t just say things; any factual claim needs a citation that readers can check for themselves. When people started emailing Wales their proofs that Einstein was wrong about relativity, he clarified that the cited source could not be your own “original research.” Sorry, Wales wrote to an Einstein debunker, it doesn’t matter whether your theory is true. When it is published in a physics journal, you can cite that.\nInstead of trying to ascertain the truth, editors assessed the credibility of sources, looking to signals like whether a publication had a fact-checking department, got cited by other reputable sources, and issued corrections when it got things wrong. \nAt their best, these ground rules ensured debates followed a productive dialectic. An editor might write that human-caused climate change was a fact; another might change the line to say there was ongoing debate; a third editor would add the line back, backed up by surveys of climate scientists, and demand peer-reviewed studies supporting alternate theories. The outcome was a more accurate description of the state of knowledge than many journalists were promoting at the time by giving “both sides” equal weight, and also a lot of work to arrive at. A 2019 study published in Nature found that Wikipedia’s most polarizing articles — eugenics, global warming, Leonardo DiCaprio — are the highest quality, because each side keeps adding citations in support of their views. Wikipedia: a machine for turning conflict into bibliographies. \nCoupled with some technical features of wikis, like the ability for anyone to edit anyone else’s writing, and some early administrative rules, like not being allowed to undo someone else’s edit more than three times per day, users were practically forced to talk through disagreements and arrive at “consensus.” This became Wikipedia’s governing principle.\nThis may make the process sound more peaceful than it is. Disputes were constant. Early on, Sanger, who had remained partial to a more hierarchical, expert-driven model, clashed repeatedly with editors he decried as “anarchists” and demanded greater authority for himself, which the editors rejected. When revenue from Bomis dried up after the dot-com crash, Wales laid Sanger off and took over management of the project.\nWales governed from a greater remove, appearing only occasionally to broker peace between warring editors, resolve an impasse, or reassure people that they didn’t need to spend time devising procedures to screen out a sudden influx of neo-Nazis that were planning to overwhelm discussion, because if they showed up, “I will personally ban them all if necessary, and that’s that.” Editors sometimes ironically referred to him as their “God King” or “benevolent dictator,” but he described his role as a sort of constitutional monarch safeguarding the community as it developed the processes to fully govern itself. Because Wikipedia was under a Creative Commons license, anyone who didn’t like the way the project was run could copy it and start their own, as a group of Spanish users did when the possibility of running ads was raised in 2002. The next year Wales established a nonprofit, the Wikimedia Foundation, to raise funds and handle the technical and legal work required to keep the project running. The encyclopedia itself, however, would be entirely edited and managed by volunteers.\nIn early 2004, Wales delegated his moderating powers to a group of elected editors, called the Arbitration Committee. From that point onward, he was essentially another editor, screenname Jimbo Wales, liable to have his edits undone like anyone else. He attempted several times to update his own birthdate to reflect the fact that his mother says he was born slightly before midnight on August 7th, 1966, not on August 8th, as his birth certificate read, only to be reprimanded for editing his own page and trying to cite his own “original research.” (After several years of debates and citable coverage from reliable sources, August 7th eventually won, with a note explaining the discrepancy.)\n\nAGF\n\n\nOver the ensuing two decades, editors amended policies to cope with conspiracy theorists, revisionist historians, militant fandoms, and other perennial goblins of the open web. There were the three core content guidelines of Neutral Point of View, Verifiability, and No Original Research; the five pillars of Wikipedia; and a host of rules around editor conduct, like the injunction to avoid ad hominem attacks and assume good faith of others, defined and refined in interlinked articles and essays. There are specialized forums and noticeboards where editors can turn for help making an article more neutral, figuring out whether a source was reliable, or deciding whether a certain view was fringe or mainstream. By 2005, the pages where editors stipulated policy and debated articles were found to be growing faster than the articles themselves. Today, this administrative backend is at least five times the size of the encyclopedia it supports.\nThe most important thing to know about this system is that, like the neutrality principle from which it arose, it largely ignores content to focus on process. If editors disagree about, for example, whether the article for the uninhabited islands claimed by both Japan and China should be titled “Senkaku Islands,” “Diaoyu Islands,” or “Pinnacle Islands,” they first try to reach an agreement on the article’s Talk page, not by arguing who is correct, but by arguing which side’s position better accords with specific Wikipedia policies. If they can’t agree, they can summon an uninvolved editor to weigh in, or file a “request for comment” and open the issue to wider debate for 30 days.\nIf this fails and editors begin to quarrel, they might get called before the Arbitration Committee, but this elected panel of editors will also not decide who is right. Instead, they will examine the reams of material generated by the debate and rule only on who has violated Wikipedia process. They might ban an editor for 30 days for conspiring off-Wiki to sway debate, or forbid another editor from working on articles about Pacific islands over repeated ad hominem attacks, or in extreme cases ban someone for life. Everyone else can go back to debating, following the process this time.\nAs a result, explosive political controversies and ethnic conflicts are reduced to questions of formatting consistency. But because process decides all, process itself can be a source of intense strife. The topics of “gun control” and “the Balkans” are officially designated as “contentious” due to recurring edit wars, where people keep reverting each other’s edits without attempting to build consensus; so, too, are the Wikipedia manual of style and the question of what information belongs in sidebars. In one infamous battle, debate over whether to capitalize “into” in the film title Star Trek Into Darkness raged for more than 40,000 words.\n\nBecause disputes on Wikipedia are won or lost based on who has better followed Wikipedia process, every dispute becomes an opportunity to reiterate the project’s rules and principles\n\n\nIn 2009, law professors David A. Hoffman and Salil K. Mehra published a paper analyzing conflicts like these on Wikipedia and noted something unusual. Wikipedia’s dispute resolution system does not actually resolve disputes. In fact, it seems to facilitate them continuing forever.\nThese disputes may be crucial to Wikipedia’s success, the researchers wrote. Online communities are in perpetual danger of dissolving into anarchy. But because disputes on Wikipedia are won or lost based on who has better followed Wikipedia process, every dispute becomes an opportunity to reiterate the project’s rules and principles.\nTrolls who repeatedly refuse to follow the process eventually get banned, but initial infractions are often met with explanations of how Wikipedia works. Several of the editors I spoke with began as vandals only to be won over by someone explaining to them how they could contribute productively. Editors will often restrict who can work on controversial topics to people who have logged a certain number of edits, ensuring that only those bought into the ethos of the project can participate.\nIn 2016, researchers published a study of 10 years of Wikipedia edits about US politics. They found that articles became more neutral over time — and so, too, did the editors themselves. When editors arrived, they often proposed extreme edits, received pushback, and either left the project or made increasingly moderate contributions.\nThis is obviously not the reigning dynamic of the rest of the internet. The social platforms where culture and politics increasingly play out are governed by algorithms that have the opposite effect of Wikipedia’s bureaucracy in nearly every respect. Optimized to capture attention, they boost the novel, extreme, and sensational rather than subjecting them to increased scrutiny, and by sending content to users most likely to engage with it, they sort people into clusters of mutual agreement. This phenomenon has many names. Filter bubbles, epistemological fragmentation, bespoke realities, the sense that everyone has lost their minds. On Wikipedia, it’s called a “point of view split,” and editors banned it early. You are simply not allowed to make a new article on the same topic. Instead, you must make the case for a given perspective’s place amid all the others while staying, literally, on the same page.\nIn February, the conservative organization Media Research Center released a report claiming that “Wikipedia Effectively Blacklists ALL Right-Leaning Media.” It was essentially a summary of a publicly available policy page on Wikipedia that lists discussions about the reliability of sources and color codes them according to the latest consensus — green for generally reliable, yellow for lack of clear consensus, and red for generally unreliable. ProPublica is green because it has an “excellent reputation for fact-checking and accuracy, is widely cited by reliable sources, and has received multiple Pulitzer Prizes.” Newsweek is yellow after a decline in editorial standards following its 2013 acquisition and recent use of AI to write articles. Newsmax, the One America News Network, and several other popular right-leaning sources are red due to repeatedly publishing stories that were proven wrong. (As are some left-leaning sources, like Occupy Democrats.) The New York Post (generally unreliable, but marginally reliable on entertainment) used the report as the basis for an editorial titled “Big Tech must block Wikipedia until it stops censoring and pushing disinformation.”\nThe page is called Reliable sources/Perennial sources, as in sources that are perennially discussed. Editors made the page in 2018 as a repository for past discussions that they could refer to instead of having to repeatedly debate the reliability of the Daily Mail — the first publication to be deprecated, the year before — every time someone tried to cite it. It is not a list of preapproved or banned sources, the page reads. Context matters, and consensus can change.\nBut to Wikipedia’s critics, the page has become a symbol of the encyclopedia’s biases. Sanger, the briefly tenured cofounder, has found a receptive audience in right-wing activist Christopher Rufo and other conservatives by claiming Wikipedia has strayed from its neutrality principle by making judgments about the reliability of sources. Instead, he argues, it should present all views equally, including things “many Republicans believe,” like the existence of widespread fraud in the 2020 election and the FBI playing a role in the January 6th Capitol attack.\nLast spring, the reliable source page collided with one of the most intense political flashpoints on Wikipedia, the Israel-Palestine conflict. In April, an editor asked whether it was time to reevaluate the reliability of the Anti-Defamation League in light of changes to the way it categorizes antisemitic incidents to include protests of Israel, among other recent controversies. About 120 editors debated the topic for two months, producing text equal to 1.9 The Old Man and the Seas, or “tomats,” a standard unit of Wikipedia discourse. The consensus was that the ADL was reliable on antisemitism generally but not when the Israel-Palestine conflict was involved.\nUnusually for a Wikipedia administrative process, the decision received enormous attention. The Times of Israel called it a “staggering blow” for the ADL, which mustered Jewish groups to petition the foundation to overrule the editors. The foundation responded with a fairly technical explanation of how Wikipedia’s self-governing reliability determinations work.\nIn the year since, conservative and pro-Israel organizations have published a series of reports examining the edit histories of articles to make a case that Wikipedia is biased against Israel. In March, the ADL itself issued one such report, called “Editing for Hate,” claiming that a group of 30 “malicious editors” slanted articles to be critical of Israel and favorable to Palestine. As evidence, the report highlights examples like the removal of the phrase “Palestinian terrorism” from the introduction of the article on Palestinian political violence.\nYet the edit histories show that these examples are often plucked from long editing exchanges, the outcome of which goes unmentioned. The “terrorism” line that the ADL cited was indeed removed — it had also only just been added, was added back shortly after being cut, then was removed again, added back, and revised repeatedly before editors brokered a compromise on the talk page.\nBreitbart, Pirate Wires, and other right-leaning publications now regularly mine Wikipedia’s lengthy debates for headlines like “How Wikipedia Launders Regime Propaganda,” accusing the site of being a mouthpiece for the Democratic Party, or “Cover Up: Wikipedia Editors Propose Deleting Page on Iran Advocating for Israel’s Destruction,” despite the article having just been created and the outcome being to merge the contents into the article on Iran-Israel relations. These reports are a dependable source of viral outrage on X. The strategy also appears effective at convincing lawmakers. In May, Rep. Debbie Wasserman Schultz (D-FL) and 22 other members wrote to the Wikimedia Foundation citing the ADL report and demanding Wikimedia “rein in antisemitism, uphold neutrality.”\n\n\n\n\n\n\nThe August letter from House Republicans requesting information on attempts to influence the encyclopedia, data on editors who had been disciplined by Arbcom, and other records also cited the ADL report. \nWhile some search for bias in the minutiae of edit histories, others try to encompass all of Wikipedia. Last year, a researcher at the conservative Manhattan Institute scraped Wikipedia for mentions of political terms and public officials and used a GPT language model to analyze them for bias. The report found “a mild to moderate” tendency to associate figures on the political right with more negative sentiment than those on the left. The study, which was not peer reviewed, has become a regular fixture in claims of liberal bias on Wikipedia.\nThe report still illustrates the challenges of evaluating the neutrality of a text as vast and stripped of subjective opinion as Wikipedia. An examination of the datasets shows that the passages GPT classified as non-neutral are often anodyne factual statements: that a lawmaker won or lost an election, represented a certain district, or died. It also conflated unrelated people of the same name, so, for example, most of the non-neutral statements about Mike Johnson concern not Mike Johnson the current Republican House Majority Speaker but a robber in a 1923 silent film, a prog-rock guitarist, multiple football players, and a famous yodeler. \nBut the more fundamental question is whether balanced sentiment or balanced anything across the contemporary political spectrum is the correct expectation for a project that operates by a different standard, one based on measures of reliability. Supposing the sentiment readings do reflect a real imbalance, is that due to the biases of editors, biases in their sources, or some other external imbalance, like a tendency by right-leaning politicians to express negative sentiments of fear or anger (a possibility the report raises, then dismisses).\nWikipedia has a long history of attempting to disentangle and correct its various biases. The site’s editor community has been overwhelmingly white, male, and based in the United States and Europe since the site began. In 2018, 90 percent of editors were men, and only 18 percent of biographies in the encyclopedia were of women. That year, the Canadian physicist Donna Strickland won a Nobel Prize, and people turning to Wikipedia to learn about her discovered she lacked an article.\n\nWomen have been historically excluded from the sciences, underrepresented in coverage of the sciences, and therefore underrepresented in the sources Wikipedia editors can cite\n\n\nBut the causal connection between these facts was not straightforward. Women have been historically excluded from the sciences, underrepresented in coverage of the sciences, and therefore underrepresented in the sources Wikipedia editors can cite. An editor had tried to make an article on Strickland several months before the Nobel but was overruled due to a lack of coverage in reliable sources. “Wikipedia is a mirror of the world’s biases, not the source of them. We can’t write articles about what you don’t cover,” tweeted then-executive director Katherine Maher.\nWikipedia’s sourcing guidelines are conservative in their deference to traditional institutions of knowledge production, like established newsrooms and academic peer review, and this means that it is sometimes late to ideas in the process of moving from fringe to mainstream. The possibility that covid-19 emerged from a lab was relegated to a section on conspiracy theories and is only now, after reporting by reliable sources, gaining a toehold on the covid pandemic article. Similarly, as awareness grew of the ways Western academic and journalistic institutions have excluded the perspectives of colonized people, critics argued that Wikipedia’s reliance on these same institutions made it impossible for the encyclopedia to be truly comprehensive.\nNot all the bias comes from the project’s sources, though. A study that attempted to control for offline inequalities by examining only contemporary sociologists of similar achievement found that male academics were still more likely to have articles. As volunteers, editors work on topics they think are important, and the encyclopedia’s emphases and omissions reflect their demographics. Minor skirmishes in World War II and every episode of The Simpsons have an article, some of which are longer than the articles on the Ethiopian civil war or climate change in the Maldives. In an effort to fill in these gaps, the foundation has for several years funded editor recruitment and training initiatives under the banner of “knowledge equity.”\n“Most editors on Wikipedia are English-speaking men, and our coverage is of things that are of interest to English-speaking men,” said a retired market analyst in Cincinnati who has been editing for over 20 years. “Our sports coverage is second to none. Video games, we got it covered. Wars, the history of warfare, my god. Trains, radio stations… But our coverage of foods from other countries is very low, and there is an absolute systemic bias against coverage of women and people of color.” For her part, she tries to fill gaps around food, creating new articles whenever she encounters a Peruvian chili sauce or African fufu that lacks one.\nYet these initiatives have come under attack as “DEI” by conservative influencers and Musk, who called for Wikipedia to be defunded until “they restore balance.”\n\nIf you think something is wrong on Wikipedia, you can fix it yourself\n\n\nThese accusations of bias, familiar from attacks on the media and social platforms, encounter some unique challenges when leveled against Wikipedia. Crucially, if you think something is wrong on Wikipedia, you can fix it yourself, though it will require making a case based on verifiability rather than ideological “balance.”\nOver the years, Wikipedia has developed an immune response to outside grievances. When people on X start complaining about Wikipedia’s suppression of UFO sightings or refusal to change the name of the Gulf of Mexico to Gulf of America, an editor often restricts the page to people who are logged in and puts up a notice directing newcomers to read the latest debate. If anything important was missed, they are welcome to suggest it, the notice reads, provided their suggestion meets Wikipedia’s rules, which can be read about on the following pages. That is, Wikipedia’s first and best line of defense is to explain how Wikipedia works. \nOccasionally, people stick around and learn to edit. More often, they get bored and leave.\nIt was not unusual for skirmishes to break out over the Wikipedia page for Asian News International, or ANI. It is the largest newswire service in India, and as its Wikipedia article explains, it has a history of promoting false anti-Muslim and pro-government propaganda. It was these facts that various anonymous editors — not logged into Wikipedia accounts, so appearing only as IP addresses — attempted to remove last spring. \nAs typically happens, an experienced editor quickly reinstated the deleted sentences, noting that they had been removed without explanation. Then came another drive-by edit: actually, ANI is not propaganda and very credible, someone wrote, citing a YouTube video. Reverted: YouTube commentary is not a reliable source. Then another IP address, deleting a sentence about ANI promoting a false viral story about necrophilia in Pakistan. Reverted again. Another IP address, deleting the mention of propaganda with the explanation that the sources were “leftist dogs and swine.”\nAs the edit battle escalated, an editor locked the page so that only people who were logged in and had made a certain number of edits could make changes, ending the barrage of IP addresses.\nTwo months later, ANI sued. \nThe lawsuit revealed that several of the IP addresses had belonged to representatives of ANI attempting to remove unflattering information about the company. Blocked from doing so, ANI sued for defamation under a recent amendment to India’s equivalent of Section 230 that places stricter requirements on platforms to moderate content. When the Wikimedia Foundation declined to reveal the identities of three editors who had defended the page, the presiding judge said he would ask the government to block the site, threatening to cut off the country with the highest number of English Wikipedia readers after the US and the UK. “If you don’t like India,” the judge said, “please don’t work in India.”\nDuring the appeal, Wikimedia’s lawyer argued that disclosing the identities of editors would destroy the encyclopedia’s self-regulating system and expose contributors to reprisals. Also, he noted, the sentences in question, like every assertion on Wikipedia, were only summarizing other sources, and those sources — the publications The Caravan and The Ken — had not been sued for defamation. (As with editors, the foundation’s first response to external threats is often to explain how Wikipedia works.) The judge dismissed the argument, saying that journalism might be “read by a hundred people, you don’t bother about it… it does not have the gravitas.” Wikipedia, however, is read by millions.\nBy this point the case had garnered enough coverage to warrant its own Wikipedia page. This seemed to enrage the judge, particularly the line noting that the judge’s demand to reveal the identities of editors had been described as “censorship and a threat to the flow of information.” This “borders on contempt,” the judge said, demanding that the foundation take the page down within 36 hours. In a rare move, the foundation complied.\nThe case alarmed editors around the world. An open letter calling on the Wikimedia Foundation to protect the anonymity of the editors garnered more than 1,300 signatures, the most of any letter directed at the foundation. Nevertheless, last December, the foundation disclosed the editors’ identities to the judge under seal. Responding to outrage on Wikipedia’s editor forum, Wales asked for calm and urged people not to jump to conclusions.\nThe Wikimedia Foundation has historically taken a hard line against attempts to influence the project. In 2017, when the Turkish government demanded several articles be deleted, Wikipedia refused and was blocked for nearly three years as it fought to the country’s Constitutional Court and won. For the second half of 2024, the most recent data available, the foundation complied with about 8 percent of requests for user data, compared to Google’s 82 percent and Meta’s 77 percent. And the data provided was sparse, because Wikipedia retains almost none.\n\nInstead of brute censorship, what has emerged is a sort of gray-zone information warfare\n\n\nBut attempts to influence the site have grown more sophisticated. The change is likely due to multiple factors: a global rise of political movements that wish to control independent media, the increased centrality of Wikipedia, and a technical change to the website itself. In 2015, Wikipedia switched to the encrypted HTTPS extension by default, making it impossible to see what pages users visited, only that they were visiting the Wikipedia domain. This meant that governments that had previously been censoring specific articles on opposition figures or historic protests had to choose between blocking all of Wikipedia or none of it. Almost every country save China (and Russia, for several hours) chose to not to block it. This was a victory for open knowledge, but it also meant governments had a greater interest in controlling what was written in the encyclopedia.\nInstead of brute censorship, what has emerged is a sort of gray-zone information warfare. After mainland China quashed protests against the Hong Kong national security law in 2019, a battle began over how the protests would be remembered. Editors in mainland China — which can edit using VPNs — argued for the inclusion of state-friendly media that described the protests as “riots” or “terrorist attacks” while removing citations to independent media for unreliability and bias. In one case, an editor attempted to strip all citations to one of Hong Kong’s premier papers, Apple Daily, hours before it was shut down by the government. By conspiring offline and using fake accounts, they won elections to admin positions and with them the power to see other editors’ IP addresses, which they discussed using to reveal their opponents’ identities to the police. Shortly afterward, the Wikimedia Foundation banned or restricted more than a dozen editors operating from mainland China, saying that the project had been “infiltrated” and that “some users have been physically harmed as a result.”\nRussia employed similar tactics after its invasion of Ukraine in 2022. State media and government officials attacked Wikipedia in the press with accusations of anti-Russian bias, promulgation of fake news, and foreign manipulation. The site remained accessible, but Russian search engines put a banner above it saying it was in violation of the law. Meanwhile, the government harassed the foundation with a series of fines for publishing “false” information about the military, which the foundation has refused to pay. Finally, on the encyclopedia, state-aligned editors pushed the government’s view while vigilantes doxxed and threatened their opposition. Last year, the head of Wikimedia Russia was declared a “foreign agent” and forced to resign from his job as a professor at Moscow State University.\nIn neighboring Belarus, editor Mark Bernstein was doxxed by a pro-Russian group in 2022, arrested, and sentenced to three years of home confinement. As many as five other editors have been detained by Belarusian authorities in recent months, according to media reports and editors.\nAs these battles continued, the Russian government supported the creation of a more compliant alternative, called Ruwiki, which launched early last year with the copying of 1.9 million articles from the originals, edited to reflect the government view. On Ruwiki, edits must comply with Russian laws and are subject to approval from outside experts. There, the map of Ukraine does not include Donetsk or Kherson, the war is a “special operation” in response to NATO aggression, and accounts of torture in Bucha are fake news.\n\n\n\n\n\n\n\n\n\n\nWikipedia remains online in Russia, but with Ruwiki, the government may now feel emboldened to block it. In May, at a hearing on media safety for children, the head of the Russian Duma Committee on the Protection of the Family said that the encyclopedia’s “interpretation of our historical events feels so hostile that we need to raise the issue of blocking this information resource,” and that the encyclopedia’s depiction of history is opposed to Russian “traditional, spiritual values.”\nThe goal of these campaigns is what the Wikimedia Foundation calls “project capture.” The term originates in an independent report the foundation commissioned in response to the takeover of the Croatian-language Wikipedia by a cabal of far-right editors.\nIn 2010, a group of editors won election to admin positions and began citing far-right alternative media to rewrite history. On Croatian Wikipedia, the Nazis invaded Poland to stop a genocide against the German people, Croatia’s role in the Holocaust is foreign propaganda, and Ratko Mladić was a decorated military leader whose conviction by the UN for genocide (briefly noted quite far down) was the result of an international conspiracy. When other editors attempted to correct the articles, the admins banned them for violating rules against hate speech or harassment.\nThe encyclopedia became so warped that it began receiving press coverage. The Croatian Minister of Education warned students not to use it. In an interview with a Croatian paper, Wales confirmed the foundation was aware of the problem and looking into it. Yet the foundation has a policy of allowing Wikipedia projects to self-govern, and interfering with Croatian Wikipedia risked opening a door to the many governments and companies that want things on Wikipedia changed.\nEditors mounted a resistance and attempted to vote the admins out, but the admins defeated the attempt using votes from what were later revealed to be dozens of fake accounts. But because the admins were the only ones with the technical ability to trace IP addresses, the opposition had no way to prove this. The cabal now controlled all the levers of power. By 2019, nearly all of the editors who opposed them had been banned or harassed off the project.\nIn 2020, one of the few remaining dissident editors compiled a comprehensive textual and statistical analysis of editing patterns of dozens of accounts and filed a request for an admin to run IP traces to see if they were sock puppets. The admin stalled, then attempted to fudge the traces, but did so in such a transparent way that it was clear the accounts were indeed fakes.\nThis was the evidence required to procedurally break the cabal. High-ranking admins called “stewards” from other-language Wikipedias administered a new vote on banning the Croatian admins. This time, the admins lost. Their ringleader, username Kubura, was banned from all Wikipedia projects forever, a punishment that had been leveled against less than a dozen others in Wikipedia history. A local daily covered the incident with the headline “Kubura’s Downfall: Banned Globally, His Followers Retreat, Leaderless.”\n\nWikipedia’s processes are only effective if they are administered by people who believe in the spirit of the project\n\n\nThe foundation’s postmortem analysis compared the takeover to “state capture, one of the most pressing issues of today’s worldwide democratic backsliding.” The clique still cited the reliability of sources and invoked rules of debate, but it bent these processes to serve their nationalist purpose. As many governments have discovered, it is extremely difficult to insert propaganda into Wikipedia without running afoul of some rule or another. But what the Croatia capture showed is that Wikipedia’s processes are only effective if they are administered by people who believe in the spirit of the project. If they can be silenced or replaced, it becomes possible to steer the encyclopedia in a different direction. \n\n\n\n\n\n\nOne editor I spoke with, who asked to remain anonymous for reasons that will be obvious, had been editing Wikipedia for several years while living in a Middle Eastern country where much other media is tightly controlled. One day he received a call from a member of the intelligence service inviting him to lunch. He cried for hours — everyone knew what this meant. \nThe meeting was cordial but clear. They didn’t want him to stop editing Wikipedia. They wanted his help. They knew the encyclopedia has rules and you can’t just insert flagrant propaganda, but as a respected member of the community, maybe he could edit in ways that were a little friendlier to the government, maybe decide in its favor when certain topics came up for debate. In exchange, maybe the service could help him if he ever got in trouble with the police, for example, over his sexuality; he was gay in a country where that was illegal. \nHe fled the country weeks later. He now edits from abroad, but he knows of five to 10 others who have faced arrest or intimidation over their editing. They must do constant battle with editors he believes to be government agents who push the state’s perspective, debating tirelessly for hours because it is literally their job. \nIt’s a rare person who is able to uproot their life in the service of a volunteer side project. Understandably, many others faced with such threats become more cautious in their editing or stop altogether. Multiple editors based in India said that they now avoid editing topics related to their country. The ANI case had a chilling effect, as have recurring harassment campaigns. The far-right online publication OpIndia regularly accuses Wikipedia of “anti-Hindu and anti-India bias,” in ways that parallel attacks from the US right, down to citations of Manhattan Institute research and quotes from the disgruntled cofounder, Sanger. The organization has published the real names and employers of editors it accuses of being “leftists” or “Islamists,” leading at least one veteran editor to delete their account.\nEven ancient history can be cause for reprisals. In February, after the release of a Bollywood action film about Chhatrapati Sambhaji Maharaj, a 17th-century king who fought the Mughals, accounts on X began whipping up outrage over several facts on Sambhaji’s Wikipedia page that they deemed to be anti-Hindu. When editors reversed attempts to delete the offending lines, another X user posted their usernames and called on government officials to investigate them. Days later, local press reported that the Maharashtra cyber police opened cases against at least four editors.\n\n“If you issue cases and file complaints against editors, they tend not to edit those pages anymore”\n\n\n“Various editors have left Wikipedia over this persecution, fearing their own safety,” said an Indian Wikipedia editor who asked to remain anonymous out of fear of retaliation. “I believe this is completely useful for the right wing, if you issue cases and file complaints against editors, they tend not to edit those pages anymore, fearing for their safety in real life.”\nHe still edits, but mostly sticks to the safer ground of the Roman Empire.\nIn April, the Trump administration’s interim US attorney for DC, Edward Martin Jr., sent a letter to the Wikimedia Foundation accusing the organization of disseminating “propaganda” and intimating that it had violated its duties as a tax-exempt nonprofit.\nFrom a legal perspective, it was an odd document. The tax status of nonprofits is not generally the jurisdiction of the US attorney for DC, and many of the supposed violations, like having foreign nationals on its board or permitting “the rewriting of key, historical events and biographical information of current and previous American leaders,” are not against the law. Sanger is quoted, criticizing editor anonymity. In several cases, the rules Martin accuses Wikipedia of violating are Wikipedia’s own, like a commitment to neutrality. But the implied threat was clear.\n“We’ve been anticipating something like this letter happening for some time,” a longtime editor, Lane Rasberry, said. It fits the pattern seen in India and elsewhere. He has been hearing more reports of threats against editors who work on pages related to trans issues and has been conducting security trainings to prevent their identities being revealed. Several US-based editors told me they now avoid politically contentious topics out of fear that they could be doxxed and face professional or legal retaliation. “There are more Wikipedia editors getting threats, more people getting scared,” Rasberry said.\n\n\n\n\n\n\n\n\n\n\n\n\nTalking to editors, I encountered a confounding spread of opinions about the seriousness of the threat to Wikipedia, often in the same conversation. The site has sloughed off more than two decades of attacks, and so far the latest round is no different. The Heritage Foundation plan to dox editors has yet to materialize. Musk’s calls for his followers to stop donating have resulted in surges in donations, according to publicly available data.\nIn India, the High Court struck down the order to take down the article about ANI’s defamation case, though the case itself is ongoing. Wikipedia’s critics on the right and in the Silicon Valley elite often propose generative AI as the solution to Wikipedia’s perceived biases, for each user a bespoke source of ideologically agreeable information. Yet all these projects remain wholly reliant on Wikipedia, and so far the most aggressive such initiative, Musk’s Grok, has spent much of its existence flailing between fact-checking Musk’s own conspiracy theories and proclaiming itself MechaHitler.\nBut new threats continue to appear. In August, the foundation lost its case arguing for an exemption from the UK’s Online Safety Act, which would force Wikipedia to verify the identities of its editors, though it is continuing to appeal. In Portugal the foundation received a court order arising from a defamation case brought by Portuguese American businessman Cesar DePaço, who objected to information on his page about past criminal allegations and links to the far-right Portuguese party Chega. Complying with the ruling, the foundation struck several facts from his biography and disclosed “a small amount of user data” about eight editors. The foundation is now bringing the case before the European Court of Human Rights. And in the US, there is the recent House Oversight letter.\nNo matter the outcome, these cases contribute to a general increase in pressure on the project’s already strained editors. English Wikipedia has fewer than 40,000 active editors, defined as users who have made five or more edits in the last month. The number of active administrators, crucial to maintaining the site and enforcing policy, peaked in 2008 and now stands at around 450. AI threatens to squeeze the editor pipeline further. The more people who get information from AI summaries of Wikipedia rather than the site itself, the fewer people who will wander down a rabbit hole, encounter an error that needs correcting, and become editors themselves. \n\n“Wikipedia should not be taken for granted.”\n\n\nAt the same time, people are using AI to add plausible-looking but false or biased information to the encyclopedia, increasing the workload for editors. Harassment, ideological editing campaigns, government investigations, targeted lawsuits — even if they lead nowhere, they will make the prospect of editing more daunting and increase the odds that current editors burn out. “Wikipedia should not be taken for granted,” Rasberry said. “This is an existential threat.” \nThe first reactions to the Martin letter on the Wikipedia editor forums were radical: the foundation should leave the US, maybe for France, or Iceland, or Germany. This would not be unprecedented, an editor pointed out. The Encyclopédistes fled to Switzerland when the ancien régime attempted to censor them. Maybe the site should go dark in protest. \nBut moderation soon prevailed. “The community needs to chill on the blackout talk,” wrote an editor by the name of Tazerdadog. “We’re not there yet.” Right now, the best response to these threats is to double down on Wikipedia’s policies, particularly the refusal to be censored and its dedication to neutral point of view, they wrote. \n\nNPOV\n\n\n“I 100% agree with you, Tazerdadog,” replied “Jimbo Wales.” “Emphasizing to the WMF that NPOV is non-negotiable is not really the issue.” In fact, Wales wrote, he is chairing a working group on strengthening the policy. The initiative was announced in March, framed as a response to the global rise in threats to sources of neutral information, and to a fragmentation of the public’s understanding of the very concepts of neutrality and facts. Wikipedia’s response, it seemed, would be to neutral harder. \nIn May, I met Wales for coffee at a members club in Chelsea where he had been granted an honorary membership after giving a talk. (Wikipedia, as journalists have noted for years, did not make Wales a tech billionaire.) Extravagant bouquets of pastel flowers were arranged in an arch above the doorway and festooned the tables of the interior. Wales, dressed to meet his wife at the Chelsea Flower Show, matched the decor in a green linen suit and floral shirt. He does not, he said, normally dress like a leprechaun. \nHe was not particularly concerned about the attacks on Wikipedia, he said, though he warned that he is “pathologically optimistic.” Wikipedia has been attacked since it began. It fought Turkey’s ban to the Constitutional Court and won. Even Russian Wikipedia has proven resilient. In the US, the government lacks much of the leverage it has deployed against other institutions. Wikipedia doesn’t rely on government funding, and protections for online speech are strong. In the last fiscal year, the foundation took in $170 million in donations, with an average size of about $10.\nAs for the accusations of bias, why not investigate? Whether the attacks are in good faith or bad, it doesn’t really matter, Wales said. The foundation had already decided that it was a good time, given the fragmented and polarizing world, to examine and bolster Wikipedia’s neutrality processes. Wales, leaning over the coffee table, seemed excited at the prospect. \n“If somebody turns up on a talk page and says, ‘Hey, this article is a mess, it’s wrong. It’s really biased,’ the right answer is to not scream at them and run and hide. The right answer is go, ‘Oh, tell me more. Let’s dig in. Where is it biased? How do we think about how do we fix that?’”\nLet’s figure out the best methodologies for studying neutrality, Wales said. Let’s look at how editors evaluate the reliability of sources. Maybe Wikipedia does use the label “far-right” more than “far-left,” Wales said, a criticism that has been leveled at the site. Is that because the media uses the term more, and does Wikipedia use the term more or less than the media does, and does the media use the term more because there are more far-right movements in the world today? \n“You have to chew on these things. There’s no simple answers.”\nBut there are answers. If the social platforms and language models that increasingly shape our understanding of the world are inscrutable black boxes, Wikipedia is the opposite, maybe the most legible, endlessly explainable information management system ever made. For any sentence, there is a source, and a reason that that source was used, and a reason for that reason. \n“Let’s dig in,” Wales repeated. “Let’s assess the evidence. Let’s talk to a lot of different people. Let’s really try and understand.” Come, be part of the process. His working group is starting to discuss the best approach. The meetings, Wales acknowledged, have been very tedious so far.\nAs for the letter from the interim DC attorney, Trump withdrew Martin’s nomination in May, though he still has a position leading the Justice Department’s retribution-oriented “task force on weaponization.” In any case, the Wikimedia Foundation responded promptly. \n“The foundation staff spent a lot of passion writing it,” Wales said of the reply. “Then they ran it by me for review, and I was ready to jump in, but I was like, actually, it’s perfect.” \n“It’s very calm,” Wales said. “Here are the answers to your questions, here is what we do.” It explains how Wikipedia works.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0ed2c336d6f1a08e6c518ba26b7d8851ac648f32",
      "title": "Organ transplants for immortality: Might Xi and Putin be onto something?",
      "url": "https://www.bbc.com/news/articles/cly1w9z72r6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T12:25:33.000Z",
      "summary_90w": "",
      "raw": "The presidents of China and Russia were overheard discussing transplants as a way to prolong life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "052ab0b7358401153bf510f13f856bcd84aa50a5",
      "title": "Graham Linehan goes on trial over alleged harassment of trans woman",
      "url": "https://www.bbc.com/news/articles/cn0x2kx08wdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T12:21:22.000Z",
      "summary_90w": "",
      "raw": "The Father Ted creator is on trial at Westminster Magistrates' Court days after a separate arrest at Heathrow.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2854e8313b41c72fd77d5f0e0225b5e8c6691e57",
      "title": "The Browser Company, maker of Arc and Dia, is being acquired",
      "url": "https://www.theverge.com/web/770947/browser-company-arc-dia-acquired-atlassian",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-04T12:20:15.000Z",
      "summary_90w": "",
      "raw": "Dia’s simplicity is neat, but its AI integration is the point.\t\n\nMike Cannon-Brookes, the CEO of enterprise software giant Atlassian, was one of the first users of the Arc browser. Over the last several years, he has been a prolific bug reporter and feature requester. Now he'll own the thing: Atlassian is acquiring The Browser Company, the New York-based startup that makes both Arc and the new AI-focused Dia browser. Atlassian is paying $610 million in cash for The Browser Company, and plans to run it as an independent entity.\nThe conversations that led to the deal started about a year ago, says Josh Miller, The Browser Company's CEO. Lots of Atlassian employees were using Arc, and \"they reached out wond …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5515937e50afb4180e337235fac56032a47c9256",
      "title": "DuckDuckGo adds access to advanced models to it subscription plan",
      "url": "https://techcrunch.com/2025/09/04/duckduckgo-adds-access-to-advanced-models-to-it-subscription-plan/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T12:00:00.000Z",
      "summary_90w": "",
      "raw": "With DuckDuckGo's $9.99 per month plan, users will be able to access newer models, including OpenAI’s GPT-4o and GPT-5, Anthropic’s Claude Sonnet 4, and Meta’s Llama Maverick.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6122d51f9d15cb71c10fa8db315345aae34ff407",
      "title": "Thousands of Lloyds staff deemed to be underperforming face axe",
      "url": "https://www.bbc.com/news/articles/cx209gzg71wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T11:52:22.000Z",
      "summary_90w": "",
      "raw": "Lloyds Banking Group's policy puts 3,000 jobs at risk, with staff to be told they must improve their work or lose their job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a35b1b0667affa66a6f49fdca0bf48aefdf95ed",
      "title": "Dozens die after boat hits tree stump in Nigerian river",
      "url": "https://www.bbc.com/news/articles/c3dr903xeleo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T11:43:42.000Z",
      "summary_90w": "",
      "raw": "The overloaded boat was carrying passengers including children when it hit a submerged tree stump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7896771baba030fd9b7e6154ba782ac31ae12691",
      "title": "'It collapsed like a cardboard box': Witnesses describe fatal Lisbon crash",
      "url": "https://www.bbc.com/news/articles/c20v4g71zrpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T11:41:27.000Z",
      "summary_90w": "",
      "raw": "At least 16 people were killed and 20 more injured, some critically, Portuguese authorities say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7896771baba030fd9b7e6154ba782ac31ae12691",
      "title": "'Out of control': Witnesses describe fatal Lisbon funicular crash",
      "url": "https://www.bbc.com/news/articles/c20v4g71zrpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T11:41:27.000Z",
      "summary_90w": "",
      "raw": "At least 16 people were killed and 20 more injured, some critically, Portuguese authorities say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be3f96eee7b4554a0e36d5c91fabe40eac7f59cc",
      "title": "Second arrest over racist abuse sent to England footballer Jess Carter",
      "url": "https://www.bbc.com/news/articles/cp8j1r4glzxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T11:32:44.000Z",
      "summary_90w": "",
      "raw": "A 30-year-old is arrested in Derbyshire after the messages were sent during the Women's Euros.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a4b26f62d4a643e21d160136060ce432cdcd52b",
      "title": "Man denies deliberately driving into crowd at Liverpool parade",
      "url": "https://www.bbc.com/news/articles/cwyl38115j2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T11:31:14.000Z",
      "summary_90w": "",
      "raw": "Paul Doyle, 53, denies 31 charges including causing grievous bodily harm with intent.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "111f1342a3350702f99d79f8527f893bcb24b9b9",
      "title": "Grandfather accidentally takes home wrong child from Sydney daycare centre",
      "url": "https://www.bbc.com/news/articles/c4g5v4z13l6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T11:19:57.000Z",
      "summary_90w": "",
      "raw": "The man returned with the one-year-old as soon as he realised the mistake, and an investigation into the centre's safety protocols has been opened.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3de679269ec841f5af4205dcbc669572eb84a7b4",
      "title": "RFK Jr. faces Senate about CDC chaos. And, Harvard funding freeze ruled illegal",
      "url": "https://www.npr.org/2025/09/04/g-s1-86935/up-first-newsletter-robert-f-kennedy-jr-cdc-federal-reserve-harvard-university",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T11:08:35.000Z",
      "summary_90w": "",
      "raw": "Robert F. Kennedy Jr. will testify in the Senate today after last week's shakeup at the CDC. And, a federal judge says the Trump administration illegally froze billions of Harvard's funds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "88358a79276520db2a3c7248d8b34bd9a07c7138",
      "title": "Watch: BBC correspondent at scene of Lisbon funicular crash",
      "url": "https://www.bbc.com/news/videos/c7v15j8ydreo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T11:08:23.000Z",
      "summary_90w": "",
      "raw": "Local media reports suggest a cable came loose along the railway's route, causing it to lose control - a national day of mourning is being observed",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0debc69ddd7f73b424dd0a78535704200eac576e",
      "title": "US flight attendants push for boarding wages after Air Canada deal",
      "url": "https://www.theguardian.com/us-news/2025/sep/04/air-canada-union-us-flight-attendants",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Cabin crews across North America are not paid for work done before takeoff, but a new Canada deal has raised hope\nAs you board the plane, the flight attendant welcomes you on board. They point you to your seat and help with your luggage, before giving the safety demonstration, and preparing the plane for take-off. And there’s a good chance they’ve done it all for free.\nBut a tentative deal between Air Canada and thousands of flight attendants has sparked hope more airlines will end a little-known reality for many North American cabin crews – and pay flight attendants when planes are not moving.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6638864850982cfec3c9b5774280c2b25e122377",
      "title": "Taiwan accuses China of breaching international law over drilling",
      "url": "https://www.theguardian.com/world/2025/sep/04/taiwan-china-oil-gas-drilling-exclusive-economic-zone-pratas-islands",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T10:41:07.000Z",
      "summary_90w": "",
      "raw": "Island’s government demands halt to Chinese oil and gas operations in its exclusive economic zone\nTaiwan’s government has accused China of breaching international law by drilling for oil and gas inside Taiwan’s exclusive economic zone (EEZ) and immediately demanded it halt the activity.\nThe statement from the office of Taiwan’s president, Lai Ching-te, came after revelations first reported by the Guardian that several Chinese oil rigs and associated vessels had been detected inside Taiwan’s EEZ, near the disputed Pratas Islands, which are under Taiwanese control.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "46738b286eaed4ae5ffbc04ea33dc6bf97adaa64",
      "title": "What we know about Rayner's tax admission - and the unanswered questions",
      "url": "https://www.bbc.com/news/articles/c62n366q306o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T10:31:45.000Z",
      "summary_90w": "",
      "raw": "The deputy PM has admitted underpaying stamp duty on her £800,000 flat in Hove, East Sussex.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "449d3def44c97722a84ded96c029500e3a8f6a46",
      "title": "Daughter of sex abuser feels ‘robbed’ her cancer-stricken father was allowed to die voluntarily in NSW prison",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/daughter-sex-abuser-father-death-voluntarily-nsw-prison-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T10:06:00.000Z",
      "summary_90w": "",
      "raw": "Man was seven years into a 30-year prison term with a non-parole period of 20 years for a string of sex crimes\n\nGet our breaking news email, free app or daily news podcast\n\nA sexual assault survivor has mounted a campaign to stop voluntary assisted dying in prison and feels “robbed” her perpetrator died on his terms.\nThe man, who cannot be named for legal reasons, was permitted to die voluntarily because of a terminal cancer diagnosis, becoming the first prisoner in New South Wales to access the system.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7261bfc5d1bf06a13f24bc39aad66f8211b87ce8",
      "title": "Sophie Turner to play Lara Croft in Tomb Raider series",
      "url": "https://www.bbc.com/news/articles/c7845vwg0zno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T10:00:33.000Z",
      "summary_90w": "",
      "raw": "The Game of Thrones actress will star in the new Prime Video show, helmed by Phoebe Waller-Bridge.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2dccef2eeb89e00f14e9454f7d48717bb880188b",
      "title": "Are creatine supplements all that they're pumped up to be?",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526053/are-creatine-supplements-all-that-theyre-pumped-up-to-be",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Creatine supplements have long become increasingly popular as social media influencers tout their benefits. What does the evidence say?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d67f0d4a8fe12d38cf2e3203b25642c0f617999",
      "title": "Madrid’s Orbital Paradigm aims to prove a cheaper path to orbital reentry",
      "url": "https://techcrunch.com/2025/09/04/madrids-orbital-paradigm-aims-to-prove-a-cheaper-path-to-orbital-reentry/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-04T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Orbital Paradigm is moving fast and cheap to industrialize low Earth orbit.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef525622de85c6a1081faaa1ccf5cf3d09944067",
      "title": "Sen. Warren says banking panel should focus on Trump's attacks on Fed independence",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526013/elizabeth-warren-trump-stephen-miran-fed-independence",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T10:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR's Steve Inskeep speaks with Sen. Elizabeth Warren, the top Democrat on the Senate Banking Committee, about Stephen Miran's nomination to the Fed and the central bank's independence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "caa890f6f0f606b901b8d900822c98f38d915655",
      "title": "RFK Jr. to face questions about chaos at the CDC",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/04/nx-s1-5525885/rfk-cdc-hhs-senate-finance",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:01:00.000Z",
      "summary_90w": "",
      "raw": "Democratic lawmakers and more than a thousand current and former HHS staff say Kennedy's actions are endangering America's health. Kennedy says he came to clean house and he's delivering.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c78c3443949087aa6c9ef4bb34a7a0b0cda26ee",
      "title": "A literary center named for author Larry McMurtry breathes life into his Texas hometown",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5493469/larry-mcmurtry-books-literary-archer-city-texas-western",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A literary center in Archer City, a tiny ranching town in Texas, keeps alive the legacy of famed Western author Larry McMurtry.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8b995b61d90b1c7350df20aa7d2fed7d2e75644",
      "title": "Fox bosses privately called U.S. Attorney Jeanine Pirro 'reckless maniac' and more",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5526879/fox-news-jeanine-pirro-reckless-maniac",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Her colleagues made those remarks after the 2020 presidential election, when Pirro used her platform to amplify baseless claims of election fraud. She is now the U.S. attorney for Washington, D.C.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db67fa530b19db4f498b6547b1b1f589c93e3f58",
      "title": "How the Education Department is using civil rights laws to bring schools to heel",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5500262/trump-civil-rights-schools-students",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Trump administration is using decades-old laws, meant to prevent discrimination, to threaten school districts and states with cuts to vital federal funding.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f472c03bb8c1e51ff0e0294e4fd38ca99f3d416e",
      "title": "Sell it, donate it — recycle it? A beloved old minivan faces a fork in the road",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5492399/old-car-sell-donate-recycle",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T09:00:00.000Z",
      "summary_90w": "",
      "raw": "After 20 years of service, an NPR reporter's beloved minivan is on the fritz. But what is its best and highest calling now: Pass it on to another family, or recycle it into parts?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9468dd573828d95e2f01766740a4afd147dba35",
      "title": "Lisbon funicular crash: Portugal declares day of mourning as death toll rises to 17",
      "url": "https://www.theguardian.com/world/2025/sep/04/lisbon-funicular-crash-portugal-declares-day-of-mourning-deaths",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T08:57:37.000Z",
      "summary_90w": "",
      "raw": "More than a dozen people killed and 21 others injured after one of city’s famous streetcars derailed\n\nExplainer: what is Lisbon’s funicular railway Elevador da Glória and how does it work?\n\nEurope live – latest updates\n\nPortugal has declared a day of national mourning after at least 17 people were killed and 21 others injured when one of Lisbon’s famous funicular cars derailed and crashed into a building on Wednesday evening.\nThose killed on the Glória funicular were all adults, according to Margarida Castro Martins, the head of the city’s civil protection agency.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "38dff43542faebcbc53025f0f71d459adb5b7b72",
      "title": "Decision to close Meanjin criticised as act of ‘utter cultural vandalism’",
      "url": "https://www.theguardian.com/books/2025/sep/04/meanjin-close-melbourne-university-publishing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T08:48:34.000Z",
      "summary_90w": "",
      "raw": "Shutting long-running literary journal, which published emerging writers as well as the cream of Australia’s literary talent, described as ‘enormous loss’\n\nGet our breaking news email, free app or daily news podcast\n\nOne of Australia’s longest running literary journals has been scrapped, in what has been described as an act of “utter cultural vandalism” on the part of the University of Melbourne.\nAfter 85 years, Meanjin, run by the university’s subsidiary Melbourne University Publishing (MUP), will publish its last edition in December. Although the journal’s editor, Esther Anatolitis, worked her last day at Meanjin on Thursday, the spring and summer quarterly editions of the journal are already at the printers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c64757572eba6b5f747847ecaccaa9bd5bffb3f1",
      "title": "Portugal observes national day of mourning as Lisbon streetcar death toll rises to 17",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5528599/portugal-streetcar-accident-deadly-mourning",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T08:11:47.000Z",
      "summary_90w": "",
      "raw": "The streetcar's crumpled wreckage was still on the downtown road where it crashed Thursday. Officials declined to speculate on whether a faulty brake or a snapped cable may have caused the accident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b84e4e6a5782d33861a44628917d679d7ce9ec4",
      "title": "Nigel Farage urges US to oppose UK on free speech laws",
      "url": "https://www.bbc.com/news/articles/ce9rzngd9k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T08:02:28.000Z",
      "summary_90w": "",
      "raw": "The Reform UK leader gives evidence to US lawmakers but gets a rough reception from some Democrats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4db75cbe58602f55def216965c64bd0e950ab0f",
      "title": "Ben Roberts-Smith’s final appeal bid rejected by high court – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T07:40:22.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nDaniel Andrews defends decision to attend China military parade alongside Vladimir Putin and Kim Jong-un\n\nGet our breaking news email, free app or daily news podcast\n\nSenator continues calls to criminalise burning Australian flag\nJacinta Nampijinpa Price is tripling down on her call for the burning of the Australian flag to be criminalised, and has called for Anthony Albanese to only stand in front of the Australian flag.\nI think in recent times, a lot of Australians have been vilified and the suggestion is that they’re somehow racist if they take pride in who we are as a country and in our flag that represents us as a country. I find that our prime minister standing in front of three flags divides us.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f3f10d3812de2a801ac7fd533797813e87076f8",
      "title": "Guyana President Irfaan Ali claims victory in general election",
      "url": "https://www.bbc.com/news/articles/cevzj1yldl1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T07:05:25.000Z",
      "summary_90w": "",
      "raw": "The incumbent president claimed victory in an election dominated by how to manage the country's vast oil reserves.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "025e824153d407459d6bc2817d859382fa25c598",
      "title": "The British teen aiming to be youngest undisputed boxing champion",
      "url": "https://www.bbc.com/sport/boxing/articles/cp94zlr8z2po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T06:52:55.000Z",
      "summary_90w": "",
      "raw": "She's still only 19, but Britain's Tiah-Mai Ayton has set her sights on becoming the youngest ever undisputed champion in boxing.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90c6f290e870aa1d25f039fd30ee359afe18a644",
      "title": "Labor and Coalition pass deportation laws set to make Nauru a ‘penal colony’ for Australia, critics say",
      "url": "https://www.theguardian.com/australia-news/2025/sep/04/labor-coalition-pass-deportation-laws-naura-australia-penal-colony-australia-critics-say",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:35:59.000Z",
      "summary_90w": "",
      "raw": "Legislation validates flawed decisions, cuts off appeals and gives government sweeping powers to deport people, campaigners claim\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe major parties have been accused of “stitching up” a deal to transform Nauru into Australia’s “dumping ground and penal colony” as parliament passed laws stripping basic legal rights from a group of noncitizens set to be deported.\nThe home affairs legislation passed the Senate on Thursday, after a snap three-hour parliamentary hearing the night before.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "593cecfb8f53b16538d88ada5dd6aa8512d42bac",
      "title": "Martha's rule rolled out to all acute hospitals in England after hundreds of lives saved",
      "url": "https://www.bbc.com/news/articles/c8e1zw28766o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T06:20:58.000Z",
      "summary_90w": "",
      "raw": "Hundreds of patients have been helped by rule, which makes it easier to get an urgent second opinion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1e2a126696f02c551928711b4878bdfb76a9a7d",
      "title": "Israeli military database indicates only a quarter of Gaza detainees are fighters",
      "url": "https://www.theguardian.com/world/2025/sep/04/israeli-military-database-indicates-only-a-quarter-of-gaza-detainees-are-fighters",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T06:00:46.000Z",
      "summary_90w": "",
      "raw": "Elderly woman with Alzheimer’s, medical workers and children among 6,000 Palestinians held\nOnly one in four detainees from Gaza are identified as fighters by Israel’s military intelligence, classified data indicates, with civilians making up the vast majority of Palestinians held without charge or trial in abusive prisons.\nThose jailed for long periods without charge or trial include medical workers, teachers, civil servants, media workers, writers, sick and disabled people and children.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5af2f24b58f60cb124e0287037fd95c6505f148a",
      "title": "Jamaica election results: Andrew Holness leads Labour party to third term",
      "url": "https://www.theguardian.com/world/2025/sep/04/jamaica-election-results-andrew-holness-leads-labour-party-to-third-term",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:42:26.000Z",
      "summary_90w": "",
      "raw": "Incumbent prime minister says country on right trajectory, as opposition leader concedes defeat \nJamaicans have voted to give Andrew Holness and the Jamaica Labour party (JLP) a third consecutive term in government after a nail-biting race with the opposition People’s National party (PNP).\nHolness beat PNP’s Mark Golding after polls in the final days of the intense campaign projected a narrow lead for the PNP. Of the 63 seats being contested, preliminary results showed the JLP winning 34 seats and the PNP 29.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "694b253e92d177568d4c78ce03686c245a440282",
      "title": "Thursday briefing: China flexes its muscle in the tussle for global dominance",
      "url": "https://www.theguardian.com/world/2025/sep/04/thursday-briefing-china-flexes-its-muscle-in-the-tussle-for-global-dominance",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T05:37:32.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: In hosting anti-western leaders at its largest ever military parade, Beijing sent a defiant message that will be heard loud and clear across the world\n\nGood morning. All eyes have been on China this week as the second biggest global economy flexed its muscles.\nDozens of world leaders, including from the global south, authoritarian pariah states and the EU, attended China’s largest ever military parade on Wednesday to mark the 80th anniversary of the end of the second world war, which China calls the war of resistance against Japanese aggression.\nUK news | Deputy PM Angela Rayner has admitted she underpaid stamp duty on her £800,000 seaside flat, after coming under intense pressure to be more transparent about her property arrangements.\nRussia | Vladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nPolice | The Metropolitan police have declined to drop their investigation into the comedy writer Graham Linehan for tweets about trans issues, and said that the law used by officers to detain him needs reviewing.\nIsrael | Israeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nPortugal | A day of national mourning has been declared in Portugal after at least 15 people were killed when Lisbon’s well-known Gloria funicular railway car derailed and crashed on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb4dcd3f9af31aad61ae4ed3bcfbbad04aa355b9",
      "title": "Counting rings reveals Sycamore Gap tree age range",
      "url": "https://www.bbc.com/news/articles/ckgygex6k87o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:04:46.000Z",
      "summary_90w": "",
      "raw": "There has been a lack of clarity over the age of the Hadrian's Wall tree which was illegally felled.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T04:59:05.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "959222f718a6eea7540ddf4e098ec2b798de4e32",
      "title": "Trump asks Supreme Court to reverse tariffs ruling finding them illegal",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5528573/trump-supreme-court-tariffs-ruling",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-04T04:32:49.000Z",
      "summary_90w": "",
      "raw": "The government called on the court to reverse an appeals court ruling that found most of President Donald Trump's tariffs are an illegal use of an emergency powers law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d55798207b8e128a1cebc2b9d9d4c61928310f5d",
      "title": "Record payout for victims of 'illegal and immoral' Australian welfare scheme",
      "url": "https://www.bbc.com/news/articles/clyx3jvk4zeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T04:16:14.000Z",
      "summary_90w": "",
      "raw": "Hundreds of thousands of Australians were forced to repay debts, many of which did not even exist.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23332494d39d5e8082ee4de982292694f4850b3d",
      "title": "Spain and Portugal wildfire weather made 40 times more likely by climate crisis, study finds",
      "url": "https://www.theguardian.com/environment/2025/sep/04/spain-portugal-wildfire-weather-climate-crisis-study",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T04:00:43.000Z",
      "summary_90w": "",
      "raw": "Wildfires were 30% more intense than would have been expected without global heating, scientists say\nThe extreme weather that fuelled “astonishing” blazes across Spain and Portugal last month was made 40 times more likely by climate breakdown, early analysis suggests.\nThe deadly wildfires, which torched 500,000 hectares (1.2m acres) of the Iberian peninsula in a matter of weeks, were also 30% more intense than scientists would have expected in a world without climate change, according to researchers from the World Weather Attribution network.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T03:43:30.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb25f13a2d2684e7e10ed48fbc222bc31eecabd3",
      "title": "China spectacle shows dangers of Trump's high-risk trade policy",
      "url": "https://www.bbc.com/news/articles/c98d5gplj52o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T03:31:55.000Z",
      "summary_90w": "",
      "raw": "Beijing's military parade shows how Trump has created new international bedfellows in just months, writes Anthony Zurcher.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a2be6595855038550ad1d17b438f8026feeea70",
      "title": "Guyana’s president claims victory in election held amid newfound oil riches",
      "url": "https://www.theguardian.com/world/2025/sep/04/guyana-election-president-claims-victory-amid-newfound-oil-riches",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T02:46:08.000Z",
      "summary_90w": "",
      "raw": "Irfaan Ali will be tasked with turning the profits of Guyana’s 2019 oil boom into prosperity for its citizens\nGuyana’s president, Irfaan Ali, has proclaimed victory in this week’s general and regional elections after his party won more than 240,000 votes and seven of the country’s ten electoral districts.\n“The results are all out there, as published by the Guyana elections commission. The numbers are clear. The people have spoken in an overwhelming way. We have won these elections with a remarkable margin,” he told the Guardian on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2ac6cbb192b3f120995526f31174f98d5eeb174c",
      "title": "Epstein accusers say they are compiling list of his associates",
      "url": "https://www.bbc.com/news/articles/c5yvpgyjed8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T02:11:32.000Z",
      "summary_90w": "",
      "raw": "Victims of the disgraced financier give emotional accounts of abuse in a news conference on the steps of the US Capitol.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59bc4ea3464d1b0a8ae8def2aef19d4d865ae76c",
      "title": "Portugal declares day of mourning for 15 people killed in Lisbon funicular railway crash",
      "url": "https://www.theguardian.com/world/2025/sep/03/at-least-three-people-killed-many-injured-in-lisbon-funicular-crash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T01:41:24.000Z",
      "summary_90w": "",
      "raw": "Another 18 people injured when Gloria funicular railway car derails and apparently crashed into a building\n\nExplainer: what is Lisbon’s funicular railway Elevador da Glória and how does it work?\n\nA day of national mourning has been declared in Portugal after at least 15 people were killed when Lisbon’s well-known Gloria funicular railway car derailed and crashed on Wednesday.\nAn emergency services spokesperson said some foreign nationals were among the dead but would not identify the victims or disclose their nationalities. At least 18 people, including a child, were injured, five of them seriously.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e44d89db7b4bc12a4b3aea5c13c574d3b7fa957e",
      "title": "American Eagle shares soar as Sydney Sweeney ads seen driving sales",
      "url": "https://www.bbc.com/news/articles/cddm7z3p2vlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T01:20:00.000Z",
      "summary_90w": "",
      "raw": "The US actress was part of the company's controversial \"Great Jeans\" campaign which drew a backlash.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6aecbeed8c9d9042f3814c92141fa6e2ef0e864c",
      "title": "Old master painting looted by Nazis recovered a week after being spotted in Argentinian property listing",
      "url": "https://www.theguardian.com/world/2025/sep/04/nazi-looted-old-master-painting-giuseppe-ghislandi-recovered-argentina-property-listing-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T00:33:55.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady by the Italian master Giuseppe Ghislandi handed over by daughter of the late Nazi financier Friedrich Kadgien\nAuthorities in Argentina have recovered an 18th-century painting stolen more than 80 years ago by the Nazis from a Jewish art dealer in Amsterdam, a week after it was spotted by chance in a real estate listing.\nThe painting, the long-lost Portrait of a Lady (Contessa Colleoni) by the Italian master Giuseppe Ghislandi, was looted in the second world war. It was handed over on Wednesday to the Argentinian judiciary by the daughter of the late Nazi financier Friedrich Kadgien, Patricia Kadgien, who has been under house arrest with her husband since Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4647493f99a07420a1ef4cfae23d16464abeb4",
      "title": "Painting looted by Nazis recovered in Argentina",
      "url": "https://www.bbc.com/news/articles/cdx26z142vko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:42:37.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady had been missing for 80 years before it was spotted on an estate agent's website.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e0188df51044e2a6afe43803b87b36f9321b3c7",
      "title": "UAE warns Israel that annexing West Bank would cross 'red line'",
      "url": "https://www.bbc.com/news/articles/cx2rgjk87y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T23:37:50.000Z",
      "summary_90w": "",
      "raw": "The warning came after a far-right Israeli minister unveiled a proposal for the annexation of four-fifths of the occupied territory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1245c62348617cc726c1a1d4a245f8c55f34a7a8",
      "title": "Fashion college campus, home extension and Big Ben tower up for architecture award",
      "url": "https://www.bbc.com/news/articles/cx27nmj77xzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:32:19.000Z",
      "summary_90w": "",
      "raw": "The restoration of London's famous Elizabeth Tower is nominated for the prestigious Stirling Prize.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d21dcfce966a4585da6687b24e696aad8505ecad",
      "title": "Don't say sorry - the six things you should do if you're in a car accident",
      "url": "https://www.bbc.com/news/articles/c5ypypy2jk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:27:50.000Z",
      "summary_90w": "",
      "raw": "I've attended many car accidents for work, but being directly involved in one gave me a different perspective.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98b7072e63f65cb8f8e5db7a287fbfb6be2cb18f",
      "title": "It's 4,000 miles from Ukraine - but even this Asian city is part of Russia's war",
      "url": "https://www.bbc.com/news/articles/cvg0e54z7x8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:18:55.000Z",
      "summary_90w": "",
      "raw": "In Vladivostok, a city on China's and North Korea's border, Russia's war on Ukraine looms large.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cfc09d6ab9a52c9395b11757d33eee114660204",
      "title": "My toddler's constipation wasn't taken seriously until he reached crisis point",
      "url": "https://www.bbc.com/news/articles/cgr9zg17n5yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T23:11:04.000Z",
      "summary_90w": "",
      "raw": "The number of children being admitted to hospital with constipation is at a 10-year high.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b53717c5c6cdde27c9160090f2d00c6d1e7cc50",
      "title": "Mistral, the French AI giant, is reportedly on the cusp of securing a $14B valuation",
      "url": "https://techcrunch.com/2025/09/03/mistral-the-french-ai-giant-is-reportedly-on-the-cusp-of-securing-a-14-billion-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T22:13:51.000Z",
      "summary_90w": "",
      "raw": "The two-year-old OpenAI rival, founded by former DeepMind and Meta researchers, develops open source language models and Le Chat, its AI chatbot built for European audiences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b72ad38efe78e755fca9889d2957a89466b9c50c",
      "title": "Israel intensifies Gaza City attacks as UN warns of 'horrific' consequences for displaced families",
      "url": "https://www.bbc.com/news/articles/c740lm33wyeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T22:03:18.000Z",
      "summary_90w": "",
      "raw": "Strikes reportedly kill 31 people in the city, home to a million people and where a famine was declared last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "What we know about Lisbon's deadly funicular crash",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T21:33:06.000Z",
      "summary_90w": "",
      "raw": "At least 16 people died after a carriage on the city's famous Glória hillside railway derailed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d4c5b747987d82a211039841d33eb7c16e2d06f",
      "title": "What we know so far",
      "url": "https://www.bbc.com/news/articles/cn95l12epxzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:33:06.000Z",
      "summary_90w": "",
      "raw": "At least 16 people died after a carriage on the city's famous Glória hillside railway derailed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c699e70ea35239222c9c4bfa861a7fb5a238bbd9",
      "title": "Scale AI is suing a former employee and rival Mercor, alleging they tried to steal its biggest customers  ",
      "url": "https://techcrunch.com/2025/09/03/scale-ai-is-suing-a-former-employee-and-rival-mercor-alleging-they-tried-to-steal-its-biggest-customers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T21:21:30.000Z",
      "summary_90w": "",
      "raw": "Scale is clearly concerned enough about the threat of Mercor, and the poaching of one of its employees, to pursue legal action.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98b5084e74c414dfa3446f027f4d8bb72c4b3660",
      "title": "Migrant crisis: How Europe went from Merkel's 'We can do it' to pulling up the drawbridge",
      "url": "https://www.bbc.com/news/articles/cn5e5q7w41eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T21:00:06.000Z",
      "summary_90w": "",
      "raw": "A number of European governments are proposing restrictive measures on migrants in response to public concern",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89f59d31c354d6e17539bc89780fa6ae073b4b09",
      "title": "Apple’s Siri upgrade could reportedly be powered by Google Gemini",
      "url": "https://techcrunch.com/2025/09/03/apples-siri-upgrade-could-reportedly-be-powered-by-google-gemini/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:50:38.000Z",
      "summary_90w": "",
      "raw": "An AI Siri is in the works and it could be running Gemini under the hood.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "608102d1cdc7f5e8b6c4110e029582303678f921",
      "title": "xAI’s CFO is the latest executive to leave Elon Musk’s AI firm",
      "url": "https://techcrunch.com/2025/09/03/xais-cfo-is-the-latest-executive-to-leave-elon-musks-ai-firm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:27:06.000Z",
      "summary_90w": "",
      "raw": "While at xAI, Mike Liberatore helped orchestrate the company's $5 billion debt raise, alongside another $5 billion in equity — almost half of which came from SpaceX.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf98919d51795ddc07cb82891d7d5cfa15d71007",
      "title": "FirstClub bucks India’s speed obsession, quickly triples valuation to $120M with premium approach",
      "url": "https://techcrunch.com/2025/09/03/firstclub-bucks-indias-speed-obsession-quickly-triples-valuation-to-120m-with-premium-approach/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T20:21:08.000Z",
      "summary_90w": "",
      "raw": "FirstClub has raised $23 million in a Series A round co-led by Accel and RTP Global to expand its premium quick commerce platform.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "60f63920bc1218b34be171af49182de80b50c614",
      "title": "Angela Rayner Admits Underpaying Tax",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0p6d8?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-03T19:46:00.000Z",
      "summary_90w": "",
      "raw": "How did the housing secretary pay the wrong amount of stamp duty?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c70923c675b74837f6096d78a5bef59430d9d8de",
      "title": "CoreWeave acquires agent-training startup OpenPipe",
      "url": "https://techcrunch.com/2025/09/03/coreweave-acquires-agent-training-startup-openpipe/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T19:38:36.000Z",
      "summary_90w": "",
      "raw": "CoreWeave hopes the YC-backed startup will help it expand up the stack and cash in on enterprises developing AI agents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "295d2c34a4380cee11e95a8ab2f5dbc49137757e",
      "title": "How Trump's latest crypto launch enriches his family",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527047/trump-crypto-family-world-liberty-financial",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T19:36:02.000Z",
      "summary_90w": "",
      "raw": "The president and his sons made $5 billion on paper as their cryptocurrency started trading — highlighting the extraordinary degree to which they are personally profiting from Trump's return to the Oval Office.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9a34fb40907479b89130d9441396279060faf843",
      "title": "SpaceX gets a green light to more than double its Florida launches",
      "url": "https://techcrunch.com/2025/09/03/spacex-gets-the-green-light-to-more-than-double-its-florida-launches/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:36:59.000Z",
      "summary_90w": "",
      "raw": "SpaceX is one step closer to nearly tripling the number of Falcon 9 launches from Florida.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a67922731a4d2f341e0bc3fa19ee0e08803c518",
      "title": "Scotland bans arms companies that supply IDF from receiving financial aid",
      "url": "https://www.theguardian.com/uk-news/2025/sep/03/scotland-government-defence-israel-military-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:35:28.000Z",
      "summary_90w": "",
      "raw": "Devolved government says contractors seeking support must prove products will not be used by Israeli military \nThe Scottish government has banned arms companies which supply the IDF from getting grants and investment support, and will freeze support for trade with Israel.\nJohn Swinney, the first minister, said on Wednesday any defence contractors who wanted financial help in Scotland would have to prove their products would not be used by the Israel Defense Forces.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3802f6fd2bee9d8ee61c711ac7fde5acd34e24f6",
      "title": "Kim Jong-un promises to do ‘everything to assist’ Moscow after Putin meeting",
      "url": "https://www.theguardian.com/world/2025/sep/03/kim-jong-un-promises-to-do-everything-to-assist-moscow-vladimir-putin-russia-north-korea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T18:19:19.000Z",
      "summary_90w": "",
      "raw": "North Korean leader invited to visit Russia as Zelenskyy says Putin is displaying ‘impunity’ with new Ukraine strikes \n\nEurope live – latest updates\n\nVladimir Putin has invited Kim Jong-un to visit Russia during a lengthy meeting in Beijing on the sidelines of China’s biggest military parade, as Kim promised to do “everything I can to assist” Moscow.\nNorth Korea has supported Russia in its war against Ukraine with weapons and troops, and the Russian president praised North Korean fighters for acting “courageously and heroically”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af68edbf9f6bb8ab4fa969df7a091068a361887a",
      "title": "In a brawl over right-wing TV, Newsmax sues Fox News",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5527077/newsmax-sues-fox-news",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T18:14:43.000Z",
      "summary_90w": "",
      "raw": "Right-wing TV news outlet Newsmax sued Fox News on antitrust grounds, alleging the conservative media powerhouse had illegally sought to suppress its smaller rival's growth in cable news.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6023382567017df0bca69e13add09e70cf8b7a0b",
      "title": "Pornhub owner pays $5M settlement to FTC over historic failure to block abusive content",
      "url": "https://techcrunch.com/2025/09/03/pornhub-owner-pays-5m-settlement-to-ftc-over-historic-failure-to-block-abusive-content/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:12:21.000Z",
      "summary_90w": "",
      "raw": "Pornhub owner Aylo will pay a $5 million settlement to the FTC and Utah over allegations that the company knowingly profited off of illegal materials.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e6cbb96dc149ad762d5baa2b8b164817e5025ac",
      "title": "Google brings Material 3 Expressive to Pixel 6 and newer devices, along with other features",
      "url": "https://techcrunch.com/2025/09/03/google-brings-material-3-expressive-to-pixel-6-and-newer-devices-along-with-other-features/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T18:00:00.000Z",
      "summary_90w": "",
      "raw": "Google announced on Wednesday that it's bringing a slew of new features to the Android ecosystem and Pixel devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe4623dd6dfdd273b3a458c2fd443e30d7d549fd",
      "title": "Nuclear triad and ‘robot wolves’: parade shows off array of Chinese weapons",
      "url": "https://www.theguardian.com/world/2025/sep/03/nuclear-triad-robot-wolves-china-weapons-parade",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T17:38:40.000Z",
      "summary_90w": "",
      "raw": "On display in Beijing were nuclear weapons launched by air, sea and land, laser weapons and four-legged drones\nIt was hardly a subtle attempt to project power. China showed off air-, sea- and land-launched nuclear weapons in its parade on Wednesday, a triad intended to demonstrate that Beijing’s long-term aspiration is to match US military might.\nAlso on display were large underwater torpedo-like drones, intended to threaten western warships, as well as anti-drone lasers and four-legged “robot wolves”, all designed to be noticed, regardless of their actual military effectiveness.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f83daf3a017ddf3a870df3eeb4aa2aeb745d116c",
      "title": "Orchard Robotics, founded by a Thiel fellow Cornell dropout, raises $22M for farm vision AI ",
      "url": "https://techcrunch.com/2025/09/03/orchard-robotics-founded-by-a-thiel-fellow-cornell-dropout-raises-22m-for-farm-vision-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:30:00.000Z",
      "summary_90w": "",
      "raw": "The startup uses truck-mounted cameras to collect and analyze data about crop health.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "920eef3436c861dd0f375411b60299a89e501522",
      "title": "Google’s NotebookLM now lets you customize the tone of its AI podcasts",
      "url": "https://techcrunch.com/2025/09/03/googles-notebooklm-now-lets-you-customize-the-tone-of-its-ai-podcasts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:29:03.000Z",
      "summary_90w": "",
      "raw": "When generating an Audio Overview, users can now choose whether they want their AI podcasts to be formatted like a \"Deep Dive,\" \"Brief,\" \"Critique,\" or \"Debate.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "319a7a22278147fae972cf96226ea85b3d806c65",
      "title": "'Ketamine Queen' pleads guilty in Matthew Perry overdose case",
      "url": "https://www.bbc.com/news/articles/c2dng3rrzjdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T17:25:21.000Z",
      "summary_90w": "",
      "raw": "Jasveen Sangha, 42, pleads guilty to five charges relating to the actor's death in Los Angeles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13c94be78189f3935cdbfbe670647f55244e2071",
      "title": "Why the US government is taking a stake in Intel",
      "url": "https://techcrunch.com/2025/09/03/why-the-us-government-is-taking-a-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T17:22:36.000Z",
      "summary_90w": "",
      "raw": "The U.S. government's recent stake in Intel comes after a long period of floundering at the company's foundry business.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "847cdf520201641f774d1f1a7dc23443011f151a",
      "title": "Democrats blast state department for lack of ‘basic oversight’ of controversial Gaza food organization",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-democrats-gaza-humanitarian-foundation-letter",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:55:29.000Z",
      "summary_90w": "",
      "raw": "Letter by senior Democrats asks state department to reveal details behind financing of Gaza Humanitarian Foundation\nSenior Democratic senators have called on the US secretary of state, Marco Rubio, and the US ambassador to Israel, Mike Huckabee, to reveal details behind the financing and oversight of the Gaza Humanitarian Foundation (GHF) amid concerns over rising death tolls near aid sites, the group’s apparent coordination with the Israeli army and its reported use of private military contractors linked to intelligence operations.\nThe letter, co-signed by senators Elizabeth Warren, Chris Van Hollen and Peter Welch, accuses the state department of an “inability to answer basic questions about GHF in a timely manner” and said that the department’s “overriding of internal protocol and staff warnings is particularly concerning given it is unlikely to be able to conduct basic oversight of the funds it provided to GHF”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "120d64af2dfb7dfb6fb4a3fc8eb9b9309b435b54",
      "title": "Hot mic catches Xi and Putin discussing organ transplants and immortality",
      "url": "https://www.bbc.com/news/articles/cr70rvrd41ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T16:51:50.000Z",
      "summary_90w": "",
      "raw": "The Chinese and Russian leaders have been in power for 13 and 25 years respectively, with neither expressing any intention of stepping down.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98d024e06fb98ebf0f6fe23522c10d3e006427ef",
      "title": "Charges against Brazil's Bolsonaro are political, says lawyer",
      "url": "https://www.bbc.com/news/articles/ce83881001eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T16:44:00.000Z",
      "summary_90w": "",
      "raw": "The former Brazilian president denies conspiring to overturn his 2022 election loss to his left-wing rival, Luiz Inácio Lula da Silva.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5ec774211d5e8c3171f2dda0016d398b822f70c",
      "title": "Top Obama-era Latin American expert warns of ‘disastrous’ US intervention in Venezuela",
      "url": "https://www.theguardian.com/world/2025/sep/03/us-military-venezuela-strike-guerrilla-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:39:43.000Z",
      "summary_90w": "",
      "raw": "US military buildup and attack on alleged narco boat spark fears of protracted guerrilla war in South America\n\nTrump’s Venezuela gunboat diplomacy: sabre-rattling or prelude to invasion?\n\nThe White House’s former top Latin America official has said he fears the US could stumble into a protracted guerrilla war in Venezuela after Donald Trump ordered a military strike on a boat in the Caribbean Sea, killing 11 alleged drug traffickers.\nTuesday’s controversial strike off the Venezuelan coast – which was reportedly carried out by an attack helicopter or Reaper drone – came after the US president ordered a major naval deployment to the region, ostensibly to combat South American drug traffickers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb3eb7b94623fc51ae1c08c10752296a5d7e4fc",
      "title": "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade",
      "url": "https://www.theguardian.com/world/2025/sep/03/china-military-parade-xi-jinping-appears-with-vladimir-putin-kim-jong-un",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T16:30:18.000Z",
      "summary_90w": "",
      "raw": "Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to the west\nXi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance to the west.\nPutin and Kim, the authoritarian leaders of Russia and North Korea, were among dozens of world leaders who attended the parade, a massive display of military hardware and personnel, orchestrated to mark the 80th anniversary of the end of the second world war, which China calls the War of Resistance against Japanese Aggression.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4faf372ef14ce0458581ba779fffd0f15ef82fa1",
      "title": "Roblox expands use of age-estimation tech and introduces standardized ratings",
      "url": "https://techcrunch.com/2025/09/03/roblox-expands-use-of-age-estimation-tech-and-introduces-standardized-ratings/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:27:08.000Z",
      "summary_90w": "",
      "raw": "Roblox says it's expanding its use of age-estimation technology and entering a partnership with the IARC to standardize its game ratings.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "10587fbf7ffd4ee0dec75ed68a9b8396edcf704e",
      "title": "Netflix CPO Eunice Kim joins TechCrunch Disrupt 2025 to talk scaling product and reimagining entertainment",
      "url": "https://techcrunch.com/2025/09/03/netflix-cpo-eunice-kim-is-coming-to-techcrunch-disrupt-2025-to-talk-tech-tools-and-yes-its-password-sharing-strategy/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:15:00.000Z",
      "summary_90w": "",
      "raw": "At TechCrunch Disrupt 2025, Netflix chief product officer Eunice Kim will be joining the Disrupt Stage to share Netflix's evolving story and what's to come.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "76db61ca2aab9ea9206f6c937ff185ef2831d74e",
      "title": "Instagram is finally launching an iPad app",
      "url": "https://techcrunch.com/2025/09/03/instagram-is-finally-launching-an-ipad-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Until now, Instagram on iPad was just a blown-up iOS app, which wasn't pleasant to look at. The company said that it has now revamped the experience to suit the big screen.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7782a9740391ba664ec1d8c06d9568db34f0627a",
      "title": "Venezuela’s president thinks American spies can’t hack Huawei phones",
      "url": "https://techcrunch.com/2025/09/03/venezuelas-president-thinks-american-spies-cant-hack-huawei-phones/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-03T15:44:20.000Z",
      "summary_90w": "",
      "raw": "Huawei phones, given their custom hardware and operating system, may actually be easier to hack than other brands.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20734de9be72d9662dfcda04a60d7fdca24067c1",
      "title": "Middle East crisis: at least 21,000 children disabled in Gaza during war, says UN committee – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:55:30.000Z",
      "summary_90w": "",
      "raw": "More than 40,000 have suffered ‘new war-related injuries’ with more than half left disabled, says UN Committee on the Rights of Persons with Disabilities\nYemen’s Houthis have claimed responsibility for a missile launched at Israel (see 8.17am BST), saying they fired two ballistic missiles at Tel Aviv in what they said was an initial response to Israeli attacks on Yemen.\nThe Israeli military moved deeper into Gaza City on Wednesday, with soldiers and tanks pushing into Sheikh Radwan, one of the urban centre’s largest and most crowded neighbourhoods, reports Reuters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d644e189ccfca378169b39abe9c5397dc4cdc763",
      "title": "China's Xi steals the limelight in a defiant push against US-led world order",
      "url": "https://www.bbc.com/news/articles/cn0rllxld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:20:11.000Z",
      "summary_90w": "",
      "raw": "President Xi shows off his power and influence in an open challenge to US supremacy and the world order.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4b320d7c559404ee6a9e86f76846ac5cc80f3b5",
      "title": "Xi, Putin and Kim show united front at huge Chinese military parade",
      "url": "https://www.bbc.com/news/articles/cp8z83np4xjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T13:00:42.000Z",
      "summary_90w": "",
      "raw": "Speaking during the spectacle in Beijing, China's President Xi Jinping said the world faced a choice between peace and war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "06aa1975d4538ca33b10208bfacf5a7f5dcd9730",
      "title": "Race to find survivors after Sudan landslide kills hundreds",
      "url": "https://www.bbc.com/news/articles/cdj2jygzzk9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T12:24:51.000Z",
      "summary_90w": "",
      "raw": "Sunday's landslide followed heavy rain and \"levelled\" a remote village, a local armed group says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bba0eaca95165227d0d96eda644426c5cdcaeca1",
      "title": "Israeli drones dropped grenades near peacekeepers in south Lebanon, UN says",
      "url": "https://www.theguardian.com/world/2025/sep/03/israeli-drones-drop-grenades-near-peacekeepers-in-south-lebanon-un-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T12:17:48.000Z",
      "summary_90w": "",
      "raw": "Unifil condemns ‘serious attack’ on Tuesday morning as it was clearing a road and adds that no one was hurt \nIsraeli drones dropped four grenades near UN peacekeepers in south Lebanon, the agency’s force said on Wednesday, in what it described as “one of the most serious attacks” on its personnel since a November ceasefire.\nThe UN peacekeeping force in Lebanon, Unifil, said the Tuesday morning attack came as it was clearing a road to a UN position close to the Israeli border, adding that no one was hurt.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9122eaec0d3c3caa2eb5e06cd8a21774dc756b3",
      "title": "Hitler's bunker is now just a parking lot. But it's a 'dark tourism' attraction anyway",
      "url": "https://www.npr.org/sections/planet-money/2025/09/03/g-s1-86572/hitlers-bunker-is-now-just-a-parking-lot-but-its-a-dark-tourism-attraction-anyway",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T10:30:00.000Z",
      "summary_90w": "",
      "raw": "Why evil histories sell. A visit to Hitler's bunker, and a deep dive into the economics and ethical quandaries of \"dark tourism.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bba2abf1bd7679d758e566b85c2b34ab1cb61beb",
      "title": "Trump says 11 killed in US strike on 'drug-carrying vessel from Venezuela'",
      "url": "https://www.bbc.com/news/articles/cpwywjgynyxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T09:10:59.000Z",
      "summary_90w": "",
      "raw": "The Trump administration has signalled a willingness to use military force against drug cartels.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ded1eba6568cb83acb1b0db7a34aa4a6154c7d25",
      "title": "Food giant Kraft Heinz to split into two companies",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5525657/food-giant-kraft-heinz-to-split-into-two-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-03T09:02:02.000Z",
      "summary_90w": "",
      "raw": "Food giant Kraft Heinz is splitting up into two companies a decade after the merger that was arranged by billionaire investor Warren Buffett.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5debd60595c533c7f34df6227b2e6380f4d5af44",
      "title": "Hundreds of women with brooms join protests as Indonesia leader flies to China",
      "url": "https://www.bbc.com/news/articles/c7vlv2gpvvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:48.000Z",
      "summary_90w": "",
      "raw": "Hundreds of women brandishing broomsticks marched to parliament during fierce nationwide rallies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9dcf43076631b3c2c6573bfa4a1ac5edbdb782d9",
      "title": "Putin thanks Kim for North Koreans fighting in Ukraine",
      "url": "https://www.bbc.com/news/articles/cj9w9m1xz1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T08:14:39.000Z",
      "summary_90w": "",
      "raw": "Thousands of North Korean soldiers are thought to have died while fighting for Russia during its war in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de0e062ec6e6aede6d5bbe684aaeb1a28f8eaef8",
      "title": "Floods kill 30 and submerge 1,400 villages in Indian state",
      "url": "https://www.bbc.com/news/articles/cvg4g95y7pjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T06:23:23.000Z",
      "summary_90w": "",
      "raw": "More than 354,000 people have been affected by the worst floods since 1988, as rescue efforts continue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19748ab56d2566a698991b9886df485db53e89a0",
      "title": "US House panel releases 33,000 pages of Epstein files",
      "url": "https://www.bbc.com/news/articles/cp949lrj373o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T01:12:07.000Z",
      "summary_90w": "",
      "raw": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd9711cb196a8a00d95830cc9302c67960583c10",
      "title": "Jury clears Cardi B of assault on security guard in Los Angeles",
      "url": "https://www.bbc.com/news/articles/cgjyj0dp3ego?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-03T00:19:19.000Z",
      "summary_90w": "",
      "raw": "A number of viral moments thrust the civil case into the spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7a68a331a49b9b4892ef7c9ad493a7664760f13",
      "title": "Captain Scott’s famous polar shipwreck as never seen before",
      "url": "https://www.bbc.com/news/articles/cpwyvyqkx9yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T23:21:27.000Z",
      "summary_90w": "",
      "raw": "The Terra Nova carried Captain Scott and his men on their doomed expedition to the South Pole.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "464e9fe0d3287700f5827f0ab6d4850271d64bf9",
      "title": "Why is Trump targeting America's most powerful bank?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m0fw7d?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-02T23:01:00.000Z",
      "summary_90w": "",
      "raw": "Can he take control of the Federal Reserve?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "17e7d39ae2faa39d2f10de1ed3722bba3e01e76d",
      "title": "Trump's tariffs are in limbo. So what now? How 3 businesses are adjusting — again",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5525791/appeals-court-tariffs-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T21:08:39.000Z",
      "summary_90w": "",
      "raw": "A federal appeals court struck down most of President Trump's import taxes. But the tariffs are still being collected for now — leaving U.S. importers in a kind of tariff limbo.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "fe3ea0609a814b72cff681d5788c7defd3c9a0b2",
      "title": "Electric vehicle sales increase as federal tax credits for them come to an end",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5494650-e1/electric-vehicle-sales-increase-as-federal-tax-credits-for-them-come-to-an-end",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-02T20:52:12.000Z",
      "summary_90w": "",
      "raw": "Federal discounts for electric vehicles expire at the end of the month. The deadline has led to a spike in EV sales and whiplash for auto dealers.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "275def6966a5d40e480db28f60586589a73383eb",
      "title": "Strong aftershock hits Afghanistan after quake kills more than 1,400",
      "url": "https://www.bbc.com/news/articles/cpqvqeg3nz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-02T16:20:58.000Z",
      "summary_90w": "",
      "raw": "Many remain trapped under rubble as rescuers use helicopters in remote areas hit by recent landslides.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00544f91120d47f60af75b83a26d6914b73eee2a",
      "title": "'AI slop' videos may be annoying, but they're racking up views — and ad money",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5493485/ai-slop-videos-youtube-tiktok",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics say that \"slop\" videos made with generative AI are often repetitive or useless. But they get millions of views — and platforms are grappling with what to do about them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}