{
  "version": "1758117209645",
  "generatedAt": "2025-09-17T13:53:29.645Z",
  "items": [
    {
      "id": "dddde729384fa6cd2f27140f56afef18a74a2920",
      "title": "Casio’s stress-relieving furry robot is coming to the US",
      "url": "https://www.theverge.com/news/779857/casio-robot-furry-pet-moflin-us-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:43:14.000Z",
      "summary_90w": "",
      "raw": "Moflin uses touch sensors hidden beneath its fur to detect physical interactions like it being pet. | Image: Casio\t\n\nFirst announced nearly a year ago, Casio’s robotic pet Moflin has been selling so well in Japan, according to the Wall Street Journal, the company is now expanding its availability to other markets including the UK and the US. Preorders for the gold or silver version of Moflin are now available through Casio’s US website. The robot, which looks like an oversized extra-fluffy hamster, is undoubtedly cute, but its limited capabilities could make its $429 price tag a tough sell.\nUnlike Sony’s robotic dog Aibo that can wander around your home, Moflin can’t get around on its own. Its movements are limited to its head that can rotate from side to side and tilt up and down which the robot uses to express simulated emotions and affection. It’s designed to be held and cuddled to provide “a calming presence” and “quiet reassurance,” according to Casio. But Moflin isn’t completely silent. It can make quiet sounds that will evolve over time to feel more expressive in order to create a stronger simulated bond with you.\nMoflin can also recognize individual people through their voices and responds to touch through sensors hidden beneath its fur. Using AI it will develop a unique personality over time based on how you interact with it, which will vary from person to person. Moflin can end up being cheerful and will energetically move around while making sounds, or it can become quiet, docile, and shy if the robot isn’t interacted with enough. Despite being an electronic device, Casio hasn’t included a way to reset Moflin if you don’t like the personality it develops. Like a real pet, you’ll need to responsibly care for it right from the get go.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c20334a4046cd566363ec8bd46520f0bfda45dfa",
      "title": "EU’s proposed trade suspension with Israel ‘appropriate and proportionate’ given crisis in Gaza, Šefčovič says – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T13:35:06.000Z",
      "summary_90w": "",
      "raw": "EU trade commissioner says proposed partial trade suspension is ‘carefully considered response’ to humanitarian crisis in Gaza\nNordic correspondent\nDenmark is for the first time to buy long-range precision weapons such as missiles and drones, Mette Frederiksen has abruptly announced, as she warned “Russia is testing us”.\nThere is no doubt that Russia will be a threat to Denmark and Europe for many years to come.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a590a97c6e9f5ed679e048b15b33b134c546162",
      "title": "Israel opens ‘temporary’ route for residents to flee as troops and tanks push deeper into Gaza City – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T13:31:41.000Z",
      "summary_90w": "",
      "raw": "The Israeli military said the route via Salah al-Din street ‘will be open for 48 hours only’ \nThe Israeli army said it has struck more than 150 targets in Gaza City since launching a major ground offensive on the Gaza Strip’s main urban hub early on Tuesday.\n“Over the past two days, the [Israeli air force] and artillery corps troops struck over 150 terror targets throughout Gaza City in support of the manoeuvring troops in the area,” the military said in a statement issued on Wednesday, reports Agence France-Presse (AFP).\nNo one can fail to be distressed by the devastating impact the war has had on the children of Gaza, and I cannot imagine the fear and anguish their families have endured. It is a soul-destroying situation that compels us to act.\nEvery child deserves the chance to heal, to play, to simply be able to dream again. These young patients have witnessed horrors no child should ever see, but this marks the start of their journey towards recovery.\nIn Gaza, where the healthcare system has been decimated and hospitals are no longer functioning, there are severely ill children unable to get the medical care they need to survive.\nAs we welcome the first group of children to the UK for urgent treatment, their arrival reflects our determined commitment to humanitarian action and the power of international cooperation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04bb827d91873a42e4c8374f33ff9b2a1c728235",
      "title": "Upgrade your everyday carry setup with these 22 picks",
      "url": "https://www.theverge.com/tech/771373/everyday-carry-edc-gift-guide",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:30:00.000Z",
      "summary_90w": "",
      "raw": "What we carry says a lot about what’s important to us, who we are, and who we aspire to be. This fall, it’s worth examining what you bring with you every day and thinking about how you could refine it. Perhaps you carry too much, and a utility pouch that’s just a bit bigger than a wallet could reduce (or at least help organize) the clutter in your pockets or purse. Or perhaps you want to be more prepared for what the day could bring, with compact tools like a notepad, pen, and maybe a multitool.\nWe created this guide to help you upgrade your everyday carry setup. It’s full of gear we use every day and tools you might want to make a part of your daily rotation. Your setup doesn’t have to be complicated, expensive, or include the same flashlight, lever-action pen, and pocket knife as everyone else. But if you do want more inspiration, the everyday carry subreddit is full of people who proudly show off their optimized setups.\nHoto 24-in-1 manual screwdriver pen\nHoto specializes in delivering useful tools in unexpectedly convenient form factors. This precision screwdriver pen is no exception. The top unscrews to reveal 24 bits, making it a handy repair tool that’s small enough to carry everywhere.\n\nWhere to Buy:\n\n $19.99 at Amazon\n\nGoBites Spin Collapsible Spork\nA collapsible spork might not be what you had in mind for the next addition to your keychain, but hear us out: you’ll no longer have to ask for disposable cutlery at restaurants, and you’ll never be without a way to munch on the move.\n\nWhere to Buy:\n\n $8.95 at REI\n\nPebblebee Card Universal\nPebblebee’s card-sized Bluetooth tracker is easy to recommend. It’s compact and rechargeable with 18 months of battery life, and it also works with both Android and iPhone’s respective Find My apps. Slip it in a card slot and never lose your wallet again.\n\nWhere to Buy:\n\n $34.99 at Amazon\n $34.99 at Best Buy\n $34.99 at Pebblebee\n\nIniu Pocket Rocket P50 power bank\nMighty power banks don’t have to be cumbersome. Iniu’s 10,000mAh P50 is about as thick as a deck of cards, but it features 45W charging, two USB-C ports, and one USB-A port. Its braided lanyard doubles as a USB-C cable.\n\nWhere to Buy:\n\n $38.99 $29.99 at Amazon\n\nViperade VE1-OW EDC waxed canvas pouch\nViperade’s canvas pouch is a great way to consolidate your carry. It has space for cash and cards, as well as tools like a pen, a compact flashlight, knife, a notebook, a multitool, and more.\n\nWhere to Buy:\n\n $16.99 at Amazon\n\nBaseus Free2Pull Retractable USB-C Cable\nBaseus’ Free2Pull is an everyday essential if you frequently need to recharge your gadgets. The puck contains a three-foot USB-C cable with 100W maximum passthrough that gets out of the way as soon as you no longer need it.\n\nWhere to Buy:\n\n $21.99 $12.99 at Amazon\n $21.99 $12.99 at Walmart\n $21.99 $16.99 at Baseus\n\nAirPods Pro 3\nApple’s AirPods Pro are a tech staple made better with the new third generation. Their noise cancellation is stellar, they have longer battery life than the previous model, and they can even track your heart rate during workouts. They’re handy for music, for calls, and for fun.\n\nWhere to Buy:\n\n $249 at Apple\n $249 at Amazon\n $249.99 at BestBuy\n\nDistil Osprey sunglasses\nThese good-looking, durable sunglasses can magnetically attach to surfaces for safe and convenient storage. The aviator-style Osprey design has UV400 protection, includes a case, and should look great on you.\n\nWhere to Buy:\n\n $69 $35 at Distil\n\nRovyVon Angel Eyes E1 hybrid keychain flashlight\nThere’s a lot to appreciate about this 700-lumen rechargeable keychain flashlight. It features a built-in battery (rechargeable via USB-C) as well as a AAA battery backup, so you won’t be left in the dark.\n\nWhere to Buy:\n\n $32.95 at RovyVon\n\nLeatherman Skeletool CX multitool\nLeatherman’s Skeletool CX features no leather. True to its name, it provides only the necessities, including a knife, pliers (needlenose and regular), wire cutters, large bit drivers, and a carabiner that doubles as a bottle opener. \n\nWhere to Buy:\n\n $89.95 at REI\n\nMoleskine Cahier journal (ruled, set of 3)\nJournaling is an art form that just doesn’t feel the same on phones. Moleskine’s Cahier journals are perfect to carry around. They’re useful for jotting down ideas or to-dos or just for reflecting on your daily adventures. \n\nWhere to Buy:\n\n $15.27 $12.89 at Amazon\n\nAllett Original bi-fold wallet\nAllett’s nylon bifold is a great, water-resistant minimalist wallet with four stretchy card pockets and a billfold for cash.\n\nWhere to Buy:\n\n $48 at Amazon\n\nTushy travel bidet\nYou might get stranded without toilet paper when you need it most. Whether that happens, or you just prefer a more eco-friendly solution to cleaning up down there, Tushy’s portable bidet is a small, yet transformative addition to your EDC.\n\nWhere to Buy:\n\n $24.95 at Amazon\n\nGoPro Max (2025)\nDon’t kid yourself, your everyday adventures are worth capturing in an immersive 360 degrees, whether you’re biking, hiking, or just walking around the neighborhood. The GoPro Max makes it easy to turn casual activities into something more memorable.\n\nWhere to Buy:\n\n $369.99 $249.99 at Amazon\n $369.99 $249.99 at Best Buy\n $369.99 $249.99 at GoPro\n\nGoogle Pixel 10 Pro\nGoogle’s new Pixel 10 Pro delivers flagship design and performance, and AI features that feel more useful in practice compared to last year’s phone. Its stellar camera system is another big selling point.\n\nWhere to Buy:\n\n $999 at Amazon\n $999 at Best Buy\n $999 at Google\n\nUni-ball Vision rollerball pens (red, 12-pack)\nThese Uni-ball pens deliver reliable, satisfying writing performance. Whether you need to jot down your next great idea, a to-do, or a recipe, grab a box of these so you can always have a great pen within arm’s reach. \n\nWhere to Buy:\n\n $19.89 at Amazon\n\nOhSnap Snap Grip\nThe Snap Grip makes it easier to hold your phone, or position it just right for whatever the situation requires. Want to watch your phone while you eat lunch? Pop out the kickstand. Or, stick it to a fridge or any magnetic surface.\n\nWhere to Buy:\n\n $39.99 $19.99 at Best Buy\n\nTimbuk2 Flight Classic messenger bag\nEveryone needs a bag that’s bigger on the inside. Timbuk2’s messenger bag has a weatherproof exterior, and can fit a large camera, a laptop, a water bottle, and more. Its many pockets will likely be enough for your most essential everyday carry items.\n\nWhere to Buy:\n\n $134 at Timbuk2\n\nCasio A168W-1 watch\nDespite the rise in popularity of smartwatches (and smart rings), sometimes a simple watch is all you need. This stainless steel Casio watch is a design classic, with handy features like a frontlight, stopwatch, and alarm function.\n\nWhere to Buy:\n\n $29.99 at Amazon\n\nTakeya Actives water bottle\nIt’s worth spending a little more for a good water bottle. Takeya’s Actives double-walled, leakproof bottle can keep beverages hot or cold for hours, and features a narrow spout for easy drinking.\n\nWhere to Buy:\n\n $29.99 at Amazon\n\nAnker 332 USB-C hub (5-in-1)\nThe world runs on USB-C these days, praise be. So, carrying a tiny, port-packed USB-C hub isn’t a bad idea, as it grants instant access to more USB ports, fast passthrough charging, and an HDMI port.\n\nWhere to Buy:\n\n $24.99 at Amazon\n\nTwelveSouth PowerBug\nThe compact PowerBug wall charger offers 15W Qi2 magnetic charging (with support for MagSafe and PixelSnap), and a USB-C port to charge something else at up to 35W. Bonus perk: it’s not an outlet hog.\n\nWhere to Buy:\n\n $49.99 at Amazon",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "af167b1567c0ce2768d585f23c8b91b0b4396d91",
      "title": "Sony’s PS5 update adds controller swapping and Power Saving mode",
      "url": "https://www.theverge.com/news/779837/sony-playstation-5-ps5-update-power-saving-mode",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:28:25.000Z",
      "summary_90w": "",
      "raw": "PS5 users can now run select games in “Power Saving” mode and pair DualSense controllers with multiple devices. Sony started beta testing these features in July, but they’re now rolling out to everyone today in the version 25.06-12.00.00 console software update.\nThe new Power Saver mode will reduce the power consumption of PS5 consoles in exchange for scaling back game performance, according to Sony’s PS5 update notes, which could come in handy for the company’s rumored PlayStation handheld. Power Saving mode can be toggled on or off for supported games by heading into Settings > System > Power Saving > Use Power Saver. When enabled, an icon will appear next to the supported game in Switcher or the control center, according to Sony.\nThe software for DualSense and DualSense Edge wireless controllers has also been updated to make it easier to switch them across connected devices. Controllers can now be paired with up to four devices simultaneously, preventing users from having to go through the cumbersome process of manually reconnecting the controller when switching between consoles, PCs, and cloud streaming devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d227bd36842a416f0969b77e0e45c4737987e29",
      "title": "Terra Oleo’s oil-producing microbes could replace destructive palm oil plantations",
      "url": "https://techcrunch.com/2025/09/17/terra-oleos-tiny-oil-producing-microbes-might-replace-sprawling-palm-oil-plantations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T13:10:00.000Z",
      "summary_90w": "",
      "raw": "Terra Oleo had operated in stealth for years, developing yeast strains capable of producing high-value oils that don't need refining. It has raised $3.1 million.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b02b791ae4ce2ccc830a9f4050a535c80106eb3",
      "title": "Lyft and Waymo are partnering to bring robotaxis to Nashville",
      "url": "https://techcrunch.com/2025/09/17/lyft-and-waymo-are-partnering-to-bring-robotaxis-to-nashville/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T13:05:00.000Z",
      "summary_90w": "",
      "raw": "Waymo is tapping an old partner, Lyft, to launch a robotaxi service in Nashville.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b143285e48717f98dcf0c764c7ceafb9dc72c1a4",
      "title": "How to watch Mark Zuckerberg’s keynote at Meta Connect 2025",
      "url": "https://www.theverge.com/news/777565/meta-connect-2025-how-to-watch-keynote-mark-zuckerberg",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Meta is about to kick off its annual Connect conference, beginning with a keynote address from CEO Mark Zuckerberg on Wednesday night. Zuckerberg plans to discuss “the latest on AI glasses” and will lay out “Meta’s vision for artificial intelligence and the metaverse,” according to the Connect website.\nAs my colleague Victoria Song writes, Meta’s smart glasses are due for a major upgrade, and based on a leaked video from Meta, it seems like the company will announce exactly such a product during Connect: its first glasses with a screen. That video also showed new wraparound Oakley smart glasses. And Meta’s mention of the metaverse makes me think that Meta’s Horizon OS and VR work will get some airtime, as well.\nZuckerberg’s keynote kicks off at the unusually late time of 8PM ET / 5PM PT. You can register on Meta’s Connect website to watch the livestream, and Meta also says you can watch the keynote from its Meta for Developers Facebook page or inside Horizon Worlds. The Verge will be covering the event live.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aa97bbd4adda3f81daeb5229160a160e44af24ee",
      "title": "Icarus raises $6.1M to take on space’s “warehouse work” with embodied-AI robots",
      "url": "https://techcrunch.com/2025/09/17/icarus-raises-6-1m-to-take-on-spaces-warehouse-work-with-embodied-ai-robots/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Icarus Robotics wants to liberate astronauts from time-sucking logistics labor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "38668454af3011820f385671a922b3203388b642",
      "title": "Republicans are honoring Charlie Kirk’s memory by declaring war on the First Amendment",
      "url": "https://www.theverge.com/policy/779799/republican-charlie-kirk-first-amendment-crackdown-continues",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Holding a principled commitment to the First Amendment is a challenge. Even so, it's been bemusing to watch the Republican Party - which has spent years demanding legal cover for sending spam emails, sabotaging public health, and avoiding social media moderation - launch a full-scale broadside against it over the past week.\nAuthorities are just beginning to parse what motivated a Utah man to charged with the murder of conservative activist Charlie Kirk - an act, obviously, of unjustifiable violence. But the aftermath has been an extraordinary political crackdown. Within days, Donald Trump had laid the blame at the feet of people who had cri …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a538464f65113cfe5959fc552f90e74d15e7ffa4",
      "title": "Track power outages in real time across the US with the Ting app",
      "url": "https://www.theverge.com/science/779089/power-outage-blackout-map-app-ting",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The Ting app includes a new power outage map for the US.\t\n\nThere’s a new, free tool to help Americans monitor power outages in real time. Compiling data from its vast network of home sensors, startup Whisker Labs is launching the feature today in its Ting app. \nYou don’t actually need to have one of these sensors in your home to use the Ting app to track a power outage. Whisker Labs, which shared the announcement first with The Verge, says it is the only app to offer immediate outage alerts at such a hyperlocal level across the US.\nThe tool could help fill in the blanks for folks wondering whether they can return to a home with power after an outage or related disaster. With weather-related blackouts more prevalent now than in the past, utilities are struggling to turn the lights back on and keep customers updated at the same time. \n\nThe tool could help fill in the blanks for folks wondering whether they can return to a home with power after an outage\n\n\nThe service is based on a network of 1.1 million homes across the US that have installed a Whisker Labs sensor, also called Ting, meant to prevent electrical fires. The sensor detects micro-arcing or sparking, perhaps the result of faulty wiring or a malfunctioning device. Whisker Labs CEO Bob Marshall cofounded the company after his sister-in-law lost her home to an electrical fire. The sensor is primarily meant to give residents enough advance warning that they take action to stop that arcing from becoming a full-blown fire.\nUntil now, the Ting app was limited to people using the sensor to monitor a particular property. The app had the added bonus of notifying users if the power went out at the location where they installed the sensor. But after hearing how useful the app’s power outage notifications were to Whisker Labs’ customers and their neighbors, the company decided to revamp the app to make that service accessible to anyone regardless of whether or not they have the sensor installed.\nNow, the Ting App, which is available on Apple’s App Store and Google Play, includes an interactive national outage map for the US. In the app, users can search for and save an address to see if there’s an outage affecting that area, and crucially, whether power has returned. \nMarshall said there happens to be a Ting sensor installed within a mile of roughly 95 percent of homes across the US. Each sensor takes 30 million electrical measurements per second — fast enough to notice voltage dropping and shoot off a signal to warn that the home is about to lose power before it actually happens. When Whisker Labs loses data from multiple sensors at the same time, it can tell there’s a power outage affecting a broader community.\nIn the aftermath of widespread outages caused by Hurricane Beryl in Texas last year, “We had customers telling us that they were the information source for their friends and families and community to know when their neighborhood had power again,” Marshall says. Beryl was also when many people reportedly turned to the Whataburger app as a makeshift power outage map because it showed which locations were open again after the storm. \nIn my own reporting on disasters, I’ve heard from folks who hunkered down in their homes during power outages and became the main source of information for neighbors who’d evacuated and needed to know when they could return. After Hurricane Ida left New Orleans residents without power in 2021, residents said a local utility’s glitchy maps showed that power was restored in their neighborhood even when that wasn’t necessarily the case on the ground. I’ve also used PowerOutage.us to keep track of large blackouts across the US, but that also relies on data from utilities and doesn’t zoom in as closely as the Ting app does. So I can see how helpful it might be to have another option out there to use.\nAfter all, climate change is hitting aging power grids with increasingly extreme weather. The US experienced 60 percent more weather-related outages during the summer months over the past decade than it did during the 2000s, according to a report published last year. “Major events” including hurricanes and winter storms have led to more prolonged blackouts in the US, data from the US Energy Information Administration similarly shows. Residents experienced an average of 5.5 hours of electricity interruptions in 2022, compared to around 3.5 hours in 2013.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2ef42d1c19d17bb007cf12b499a8f149c8235499",
      "title": "Waymo to launch a robotaxi service in Nashville in 2026",
      "url": "https://www.theverge.com/news/779147/waymo-robotaxi-nashville-lyft-2026",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Waymo is bringing its robotaxis to Music City, USA. \nThe Alphabet-owned company plans on launching its robotaxi service in Nashville in 2026. Customers will be able to hail a ride initially through the Waymo One app, and then later through the Lyft app. Lyft will also handle fleet services, such as cleaning, maintenance, and EV charging. \nWaymo arrived in Nashville earlier this year as part of its annual “road trip,” in which the company operates its vehicles manually in various cities to collect data on varying weather conditions and regional driving habits. Waymo says it will shift into autonomous testing later this year, followed by the launch of a commercial robotaxi service in 2026. \nThe partnership with Lyft is an interesting wrinkle to this news. The two companies worked together briefly in Phoenix in 2019. Lyft customers were able to hail rides in Waymo vehicles for a short period. Waymo then shifted to teaming up with Uber as its ridehail platform of choice in two cities: Austin and Atlanta. Today’s news signals that Lyft is still in running for future collaborations. \nLyft says it will use its Flexdrive system, which provides “end-to-end fleet management, including vehicle maintenance, infrastructure, and depot operations,” to manage of Waymo’s robotaxis in Nashville. And the ridehail company will build a fleet management facility in Nashville for Waymo’s robotaxis, including EV charging. \nIn addition to Nashville, Waymo has said it will launch commercial operations in Washington, DC, Miami, Denver, Seattle, Dallas, and New York City.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b4f039673c45cdd270920a086143ecd10779d38a",
      "title": "IDF try to force civilians out of Gaza City as ground offensive continues",
      "url": "https://www.theguardian.com/world/2025/sep/17/idf-try-to-force-civilians-out-of-gaza-city-as-ground-offensive-continues",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T12:57:53.000Z",
      "summary_90w": "",
      "raw": "Two army divisions work their way toward centre of Gaza City as further Israeli airstrikes destroy buildings\n\nMiddle East crisis – live updates\n\nIsraeli troops have been trying to force more people out of their Gaza City homes as part of a ground offensive that is destroying large parts of Gaza’s biggest urban centre.\nThe Israel Defense Forces (IDF) said on Wednesday they had carried out 150 air and artillery strikes before the ground operation that began early on Tuesday morning. Two army divisions are working their way slowly towards the city centre and are expected to be joined by a third in the coming days.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0acdb1b5357e58a97cd2569b29d8bf9ac71f2b51",
      "title": "Greetings from American University of Beirut, where more than 1,000 cats roam",
      "url": "https://www.npr.org/2025/09/17/g-s1-89071/cats-american-university-beirut-lebanon",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T12:53:08.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: Trump and Melania meet royals at Windsor",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T12:51:23.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9603a052d7785cca0c064f9d877625fe0d0b2f1b",
      "title": "In pictures: US President Donald Trump on second state to UK",
      "url": "https://www.bbc.com/news/articles/c4gqd70v496o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:51:23.000Z",
      "summary_90w": "",
      "raw": "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c52dcc435dc8294c44b9cdaa21dbc0a90420a1c5",
      "title": "Trucks set ablaze as militants block key Senegal-Mali trade route",
      "url": "https://www.bbc.com/news/articles/c708n1ry8k4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:51:09.000Z",
      "summary_90w": "",
      "raw": "Islamists fighters are trying to prevent deliveries of fuel and other essential supplies to landlocked Mali.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "669ac1cd3d4779e76356f5e7001d277fe3bf6d2e",
      "title": "Tests show Navalny was poisoned in jail, his widow says",
      "url": "https://www.bbc.com/news/articles/c5ye0x28vzqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T12:49:38.000Z",
      "summary_90w": "",
      "raw": "Yulia Navalnaya is urging the two laboratories she says found her husband was poisoned to release their findings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c9f50d98bab766be60e79dab5ee449f6922a412b",
      "title": "Thousands of Palestinians flee as Israeli troops push into Gaza City",
      "url": "https://www.bbc.com/news/articles/cx270y1rgzeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T12:45:56.000Z",
      "summary_90w": "",
      "raw": "Israel says its aim is to defeat up to 3,000 Hamas fighters who remain there, but the offensive has drawn international condemnation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5170f156c540e02e967333d70e6a01d27bc130c",
      "title": "What is the President doing on his visit to the UK?",
      "url": "https://www.bbc.com/news/articles/c8rynvlm6zjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T12:43:46.000Z",
      "summary_90w": "",
      "raw": "US President Donald Trump and his wife Melania are in the UK for an unprecedented second state visit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3881366c4be9bd96924917f8cb4cf9b2503fd146",
      "title": "Flying cars crash into each other at Chinese air show",
      "url": "https://www.bbc.com/news/articles/cn5qk4de997o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T12:34:08.000Z",
      "summary_90w": "",
      "raw": "Footage shared on social media shows burning wreckage on the ground after the mid-air collision.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b22b84c8ecbb5e4fe98b9ff5d6765bb38fe1e6ad",
      "title": "No, Nintendo and Pokémon did not patent ‘summoning characters and making them battle’",
      "url": "https://www.theverge.com/games/779062/nintendo-pokemon-summoning-battle-patent",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T12:30:00.000Z",
      "summary_90w": "",
      "raw": "As first noted by Games Fray last week, Nintendo and The Pokémon Company were granted a US patent earlier this month involving summoning characters and making them battle. Headlines popped up with similarly vague language as concern spread on social media: That's a thing in tons of games! Can they do that? Is that even allowed?\nWell, no, because that's not exactly what they patented. And what they did patent might not stand up to any hypothetical challenges in court.\nThe patent in question, US Patent No. 12,403,397, was filed in March 2023. It does involve summoning and battle mechanics, but it's more specific than that: The claims describ …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bc986eaff0bd9520feece6360b08eb8dbd92a6ae",
      "title": "Who is the iPhone Air really for?",
      "url": "https://www.theverge.com/podcast/779607/iphone-air-review-17-pro-airpods-watch-vergecast",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T12:30:00.000Z",
      "summary_90w": "",
      "raw": "It's very thin. And very light. And quite nice to look at. It also only has one camera, the battery life isn't amazing, and it's not like Apple saved some special new software feature for its fanciest phone. The new iPhone Air is just… the nice one. So where does that leave the Air? And where does that leave anyone trying to decide which iPhone to buy?\nOn this episode of The Vergecast, we try and answer those questions. The Verge's Allison Johnson and Jake Kastrenakes, who have been using and reviewing Apple's latest iPhones - the Air, the 17, and the 17 Pro - join the show to talk about what they've learned. Not to spoil the fun, but there …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49b2f92b31839efc32952481a218b025efa20554",
      "title": "Tech bosses say massive investment will make UK 'AI superpower'",
      "url": "https://www.bbc.com/news/articles/c7016ljre03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T12:28:39.000Z",
      "summary_90w": "",
      "raw": "Microsoft, Google and Nvidia have announced investments as part of a £31bn UK-US \"Tech Prosperity Deal\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f51c5090c10cb73d0bc0cbc444e71334f25ac3bf",
      "title": "Apple’s iPhone 17 Pro is a bold redesign but a basic upgrade",
      "url": "https://www.theverge.com/tech/779265/iphone-17-pro-max-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-17T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Apple’s new iPhone 17 Pro Max and iPhone 17 Pro.\t\n\nIt's a tricky year to review the iPhone Pro. It's long been the go-to choice for anyone who wants an iPhone with the nicest screen, longest battery, and great cameras. But the display is no longer unique to the Pro, cameras have largely gotten \"good enough\" on most phones, and Apple has a new model, the Air, which might be even more compelling. \nThis is the first time the iPhone Pro feels like it's truly targeted at creators - people who need the longest battery life and the best cameras to record video and photos. I'm not a creator, but I've always bought the Pro Max for its bigger, higher-refresh-rate screen as much as for its beefy batte …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3ee1099489290134fc79364de2ec797b1d7a207a",
      "title": "The Summer I Turned Pretty reaches emotional climax",
      "url": "https://www.bbc.com/news/articles/czewyppr6wxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T11:42:48.000Z",
      "summary_90w": "",
      "raw": "Spoiler warning: The much-anticipated final episode reveals how the talked-about TV show's plot ends.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64521fb1d717a01d2785b63b3639f7e535bd91c4",
      "title": "Nvidia boss 'disappointed' by reported China chip ban",
      "url": "https://www.bbc.com/news/articles/cqxz29pe1v0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T11:23:24.000Z",
      "summary_90w": "",
      "raw": "Jensen Huang told reporters he would be \"patient\" as the US and China grapple for global AI dominance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d81cbf9329b7ddcf3648b55346cf690769accd26",
      "title": "Ex-Labour councillor charged in Westminster 'honeytrap' case",
      "url": "https://www.bbc.com/news/articles/cn76dr2jm0ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T11:22:21.000Z",
      "summary_90w": "",
      "raw": "The charges relate to alleged WhatsApp messages sent to people within Westminster circles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d7592ea7ddc2d75da65835c8bed01d5d172809a",
      "title": "Ten sick Gazan children arrive in UK for treatment",
      "url": "https://www.bbc.com/news/articles/c1l8jvn2je0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T11:10:10.000Z",
      "summary_90w": "",
      "raw": "The group are the first to be brought to the UK for treatment under a government scheme.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4f6d4be3fca12b9893119f2cd2675129112618ed",
      "title": "Kirk's alleged shooter faces death penalty. And, Pritzker concerned for 2026 elections",
      "url": "https://www.npr.org/2025/09/17/g-s1-89178/up-first-newsletter-charlie-kirk-tyler-robinson-trump-uk-visit-kash-patel",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T11:09:19.000Z",
      "summary_90w": "",
      "raw": "Tyler Robinson, the 22-year-old accused of shooting and killing Charlie Kirk, faces the death penalty in Utah. And, Illinois Gov. JB Pritzker talks about why he is worried about the 2026 elections",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4d55b5f86db748f84aba75d34014b4356b845148",
      "title": "Madeleine McCann suspect freed from German prison",
      "url": "https://www.bbc.com/news/articles/cy4rydzmrmvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T11:03:40.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner has never been charged with any crime in relation to the McCann case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65fc280d11e1065c293242f725473c9e146c58dc",
      "title": "Google Ventures doubles down on dev tool startup Blacksmith just 4 months after its seed round",
      "url": "https://techcrunch.com/2025/09/17/google-ventures-doubles-down-on-dev-tool-startup-blacksmith-just-4-months-after-its-seed-round/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Blacksmith, a Y Combinator alum, raised $10M Series A led by Google Ventures to cut costs and speed up software builds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e6c52d4692f715ff615b67366f487782794eae5",
      "title": "Sonair built its 3D ultrasonic sensor with robotic safety in mind",
      "url": "https://techcrunch.com/2025/09/17/sonair-built-its-3d-ultrasonic-sensor-with-robotic-safety-in-mind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T11:00:00.000Z",
      "summary_90w": "",
      "raw": "The company's sensor uses sonar and echos to give robots more information about their surrounding environment.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1027c7cf42166edddad62a2fe94b061ccabe13b2",
      "title": "Gunmen kill 22 after shooting at baptism ceremony in Niger - reports",
      "url": "https://www.bbc.com/news/articles/ce863x3g7jko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T10:58:03.000Z",
      "summary_90w": "",
      "raw": "Niger's army has failed to contain the jihadist insurgency, with dozens killed in recent attacks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49752472bd54b570d23face7233828f5f836795f",
      "title": "Food prices continue to surge as inflation remains at 3.8%",
      "url": "https://www.bbc.com/news/articles/cderznjj4r7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T10:56:31.000Z",
      "summary_90w": "",
      "raw": "While UK inflation held steady in August, the pace of price rises for food surged, increasing cost of living pressures.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "606f015af721f8eb77854f734a38b0e4ed29ce76",
      "title": "Most  American Jews say Trump is using antisemitism as an 'excuse' to silence free speech at universities",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5543212/study-most-american-jews-dont-agree-with-trumps-tactics-for-combating-antisemitism",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T10:51:32.000Z",
      "summary_90w": "",
      "raw": "Most Jewish Americans disapprove of the Trump administration withholding funds from colleges to address anti-Jewish sentiment, according to a new survey.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d052286cd91b88227f160805a7beb694a1fe7d51",
      "title": "Jaguar Land Rover supply chain staff told to apply for universal credit, union claims",
      "url": "https://www.bbc.com/news/articles/c784nwvj1l3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T10:43:20.000Z",
      "summary_90w": "",
      "raw": "Staff are being laid off with \"reduced or zero pay\" following a cyber attack, which has forced the carmaker to shut down, Unite union claims.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3fd78b5306bca30f059bffa462eaf2369d7c387a",
      "title": "Timor-Leste scraps plan to buy MPs free cars after protests",
      "url": "https://www.bbc.com/news/articles/cy4ry7vpkdeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T10:30:42.000Z",
      "summary_90w": "",
      "raw": "Demonstrators had burned tyres and set a government vehicle alight, while police responded with tear gas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "841d628c51674ff26eb0a07620fbf45893b461ca",
      "title": "Ben & Jerry's co-founder quits over social activism row",
      "url": "https://www.bbc.com/news/articles/c4g58xx1eero?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T10:00:54.000Z",
      "summary_90w": "",
      "raw": "His resignation marks the latest development in a dispute with parent company Unilever.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cc30f63782971ba3e3bbed99f8420f2ce61ffe1",
      "title": "Main suspect in Madeleine McCann case released from German prison",
      "url": "https://www.theguardian.com/world/2025/sep/17/madeleine-mccann-case-suspect-christian-bruckner-germany-prison-release",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T09:46:24.000Z",
      "summary_90w": "",
      "raw": "Authorities say they no longer have legal justification to hold Christian Brückner in jail after serving rape sentence\nThe main suspect in the disappearance of Madeleine McCann was freed on Wednesday as German authorities said they no longer had legal justification to hold him in jail.\nChristian Brückner, 49, was released from prison in Sehnde, northern Germany, after serving a sentence for the rape of an American woman, then 72 years old, in Portugal in 2005, journalists at the scene reported.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9546830f1f6af17b4f8a51d2e7b467951104af0b",
      "title": "Ex-Arsenal star Thomas Partey denies rape charges",
      "url": "https://www.bbc.com/news/articles/c2lxe9800dko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T09:42:03.000Z",
      "summary_90w": "",
      "raw": "The 32-year-old footballer was in court accused of raping two women and sexually assaulting another.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "418638172dd2f35eca5da06c6e7ba8432ed6e177",
      "title": "‘One in, one out’ deal will go ahead, says Liz Kendall after last-minute injunction",
      "url": "https://www.theguardian.com/uk-news/2025/sep/17/one-in-one-out-deal-will-go-ahead-says-liz-kendall-after-last-minute-injunction",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T09:32:07.000Z",
      "summary_90w": "",
      "raw": "Minister insists court ruling that blocked deportation of Eritrean man ‘will not undermine basis’ of deal with France\n\nUK politics live – latest updates\n\nKeir Starmer’s returns deal with France will go ahead, a cabinet minister has insisted, despite a high court ruling that temporarily blocked the deportation of an Eritrean man.\nLiz Kendall, the technology secretary, said the last-minute injunction stopping the 25-year-old from being flown to Paris would not scupper the “one in, one out” scheme for ever.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "092afa92d261cd5f7ccd4f5103219eb5cf597bee",
      "title": "Suspect in UK toddler disappearance is released after serving time in unrelated case",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5544096/madeleine-mccann-suspect-germany",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T09:18:39.000Z",
      "summary_90w": "",
      "raw": "A German national under investigation in the disappearance of British toddler Madeleine McCann 18 years ago was freed from prison Wednesday after serving a sentence in an unrelated case, police said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38625ac1fd4787a2132b66206b9ccf33ecc38640",
      "title": "After a wave of horrific shootings, gun violence trends put recent attacks in context",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5542241/political-violence-mass-shootings-charlie-kirk",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Mass shootings, political violence and school safety are front of mind for many Americans following a recent spate of high-profile attacks. Experts who study gun violence unpack the data and trends.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c17f2e4afc72bb016af93366aba49b359e96fad",
      "title": "Beyond 'draining the swamp': How Trump is knocking down checks on presidential power",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5475191/trump-executive-power-supreme-court-whistleblower",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump wants to be able to fire far more executive branch employees at will — upending checks on presidential power that have existed for more than a century.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "52fc551b8e4847f511dd14b0299cba86c0c646e8",
      "title": "Facing Trump's pressure, the Fed is likely to cut rates for the first time this year",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5539555/federal-reserve-interest-rates-inflation-jobs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The Fed is likely to lower interest rates by a quarter percentage point Wednesday in an effort to cushion the sagging job market. The move comes as policymakers face growing pressure from Trump.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c40b70e824b9928149444362345b90720e04e44f",
      "title": "What to know about zarfs, the fanciest way to drink coffee",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5541377/word-language-history-zarf-turkey-coffee-java-jacket",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For NPR's Word of the Week, we're getting hot: During the Ottoman Empire, people used devices called \"zarfs\" to hold their coffee cups. Here's what to know about this word's history.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "84d5aec022bf22ff9c5f9e5823701576d9bdbb54",
      "title": "When her car ran out of gas, help came from a homeless encampment",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5542002/when-her-car-ran-out-of-gas-help-came-from-a-homeless-encampment",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T09:00:00.000Z",
      "summary_90w": "",
      "raw": "When Juli Cobb's car ran out of gas in the middle of the road, three men from a nearby homeless encampment rushed over to push her car to safety.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "970a8b7f844f5f2309e7dd11d08be5fc0c4f3df8",
      "title": "Horse-drawn carriages and a royal salute for Trump's unprecedented second state visit",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5543349/trump-king-uk-state-visit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-17T08:49:49.000Z",
      "summary_90w": "",
      "raw": "President Trump is in the United Kingdom for a rare second state visit that includes pageantry, policy and protests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d126c1b5da42cc4bd45e152153e87422efbffc7b",
      "title": "Latest blow to Labor’s Pacific defence strategy might not be the embarrassment the Coalition claims",
      "url": "https://www.theguardian.com/world/2025/sep/17/png-australia-defence-treaty-delay-blow-for-anthony-albanese",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T08:41:03.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese must now save the defence agreement with Papua New Guinea, a week after a similar plan with Vanuatu was delayed\n\nGet our breaking news email, free app or daily news podcast\n\nWhen Anthony Albanese landed in Papua New Guinea for celebrations marking 50 years of independence this week, he was expecting to sign a landmark mutual defence agreement and designate the one-time colony as a formal ally of Australia.\nInstead, despite insisting the text of the agreement had been approved, the prime minister left Port Moresby on Wednesday with only a 300-word joint communique signed with his counterpart, James Marape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43e1e6a7a65b035b9583c46f82ccf07d08fc63a7",
      "title": "Four arrests after Trump and Epstein images projected on Windsor Castle",
      "url": "https://www.bbc.com/news/articles/c78n455mj08o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T08:35:56.000Z",
      "summary_90w": "",
      "raw": "Police said four people remain in custody after the \"stunt,\" which coincided with the US president's arrival in the UK.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7c6bffa1c236cfb5a5f381f99e54414c134f310e",
      "title": "Ben Roberts-Smith’s mother emails Coalition MPs saying Andrew Hastie ‘not fit’ to lead Liberals",
      "url": "https://www.theguardian.com/australia-news/2025/sep/17/ben-roberts-smiths-mother-emailed-coalition-mps-objecting-to-andrew-hastie-ever-becoming-leader-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T08:12:55.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Sue Roberts-Smith sends 39-page dossier to two dozen Liberal and National MPs after fresh speculation about Hastie’s possible leadership tilt\n\nGet our breaking news email, free app or daily news podcast\n\nThe mother of disgraced former soldier Ben Roberts-Smith has launched an extraordinary character attack on Andrew Hastie, emailing Coalition MPs with accusations that the man who testified in her son’s defamation trial was “not fit” to lead the Liberal party.\nAn email was sent from Sue Roberts-Smith’s address to at least two dozen Liberal and National MPs containing a 39-page dossier about Hastie early on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "611e190ab4a1a3cd6c1550e4bf2dcf4bfac3ddeb",
      "title": "Conroy says Labor unconcerned by PNG-China discussions – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T07:56:37.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nBen Roberts-Smith’s mother emails Coalition MPs saying Andrew Hastie ‘not fit’ to lead Liberals\n\nGet our breaking news email, free app or daily news podcast\n\nTwo charged in Victoria after $14m in cocaine allegedly found inside car driven from NSW\nVictoria police charged two men overnight after seizing 40kg of cocaine allegedly found inside a vehicle they were driving from the NSW border back to the state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca474d3c945f471719311fb29b8142ec713b246b",
      "title": "‘Too big for the site’: Tasmanian AFL stadium should not be built, says independent planning commission",
      "url": "https://www.theguardian.com/australia-news/2025/sep/17/tasmania-afl-stadium-hobart-independent-planning-commission-says-too-big-should-not-be-built",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T06:55:46.000Z",
      "summary_90w": "",
      "raw": "Proposed Macquarie Point venue a condition for state entering AFL in 2028, but report argues it would cause ‘unacceptable adverse impacts on Hobart’\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe push to build a $945m home for the first AFL team in Tasmania has hit a major hurdle, with the proposed stadium condemned by the state’s planning commission as a “monolithic” blot on Hobart’s landscape and cultural heritage.\nThe damning report comes as the state’s premier, Jeremy Rockliff, admitted on Wednesday that the cost of the development had blown out by almost 20%, to $1.13bn.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38056bd4d90f869606c627ea9136c71651370725",
      "title": "US tennis star sorry for 'offensive' comments on Chinese food",
      "url": "https://www.bbc.com/news/articles/cx270m57zm7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T06:53:25.000Z",
      "summary_90w": "",
      "raw": "She described the turtle and frog dishes as \"crazy\" and \"wild\", causing a social media storm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb94ee2d4c3a57e253a86cb042d8ad8d955ce6d7",
      "title": "India’s Urban Company soars 58% above IPO price in year’s most subscribed offering",
      "url": "https://techcrunch.com/2025/09/16/indias-urban-company-soars-58-above-ipo-price-in-years-most-subscribed-offering/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T06:44:54.000Z",
      "summary_90w": "",
      "raw": "Urban Company’s IPO, which opened last week, was oversubscribed more than 100 times, reflecting strong investor demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b81d3e074d806671d2619797a08a9085045318e9",
      "title": "Almost 30 staff at ANU humanities school stop work after health and safety report warns of ‘serious harm’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/17/almost-30-staff-at-anu-humanities-school-stop-work-after-health-and-safety-report-warns-of-serious-harm",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T06:41:41.000Z",
      "summary_90w": "",
      "raw": "Workers affected by university restructure advised to ‘remove themselves from the hazardous work environment’ if they believe they are at psychosocial risk\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAlmost 30 staff at the Australian National University’s humanities school have stopped work after an internal report warned of psychological hazards in their workplace related to the institution’s restructure.\nThe report was prepared by the health and safety representative (HSR) officer in ANU’s College of Arts and Social Sciences (Cass), who issued a cease-work order on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2cb66486d8134c7bb421d970d5ef6b1fb2cbbe18",
      "title": "UTS’s teacher education program set to close as university reveals plan to slash more than 1,000 subjects",
      "url": "https://www.theguardian.com/australia-news/2025/sep/17/utss-teacher-education-program-set-to-close-as-university-reveals-plan-to-slash-over-1000-subjects",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T06:37:24.000Z",
      "summary_90w": "",
      "raw": "Of 1,101 subjects to be axed, 463 had no enrolments and weren’t taught in 2024, according to University of Technology Sydney proposal\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe University of Technology Sydney will close its teacher education program and public health school as part of a sweeping restructure that would remove more than 1,100 subjects to return the institution to surplus.\nThe proposed cuts, released on Wednesday, are part of the debt-ridden university’s strategy to reduce expenditure by $100m annually, including previously announcing the cutting of about 400 jobs.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd0de4a53e9254ca2053bdc21e5409cebb8b1542",
      "title": "Champions League debut and Luiz - the rise of Pafos",
      "url": "https://www.bbc.com/sport/football/articles/cj6x7rrxzedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T06:15:58.000Z",
      "summary_90w": "",
      "raw": "BBC Sport looks at Pafos FC, the team from Cyprus set to make their full Champions League debut with David Luiz in defence.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "96f40dea70f48699a1fc107e5aa6136a2a738b7d",
      "title": "'Forgotten' royal castle uncovered on Scottish island",
      "url": "https://www.bbc.com/news/articles/cz693e0zdqeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T06:08:22.000Z",
      "summary_90w": "",
      "raw": "Archaeologists say the fortress was owned by ancestors of Scotland's medieval Lord of the Isles.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T05:18:36.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "234c150741ced732f897749cbd9d9f327647c0ce",
      "title": "NPR to trim $5 million this year as public radio stations struggle to pay bills",
      "url": "https://www.npr.org/2025/09/17/nx-s1-5539164/npr-public-media-funding-budget",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-17T04:17:06.000Z",
      "summary_90w": "",
      "raw": "NPR plans to make trims totaling more than $5 million over the course of the coming fiscal year to bring its annual budget into balance. Meanwhile, local stations are asking for more help.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "9050846a1413c9abc6c5b47005e80b265f990d21",
      "title": "'I created a successful business thanks to a disability grant - but cuts will sink it'",
      "url": "https://www.bbc.com/news/articles/clyl90ry2j7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T04:01:19.000Z",
      "summary_90w": "",
      "raw": "Many disabled workers face the threat of losing their jobs or businesses because of long waits for government grants.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1f879e98b711ca5c4c360474f11d1c378431930",
      "title": "Human-made global warming ‘caused two in three heat deaths in Europe this summer’",
      "url": "https://www.theguardian.com/environment/2025/sep/17/human-made-global-warming-caused-two-in-three-heat-deaths-in-europe-this-summer-analysis-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T04:00:27.000Z",
      "summary_90w": "",
      "raw": "Researchers from Imperial College London say 16,500 deaths caused by hot weather brought on by greenhouse gases\nHuman-made global heating caused two in every three heat deaths in Europe during this year’s scorching summer, an early analysis of mortality in 854 big cities has found.\nEpidemiologists and climate scientists attributed 16,500 out of 24,400 heat deaths from June to August to the extra hot weather brought on by greenhouse gases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92c1073e5ba3d11801d9e3e436ee3fad84835e00",
      "title": "France proposes ceiling on value of UK components in €150bn EU defence fund",
      "url": "https://www.theguardian.com/politics/2025/sep/17/france-proposes-ceiling-on-value-of-uk-components-in-eu-defence-fund",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T04:00:25.000Z",
      "summary_90w": "",
      "raw": "Negotiations soon to begin on UK’s entry to Safe scheme, which it hopes will secure bigger role for its defence firms\nFrance has proposed limiting the use of British-produced military components in the EU’s €150bn defence fund, in a move that could complicate negotiations over the UK’s entry into the scheme.\nFour diplomatic sources told the Guardian that French officials had proposed a 50% ceiling on the value of UK components in projects financed through the EU’s €150bn Security Action for Europe (Safe) fund.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "beef6fa0eb6ca20ac0734bafeefd2cc117576db0",
      "title": "'The hungry can't stay silent' - behind deadly protests in oil-rich Angola",
      "url": "https://www.bbc.com/news/articles/c8ex6k88yy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T02:34:08.000Z",
      "summary_90w": "",
      "raw": "As the 50th independence anniversary approaches the country grapples with poverty and inequality.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7acb48d3f4e1bfb85a5f39acb26bd43015d854a6",
      "title": "Canadian writer Robert Munsch approved for assisted dying",
      "url": "https://www.bbc.com/news/articles/c931y04jg1vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T02:03:46.000Z",
      "summary_90w": "",
      "raw": "Munsch was diagnosed with dementia in 2021 and also has Parkinson's disease.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35e1f18be2566265a28f6d5206c0cce379ab9109",
      "title": "Syria's worst drought in decades pushes millions to the brink",
      "url": "https://www.bbc.com/news/articles/c70x500lkdno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T01:44:40.000Z",
      "summary_90w": "",
      "raw": "The drought has slashed wheat harvests by 40% in a country where nearly 90% of the population already lives in poverty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5e0860f58c7c8dd40e6012945f21fc93bce3a0b",
      "title": "Groww, backed by Satya Nadella, set to become first Indian startup to go public after U.S.-to-India move",
      "url": "https://techcrunch.com/2025/09/16/groww-backed-by-satya-nadella-set-to-become-first-indian-startup-to-go-public-after-u-s-to-india-move/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-17T01:32:17.000Z",
      "summary_90w": "",
      "raw": "Groww's listing — expected later this year — is set to double as a major cash-out moment for global venture funds.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98eed288986f3bb0ea338603fd7ad567a62ed5e6",
      "title": "Rocks on train tracks strand 900 Machu Picchu tourists amid protest",
      "url": "https://www.theguardian.com/world/2025/sep/17/rocks-on-train-tracks-strand-900-machu-picchu-tourists-amid-protest",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T01:31:30.000Z",
      "summary_90w": "",
      "raw": "About 1,400 visitors were evacuated but hundreds were left stuck because of action linked to bus contract dispute, say Peru authorities\nAt least 900 tourists were stranded near the ancient Inca citadel of Machu Picchu on Tuesday, Peru’s tourism minister said, after a passenger train service was suspended due to a protest.\nPeruRail said service was suspended on Monday because the route in Peru’s mountainous Cusco region had been blocked by “rocks of various sizes” as residents clashed with authorities and bus companies. PeruRail’s local unit also said “third parties” had excavated part of its rail route, which affected the track’s stability and slowed down the evacuation of tourists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a455e65761f738823a4dd93d03d48c9e29ad121",
      "title": "'It took 20 years but I brought my rapist to justice'",
      "url": "https://www.bbc.com/news/articles/c0ml41n72kyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T01:22:56.000Z",
      "summary_90w": "",
      "raw": "Dan Cooper describes how serving on a jury prompted him to re-report the attack he suffered in 2004.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4fd7912ad1106a40fbae163f9b61a8f04a0efcf",
      "title": "Landlords 'scared' and selling up before renters' rights bill becomes law",
      "url": "https://www.bbc.com/news/articles/cwywj3gj9z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T01:05:46.000Z",
      "summary_90w": "",
      "raw": "Patricia sells one of her properties in London, saying landlords are \"scared\" of some the changes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "34a72c5ac071263b0ee85a5790a9345279142b1b",
      "title": "Watch: Key takeaways from Charlie Kirk suspect's first court appearance",
      "url": "https://www.bbc.com/news/videos/cvgj59p3v7po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T00:56:27.000Z",
      "summary_90w": "",
      "raw": "The BBC's Nada Tawfik reports from Utah, where Tyler Robinson appeared in court as prosecutors read the charges against him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a8460457f5746839b3161c927485b9c82e2113f",
      "title": "Charlie Kirk suspect confessed in hidden note to roommate, prosecutors allege",
      "url": "https://www.bbc.com/news/articles/ckg2r8lvjn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-17T00:48:29.000Z",
      "summary_90w": "",
      "raw": "The 22-year-old has been charged with murder and is facing the death penalty if convicted at trial.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2caeb9d5e8b10e0f4095f5e52768a70b19fec90e",
      "title": "Read the text messages between Charlie Kirk accused and roommate",
      "url": "https://www.bbc.com/news/articles/c99g1e0z2ero?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T00:44:45.000Z",
      "summary_90w": "",
      "raw": "\"You're joking, right????\" the roommate responds in one message after the alleged gunman tells him he did it, according to court documents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6de88a268d71f14fa986a6b2fe127e92160da6e",
      "title": "Rescuing my poisoned cat cost £3,000 - here's how to spot fake medicine",
      "url": "https://www.bbc.com/news/articles/cy9n0y34z14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-17T00:34:51.000Z",
      "summary_90w": "",
      "raw": "Pet owners are being urged to check all medicines carefully before using them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "66ddf4ad4a469e8cf2d3460200bc8a3d24515951",
      "title": "Anthony Albanese fails to seal defence treaty between Australia and PNG",
      "url": "https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-17T00:05:39.000Z",
      "summary_90w": "",
      "raw": "Australian PM will leave Port Moresby without agreement, sparking a setback for strategy to minimise China’s influence among Pacific nations\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAnthony Albanese’s strategy of pushing back against China in the Pacific has been dealt another blow, with a major defence treaty with Papua New Guinea delayed amid concerns about sovereignty.\nA deal was expected with the former Australian colony this week but the prime minister is set to leave Port Moresby without signing the so-called Pukpuk mutual defence treaty with his counterpart, James Marape, on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7374b88116f0eb820b8d96d10c295552c2a47353",
      "title": "End of the road for manual drivers? More learners opt for automatics in tests",
      "url": "https://www.bbc.com/news/articles/c80gk97xe85o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T23:08:09.000Z",
      "summary_90w": "",
      "raw": "The UK's 2030 ban on the sale of new petrol and diesel cars is said to be driving the trend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e09d3a0d584629b135c97a335ec264606a48f1e4",
      "title": "‘We’re still in the dark’: a missing land defender and the deadly toll of land conflict on Indigenous people",
      "url": "https://www.theguardian.com/environment/2025/sep/17/missing-land-defender-deadly-toll-land-conflict-indigenous-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T23:01:18.000Z",
      "summary_90w": "",
      "raw": "Julia Chuñil is one of 146 land defenders who were killed or went missing last year, a third of them from Indigenous communities\nOne day last November, Julia Chuñil called for her dog, Cholito, and they set off into the woods around her home to search for lost livestock. The animals returned but Chuñil, who was 72 at the time, and Cholito did not.\nMore than 100 people joined her family in a search lasting weeks in the steep, wet and densely overgrown terrain of Chile’s ancient Valdivian forest. After a month, they even kept an eye on vultures for any grim signs. But they found no trace of Chuñil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1a104faece4a8311dbf2cf1e5c3196ab75f0a8e3",
      "title": "Al Gore on China’s climate rise: ‘I would not have seen this coming’",
      "url": "https://techcrunch.com/2025/09/16/al-gore-on-chinas-climate-rise-i-would-not-have-seen-this-coming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T23:00:00.000Z",
      "summary_90w": "",
      "raw": "Al Gore and Lila Preston of Generation Investment Management talked with TechCrunch about recent headlines, including the tech industry's growing appetite for rare earth minerals, how the AI boom's demand for massive data centers could impact global energy consumption, and whether the space industry's rocket launches are truly a net positive.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c2c136f42b129463e77e7df888ee2279b4ab3e4",
      "title": "Politicians get rich while we suffer - so I helped bring down our government in 48 hours",
      "url": "https://www.bbc.com/news/articles/cvg9n760gddo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T22:11:38.000Z",
      "summary_90w": "",
      "raw": "Gen Z protesters in Nepal tell the BBC of their pride and heartbreak after last week's momentous protests.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fab6eda8f8e5d0af3a1d53b6089ae379a5ca998a",
      "title": "US officers tied us up and pointed guns at us, South Korean engineers tell BBC",
      "url": "https://www.bbc.com/news/articles/c07v1j98ydvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T22:10:59.000Z",
      "summary_90w": "",
      "raw": "Korean workers who were detained in the US say they were treated like criminals and are still in shock.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba391f16c2d79a765b518a0dbe0ae9b0b2263826",
      "title": "Meta Connect 2025: What to expect and how to watch",
      "url": "https://techcrunch.com/2025/09/16/meta-connect-2025-what-to-expect-and-how-to-watch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T21:55:23.000Z",
      "summary_90w": "",
      "raw": "Meta is expected to unveil new versions of its AI-powered smart glasses, as well as a gesture-indicating wristband.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9ae56f27aa39eeff582d611bfee48c70732d288f",
      "title": "America's unofficial party house where Trump spent the night",
      "url": "https://www.bbc.com/news/articles/cn0x2vxl7gjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T21:06:04.000Z",
      "summary_90w": "",
      "raw": "The ambassador's residence in central London has a colourful history and may be on Trump's itinerary.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4eb6f79e5d26a4e871ae3209f230cb1776100d4a",
      "title": "Trump extends TikTok reprieve as deal nears",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543413/tiktok-trump-ban-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-16T20:10:09.000Z",
      "summary_90w": "",
      "raw": "While legally questionable, the extension comes just as it appears China and the U.S. may finally have a deal on TikTok's fate.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3cf3e6a22874f678fe00c3e4bb59e816bc759e2e",
      "title": "Same-day delivery comes to space, as Impulse promises satellite transport in hours, not months",
      "url": "https://techcrunch.com/2025/09/16/same-day-delivery-comes-to-space-as-impulse-promises-satellite-transport-in-hours-not-months/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T20:07:15.000Z",
      "summary_90w": "",
      "raw": "Impulse Space wants to ignite a revolution in in-space logistics.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9f92c7011ddc8d533025d3f4c904c9f7e3a22b3",
      "title": "Deal is done to keep TikTok in the US, says Trump",
      "url": "https://www.bbc.com/news/articles/c7847q9xvwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T19:56:54.000Z",
      "summary_90w": "",
      "raw": "The social media platform had faced a ban in the US over national security concerns.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a84cce41d643e0b0cb9215246e8052f894638a5",
      "title": "Jack Altman raised a new $275M early-stage fund in a mere week ",
      "url": "https://techcrunch.com/2025/09/16/jack-altman-raised-a-new-275m-early-stage-fund-in-a-mere-week/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T19:52:53.000Z",
      "summary_90w": "",
      "raw": "Altman's first fund, raised in early 2024, was $150 million. So this is a big step up, too.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe1e673b71a77838042ff8c5b8e526317c306446",
      "title": "Bolsonaro ordered to pay damages for racist remarks in office",
      "url": "https://www.theguardian.com/world/2025/sep/16/bolsonaro-damages-brazil",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:23:00.000Z",
      "summary_90w": "",
      "raw": "Court rules former president, sentenced to 27 years for coup attempt, must pay R$1m for ‘cockroaches’ comment in 2021\nJair Bolsonaro has been ordered to pay R$1m (£138,000) in collective moral damages for remarks deemed “racist” while he was in office.\nThe latest ruling, delivered by a state appeals court, came less than a week after Brazil’s former president was sentenced to 27 years and three months in prison for leading an attempted coup to overturn the result of the 2022 election.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c071a425cefa9a146f60c634281bda5bb7c8cc23",
      "title": "Tesla is recalling Powerwall 2 batteries over fire risk",
      "url": "https://techcrunch.com/2025/09/16/tesla-is-recalling-powerwall-2-batteries-over-fire-risk/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T19:20:55.000Z",
      "summary_90w": "",
      "raw": "Tesla is recalling an unspecified number of Powerwall 2 home batteries in Australia after receiving reports of fires.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2a3ac4a4cc7441482880be26993931e9afd6d677",
      "title": "What to know about TikTok’s uncertain future in the US and the people who want to buy it",
      "url": "https://techcrunch.com/2025/09/16/what-to-know-about-tiktoks-uncertain-future-in-the-us-and-the-people-who-want-to-buy-it/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T19:19:08.000Z",
      "summary_90w": "",
      "raw": "TikTok, owned by the Chinese company ByteDance, has been at the center of controversy in the U.S. for four years now due to concerns about user data potentially being accessed by the Chinese government. Earlier this year, the app experienced a temporary outage in the U.S. that left millions of users in suspense before it […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b8f4f5af137df47d7365c15f630d015d41a06b2",
      "title": "Netanyahu’s ‘super-Sparta’ vision braces Israel for isolated economic future",
      "url": "https://www.theguardian.com/world/2025/sep/16/netanyahu-super-sparta-vision-israel-economic-future-isolation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:03:46.000Z",
      "summary_90w": "",
      "raw": "Israeli PM’s outline of partial autarky and more militarised society stirs up backlash and concern over pariah status \nHours before unleashing a ground offensive against Gaza City on Tuesday, Benjamin Netanyahu braced his country for a future of mounting economic isolation, urging it to become a “super Sparta” of the Middle East.\nThe future the prime minister laid out for Israel, of a more militarised society, a partial autarky – or economically self-sufficient country – with limited trade options and relying increasingly on homemade production, has stirred up a backlash among Israelis who are ever more uneasy at the prospect of following him down the path to a pariah state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b4a3c8f5e4a0d6ca5a739ee8c0409daf458b4e1",
      "title": "Israel’s war in Gaza ‘morally, politically and legally intolerable’ says UN secretary general - as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T19:01:12.000Z",
      "summary_90w": "",
      "raw": "This live blog is now closed. You can read our latest report here:\n\nIsrael launches ground offensive deep inside Gaza City\n\nWafa, the Palestinian news agency, has been told by medical sources that at least 38 Palestinian people, including women and children, have been killed by Israeli forces since dawn today.\nAs well as facing relentless bombardments, Gaza City, the biggest built-up area of the territory, is being gripped by a famine caused by Israel’s restrictions on aid.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d44a08c7272243f10b421481cf31784e25949f4",
      "title": "Silicon Valley bets big on ‘environments’ to train AI agents",
      "url": "https://techcrunch.com/2025/09/16/silicon-valley-bets-big-on-environments-to-train-ai-agents/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T19:00:48.000Z",
      "summary_90w": "",
      "raw": "A wave of startups are creating RL environments to help AI labs train agents. It might be Silicon Valley’s next craze in the making.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ddd75ded7049bd2c1379b41bdaab469c42c58ed1",
      "title": "CodeRabbit raises $60M, valuing the 2-year-old AI code review startup at $550M ",
      "url": "https://techcrunch.com/2025/09/16/coderabbit-raises-60m-valuing-the-2-year-old-ai-code-review-startup-at-550m/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T19:00:00.000Z",
      "summary_90w": "",
      "raw": "The round, which brought the two-year-old startup’s total funding to $88 million, was led by Scale Venture Partners.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70f31bf5a09693edebf01b9acafcdcfff7f40ad",
      "title": "Israel Committing Genocide in Gaza Says UN Commission",
      "url": "https://www.bbc.co.uk/sounds/play/p0m36nph?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T18:26:00.000Z",
      "summary_90w": "",
      "raw": "Israel rejects UN Commission finding that it is committing genocide in Gaza.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38eb649c82448e8c9cf056f8f198f0210a99cc24",
      "title": "Acting legend Robert Redford dies aged 89",
      "url": "https://www.bbc.com/news/articles/c1dqe9ey0kgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T18:25:25.000Z",
      "summary_90w": "",
      "raw": "The acting star was famous for roles in The Sting and Butch Cassidy and the Sundance Kid.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "83661be0c3943a7d4ddb58a223b38a9d1a3c2e4d",
      "title": "Google rolls out new Windows desktop app with Spotlight-like search tool",
      "url": "https://techcrunch.com/2025/09/16/google-rolls-out-new-windows-desktop-app-with-spotlight-like-search-tool/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T18:24:22.000Z",
      "summary_90w": "",
      "raw": "The app will allow people to use an Alt + Space shortcut to instantly search for information from their computer files, installed apps, Google Drive files, and the web.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc7fc0e97e2ed12b20cdd947e7c960badb2b3e9f",
      "title": "Israel launches ground offensive deep inside Gaza City",
      "url": "https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T18:11:59.000Z",
      "summary_90w": "",
      "raw": "IDF says advance aims to ‘dismantle Hamas’s grip’ as UN report says Israel has committed genocide in territory\nIsrael unleashed its long-threatened ground offensive in Gaza City on Tuesday, sending tanks and remote-controlled armoured cars packed with explosives into its streets, in defiance of international criticism and the findings of a UN commission that it was committing genocide in the Palestinian territory.\n“Gaza is burning. The IDF is striking terror infrastructure with an iron fist,” Israel’s defence minister, Israel Katz, wrote on X as the attack was launched in the early hours of the morning, adding: “We will not relent until the mission is completed.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "96b20f83542f0754c6d3d0416f4592cccac21654",
      "title": "Gemini tops the App Store thanks to new AI image model, Nano Banana",
      "url": "https://techcrunch.com/2025/09/16/gemini-tops-the-app-store-thanks-to-new-ai-image-model-nano-banana/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T18:07:40.000Z",
      "summary_90w": "",
      "raw": "Though the month is only half over, Gemini's app has already gained 12.6 million downloads in September, up from 8.7 million in August.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d23b2ee1cda0b9c4aecf794d85d73d2917573550",
      "title": "Rivian breaks ground on $5B Georgia factory ahead of construction in 2026",
      "url": "https://techcrunch.com/2025/09/16/rivian-breaks-ground-on-5b-georgia-factory-ahead-of-construction-in-2026/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T18:03:23.000Z",
      "summary_90w": "",
      "raw": "While largely ceremonial, it's an important step for a project that has dealt with a lot of uncertainty the last few years. Rivian R2 SUVs will roll off the line in 2028.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bbb17a80947116b66d4cf59940d10e3c272e291",
      "title": "Andrew Yang took inspiration from Mark Cuban for his budget cell carrier Noble Mobile",
      "url": "https://techcrunch.com/2025/09/16/andrew-yang-took-inspiration-from-mark-cuban-for-his-budget-cell-carrier-noble-mobile/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T17:48:19.000Z",
      "summary_90w": "",
      "raw": "“I’m as guilty of doomscrolling as the next person, but knowing that doomscrolling is actually costing me money makes me feel dumb,” Yang told TechCrunch.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c7ce8f3c76fbad24a0981ee76cfdc4d761203e5",
      "title": "Coup plot charges for former Romanian presidential candidate",
      "url": "https://www.bbc.com/news/articles/c4g5ky0vex8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T17:47:19.000Z",
      "summary_90w": "",
      "raw": "Prosecutors say the right-wing former presidential candidate conspired to overthrow constitutional order in the country.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56f8f83e63afe7c0bb9cc4888dd5fa70684413f1",
      "title": "Waymo’s Tekedra Mawakana on Scaling Self-Driving Beyond the Hype",
      "url": "https://techcrunch.com/2025/09/16/waymos-tekedra-mawakana-on-the-truth-behind-autonomous-vehicles-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T17:35:00.000Z",
      "summary_90w": "",
      "raw": "Waymo co-CEO Tekedra Mawakana takes the Disrupt Stage at TechCrunch Disrupt 2025 (Oct 27–29, SF) to share the realities of scaling autonomous vehicles — from safety to regulation to the road ahead.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25e03538e3e9d46dd1bb0cc7d474bd6a8ac81b49",
      "title": "UN tries to limit staff going to Cop30 in Brazil due to high price of hotels",
      "url": "https://www.theguardian.com/environment/2025/sep/16/un-tries-to-limit-staff-going-to-cop30-in-brazil-due-to-high-price-of-hotels",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T16:44:01.000Z",
      "summary_90w": "",
      "raw": "Accommodation costs at climate summit in Belem are pricing out some developing countries and media outlets\n\nThe United Nations has urged its staff to limit attendance at the Cop30 climate summit in Brazil in November due to high accommodation prices, while government delegations are still scrambling to find rooms within their budgets.\nThe move comes as delegations grow increasingly concerned about the cost of accommodation in the coastal Amazon city of Belem hosting Cop30. Brazil said it was working to increase the number of available hotel beds, but soaring prices for accommodation have stoked calls from some governments to relocate the conference, which Brazilian officials have rejected.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1b3df1e0b5ca1aebb6e879d9c851190d07c4103",
      "title": "'Completely different, yet genuinely get on' - BBC correspondents on Starmer and Trump",
      "url": "https://www.bbc.com/news/videos/c9dxq447dwvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T16:27:49.000Z",
      "summary_90w": "",
      "raw": "The BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08fc7c2a54c00dca2d02e477cbd9f5b83c6a9950",
      "title": "'The bombing has been insane': Palestinians scramble to flee Israeli assault on Gaza City",
      "url": "https://www.bbc.com/news/articles/cly0qnnx5w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T15:42:06.000Z",
      "summary_90w": "",
      "raw": "Palestinians tell the BBC whole residential blocks have been levelled as the Israeli army ramps up its offensive in the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6aeaffe1e3ca5d4f53f06de8b9776c77126dc58b",
      "title": "Who was Agnes Wanjiru, Kenyan woman killed near army base in 2012?",
      "url": "https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T15:37:20.000Z",
      "summary_90w": "",
      "raw": "Relatives remember a dependable, kind and funny woman and remain traumatised by her death\nPerhaps the Kenyan market town of Nanyuki’s greatest claim to fame was that it straddles the equator. But now it has become synonymous with something darker. It was here where Agnes Wanjiru was born and lived and where she was brutally killed.\nHer family searched for her for months before her body was found stuffed into a septic tank at the same hotel where she had last been seen alive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e5ab1016b2b4c8ee8fa716477d83ea53fd26d6",
      "title": "Watch: Bear caught on CCTV searching for food in Indian temple",
      "url": "https://www.bbc.com/news/videos/c9dxq3n2pdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T15:12:11.000Z",
      "summary_90w": "",
      "raw": "The curious creature ransacked an office in its quest to find tasty treats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fda108e96638becd32441a61f74ead623332d49",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "url": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T14:28:29.000Z",
      "summary_90w": "",
      "raw": "High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old\n\nProfile: who was Agnes Wanjiru?\n\nA warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.\nThe high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and his extradition to Kenya was being sought.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cbd0c8f06c43478b2ccccb30c976a1364369884",
      "title": "Judge dismisses terrorism charges against Luigi Mangione",
      "url": "https://www.bbc.com/news/articles/cj4y2p8qq5qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T14:27:27.000Z",
      "summary_90w": "",
      "raw": "Judge Gregory Carro also ruled a second-degree murder charge against Mangione could stand during a hearing on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bc020e784bca26bdc1d2d3aab3e677193c2d7a33",
      "title": "Watch: The Sundance Kid's life in the spotlight",
      "url": "https://www.bbc.com/news/videos/ce9rvmk8xdzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T14:09:21.000Z",
      "summary_90w": "",
      "raw": "The BBC's David Sillito takes a look at the career of the Hollywood icon who has died aged 89.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59465bbcf57a8dccf296d9a9607ae2c90a319d9a",
      "title": "Lesotho villagers complain of damage from water project backed by African Development Bank",
      "url": "https://www.theguardian.com/world/2025/sep/16/lesotho-villagers-complain-damage-water-project-african-development-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T13:44:21.000Z",
      "summary_90w": "",
      "raw": "About 1,600 people file complaint to AfDB demanding transparency over forced relocations and compensation\nEighteen rural communities in Lesotho have filed a complaint with the African Development Bank (AfDB) over its funding of a multibillion-pound water project whose construction process they claim has ruined fields, polluted water sources and damaged homes.\nAbout 1,600 people living in the villages in Mokhotlong district in north-east Lesotho are demanding transparency over planned forced relocations and compensation they say they have not been consulted on.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "186387d96ddac98408cdbe3f00f17ed1441d075e",
      "title": "Homes damaged, cars swept away as rains flood India's Uttarakhand",
      "url": "https://www.bbc.com/news/videos/c8641vd73jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T10:22:35.000Z",
      "summary_90w": "",
      "raw": "Rescue efforts are under way after the Himalayan region was hit by torrential downpour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf1ead77844492def427441a62a9e551b68f045c",
      "title": "Trump files $15 billion defamation lawsuit against 'New York Times'",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543030/donald-trump-nytimes-lawsuit",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-16T10:00:40.000Z",
      "summary_90w": "",
      "raw": "President Trump filed a $15 billion defamation lawsuit against The New York Times and four of its journalists, accusing them of harming his business and personal reputation.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "0a6312505e8e474f11a0efed51b03de5f5914245",
      "title": "Google owner reveals £5bn AI investment in UK ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/crmek723dz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T09:44:20.000Z",
      "summary_90w": "",
      "raw": "Google's president and chief investment officer Ruth Porat tells the BBC there are \"profound opportunities in the UK\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b2914e242af7fcbe31bbde4de1e054a5673857f",
      "title": "Bowen: UN commission report on genocide is blunt indictment of Israel's actions in Gaza",
      "url": "https://www.bbc.com/news/articles/c0m4rxjppl8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T07:01:46.000Z",
      "summary_90w": "",
      "raw": "A new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b3f1a3edaca89f31d673e3c7971528ad17b0088",
      "title": "Beaten and held in Russia for three years - but never charged with a crime",
      "url": "https://www.bbc.com/news/articles/cm28674vnp6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T05:00:37.000Z",
      "summary_90w": "",
      "raw": "Russia imprisoned Dmytro shortly after its invasion of Ukraine in 2022. He was freed last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a8b043a5ef482f7f78bd53960e4dbfb00477ea8",
      "title": "Australia-PNG defence treaty: countries to agree to defend each other from military attack as China’s Pacific influence grows",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T04:28:39.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese and Papua New Guinea’s defence minister downplayed the delay to the Pukpuk defence treaty being formalised\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia and Papua New Guinea will agree to defend each other in the event of a military attack, part of a landmark defence agreement due to be signed on the sidelines of celebrations to commemorate the country’s independence this week.\nAnthony Albanese and PNG’s defence minister, Billy Joseph, both downplayed a delay to the deal being formalised, insisting the plan known as a Pukpuk treaty won’t affect sovereignty in the former Australian colony.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T04:20:10.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b99d9252c79d8fb38e65cdfc6052aa5246c664",
      "title": "Pacific leaders gather to celebrate 50th anniversary of Papua New Guinea’s independence",
      "url": "https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T02:30:58.000Z",
      "summary_90w": "",
      "raw": "Celebrations and events have been held across the country to mark the milestone\n\nPNG independence: 50 years on\n\nPacific leaders have gathered in Port Moresby to celebrate Papua New Guinea’s 50th anniversary of independence from Australia, as prime minster James Marape reflected on the moment and voiced his optimism for the future despite the country’s challenges.\nPapua New Guinea was administered by Australia as a single territory from 1945. The territory included the former British protectorate of Papua and the former German colony of New Guinea. In 1975, Papua New Guinea was granted independence.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "84bfd7f45b9b307f0d9e824e51a55860513e4a8a",
      "title": "Trump announces deadly US strike on another alleged Venezuelan drug boat",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T01:26:57.000Z",
      "summary_90w": "",
      "raw": "President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’\nDonald Trump said on Monday that the United States had carried out a strike on a second Venezuelan boat and killed three alleged terrorists he claimed were transporting drugs, expanding his administration’s war against drug cartels and the scope of lethal military force to stop them.\nThe US president gave few details about the strike, saying in a social media post that the action was on his orders and that it had happened earlier in the morning. The post was accompanied by a video clip showing the boat, which appeared to be stationary, erupting into a fireball.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5747b8476441fa8d66da50cdeaba29b97d41f796",
      "title": "Appeals court says Lisa Cook can stay on the Federal Reserve board -- for now",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539252/lisa-cook-fed-trump-firing-court",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-16T00:57:53.000Z",
      "summary_90w": "",
      "raw": "A federal appeals court blocked President Trump from firing Federal Reserve governor Lisa Cook, just ahead of a key vote on interest rates.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5e91d4786b9cecab05b82f0a0879809377cbcf8b",
      "title": "Americanswers…on 5 Live! Who is Tyler Robinson, Charlie Kirk’s suspected killer?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m30j0g?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T18:40:00.000Z",
      "summary_90w": "",
      "raw": "Plus, behind the scenes of Trump’s last state visit and what might happen this week?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6026cc8859de8bc9a81914aae63649a61cdf2493",
      "title": "Why Trump wants companies to report earnings less frequently",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542137/trump-corporate-earnings-sec",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T18:34:22.000Z",
      "summary_90w": "",
      "raw": "President Trump would like companies to report their earnings less frequently. Executives have long called for that -- but some financial experts worry it would go badly.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b768a80b7f41e8feeec08c67dd8d720ecfb6200e",
      "title": "Watch: JD Vance hosts Charlie Kirk's daily talk radio show",
      "url": "https://www.bbc.com/news/videos/ckge487nr6ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T18:29:57.000Z",
      "summary_90w": "",
      "raw": "The US vice-president said the late conservative influencer played a \"critical part\" in getting President Donald Trump re-elected.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48341e22cf197b930c55378266f1044034e5ce18",
      "title": "Senate confirms Stephen Miran to Fed Board. Who is he and why's he so controversial?",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542126/stephen-miran-fed-reserve-board",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T17:39:32.000Z",
      "summary_90w": "",
      "raw": "The Senate voted Monday to confirm Stephen Miran to the Federal Reserve Board. Miran, who has served in both Trump administrations, has said he will not resign from the White House but take a leave of absence, further stoking concerns about its independence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ba1a69c28d42c1982858afe85fca23104d56d0f4",
      "title": "Israel demolishes more high-rise towers as Gaza City offensive ramps up",
      "url": "https://www.bbc.com/news/videos/cr5q8mj6nrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:40:30.000Z",
      "summary_90w": "",
      "raw": "BBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "db8b03e9757119836a6a0bf393b3b5bdbf922ef9",
      "title": "Democrats face an 'extinction moment' as strategists push them onto new platforms",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5484125/democrats-social-media-strategy-influencers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Prominent Democratic lawmakers and influencers are encouraging their fellow Democrats to embrace social media and online video to reach voters or risk being left behind.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bf87dacabbd7c88b7a4526ff5ddb23e836521f3c",
      "title": "Trump administration launches trial program to fast-track electric air taxis",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540722/faa-air-taxi-pilot-program",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T23:38:26.000Z",
      "summary_90w": "",
      "raw": "The FAA is seeking proposals for projects that will include piloted and unmanned operations with a focus on electric air taxis, also called an electric vertical takeoff and landing aircraft.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a475abb3dc16ccdb5d98f98a66ee869d359880a",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jnl0?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-13T01:00:00.000Z",
      "summary_90w": "",
      "raw": "Lara Lewington explores the tech being trialled to find 'hidden' pancreatic cancer cases.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b3a878af0d65401d30b2b22e759db794e484cb6",
      "title": "Tech Life",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6zp7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T19:30:00.000Z",
      "summary_90w": "",
      "raw": "Robot sailboats are helping forecasters predict where hurricanes will hit land.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b01e5f5037c4e13f5add6c3b3cd312f3c5b5bdc6",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jb6f?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-06T01:00:00.000Z",
      "summary_90w": "",
      "raw": "How technology is bringing hope of earlier detection and prevention to wildfires.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "785da41dcaaaeff936b6a50a940004e758e08824",
      "title": "Exclusive testimony from celebrities affected by phone hacking",
      "url": "https://www.bbc.co.uk/iplayer/episode/m001mxb5?at_mid=CCp3wQjPuL&at_campaign=Scandalous_Phone_Hacking_on_Trial&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m001mxb5&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Scandalous_Phone_Hacking_on_Trial&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2024-06-20T13:40:00.000Z",
      "summary_90w": "",
      "raw": "A look at the legal battle over allegations of the media's unlawful information gathering.",
      "topics": [
        "World"
      ]
    }
  ]
}