{
  "version": "1756306445475",
  "generatedAt": "2025-08-27T14:54:05.475Z",
  "items": [
    {
      "id": "7ba2eb001177d1087c76d9113d2001b9577fa6b3",
      "title": "US sanctions fraud network used by North Korean ‘remote IT workers’ to seek jobs and steal money",
      "url": "https://techcrunch.com/2025/08/27/us-sanctions-fraud-network-used-by-north-korea-to-seek-jobs-and-steal-money/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:43:04.000Z",
      "summary_90w": "",
      "raw": "Treasury officials say the North Korea government used the fraud network to generate money for the regime's nuclear weapons program.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "979aed86950daac9b8bbe49e6e4e7f6b055eaf92",
      "title": "EVs are getting a temporary Trump bump thanks to expiring incentives",
      "url": "https://www.theverge.com/electric-cars/766609/ev-sales-increase-trump-tax-credit-expire",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T14:39:34.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump has made no secret of his disdain for electric vehicles. On the first day of his presidency, he signed an executive order to eliminate EV incentives that he has often falsely portrayed as an “electric vehicle mandate.” And last month, Republicans in Congress voted to kill the $7,500 tax credit, among other subsidies designed to make EVs more affordable.\nYou’d think all this negative overhead would depress EV sales, but instead, Americans are rushing to take advantage of those credits before they expire on September 30th (or thereabouts). Automakers are pouring fuel on the fire in the form of their own discounts and incentives. As a result, EV sales are soaring to new heights right now — and it’s all thanks to Trump.\nBattery-electric vehicles are expected to account for 12.8 percent of car sales in August, up 3.2 percent year over year, according to JD Power. That’s also an increase of 1.6 percent from July’s figures and represents an all-time high for EVs, exceeding the previous peak of 11.2 percent set in December 2024.\n\nAs a result, EV sales are soaring to new heights right now — and it’s all thanks to Trump.\n\n\n“The coming twilight is causing consumers to speed up their purchases,” says Tyson Jominy, senior VP of data and analytics at JD Power.\nAutomakers eager to get EV-curious shoppers in the dealership are offering their own discounts of $6,700 per unit, an increase of $1,500 from July, the firm says. As a result, average EV transaction prices are down $2,500 to $44,300, which is now below the average of $45,700 for gas-powered vehicles.\nYou heard that right: right now, for what is very likely the first time ever, the average EV is cheaper than the average internal combustion engine vehicle.\nJominy says that EV inventory was expected to be a bottleneck but now could be “an albatross” for automakers. JD Power estimates that the total number of used and new EVs at dealerships in August is 197,000, down about 10,000 from July and enough for the next 59 days.\n“Yet, like Cinderella’s magic, this brilliance faces a deadline — when the clock strikes midnight on Oct. 1, the $7,500 federal support vanishes, threatening to turn this inventory into costly pumpkins for automakers and dealers,” he says. At that point, automakers may need to ramp up the discounts in order to move their suddenly more costly EV inventory.\nMost experts expect EV sales to fall back down to Earth through the rest of the year. But with more affordable models on the horizon, the loss of federal support could just be a bump in the road. Major players like Ford, Tesla, Volkswagen, and Toyota say they are committed to bringing more affordable EVs to market. Batteries are getting better, range is improving, and charging infrastructure is getting more dependable. \nSure, the US is running far behind China — like, really far — but the outlook isn’t so dire. Simply put, electric vehicles are just better than gas cars: they’re fun to drive and cheaper to own over the lifetime of the vehicle. There will be a lot of readjusting after incentives expire, and we’re already starting to see automakers delay or cancel certain models.\nBut EVs are still the future. Trump and the Republican Party may have delayed the inevitable, but they can’t stop what’s coming.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b5e32e9b896952b9ad748c4605c580c9b29690b3",
      "title": "Patients struggle to get weight loss drug ahead of price rise",
      "url": "https://www.bbc.com/news/articles/clyr8ynx41yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T14:36:11.000Z",
      "summary_90w": "",
      "raw": "Some patients taking weight-loss drug Mounjaro have told BBC News they are struggling to obtain the medicine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7363bbf3cec2f7b713f9261fbfb15ab89f23906c",
      "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:33:02.000Z",
      "summary_90w": "",
      "raw": "Danish foreign minister Lars Løkke Rasmussen says any attempt to interfere in kingdom’s internal affairs is unacceptable\nOpening the press conference, Merz says he wanted to revive the tradition of cabinet discussions on security to show the issue is treated seriously and to “send a signal” to EU and Nato allies.\nMerz says before the meeting, they met with Nato’s Supreme Allied Commander Europe, Alexus Grynkewich, to discuss the military situation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4cca2efc913eb430b53d84d66de741fae81224c",
      "title": "Israeli military carries out raid in West Bank city of Nablus – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:21:25.000Z",
      "summary_90w": "",
      "raw": "Soldiers and armoured vehicles enter city in northern occupied West Bank, confirms Israeli military, as residents say soldiers are searching houses\nAl Jazeera reports that the prime minister of Belgium has begun a meeting with his deputies on the topic of recognising the state of Palestine.\nBart De Wever said in a statement yesterday that it does not make sense to recognise the Palestinian state unless certain conditions are satisfied.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6aaaf2a1bbb315b0a2147a5245b1209eb55bc5ad",
      "title": "Investigations into deaths following Belfast dance music festival",
      "url": "https://www.bbc.com/news/articles/cgjye9wlx63o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T14:20:11.000Z",
      "summary_90w": "",
      "raw": "Two people have died and two remain in hospital after attending Emerge dance festival.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d2361d288349aa8b1cf352f28eb9a0df6abd49c",
      "title": "Trump's 50% tariff on India kicks in as Modi urges self-reliance",
      "url": "https://www.bbc.com/news/articles/c5ykznn158qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T14:19:29.000Z",
      "summary_90w": "",
      "raw": "The US president's steep 50% tariffs on India have kicked in, sending Narendra Modi's government into firefighting mode.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5c991f83d0ba2d60a34fe28f42efb0b1b763b8b8",
      "title": "France on the brink: how a budget deficit became a political crisis",
      "url": "https://www.theguardian.com/world/2025/aug/27/france-on-the-brink-political-crisis-economic-francois-bayrou",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:17:49.000Z",
      "summary_90w": "",
      "raw": "With the government facing defeat in a confidence vote, the nation’s economic problems will still need to tackled\nFrance is stuck in economic limbo, without a budget and soon, possibly, without a government. The prime minister, François Bayrou, has called for parliament to hold a confidence vote on 8 September and, now that parties of the left and far right have pledged to bring down the government, on paper he doesn’t have the numbers to win.\nOn Tuesday, the Socialist party (PS) added its voice to the dissenters, allying it with the Greens and the far-right National Rally.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ccaf766e3b7691c144f94d71688ee48763abf582",
      "title": "Plaud launches a new AI hardware notetaker, the $179 Note Pro",
      "url": "https://techcrunch.com/2025/08/27/plaud-launches-a-new-ai-hardware-notetaker-the-179-note-pro/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:13:02.000Z",
      "summary_90w": "",
      "raw": "Plaud.ai launches its new Plaud Note Pro hardware notetaker with better mics and recording range.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c5439cb1bfd1b0776bae3ebba209dd72226ae81",
      "title": "Google will now let everyone use its AI-powered video editor Vids",
      "url": "https://www.theverge.com/news/766557/google-vids-ai-avatar-gemini-image-to-video",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T14:04:40.000Z",
      "summary_90w": "",
      "raw": "Google is rolling out a basic version of Vids to everyone. Until now, the AI-powered video editor has only been available to Google Workspace or AI plan subscribers, but now users can broadly access the app with templates, stock media, and a “subset of AI capabilities,” product director Vishnu Sivaji tells The Verge.\nLaunched last year, Vids is the newest addition to Google’s suite of Workspace tools. It’s geared toward helping you quickly pull together video presentations with a host of AI video editing and creation tools, including a feature to help you create a storyboard with suggested scenes, stock images, and background music. \nThough Sivaji notes that the pared-down version of Vids will come with “pretty much all of the amazing capabilities” within the app, the free version doesn’t have any of the new AI-powered features rolling out today, including the ability to have an AI-generated avatar to deliver a message on your behalf.\nWith this update, you can select one of 12 pre-made avatars, each of which has a different appearance and voice, and then add your script. For now, you can’t use Vids to create an AI-generated avatar of yourself, which is a feature Zoom currently offers (and is apparently something tech CEOs are super into). When asked about this possibility, Sivaji said Google doesn’t “have any further updates to share” right now.\n\nAdditionally, Google is building upon Vids’ existing video generation capabilities by letting you create 8-second videos that incorporate a specific image, such as a new product. And, if you choose to include a video of yourself in your presentation, you can now use an AI-powered tool that automatically removes filler words and pauses from your recording.\nGoogle is betting that these features can help companies save time and money when it comes to producing product demos, training videos, or support content. “A 10-minute-long clip with real actors can take as long as six months, and it might be tens of thousands of dollars because of the amount of time it goes into writing the script, iterating on it, getting into the studio, actually recording it, and then editing it,” Sivaji said. “What we’re hearing from customers is that it allows them to dramatically scale how many people can make these kinds of videos and how often they can make them.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "210d1b0007c1f7419d6da854bfcced8e05426751",
      "title": "A third of outpatients treated for wounds at MSF’s Gaza hospitals in 2024 were children, figures show",
      "url": "https://www.theguardian.com/world/2025/aug/27/children-make-up-third-of-outpatients-in-msf-hospitals-in-gaza-statistics-show",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:03:11.000Z",
      "summary_90w": "",
      "raw": "Explosive weapons designed to be used in battle are being used in urban areas, says Médecins Sans Frontières\n\nMiddle East crisis – live updates\n\nChildren under 15 years old made up almost a third of outpatients treated for wounds in field hospitals run by Médecins Sans Frontières (MSF) in Gaza last year, statistics published in The Lancet reveal.\nThe figures were released by MSF in correspondence with the respected medical journal and come from six health facilities in Gaza supported by the international medical NGO. The facilities are predominantly in the south and centre of the devastated territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3b907895924d1c76b7d1d20b909bd772fc258006",
      "title": "Google Vids adds AI avatars to its video editor and launches a consumer version",
      "url": "https://techcrunch.com/2025/08/27/google-vids-adds-ai-avatars-to-its-video-editor-and-launches-a-consumer-version/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Google is launching a free consumer version of its video editor Vids that will be available without any AI-powered features.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0c4984ab55d9b027f8d2e85fd8343b1f43351a9f",
      "title": "Mirror founder Brynn Putnam to unveil her gaming hardware startup at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/27/mirror-founder-brynn-putnam-to-unveil-her-gaming-hardware-startup-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Seven years after unveiling Mirror at TechCrunch Disrupt 2018, Brynn Putnam is returning to the stage where it all began.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ea7f3e67f941fdf30cf4e7c46d890adc66af74d",
      "title": "Terraton wants to be the McDonald’s of biochar",
      "url": "https://techcrunch.com/2025/08/27/terraton-wants-to-be-the-mcdonalds-of-biochar/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Terraton sees promise in biochar, but the technology has struggled to scale. The startup thinks a franchise model could be what unlocks biochar's potential.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dc036a082cd9b2acfef25deb4a46bcfc4d85a903",
      "title": "Girl who stabbed teachers fascinated by weapons and war, report says",
      "url": "https://www.bbc.com/news/articles/ceqye7n8l88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:44:57.000Z",
      "summary_90w": "",
      "raw": "The teenager, who was interested in war and Hitler, had been considered \"quirky\" prior to the attack.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29d8fe22852edf5e9b596ab06347e530b6dc326",
      "title": "Google’s Pixel Tablet is up to $170 off ahead of Labor Day weekend",
      "url": "https://www.theverge.com/tech/766417/google-pixel-tablet-apple-airpods-4-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T13:36:03.000Z",
      "summary_90w": "",
      "raw": "As we approach the end of August, early Labor Day deals have begun to appear, offering you a chance to save on speakers, noise-canceling headphones, TVs, and outdoor gear. Now we can add Google’s 128GB Pixel Tablet to the list, which is down to $249 ($150 off) at Amazon, Best Buy, and the Google Store, matching its best price to date. If you want a bit more storage, the 256GB model is also available from Best Buy and Google for a cool $329 ($170 off).\nGoogle Pixel Tablet\n\nWhere to Buy:\n\n $399 $249 at Amazon (128GB, without dock)\n $399 $249 at Best Buy (128GB, without dock)\n $499 $309 at Best Buy (256GB, without dock)\n\nGoogle’s latest slate (and, possibly, it’s last for a while) is tailor-made for kicking back with movies, YouTube, or a round of games. Its 11-inch LCD display is crisp and vibrant, while the 16:10 aspect ratio makes it ideal for consuming widescreen content. If your main goal is to relax and enjoy your favorite shows or apps, the screen won’t let you down, even if the battery life is not as impressive as what you might get from an iPad or similarly-sized Android tablets. The built-in speakers just add to the experience, delivering clear audio and noticeable stereo separation.\nSadly, the current promo doesn’t include Google’s optional speaker dock, which remains a worthwhile addition that you can still purchase from the Google Store for $129. The price of the dock is still worth it in our opinion, as it essentially transforms the tablet into a Nest Hub-esque device. Once connected to the charging dock via magnets, you can easily control smart home devices and crank up the volume of whatever it is you’re listening to, whether it’s podcasts or music.\nGoogle recently introduced its Pixel 10 phone lineup and the new Pixel Watch 4, and notably absent was any sort of Pixel Tablet successor. As stated earlier, Google may be abandoning the category… again. If that’s the case, this might be one of your last opportunities to save on the tablet. Just keep in mind that Google is only promising an additional year or so of software updates, as well as three more years of security updates.\nRead our Google Pixel Tablet review.\nMore deals to check out\nHousemarque’s Returnal is on sale at Best Buy for $29.99 ($40 off), its lowest price to date. The atmospheric shooter is a great showcase for the PlayStation 5’s power, and one that makes great use of Sony’s DualSense controller. It combines roguelike mechanics and bullet hell gameplay, trapping players in a time loop as an astronaut exploring a mysterious alien planet. While its difficult, looping structure makes it an acquired taste, it delivers an experience you won’t want to miss — especially at this price.\nThe Twelve South Butterfly SE is currently down to $44.99 ($55 off) in pink at Woot, which is just a few bucks more than its best price to date. The travel-friendly Qi2 charger features a 2-in-1 design with two soft-touch pads connected by a flexible strap; one pad delivers up to 15W for your phone, and the other provides up to 5W for your smartwatch. Since the foldable charger supports Qi2, it should also be compatible with Google’s upcoming Pixel 10 lineup.\nIf you missed out on the discount on the AirPods 4 during Amazon’s July Prime Day event, today is your lucky day, as the deal’s back. Apple’s entry-level wireless earbuds have once again fallen to $89.99 ($40 off) at Amazon, Walmart, and Best Buy, matching their previous all-time low. The base AirPods 4 don’t include ANC and lack features like adaptive audio and conversation awareness; however, they support spatial audio and automatic device switching, which lets you seamlessly switch between an iPhone, iPad, and Mac.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "507c83735352235872906999ed2ff89f3c55d91f",
      "title": "Energy bills to rise by more than expected ahead of winter",
      "url": "https://www.bbc.com/news/articles/c78zgz7j576o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:33:54.000Z",
      "summary_90w": "",
      "raw": "The £35 a year increase for a typical household is twice what analysts had predicted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "866f7205a2e615df1712645417bb958fdc4e82f4",
      "title": "HSBC apologises as app and online banking go down",
      "url": "https://www.bbc.com/news/articles/cqjykl7ek9qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:30:08.000Z",
      "summary_90w": "",
      "raw": "Thousands of people have reported problems during what is the latest in a long line of banking IT failures.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a75e4d0667c14360e6002585e19e513d642a58e7",
      "title": "Scottish island castle goes back on sale for £750,000",
      "url": "https://www.bbc.com/news/articles/c17n170gqkqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:24:32.000Z",
      "summary_90w": "",
      "raw": "A previous sale of the historic castle, involving a millionaire businessman, collapsed two years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a32c76232a48b50002096c9185041f3fbd182f7c",
      "title": "Four ways to keep your energy bills down",
      "url": "https://www.bbc.com/news/articles/crm4rygl4m3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:11:45.000Z",
      "summary_90w": "",
      "raw": "Household energy bills are due to rise again in October but there are ways to keep a lid on your expenditure.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b71813b1d9e9db3499f2fb3c25167d8282794a7",
      "title": "Hyundai is working with a startup on plant-based leather that smells like the real thing",
      "url": "https://techcrunch.com/2025/08/27/hyundai-is-working-with-a-startup-on-plant-based-leather-that-smells-like-the-real-thing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T13:10:00.000Z",
      "summary_90w": "",
      "raw": "Uncaged Innovations is working with Hyundai to develop alternatives to leather with a fraction of the environmental impact.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d294ab3b17b9624b5a697ec5df8fc18e4ad0ab78",
      "title": "SpaceX pulls off Starship rocket launch in much-needed comeback",
      "url": "https://www.bbc.com/news/articles/cly69z9lwnno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T13:00:47.000Z",
      "summary_90w": "",
      "raw": "The Starship rocket is critical to the company's hopes of one day carrying people to the Moon and Mars.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5fe2e03dce40b3cfd31ab2a158e7ddc7fc52fb5d",
      "title": "Chipolo launches its first rechargeable Bluetooth trackers",
      "url": "https://www.theverge.com/news/766562/chipolo-loop-card-bluetooth-trackers-price-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T13:00:00.000Z",
      "summary_90w": "",
      "raw": "The Chipolo Card (left) and Loop (right) are available to preorder now.\t\n\nDevice tracker brand Chipolo announced the Loop and Card, two new Bluetooth-powered item trackers that can be recharged instead of requiring users to replace their batteries. The Loop and Card both support Apple’s Find My and Google’s Find My Device networks, and will sit in Chipolo’s tracker lineup alongside the colorful Pop pucks that the company launched earlier this year.\nBoth gadgets are available to preorder for $39 starting today. The Loop shares a similar AirTag-like design to the Pop, albeit with a chunky color-coordinated silicone ring that’s designed to attach the tracker to your keys, bags, and more. It’s available in white, black, navy, pink, yellow, or mint green. The Card design is self-explanatory, resembling a gray credit card-shaped slab that can slot into wallets and phone-case pockets.\nChipolo says the Loop and Card will both last around six months on a single charge, which is longer than the five months of battery life provided by Nomad’s Tracking Card. While the Loop is recharged via USB-C, the Card is compatible with Qi wireless chargers. Users will have to supply their own USB-C cables and Qi charger, however, as they’re not included with the Loop or Card.\n\n\n\n\nOther than the obvious shape and charging difference, Chipolo’s new trackers only vary by maximum volume when alerting users to their location: 110 dB for the Card, and up to 125 dB for the Loop. The trackers otherwise share similar capabilities — both feature a Bluetooth range of 400 feet, for example, which is greater than the 200-300 feet range provided by Chipolo’s Pop tracker. They also carry an IP67 rating that makes them resistant to dust and water, and can withstand being submerged in up to a meter of water for 30 minutes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b44052fc99202d913a3757e7cb900455d17633b9",
      "title": "Plaud upgrades its card-sized AI note-taker with better range",
      "url": "https://www.theverge.com/news/766335/plaud-ai-note-pro-launch-pricing-availability",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Plaud, the company behind an AI wearable that actually works, is launching an upgraded version of its credit card-sized note-taking device. Just like its Plaud Note predecessor, the Plaud Note Pro uses AI to record, transcribe, and summarize your conversations, but it now comes with two additional microphones that allow it to pick up audio within a 16.4-foot area, along with a 1-inch display that shows battery level, recording status, and the current recording mode.\nThe Plaud Note Pro automatically switches between recording calls and in-person meetings, eliminating the need for the physical toggle on the original Plaud Note released in 2023. There’s also a new “endurance” battery mode that extends the Plaud Note Pro’s 30 hours of recording to 50 hours, in exchange for a lower 9.8-foot audio pickup range that comes with the base Note. You can view the AI-generated recordings, transcriptions, and summaries in the accompanying Plaud app.\nThe Plaud Note Pro comes with a button that you can use for a “press-to-highlight” feature as well, which lets you flag important information that you’re hearing. The large language models used by Plaud, including OpenAI’s GPT, Anthropic’s Claude, and Google’s Gemini, can then generate more detailed summaries for these key points from the Plaud app. Plaud spokesperson Alice Gordon-Purdy notes that highlighting isn’t exclusive to the Note Pro, as base Note users can still “highlight” details through the Plaud app or iOS widget.\nPlaud is also updating its app in October, which will soon allow Plaud Note and Note Pro users to input text and upload images from their phones. It also comes with a new “Ask Plaud” feature that lets you ask questions about the information you’ve recorded or uploaded. As is the case with the first-gen Plaud Note, the Note Pro is MagSafe-compatible, letting you stick it to the back of your phone with a magnetic case.\nThe Plaud Note Pro costs $179 and is available for preorder now before it starts shipping in October. It comes with up to 300 transcription minutes per month by default, but you can upgrade to a $99.99 / year subscription for 1,200 minutes and priority access to new features, or a $239.99 / year plan for unlimited transcription minutes.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fe41745e5c880d46acff4db1b0180dfbc00145e6",
      "title": "The Verge’s favorite pet gear for 2025",
      "url": "https://www.theverge.com/tech/765085/pet-gadgets-dog-cat-fish-favorites",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Jelly loves taking trips in her carrier. | Photo: Hayden Field / The Verge\t\n\nEvery once in a while, Slack conversations among The Verge’s staff are interrupted by photos of incredibly cute dogs, cats, and other pets. (We even have an occasional discussion about smart home editor Jennifer Pattison Tuohy’s chickens.) \nNaturally, anyone who has a pet wants the best for them — and that includes carriers, feeders, and automatic litter boxes. So we asked the Verge crew to tell us about the gadgets and other items — some of them homemade — they use to help keep pets happy and healthy. Here are some of their answers.\nSmokey and Boone\nPetcube Fountain\nI struggled to find an easy-to-use, not-annoying water-fountain solution for keeping my two kitties well-hydrated until I tried the new Petcube Fountain. The two things I love about this compared to others I’ve tested are that the pump is super quiet, and it works on a rechargeable battery, making it easy to find a good spot for it.\nMy kitties like the built-in radar motion sensor that pumps up the water circulation when either one approaches, giving them a little fountain to drink out of. The built-in 2600mAh battery lasts about three weeks before needing to be charged with a USB-C cable, and it powers the super silent pump that circulates the water through the tank and up to a shallow ceramic bowl they drink from. \nThe system has been keeping the water very clean, and a UV-C antibacterial light claims to zap nasties. I’ve been running it for a month, and it’s stayed clean. The filters have to be replaced monthly ($10 for a three-pack), and I have it connected to the PetCube app to get reminders to replace them as well as to clean the fountain, which handily is dishwasher safe. — Jennifer Pattison Tuohy, senior reviewer\nPetcube Fountain\n\nWhere to Buy:\n\n $79.99 $69.99 at Amazon\n $79.99 $63.99 at Petcube\n\nWhisker Litter-Robot 4\nA robot that scoops your kitty litter is — admittedly — a luxury. Add one that also refills the litter in the tray when it’s running low, and you have a virtually hands-free cat toilet and one very happy cat owner. That’s the Whisker Litter-Robot 4 with Litter Hopper, an ingenious device that uses a rotating globe with a built-in sifter to separate the waste and dump it into a drawer after the cat places its deposit.\nYes, it costs almost $1,000 when you add in the hopper. But now all I have to do is fill it up about once a month and empty the waste drawer every week or so (all the clumps are neatly contained in a plastic bag, making it easy to just throw it in the trash). It’s a big step up from the manual labor of sifting cat crap with a little shovel. It also keeps the smell better contained than standard litter trays (although the odor is not entirely eliminated). The biggest downside, other than the price, is that manually cleaning the Litter-Robot requires a lot more effort and is a lot more disgusting than rinsing out a litter tray. But you don’t have to do it anywhere near as often. –Jennifer Pattison Tuohy, senior reviewer\nWhisker Litter-Robot 4\n\nWhere to Buy:\n\n $699 at Whisker (w/o hopper)\n\nOlive and Ned\nGreenies Pill Pockets\nOur eight-year-old dog, Olive, was diagnosed with hypothyroidism almost two years ago. At the time, our vet told us that it was very easy to treat: she’d simply have to take a thyroid pill, twice a day… for the rest of her life. \nIn the past, we’ve hidden pills in peanut butter, wrapped cheese around them, or buried them in a scoop of mashed potatoes. And a little over half the time, Olive would carefully eat whatever human food was presented, spit out the pill, and demand we try again.\nSo when faced with the task of tricking our dog twice a day, every day, for the rest of her life, we decided we’d give Greenies Pill Pockets a shot. And I’m so thankful we did, because we are now up to a 100 percent success rate when it comes to dosing Olive on the first try.\nThe pill pockets are a little large, but they’re very soft, so we typically rip off a small piece, wrap it around Olive’s pill, yell “Who wants a treat?” and toss it to her to catch midair. She gulps it right down, and as a bonus, we also toss a pill-free piece to our other dog, Ned, so he doesn’t get jealous. —Sarah Smithers, senior editorial coordinator \nGreenies Pill Pockets\n\nWhere to Buy:\n\n $17.98 at Walmart\n $17.98 at Amazon\n $17.98 at Chewy\n\nJelly\nWild One Everyday Pet Carrier\nMy 22-pound rescue corgi, Jelly, is always on the go — I sometimes need to bring her with me on the subway, to lunch with a friend, or to a pet playdate in another borough. I’ve had the Wild One Everyday Pet Carrier for two years, and it has never failed me. It has thick straps, a padded bottom, pockets inside and out, and the perfect-sized dip for Jelly’s head to go through. I have it in black, and it doesn’t show any signs of dirt or wear and tear so far. Since Jelly is blind in one eye (and always wants to know what’s going on with her other eye), she has a blast looking around and feels super safe inside. The bag is also sturdy enough that you can set it down next to you at a restaurant or on a park bench without it falling over, and if your pup isn’t feeling social, it’s possible for them to comfortably curl up inside. —Hayden Field, senior AI reporter\nWild One Everyday Pet Carrier\n\nWhere to Buy:\n\n $175 at Wild One\n\nBuchephalus\nLittle Chonk Maxine One carrier\nI’m going to double up on the corgi-carrier recommendations. My pup, Buchephalus (or just Bu for short), is 11 months old and goes with me everywhere. But he’s too big for conventional dog carriers and too antsy to ride around in a dog stroller. So for the places that don’t let your pooch walk on the ground, I carry him in a Little Chonk Maxine One backpack in size medium. It’s made for long corgi bodies (although other breeds would fit just as well) with neck support so that their head doesn’t list to the side when they’re sitting upright. My long boy is docked, but the backpack also has a hole for a tail. Bu took to the backpack really well, although you can increase your chances of success with lots of treats and encouragement rather than stuffing your 30-pound sausage in a bag meant for dogs up to 50lbs. Little Chonk also makes backpacks for bigger dogs called the Brodie One. \nI love this thing so much. I can easily take Bu with me everywhere — like when he came with me to place a Switch 2 preorder. The backpack comes with pouches you can use to hold your phone, keys, or treats. For an additional fee, you can get a velcro patch with your pet’s name on it so everyone knows the good dog you’re schleping around. —Ash Parrish, reporter\nLittle Chonk Maxine One\n\nWhere to Buy:\n\n $120 at Little Chonk\n\nLou and Neki\nLitter Genie refills\nApologies to my two cats, but this hack is all about making things cheaper and easier for me, your caretaker. For too long I’ve been suckered into buying Litter Genie refills, which start at about $28 for 24 bags. The Litter Genie is an indispensable tool for us, as it holds waste and does a good job of masking the dirty litter smell. But only recently in our five years of ownership did I stumble upon an Instagram Reel that showed how to use regular trash bags with the Litter Genie. (It actually shows a Diaper Genie, but it’s the same hack for the Litter Genie as well.)\nBasically, keep the empty plastic cartridge once it runs out. Then, fold the rim of your trash bag around the cartridge before reinstalling it, and push it through to the bottom of the Litter Genie so it can catch waste, as it’s designed to do. Now, you’ve got yourself a Litter Genie that costs cents per bag instead of $10 or more every month or so, depending on how frequently your cats visit the litter box. —Cameron Faulkner, commerce editor\nLitter Genie\n\nWhere to Buy:\n\n $26.99 at Amazon\n\nHappily fed fish\nPetbank Automatic Fish Feeder\nWhen I left home for a couple of weeks earlier this year, I was nervous about how I would care for my fish. After waffling between hiring a fish-sitter, plunking in a slow-release feeding tablet, or somehow taking them on the plane with me, I stumbled upon this handy gadget: the Petbank Automatic Fish Feeder. The device clamps right onto your tank and comes with 15 individual compartments where you can store each day’s food, along with a timer that controls how frequently it feeds your fish. Once it’s feeding time, a hatch beneath the feeding compartment opens, releasing that day’s food into your tank. It also comes equipped with a USB-C charging port and promises one to two months of battery life. I had the dispenser feed my fish every other day while I was gone, and it did just that, without even losing a chunk of its battery life. —Emma Roth, news writer\nPetbank Automatic Fish Feeder\n\nWhere to Buy:\n\n $28.99 $27.54 at Amazon\n $27.99 at Walmart\n\nDIY braided leash\nTutorial for making a leash\nIf you’re searching for a strong and premium-looking leash for a larger dog, then you can save a lot of money by making your own after a visit to your local outdoors store. I’ve been making these braided climbing rope leashes ever since Wes Siler first shared a DIY tutorial for his custom design in 2019. Since they’re made from durable climbing rope, even a teething puppy won’t be able to bite through the leash. The material is impervious to water and dirt so it’s easy to clean. When paired with a strong carabiner, you’ll have a leash that will last for years and is useful for other tasks. I’ve even made a few for dragging sleds up hills in the winter, and they still look as good as new years later . —Andrew Liszewski, senior reporter",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ccd5edcd6e78bb3e9415cde0c661a2de9666d60c",
      "title": "'It's very bleak' - what's gone wrong at West Ham?",
      "url": "https://www.bbc.com/sport/football/articles/cgm2k3xl74ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T12:58:06.000Z",
      "summary_90w": "",
      "raw": "BBC Sport analyses the issues behind West Ham's poor start to the season.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d6ac6808dce3cca1208ec67e6013dbd5015e3b24",
      "title": "Nigeria bans export of shea nuts used in beauty creams for six months ",
      "url": "https://www.bbc.com/news/articles/c9qy98gp474o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T12:45:57.000Z",
      "summary_90w": "",
      "raw": "The country wants to move from being the biggest exporter of raw nuts to producing more shea butter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80e3a02a32b7707f2aeefe1307bb30c6783bedf2",
      "title": "Windows 11 now has better Bluetooth quality for game chat and voice calls",
      "url": "https://www.theverge.com/news/766569/microsoft-windows-11-bluetooth-super-wideband-stereo-le-audio-voice-feature",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T12:43:58.000Z",
      "summary_90w": "",
      "raw": "Microsoft is addressing muffled audio quality on Bluetooth headsets by introducing a new LE Audio feature for Windows 11. Built on top of the Bluetooth Low Energy radio spec, LE Audio uses a new compression algorithm that results in higher quality audio that Microsoft says will “drastically” improve the audio experience in games and calls on Windows 11.\n“When using an LE Audio device with a Windows 11 PC that supports super wideband stereo, the switch into game chat no longer causes an abrupt drop in audio quality,” explains Mike Ajax, a principal program manager lead at Microsoft. Game audio will remain in stereo and stream at super wideband quality, instead of the limited experience of Bluetooth Classic.\nLE Audio uses a 32kHz sample rate while using voice apps like Teams or Discord, and replaces the Advanced Audio Distribution Profile (A2DP) and Hands-Free Profile (HFP) of Bluetooth Classic. HFP used a 8kHz sample rate and resulted in muffled audio, but most Bluetooth headsets now support improve audio compression and a better sample rate for “wideband” or “super wideband” voice.\nThe LE Audio support will also improve calls in apps like Microsoft Teams. While Teams uses Spatial Audio for wired headsets, it depends on stereo audio and hasn’t previously been supported on Bluetooth headsets. The super wideband stereo support over Bluetooth LE Audio enables Spatial Audio in Teams, and can be toggled on in the audio settings inside the Teams client on Windows.\nAll you need is a Bluetooth headset that supports Bluetooth LE Audio, as well as a Windows 11 PC that also supports LE Audio and has the latest drivers and Windows 11 24H2 update. Existing PCs should get the necessary driver updates later this year, and Microsoft expects “most new mobile PCs that launch starting in late 2025 will have support from the factory.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88c826f82975f81eb5e8cfd1de64cd0fdace24fd",
      "title": "Starmer’s EU negotiator gives stronger backing to youth mobility scheme",
      "url": "https://www.theguardian.com/world/2025/aug/27/starmers-top-eu-negotiator-hints-at-possible-youth-mobility-scheme",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T12:22:56.000Z",
      "summary_90w": "",
      "raw": "Nick Thomas-Symonds indicates closer ties with Europe in future and promises to agree agriculture deal\n\nUK politics live – latest updates\n\nKeir Starmer’s lead negotiator on Europe has enthused about how excited he is by the prospect of an EU youth mobility scheme, as he signalled a broader government shift towards embracing closer ties with the bloc.\nNick Thomas-Symonds, the Cabinet Office minister in charge of negotiating Britain’s relationship with the EU, said on Wednesday he was looking forward to signing a deal to let young people travel and work more freely across Europe.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "616415404c34d92ebe91838312b7919acfe120ca",
      "title": "Watch: Thousands play with tomatoes at annual festival",
      "url": "https://www.bbc.com/news/videos/c4gzdgx9jrpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T12:09:38.000Z",
      "summary_90w": "",
      "raw": "Tomatoes not fit for consumption are thrown at each other during the festival.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36db5dfd23adf299aec714fb9c9eafafbcff2e48",
      "title": "Second Melbourne man charged over arson attack on Adass Israel synagogue fronts court",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/second-melbourne-man-charged-over-arson-attack-adass-israel-synagogue-faces-court-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T12:09:15.000Z",
      "summary_90w": "",
      "raw": "Younes Ali Younes, 20, will appear again in December with co-accused Giovanni Laulu although court heard no evidence of links to Iran\n\nGet our breaking news email, free app or daily news podcast\n\nA man charged with torching a Melbourne synagogue in an antisemitic attack was remanded in custody when he appeared in court on Wednesday.\nYounes Ali Younes, 20, last week became the second suspect to be charged for the December arson attack on the Adass Israel synagogue which Australia accuses Iran of directing. Police allege three masked arsonists doused the building’s interior with a liquid accelerant before igniting it, causing extensive damage and injuring a worshipper.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ab2c12c4bb285baa043491530c825a4301dca64",
      "title": "US disaster agency suspends workers who criticised Trump cuts, reports say",
      "url": "https://www.bbc.com/news/articles/c8denvzl0y8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T12:08:07.000Z",
      "summary_90w": "",
      "raw": "The Fema staff are said to have been among those who recently lent their names to an open letter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bce204e48a92aae92d786fae095d7d66d7090c82",
      "title": "How Taylor Swift's engagement could change her music",
      "url": "https://www.bbc.com/news/articles/c0ml7dmm1y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T12:03:58.000Z",
      "summary_90w": "",
      "raw": "She's known as pop's most confessional songwriter, so how will domestic bliss change Taylor Swift?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bce204e48a92aae92d786fae095d7d66d7090c82",
      "title": "What difference will marriage make to Taylor Swift's music?",
      "url": "https://www.bbc.com/news/articles/c0ml7dmm1y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T12:03:58.000Z",
      "summary_90w": "",
      "raw": "She's known as pop's most confessional songwriter, so how will domestic bliss change Taylor Swift?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c4b00eff8f9862a7ed3a14eb7b2de1068f4abc5",
      "title": "Take The Planet Money Summer School Quiz In Political Economy",
      "url": "https://www.npr.org/2025/08/27/g-s1-85342/planet-money-summer-school-quiz-political-economy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:56:51.000Z",
      "summary_90w": "",
      "raw": "Think you have what it takes to successfully manipulate the market and build a domestic industry from the ground up? If so, these eight questions stand between you and your Summer School diploma in Political Economy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a0306d47c53934b4e72659f24ecdcb8b52e1abd8",
      "title": "How achievable is Reform's plan on migration?",
      "url": "https://www.bbc.com/news/articles/cx29l0wqlgeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T11:56:03.000Z",
      "summary_90w": "",
      "raw": "A Reform government could see the UK leaving the European Convention on Human Rights to deliver its plan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4529aaecf2d8ecce46bbb3d5595ecb3649af5181",
      "title": "Lego builds record sales of £4bn as parents steer children away from smartphones",
      "url": "https://www.theguardian.com/lifeandstyle/2025/aug/27/lego-sales-rise-as-parents-steer-children-to-activities-away-from-smartphones",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T11:54:01.000Z",
      "summary_90w": "",
      "raw": "Danish toymaker’s first-half profits also rise, and sales almost double at UK-based Yoto, creator of screen-free speakers for children\nLego said it could be benefiting from parents’ desire to keep children – and themselves – away from smartphones as sales rose 12%, helped by strong sales of its Botanicals and Formula One grand prix-themed sets.\nThe Danish toy company said sales increased to a record 34.6bn Danish kroner (£4bn) in the first half of the year, rising well ahead of the recovering global toy market in which sales rose 7%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04eb1ef8176cfef54e2af1377deca71425525247",
      "title": "Whatever happened to our sibling series? It's back! And guess who's the heir apparent",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/27/g-s1-84538/heir-inheritance-youngest-sibling-pakistan",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:52:44.000Z",
      "summary_90w": "",
      "raw": "When parents die, sibling tensions can arise over inheritance. In many traditions, the oldest child used to get it all. In a part of Pakistan, there's a surprise twist: The youngest is the chosen one.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fced1e5123887b3d39847d200e014a77b61c9ea5",
      "title": "Fed governor fights for her job. And, the DNC has a message for Democrats",
      "url": "https://www.npr.org/2025/08/27/g-s1-85692/up-first-newsletter-lisa-cook-dnc-ken-martin-taylor-swift-travis-kelce",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:51:09.000Z",
      "summary_90w": "",
      "raw": "Fed Governor Lisa Cook plans to fight to keep her job with a forthcoming lawsuit challenging President Trump. And, the DNC addresses the Democratic Party's challenges.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2fc13ea8284460f92977b7cc2aecfb3a655332f",
      "title": "Conservative Graham Simpson defects to Reform to become party's sole MSP",
      "url": "https://www.bbc.com/news/articles/cr74kg1vg4jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T11:40:18.000Z",
      "summary_90w": "",
      "raw": "Simpson announced his move as he appeared at a press conference in Scotland with Reform leader Nigel Farage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a225ed84824b10325aac10baed0fc78ba43b916b",
      "title": "Denmark summons top US diplomat over alleged 'covert influence operations' in Greenland",
      "url": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T11:39:04.000Z",
      "summary_90w": "",
      "raw": "The aim was reportedly to infiltrate Greenland's society and promote its secession from Denmark.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a225ed84824b10325aac10baed0fc78ba43b916b",
      "title": "Denmark summons top US diplomat over alleged Greenland influence operation",
      "url": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T11:39:04.000Z",
      "summary_90w": "",
      "raw": "The aim was reportedly to infiltrate Greenland's society and promote its secession from Denmark.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c2812eb8a502612cdd51cb6d0fce9f96254be85",
      "title": "A 6-year-old girl from Gaza, a missing limb and a doctor's mission",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/27/g-s1-85310/gaza-lebanon-israel-hamas-reconstructive-surgery",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:31:24.000Z",
      "summary_90w": "",
      "raw": "How do you heal the wounds of war? That is the mission of Dr. Ghassan Abu-Sittah, a reconstructive and plastic surgeon at the American University of Beirut Medical Center.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f818ec02bb5b95b874bc3f78a805bdcb0287ff8",
      "title": "Rightwing ‘parents’ rights’ groups gain ground in Canada as Alberta book bans target LGBTQ+ titles",
      "url": "https://www.theguardian.com/world/2025/aug/27/alberta-book-ban-canada-parents-rights-groups",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T11:30:01.000Z",
      "summary_90w": "",
      "raw": "Two such groups claim they persuaded Alberta to institute sweeping public school book ban\nSocially conservative “parents’ rights” groups that have emerged as powerfully political lobbying groups in the US are quickly gaining ground in Canada, academics and free speech advocates say, after two such groups claimed they had persuaded Alberta to institute a sweeping public school book ban.\nAlberta recently directed schools to purge library books from shelves that fit its definition of “explicit sexual content” by 1 October. If the policy is applied precisely as outlined, a host of books face being purged, including George Orwell’s 1984 due to passages in the text that discuss sexual intercourse and rape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36e23bb5a370b25bb9a69c8f82047dcaba4d817f",
      "title": "The GOP is shying away from town halls. This Missouri congressman is doing 15 of them",
      "url": "https://www.npr.org/2025/08/27/g-s1-85288/gop-townhalls-missouri-rep-mark-alford",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:25:34.000Z",
      "summary_90w": "",
      "raw": "At a time when congressional Republicans are generally opting against town halls, Missouri Rep. Mark Alford is embarking on a four-day, 15-stop tour to meet with constituents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f69cddd2bf2a51bd5e17c2e9d672b492a56ff571",
      "title": "Nothing busted using professional photos as Phone 3 samples",
      "url": "https://www.theverge.com/report/766543/nothing-busted-using-fake-phone-3-photo-samples",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T11:20:53.000Z",
      "summary_90w": "",
      "raw": "On the left is a screenshot taken from a Nothing Phone 3 demo unit. On the right, one of the images can be seen on the Stills stock photo marketplace.\t\n\nTech brand Nothing has been caught passing off stock images from professional photographers as samples taken by the Phone 3. Five sample images that Nothing claimed were captured by the device were actually licensed photos taken with other cameras.\nThe photographer behind one of the images has anonymously confirmed to The Verge that it wasn't taken using the Phone 3, and that Nothing had purchased the image license via the Stills stock photo marketplace. The Verge has seen the EXIF file for the anonymous photographer's image, and can confirm it wasn't captured using the Phone 3. According to the EXIF data, it was taken in 2023, long before  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "10c9f2582f0687b37dafb017ee5780e2281ce874",
      "title": "Lil Nas X says he's OK after 'terrifying' arrest",
      "url": "https://www.bbc.com/news/articles/c5ylv15xd0xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T10:57:46.000Z",
      "summary_90w": "",
      "raw": "He pleaded not guilty to injuring a police officer and resisting arrest after being found naked in LA.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1f334d1bb0c24b17b310b46c684e3ea7482e1ee",
      "title": "Vast private zoo run by son of India's richest man faces inquiry ",
      "url": "https://www.bbc.com/news/articles/cgqn5jjk55no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T10:57:00.000Z",
      "summary_90w": "",
      "raw": "The centre run by the billionaire Ambanis faces allegations it unlawfully acquired and mistreated animals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "72bb4f60b82275cc302dc3084867c58792e756a2",
      "title": "Are you a new grandparent? NPR wants to hear from you for National Grandparent's Day",
      "url": "https://www.npr.org/2025/08/27/g-s1-85689/family-grandparent-relationships-parent",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T10:32:12.000Z",
      "summary_90w": "",
      "raw": "National Grandparents Day is Sep. 7. NPR wants to hear from new grandparents about how your life has changed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e6f3ec10bb216c8fe217fffb84a782593083c85",
      "title": "Does the US president have the power to sack a Federal Reserve governor? ",
      "url": "https://www.bbc.com/news/articles/cedvj2d5538o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T10:27:06.000Z",
      "summary_90w": "",
      "raw": "President Trump takes aim at Lisa Cook, a central bank official - we unpack what it all means.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "05d404af9ebbdefa9d3d949102cf27dadc3a47c4",
      "title": "In idyllic Porepunkah, a manhunt this huge feels ‘surreal’ – and the alleged killer could be anywhere",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-victoria-manhunt-alleged-killer-bush-search-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T10:07:32.000Z",
      "summary_90w": "",
      "raw": "A peaceful Victoria town has been rocked by the fatal shootings of two police officers, leaving locals shuttered indoors and police scouring bushland for the suspect\n\nWho is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest magistrate\n\nHow a police search warrant at a rural Victorian property ended in a day of tragedy\n\nGet our breaking news email, free app or daily news podcast\n\nIt would have been idyllic were it not for the sound of a police helicopter reverberating over the valley.\nBy late afternoon on Wednesday the rain had slowed to a drizzle in Porepunkah. Mist curled around the foothills of Mt Buffalo. Cows and sheep grazed under a grey sky, unperturbed by the massive manhunt around them.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a6bd4be121eda46186ea6d5c64ce5b3861442b2",
      "title": "Who is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest a magistrate, court records reveal",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-shooting-suspect-dezi-freeman-victoria-police-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T10:05:27.000Z",
      "summary_90w": "",
      "raw": "Victoria police say alleged shooter remains on the run and armed after two officers killed and a third injured\n\nWhat we know so far about the shooting in rural Australia\n\nGet our breaking news email, free app or daily news podcast\n\nDezi Freeman, the man suspected of shooting and killing two police officers and injuring a third at a rural Victorian property, said he had a history of unpleasant encounters with the force, who he called “terrorist thugs”, “frigging Nazis” and “Gestapo” that wore “the satanic symbol” of an “inverted pentagram” on their uniforms, according to court records.\nFreeman also has a history of association with pseudolaw and “sovereign citizen” ideas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a7f4dc35f82f1afaac9bd6f520f1de00f65a1d6f",
      "title": "&#8216;Vibe-hacking&#8217; is now a top AI threat",
      "url": "https://www.theverge.com/ai-artificial-intelligence/766435/anthropic-claude-threat-intelligence-report-ai-cybersecurity-hacking",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T10:00:00.000Z",
      "summary_90w": "",
      "raw": "\"Agentic AI systems are being weaponized.\" \nThat's one of the first lines of Anthropic's new Threat Intelligence report, out today, which details the wide range of cases in which Claude - and likely many other leading AI agents and chatbots - are being abused. \nFirst up: \"Vibe-hacking.\" One sophisticated cybercrime ring that Anthropic says it recently disrupted used Claude Code, Anthropic's AI coding agent, to extort data from at least 17 different organizations around the world within one month. The hacked parties included healthcare organizations, emergency services, religious institutions, and even government entities. \n\"If you're a so …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bccdebeecbb233b805360dcd5882bd4427125e03",
      "title": "Drowning prevention program comes to a halt at the CDC",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/27/nx-s1-5509976/drowning-prevention-program-halt-cdc",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T10:00:00.000Z",
      "summary_90w": "",
      "raw": "A few years in, a CDC drowning prevention program was ready to share its findings on how to mitigate the leading cause of death among young children. Then the administration terminated that staff.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bfee25374c0ccf8085e7e595348c242ea0260ce7",
      "title": "In the brain, a lost limb is never really gone",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/27/nx-s1-5515601/brain-map-lost-limb-amputee-plasticity",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Even years after an arm is amputated, the brain maintains a detailed map of the limb and tries to interact with this phantom appendage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "860c2c886f4d18cfe2d7745304bbcb92ff881839",
      "title": "Woolworths struggles to win back ‘price trust’ from customers – and investors – as Coles’ value rises",
      "url": "https://www.theguardian.com/business/2025/aug/27/woolworths-coles-results-market-value",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T09:39:40.000Z",
      "summary_90w": "",
      "raw": "Market value of Woolworths, Australia’s largest supermarket chain, slips from more than $40bn to less than $35bn\n\nGet our breaking news email, free app or daily news podcast\n\nWoolworths has shed more than $5bn in market value as it struggles to regain customer “price trust” and stretches product availability.\nAustralia’s biggest supermarket chain on Wednesday reported sales rose 3% in the year to June and 2% in July and August compared to the year before, while profits in 2024-25 fell by a fifth, to nearly $1.4bn.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a81bafb2054f937af0728d19f9922d93610c8ec6",
      "title": "Watch: Raging rivers cause destruction in parts of northern India",
      "url": "https://www.bbc.com/news/videos/cp94eg1p7rvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T09:30:46.000Z",
      "summary_90w": "",
      "raw": "At least 30 people have died since Tuesday, as flash floods swept away roads and submerged homes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fe56b2c72b4dbeb20a49b95662bf206b54da482b",
      "title": "London targets noisy commuters with headphone campaign",
      "url": "https://www.theverge.com/news/766522/london-tfl-headphone-campaign-noisy-passengers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T09:26:17.000Z",
      "summary_90w": "",
      "raw": "TfL is using posters to encourage passengers to wear headphones when listening to audio. | Image: TfL / The Verge\t\n\nAfter bringing 4G and 5G connectivity to the Underground, London’s public transport authority has started scolding noisy passengers who subject everyone to music and calls blasting out of their phones. A new poster campaign launched by Transport for London (TfL) this week encourages customers to wear headphones when watching or listening to content on their devices to reduce disruption for other commuters.\n“Please don’t disturb others with loud music or calls when travelling on the network,” reads the “Headphones On” poster. The posters are already being displayed on the Elizabeth rail line, according to TfL, and will expand to bus, Docklands Light Railway, London Overground, London Underground, and London Tram services from October.\nThe campaign targets headphone dodgers as data coverage becomes more available across the underground rail network, making it easier for passengers to stream content and make calls on the go. People who do so without donning headphones are annoying other commuters, however, with TfL research showing that 70 percent of 1,000 surveyed customers reported loud music and phone calls disrupting their journeys.\n“The vast majority of Londoners use headphones when travelling on public transport in the capital, but the small minority who play music or videos out loud can be a real nuisance to other passengers and directly disturb their journeys,” says London’s deputy transport mayor, Seb Dance. “TfL’s new campaign will remind and encourage Londoners to always be considerate of other passengers.”\nThe new posters expand upon the “#TravelKind campaign” that TfL launched in 2017, highlighting ways that road and public transit users can help to prevent delays and make journeys run more smoothly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2c7e65d86f34773add203a3dc288ed5ed70ac4e3",
      "title": "Porepunkah shooting: loud bangs heard near property – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/aug/27/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T09:25:28.000Z",
      "summary_90w": "",
      "raw": "Victoria police chief commissioner Mike Bush says suspect Dezi Freeman, 56, is ‘heavily armed’ and still at large. This blog is now closed\n\nPorepunkah shooting: two Victoria police officers dead, one injured in attack at rural property\n\nWhat we know so far about the shooting in rural Australia\n\nThe chief commissioner of Victoria police, Mike Bush, said Freeman, 56, is “heavily armed” and still at large. Bush said a “large team” were “absolutely focused” on finding the suspect:\nWe are pouring every resource into this search for this person, we must find him … The hunt will continue until we find him.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d0e67493e7b4016073768bd9fbb808c298f219a6",
      "title": "Parents of teenager who took his own life sue OpenAI",
      "url": "https://www.bbc.com/news/articles/cgerwp7rdlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T09:18:05.000Z",
      "summary_90w": "",
      "raw": "The Raine family alleges ChatGPT \"actively helped\" their 16-year-old son take his own life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9217280dfd278e95dcddb400d1699f269a8cb078",
      "title": "Deforestation has killed half a million people in past 20 years, study finds",
      "url": "https://www.theguardian.com/environment/2025/aug/27/deforestation-has-killed-half-a-million-people-in-past-20-years-study-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T09:00:57.000Z",
      "summary_90w": "",
      "raw": "Localised rises in temperature caused by land clearance cause 28,330 heat-related deaths a year, researchers find\nDeforestation has killed more than half a million people in the tropics over the past two decades as a result of heat-related illness, a study has found.\nLand clearance is raising the temperature in the rainforests of the Amazon, Congo and south-east Asia because it reduces shade, diminishes rainfall and increases the risk of fire, the authors of the paper found.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b3932281d0754a04947921c3bbd1d66fbe36c0f",
      "title": "Flag burning has a long history in the U.S. — and legal protections from the Supreme Court",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518151/flag-burning-executive-order",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump's executive order challenges a landmark Supreme Court decision, according to free speech attorneys.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44d209a2c7f8693c5214b8a2210a6cc53c892ac0",
      "title": "Hurricane Katrina forced changes at FEMA. Trump is rolling them back",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5476531/fema-hurricane-katrina-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The government's colossal failure to respond after Hurricane Katrina led to major reforms at the nation's top disaster agency. Now, the Trump administration has reversed some of those changes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89593b329d156382e101da4712c0061a7e78d590",
      "title": "Taylor's engaged - what we learned and the new details revealed by Travis's dad",
      "url": "https://www.bbc.com/news/articles/c4gzdpk3xwjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T08:50:09.000Z",
      "summary_90w": "",
      "raw": "As the news broke, many Swifties joke on social media they are happy for their \"close friend\" Swift.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2fccbf7a9f48faa73b6d07fceae586e2219f7b0",
      "title": "U.S. tariffs take effect on India, threatening $48.2B in exports",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518809/india-us-tariffs-trump-modi-exports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:48:54.000Z",
      "summary_90w": "",
      "raw": "Earlier this month President Trump signed an executive order imposing an additional 25% tariff on India due its purchases of Russian oil, bringing the combined tariffs to 50%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "74b51ec27a66773933f7c5b98018098bb4a2b5bc",
      "title": "Police killed in Australia shooting named as manhunt continues",
      "url": "https://www.bbc.com/news/articles/c4g6wlxd5kko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T08:08:55.000Z",
      "summary_90w": "",
      "raw": "Dezi Freeman allegedly opened fire on officers who were at his rural property to execute a warrant.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ce31cc150cb07b342e940266198c9b157cf0b5c",
      "title": "Despite sanctions, many countries are still importing Russian products",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5496336/despite-sanctions-many-countries-are-still-importing-russian-products",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:06:54.000Z",
      "summary_90w": "",
      "raw": "Economic sanctions and trade restrictions against Russia following its full-scale invasion of Ukraine were set to force Moscow's hand. But the U.S. and Europe continue to rely on Russian imports.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d311b580672a921da9df17646c52f6765414f05f",
      "title": "Former player makes Aussie Rules history by coming out as bisexual",
      "url": "https://www.bbc.com/news/articles/c4g6wwrze2xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T07:42:47.000Z",
      "summary_90w": "",
      "raw": "Mitch Brown hopes his decision to speak on his sexuality will create a safer space for others.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df0fd20eefdc4e0dcbf3d3c5462970db86c1dc64",
      "title": "South Korea bans phones in school classrooms nationwide",
      "url": "https://www.bbc.com/news/articles/c776ye6lrvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T06:31:04.000Z",
      "summary_90w": "",
      "raw": "It is the latest country to restrict phone use among children and teens.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0008ce6ff997920e58caaa0edbd3ca3eb34659b1",
      "title": "Ukraine admits Russia has entered key region of Dnipropetrovsk",
      "url": "https://www.bbc.com/news/articles/c17n1p24yv9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T06:19:21.000Z",
      "summary_90w": "",
      "raw": "Military says Russian advance \"is the first attack of such a large scale\" in industrial province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f8e1a62a97dc2e61b0b1ff141fd2661a7518f2f",
      "title": "In decline or in transition? Hamilton's Ferrari start analysed",
      "url": "https://www.bbc.com/sport/formula1/articles/c4ger1vyjzvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T06:03:37.000Z",
      "summary_90w": "",
      "raw": "Lewis Hamilton and Ferrari have struggled for competitiveness so far in 2025. Andrew Benson analyses why it has not worked so far.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7517865a69cee8773511ce04954a1bfa18ce98c8",
      "title": "Attempt to partner African countries with Japanese cities triggers xenophobic backlash",
      "url": "https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T05:01:42.000Z",
      "summary_90w": "",
      "raw": "Cities in Japan have received thousands of complaints amid confusion over scheme that was intended to foster closer ties\nAn attempt to promote friendship between Japan and countries in Africa has transformed into a xenophobic row about migration after inaccurate media reports suggested the scheme would lead to a “flood of immigrants”.\nThe controversy erupted after the Japan International Cooperation Agency, or JICA, said this month it had designated four Japanese cities as “Africa hometowns” for partner countries in Africa: Mozambique, Nigeria, Ghana and Tanzania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play here",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T04:48:11.000Z",
      "summary_90w": "",
      "raw": "Find out if you're forecast to become the BBC's next star meteorologist by playing our new guessing game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0e0a39c40aece012e9985a1e2085599297866469",
      "title": "Princess Diana 90s time capsule contains Kylie CD and pocket TV",
      "url": "https://www.bbc.com/news/articles/cgqn5jzn2vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T04:38:45.000Z",
      "summary_90w": "",
      "raw": "The time capsule was buried in 1991 to mark the laying of the foundation stone at Great Ormond Street Hospital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2bd23836bd799070bc0ad9389e6cae4ab5a910a8",
      "title": "UN demands justice over Israeli double strike on Gaza hospital",
      "url": "https://www.bbc.com/news/articles/cd6n97gj1nqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T02:16:49.000Z",
      "summary_90w": "",
      "raw": "An initial Israeli military report says the attack targeted a \"Hamas camera\" and identified \"gaps\" for further investigation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ff4150ce6708a13a86c433346060a942926a148",
      "title": "SpaceX notches major wins during 10th Starship test",
      "url": "https://techcrunch.com/2025/08/26/spacex-notches-major-wins-during-tenth-starship-test/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T01:25:37.000Z",
      "summary_90w": "",
      "raw": "This test marks a material advancement for the Starship program, which SpaceX wants to eventually use to send humans and cargo to Mars.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d177c25df0028111b2d7b7aae7ad240a62c0940",
      "title": "Who is Dezi Freeman, the 'sovereign citizen' wanted for killing police?",
      "url": "https://www.bbc.com/news/articles/cr4e9ddwd5ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T01:10:09.000Z",
      "summary_90w": "",
      "raw": "The conspiracy theorist once tried to arrest a magistrate and prosecute the state premier for treason.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d9dd641a014c12274a5b2213ddc09f727de03c1",
      "title": "Assort Health nabs $50M to automate patient phone calls, sources say",
      "url": "https://techcrunch.com/2025/08/26/assort-health-nabs-50m-to-automate-patient-phone-calls-sources-say/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T01:08:13.000Z",
      "summary_90w": "",
      "raw": "The company's AI voice agents are designed to take over high-volume, repetitive tasks like scheduling, cancellations, and frequently asked questions normally managed by front desk staff.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d7f527af382a91a5943bfd92909041a6c272552",
      "title": "Watch: SpaceX Starship finally completes successful test flight",
      "url": "https://www.bbc.com/news/videos/cd0dxg4kxg1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T00:48:13.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's giant rocket, earmarked for use in a 2027 mission to the Moon, has had multiple catastrophic failures in previous launches.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "103d2816afb80cc01a1c71691e3e1d6f4b7c4d96",
      "title": "Verily is closing its medical device program as Alphabet shifts more resources to AI",
      "url": "https://techcrunch.com/2025/08/26/verily-is-closing-its-medical-device-program-as-alphabet-shifts-more-resources-to-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T00:14:19.000Z",
      "summary_90w": "",
      "raw": "Alphabet's life sciences arm Verily laid off staff and eliminated its entire devices program as AI and data infrastructure take center stage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cdad268c9a3b82f9550cee193688aaba1f68161",
      "title": "Microsoft headquarters go into lockdown after activists take over Brad Smith’s office",
      "url": "https://techcrunch.com/2025/08/26/microsoft-headquarters-go-into-lockdown-after-activists-take-over-brad-smiths-office/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T23:32:17.000Z",
      "summary_90w": "",
      "raw": "The incident is the latest escalation by current and former employees who are demanding the company end its cloud contracts with Israel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2cb35ddc3ddee91c7809f55c783e8c57057028e9",
      "title": "Wildlife Photographer of the Year 2025 – the best pictures so far ",
      "url": "https://www.bbc.com/news/articles/c70r7plrdndo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T23:31:42.000Z",
      "summary_90w": "",
      "raw": "The photo taken by Bidyut Kalita, is among several highly commended in this year's Wildlife Photographer of the Year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc058dd340bc0c02b72359959db976c3fd5e6898",
      "title": "'I thought it was the end of my life': Inside Israel's attack on Iran's Evin Prison",
      "url": "https://www.bbc.com/news/articles/czd0e23j9q8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T23:17:20.000Z",
      "summary_90w": "",
      "raw": "In an exclusive interview with BBC Persian, a prisoner describes what happened when Israeli missiles tore through Iran's most notorious jail.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0bc1dcf8b39ad59e53fac8b96cdf5eac55152e8b",
      "title": "Mum's anger after funeral director keeps baby's body at home",
      "url": "https://www.bbc.com/news/articles/c4gjr0ylenzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T23:10:27.000Z",
      "summary_90w": "",
      "raw": "Zoe Ward tells the BBC of her experience with a funeral director who has since been barred from wards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "01010861de777fabdd79e10d024c65cd63911d09",
      "title": "Trump's brand of US capitalism faces 'socialist' backlash from conservatives",
      "url": "https://www.bbc.com/news/articles/cn85n2vg04go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T22:43:33.000Z",
      "summary_90w": "",
      "raw": "The government's stake in the computer chip maker is not without precedent, but it puts Trump at odds with some conservatives.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "298de5ae886f1f07635b0773f138faceccf72b56",
      "title": "Brazil judge orders round-the-clock surveillance of ‘flight risk’ Bolsonaro",
      "url": "https://www.theguardian.com/world/2025/aug/26/brazil-judge-orders-round-the-clock-surveillance-of-flight-risk-bolsonaro",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T22:21:06.000Z",
      "summary_90w": "",
      "raw": "Pre-trial monitoring ordered after police reported former president had drafted request for asylum in Argentina\nJair Bolsonaro must be under constant police surveillance, a supreme court justice has ruled, to prevent Brazil’s former president from fleeing days before the start of the trial that could see him jailed for more than 40 years.\nThe far-right leader has been wearing an electronic ankle tag since mid-July and has been under house arrest since early August. But last Monday, the prosecutor general asked the supreme court to tighten surveillance of the 70-year-old, after federal police reported he had even drafted a request for political asylum in Argentina.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e18c5a6d2d59cdc65527500158a42f820a4893e",
      "title": "Cook to sue Trump over order to fire her from Federal Reserve",
      "url": "https://www.bbc.com/news/articles/cx275n8gx0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T21:05:20.000Z",
      "summary_90w": "",
      "raw": "The central bank governor says the US president \"has no authority to do so\" in defiance of Trump's escalatory move against the Fed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36098a819c61baee6a2b8b97dc80fe4593df879e",
      "title": "Anthropic launches a Claude AI agent that lives in Chrome",
      "url": "https://techcrunch.com/2025/08/26/anthropic-launches-a-claude-ai-agent-that-lives-in-chrome/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T20:10:59.000Z",
      "summary_90w": "",
      "raw": "Anthropic is the latest AI lab to offer an AI agent with the ability to view and take action in a user's Chrome browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say, they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "072ecc63491ab15daace0c7306ca2944b1ff4748",
      "title": "A Radiohead song from 1997 is on the Hot 100 charts, thanks to TikTok",
      "url": "https://techcrunch.com/2025/08/26/a-radiohead-song-from-1997-is-on-the-hot-100-charts-thanks-to-tiktok/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T19:13:41.000Z",
      "summary_90w": "",
      "raw": "\"Let Down\" broke into the Billboard Hot 100 nearly 30 years after its release, marking just the fourth Radiohead song to enter the charts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "56ede2f00389eb38eedf20d574256d3525395908",
      "title": "Israeli protesters stage ‘day of disruption’ calling for end to war in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/26/israeli-protesters-stage-day-of-disruption-calling-for-end-to-war-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T18:46:43.000Z",
      "summary_90w": "",
      "raw": "Netanyahu continues to prepare Gaza City offensive as mediators await response to ceasefire proposal\nTens of thousands of people took part in demonstrations across Israel on Tuesday, blocking highways on a “day of disruption” that aimed to push Benjamin Netanyahu into agreeing a deal to end the war and calling off plans to attack Gaza City.\nRelatives of hostages led the biggest march and rally in Tel Aviv, while in Jerusalem hundreds of people gathered outside the prime minister’s office as the security cabinet met to discuss the war. There were dozens of other protests around the country, including on the main highway to the northern city of Haifa and inside Ben Gurion airport.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e13bec19b238ef4f1aa479d6abeacda6f9a07d9f",
      "title": "Anthropic settles AI book-training lawsuit with authors",
      "url": "https://techcrunch.com/2025/08/26/anthropic-settles-ai-book-training-lawsuit-with-authors/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T18:40:46.000Z",
      "summary_90w": "",
      "raw": "Called Bartz v. Anthropic, the case deals with Anthropic's use of books as training material for its large language models.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d71b04b3771ea3d757906c617f767f0f66ad9a1c",
      "title": "Why the US government is not the savior Intel needs",
      "url": "https://techcrunch.com/2025/08/26/why-the-u-s-government-is-not-the-savior-intel-needs/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T18:29:01.000Z",
      "summary_90w": "",
      "raw": "Intel doesn't need cash. Instead, the struggling semiconductor giant needs to figure out how to drum up interest for its foundry business.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c0401dff0a24496592e6599a9441bec7b2a27f",
      "title": "Libby’s library app adds an AI discovery feature, and not everyone is thrilled",
      "url": "https://techcrunch.com/2025/08/26/libbys-library-app-adds-an-ai-discovery-feature-and-not-everyone-is-thrilled/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T18:15:26.000Z",
      "summary_90w": "",
      "raw": "Libby launches \"Inspire Me,\" a genAI feature that helps its users find books to borrow from local libraries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c1df3d8fdb2df8b13c70114ca398f489c56ee8b",
      "title": "Teenager convicted over IS-inspired plot to attack Taylor Swift concert",
      "url": "https://www.theguardian.com/music/2025/aug/26/teenager-took-part-in-terror-plot-to-attack-taylor-swift-concert-court-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T18:15:20.000Z",
      "summary_90w": "",
      "raw": "Mohammad A, 16, given 18-month suspended sentence for helping plan foiled attack in Vienna\nA Berlin court has convicted a Syrian teenager of contributing to an Islamic State-inspired plot to attack a Taylor Swift concert in Vienna.\nThree dates in the US pop star’s record-breaking Eras tour were cancelled last summer after authorities learned of the plot.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f0d960759255126c9d9601b7af9f190b2e5c4a",
      "title": "Artwork looted by Nazis 80 years ago spotted in estate agent ad",
      "url": "https://www.bbc.com/news/articles/cq68dze2l71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T18:10:16.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady seen in house near Buenos Aires, more than 80 years after it was looted from a Jewish art dealer in Amsterdam.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a98a8afd0638af06d93bc2ba57f93416fc1c13fb",
      "title": "Meta to spend tens of millions on pro-AI super PAC",
      "url": "https://techcrunch.com/2025/08/26/meta-to-spend-tens-of-millions-on-pro-ai-super-pac/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T17:59:39.000Z",
      "summary_90w": "",
      "raw": "Meta's new PAC signals an intent to influence statewide elections, including the next governor’s race in 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c430890616fdf6131b7dbb5e3bfc3a91da5d2cfd",
      "title": "US envoy sparks uproar after telling Lebanese journalists to ‘act civilised’",
      "url": "https://www.theguardian.com/world/2025/aug/26/syria-tom-barrack-lebanon-beirut-journalists",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T17:46:21.000Z",
      "summary_90w": "",
      "raw": "Reporters demand apology from Tom Barrack, US special envoy to Syria, after his remarks at Beirut press conference \nJournalists in Lebanon have demanded an apology from a senior US envoy after he told them to “act civilized” and not be “animalistic”.\nAs reporters shouted questions after the US delegation’s meeting with the Lebanese president, Joseph Aoun, on Tuesday, Tom Barrack, the US ambassador to Turkey and special envoy to Syria, stepped up to the podium in the packed room and said: “We’re going to have a different set of rules ... please be quiet for a moment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19952da788fc24c89b1b6ca281a23bc24d739d3e",
      "title": "Teen avoids jail over plot to attack Taylor Swift Vienna concert",
      "url": "https://www.bbc.com/news/articles/crlz72l66pro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T17:39:09.000Z",
      "summary_90w": "",
      "raw": "Mohamed A will serve an 18-month suspended sentence after sending bomb-making instructions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "720b30119636aeb7de612a01b4938195bd33d442",
      "title": "DOGE uploaded live copy of Social Security database to ‘vulnerable’ cloud server, says whistleblower",
      "url": "https://techcrunch.com/2025/08/26/doge-uploaded-live-copy-of-social-security-database-to-vulnerable-cloud-server-says-whistleblower/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T17:30:30.000Z",
      "summary_90w": "",
      "raw": "The Social Security Administration's chief data officer has publicly blown the whistle, alleging DOGE put hundreds of millions of Social Security records at risk of compromise.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0165db784506b5beff13eb4289676758fcfbc48f",
      "title": "Bruce Willis's wife says he's in great health but brain failing",
      "url": "https://www.bbc.com/news/articles/c4gzkp8nzy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T17:30:06.000Z",
      "summary_90w": "",
      "raw": "The Die Hard star's partner also says she hopes to advocate for fellow carers in her new book.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "51a47e7d2dae314e0942ece0a08503866d05459f",
      "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T17:00:03.000Z",
      "summary_90w": "",
      "raw": "Open letter has been signed by 209 former EU ambassadors, senior diplomatic staff and ambassadors from EU nation states\nThe UN says that Israel must not only investigate alleged unlawful killings in Gaza like the hospital strike that killed 20 people, including journalists, the previous day, but also ensure those probes yield results.\n“There needs to be justice,” United Nations rights office spokesman Thameen Al-Kheetan told AFP in Geneva, adding that the large number of media workers killed in the Gaza war “raises many, many questions about the targeting of journalists”.\nThe Israeli authorities have, in the past, announced investigations in such killings.\nIt’s of course the responsibility of Israel, as the occupying power, to investigate - but these investigations need to yield results.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8526f5da1a3335cea98eec8bc641492e17d8550a",
      "title": "Not so fast: German court says Apple can’t call Watch carbon neutral",
      "url": "https://techcrunch.com/2025/08/26/not-so-fast-german-court-says-apple-cant-call-watch-carbon-neutral/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:35:27.000Z",
      "summary_90w": "",
      "raw": "Apple's carbon neutral claims are undermined by the short-term nature of carbon credits used to support them, the court said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "07bb09edba92472276cdec2e4ebcf6d69e4860cf",
      "title": "The wait is almost over: The 2025 Startup Battlefield 200 list drops tomorrow",
      "url": "https://techcrunch.com/2025/08/26/the-wait-is-almost-over-the-2025-startup-battlefield-200-list-drops-tomorrow/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:30:40.000Z",
      "summary_90w": "",
      "raw": "After reviewing thousands of groundbreaking applications from around the globe, we're just one day away from announcing the 2025 Startup Battlefield 200.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f889797d2d90133d024787285174c184cd5d343",
      "title": "Apple is holding its iPhone 17 event on September 9",
      "url": "https://techcrunch.com/2025/08/26/apple-is-holding-its-iphone-17-event-on-september-9/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T16:05:00.000Z",
      "summary_90w": "",
      "raw": "Along with the iPhones, Apple will likely have updated the Apple Watch Series 11, Ultra 3, and SE 3. The Apple Watch Ultra 3 would be a notable update amid the trio, with a bigger screen and faster charging support.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "29c48700734afcd2750c5376198dfe5b0bd968f1",
      "title": "Botswana’s president declares health emergency over supply shortages",
      "url": "https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:57:33.000Z",
      "summary_90w": "",
      "raw": "Duma Boko announces urgent funding package for medicines to be distributed with military oversight\nBotswana’s president has declared a public health emergency due to shortages of essential medicines and equipment, as a downturn in the global diamond market and US aid cuts take a toll on the country’s finances.\nThe announcement came after the Ministry of Health suspended non-urgent surgeries on 4 August, stating that the country was short of medicines to treat hypertension, diabetes, cancer, asthma and eye conditions, as well as supplies including bandages and sutures and those for sexual and reproductive health.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43a3ef9af2a8bbecbe56d7cbe23403421a47f319",
      "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
      "url": "https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T14:27:13.000Z",
      "summary_90w": "",
      "raw": "Dutch newspaper AD says it has traced Giuseppe Ghislandi’s Portrait of a Lady to house near Buenos Aires\nMore than 80 years after it was looted by the Nazis from a Jewish art dealer in Amsterdam, a portrait by an Italian master has been spotted on the website of an estate agent advertising a house for sale in Argentina.\nA photo shows the painting, Portrait of a Lady (Contessa Colleoni) by the late-baroque portraitist Giuseppe Ghislandi, also known as Fra’ Galgario, hanging above a sofa in the living room of the property, in a seaside town near Buenos Aires.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b0341dfada64707b55d027510963ee56add8c26",
      "title": "France returns slain king's skull to Madagascar",
      "url": "https://www.bbc.com/news/articles/cwy0qejppp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T13:17:17.000Z",
      "summary_90w": "",
      "raw": "King Toera was killed by French troops 128 years ago and his head kept in a Paris museum's archive.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8db85fa1d772a918b83edbd72e0fee519d15eb03",
      "title": "US House committee requests Epstein 'birthday book' from his estate",
      "url": "https://www.bbc.com/news/articles/cd6n9g8x212o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T13:09:16.000Z",
      "summary_90w": "",
      "raw": "A panel investigating the disgraced late financier's crimes has subpoenaed an alleged file with notes from associates.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e875477eb0d2cca77c60a736d3dd9f438d12e647",
      "title": "French PM fights for survival as rivals refuse to support confidence vote",
      "url": "https://www.bbc.com/news/articles/c1le1m48mr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T11:48:22.000Z",
      "summary_90w": "",
      "raw": "Opposition parties say they will not back Prime Minister François Bayrou after a he called the vote over deep budget cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ba52451fd3389a1da2e1b5d8b98cbc4e94025bf",
      "title": "How plants and fungi trade resources without a brain",
      "url": "https://www.npr.org/sections/planet-money/2025/08/26/g-s1-85185/plants-fungi-resources-trade-cooperation",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Fungi and plants have something to teach humans about global trade and cooperation",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6e77b9142c6dd815ffa9d84da62d2a5df508e540",
      "title": "Judge orders Kari Lake to answer questions about Voice of America under oath",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5506283/judge-order-kari-lake-sworn-deposition-voice-of-america-oath-usagm",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T09:00:00.000Z",
      "summary_90w": "",
      "raw": "U.S. Judge Royce Lamberth ordered Trump administration official Kari Lake to be deposed about her plans for Voice of America, saying she was \"verging on contempt.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c6214e34245147e0ca4a21df80148315e39674f4",
      "title": "Australia accuses Iran of directing antisemitic attacks on cafe and synagogue",
      "url": "https://www.bbc.com/news/articles/c9d085n75q3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T08:12:42.000Z",
      "summary_90w": "",
      "raw": "Australia orders Iran's ambassador to leave the country following intelligence services' allegations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "946ee68edff0cb4e775b227a9906502f009c7174",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "url": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:28:08.000Z",
      "summary_90w": "",
      "raw": "Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents\nCambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "798961477467e02a8704390f56a6f1492a18e412",
      "title": "Protests erupt in Indonesia over privileges for parliament members and ‘corrupt elites’",
      "url": "https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:26:10.000Z",
      "summary_90w": "",
      "raw": "Controversy over housing allowance, which is almost 10 times minimum wage, comes amid President Prabowo Subianto’s austerity drive\nRiot police have fired water cannon and rounds of teargas at thousands of stone-throwing protesters in Indonesia’s capital as anger over the lavish allowances of parliament members has fuelled public anger.\nThousands of students, workers and activists demonstrated outside the nation’s parliament on Monday against a monthly housing allowance of 50 million rupiah ($US3,075) for MPs, which is almost 10 times the Jakarta minimum wage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c675c10d86b6836f58897097924f60393aac3b50",
      "title": "Trump says he hopes to meet Kim Jong-un and raises prospect of US taking over some South Korean land",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/trump-north-korea-kim-jong-un-lee-jae-myung",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T01:20:11.000Z",
      "summary_90w": "",
      "raw": "South Korean president Lee Jae Myung uses Oval Office meeting to encourage Trump to engage with North Korean leader\nDonald Trump has said he wants to meet North Korean leader Kim Jong-un, possibly this year, in an attempt to revive the failed nuclear diplomacy of his first term as US president.\n“I’d like to have a meeting. I look forward to meeting with Kim Jong-un in the appropriate future,” Trump said during an occasionally awkward meeting at the Oval Office with South Korea’s new president, Lee Jae Myung, in which he raised the prospect of taking ownership of South Korean land that hosts a US military base.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92f40831e0a32882c5b431bebc43f33e69fcbe76",
      "title": "Trump seeks to fire Fed governor Lisa Cook -- but a legal fight looms",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5517335/trump-federal-reserve-governor-lisa-cook",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T00:52:50.000Z",
      "summary_90w": "",
      "raw": "Trump says he's firing Cook after one of his allies accused her of making false statements on a mortgage application. Cook said the president has no authority to fire her and vowed to stay.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "01a33cb7def2ec94927cf11ccf83ddd4a4952d35",
      "title": "Piracy and armed robbery surge in the straits of Malacca and Singapore – report",
      "url": "https://www.theguardian.com/world/2025/aug/26/piracy-straits-of-malacca-singapore",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T23:46:01.000Z",
      "summary_90w": "",
      "raw": "In the first six months of this year there were 80 incidents of piracy and armed robbery in the strategic waterways\nIncidents of piracy and armed robbery in the straits of Malacca and Singapore have nearly quadrupled in the strategic waterways this year, according to a new report from an anti-piracy monitoring group.\nIn the first six months of this year there were 80 incidents of piracy and armed robbery in the straits, according to ReCAAP’s Information Sharing Centre (ISC). In the same period last year there were 21 incidents.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f4997fc66c36fa7d9c72adcce835f06fa68e6a2",
      "title": "Trump again calls for FCC to revoke ABC and NBC licenses",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515480/fcc-abc-nbc-reviews",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T21:28:48.000Z",
      "summary_90w": "",
      "raw": "President Trump lashed out on social media late Sunday against ABC and NBC, putting the nation's top broadcast regulator once more at the center of his culture wars.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c39cdd06a6f18a8cc8daf774d23c06bbe54ed240",
      "title": "Mexican drug lord ‘El Mayo’ pleads guilty to racketeering in New York",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/ismael-zambada-el-mayo-pleads-guilty",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T17:44:40.000Z",
      "summary_90w": "",
      "raw": "Ismael Zambada was co-founder of Sinaloa cartel led by Joaquín ‘El Chapo’ Guzmán, now imprisoned in US\nThe Mexican drug lord Ismael “El Mayo” Zambada, co-founder of the Sinaloa cartel, pleaded guilty to federal racketeering charges as well as running a criminal enterprise on Monday, more than a year since he was arrested in Texas after what has been described as a kidnapping.\n“I recognize the great harm illegal drugs have done to the people in the United States and Mexico,” the 77-year-old Zambada said in court through a Spanish-language interpreter. “I apologize for all of it, and I take responsibility for my actions.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2971c699415ed15c5cdf7d4505b4ac817df2009",
      "title": "Evergrande's delisting in Hong Kong: key facts to know",
      "url": "https://www.npr.org/2025/08/25/g-s1-85108/evergrandes-delisting-in-hong-kong-key-facts-to-know",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T17:33:16.000Z",
      "summary_90w": "",
      "raw": "At its peak, China Evergrande Group was worth more than $50 billion. But it all came crashing down in 2021. It was massively in debt and unable to complete some existing projects.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "3a22103904e4ab5141476396556042a9ff1ba228",
      "title": "Dr Pepper will unwind its merger with Keurig after buying Peet's for $18 billion",
      "url": "https://www.npr.org/2025/08/25/g-s1-85104/dr-pepper-keurig-peets-purchase-merger-split",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T17:25:05.000Z",
      "summary_90w": "",
      "raw": "Seven years after they merged, the soft drink maker and coffee pod innovator will become separate companies again. CEO Timothy Cofer said separate coffee and beverage businesses would be more nimble.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a54cf198a490aa3d6eb1663a671a41cef7de9a31",
      "title": "South Korean President Lee to meet with Trump in Washington on Monday",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5508133/south-korean-president-lee-to-meet-with-trump-in-washington-on-monday",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T09:00:44.000Z",
      "summary_90w": "",
      "raw": "At a summit meeting in Washington, D.C., on Monday, the U.S. and South Korean presidents will discuss modernizing their 71-year-old alliance and fleshing out a trade deal reached last month.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5795c618e230224998fd210f35a94a572ac3085",
      "title": "Taiwan referendum on reopening last nuclear plant fails",
      "url": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T05:17:03.000Z",
      "summary_90w": "",
      "raw": "Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe\nA referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved.\nThe plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c5abfcf617849bf1d0a327b05f3a32a4aa3c34da",
      "title": "Israel begins ground offensive in Gaza City",
      "url": "https://www.bbc.co.uk/sounds/play/p0lybfkm?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-21T17:46:00.000Z",
      "summary_90w": "",
      "raw": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d417085f0c3e94038bb536037a083c06b1b78e8",
      "title": "Catherine Bott on pitch correction software",
      "url": "https://www.bbc.co.uk/sounds/play/b01shwkq?at_mid=IjEUKsel6i&at_campaign=Creating_Pitch_Perfect&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=b01shwkq&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Creating_Pitch_Perfect&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2013-05-20T15:32:00.000Z",
      "summary_90w": "",
      "raw": "Catherine Bott on software that corrects out of tune singing but is also a creative tool.",
      "topics": [
        "World"
      ]
    }
  ]
}