{
  "version": "1755278037642",
  "generatedAt": "2025-08-15T17:13:57.642Z",
  "items": [
    {
      "id": "e78fc99b58f131ff18bfccbf71d318e01572a227",
      "title": "Anthropic has new rules for a more dangerous AI landscape",
      "url": "https://www.theverge.com/news/760080/anthropic-updated-usage-policy-dangerous-ai-landscape",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T17:05:16.000Z",
      "summary_90w": "",
      "raw": "Anthropic has updated the usage policy for its Claude AI chatbot in response to growing concerns about safety. In addition to introducing stricter cybersecurity rules, Anthropic now specifies some of the most dangerous weapons that people should not develop using Claude.\nAnthropic doesn’t highlight the tweaks made to its weapons policy in the post summarizing its changes, but a comparison between the company’s old usage policy and its new one reveals a notable difference. Though Anthropic previously prohibited the use of Claude to “produce, modify, design, market, or distribute weapons, explosives, dangerous materials or other systems designed to cause harm to or loss of human life,” the updated version expands on this by specifically prohibiting the development of high-yield explosives, along with biological, nuclear, chemical, and radiological (CBRN) weapons.\nIn May, Anthropic implemented “AI Safety Level 3” protection alongside the launch of its new Claude Opus 4 model. The safeguards are designed to make the model more difficult to jailbreak, as well as to help prevent it from assisting with the development of CBRN weapons. \nIn its post, Anthropic also acknowledges the risks posed by agentic AI tools, including Computer Use, which lets Claude take control of a user’s computer, as well as Claude Code, a tool that embeds Claude directly into a developer’s terminal. “These powerful capabilities introduce new risks, including potential for scaled abuse, malware creation, and cyber attacks,” Anthropic writes.\nThe AI startup is responding to these potential risks by folding a new “Do Not Compromise Computer or Network Systems” section into its usage policy. This section includes rules against using Claude to discover or exploit vulnerabilities, create or distribute malware, develop tools for denial-of-service attacks, and more.\nAdditionally, Anthropic is loosening its policy around political content. Instead of banning the creation of all kinds of content related to political campaigns and lobbying, Anthropic will now only prohibit people from using Claude for “use cases that are deceptive or disruptive to democratic processes, or involve voter and campaign targeting.” The company also clarified that its requirements for all its “high-risk” use cases, which come into play when people use Claude to make recommendations to individuals or customers, only apply to consumer-facing scenarios, not for business use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "06d43ca16391a849ab9736c2e63f39e05c2f3b97",
      "title": "Lamborghini’s new plug-in hybrid is the fastest car its ever built",
      "url": "https://www.theverge.com/news/759581/lamborghini-fenomeno-phew-few-off-specs",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Lamborghini makes fast cars; this is an indisputable fact. So when the iconic Italian automaker says it’s new plug-in hybrid is both “the most powerful V12 every built” and “the fastest Lamborghini ever,” you should pay attention. \nAt Monterey Car Week, Lamborghini unveiled its new Fenomeno plug-in hypercar that will be part of the automaker’s limited edition “Few Off” collection, which also includes notable entrants like the Sián and Countach. But before you reach for your wallet, you should know that this exclusive machine will cost a whopping $3.5 million. Just in case you’re worried about affordability.\nIf money is no option, then the Fenomeno is sure to impress when out on the track. The combination of 835cv from the naturally aspirated 6.5-liter V12 and a further 245cv from the three electric motors, the Fenomeno’s total power output registers as a blistering 1,080cv (a metric unit of horsepower that roughly translates to 1,065hp). That’s a clear step above the Revuelto’s 1,015cv (1,001hp) power output and a sign that Lamborghini’s hybrid models have some room to grow.\nThe Fenomeno also represents a record-smashing power-to-weight ratio of 1.64kg/cv, which Lamborghini says is the best in its 62-year history. Maximum torque is the same as the Revuelto: 725 Newton-meters at 6,750 rpm. And a zero to 100 kph (zero to 62mph) sprint will only take you 2.4 seconds — a tenth of a second quicker than the Revuelto. That might not mean much to the average person, but for real performance heads, every tenth of a second you can shave off makes a difference. The Fenomeno also has a top speed of more than 350 kph (218 mph).\nLamborghini says the increased power is possible thanks to the new 7kWh battery that is unique to Fenomeno. Up from 3.8kWh in the Revuelto, the new battery pack bestows the Fenomeno with a claimed driving range of just 20 km (12.4 miles) in electric-only mode, compared to just a few clicks in the Revuelto.\nThe Fenomeno features a monocoque chassis and exterior built entirely from carbon fiber, with carbon-ceramic brake discs for added stopping power. It rides on 21-inch rims at the front and 22-inch wheels on the rear, wearing Bridgestone Potenza Sport tires.\nMore aggressive in its styling than the Revuelto, the Fenomeno features two large air intakes on the hood derived from the Huracán GT3 race car, while its silhouette is inspired by the “long tail” of the track-only Lamborghini Essenza.\nNaturally, the name was chosen as a nod to Lamborghini’s iconic bull logo, the company says:\nThe name Fenomeno comes, as per Lamborghini tradition, from a very brave and famous bull fought in Morelia, Mexico, in 2002. In a bullfight between two ‘toreros’, the bull was pardoned for the exceptional qualities it demonstrated. In both Italian and Spanish, Fenomeno means “phenomenal,” symbolizing something truly exceptional and unique.\nLamborghini only plans on making 29 Fenomeno hybrids — plus one for its own collection. But the hypercar’s design is meant to serve as a “design manifesto” for future Lamborghinis. When we’ll see a fully electric Lamborghini, though, remains a bit up in the air. In 2021, the Italian automaker outlined its electrification plans, which are supposed to produce gas-electric hybrid versions of its entire lineup. Following that, Lamborghini has said it will debut its first all-electric model sometime before the end of this decade.\nWe got a sneak peek of an electric Lamborghini with the all-electric Lanzador concept in 2023. Lamborghini initially planned to launch the production version in 2028 but pushed it back until 2029. Now it’s not clear if it will even arrive as a full EV. Lamborghini is also delaying its plans for an all-electric Urus and instead plans to release a performance version of its plug-in hybrid crossover.\nIn the meantime, these ultra-quick hybrids will have to suffice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5f3cec73de48f803d4d91b9136e5a41305b7b7b7",
      "title": "Washington DC sues federal government over police takeover",
      "url": "https://www.bbc.com/news/articles/c2018769n1yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:54:21.000Z",
      "summary_90w": "",
      "raw": "The city has asked a judge to block Attorney General Bondi's order that put in place an \"emergency police commissioner\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48a1141fa81884d7ab5b4f42d2696ee1a054dade",
      "title": "Trump confirms plans for ‘economically severe’ sanctions for Russia over Ukraine as he goes to meet Putin – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/aug/15/donald-trump-vladimir-putin-meeting-anchorage-alaska-ukraine-war-europe-live-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T16:50:35.000Z",
      "summary_90w": "",
      "raw": "US president says Russia needs to show willingness to seriously talk about the end of the war in Ukraine, as he travels to meeting in Anchorage, Alaska\nAsked if his conversation with Trump will cover territorial issues, Trump says:\n“They’ll be discussed, but I’ve got to let Ukraine make that decision, and I think they’ll make a proper decision, but I’m not here to negotiate for Ukraine. \nI’m here to get them at a table. \n“I noticed he’s bringing a lot of business people from Russia, and that’s good.\nI like that because they want to do business, but they’re not doing business until we get the war stopped.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "27dad586ae21fc81e751ddeb3915d5e6972a9d7a",
      "title": "‘Hellish’: heatwave brings hottest nights on record to the Middle East",
      "url": "https://www.theguardian.com/world/2025/aug/15/hellish-heatwave-brings-hottest-nights-on-record-to-the-middle-east",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T16:49:56.000Z",
      "summary_90w": "",
      "raw": "Temperatures did not drop below 36C in Sedom, Israel on Tuesday night, while several parts of Jordan stayed above 35C on Monday\nJordan and Israel have suffered through their hottest nights on record, with nocturnal temperatures in the Levant well above levels that scientists consider “hellish”.\nTemperatures on Monday night were never lower than 35C (95F) in Ghor es-Safi and Aqaba, in Jordan, while in the capital, Amman, they did not drop below 31.8C.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7969fde26fac89303ec07bf80b7875bf0f49b99",
      "title": "Iceland offers £1 reward to customers for reporting shoplifters",
      "url": "https://www.bbc.com/news/articles/c707rzen2zvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:33:32.000Z",
      "summary_90w": "",
      "raw": "The company estimates that shoplifting costs its business around £20m each year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3ff3e5beede45ebab646cfffcea621f42addf76b",
      "title": "CFPB staff layoffs can proceed, appeals court rules",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5403868/appeals-court-ruling-cfpb-layoffs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T16:21:49.000Z",
      "summary_90w": "",
      "raw": "The Trump administration sent reduction-in-force notices to more than 1,400 staffers at the Consumer Financial Protection Bureau in April.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5b7c6fccd2bb8bf478678cb22d8a2855819af80",
      "title": "Tensions grow as Trump and Washington, D.C. officials fight over police authority",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5503555/washington-dc-lawsuit-trump-metro-police-department",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T16:19:49.000Z",
      "summary_90w": "",
      "raw": "Tension in the nation's capital escalated over the question of who controls the city's police department after Washington, D.C.'s Attorney General sued over the White House's bid for full control.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8afffc9093501b4c9dab822ee4699259076fcba2",
      "title": "A comprehensive list of 2025 tech layoffs",
      "url": "https://techcrunch.com/2025/08/15/tech-layoffs-2025-list/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T16:08:50.000Z",
      "summary_90w": "",
      "raw": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a0cb13c918f6b5e3638bcd5a8f5289d6a9fcbadf",
      "title": "Charity boss offers Jenrick 'olive branch' over BBC row",
      "url": "https://www.bbc.com/news/articles/cwyex93wnd3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:08:40.000Z",
      "summary_90w": "",
      "raw": "The theologian who made the claim said he wanted to work with the shadow justice secretary.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb1057b5af6a72b31dffd61ccb7f942946a1a5b6",
      "title": "Epping hotel given temporary ban on taking new asylum seekers",
      "url": "https://www.bbc.com/news/articles/cp8z537ngvno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:05:15.000Z",
      "summary_90w": "",
      "raw": "A court hears housing the asylum seekers at the hotel is causing an \"unacceptable\" safety risk.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1b169e251d7803d1095175fa5759a575a52ed27",
      "title": "Suspended Labour councillor cleared of encouraging violent disorder at rally",
      "url": "https://www.bbc.com/news/articles/cjeykklwn7vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T16:04:05.000Z",
      "summary_90w": "",
      "raw": "Ricky Jones denied encouraging violent disorder after comments at a counter-protest last year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09a037ed2d107d69d9e3b285a2ea87a7c5554a00",
      "title": "Ultrahuman acquires viO HealthTech to launch enhanced cycle and ovulation tracking",
      "url": "https://techcrunch.com/2025/08/15/ultrahuman-acquires-vio-healthtech-to-launch-enhanced-cycle-and-ovulation-tracking/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T16:00:00.000Z",
      "summary_90w": "",
      "raw": "Cycle and Ovulation Pro is available starting Friday as a premium PowerPlug in the Ultrahuman app for $3.99 per month or $39.99 per year for users in the U.S., U.K., EU, Australia, and Canada.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fa038f8a39c330078102b3fb381a066bef42e735",
      "title": "Israeli minister posts video online confronting Palestinian detainee in his prison cell – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/15/israel-gaza-palestinian-injured-attack-israeli-settlers-west-bank-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:56:13.000Z",
      "summary_90w": "",
      "raw": "Far-right national security minister Itamar Ben Gvir posts video showing him confronting Marwan Barghouti, who has spent more than 20 years in Israeli custody\nAt least 16 Palestinian people, including five aid seekers, have been killed in Israeli attacks on Gaza since dawn, Al Jazeera is reporting, citing medical sources.\nHere are some of the latest images being sent to us over the newswires from Gaza:\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f15914728a88de4f926292f6abcb07cf64b9a7a",
      "title": "King hails veterans' courage and sacrifice on VJ Day",
      "url": "https://www.bbc.com/news/articles/c5y0lnzpqjgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:49:59.000Z",
      "summary_90w": "",
      "raw": "The King and Queen join veterans at a service to mark the 80th anniversary of Japan's surrender in World War Two.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "647975cea125e3ed7571695ecd0d86e7a4a2699c",
      "title": "ChatGPT’s mobile app has generated $2B to date, earns $2.91 per install",
      "url": "https://techcrunch.com/2025/08/15/chatgpts-mobile-app-has-generated-2b-to-date-earns-2-91-per-install/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T15:36:28.000Z",
      "summary_90w": "",
      "raw": "On average, the app is generating close to $193 million per month, up from $25 million last year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ebbbdf85db14648f720538dcda146aabd9da34cb",
      "title": "Microsoft launches inquiry into claims Israel used its tech for mass surveillance of Palestinians",
      "url": "https://www.theguardian.com/world/2025/aug/15/microsoft-launches-inquiry-claims-israel-used-tech-mass-surveillance-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:32:11.000Z",
      "summary_90w": "",
      "raw": "Company says use of its cloud technology to store millions of intercepted calls would breach terms of service\nMicrosoft has launched an “urgent” external inquiry into allegations Israel’s military surveillance agency has used the company’s technology to facilitate the mass surveillance of Palestinians.\nThe company said on Friday the formal review was in response to a Guardian investigation that revealed how the Unit 8200 spy agency has relied on Microsoft’s Azure cloud platform to store a vast collection of everyday Palestinian mobile phone calls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b97e3b550c530bbd5f2fbf4fa81c4cc21ffaf247",
      "title": "Kingsmill owner to buy Hovis to make UK bread giant",
      "url": "https://www.bbc.com/news/articles/c4gm3g2ljz1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:13:01.000Z",
      "summary_90w": "",
      "raw": "Warburtons is the current market leader and the deal needs approval from the competition watchdog.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b9300184c5d14f6baea7ed2b5752ede39788483",
      "title": "I tested a bunch of Switch 2 screen protectors, and these are the best",
      "url": "https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T15:10:59.000Z",
      "summary_90w": "",
      "raw": "This is what a Switch 2 looks like with a glossy glass protector attached to its screen. | Image: Cameron Faulkner/The Verge\t\n\nA glass screen protector is one of a few essential accessories that every Switch 2 owner should make, along with buying a protective case for the console. In fact, it should be a priority to stick one onto the console’s screen as soon as possible to avoid accidental scratches. \nI’ve been installing and removing Switch 2 screen protectors to test others on my console at an alarming rate, more than any sane person should, and here are the most important takeaways:\nDo not buy a flimsy plastic screen protector. They won’t protect your Switch 2 enough.\nIt’s impossible to tell different brands’ protectors apart once they’re on your screen; product packaging and the installation process are the biggest differences (as well as the key factors that increase cost).\nSome protectors are glossy and some are anti-reflective, each with its own tradeoffs. For my money, glossy is the way to go. The matte finish looks good, but it reduces the screen’s vivid quality and its viewing angles.\nOf the options below, it’s easiest to recommend amFilm’s three-pack of glossy screen protectors. Not only is the pack incredibly affordable ($7.19 from Amazon), but the tray also allows for perfect alignment of the glass protector for easy, bubble-free installation. I’ve used this company’s screen protectors on various gadgets for years, and I particularly like its glossy option over the matte finish, since it lets the Switch 2’s screen fully shine through.\namFilm three-pack of glossy screen protectors\nMy go-to screen protector brand for years has been amFilm. Three glossy tempered glass sheets come in the box, and the tools make installation fairly simple. JSAUX’s model is just as good based on my testing, and just as affordable.\n\nWhere to Buy:\n\n $8.65 $7.19 at Amazon\n\namFilm OneTouch two-pack of glossy screen protectors\nIn keeping up with some brands that offer faster installations, amFilm offers a two-pack of glossy protectors that includes a “OneTouch” tray. Remove the protector’s bottom film, attach the tray to your device, and then press gently on the protector until it’s fully applied.\n\nWhere to Buy:\n\n $15.99 $8.99 at Amazon\n\nDbrand Prism 2.0 two-pack of glossy screen protectors\nDbrand’s Prism 2.0 includes two glass protectors for the Switch 2, each nestled into plastic cases that fit perfectly around the edges of the console (with the Joy-Con 2 removed). $34.99 is expensive for two protectors, but if simplicity and elegant packaging trump value, then this is a good option.\n\nWhere to Buy:\n\n $34.95 at Dbrand\n\nGenki Aegis Shield two-pack of glossy screen protectors\nGenki offers a cheaper alternative to Dbrand with the Aegis Shield. It includes two protectors, and the installation process is nearly identical: just align the plastic frame with the console, pull the tab, and run your finger across the exposed section of the frame. Spigen makes a similar product that costs $24.99 for a two-pack.\n\nWhere to Buy:\n\n $19.99 at Amazon\n $19.99 at Genki\n\namFilm two-pack of matte screen protectors\nLet’s start with one of the most affordable options if you want to go the matte-textured route. AmFilm sells a two-pack of protectors at Amazon for $8.99. The set includes a plastic frame that serves as a guide to align the protector just right. JSAUX makes a similar product that’s the same price.\n\nWhere to Buy:\n\n $12.99 $9.99 at Amazon\n\namFilm OneTouch two-pack of matte screen protectors\nAmFilm also sells a two-pack with a OneTouch frame for easier installation. Again, keep in mind that opting for matte over glossy will reduce glare, but at the cost of viewing angles as well as the full vivid quality of the Switch 2’s screen. That’ll be an acceptable tradeoff for some, but not all people.\n\nWhere to Buy:\n\n $15.99 $12.99 at Amazon\n\nWhat’s coming next?\nJSAUX is launching a new screen protector in August called the Obsidian AR. I’ll be testing this model soon. The company claims that it offers vastly better glare resistance as well as enhanced brightness and color accuracy compared to standard protectors.\nUpdate, August 15th: Adjusted prices as needed, and added a link to our best Switch 2 accessories buying guide.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1369fcaa513177d0bdfbb7a1e44dbd1d909114e2",
      "title": "Sonic boom heard after RAF scrambled to incident",
      "url": "https://www.bbc.com/news/articles/c7vl8vdj225o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:08:39.000Z",
      "summary_90w": "",
      "raw": "A loud explosive sound is reported in Essex, Cambridgeshire, Suffolk, Norfolk, Kent and London.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aabe0d43fa409797fe6d741cdff14d0cd90e3095",
      "title": "The best deals on MacBooks right now",
      "url": "https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T15:08:22.000Z",
      "summary_90w": "",
      "raw": "Apple’s latest 14-inch MacBook Pro with M4 is on sale starting at $1,299 ($300 off).\t\n\nApple currently sells MacBooks equipped with its own M-series chips in a wide range of sizes and price points. It discontinued the M1 MacBook Air to make room for newer models, but some retailers are still selling the 2020 laptop starting at $599 ($50 off) at Walmart — a far cry from the $2,499 starting price of the latest 16-inch MacBook Pro with M4 Pro.\nPurchasing a new MacBook can certainly be a pricey endeavor, but thankfully, finding a deal is actually not that difficult. Apple has recently shaken up the starting RAM for several models, creating more options than ever before and resulting in steeper discounts on older models.bot\n\nThe best MacBook Air deals\nThe best MacBook Pro deals\nM4 and M4 Pro MacBook Pro\nThe best Mac Mini deals\n\nAlthough Macs may not get perpetual discounts, it’s not uncommon to see various models discounted by as much as $800. Alternatively, purchasing refurbished options directly from Apple is another way to save money without waiting for the changing deal winds to blow your way. It’s also the only option to find certain SKUs of older models as Apple continues to move forward on newer releases. Apple’s refurbished store provides a one-year warranty on all products, and generally offers discounts of up to 15 to 20 percent off the price of a new unit.\nBut if you want to buy new and you’re looking to save whatever you can, here are the best MacBook Air, MacBook Pro, and Mac Mini deals available.\nThe best MacBook Air deals\nM1 MacBook Air\nThe M1 MacBook Air was considered Apple’s entry-level laptop before the M3 model’s arrival prompted Apple to stop selling it directly in its online and in brick-and-mortar stores. But while the redesigned M2 version of the MacBook Air (which has been with us for a while as well) has taken over as the top value choice, the 2020 version with an M1 processor and fanless design remains available at some retailers as a solid budget option. It’s best suited for non-intensive productivity work, plus it has a comfortable keyboard, an excellent trackpad, and all-day battery life. For many people, the M1 Air still ticks the right boxes when it comes to performance and price, even if it’s long enough in the tooth to have been removed in our guide to the best laptops.\nThe base MacBook Air with the M1 chip comes with 8GB of RAM and 256GB of storage. It’s becoming harder to find in new condition, but Walmart has committed to keeping it around for the foreseeable future and is currently discounting it to $599 ($50 off), which is its lowest price to date.\n2020 MacBook Air with M1 (256GB)\nThe 2020 MacBook Air has been discontinued but remains a great value. It comes outfitted with the company’s original M1 chip in one of three different colors (silver, space gray, and gold).\n\nWhere to Buy:\n\n $649 $599 at Walmart\n\nM2 MacBook Air\nThe M2 MacBook Air is a slim, lightweight laptop with a 1080p webcam and a handy magnetic charger that frees up one of its two USB-C ports. Although its M2 processor wasn’t as revolutionary as the M1 generation, it’s a better performer for any kind of user than the M1, including creators with demanding workloads.\nIt does have some slight downsides, though, including slower storage in the base 256GB configuration and a notch cutout in its otherwise excellent screen. But even so, Apple hasn’t offered a more travel-friendly laptop than this one since the days of the polarizing 12-inch MacBook, and this prior-gen model was once good enough to top our list of the best laptops.\nThe M2-powered MacBook Air from 2022 seems to be on its way out, with availability waning. However, you can get the 13.6-inch M2 model with 16GB of RAM, 256GB of storage, and an eight-core GPU in select colors at Best Buy starting at $699 ($100 off). B&H Photo is offering a souped up 13.6-inch M2 MacBook Air with a 10-core GPU, 24GB of RAM, and a 2TB SSD for $1,699 ($800 off). \nIt’s a bit harder to find discounts on the 15.3-inch MacBook Air M2, however. While it’s in short supply at some retailers for its original MSRP, you’d be better off going with a discounted M4 model.\n13-inch MacBook Air with M2 (2022)\nThe 2022 MacBook Air is a thin, lightweight device powered by Apple’s M2 chip. The M2 model touts an improved 1080p webcam and a better display than its predecessor while retaining features like long battery life and MagSafe charging.\n\nWhere to Buy:\n\n $799 $699 at Best Buy (16GB RAM, 256GB SSD)\n $2499 $1699 at B&H Photo (24GB RAM, 2TB SSD)\n\nM3 MacBook Air\nThe M1 Air and its wedge had to perish for the M3 MacBook Air to exist. Apple’s updated entry-level laptops arrived in 2024 in both 13.6- and 15.3-inch variants simultaneously, bringing with them slightly faster performance and a slate of minor upgrades. Apple added Wi-Fi 6E, for one, along with an additional Thunderbolt port that allows you to use two external displays when the lid is closed. They also continue to offer 18 hours of battery life and a MagSafe charging port. Apple discontinued the M3 MacBook Air with 8GB of RAM last year and now considers the 16GB / 256GB model as the starting configuration.\nThe entry-level 13-inch M3 MacBook Air configuration with an 8-core GPU, 16GB of RAM, and a 256GB SSD is tough to find in stock. However, you can get the 24GB RAM / 512GB SSD model with a 10-core GPU for $1,099 ($200 off) in select colors at Best Buy. Given the relatively small price difference between these two models, it’s great that you’re getting double the amount of internal storage and additional memory. \nAs for the M3-powered 15-inch MacBook Air, you can buy it with 512GB of storage, 16GB of RAM, and a 10-core GPU for $1,099 ($200 off) at Best Buy.\n13-inch MacBook Air with M3 (2024)\nThe MacBook Air M3 is a jack-of-all-trades, with a balanced combination of performance and power efficiency. It also now supports dual displays with the lid closed, and the storage speed is noticeably faster. You don’t need to think about if this laptop will meet your needs — it just will.\n\nWhere to Buy:\n\n $1299 $1099 at Best Buy (24GB RAM, 512GB SSD)\n\nM4 MacBook Air\nIn March, along with an updated Mac Studio, Apple released an updated MacBook Air, which comes in both a 13- and 15-inch configuration with a M4 processor. Interestingly, the new Air starts at a lower price than the prior model, yet it offers slightly faster performance and twice as much base RAM at 16GB. It can also connect to two external monitors with the lid open, comes in a new sky blue color, and features the 12-megapixel Center Stage webcam from the latest MacBook Pro. There’s a lot to like.\nBoth the 13-inch and 15-inch MacBook Airs are currently receiving some good discounts. You can pick up the 13-inch base model with a 10-core CPU, eight-core GPU, 16GB of RAM, and 256GB of storage on sale for $799 ($200 off) at Amazon and Best Buy. If you prefer the larger 15-inch model, the entry-level configuration with a 10-core GPU, 16GB of RAM, and 256GB of storage is on sale for $999 ($200 off) at Amazon and Best Buy.\n13-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nPowered by the new M4 chip, Apple’s 13-inch MacBook Air is faster than its predecessor and offers double the base RAM. It can also now connect to two external displays with the lid open and features an improved Center Stage webcam.\n\nWhere to Buy:\n\n $999 $799 at Amazon\n $999 $799 at Best Buy\n\n\n15-inch MacBook Air (M4, 16GB RAM, 256GB SSD)\nApple’s 15-inch MacBook Air with the M4 chip is nearly identical to its 13-inch sibling. However, it includes a six-speaker sound system, not four, and your choice of a free 35W Dual USB‑C Port Compact Power Adapter or 70W USB‑C Power Adapter.\n\nWhere to Buy:\n\n $1199 $999 at Amazon\n $1199 $999 at Best Buy\n\nThe best MacBook Pro deals\nDuring its “Scary Fast” event in 2023, Apple announced MacBook Pros that use M3 processors — including a 14-inch model that replaced the 13-inch M2 model. Apple followed the M3 models up with M4-based machines in October 2024, and we’re already starting to see the discounts on them. That being said, the last-gen M3 models are often the better bargain, as they’re still relatively easy to find and receive steeper discounts.\nM3 and M3 Pro MacBook Pro\nThe entry point into the MacBook Pro world is a MagSafe-equipped MacBook Pro that uses the existing 14-inch design and slightly pares it down. The 14-inch M3 MacBook Pro has the same 3024 x 1964 resolution display and 120Hz refresh rate as its pricier siblings, and in addition to a MagSafe charging port, it has an SD card slot and HDMI port. However, it starts with just 8GB of RAM and lacks the third USB-C / Thunderbolt port found on the M3 Pro and M3 Max models (as well as Thunderbolt 4 speeds).\nThe M3 MacBook Pro may be a bit of an odd middle child in some ways, but it’s still a very good laptop — especially if you can find a deal that puts more price distance between the M3 model and the M3 Pro version. Availability for the base model with 8GB and 512GB of storage seems to be waning as Apple standardizes 16GB of RAM across its lineup.\nWe’re finding it challenging to spot the 16GB RAM / 512GB SSD model in stock. However, Best Buy is selling the 14-inch, M3-powered MacBook Pro with 8GB of RAM, a 1TB SSD, 10-core GPU for $1,299 ($300 off). You can also grab a 14-inch, M3-powered MacBook Pro with 18GB of RAM, a 512GB SSD, and a 14-core GPU for $1,499 ($400 off) at Best Buy. If you need more space, you can also get a 14-inch, M3-powered MacBook Pro with 18GB of RAM, a 1TB SSD, and 18-core GPU for $1,799 ($500 off) at Best Buy.\n14-inch MacBook Pro with M3 (2023)\nApple’s previous-gen 14-inch laptop powered by the M3 processor uses a similar design to the pricier 14-inch MacBook Pro with Apple’s Pro- / Max-series chips but is offered at a lower price with similar ports and less RAM.\n\nWhere to Buy:\n\n $1599 $1299 at Best Buy (8GB RAM, 1TB SSD)\n $1899 $1499 at Best Buy (18GB RAM, 512GB SSD)\n $2299 $1799 at Best Buy (18GB RAM, 1TB SSD)\n\nM4 and M4 Pro MacBook Pro\nApple released the M4-series MacBook Pro in November 2024. Notably, the base 14-inch M4 MacBook Pro is the first to launch with 16GB of RAM — double the previous generation’s starting memory — and 512GB of storage for the same $1,599 starting price as the last-gen model. It also picks up a third Thunderbolt 4 port, which is positioned on the right side and supports dual external monitors while the lid is open. Also new this year is an upgraded 12-megapixel webcam that supports Center Stage and a new Desk View feature, plus the option to add a nano-texture display for an extra $150. It’s also available in space black.\nThe 14- and 16-inch MacBook Pro models with M4 Pro and M4 Max chips also received additional RAM, bringing them up to 24GB. They start with 512GB of storage, too, and retail for $1,999 and $2,499, respectively. While the total port selection hasn’t changed compared to their respective M3 Pro and M3 Max counterparts, you’ll get faster Thunderbolt 5 ports on these more substantial models. That’s in addition to the SD slot, dedicated full-sized HDMI port, and 3.5mm jack. They also have the upgraded 12-megapixel Center Stage webcam with Desk View and the optional nano-texture display option.\nDeals for the M4 MacBook Pro have already started to roll in. Right now, for example, the base 14-inch MacBook Pro M4 with 16GB of RAM and a 512GB SSD for $1,299 ($300 off) at Amazon and Best Buy. Meanwhile, the 24GB / 512GB variant with an M4 Pro chip (12-core CPU / 16-core GPU) is down to $1,699 ($300 off) at Best Buy and B&H Photo.\nThe base 16-inch MacBook Pro is also on sale with an M4 Pro chip, 24GB of RAM, and 512GB of storage for $2,223 ($277 off) at Amazon and $2,249 ($250 off) at Best Buy.\nApple MacBook Pro 14 (2024, M4)\nThe entry-level MacBook Pro with M4 starts with 16GB of RAM — double that of its predecessor — and a 512GB SSD for the same starting price of $1,599. It also gets a third USB-C / Thunderbolt 4 port and comes in a new space black option.\n\nWhere to Buy:\n\n $1599 $1299 at Amazon (16GB RAM, 512GB SSD)\n $1599 $1299 at Best Buy (16GB RAM, 512GB SSD)\n\n\n14-inch MacBook Pro with M4 Pro\nThe 14-inch MacBook Pro with a 12-core / 16-core M4 Pro chip starts with 24GB of RAM — a 6GB increase over the prior generation. It also has a 512GB SSD, three Thunderbolt 5 USB-C ports, an optional nano-texture display, and a 12-megapixel webcam.\n\nWhere to Buy:\n\n $2499 $1699 at Amazon (24GB RAM, 512GB SSD)\n $2499 $1699 at B&H Photo (24GB RAM, 512GB SSD)\n $1999 $1699 at Best Buy (24GB RAM, 512GB SSD)\n\n\nApple MacBook Pro 16 (2024, M4 Pro)\nThe 16-inch MacBook Pro with M4 Pro starts with 24GB of RAM and offers more computing cores (14 for the CPU and 20 for the GPU) compared to the 14-inch model. It also picks up Thunderbolt 5 ports and a new 12-megapixel Center Stage camera.\n\nWhere to Buy:\n\n $2499 $2223 at Amazon (24GB RAM, 512GB SSD)\n $2499 $2249 at Best Buy (24GB RAM, 512GB SSD)\n\nThe best Mac Mini deals\nThe newest Mac Mini in town are the M4-based models which arrived late last year. Apple reduced the horizontal footprint of its desktop and paired it with its new M4 chipset and 16GB of RAM, which is double that of the previous generation and brings it in line with other base model Macs from 2024. That makes Apple’s newest desktop computer a tremendous value.\nM4 and M4 Pro Mac Mini\nDeals on the newest Mac Mini are a bit easier to come by now than they were at launch, which is good since the outgoing M2 model is becoming more difficult to find. The M4 Mac Mini starts with an M4 processor, 16GB of RAM, and 256GB of storage for $599. That’s an incredible value for a tiny desktop computer that can rival the Mac Studio and Mac Pro when it comes to certain tasks, including light gaming, 4K video editing, and 3D modeling. Vertically, the M4 Mac Mini is a fair bit thicker than the last-gen M2 model at 2 inches tall, yet it measures a mere 5 inches wide and 5 inches deep.\nIn addition to the odd decision to place the power button on its underside, Apple moved the 3.5mm headphone jack and two of its five USB-C / Thunderbolt 4 ports to the front. The rear features an additional three Thunderbolt ports, HDMI-out, and a gigabit Ethernet port. You can also get the Mac Mini with an M4 Pro chipset starting at $1,399, which comes with faster Thunderbolt 5 storage and the option to upgrade to 10-gigabit Ethernet for another $100.\nRight now, you can get the base Mac Mini at Amazon and B&H Photo with an M4 chip, 16GB of RAM, and a 256GB SSD for around $546 ($54 off). If you need more storage, you can step up to the version with 16GB of RAM and a 512GB SSD for around $719 ($80 off) at Amazon and B&H Photo.\nMeanwhile, the base M4 Pro model with 24GB of RAM and 512GB of storage is on sale at Amazon starting at $1,255 ($144 off).\nApple Mac Mini (M4)\nThe latest Mac Mini features Apple’s upgraded M4 chips and a smaller build than the prior model. Each configuration now starts with 16GB of RAM and includes five total Thunderbolt ports, gigabit ethernet, HDMI, and a 3.5mm jack. Read our review.\n\nWhere to Buy:\n\n $599 $546 at Amazon (M4, 16GB RAM, 256GB SSD)\n $598 $559 at 4B&H Photo (M4, 16GB RAM, 256GB SSD)\n $799 $719 at Amazon (M4 Pro, 16GB RAM, 512GB SSD)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d001ddd6d9c4406583982713c9b3b2f37173765c",
      "title": "Flash floods kill nearly 200 in Pakistan and Pakistan-administered Kashmir",
      "url": "https://www.bbc.com/news/articles/cn02g0n2kepo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:04:55.000Z",
      "summary_90w": "",
      "raw": "The majority of deaths were recorded in Pakistan's mountainous Khyber Pakhtunkhwa area.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32b103bac90fe274accc306d2e99afaf11119ec1",
      "title": "Bioethanol layoffs to start next week after rescue ruled out",
      "url": "https://www.bbc.com/news/articles/c24zlel2y5yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T15:00:53.000Z",
      "summary_90w": "",
      "raw": "Plants in Hull and Redcar had warned they would close without support after deal to allow US ethanol to come in tariff-free.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e2d9932ca8c62e791e26de1de92562e939fec30",
      "title": "Climate wars are simmering among the NSW Liberals – and they could pose a problem for Mark Speakman",
      "url": "https://www.theguardian.com/australia-news/2025/aug/16/climate-wars-are-simmering-among-the-nsw-liberals-and-they-could-pose-a-problem-for-mark-speakman",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:00:36.000Z",
      "summary_90w": "",
      "raw": "Energy policy had been an area of mostly bipartisan agreement for the NSW opposition – until now\n\nGet our breaking news email, free app or daily news podcast\n\nThe never-ending war within the Coalition over energy policy and climate targets appears to have infected the New South Wales Liberals, as they struggle to restore the administration of their branch and get traction with voters.\nIt’s bad news for the NSW opposition leader, Mark Speakman, whose hold on the leadership is being increasingly questioned.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "12b98ebf9648f89e2624a1189e3eda30da2bd079",
      "title": "The economic roundtable is Jim Chalmers’ chance for bold reform. Australians can’t afford anything less | Tom McIlroy",
      "url": "https://www.theguardian.com/australia-news/2025/aug/16/the-economic-roundtable-is-jim-chalmers-chance-for-bold-reform-australians-cant-afford-anything-less",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:00:35.000Z",
      "summary_90w": "",
      "raw": "The best way to undermine claims that the productivity roundtable is a stage-managed talkfest is to make it a success\n\nGet our breaking news email, free app or daily news podcast\n\nJim Chalmers had a determined look about him this week, ahead of the government’s much-hyped economic reform roundtable in Canberra.\nThe atmosphere in the treasurer’s office was reminiscent of the days immediately before a federal budget, with frenetic activity and an air of sleep deprivation among the small army of advisers. Preparations for the three-day event have been exhaustive and Chalmers works at a pace few people in the ministerial wing can sustain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b976f08841a2312a5d6cdd62088dcf5d00d393d",
      "title": "UTS academics describe ‘culture of fear’ as enrolments put on hold for nearly a fifth of courses",
      "url": "https://www.theguardian.com/australia-news/2025/aug/16/uts-academics-describe-culture-of-fear-as-enrolments-put-on-hold-for-nearly-a-fifth-of-courses",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T15:00:35.000Z",
      "summary_90w": "",
      "raw": "The freeze comes as the university pursues $100m in cost cuts and after it announced in April it could axe 400 jobs\n\nGet our breaking news email, free app or daily news podcast\n\nAcademics at the University of Technology Sydney have described feelings of stress and a “culture of fear” after the educational institution temporarily paused student enrolments for nearly a fifth of its courses, leaving staff wondering if their jobs will be among the hundreds set to be axed.\nThe university has stopped taking in new students for 120 of its 615 courses, including masters degrees in teaching primary and secondary education. More than 50 of the affected courses were international study options attached to other degrees. The pause will last until the end of the autumn 2026 semester.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77f4a940fbfd14e7c515b013f6183c1d5533e71c",
      "title": "Ukraine says it has bombed Russian ship carrying drone parts at Caspian port",
      "url": "https://www.theguardian.com/world/2025/aug/15/ukraine-says-bombed-russian-ship-drone-parts-caspian-port",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:55:15.000Z",
      "summary_90w": "",
      "raw": "Attack on cargo vessel more than 500 miles from frontline is show of force before Trump-Putin meeting\n\nEurope live – latest updates\n\nUkraine says it has conducted a long-range drone attack on a supply ship that it claims was carrying drone components from Iran, striking it at a port north of the Caspian Sea, in a show of force hours before Donald Trump and Vladimir Putin meet for a summit in Alaska.\nPhotographs showed a partially sunken cargo vessel at Olya, near Astrakhan, more than 500 miles from the frontline. Ukraine’s military claimed credit for the attack and the overnight bombing of an oil refinery at Samara on the Volga River, deep inside Russia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5860d07d2d1b4f3975218eeb1f387b3af447276d",
      "title": "The best Nintendo Switch controllers to buy right now",
      "url": "https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T14:51:42.000Z",
      "summary_90w": "",
      "raw": "The Nintendo Switch 2 is here, but we’re not going to forget about the original Switch. We’ve still got love for the console and its many millions of owners, so we’ll keep recommending the best controllers for the Switch right here. If you’re considering getting a Switch 2 in the future, all of the controllers below will work on the newer console.\nNow, you may have already realized long ago that the best Switch controllers aren’t the ones that come with the console. The removable Joy-Cons included with all non-Lite Switch consoles are convenient, given they can be detached for wireless use for up to two players with a pair, but their tiny shape doesn’t do them many favors. They aren’t comfortable to hold for long gaming sessions — especially if you have large hands. And, you’re definitely not alone if you’ve experienced Joy-Con drift.\nIn this buying guide, we’ll focus on wireless controllers that are both comfortable and reliable, as well as a few options that come with unique features designed that may match your unique play style. We’re not covering wired controllers that plug into the Switch’s dock here, as they’re mostly similar to each other and the savings aren’t worth giving up wireless freedom for.\nThere are some things that are worth knowing if you buy a third-party wireless controller (as in, one not made by Nintendo), it may not support HD rumble, motion controls, NFC for Amiibo, or be able to wake the Switch remotely. However, there are some exceptions, which we feature below.\nIf you’re playing your Switch while docked, it’s hard to go wrong with the official Nintendo Switch Pro Controller. It’s the only traditional gamepad that includes every feature mentioned above, and it’s one of the most satisfying controllers to use that we’ve tested. The GuliKit KingKong 3 Pro and Max, meanwhile, offer more exhaustive customization, while the Hori Split Pad Compact is a Joy-Con upgrade for those who prefer to play in handheld mode. Then there’s 8BitDo’s Ultimate 2 Bluetooth Controller and DualShock-esque Pro 3 controller, both of which are worth checking out.\nFeatured in this article\nBest for TV mode: Nintendo Switch Pro Controller\nThe Switch Pro Controller remains tough to beat, even to this day. It offers an unmatched set of features — including motion controls, NFC, and HD rumble — and is one of the most comfy gamepads available.\n\nWhere to Buy:\n\n $69.99 at GameStop\n $69.99 at Best Buy\n $69.99 at Target\n\nBest for handheld mode: Hori Split Pad Compact\nMuch like the Split Pad Pro, the Compact version is bigger than the standard Joy-Con, making the Switch more comfortable to hold. The Compact, however, is smaller and more colorful.\n\nWhere to Buy:\n\n $49.99 at Target\n $49.99 $45.99 at Amazon\n $49.99 at Hori\n\n\n\n\n\n\nThe best Nintendo Switch controller for TV mode\nThe best Switch controller for handheld mode\nThe best Xbox-style controller for the Switch\nThe best Switch controller that’s also great for PC and Steam Deck\nA well-rounded Switch controller that looks like a DualShock\nAn adapter that lets you use your own controllers\nOther Switch controllers we tested\nWhat’s coming next?\n\nThe best Nintendo Switch controller for TV mode\nNintendo Switch Pro Controller\n\n\n\nProsCons\n\n\nHigh quality, sturdy build\nSupports HD rumble, gyro motion, and NFC\nLong battery life\nMobile and PC compatibility\n\nOn the pricier side\n\n\n\nWhere to Buy:\n\n $69.99 at GameStop\n $69.99 at Best Buy\n $69.99 at Target\n\nSupported platforms: Nintendo Switch 2, Nintendo Switch, PC, Steam Deck, mobile, Apple TV / Connectivity: Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Rumble: Yes, HD / NFC: Yes / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes (but not the Switch 2)\nEver since the Switch launched, Nintendo’s first-party Pro controller has been the best gamepad for the console. In many ways, it rivals the standard models from Sony and Microsoft in terms of comfort and build quality. And, it’s compatible with the Switch 2 (although it can’t wake the new console from sleep — you’ll need a Switch 2 Pro Controller for that).\nAside from the Joy-Cons, the Switch Pro Controller is the only wireless option that includes HD rumble, gyroscopic movement support, and an NFC reader for Amiibo cards and figurines. It’s one of a few controllers we’ve tested (aside from the Joy-Con and 8BitDo’s Ultimate series) that can power on the Switch without being plugged into it. The gamepad is built like a tank, and its battery life is so good that it sometimes seems like it’ll never run out. Nintendo says that it lasts around 40 hours per charge, so it’ll likely take casual gamers a long time to run down the battery.\nThe buttons and triggers have a satisfying bounce, while its directional pad is responsive and clicky enough to satisfy retro gamers. The controller charges via USB-C, just like the Switch, and it’s compatible with a slew of other platforms you might game on, aside from Xbox and PlayStation.\nGiven the high price, we wish that it had other features, like programmable buttons or a 3.5mm headphone jack for audio, even if wireless audio transmission from the Switch to a controller isn’t possible. If you really want the ability to listen via wired headphones without connecting your controller with a wire, you’ll need to get the Switch 2 and its Switch 2 Pro controller.\nThe best Switch controller for handheld mode\nHori Split Pad Compact (Pokémon Gengar)\nHori’s Joy-Con alternatives offer a roomier, comfier grip for your Nintendo Switch in handheld mode without the added bulk of its Split Pad Pro version. They also feature two customizable rear buttons and are offered in multiple colors and designs but do not support rumble or Amiibo figures.\n\nWhere to Buy:\n\n $59.99 at Amazon\n $59.99 at Walmart\n $49.99 at Hori (plain blue)\n\nSupported Platforms: Switch, Switch OLED / Connectivity: Wired / Connector type: Joy-Con slots / Mappable rear buttons: Yes / Software customization: No / Rumble: No / NFC: No / Motion: No / Power: via Joy-Con slots / Console Wakeup: No\nI’m sure there are some people who enjoy using Joy-Con controllers, but kids and small-handed folks aside, most people probably wouldn’t say they’re very comfortable. If you struggle with hand pain when you use the Switch, that’s where the Hori Split Pad Compact can help out.\nThe Split Pad Compact is a — you guessed it — a more compact alternative to the Split Pad Pro, which has unfortunately become tougher to find. Similarly, it comes in a variety of colorways, and it adds comfort to using the Switch in handheld mode. One half slides into each side of the Switch console like Joy-Cons, but unlike Nintendo’s default controllers, Hori’s gamepad features big, easy-to-reach buttons and generously sized triggers and analog sticks, all of which feel great in play. It also provides more grip than Joy-Con do, which is particularly useful for people who need to get a better handle on the console for fast-paced gameplay, or to stay comfy over longer play sessions.\nThe Split Pad Compact doesn’t have batteries or sensors — or support for rumble, motion, IR, or NFC — so it’s completely useless when detached from the Switch. It’s only for handheld mode unless you purchase the Split Pad Compact Attachment that turns it into a wired controller. We don’t recommend most people go that route since the attachment usually (but not always) costs more than a Switch Pro Controller, which is a shame considering it doesn’t add any of the aforementioned features. It does add a 3.5mm headphone jack, however.\nRead our Hori Split Pad Compact impressions.\nThe best Xbox-style controller for the Switch\nGuliKit KingKong 3\n\n\n\nProsCons\n\n\nGreat ergonomics with Xbox-style shape\nDeep customization options\nHall effect sticks and triggers\nSupports HD rumble, NFC, and motion\nWide platform compatibility\n\nLacks companion app for customizations\n\n\n\nWhere to Buy:\n\n $59.99 $44.99 at Amazon (Pro, save 10% at checkout)\n $79.99 $62.99 at Amazon (Max, save 10% at checkout)\n\nSupported Platforms: Switch, PC, Steam Deck, mobile, Apple TV / Connectivity: Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Yes / Software customization: No / Rumble: Yes / NFC: Yes (only in KK3 Max) / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes\nOn the surface, the GuliKit KingKong 3 Pro and KingKong 3 Max are similar to the last-gen models they replaced, which took design cues from Microsoft’s standard Xbox controller but rivaled the Switch Pro Controller in terms of build quality and features. We tested them on the Nintendo Switch, PC, and mobile, but you can also use them with other Bluetooth devices, including the Steam Deck and Apple TV 4K.\nBut there are several notable improvements and additions if you scratch deeper. They each have Hall effect dual-mode triggers (both can switch between analog and digital, but the KK3 Max exclusively adds physical trigger stops), in addition to RGB LED-surrounded Hall effect analog sticks. It should make them virtually impervious to drifting and waning responsiveness, as iFixit explains here. They each have GuliKit’s powerful magnetic vibration motors with two intensity levels and three distinct modes (including the Switch’s HD rumble). You can even customize the hot-swappable face buttons to match your preferred platform, and to the delight of tournament players, you can play with a 1,000Hz polling rate for reduced input lag on PC (wired or wireless via a dongle).\nAdditionally, both controllers feature detachable rear-facing paddles. You get two metal moon-shaped paddles with the KK3 Pro that protrude further from the controller than the extra four you get with the KK3 Max, which are longer and curved to match the contour of the controllers’ rear grips. The latter are similar to the paddles on the Xbox Elite Series 2 and even borrow the same installation technique — just push them into the designated holes on the back. They require a lot more force, though they won’t easily dislodge. \nThe longer paddles are comfortably reachable once installed, but if you have larger hands, you may need to make adjustments for the shorter variety. They only need a light tap, but since they occupy the space where your fingers usually rest, it can lead to increased misfires while gaming. You can map each back button to emulate any other button on the controller — including the rear triggers — but you can’t configure them to execute combo presses or macros.\nIn summary, the KK3 Pro and KK3 Max offer a lot for the money. In fact, there may be no better option for interoperability and value in a single multiplatform controller right now. If we’re nitpicking, our biggest gripe is that GuliKit still hasn’t created an app to manage all of its settings more easily.\nThe best Switch controller that’s also great for PC and Steam Deck\n8Bitdo Ultimate 2 Bluetooth Controller\nFor something cheaper — and in some ways better — than Nintendo’s official Pro controller, there’s 8BitDo’s Ultimate 2, which works with the original Switch and Switch 2. It features TMR joysticks with trigger switches for adjusting the feel, as well as vibration and motion control support.\n\n\n\nProsCons\n\n\nErgonomically similar to the Switch Pro controller\nUses durable TMR sticks\nWirelessly compatible with mobile and PC\nShake to wake Switch\n\nLacks NFC\nRumble feels lousy\n\n\n\nWhere to Buy:\n\n $69.99 $62.99 at Amazon (black, with coupon)\n $69.99 $62.99 at Amazon (white, at checkout)\n\nSupported Platforms: Switch, Switch 2, PC, Steam Deck, mobile, Apple TV, Android, macOS, Apple devices / Connectivity: 2.4GHz, Bluetooth, wired / Connector type: USB-C / Mappable buttons: Yes, four / Software customization: Yes / Rumble: Yes / NFC: No / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes, but not Switch 2\n8BitDo’s Ultimate 2 Bluetooth Controller is a minor step forward compared to the first iteration, but it comes with new features you might care about. It still feels like a Switch Pro Controller in shape, with a similarly short grip profile that larger hands may not prefer. As for what’s changed internally, you’re getting more durable TMR joysticks, plus two new mappable buttons near the triggers (totaling four customizable buttons). Speaking of the triggers, they’re adjustable thanks to new switches that can alter how much you have to pull them to register an input. It’s particularly great for first-person shooters or action games where speed is paramount. \nIts haptics are decent in some games, but not nearly as good as Nintendo’s HD Rumble, and it’s missing Amiibo support, though it does feature motion controls — along with a hidden trick that allows you to wake a docked Switch by giving the controller a little shake. It’s a nice value compared to the Switch Pro, as well as most other third-party options because it also includes a charging dock with an integrated 2.4GHz transmitter.\nThe Ultimate 2 controller comes in two variants, but we recommend the Bluetooth model for Switch owners because it’s the only version that’s compatible. Additionally, it’s compatible with the Switch 2, the Steam Deck, PC, macOS computers, and a slew of other Bluetooth-ready devices. Plus, it includes both 2.4GHz connectivity, in case you need a more reliable connection for compatible devices. \nAs for any control scheme tweaks you may want to make, you can customize button mapping profiles, macros, vibration intensity, and stick and trigger sensitivity using the Ultimate Software V2 app on PC. The controller has a dedicated button that lets you swap between three profiles on the fly, plus an extra turbo button you can either reconfigure or remap. When it comes to Switch controllers, 8BitDo sets the standard for great third-party controllers, and this is one of its best.\nA well-rounded Switch controller that looks like a DualShock\n8BitDo Pro 3 controller\n\n\nScore: 7\n\nProsCons\n\n\nIncludes charging dock and 2.4GHz dongle\nHighly customizable\nParticularly comfortable for small-handed gamers\n\nRumble isn’t great\n\n\n\nWhere to Buy:\n\n $69.99 at Amazon\n\nSupported Platforms: Switch, Switch 2, PC, Steam Deck, mobile, Apple TV, and more / Connectivity: Bluetooth, 2.4GHz, wired / Connector type: USB-C / Mappable buttons: Yes, four / Software customization: Yes / Rumble: Yes / NFC: No / Motion: Yes / Power: Built-in rechargeable / Console Wakeup: Yes, but not Switch 2\nThe 8BitDo Pro 3 is the company’s latest high-end controller. On its face, the biggest difference between it and the similarly-priced Ultimate 2 is its PlayStation DualShock-esque stick layout, which alone might enough to convince some gamers to get it. The Pro 3 improves on its predecessor by featuring swappable buttons that can be detached with its included magnetic suction tool. With it, you can go from the Nintendo layout to the Xbox layout. Otherwise, this model’s internal specs and compatibility are very similar to that of the Ultimate 2. \nThe Pro 3 features TMR joysticks, plus Hall effect triggers with switches that toggle between full pulls or shorter clicks for either trigger. Just like the Ultimate 2, the Pro 3 has four customizable buttons that can be assigned almost any other button, or combination of buttons, through the company’s Ultimate V2 app on PC or by pressing certain buttons together, as listed in the manual. Additionally, the controller supports turbo mode.\nCompared to most other Switch controllers, the Pro 3 stands out due to its PlayStation-style layout of D-pad and sticks. You may prefer this model if you play a lot of retro games that prioritize the D-pad, which is more easily accessible than on most other Switch controllers. One other fun perk of the Pro 3 is its swappable joystick caps. Two arcade stick-like knobs are included that make certain games feel more rewarding to play, such as fighting games.\nIt has rumble support (though not HD rumble) and motion control for games like The Legend of Zelda: Tears of the Kingdom and Overwatch 2, both of which allow for gyroscopic aiming. \nOn its rear, there’s a switch that lets it toggle between Nintendo Switch, X-input for PC, and DirectInput, each of which offers its own control customizations and Bluetooth profile. One new addition for the Pro 3 is a charging dock that lets the controller recharge via contact pins. The dock also contains a 2.4GHz USB-C transmitter, letting you connect to some devices that route instead of Bluetooth. \nRead our 8BitDo Pro 3 review.\nAn adapter that lets you use your own controllers\n8BitDo Wireless Bluetooth USB Adapter 2\n\n\n\nProsCons\n\n\nInexpensive\nAllows you to use nearly any Bluetooth controller\n\nRequires sourcing your own controller\n\n\n\n\nWhere to Buy:\n\n $19.99 $17.47 at Amazon\n $19.99 at 8BitDo\n $19.99 $17.49 at Best Buy\n\nThere are a few other devices that allow you to use third-party controllers, but 8BitDo’s is the best value. Instead of spending $70 on a Switch Pro controller, the $19.99 8BitDo Wireless Bluetooth USB Adapter 2 lets you turn most Bluetooth controllers you already own into a wireless Switch controller. It plugs into your Switch dock (or directly into the console if you have a USB-A to USB-C adapter) and supports a wide variety of models, from the latest Xbox and DualSense controllers to last-gen gamepads for the Wii and PlayStation 3. (Note: the first-gen model can’t connect to most Xbox Bluetooth controllers due to a Bluetooth incompatibility, so make sure you get the latest model we’ve linked to.)\nTo our delight, the PS5 DualSense controller we tested it with worked incredibly well, with better-than-average rumble and more responsive motion controls than many dedicated Switch controllers offer. What’s more, so long as you’re using one of the newer Xbox Series X or S controllers, an Xbox One Bluetooth controller, a DualSense, a DualShock 4, or the Switch Pro Controller, you can customize their button mapping, analog stick sensitivity, and more within 8BitDo’s computer and mobile app. \n8BitDo has an extensive support page that lists the steps required to set up your specific controller, as well as which features of those controllers it supports. That said, it’s best if you know the Switch’s button layout by heart if you plan to use either a PlayStation or Xbox controller with this adapter, as the layout on your controller will not match the on-screen prompts in games.\nIf you already have a controller you really like and don’t mind jumping through a few small hoops to connect it, 8BitDo’s affordable adapter deserves a spot in your entertainment center. If you plan to use more than one third-party controller at a time, you’ll need an adapter for each controller (and a USB hub), but if you have a lot of controllers sitting around, it might be worth it.\nOther Switch controllers we tested\nNitro Deck / Nitro Deck Plus\nWe like CRKD’s Nitro Deck around here. It’s a cradle-style controller that holds the Switch between a pair of Hall effect sticks, outfitting it with a standard array of face buttons, four programmable back buttons, turbo functionality, gyro motion controls, and rumble. It has passthrough charging, though not passthrough video, which would allow it to double as a dock for TV gameplay. The step-up Nitro Deck Plus adds said functionality (with a USB-C to HDMI adapter), along with Bluetooth connectivity and adjustable vibration intensity / analog sensitivity. We’ve found these to be notable improvements, but we wish the passthrough solution was more elegant and that CRKD could solve the ergonomics (particularly on the right side, where the analog and button placement can cause discomfort).\nGameSir T4 Cyclone Pro\nWe recently tested the GameSir T4 Cyclone Pro ($49.99) for consideration. It offers a few of the same functions as the GuliKit KingKong 3 — including remappable buttons, Hall effect sticks, and two distinct macro buttons — along with dedicated vibration motors in the triggers, which is something the GuliKit doesn’t match. That said, it falls just short due to mushy-feeling buttons. GameSir considers the extra padding under the buttons a feature that makes the impact softer, but we felt it takes away from the experience. Also, although it’s perfectly usable with the Switch, the Pro’s button labeling takes after Microsoft’s, which may not be ideal for those who have trouble memorizing inputs. We also found resyncing with the Switch to be a chore after switching from a mobile device or a Windows PC.\nPowerA GameCube Style Wireless Controller\nWe also recently tried several wireless PowerA controllers, including the GameCube Style Wireless Controller ($59.99) and a Pikachu-themed version of the standard PowerA Enhanced Wireless ($44.99). We like the fun design of PowerA’s controllers, but they don’t live up to the quality of the models we recommend above, which is a shame considering some cost nearly as much. The GameCube-style wireless controller is a pretty faithful recreation of the original if you fancy a pure Super Smash Bros. experience, but it’s barebones with no rumble, NFC, or IR. It’s an easy way to get the old-school feeling back if you don’t already have a Bluetooth-based alternative to use with 8BitDo’s USB Adapter 2.\nWhat’s coming next?\nWe’ll be doing more testing on the EasySMX S10 controller, as well as the GameSir Super Nove and GuliKit’s Elves 2 and ES Pro controllers for consideration.\nUpdate, August 15th: Updated to reflect current pricing / availability. We’ve added the 8BitDo Ultimate 2 and Pro 3 controllers as new recommended options. The next update will include impressions on new EasySMX, GameSir, and GuliKit controllers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "de57e48e82067d83f002b0deebf13cef534a96bf",
      "title": "Far-right Israeli minister taunts jailed Palestinian leader in prison visit",
      "url": "https://www.theguardian.com/world/2025/aug/15/far-right-israel-minister-itamar-ben-gvir-taunts-jailed-palestinian-leader-marwan-barghouti-in-prison-visit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:48:15.000Z",
      "summary_90w": "",
      "raw": "Itamar Ben-Gvir posts video footage showing him making threatening remarks to a gaunt Marwan Barghouti\nIsrael’s national security minister, Itamar Ben-Gvir, has posted video footage in which he is seen taunting the imprisoned Palestinian leader Marwan Barghouti in jail, prompting strong condemnation from Barghouti’s family and Palestinian leaders.\nThe 13-second clip shows Ben-Gvir, a far-right politician on whom the UK and several other countries imposed sanctions this year for incitement to violence against Palestinians, making threatening remarks to Barghouti while Israel’s prisons minister, Kobi Yaakobi, an ally of Ben-Gvir stands nearby.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be21839a8e7356ba04c634fe074badf98124abf3",
      "title": "Louisiana attorney general sues Roblox",
      "url": "https://techcrunch.com/2025/08/15/louisiana-attorney-general-sues-roblox/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T14:43:20.000Z",
      "summary_90w": "",
      "raw": "The lawsuit points to several sexually explicit experiences that were on the platform, including “Escape to Epstein Island,” “Diddy Party,” and “Public Bathroom Simulator Vibe.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35b3821cde090376b64d93bd8fbeed5e2bd4605d",
      "title": "African Union joins calls to end use of Mercator map that shrinks continent’s size",
      "url": "https://www.theguardian.com/world/2025/aug/15/african-union-true-size-world-map-replace-mercator-version",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Member states back Correct the Map campaign that urges governments and organisations to use more accurate map\nThe African Union has backed a campaign to end the use by governments and international organisations of the 16th-century Mercator map of the world in favour of one that more accurately displays Africa’s size.\nCreated by the cartographer Gerardus Mercator for navigation, the projection distorts continent sizes, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. “It might seem to be just a map, but in reality, it is not,” the African Union Commission deputy chair, Selma Malika Haddadi, told Reuters, saying the Mercator fostered a false impression that Africa was “marginal”, despite being the world’s second-largest continent by area, with more than 1 billion people. The union has 55 member states.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f73f9282222e9b09b1010a5c6e585fd4f03a04",
      "title": "Meet the first batch of VCs set to judge Startup Battlefield 200 at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/15/meet-the-first-batch-of-vcs-set-to-judge-startup-battlefield-200-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-15T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Startup Battlefield 200 is the crown jewel of TechCrunch Disrupt. From thousands of applicants, only the top 20 will take the Stage at Disrupt 2025 (October 27-29, San Francisco) to pitch their vision to panels of top-tier VCs in front of a live audience. Every contender is chasing game-changing impact — and we’re here for the drama, the breakthroughs, and the big reveals.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "831eea65412ba0968487acb7c6e24402ebdeb285",
      "title": "Why did so many teens get into their first choice uni this year?",
      "url": "https://www.bbc.com/news/articles/c62n9ygdqeno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T13:55:37.000Z",
      "summary_90w": "",
      "raw": "A record number of 18-year-olds have been accepted by their \"firm\" university choice. Here's what's going on.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "714aee6c8c4d3884f7c5dd66678fdd051c1bc887",
      "title": "'About our lives, but without our voice': Sidelined Ukrainians look on",
      "url": "https://www.bbc.com/news/articles/cm21l237pkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T13:38:03.000Z",
      "summary_90w": "",
      "raw": "Left uninvited to key talks, many Ukrainians look on with a mix of fatigue and mistrust.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "714aee6c8c4d3884f7c5dd66678fdd051c1bc887",
      "title": "Sidelined Ukrainians look on with deep scepticism as Trump and Putin meet",
      "url": "https://www.bbc.com/news/articles/cm21l237pkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T13:38:03.000Z",
      "summary_90w": "",
      "raw": "Left uninvited to key talks, many Ukrainians look on with a mix of fatigue and mistrust.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "860f6c0bc8aeb29a5d6829da84c36ccc4a3769ee",
      "title": "Sam Altman says ‘yes,’ AI is in a bubble",
      "url": "https://www.theverge.com/ai-artificial-intelligence/759965/sam-altman-openai-ai-bubble-interview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T13:35:22.000Z",
      "summary_90w": "",
      "raw": "As economists speculate whether the stock market is in an AI bubble that could soon burst, OpenAI CEO Sam Altman has just admitted to believing we're in one. \"Are we in a phase where investors as a whole are overexcited about AI?\" Altman said during a lengthy interview with The Verge and other reporters last night. \"My opinion is yes.\"\nIn the far-ranging interview, Altman compared the market's reaction to AI to the dot-com bubble in the '90s, when the value of internet startups soared before crashing down in 2000. \"When bubbles happen, smart people get overexcited about a kernel of truth,\" Altman said. \"If you look at most of the bubbles in …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41a35b9196d3629dbd6572cb7d7e8e91e0847fcb",
      "title": "Emmanuel Macron decries ‘antisemitic hatred’ after memorial tree cut down",
      "url": "https://www.theguardian.com/world/2025/aug/15/emmanuel-macron-decries-antisemitic-hatred-after-memorial-tree-cut-down",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T13:09:16.000Z",
      "summary_90w": "",
      "raw": "French president vows to punish those who felled tree planted in memory of Jewish man tortured to death in 2006\nThe felling of an olive tree planted in memory of a young French Jewish man tortured to death in 2006 caused outrage in France on Friday, with Emmanuel Macron promising to punish an act of “antisemitic hatred”.\nPoliticians across the political spectrum condemned the felling as an attack against the memory of Ilan Halimi, who was kidnapped by a gang of about 20 young people in January 2006 and tortured on a low-income housing estate in the southern Paris suburb of Bagneux.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "701f46d64971a70578172981bd5cf437afae1248",
      "title": "For Legends: Z-A’s battle system, I rewired the Pokémon part of my brain",
      "url": "https://www.theverge.com/games/759788/pokemon-legends-z-a-battle-real-time-preview",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Even if you've never played a Pokémon game before, you can probably figure out how the type chart works. Fire types are weak to water types, water is weak to grass, and grass is weak to fire. Type matchups are foundational to Pokémon battles, far before you get into the weeds of stats and strats. I've had the Pokémon type chart memorized for around 25 years. \nThat still didn't stop me from making a rookie error in Pokémon Legends: Z-A. I panicked and sent out my Weedle against an NPC's Pidgeotto, which it is very much weak to. It got one-shot, obviously. \nIt's not that I forgot how type matchups worked. But the battle system in Legends: Z- …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c55f73e6edb652015bb19ccd90a1918fc52f8830",
      "title": "Vibe coding through the GPT-5 mess",
      "url": "https://www.theverge.com/the-vergecast/759768/gpt5-backlash-vibe-coding-attempts-corporate-stunts",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Last week, we ran into an issue: no one on the show had ever vibe coded. So for today's episode, we set out to fix that. Everyone came prepared with a vibe coded project - and some misadventures to go along with it.\nThis week on The Vergecast, we're discussing the fallout of the messy GPT-5 launch and why the new model isn't living up to the hype. We're also exploring one of GPT-5's big promises: vibe coding. OpenAI has put a lot of emphasis on the model's improved coding abilities and even suggested that the average user can prompt their way to a helpful interactive experience. We put that to the test and quickly learned the tool isn't qui …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4c834a6700d2a28e7f7ba068eb4b5211ec461298",
      "title": "Lucid reveals off-road version of Gravity SUV, which it has definitely sold more than 9 of",
      "url": "https://www.theverge.com/electric-cars/759910/lucid-reveals-off-road-version-of-gravity-suv-which-it-has-definitely-sold-more-than-9-of",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T12:59:36.000Z",
      "summary_90w": "",
      "raw": "On Friday, Lucid Motors introduced an off-road version of its Gravity SUV, a few hours after shooting down a report that it had only sold 9 of the luxury EV in the first six months. \nThe off-road concept includes redesigned front and rear fascias, improved approach and departure angles, a widened track, lifted ride height, and custom wheels with all-terrain tires. \nBut it was the automaker’s forceful renunciation of Automotive News’ report that it had sold less than 10 Gravity SUVs in the first six months of production that drew the most attention. The outlet cited S&P Global Mobility registration data to back up its claim.\nNick Twork, Lucid’ VP for communication, called the report “completely inaccurate,” adding that even though Lucid doesn’t provide an exact breakdown of Gravity sales, “the real number is well into the 3-digit range.”\nThe company’s top executives acknowledged during a recent earnings call that supply chain constraints, including an industry-wide magnet shortage, were improving and that deliveries were expected to pick up. Twork said that the Gravity was expected to make up the bulk of the company’s sales in the second half of the year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7af0740471d9d8c3b7b953648750abc89d919032",
      "title": "GPT-5 failed the hype test",
      "url": "https://www.theverge.com/openai/759755/gpt-5-failed-the-hype-test-sam-altman-openai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-15T12:47:40.000Z",
      "summary_90w": "",
      "raw": "Last week, on GPT-5 launch day, AI hype was at an all-time high. \nIn a press briefing beforehand, OpenAI CEO Sam Altman said GPT-5 is \"something that I just don't wanna ever have to go back from,\" a milestone akin to the first iPhone with a Retina display. The night before the announcement livestream, Altman posted an image of the Death Star, building even more hype. On X, one user wrote that the anticipation \"feels like christmas eve.\" All eyes were on the ChatGPT-maker as people across industries waited to see if the publicity would deliver or disappoint. And by most accounts, the big reveal would fall short. \nThe hype for OpenAI's long- …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bd8c53cabfe9ae1d5cfba3fe397e824816a71ec5",
      "title": "Putin ready to make Ukraine deal, Trump says before Alaska summit",
      "url": "https://www.theguardian.com/world/2025/aug/14/keir-starmer-to-meet-volodymyr-zelenskyy-in-downing-street",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T12:34:29.000Z",
      "summary_90w": "",
      "raw": "US president’s comment that Russian and Ukrainian leaders may have to ‘divvy’ things up likely to raise alarm\nDonald Trump has said he believes Vladimir Putin is ready to make a deal on the war in Ukraine as the two leaders prepare for their summit in Alaska on Friday, but his suggestion that the Russian leader and Volodymyr Zelenskyy could “divvy things up” may alarm some in Kyiv.\nThe US president, who left the White House on Friday at 7.30am, implied there was a 75% chance of the Alaska meeting succeeding, and that the threat of economic sanctions may have made Putin more willing to seek an end to the war. “HIGH STAKES!!!” he posted on Truth Social as his motorcade idled outside the White House shortly after sunrise in Washington.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1a029866fea3f1dcc27da99ff9c74914aaa9e19",
      "title": "Far-right Israeli minister taunts prominent Palestinian prisoner",
      "url": "https://www.bbc.com/news/articles/cqxg3xg8xyyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T12:16:50.000Z",
      "summary_90w": "",
      "raw": "Video shows Itamar Ben Gvir telling the most prominent Palestinian prisoner Marwan Barghouti \"you will not win\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1a029866fea3f1dcc27da99ff9c74914aaa9e19",
      "title": "Far-right Israeli minister taunts prominent Palestinian prisoner in his cell",
      "url": "https://www.bbc.com/news/articles/cqxg3xg8xyyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T12:16:50.000Z",
      "summary_90w": "",
      "raw": "Video shows Itamar Ben Gvir telling the most prominent Palestinian prisoner Marwan Barghouti \"you will not win\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "759e10855f992444cf657763f4adb57a019bd988",
      "title": "Global plastic talks collapse as countries remain deeply divided",
      "url": "https://www.bbc.com/news/articles/cvgpddpldleo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:57:06.000Z",
      "summary_90w": "",
      "raw": "The latest round of UN-led talks have ended in deadlock, with disputes over plastic production and recycling.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53b261e7bae13147ad2dcd8d29def65fe4705e3d",
      "title": "Spain at 'extreme risk' of new wildfires as 14 blazes spread",
      "url": "https://www.bbc.com/news/articles/crevxg4yl37o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:53:05.000Z",
      "summary_90w": "",
      "raw": "Temperatures remain high across southern Europe with wildfires also affecting Portugal, Greece, France and the Balkans.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "067f729d17c92efd5888c92593ff9c718a59cd0b",
      "title": "Mali’s junta arrests generals and French national over alleged coup plot",
      "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:41:46.000Z",
      "summary_90w": "",
      "raw": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May\nMali’s military rulers say they have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country.\nThe security minister, Gen Daouda Aly Mohammedine, who announced the arrests on the local evening news on Thursday, told viewers an investigation was under way and that the situation was “completely under control”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8af381f97959af15a2684e72fd463cda886a5314",
      "title": "'It's coming home' - the undignified row over the body of Zambia's ex-president",
      "url": "https://www.bbc.com/news/articles/clyv68324zgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T11:39:28.000Z",
      "summary_90w": "",
      "raw": "Edgar Lungu, who died in June, is yet to be buried - the debate over what next exposes deep divisions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cca514fd7d1872c62bf128dda8030875c50dee3a",
      "title": "USSR sweatshirt and chicken kyiv: Russia dials up trolling before Alaska summit",
      "url": "https://www.theguardian.com/world/2025/aug/15/ussr-sweatshirt-and-chicken-kyiv-russia-dials-up-trolling-before-alaska-summit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T11:23:56.000Z",
      "summary_90w": "",
      "raw": "Foreign minister’s attire and inflight menu for Russian media are latest in series of provocations towards Ukraine\nIn a not-so-subtle act of trolling, Russia’s foreign minister, Sergei Lavrov, arrived in Alaska on the eve of the US–Russia summit wearing a sweatshirt emblazoned with “CCCP”, the Russian initials for the USSR.\nOnce seen in western capitals as a pragmatic and skilled diplomat, the 75-year-old has in recent years mirrored the Kremlin’s radicalised politics, adopting an increasingly combative tone and resorting to trolling and mockery.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f4d9677b7262fff1dbd608166869e2a07ffdff3",
      "title": "EasyJet planes clip wings at Manchester Airport",
      "url": "https://www.bbc.com/news/articles/c8ry06yr4evo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T11:21:43.000Z",
      "summary_90w": "",
      "raw": "The aircraft, bound for Paris and Gibraltar, clip wings while taxiing at the airport.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "70f5435aab01c943f26d5a0ebd8e17d235b8741f",
      "title": "What to know ahead of Trump-Putin summit. And, Texas Democrats could end boycott",
      "url": "https://www.npr.org/2025/08/15/g-s1-82812/up-first-newsletter-putin-trump-summit-texas-democrats-crime-crackdown-left-leaning-communities",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T11:07:26.000Z",
      "summary_90w": "",
      "raw": "Trump and Putin meet in Alaska today. Here's what you need to know before the summit. And, Texas Democrats could end their boycott if California also begins redistricting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "302682608e7a805bd9dea3957232885ac16c2192",
      "title": "Guardian Australia wins Kennedy awards for outstanding digital innovation, photography and columnist",
      "url": "https://www.theguardian.com/media/2025/aug/15/guardian-australia-wins-kennedy-awards-for-outstanding-digital-innovation-photography-and-columnist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T10:28:58.000Z",
      "summary_90w": "",
      "raw": "Leaving Gaza interactive, a portrait by Carly Earl, and columnist Ranjana Srivastava claim media accolades\n\nGet our breaking news email, free app or daily news podcast\n\nGuardian Australia has won three Kennedy awards for outstanding digital innovation, outstanding portrait photography and outstanding columnist at an industry event in Sydney.\nThe Leaving Gaza interactive, which showcased text messages exchanged between Palestinian friends – one in Gaza, one in the US – in the opening days of the Israel-Gaza war, won the innovation category.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3a291ece92ac651260ac1e5f727c31c4bdb9e8b",
      "title": "Sturgeon book reignites trans row with JK Rowling",
      "url": "https://www.bbc.com/news/articles/cd6n78z1d34o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T10:13:26.000Z",
      "summary_90w": "",
      "raw": "In her memoir, Sturgeon complains about the Harry Potter author posting a selfie in a T-shirt branding her a \"destroyer of women's rights\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89e6b7dc66b19ad27e6c9791b597260be84fce9a",
      "title": "Online fashion retailer Shein’s UK sales leap by a third to more than £2bn",
      "url": "https://www.theguardian.com/business/2025/aug/15/online-fashion-retailer-shein-uk-sales-leap-by-a-third-to-more-than-2bn",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T10:09:20.000Z",
      "summary_90w": "",
      "raw": "Profits rise 56% to £38.2m in 2024 as company overtakes British rival Boohoo and closes in on Asos\nShein, the online fast-fashion retailer founded in China, increased sales in the UK by about a third to more than £2bn last year, overtaking the British rival Boohoo and closing in on Asos.\nThe company, which had been considering a £50bn float on the London Stock Exchange but is expected to list in Hong Kong, said profits rose 56% to £38.2m last year on which it paid £9.6m corporation tax, according to accounts filed at Companies House this week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1d433daa9d7e7dc43ff5cf3e6f3cdfcd3b097486",
      "title": "Weather tracker: Typhoon Podul pounds southern Taiwan",
      "url": "https://www.theguardian.com/environment/2025/aug/15/weather-tracker-typhoon-podul-taiwan",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T09:47:14.000Z",
      "summary_90w": "",
      "raw": "One person dies after storm whips up waves, while temperatures approach 50C as heatwave grips Middle East\nTyphoon Podul crossed southern Taiwan on Wednesday with wind speeds of up to 110mph (177km/h), equivalent to a category 2 hurricane.\nPodul had developed a week earlier, near the Northern Mariana Islands, and tracked west across the Philippine Sea, achieving typhoon status on Tuesday before making landfall in south-east Taiwan the following day.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9b0eaa1f767a70f05cd15af35ad2324a0e0f94ba",
      "title": "Chinook helicopter was on 'show flight' when it crashed killing 29, ex-RAF pilot says",
      "url": "https://www.bbc.com/news/articles/c04rg3l3y64o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T09:42:45.000Z",
      "summary_90w": "",
      "raw": "Four crew and 25 passengers were killed when an RAF Chinook struck a hillside in foggy conditions over the Mull of Kintyre in 1994.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a17004a552c1c39b783ceefe58ae1ac0de55b57",
      "title": "Full Strictly line-up revealed as final contestants announced",
      "url": "https://www.bbc.com/news/articles/cly3318nrmpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T09:26:31.000Z",
      "summary_90w": "",
      "raw": "Hodor actor Kristian Nairn will be joined by football star Karen Carney and ITV presenter Ross King.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6864b9815648b822cfb2dbef7c95e93e7fee725d",
      "title": "As Republicans face voters during tense town halls, it's about sticking to the script",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5482963/republican-congress-town-hall-obbb-medicaid-tax-cuts-immigration-trump",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "While just a fraction of Republicans in Congress are holding town halls during the August recess — in-person and virtual — the questions from voters, and answers from lawmakers, strike a similar tune.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ace638f6d6859af8bed04540ff3e15de9eb0d5a",
      "title": "In Houston, some worry their problems would be neglected after redistricting",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502654/texas-redistricting-trump-midterm-elections",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In one neighborhood of the city, Latinos worry about immigration and urban problems but may soon be grouped in with suburban voters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eba9ebf356ff83929f0f4f4e101529c57db9e702",
      "title": "Trump and Putin meet today in Anchorage. Here's what to know",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502460/trump-putin-alaska-summit-ukraine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "President Trump told reporters on Friday that he's willing to talk about business with Russian President Vladimir Putin, but said there would be no deals \"until we get the war solved\" in Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5365702b06a0d3249addfa344a2ad7b4eddb852b",
      "title": "Man arrested over Sydney airport scuffle back in custody after alleged assault at Central train station",
      "url": "https://www.theguardian.com/australia-news/2025/aug/15/man-arrested-over-sydney-airport-scuffle-back-in-custody-after-alleged-assault-at-central-train-station",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T08:36:10.000Z",
      "summary_90w": "",
      "raw": "Nicholas Teplin, 41, allegedly struck three men on Thursday afternoon, a day after airport arrest during which a police gun accidentally fired\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nA Victorian man involved in an airport scuffle in which a police gun was accidentally fired is back in custody for allegedly assaulting several people the next day.\nNicholas Teplin, 41, faced a court on Friday on allegations he hit three men in the head at Sydney’s Central railway station and then shoved a police officer while in custody.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e3c7af582402c98fdfac1e7cbe1bf395b9bfd9f",
      "title": "My family may be killed if deported, says son of Afghan caught in UK data breach",
      "url": "https://www.bbc.com/news/articles/c776zgj73lpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T08:22:31.000Z",
      "summary_90w": "",
      "raw": "Documents seen by the BBC suggest he was part of a special forces unit who worked with the British in Afghanistan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0feb872ad4354d4d30f7ab432b0adaeaad64e60c",
      "title": "Trump and Putin meet in Anchorage today",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5501283/trump-and-putin-meet-in-anchorage-today",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T08:15:46.000Z",
      "summary_90w": "",
      "raw": "President Trump and Russian President Vladimir Putin meet in Anchorage today to talk about Ukraine. Here's what to know.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e68c7dd3ae1075b18a9d052166b5c7d19acaee9",
      "title": "Celebrities are marketing products directly to their fans",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502704/celebrities-are-marketing-products-directly-to-their-fans",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T08:13:25.000Z",
      "summary_90w": "",
      "raw": "Stars are starting their own companies and marketing products directly to their fans. We talked to people following and making these deals, including John Legend who started his own skincare brand.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "abdcfb684e273aa46a284bd04969e8efd631d58c",
      "title": "Trump administration names DEA head to be D.C.'s emergency police commissioner",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502824/trump-administration-names-head-of-the-dea-to-be-washington-d-c-s-police-chief",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T08:09:23.000Z",
      "summary_90w": "",
      "raw": "Attorney General Pam Bondi has named the head of the Drug Enforcement Administration to be Washington D.C.'s emergency police commissioner. The National Guard, FBI and other entities are now working to follow President Trump's directive to clean up the nation's capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "baafae4e50ad0801616a951a394459fe66429240",
      "title": "How a plumbing small business shaped a community in Denver",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5498762/how-a-plumbing-small-business-shaped-a-community-in-denver",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-15T08:08:55.000Z",
      "summary_90w": "",
      "raw": "In 1968, Nathaniel Estes started his own plumbing business in Denver's Five Points neighborhood. As his company grew, he became a pillar of the local Black community. His son, Eddie Estes, and daughter, Cathy Lane, remember their now 94-year-old father, and what it was like growing up as the plumber's kids.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a6c4565740cea489d8be97d249c1a14588628f1",
      "title": "In maps: The war-ravaged Ukrainian territories at the heart of the Trump-Putin summit",
      "url": "https://www.bbc.com/news/articles/cgkrn433lk2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T07:30:17.000Z",
      "summary_90w": "",
      "raw": "Kyiv has rejected ceding territory seized by Russia to secure a ceasefire.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab9355e1bbff91d36fa84ea2a1d0e70cbadaa733",
      "title": "The nepo baby premium, frothing markets, and Apple vs. Apples",
      "url": "https://www.npr.org/2025/08/15/nx-s1-5502731/the-nepo-baby-premium-frothing-markets-and-apple-vs-apples",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-15T07:00:00.000Z",
      "summary_90w": "",
      "raw": "It’s … Indicators of the Week! Our rapid run through the numbers you need to know.  \nOn today’s episode: John Legend croons; CPI inflation soothes; Same job as mom? You’ll earn more, dude; Apple vs. Apple, a courtroom feud. \nRelated episodes: \nWhy every A-lister also has a side hustle \nThe DOJ's case against Apple \nThe Intergenerational Transmission of Employers and the Earnings of Young Workers\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.  \nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8d95c4ff8f1b7e3dc2da1ab25cb66c30eb31a82e",
      "title": "Suspected French spy arrested in alleged Mali coup plot ",
      "url": "https://www.bbc.com/news/articles/cj9w7dg3pr4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-15T06:52:07.000Z",
      "summary_90w": "",
      "raw": "The French national is accused of working \"on behalf of the French intelligence service\" in Mali.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f964d68d588d6f8ccd5054a446462c6ea8b0108a",
      "title": "What do Alaskans make of the geopolitical circus arriving in their city? ",
      "url": "https://www.bbc.com/news/articles/c7541g6d191o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T05:58:24.000Z",
      "summary_90w": "",
      "raw": "The city of Anchorage is set to host a meeting that could re-shape Europe and global security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a0af9249dd912bb2d98b0966f7f723ab1d14b6f",
      "title": "Why Liverpool's spending spree has piled pressure and scrutiny on Slot",
      "url": "https://www.bbc.com/sport/football/articles/cjeydgeqweqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T05:24:08.000Z",
      "summary_90w": "",
      "raw": "Liverpool's spending spree has put head coach Arne Slot under increased pressure to repeat title success, says BBC Sport chief football writer Phil McNulty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80bf0549fc282bd51d701edd8bd8b21bef969f93",
      "title": "'It makes me feel horrible': Female PC goes undercover as runner to catch catcallers",
      "url": "https://www.bbc.com/news/articles/cz0y8r141pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T05:13:27.000Z",
      "summary_90w": "",
      "raw": "Surrey Police's campaign sees female police officers go out for runs, with uniformed officers nearby to intervene if they are harassed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8fb10fb888a15be2fb114905aee712fdf7a41e0b",
      "title": "Climate crisis harming world heritage painted houses in Burkina Faso, say residents",
      "url": "https://www.theguardian.com/environment/2025/aug/15/climate-crisis-harming-world-heritage-painted-houses-tiebele-in-burkina-faso-say-residents",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T05:00:23.000Z",
      "summary_90w": "",
      "raw": "Tiébélé’s wavy-walled houses covered in geometric lines showing signs of disintegration amid erratic weather\nA world heritage site that was once a famous tourist destination is suffering from signs of disintegration, as climate change affects weather patterns.\nThe wavy-walled houses covered with singular geometric lines of the Royal Court of Tiébélé in Burkina Faso, established in the 16th century, are recognisable all over the world. The paintings represent the thoughts, culture, and religion of the Kassena people, literally written on the walls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aca7cb49720316824d20f04121d6ed7ecdec0849",
      "title": "He found a bomb under a playground - and there were 176 more",
      "url": "https://www.bbc.com/news/articles/c36x08jezw5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T04:10:06.000Z",
      "summary_90w": "",
      "raw": "The playground now offering children an explosion of fun without the threat of an actual explosion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cb0350455a24158e1fee1b42d21f4e578e460d25",
      "title": "'Putin is a master of persuasion' - BBC correspondents discuss summit strategy",
      "url": "https://www.bbc.com/news/videos/c6205ezp6nlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-15T03:35:15.000Z",
      "summary_90w": "",
      "raw": "The BBC’s US and Russia correspondents outline the leaders' different approaches to the high stakes summit on the Ukraine war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba580e7d06fd2721fa7f8fe1271c85e20ec0c533",
      "title": "Hundreds hit with food poisoning in Indonesia after eating free meals from president’s flagship program",
      "url": "https://www.theguardian.com/world/2025/aug/15/hundreds-struck-by-poisoned-in-indonesia-after-eating-free-meals-from-presidents-flagship-program",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-15T01:48:11.000Z",
      "summary_90w": "",
      "raw": "Since its launch in January, Prabowo Subianto’s signature policy has been marred by mass food poisoning cases affecting over 1,000 people\nMore than 360 people fell ill in the Indonesian town of Sragen in Central Java after consuming school lunches, according to officials, in the largest food poisoning case to hit President Prabowo Subianto’s flagship free meals programme to date.\nSince its launch in January, the free school meals programme has been marred by mass food poisoning cases across the archipelago, affecting more than 1,000 people.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54abaeea3fae8face0da9743c19cb9906089950a",
      "title": "Bowen: Netanyahu is presiding over a divided Israel - the fault lines are now chasms",
      "url": "https://www.bbc.com/news/articles/c3r441zyw27o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T23:33:47.000Z",
      "summary_90w": "",
      "raw": "Jeremy Bowen travelled through Israel to hear views from all sides - from protesters in 'psychological despair' over Gaza, to those who feel an overwhelming sense that their country's actions are justified.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0dd3f49325b8f29acc7f0340cf4eacb3e8ceb8e",
      "title": "What do Putin and Trump each want from the Alaska summit?",
      "url": "https://www.bbc.com/news/articles/c776ddjer8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T23:26:20.000Z",
      "summary_90w": "",
      "raw": "The Russian leader senses a chance for more international recognition, while his American counterpart hopes to play peacemaker.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65d06702bc6e0c70ce030b86ec50851b0b89e9cc",
      "title": "'Don't be embarrassed - tell someone', urges victim of prolific catfishing offender",
      "url": "https://www.bbc.com/news/articles/cly2d6erjg9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T23:04:37.000Z",
      "summary_90w": "",
      "raw": "Immy, not her real name, was the first person to report the activities of jailed offender Max Hollingsbee to the police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "907e6e9c471d24be33c0cec0ce266cec81d8761b",
      "title": "How Trump and Putin's past meetings went - and what to expect this time",
      "url": "https://www.bbc.com/news/articles/c86077zxdw2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T22:31:59.000Z",
      "summary_90w": "",
      "raw": "The leaders' head-to-head will be a blockbuster moment in politics and a further glimpse into their relationship.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "032b43e9812335daa00b1efcfe7b28593d22d2b9",
      "title": "A summer camp aims to close the AI know-how gap for low-income high schoolers",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5432691/a-summer-camp-aims-to-close-the-ai-know-how-gap-for-low-income-high-schoolers",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-14T22:13:39.000Z",
      "summary_90w": "",
      "raw": "A free camp for low-income high schoolers aims to close the digital divide around AI know-how. Campers work on AI solutions to real-world environmental and medical challenges.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3af9e8bd4a508386bfe81194164a006827717a47",
      "title": "'We were never friends': A massacre on the eve of WW2 still haunts China-Japan relations",
      "url": "https://www.bbc.com/news/articles/cp89ed9j5ygo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T22:09:30.000Z",
      "summary_90w": "",
      "raw": "Eighty years after Japan was defeated, a wave of Chinese films about the  occupation are fuelling memory and anger.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "efb53e34c0c0115f5bc19bc8b3b76f4757d86fc1",
      "title": "Trump turns up the heat on CEOs and private companies",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5499368/trump-turns-up-the-heat-on-ceos-and-private-companies",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T20:54:02.000Z",
      "summary_90w": "",
      "raw": "Corporate America doesn't want to fight with President Trump in public. But as a result, it's ceding him an unprecedented amount of control over the shape — and future — of U.S. business.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "58317c20d65f7e97b048b1aed22731c6d41f755b",
      "title": "US government is reportedly in discussions to take stake in Intel",
      "url": "https://techcrunch.com/2025/08/14/u-s-government-is-reportedly-in-discussions-to-take-stake-in-intel/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T20:38:20.000Z",
      "summary_90w": "",
      "raw": "This deal would be meant to help Intel bulk up its U.S. chip manufacturing, including its much-delayed Ohio factory.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8de5706d62e1695f8815e2a6a51f4dcaf3caba30",
      "title": "Israeli settlement plans will 'bury' idea of Palestinian state, minister says",
      "url": "https://www.bbc.com/news/articles/ckgdzxpkdd7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T19:36:37.000Z",
      "summary_90w": "",
      "raw": "Far-right Israeli minister Bezalel Smotrich announced approval for 3,401 new homes in the controversial E1 area project in the occupied West Bank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b496f6ddb830a6861f17c48a354336ffcc3871a",
      "title": "What is Bluesky? Everything to know about the X competitor",
      "url": "https://techcrunch.com/2025/08/14/what-is-bluesky-everything-to-know-about-the-x-competitor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:59.000Z",
      "summary_90w": "",
      "raw": "We’ve compiled the answers to some of the most common questions users have about Bluesky.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7cedea8287c90818e33157aacce663554f41001",
      "title": "The wait is almost over: The 2025 Startup Battlefield 200 list drops August 27",
      "url": "https://techcrunch.com/2025/08/14/the-wait-is-almost-over-the-2025-startup-battlefield-200-list-drops-august-27/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:56:46.000Z",
      "summary_90w": "",
      "raw": "After reviewing thousands of groundbreaking applications from around the globe, TechCrunch is just days away from announcing the 2025 Startup Battlefield 200.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "467fd47571f03b8203e74e00039e862ea2b2abf4",
      "title": "Bluesky rolls out massive revamp to policies and Community Guidelines",
      "url": "https://techcrunch.com/2025/08/14/bluesky-rolls-out-massive-revamp-to-policies-and-community-guidelines/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:49:58.000Z",
      "summary_90w": "",
      "raw": "Some of the changes represent an effort by Bluesky to purposefully shape its community and the behavior of its users, nudging them to be nicer and more respectful of others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e26e1583258bda8942994aff606848d94e37766c",
      "title": "Norway spy chief blames Russian hackers for hijacking dam",
      "url": "https://techcrunch.com/2025/08/14/norway-spy-chief-blames-russian-hackers-for-hijacking-dam/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T18:32:02.000Z",
      "summary_90w": "",
      "raw": "The Russian hackers used their access to the dam's computer systems to open a floodgate that spilled millions of gallons of water.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82b57a913289c290a26d37e4da0d32d75821fc3f",
      "title": "Israel appears set to approve illegal 3,400-home West Bank settlement",
      "url": "https://www.theguardian.com/world/2025/aug/14/israel-appears-set-to-approve-controversial-settlement-of-3400-homes-in-west-bank",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T17:48:03.000Z",
      "summary_90w": "",
      "raw": "Finance minister Bezalel Smotrich has said he believes E1 plan will ‘bury the idea of a Palestinian state’\nIsrael appears set to give formal planning approval to a highly controversial and illegal project for more than 3,400 new homes that has been frozen for decades and which critics say would split the occupied West Bank in half.\nStrongly opposed by the international community, the so-called E1 plan would extend the existing Jewish settlement of Ma’ale Adumim towards Jerusalem, further cutting occupied east Jerusalem from the West Bank, and further separating the north and south of the territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "379535d5323f86f1e4d553fee79a0e6576a01933",
      "title": "Weekly quiz: Why were Italian restaurants in a rage about pasta?",
      "url": "https://www.bbc.com/news/articles/crkzlzxlvpjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T17:43:36.000Z",
      "summary_90w": "",
      "raw": "How much attention did you pay to what happened in the world over the past seven days?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "421e772239efc79b6bf7f88def1109151bef74df",
      "title": "Cohere hits a $6.8B valuation as investors AMD, Nvidia, and Salesforce double down",
      "url": "https://techcrunch.com/2025/08/14/cohere-hits-a-6-8b-valuation-as-investors-amd-nvidia-and-salesforce-double-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T17:40:27.000Z",
      "summary_90w": "",
      "raw": "Cohere's market proposition has always been to offer secure LLMs specifically geared for enterprise use, not for consumers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d2deef6e45599cc3630640a2ba9dbdb673997e6a",
      "title": "Melania Trump threatens to sue Hunter Biden for $1bn over Epstein claim",
      "url": "https://www.bbc.com/news/articles/cqjyw0l9d82o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T17:21:01.000Z",
      "summary_90w": "",
      "raw": "The first lady's lawyer has demanded that Joe Biden's son retract claims he made about how she met her husband.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17869ae56d5f28d47c5baaa85e7dd9d125214732",
      "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event",
      "url": "https://techcrunch.com/2025/08/14/pixel-10-ai-capabilities-and-everything-else-we-expect-out-of-the-made-by-google-2025-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T17:05:41.000Z",
      "summary_90w": "",
      "raw": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "14b0ddcd72d0eb0bf975e21f63cc970f6996d04e",
      "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T16:56:35.000Z",
      "summary_90w": "",
      "raw": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5782abee4feef22bf79db80afbc62e77940a236e",
      "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event",
      "url": "https://techcrunch.com/2025/08/14/iphone-17-the-thinnest-iphone-ever-and-everything-else-were-expecting-out-of-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T16:55:27.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what to expect from this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ac81e819fdbbce9fe24979a413939d1dde4327e0",
      "title": "Kodak denies it’s shutting down amid media reports of financial struggles",
      "url": "https://techcrunch.com/2025/08/14/kodak-denies-its-shutting-down-amid-media-reports-of-financial-struggles/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T16:39:11.000Z",
      "summary_90w": "",
      "raw": "Kodak strikes back at media reports suggesting it may go out of business or file for bankruptcy (again).",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4bb7fbbf22261c69523d382527bfb7191ed2fb96",
      "title": "Blackwater founder Erik Prince to send hundreds of fighters to strife-torn Haiti",
      "url": "https://www.theguardian.com/world/2025/aug/14/erik-prince-blackwater-haiti",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:19:48.000Z",
      "summary_90w": "",
      "raw": "Critics say Vectus Global’s presence – including snipers – will undermine Haiti’s police and UN security force\nHundreds of combatants from the US, Europe and El Salvador will reportedly be deployed to Haiti in the coming weeks to battle the country’s gangs as part of a mission led by the controversial Blackwater founder and Donald Trump backer Erik Prince.\nAccording to Reuters, Prince’s new security firm, Vectus Global – which has been operating in the violence-ravaged Caribbean country since March – is preparing to intensify its activities there to help authorities win key roads and territories back from heavily armed criminal groups.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb7740c574fe5c26e6a4a4f6088a00a2dd90b12a",
      "title": "FBI returns stolen document signed by conquistador Hernán Cortés to Mexico",
      "url": "https://www.theguardian.com/world/2025/aug/14/hernan-cortes-document-mexico",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T16:04:07.000Z",
      "summary_90w": "",
      "raw": "US officials did not say who had the 16th-century page that was missing from Mexico’s archives for decades\nNearly five centuries after Spanish conquistador Hernán Cortés signed it and decades after someone swiped it from national archives, a priceless manuscript page has been returned by the FBI to Mexico.\nThe document contains a detailed accounting of the logistics related to Cortés’s journey to what eventually became New Spain – a territory that stretched from Central America to modern-day Washington state.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "842075cde3148f507dddd4131ee10a3908ff9bf1",
      "title": "Left out of Alaska talks, exhausted Ukrainians fear an unjust peace",
      "url": "https://www.bbc.com/news/articles/cly7kl7e469o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-14T16:00:14.000Z",
      "summary_90w": "",
      "raw": "No matter what happens between Trump and Putin, Ukrainians think Russia has no plan to stop the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485dd8c97d4d21800407f31d344b8464f3ae05e5",
      "title": "ChatGPT: Everything you need to know about the AI-powered chatbot",
      "url": "https://techcrunch.com/2025/08/14/chatgpt-everything-to-know-about-the-ai-chatbot/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:50:05.000Z",
      "summary_90w": "",
      "raw": "A timeline of ChatGPT product updates and releases, starting with the latest, which we’ve been updating throughout the year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf9aaee140b942b6845614beb29f9de1f706dcad",
      "title": "Lovable projects $1B in ARR within next 12 months",
      "url": "https://techcrunch.com/2025/08/14/lovable-projects-1b-in-arr-within-next-12-months/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:48:52.000Z",
      "summary_90w": "",
      "raw": "Lovable is a vibe coding startup growing phenomenally quickly, according to new sales projections from CEO Anton Osika.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6b0dd86dcb4203b5eac37e1550259b5fc8bc5eac",
      "title": "Leaked Meta AI rules show chatbots were allowed to have romantic chats with kids",
      "url": "https://techcrunch.com/2025/08/14/leaked-meta-ai-rules-show-chatbots-were-allowed-to-have-romantic-chats-with-kids/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:48:19.000Z",
      "summary_90w": "",
      "raw": "The standards also allow the bots to make \"statements that demean people on the basis of their protected characteristics,\" such as \"black people are dumber than white people.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "efe34b8bed88aa24e8684896630d9137e4f3e8c4",
      "title": "Buzzy AI startup Multiverse creates two of the smallest high-performing models ever",
      "url": "https://techcrunch.com/2025/08/14/buzzy-ai-startup-multiverse-creates-two-of-the-smallest-high-performing-models-ever/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T15:00:00.000Z",
      "summary_90w": "",
      "raw": "It humorously calls this family the Model Zoo because one is like the size of a fly's brain and the other the size of a chicken's.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d80d40cdbfdf1fc446695ae2e401af402c254815",
      "title": "Google pushes AI into flight deals as antitrust scrutiny, competition heat up",
      "url": "https://techcrunch.com/2025/08/14/google-pushes-ai-into-flight-deals-as-antitrust-scrutiny-competition-heat-up/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T14:46:09.000Z",
      "summary_90w": "",
      "raw": "Google has launched Flight Deals as its AI tool within Google Flights to help travelers find cheaper fares.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4bea98069ccdb244fad79ff1d9d66566107cc1a",
      "title": "AI translation tech Palabra gets backing from Reddit co-founder’s venture firm",
      "url": "https://techcrunch.com/2025/08/14/ai-translation-tech-palabra-gets-backing-from-reddit-co-founders-venture-firm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-14T14:41:17.000Z",
      "summary_90w": "",
      "raw": "Alexis Ohanian and his firm Seven Seven Six are backing Palabra, which is working on a translation engine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e48ae59632c9a0b2556a51ef30df83c860244986",
      "title": "Ice deported boy with cancer and two other US citizen children to Honduras, suit alleges",
      "url": "https://www.theguardian.com/us-news/2025/aug/14/ice-lawsuit-louisiana-immigration-deportation",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T14:22:55.000Z",
      "summary_90w": "",
      "raw": "Suit filed in Louisiana says agency didn’t give parents choice as to whether children should be deported with them\nA lawsuit filed in Louisiana on behalf of two mothers and their four minor children, including one with cancer, claims the two families were unlawfully denied due process and deported by US Immigration and Customs Enforcement (Ice) to Honduras in April 2025.\nThe lawsuit, which names the attorney general, Pam Bondi, Department of Homeland Security secretary, Kristi Noem, and various Ice officials as defendants, alleges Ice violated its own policies, and multiple federal laws, when officers secretly detained the families, denied access to counsel and swiftly deported them to Honduras, ignoring legal filings.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6befc5e77a703e2b37e89f0330b9cb6c5d85306",
      "title": "Ancient manuscripts return to Timbuktu 13 years after jihadist takeover",
      "url": "https://www.theguardian.com/world/2025/aug/14/timbuktu-manuscripts-taken-to-bamako-to-protect-them-from-jihadist-militants-returned",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T13:37:28.000Z",
      "summary_90w": "",
      "raw": "Malian city welcomes return of hundreds of crates of treasures after more than a decade stored in capital Bamako\nPolitical and religious figures in Malian city of Timbuktu have welcomed the return of ancient manuscripts that were removed to the capital, Bamako, more than a decade ago to prevent them from falling into the hands of militants linked to al-Qaida.\nAccording to a UN expert mission, jihadists destroyed more than 4,000 manuscripts and as many as nine mausoleums after occupying the desert city in 2012. Workers at the state-run Ahmed Baba Institute used rice sacks to smuggle the remaining documents out of the city a number of ways, including by donkey cart and motorcycle.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07e2fb3d7a071addf5c174da282f45b453e95695",
      "title": "BBC defends investigation of Kenya child-sex trafficking after 'hoax' claims",
      "url": "https://www.bbc.com/news/articles/cvgnkdpl49ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T13:16:46.000Z",
      "summary_90w": "",
      "raw": "The exposé was in the \"public interest\", the BBC says, following criticism from senior Kenyan politicians.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "053ff63f1757981ceff6df959b55d139d127bfe4",
      "title": "Baby Shark: South Korean court rejects US composer’s claim song was plagiarised",
      "url": "https://www.theguardian.com/world/2025/aug/14/baby-shark-song-south-korean-court-rejects-us-composers-claim-catchy-tune-was-plagiarised",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T12:41:28.000Z",
      "summary_90w": "",
      "raw": "Ruling upheld that there was insufficient evidence of copyright infringement on song that is YouTube’s most viewed video\nSouth Korea’s supreme court has rejected a US composer’s allegation that the producers of the catchy children’s song Baby Shark plagiarised his work, ending a six-year-long legal battle.\nThe court upheld two lower court verdicts in favour of Pinkfong, the South Korean company behind the tune with the famous “doo doo doo doo doo doo” refrain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47d042641809b37e01d39fb4dd03cf37b92adfda",
      "title": "Sheinbaum’s expulsion of criminals is more about placating Trump than keeping Mexico safe",
      "url": "https://www.theguardian.com/world/2025/aug/14/mexico-sheinbaum-cartel-extradition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T11:00:43.000Z",
      "summary_90w": "",
      "raw": "Perhaps not coincidentally, the timing of tariff discussions was closely followed by the transfer of wanted criminals\nMexico’s president, Claudia Sheinbaum, has denied that the transfer of 26 alleged cartel members to the United States was part of any kind of deal with Washington and was instead about her country’s own security priorities.\nThis week’s expulsion marked the second time Mexico had sent top criminals to the US this year: in February, Mexican authorities handed over 29 cartel members, including druglord Rafael Caro Quintero, who was responsible for the murder of a DEA agent in 1985. The latest transfers took place after US authorities vowed that prosecutors would not seek the death penalty in any of the cases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32fd75a9e5b0814bcb0ab21569b3a58fb3271b60",
      "title": "Dozens of migrants killed after boats capsize off Italian coast ",
      "url": "https://www.bbc.com/news/articles/cn02g5w39jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T10:31:48.000Z",
      "summary_90w": "",
      "raw": "More than 700 have died crossing the central Mediterranean in 2025, according to the UN reugee agency.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a488f310d7c27a78662cdbe9036113e1e860d0a",
      "title": "Argentina rocked as contaminated medical fentanyl kills up to 96 patients",
      "url": "https://www.theguardian.com/world/2025/aug/14/argentina-contaminated-fentanyl",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-14T10:00:41.000Z",
      "summary_90w": "",
      "raw": "Dozens of hospital patients treated with opioid for unrelated conditions suffered serious bacterial infections\nAs many as 96 people are now thought to have died in Argentina after being treated with medical-use fentanyl that was tainted with bacteria.\nThe official death toll stands at 87, and a judicial source has told the Buenos Aires Herald that nine further deaths are under investigation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90d02c49ef716c74471eed185ceb5e64463305f1",
      "title": "Government expands police use of facial recognition vans",
      "url": "https://www.bbc.com/news/articles/cj4wy21dwkwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T09:55:02.000Z",
      "summary_90w": "",
      "raw": "The Home Office says the technology helps locate suspects but civil liberties groups warn of heightened surveillance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "446014e63d6f5af3726d2c5bd66e68553431539a",
      "title": "FBI returns stolen conquistador document to Mexico",
      "url": "https://www.bbc.com/news/articles/c62we83d1lno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:53:45.000Z",
      "summary_90w": "",
      "raw": "The document, signed by Hernán Cortés in 1527, is thought to have been taken over three decades ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "38a804d9f28369b6fdef65b1b09d31c65623cf53",
      "title": "Watch: Passengers escape car hit by drone in Russia",
      "url": "https://www.bbc.com/news/videos/cwypkvpdz3eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:39:38.000Z",
      "summary_90w": "",
      "raw": "CCTV captured the moment a car was hit by a Ukrainian drone in the Russian city of Belgorod, governor Vyacheslav Gladkov said in his official Telegram channel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e8843b0baa539760fd10984836e3f8ccfbaa73a",
      "title": "Relationship and new album - what we learned from Taylor Swift on Travis Kelce's podcast",
      "url": "https://www.bbc.com/news/articles/cedv5dy9v8lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:27:37.000Z",
      "summary_90w": "",
      "raw": "The pop superstar gives a rare insight into their life together and reveals details of her new album.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "137a8e7adcf9d66b044b04039eaa11c281b3165f",
      "title": "German states debate who invented Bratwurst sausages",
      "url": "https://www.bbc.com/news/articles/cq8735exn80o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:26:36.000Z",
      "summary_90w": "",
      "raw": "The German states of Bavaria and Thuringia are embroiled in a row over who can lay claim to inventing the Bratwurst.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d3fd322f5902f1da2878d9d8806202af274ecc77",
      "title": "'Our children are dying': Rare footage shows plight of civilians in besieged Sudan city",
      "url": "https://www.bbc.com/news/articles/czxp0qyn6dqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T09:16:38.000Z",
      "summary_90w": "",
      "raw": "Parents are struggling to feed their children in war-hit Sudan's Darfur region.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a8f4575ab6cdf058a22fa1ac7b4729cb172ee75b",
      "title": "Trump is tightening the screws on corporate America — and CEOs are staying mum",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501591/trump-corporate-america-capitalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Critics warn that Trump's demands for business leaders to step down, and for the government to take a cut of sales, threaten American-style capitalism.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ed04f77081b68c78ccd53fd7d85a9352a74c1786",
      "title": "Why every A-lister also has a side hustle",
      "url": "https://www.npr.org/2025/08/14/nx-s1-5501492/why-every-a-lister-also-has-a-side-hustle",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-14T07:00:03.000Z",
      "summary_90w": "",
      "raw": "Seemingly every celebrity has their own brand these days, whether it’s booze (Cameron Diaz, Matthew McConaughey) or cosmetics (Selena Gomez, Lady Gaga) or squeezy food pouches (Jennifer Garner). Today on the show, what is fueling the celebrity business bonanza? We hear from two legendary singers, Lisa Loeb AND John Legend, who are pursuing ventures outside of show business. \nRelated episodes: \nThe celebrity crypto nexus \nThe Olympian to influencer pipeline (Apple / Spotify)\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "60ef19ca2852e9f60dc3882df7aa7d376cad06bd",
      "title": "US warns of additional tariffs on India if Trump-Putin peace talks fail",
      "url": "https://www.bbc.com/news/articles/c776zrmy5jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T06:27:29.000Z",
      "summary_90w": "",
      "raw": "US Treasury chief says Washington could increase secondary tariffs on India if talks don't go well in Alaska.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62ffbad25af882bec8907ea4ada94a73d7fe6e46",
      "title": "Watch: Meteor shower seen in skies above UK",
      "url": "https://www.bbc.com/news/videos/cvgnkmpkd77o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T01:55:07.000Z",
      "summary_90w": "",
      "raw": "The astronomical event was captured on camera at North York Moors National Park on 13 August.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a4eef0749e5758fa85b6029c1237063dc7ecae1a",
      "title": "Australia and Vanuatu agree to $328m security and business deal ",
      "url": "https://www.bbc.com/news/articles/c8ry0l045myo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-14T01:13:36.000Z",
      "summary_90w": "",
      "raw": "Australia is trying to grow its influence in the Pacific region, to counter China's increased power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5cb7c206284f9d9097dfd1ca27e8741a341349f3",
      "title": "Jimmy Lai trial: closing arguments in Hong Kong delayed by aftermath of Typhoon Podul",
      "url": "https://www.theguardian.com/world/2025/aug/14/jimmy-lai-trial-hong-kong-closing-arguments",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T23:33:52.000Z",
      "summary_90w": "",
      "raw": "Lai has been detained since December 2020, with western nations and rights groups calling for his release\nThe closing arguments in the national security trial against jailed Hong Kong media mogul Jimmy Lai were postponed on Thursday after the Asian financial hub issued its highest-level “black” weather warning, stemming from ex-typhoon Podul.\nQueues had formed outside the court for the public gallery, but torrential rain saw the closing arguments in the trial, which began in late 2023, delayed. Proceedings are expected to resume on Friday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf58767402e72f72fd0baa8c979c57722aafac07",
      "title": "Chemistry on trial: How a professor tried to convince a court she didn’t kill her husband",
      "url": "https://www.bbc.com/news/articles/c0r77qezg09o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T21:21:44.000Z",
      "summary_90w": "",
      "raw": "While the accused mounted a self-argued defence using science, the court found her guilty of murder.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a2811bcc00c476e45676f8848490bc0af41179f",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5471614-e1/boston-public-library-aims-to-increase-access-to-a-vast-historic-archive-using-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T20:27:22.000Z",
      "summary_90w": "",
      "raw": "The Boston Public Library is launching a project in collaboration with Harvard University and OpenAI to increase public access to hundreds of thousands of historically significant documents.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f4106dc65521c3ec88052a2e68475b9b666a45e5",
      "title": "US warships patrol South China Sea after two Chinese ships collide",
      "url": "https://www.theguardian.com/world/2025/aug/13/us-warships-south-china-sea",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-13T17:00:03.000Z",
      "summary_90w": "",
      "raw": "USS Higgins and USS Cincinnati sailed near Scarborough Shoal after Chinese tried to drive away Philippine vessel\nThe US has briefly deployed two warships in a disputed South China Sea shoal where two Chinese ships collided earlier in the week while trying to drive away a smaller Philippine ship in a high-seas accident that raised alarms about maritime safety.\nBoth China and the Philippines claim Scarborough Shoal and other outcroppings in the South China Sea. Vietnam, Malaysia, Brunei and Taiwan also lay overlapping claims in the contested waters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a52368c64d2c581c492d350950febeba8eae7f4f",
      "title": "Watch: Wildfire approaches horse enclosure in Greece",
      "url": "https://www.bbc.com/news/videos/c4gjknxkx2do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T16:31:34.000Z",
      "summary_90w": "",
      "raw": "At least three people have also died in Spain, Albania and Turkey as wildfires wreak havoc.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "476e27d70cb554cec91890aa653efb7fad548bbe",
      "title": "Porn site traffic plummets as UK age verification rules enforced",
      "url": "https://www.bbc.com/news/articles/c17n9k54qz2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T16:30:27.000Z",
      "summary_90w": "",
      "raw": "Data suggests leading adult site Pornhub lost more than one million visitors in two weeks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5afe8fca2392793511814e22a61bf4bf13ce7ac1",
      "title": "Why Trump's spending bill could close your grocery store",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500298/why-trumps-spending-bill-could-close-your-grocery-store",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T11:29:48.000Z",
      "summary_90w": "",
      "raw": "Trump’s tax and spending law makes the largest cut in history to one of the nation’s biggest safety net programs. Today on the show, we explore how cuts to the Supplemental Nutrition Assistance Program, also known as SNAP, impacts families and grocery stores alike. \nBased on the digital story: Independent grocery stores have had a tough five years. SNAP cuts will make it harder\nRelated episodes:\nDo work requirements help SNAP people out of government aid? \nWhen SNAP Gets Squeezed \nThe trouble with water discounts\nFor sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org.\nFact-checking by Sierra Juarez. Music by Drop Electric. Find us: TikTok, Instagram, Facebook, Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "744bdaee35d4ee3647264b0dda16bd2690681ccc",
      "title": "Aerial footage shows aftermath of massive train derailment in Texas",
      "url": "https://www.bbc.com/news/videos/c2djny868x3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-13T10:45:26.000Z",
      "summary_90w": "",
      "raw": "Video shows mangled train cars piled on top of each other on the tracks, as emergency crews attended the scene",
      "topics": [
        "World"
      ]
    },
    {
      "id": "55217b67ac86d609b4d3661bc5f155a1d98d8dff",
      "title": "Bezos-backed Perplexity AI makes surprise bid for Google Chrome",
      "url": "https://www.bbc.com/news/articles/c3dpr0kkyz4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:43:21.000Z",
      "summary_90w": "",
      "raw": "One technology investor called the $34.5bn offer a \"stunt\" that is much lower than Chrome's true value.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "02b2974829ddaae25d06e41dc4a3fb960ab64fb9",
      "title": "AI can make us UK's biggest firm, Rolls-Royce says",
      "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:38:19.000Z",
      "summary_90w": "",
      "raw": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5c13190c3cfa72878c13f0d56a3d23fa16218903",
      "title": "Apple rejects Musk's App Store bias claims ",
      "url": "https://www.bbc.com/news/articles/cn842x1v1n1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T09:13:13.000Z",
      "summary_90w": "",
      "raw": "The X owner had accused Apple of making it impossible to fairly compete with ChatGPT.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6afe7d4b00182efad1b74d65abbe4519acb4d2a0",
      "title": "Is Kari Lake a CEO? Her agency said so. The law suggests not",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500554/kari-lake-ceo-agency-usagm-voice-of-america",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Kari Lake has sought to dismantle Voice of America and its federal parent, the U.S. Agency for Global Media. The agency has recently called her its acting CEO. But the law suggests she's not eligible for the job.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "829ac3fbd98d53cfadf9e76a9cccdd391cf6a96a",
      "title": "What it was like for one NPR newscaster to go on an AI date",
      "url": "https://www.npr.org/2025/08/13/nx-s1-5500249/what-it-was-like-for-one-npr-newscaster-to-go-on-an-ai-date",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-13T08:58:28.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bcfc01eaa8b9fcf0b14e02698a43874bdab8e7b1",
      "title": "Govt 6: When the markets need fixing (Market Design)",
      "url": "https://www.npr.org/sections/money/2025/08/06/1255336594/summer-school-market-design-fisheries-auctions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-13T07:00:00.000Z",
      "summary_90w": "",
      "raw": "In economics, a market is a place (even virtual) where buyers and sellers interact to exchange goods or services.  Economists love markets. It's like all of our supply and demand graphs have come to life. Everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix. \nBut sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. \nToday's episode: Market Design. \nCheck out our Summer School video cheat sheet on the origins of money at the Planet Money TikTok. \nThe series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford.  \nHelp support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney.\n\nAlways free at these links: Apple Podcasts, Spotify, the NPR app or anywhere you get podcasts.\nFind more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "bd5a89cd56253e829e810d84b031679e6e067787",
      "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
      "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-13T03:53:28.000Z",
      "summary_90w": "",
      "raw": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "011af3f7b044fb0610cd786612919dcf3cde5c21",
      "title": "Crime in DC: What do the figures say and how safe do people feel?",
      "url": "https://www.bbc.com/news/videos/cewynn7krj1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T23:18:28.000Z",
      "summary_90w": "",
      "raw": "National Guard troops have been seen reporting for duty in Washington DC as President Trump takes over the city’s police force.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5fbeba8eff0af4d13d44fcbe2969b53f70c8046",
      "title": "Inside Australia's billion-dollar bid to take on China's rare earth dominance",
      "url": "https://www.bbc.com/news/articles/cgm2z91mvlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-12T22:05:03.000Z",
      "summary_90w": "",
      "raw": "Recent moves by Beijing have got businesses worried - and Australia is looking to offer an alternative.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0adfca7329ceaba73a88178b2b60d25e3de7f465",
      "title": "HMRC using AI to scour suspected tax cheats' social media",
      "url": "https://www.bbc.com/news/articles/cqjyedz202ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-12T15:11:48.000Z",
      "summary_90w": "",
      "raw": "It said the tech would not replace \"human decision-making\" and was subject to legal oversight.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "66265a8c4b93680e4ddc0a2ec6304199457474b4",
      "title": "Say bye-bye to the beeps and boops of AOL's dial-up internet service",
      "url": "https://www.npr.org/2025/08/12/nx-s1-5499539/aol-dial-up-ending",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "AOL debuted the service in 1989. Dial-up has largely been replaced by broadband internet.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31eabb39b753f6e6943259bebad0105541e8fc2d",
      "title": "Staff fear UK's Turing AI Institute at risk of collapse",
      "url": "https://www.bbc.com/news/articles/c24zz2vdv51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T23:01:26.000Z",
      "summary_90w": "",
      "raw": "A complaint raises concerns about the funding risks and a \"toxic\" culture at the Alan Turing Institute.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86ed6090889d94f14d92923a92ce4fe2213c927c",
      "title": "Nvidia and AMD to pay 15% of China chip sales to US",
      "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T22:30:14.000Z",
      "summary_90w": "",
      "raw": "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f9e5ae1a7858ce4e9cd42f8aaec953338187183",
      "title": "Ford says it will roll out a cheaper electric pickup truck",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T20:50:48.000Z",
      "summary_90w": "",
      "raw": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f857ee5f0ac32e17c9c4e6726acc4e02f2983ea3",
      "title": "AOL ends dial-up service after more than 30 years ",
      "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T20:26:24.000Z",
      "summary_90w": "",
      "raw": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba9f3514a8fa02759cc8d5d019d5fa5415a376fb",
      "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5498689/trump-nvidia-h20-chip-sales-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T17:04:57.000Z",
      "summary_90w": "",
      "raw": "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80fcf17b05d89fae0b2349b26a4e007b0a0681b2",
      "title": "Wikipedia loses challenge against Online Safety Act verification rules",
      "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:37:06.000Z",
      "summary_90w": "",
      "raw": "The Wikimedia Foundation says the new rules could threaten user privacy and safety.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "104f9fa9dc6b529ee7576a4ee96a95754463e21a",
      "title": "Tough, smart and ahead of her time - how Dame Stephanie changed women's role in the tech industry",
      "url": "https://www.bbc.com/news/articles/c4gzzlp7p3po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T15:20:58.000Z",
      "summary_90w": "",
      "raw": "She founded the software company Freelance Programmers in 1962, which almost exclusively hired women, and in later life donated almost £70m of her fortune.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "82d1d661b6572c7550f2bdfe06c0585d87ab64cc",
      "title": "M&S click and collect returns 15 weeks after cyber attack ",
      "url": "https://www.bbc.com/news/articles/cewyyjdzql4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T09:09:15.000Z",
      "summary_90w": "",
      "raw": "The retailer stopped taking orders on its website and app for clothing on 25 April.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e706704789f8790f30c945b05bcb59855eca5b9",
      "title": "Boston Public Library aims to increase access to a vast historic archive using AI",
      "url": "https://www.npr.org/2025/08/11/nx-s1-5471614/boston-public-library-harvard-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-11T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The library is launching a project in collaboration with Harvard Law School and OpenAI this summer to digitize the materials and make them more fully searchable.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5198fc43f7025875d383f73877af6bd67e8cd65",
      "title": "Musk's Tesla applies to supply power to British homes",
      "url": "https://www.bbc.com/news/articles/c3v3333rlp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-11T04:17:07.000Z",
      "summary_90w": "",
      "raw": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7ee965deb286ca1f8e7bf61bea60744f0f632ca6",
      "title": "It shocked the market but has China's DeepSeek changed AI?",
      "url": "https://www.bbc.com/news/articles/c4gez754mn6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-09T23:06:23.000Z",
      "summary_90w": "",
      "raw": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d03b80a9a5936103f883be0aecfc07b2bb5e2475",
      "title": "Why short breaks to move around are crucial for your creative process",
      "url": "https://www.npr.org/2025/08/08/nx-s1-5492125/body-electric-kelly-corrigan",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-08T20:00:04.000Z",
      "summary_90w": "",
      "raw": "When bestselling author Kelly Corrigan's creativity runs low or her mood turns, she doesn't power through. Here are her tips for connecting your body to your creative process and getting unstuck.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "653d9f36617bf0198a14a1739f32730c58636112",
      "title": "Trump opens door for crypto in retirement accounts",
      "url": "https://www.bbc.com/news/articles/c62w8ewg849o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T22:41:52.000Z",
      "summary_90w": "",
      "raw": "The president signs an order aimed at expanding the kinds of investments allowed in retirement accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d4fd9c31696a68afc4b24e1d4a9200adcd419fd",
      "title": "OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level'",
      "url": "https://www.bbc.com/news/articles/cy5prvgw0r1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T19:15:55.000Z",
      "summary_90w": "",
      "raw": "GPT-5's release comes as tech firms continue to compete in an effort to claim the world's most advanced AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "63256048ae2bd7b3e838ea3ec843b1ab4a7ccc0f",
      "title": "What are semiconductors and why is Trump threatening 100% tariffs?",
      "url": "https://www.bbc.com/news/articles/cly3r664q1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-07T12:31:58.000Z",
      "summary_90w": "",
      "raw": "The president said he plans to introduce 100% tariffs on foreign-made chips, but the largest producers may avoid the levy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d82a02b71529ef809e452b6e24c744c74de2986",
      "title": "Apple to invest $100bn after pressure from Trump",
      "url": "https://www.bbc.com/news/articles/cdx0n7y29kdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T22:04:06.000Z",
      "summary_90w": "",
      "raw": "The president had been pressing Apple to do more of its manufacturing in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4472835432e8052e854fccadbd61fc44e8024794",
      "title": "Woman awarded £150,000 after LG phone sparks fire in her home",
      "url": "https://www.bbc.com/news/articles/c04r5ye59w2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T18:57:50.000Z",
      "summary_90w": "",
      "raw": "Denise Parks was in bed in her home in Coatbridge when a fire broke out in the early hours of the morning.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc8e92dd8a3757ceca5789f39e93241f97e68fcd",
      "title": "WhatsApp deletes over 6.8m accounts linked to scams, Meta says",
      "url": "https://www.bbc.com/news/articles/ce35q2ly1w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T12:23:06.000Z",
      "summary_90w": "",
      "raw": "Many of the accounts were linked to criminal groups operating in South East Asia, the social media giant said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89d3027bd5e781b2fcf054169b3080ed0bc854bb",
      "title": "Chinese nationals charged with exporting Nvidia AI chips to China",
      "url": "https://www.bbc.com/news/articles/c4gm921x424o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:56:37.000Z",
      "summary_90w": "",
      "raw": "Chuan Geng and Shiwei Yang are accused of exporting the chips from the US to China through Singapore and Malaysia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4f731f20db6a0a90f04cb17bf366c0efb612d0b",
      "title": "Call to vet YouTube ads like regular TV to stop scams",
      "url": "https://www.bbc.com/news/articles/ckge5xdwjx5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-06T09:48:15.000Z",
      "summary_90w": "",
      "raw": "Liberal Democrats say regulations need to catch up with \"the reality of how people are watching content\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "345e90a24fe45eae9d6cbac245dd01798f4dc7d4",
      "title": "Jobs in video games dried up, so we made our own",
      "url": "https://www.bbc.com/news/articles/c87e82pd97wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-05T08:21:03.000Z",
      "summary_90w": "",
      "raw": "Getting work in gaming is harder and harder, especially for new starters. How are young developers following their passions?",
      "topics": [
        "Technology"
      ]
    }
  ]
}