{
  "version": "1757457177360",
  "generatedAt": "2025-09-09T22:32:57.360Z",
  "items": [
    {
      "id": "1af6d8f31dc8f641fd2e03813b1ae929b6631a77",
      "title": "News live: Australian government condemns Israel’s Qatar strikes; Meta takes action on deepfake nude apps",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T22:19:30.000Z",
      "summary_90w": "",
      "raw": "Foreign affairs minister says Israeli strikes on Qatar ‘the wrong thing to do’. Follow today’s news live\n\nGet our breaking news email, free app or daily news podcast\n\nMatt Thistlethwaite, the assistant minister for foreign affairs and trade, said Israel’s strikes against top Hamas members in Qatar violated the nation’s sovereignty and imperilled ceasefire talks, adding the Australian government was not informed of the actions beforehand.\nThistlethwaite told RN Breakfast this morning the government condemned the strikes, adding:\nThese strikes violate Qatar’s sovereignty and they imperil a ceasefire and the release of the Israeli hostages. And unfortunately, they risk further escalation in the conflict.\nQatar’s been working quite hard behind the scenes alongside the United States and Egypt to try and broker a ceasefire and a release of hostages deal. So these strikes will imperil that. Nonetheless, it’s encouraging to hear Qatari leaders say that they remain committed to trying to broker an agreement and a ceasefire.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0c422100f50c5b7296cd3a56b2078cb7846e313",
      "title": "Trump says US warned Qatar of impending Israel strike but were ‘too late to stop the attack’ – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T22:15:50.000Z",
      "summary_90w": "",
      "raw": "Qatar says attack is ‘serious escalation’ as world leaders say strike on Doha risks efforts for a ceasefire in Gaza; Hamas says six people were killed in attack\n\nIsrael launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks\n\nDan Sabbagh is the Guardian’s defence and security editor\nFifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e15d07cdec29c9330fddd7f401a970fa8d6d82f5",
      "title": "Trump says strike on Doha 'does not advance Israel or America's goals'",
      "url": "https://www.bbc.com/news/articles/cx25711r8jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T22:13:26.000Z",
      "summary_90w": "",
      "raw": "The US president says he feels \"very badly\" about the location of the attack and calls Qatar a \"close ally\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "321a54aab387992f7d616809a8ec2978fa88237d",
      "title": "Help, I have been charmed by the iPhone Air",
      "url": "https://techcrunch.com/2025/09/09/help-i-have-been-charmed-by-the-iphone-air/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T22:07:42.000Z",
      "summary_90w": "",
      "raw": "Apple's sleek iPhone Air has a powerful processor and large display, but its battery life and camera might be a problem.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5e0d30b3f7bfc3fa5eabcb56d896b53062897b4b",
      "title": "Australia approves world-first vaccine to curb koala chlamydia epidemic",
      "url": "https://www.bbc.com/news/articles/cwylp71vnjgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T22:04:56.000Z",
      "summary_90w": "",
      "raw": "Thousands of koalas have died from the sexually-transmitted disease, with some estimates suggesting only 50,000 remain in the wild.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "acd6bba88b0bdae3bf10c6f51fe777e23860a1cc",
      "title": "Reeves tightens departmental spending ahead of budget",
      "url": "https://www.bbc.com/news/articles/cyv63l3395zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T22:00:37.000Z",
      "summary_90w": "",
      "raw": "Ahead of the Autumn budget, the chancellor is limiting access to the Treasury's emergency funds.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eecf41aac88722b0b8b41b3501f3faed2f8d4cc3",
      "title": "What do we know about the strike?",
      "url": "https://www.bbc.com/news/articles/cq5jl77ygv4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T21:58:39.000Z",
      "summary_90w": "",
      "raw": "Israel carried out a strike on senior Hamas leaders in Qatar's capital Doha on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "702d77bd9aacb6799a079c842a0611d06d74cb74",
      "title": "Judge puts Anthropic&#8217;s $1.5 billion book piracy settlement on hold",
      "url": "https://www.theverge.com/news/775230/anthropic-piracy-class-action-lawsuit-settlement-rejected",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T21:45:42.000Z",
      "summary_90w": "",
      "raw": "Anthropic’s $1.5 billion book piracy settlement has been put on pause after the federal judge overseeing the class action case raised concerns about the terms of the agreement. During a hearing this week, Judge William Alsup rejected the settlement over concerns that class action lawyers will create a deal behind closed doors that they will force “down the throats of authors,” according to reports from Bloomberg Law and the Associated Press.\nAnthropic agreed to pay the landmark settlement last week, putting to rest a class action lawsuit from US authors that accused the AI company of training its models on hundreds of thousands of copyrighted books. Judge Alsup let the class action lawsuit move forward after ruling that Anthropic training its AI models on purchased books counts as fair use, but that it could be liable for training on illegally downloaded work.\nIn addition to his concerns over authors being strong-armed into signing a deal, Alsup says he needs to review more information about the claims process outlined in the settlement. “I have an uneasy feeling about hangers on with all this money on the table,” Alsup said, as reported by Bloomberg Law.\nUnder the settlement, authors and publishers would receive about $3,000 for covered works. As noted by AP, an attorney for the authors said there are around 465,000 books that would be covered by the settlement, but Judge Alsup asked for a solid number to ensure Anthropic doesn’t get hit with other lawsuits “coming out of the woodwork.” He added that class members will need to be given “very good notice” to make sure they’re aware of the case.\nMaria Pallante, CEO of the Association of American Publishers, an industry group backing the authors’ lawsuit, told AP that Alsup “demonstrated a lack of understanding of how the publishing industry works.” Pallante said that “class actions are supposed to resolve cases, not create new disputes, and certainly not between the class members who were harmed in the first place.” The authors’ attorney, Justin Nelson, said in a statement to Bloomberg Law that the lawyers “care deeply that every single proper claim gets compensation.”\nJudge Alsup will revisit the settlement during another hearing on September 25th. “We’ll see if I can hold my nose and approve it,” Alsup said, according to the AP.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dbfa6840189ef6b0abde8217328c3b41afcf0ed8",
      "title": "Abducted Israeli-Russian researcher Elizabeth Tsurkov freed in Iraq",
      "url": "https://www.bbc.com/news/articles/cx2xydl9pdjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T21:45:29.000Z",
      "summary_90w": "",
      "raw": "A Princeton student \"tortured for many months\" by Iraqi militia is now in the US embassy, President Trump says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a34d0b55b0d1d2f4820146fc56bd47558e421906",
      "title": "Why SpaceX made a $17B bet on the direct-to-cell market",
      "url": "https://techcrunch.com/2025/09/09/why-spacex-made-a-17b-bet-on-the-direct-to-cell-market/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T21:44:20.000Z",
      "summary_90w": "",
      "raw": "Explaining SpaceX's aggressive move to dominate satellite-to-phone connectivity.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad847dabdbb7426f0931ac7640be17624c7127f1",
      "title": "Apple&#8217;s newest health-tracking features are coming to older watches",
      "url": "https://www.theverge.com/news/775200/apple-watch-series-9-hypertension-sleep-score-wrist-flick",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T21:32:29.000Z",
      "summary_90w": "",
      "raw": "Apple just announced a bunch of new health tracking features alongside its new smartwatch lineup — but you might not need to upgrade your device to get access to them. With the launch of watchOS 26 next week, Apple will bring hypertension notifications, live translation, and the new wrist flick gesture to the Watch Series 9 and newer, along with the last-gen Watch Ultra 2.\nApple’s new hypertension notifications use data from the watches’ existing optical heart sensor to “analyze how a user’s blood vessels respond to the beats of the heart.” An algorithm will then review this data over a period of 30 days and will notify users if it detects signs of high blood pressure. Apple says it expects clearance from the FDA and other regulators this month. It will roll out in more than 150 countries and regions.\nAdditionally, Apple’s upcoming Sleep Score feature is coming to a wider selection of watches beyond the new Watch Series 11. Next week, it will roll out to the Watch Series 6 and later, in addition to all Watch Ultra models and the 2nd-gen Watch SE and later. This feature uses your heart rate, wrist temperature, blood oxygen, and respiratory data to rate the quality of your sleep when used with an iPhone 11 or later.\nThese features will arrive with watchOS 26 on September 15th.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf4a56d44ef7fdeb4cd2eccd77400c36a6c59d82",
      "title": "First two Brazilian judges vote to convict Jair Bolsonaro in coup plot trial",
      "url": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T21:30:45.000Z",
      "summary_90w": "",
      "raw": "Three more supreme court justices to cast their votes in coming days, with verdict expected by Thursday\n\n‘He’s always on the attack’: the Brazilian judge prosecuting Bolsonaro inspires both love and hate\n\nJair Bolsonaro led a criminal organisation that sought to plunge Brazil back into dictatorship with a murderous power grab involving special forces assassins and a vast disinformation campaign, the supreme court judge presiding over the former president’s trial has claimed as he voted for Bolsonaro’s conviction.\nAlexandre de Moraes was the first supreme court justice of five to announce his decision on Tuesday, as the trial of Bolsonaro and seven alleged co-conspirators – including four senior members of the military and the former head of Brazil’s answer to MI6 – entered its final stretch.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e970153e0a8833cb3ab7905dd82e0bea6daf83eb",
      "title": "I want to love Apple’s new iPhone Air, but the iPhone 17 is a better deal",
      "url": "https://techcrunch.com/2025/09/09/i-want-to-love-apples-new-iphone-air-but-the-iphone-17-is-a-better-deal/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T21:21:14.000Z",
      "summary_90w": "",
      "raw": "I was within a heartbeat of preordering the new iPhone Air. But a closer looks at the specs changed my mind.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f4a46c46282a61a5ffb76cf430bc0890cb30b6c0",
      "title": "Verge staffers react to the iPhone Air: what we love and don’t love",
      "url": "https://www.theverge.com/tech/774831/iphone-air-apple-reactions-thin-camera",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T21:18:10.000Z",
      "summary_90w": "",
      "raw": "Determined to give us something new to talk about, Apple has introduced its ultra-thin iPhone Air. It's just 5.6mm thick with a 6.5-inch ProMotion display, a 48-megapixel dual camera, a selfie camera that supports Center Stage, and an add-on MagSafe battery. Among other things.\nWe asked the staff of The Verge for their first impressions of the iPhone Air. We'll run a full review of the phone, of course, but here are some feelings about the phone from our staff.\nPreorders for the iPhone Air begin on Friday, September 12th, and it ships on September 19th. \nDo you want an ultra-slim iPhone?\nThe iPhone 17 Air is thin and lovely. My iPhone 15 …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ac2d35bcf87ecdd8900cecfbfcc47900ae7765ce",
      "title": "The iPhone 17 Pro’s orange is good — and well-timed",
      "url": "https://www.theverge.com/apple/775186/apple-iphone-17-pro-cosmic-orange-color-good",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T21:12:17.000Z",
      "summary_90w": "",
      "raw": "Apple just announced arguably its boldest Pro iPhone color ever: the new \"cosmic orange\" for the iPhone 17 Pro. And to my surprise, I think it looks really good.\nIn choosing a bold hue as its hero shade for the iPhone 17 Pro, Apple also seems to have nailed one of the season's hottest colors. Orange showed up a lot on fashion runways earlier this year, and orange-y citrus shades were one of this summer's color trends, according to Vogue.\nAnd on the iPhone 17 Pro, it's a deep orange that really pops. Based on Apple's photos and the ones we took at the iPhone 17 launch event, you'll definitely spot the phone on a table across the room. Thank …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "198630dd44b630000875484fd779bafc90eaba77",
      "title": "Starmer to meet Israel's president in Downing Street",
      "url": "https://www.bbc.com/news/articles/cly9jgmgqe8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T21:10:49.000Z",
      "summary_90w": "",
      "raw": "The PM will stress the \"the action Israel must take to end the horrific suffering\" in Gaza, No 10 said.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "11a3b64066b44ba4870f2e2a1ead1b7ec9a560fa",
      "title": "Chris Mason: Early skirmishes in Labour race highlight government headache",
      "url": "https://www.bbc.com/news/articles/c0lkgylwn06o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T21:02:29.000Z",
      "summary_90w": "",
      "raw": "The ripple effects of the Angela Rayner saga roll on as six candidates make their pitch for deputy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1eb19fba487e6c11508fe2ca6e042376b77213b8",
      "title": "How to preorder the Apple Watch SE 3, Apple Watch Series 11, and Apple Watch Ultra 3",
      "url": "https://www.theverge.com/tech/773089/apple-watch-se-3-series-11-ultra-3-preorder-buy-price-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T21:00:00.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch SE 3 starts at $249 and is available for preorder today. | Image: Apple\t\n\nThe iPhone Air and the iPhone 17 fleet of phones took the spotlight during Apple’s “Awe dropping” event. If you weren’t tempted by the new phones, the fact that the entire Apple Watch lineup got refreshed might have been even bigger news to you. Soon, the Apple Watch SE 3, Apple Watch Series 11, and Apple Watch Ultra 3 will arrive, and each is bringing along some big upgrades, which we’ll get into a bit below.\nAll three are available for preorder starting today, with the SE 3 starting at $249, the Series 11 starting at $399, and the Ultra 3 starting at $799. They’ll all ship on September 19th. We’ll update this post if any attractive carrier deals roll in.\nAll three watches launch with watchOS 26, which includes the new Liquid Glass design, just like the new updates coming to most of Apple’s other devices on September 15th. The update also includes an AI-powered Workout Buddy to encourage you during exercise. Flicking your wrist up will clear your notifications. The watchOS 26 update will be released for older Apple Watch models (going back to Series 6, SE 2, and Ultra) on September 15th.\nWe’ve gone hands-on with the upcoming Apple Watches — delivering impressions to the extent that it’s possible in a limited hands-on environment — but we’ll soon be getting each of them in for a full review. We also have initial impressions of the iPhone 17 line, including the iPhone 17, iPhone 17 Pro, and the iPhone Air.\nWhere to preorder the Apple Watch SE 3\nThe Apple Watch SE 3 is the first update to Apple’s entry-level smartwatch line since 2022. It has the same S10 chip as the Apple Watch Series 11 and Ultra 3, and an always-on display that Apple says is four times more scratch resistant than the previous model. It supports Apple’s SOS and fall detection features, plus an entirely new feature called Sleep Score, which analyzes the amount of time you spend in each sleep stage and gives you a score based on the overall quality of sleep. The Apple Watch SE 3 also supports sleep apnea detection.\nApple says the SE 3’s charging speed is twice as fast as the previous Apple Watch SE, offering eight hours of battery life off a 15 minute charge. The cellular version of the Apple Watch SE 3 supports 5G for the first time. When you’re not connected to the internet, you can use on-device Siri to handle local requests.\nThe Apple Watch SE 3 is available in two case sizes: 42mm and 44mm. The 42mm GPS model costs $249, and jumps up to $299 if you want cellular connectivity. The 44mm GPS model costs $299, and the cellular model costs $329. All models are available for preorder from Apple, and you can choose your size, color, and whether you want the GPS or cellular version from the same page.\nApple Watch SE 3 (GPS; 42mm)\n\nWhere to Buy:\n\n $249 at Apple\n\nWhere to preorder the Apple Watch Series 11\nThe Apple Watch Series 11 may look the same as the Series 10 it’s replacing, but it has a 5G cellular modem for the first time. Its displays are the same size, but Apple says the glass it used is twice as scratch resistant. Its heart rate sensor can now measure how blood is flowing through your veins to detect hypertension in the background, a feature that’s currently waiting for clearance at the FDA. That feature is also going to be available on the Apple Watch Series 9 and Ultra 2. It also supports the new Sleep Score feature. The Series 11’s battery life has been bumped to 24 hours, up from 18 hours.\nThe Apple Watch Series 11 comes two sizes: 42mm and 46mm. The 42mm GPS model costs $399 while the cellular version will set you back $429. The 46mm version costs $499, or $529 if you want the cellular model. All models are available for preorder from Apple, and you can choose your size, color, band type, and whether you want the GPS or cellular version from the same page.\nApple Watch Series 11 (42mm; GPS)\n\nWhere to Buy:\n\n $399 at Apple\n\nWhere to preorder the Apple Watch Ultra 3\nThe refreshed Apple Watch Ultra 3 has a larger wide angle OLED display that can ratchet its refresh rate down to 1Hz for a more responsive always-on display. The smartwatches case size hasn’t changed, but the display is slightly larger thanks to a reduction in bezel size. It lasts up to 48 hours per charge, and has the same new 5G modem as the rest of Apple’s upcoming smartwatches. It’s also gained support for satellite texting, which will allow you to send a message and enable Find My to share your location when Wi-Fi and cellular service aren’t available.\nThe Apple Watch Ultra 3 is available in one case size, 49mm, and you can preorder it from Apple for $799. \nApple Watch Ultra 3\n\nWhere to Buy:\n\n $799 at Apple",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3b485095ad8edc48c1a9f45bfa58bcbabcca433b",
      "title": "Israeli-Russian graduate student freed after 903 days in Hezbollah captivity",
      "url": "https://www.theguardian.com/us-news/2025/sep/09/israeli-russian-graduate-student-freed-after-903-days-in-hezbollah-captivity",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T20:58:21.000Z",
      "summary_90w": "",
      "raw": "Elizabeth Tsurkov, who entered Iraq to do research for Princeton, had gone missing in Iraq in early 2023\nIsraeli-Russian academic and Princeton student Elizabeth Tsurkov has been released after being kidnapped by Kata’ib Hezbollah and spending more than two years in captivity, Donald Trump said in a post on social media.\n“I am pleased to report that Elizabeth Tsurkov, a Princeton Student, whose sister is an American Citizen, was just released by Kata’ib Hezbollah (MILITANT Hezbollah), and is now safely in the American Embassy in Iraq after being tortured for many months. I will always fight for JUSTICE, and never give up. HAMAS, RELEASE THE HOSTAGES, NOW!” the US president wrote in a TruthSocial post on Tuesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af0bd3238973b03e67bcd48cf2d3be2573adb540",
      "title": "First of five judges finds Brazilian ex-President Bolsonaro guilty of plotting coup",
      "url": "https://www.bbc.com/news/articles/ceq2lv20rp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:54:49.000Z",
      "summary_90w": "",
      "raw": "The Brazilian ex-president is accused of plotting a coup to cling to power, which he denies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af0bd3238973b03e67bcd48cf2d3be2573adb540",
      "title": "Pressure mounts on Bolsonaro as two out of five judges find him guilty",
      "url": "https://www.bbc.com/news/articles/ceq2lv20rp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:54:49.000Z",
      "summary_90w": "",
      "raw": "The Brazilian ex-president is accused of plotting a coup to cling to power, which he denies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Nepal anti-corruption protests explained",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:51:12.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned  deadly after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Why are young people protesting in Nepal and what are their demands?",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:51:12.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned  deadly after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "147efeea67aea93f276f37a14b2d4fea1b8c886f",
      "title": "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535813/supreme-court-trump-tariffs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T20:47:28.000Z",
      "summary_90w": "",
      "raw": "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43bec9a36dd105f8b49fde400eb6ca3af529a822",
      "title": "Here&#8217;s everything you need to know about preordering the 2025 iPhone lineup",
      "url": "https://www.theverge.com/tech/772748/iphone-17-pro-air-preorder-price-how-to-buy-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T20:46:00.000Z",
      "summary_90w": "",
      "raw": "The new iPhone Air starts at $999. | Image: The Verge\t\n\nApple announced its new iPhone 17 lineup during its “Awe dropping” event on Tuesday. As expected, the company introduced the iPhone 17, the flagship iPhone 17 Pro, and a bigger iPhone 17 Pro Max. There’s also a new addition to the lineup this year: the slimmed-down iPhone Air, which features a 6.5-inch ProMotion display and measures at just 5.6mm thick.\nBeyond the Air’s slimmer design, Apple’s latest iPhone lineup features a number of notable updates. The standard iPhone 17 now features a larger 6.3-inch with ProMotion and an adaptive refresh rate of up to 120Hz. Meanwhile, the Pro model has returned to an aluminum build, while adding the biggest battery of any iPhone yet. The iPhone Air and Pro models have a lot in common, including having a “plateau” bump on the back, which Apple says creates additional space for internal components, including a larger battery.\nThe iPhone 17, 17 Pro, 17 Pro Max, and Air start at $799, $1,099, $1,199, and $999, respectively, with preorders beginning Friday, September 12th, and shipments set to arrive the following Friday, September 19. Below, you’ll find more information about each new device, along with where you can place a preorder. We’ll update this post as carrier promotions roll in.\nWhere to preorder the iPhone Air\nThe iPhone Air finally made its debut after months of rumors. It’s Apple’s thinnest iPhone ever at 5.6mm thick, and features a 6.5-inch ProMotion display and a refresh rate of up to 120Hz. Apple says the design is its “most durable” yet, with a ceramic shield that encloses a titanium frame on both sides (also found in the iPhone 17 Pro). The device also sports a single 48MP fusion camera, along with an A19 Pro processor and Apple’s in-house C1X modem. Despite its thinner design, Apple says the Air features “all-day battery life,” with up to 27 hours of video playback, or 40 hours when the $99 iPhone Air MagSafe battery is attached.\nYou’ll be able to preorder the iPhone Air at Apple alongside the other models on Friday, September 12th, with the launch set to follow on Friday, September 19th. The Air starts at $999 with 256GB of storage, and goes all the way up to $1,399 for the 1TB model.\niPhone Air\nThe iPhone Air is Apple’s thinnest iPhone yet at 5.6mm, featuring a 6.5-inch ProMotion display, a 48MP fusion camera, and an 18MP front camera with Center Stage support. It also boasts the most Apple-designed chips in an iPhone: the A19 Pro, N1, and C1X.\n\nWhere to Buy:\n\n $999 at Apple (256GB)\n $1199 at Apple (512GB)\n $1399 at Apple (1TB)\n\nWhere to preorder the iPhone 17\nThe iPhone 17 is Apple’s latest entry-level smartphone. Like last year’s release, it borrows many of its best features from the previous-generation Pro line, including a larger 6.3-inch 120Hz ProMotion display. The device also features a new A19 processor and a dual-camera system that includes a dual 48MP fusion camera system that has a main camera and an ultra-wide camera. A new 18MP Center Stage front camera features a square sensor, allowing users to take high-quality landscape mode selfies without having to rotate their phone.\nThe phone is available in five colors (black, lavender, mist blue, sage, and white) and features a starting storage of 256GB. The iPhone 17 is set to launch on Friday, September 19th, with preorders beginning Friday, September 12th at Apple for $799 with 256GB of storage or $999 with 512GB of storage.\niPhone 17\nThe standard iPhone 17 has a 6.3-inch ProMotion display that can reach 3,000 nits of peak brightness, an A19 chip, and a 48MP dual camera system. It also features an 18MP Center Stage selfie camera with a square sensor, allowing users to take landscape selfies while holding the device vertically. \n\nWhere to Buy:\n\n $799 at Apple (256GB)\n $999 at Apple (512GB)\n\nWhere to preorder the iPhone 17 Pro and Pro Max\nThe iPhone 17 Pro and 17 Pro Max look different than last year’s pro models. While they keep the same 6.3-inch and 6.9-inch displays, respectively, Apple has made a few tweaks to the design. One of the first things you’ll probably notice is the plateau camera bump on the back, which houses a trio of 48MP fusion cameras. Both devices also boast an upgraded 18MP selfie camera with support for Center Stage, and a more powerful A19 Pro processor inside. The Pro models feature larger batteries than before, too, with the 17 Pro Max delivering the best battery life ever in an iPhone, according to Apple.\nThe iPhone 17 Pro and 17 Pro Max launch alongside the non-pro models on Friday, September 19th. The smaller Pro starts at $1,099 with 256GB of storage, while the 17 Pro Max starts at $1,199 with 256GB of storage, with preorders beginning Friday, September 12th. For the first time ever, Apple is offering a 2TB configuration of the 17 Pro Max for $1,999. You can nab a preorder for the 17 Pro from Apple; the 17 Pro Max is also available for preorder at Apple.\niPhone 17 Pro\nThe iPhone 17 Pro features a 6.3-inch OLED panel with a 120Hz refresh rate, and it’s powered by an A19 Pro chip. It features a 48MP triple camera system, plus a new “plateau” bar on the back, which Apple says creates additional space for internal components, including a larger battery.\n\nWhere to Buy:\n\n $1099 at Apple (256GB)\n $1299 at Apple (512GB)\n $1499 at Apple (1TB)\n\n\niPhone 17 Pro Max\nThe larger iPhone 17 Pro Max sports a 6.9-inch OLED screen and the best battery life ever in an iPhone. It has most of the same features as the smaller iPhone 17 Pro, though, but offers storage up to 2TB — a first in the iPhone line.\n\nWhere to Buy:\n\n $1199 at Apple (256GB)\n $1399 at Apple (512GB)\n $1999 at Apple (2TB)",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7033e036166090442064e64b23f6b07178d2813b",
      "title": "The iPhone Air’s battery pack is slim, but not as slim as the iPhone Air",
      "url": "https://www.theverge.com/apple-event/775048/iphone-air-magsafe-battery-pack-hands-on-photos",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T20:43:43.000Z",
      "summary_90w": "",
      "raw": "An iPhone Air with the MagSafe Battery attached.\t\n\nApple's chunky old MagSafe Battery Pack was beloved by a subset of iPhone owners, and now the company is bringing it back and slimming it down for the iPhone Air.\nI took a first look at the battery pack this afternoon, and it has a significantly slimmer design than the old version. This version of the battery pack is thinner and longer, stretching as far across the back of the phone as it can before bumping into the camera bar. Slimming it down reduces the potential battery size, but it makes the pack more appropriately balanced with the phone as a result. The new model didn't feel goofy to hold in the same way that the thick old version di …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4594d1aba0cfe8215d7c138089f20cd34937c619",
      "title": "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535806/supreme-court-trump-tariffs",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T20:43:10.000Z",
      "summary_90w": "",
      "raw": "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e91d45d92e13eeac88ffa27aa92e3fb153140722",
      "title": "Russian air strikes get deadlier and bigger, hitting Ukraine's very heart",
      "url": "https://www.bbc.com/news/articles/cgrqwpee05ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:20:36.000Z",
      "summary_90w": "",
      "raw": "Ukraine says Russia deliberately hit the main government building in Kyiv with a missile last Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c81a9c1c15a710e7d5c0c66b64ccc8df019ef3c",
      "title": "Apple’s creator-centric iPhone 17 Pro will make the vlogging camera obsolete",
      "url": "https://techcrunch.com/2025/09/09/apples-creator-centric-iphone-17-pro-will-make-the-vlogging-camera-obsolete/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T20:18:25.000Z",
      "summary_90w": "",
      "raw": "The iPhone camera has long checked all the boxes for anything that a casual user might need, making a digital camera obsolete for most consumers.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3e6d8c5172e3e7cf5fccd916dbb3464c47d2fe3",
      "title": "The iPhone Air is a hint at the iPhone’s future, which could include foldables",
      "url": "https://techcrunch.com/2025/09/09/the-iphone-air-is-a-hint-at-the-iphones-future-which-could-include-foldables/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T20:14:09.000Z",
      "summary_90w": "",
      "raw": "Over time, Air could perhaps become Apple's base model, while the Pro remains the upgraded version for power users and professionals. That would make room for new devices, like a foldable or whatever else comes next.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8753a891d1006440b4e41fe1ecece5786a335821",
      "title": "Microsoft to lessen reliance on OpenAI by buying AI from rival Anthropic",
      "url": "https://techcrunch.com/2025/09/09/microsoft-to-lessen-reliance-on-openai-by-buying-ai-from-rival-anthropic/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T20:11:30.000Z",
      "summary_90w": "",
      "raw": "The move to diversify its AI partnerships by tapping the shoulder of OpenAI’s top rival comes as the AI company also pursues independence from Microsoft with its own AI infrastructure and a potential LinkedIn competitor.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c8806bc79f439f27ac2774b287d7319b8a569d12",
      "title": "Hamas claims leadership survived Israeli attack in Doha, but confirms six deaths",
      "url": "https://www.bbc.com/news/articles/ced58zywdwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:04:54.000Z",
      "summary_90w": "",
      "raw": "Meanwhile, the White House says the Israeli strike \"does not advance Israel or America's goals\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eac05bc5d1f0dbb8da0b46393a76882c585126d6",
      "title": "Macron names ally Sébastien Lecornu as new French PM",
      "url": "https://www.bbc.com/news/articles/crmenp1k0mjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:01:29.000Z",
      "summary_90w": "",
      "raw": "It comes after a vote of confidence ousted François Bayrou after nine months in power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de7353c9a46bb96e135017d8e31da835679c92ff",
      "title": "British racing on strike - what's the background?",
      "url": "https://www.bbc.com/sport/articles/c626vk77r5ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:00:50.000Z",
      "summary_90w": "",
      "raw": "British horse racing is staging a one-day strike on Wednesday over a proposed rise in betting taxes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "82052195d9caaf9749e05b20e35bb43e7e0f482e",
      "title": "Here’s a first look at the iPhone 17",
      "url": "https://www.theverge.com/hands-on/772556/iphone-17-hands-on-first-look-apple-event-photos-features-price",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T19:56:06.000Z",
      "summary_90w": "",
      "raw": "Sage is looking sharp.\t\n\nApple's big fall event just wrapped up, and we rushed out of the Steve Jobs Theater to get our hands on the latest iPhones. Here's a look at the new iPhone 17, Apple's base model this year, which is joined by the thinner iPhone Air and beefier iPhone 17 Pro and Pro Max - there's no Plus this time around.\nThe first place to start is the rear camera. Not because a lot has changed here, but rather because it hasn't: while the iPhone 17 Pro and Air have both adopted new horizontal camera \"plateaus,\" the regular 17 has the same two vertically stacked lenses as last year. That means this is the only iPhone 17 that actually looks like the iPhone 1 …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d4c139595932b364975c9d74287679aa59b1b380",
      "title": "Apple unveils Apple Watch Series 11, Watch Ultra 3, and Watch SE 3",
      "url": "https://techcrunch.com/2025/09/09/apple-unveils-apple-watch-series-11-watch-ultra-3-and-watch-se-3/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T19:55:43.000Z",
      "summary_90w": "",
      "raw": "One perk is the Apple Watch Series 11 can alert you to possible hypertension. Apple says it plans to notify over 1 million people with undiagnosed hypertension in the first year alone.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f032c51f4673382f1b7d21758af26f9df237c96b",
      "title": "Iran and nuclear watchdog sign agreement seeking path to restart cooperation",
      "url": "https://www.npr.org/2025/09/09/g-s1-87860/iran-iaea-cooperation-agreement-egypt",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T19:43:13.000Z",
      "summary_90w": "",
      "raw": "Iran and the International Atomic Energy Agency signed an agreement in Cairo to pave the way for resuming cooperation, including on ways of relaunching inspections of Iran's nuclear facilities.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a29f9f0508c07958be555bbf91fd9ef2f54ef96c",
      "title": "Emmanuel Macron appoints his third prime minister in a year",
      "url": "https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T19:29:11.000Z",
      "summary_90w": "",
      "raw": "Sébastien Lecornu, a presidential ally, is tasked with bringing France’s divided parties together to pass a budget\n\nSébastien Lecornu, a close ally of Emmanuel Macron, has been appointed prime minister, tasked with consulting France’s divided political parties to try to find a consensus on the budget.\nThe 39-year-old began his political career in the traditional rightwing party of Nicolas Sarkozy before moving to Macron’s centre in 2017 and is seen as fiercely loyal to the president.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "97b242d53263a834f02d5bd5ee5c5135cfcd21a0",
      "title": "All of the iPhone 17 models compared",
      "url": "https://techcrunch.com/2025/09/09/all-of-the-iphone-17-models-compared/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T19:26:24.000Z",
      "summary_90w": "",
      "raw": "All four of the devices will be available to preorder on Friday and will be available on September 19.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c2c1a851eaf481c2b48e5df5c1886f8d916a96a1",
      "title": "Starmer condemns Israel’s airstrike on Qatar as No 10 denies prior knowledge of attack",
      "url": "https://www.theguardian.com/politics/2025/sep/09/starmer-condemns-israel-airstrike-on-qatar-as-no-10-denies-prior-knowledge-of-attack",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T19:16:18.000Z",
      "summary_90w": "",
      "raw": "‘Immediate ceasefire, the release of hostages and a huge surge in aid into Gaza’ only route to peace, says PM\nKeir Starmer has condemned Israel’s strike on Qatar before a meeting with the Israeli president in London on Wednesday.\nThe UK prime minister said the military strike, which targeted Hamas leaders stationed in Doha, was a violation of Qatar’s sovereignty and risked “further escalation across the region”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d5789de369e5b9fe46adb8045cfe230069a55374",
      "title": "Apple barely talked about AI at its big iPhone 17 event",
      "url": "https://www.theverge.com/apple-event/774963/apple-september-launch-event-ai-apple-intelligence",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T19:15:02.000Z",
      "summary_90w": "",
      "raw": "Apple's hotly-anticipated Apple event was chock-full of news about updates to AirPods, the Apple Watch, the new suite of iPhones, and more. But during the one-hour-and-fifteen-minute presentation, which was considerably shorter than usual, there was one notable buzzword missing from a good chunk of the fanfare: AI. \nAlthough CEO Tim Cook said during the livestream that the company was \"taking the biggest leap ever for iPhone,\" there were only cursory mentions of Apple Intelligence during the new iPhone unveiling. \nYes, the phones represent \"advancements in Apple silicon, hardware, and software,\" per Apple, meaning they're better for gaming …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4f07f7a74c370881c765f4006e6e917ae8721805",
      "title": "The iPhone 17 comes with Apple’s new in-house networking chip",
      "url": "https://www.theverge.com/news/774941/apple-iphone-17-n1-wi-fi-bluetooth-thread-networking-chip",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-09T19:10:19.000Z",
      "summary_90w": "",
      "raw": "Inside Apple’s splashy iPhone 17 lineup is a new chip: the N1. It’s a wireless networking chip made in-house by Apple, allowing its devices to support the latest networking technologies, including Wi-Fi 7, Bluetooth 6, and the smart home protocol Thread.\nApple previously used chips made by Broadcom to power Bluetooth and Wi-Fi within its smartphones. But now, Apple says the N1 chip will help boost the performance and reliability of features like AirDrop and Personal Hotspot. The iPhone 17, iPhone 17 Pro and Pro Max, and iPhone Air will all ship with the N1.\nIn addition to the N1, Apple revealed its next-gen C1X 5G modem, offering twice the speed of the C1 chip it launched with the iPhone 16E. The N1 and C1X join the growing list of in-house silicon developed by Apple, which also includes its line of processors made for the iPhone, Mac, Apple Watch, and AirPods.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab57dffe2f1e167f72af1643fea1f785c951095c",
      "title": "Bowen: Diplomacy in ruins after Israel strikes Hamas leaders in Qatar",
      "url": "https://www.bbc.com/news/articles/cm2zepgp5neo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T19:06:52.000Z",
      "summary_90w": "",
      "raw": "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed74370aeb95f219027563819cf1d87d89157b3a",
      "title": "Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks",
      "url": "https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T18:58:59.000Z",
      "summary_90w": "",
      "raw": "Hamas says six were killed but its leadership survived the attack, which the US says ‘does not advance Israel or America’s goals’\n\nMiddle East crisis – live updates\n\nIsrael has launched a strike on Hamas officials meeting in Qatar’s capital, Doha, reportedly including the group’s chief ceasefire negotiator, in an attack the White House said “does not advance Israel or America’s goals”.\nHamas said six people had been killed, including the son of its exiled Gaza chief, Khalil al-Hayya. It said its top leadership, including the negotiations team, had survived.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec2f9e7540277a9aa6e103a9bbdbdeb185d374d4",
      "title": "The MAHA plan for healthier kids includes 128 ideas, but few details",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/09/nx-s1-5534412/rfk-maha-report-childrens-health",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T18:55:23.000Z",
      "summary_90w": "",
      "raw": "The Make America Healthy Again commission is proposing more than 100 moves to address the root causes of childhood chronic disease. Critics say other Trump administration moves contradict the goals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dec57d306b48744bf8cf0ee91cade1da0ad87d0f",
      "title": "Apple’s new iPhone 17 devices don’t have an AI-powered Siri yet. It doesn’t matter.",
      "url": "https://techcrunch.com/2025/09/09/apples-new-iphone-17-devices-dont-have-an-ai-powered-siri-yet-it-doesnt-matter/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T18:50:09.000Z",
      "summary_90w": "",
      "raw": "Until now, Apple has only released what could be considered baseline AI features for its devices, like AI writing tools, summarization, generative AI images, live translation, visual search, and Genmoji, among others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b929e8effb57373fe2d7ba3e2ffa214151247996",
      "title": "iPhone 17, iPhone Air, AirPods Pro 3, and everything else announced at Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/09/iphone-17-iphone-air-airpods-pro-3-and-everything-else-announced-at-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T18:44:26.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what was announced at this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f86613d19e6c96bb64b3feba42c20f23887e8cc8",
      "title": "Heavy rain and wind forecast as unsettled weather returns to UK",
      "url": "https://www.bbc.com/weather/articles/cy4r7p93r42o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T18:42:40.000Z",
      "summary_90w": "",
      "raw": "Wet and windy weather will develop across the UK this week as Sarah Keith-Lucas explains.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "07a105bfca57e6f4b361ac3c987611355acf419c",
      "title": "Gregg Wallace launches legal action against BBC",
      "url": "https://www.bbc.com/news/articles/cdr60nvd4y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T18:39:55.000Z",
      "summary_90w": "",
      "raw": "The TV presenter was sacked in July after a report upheld more than 40 allegations against him.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f410d30a71016ebb5e28543a4de6d9e27cb5d01",
      "title": "Apple debuts the $999 ultra-thin iPhone Air",
      "url": "https://techcrunch.com/2025/09/09/apple-debuts-the-999-ultra-thin-iphone-air/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T18:26:42.000Z",
      "summary_90w": "",
      "raw": "This replaces the Plus model in the company’s 2025 lineup, following the underperformance of the iPhone 16 Plus last year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a7957e2d0dc5ca7bcece111af6a35e99d7111bf5",
      "title": "Apple launches iPhone 17 Pro with major camera upgrades",
      "url": "https://techcrunch.com/2025/09/09/apple-launches-iphone-17-pro-with-major-camera-upgrades/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T18:14:13.000Z",
      "summary_90w": "",
      "raw": "Apple launched the iPhone 17 Pro and the iPhone 17 Pro Max today with a new design and an upgraded camera system. The devices are powered by the new A19 Pro chipset and have a larger battery, Apple said. Plus, it noted that eSIM-only models will have a slightly larger battery as compared to Pro […]",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What's in the book of birthday messages to Epstein",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T18:08:42.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "affece646e478f5f0ffadab3730f29d1bea90de3",
      "title": "iPhone 17 Air will be eSIM only worldwide",
      "url": "https://techcrunch.com/2025/09/09/iphone-17-air-will-be-esim-only-worldwide/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:57:51.000Z",
      "summary_90w": "",
      "raw": "Apple managed to cram a lot of tech into a 5.5 mm-thick design, but at the expense of a physical SIM tray.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3e8da303c0ae690bcabf79ae59862e52da45f4e2",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "url": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:45:02.000Z",
      "summary_90w": "",
      "raw": "Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged\nA Canadian beekeeper has described fending off thousands of “robber bees” as they raided her shop in a brazen attempt to steal honey.\nChristine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c35d741bac4cf2bb1a9fe2b27aa76b9c205905c2",
      "title": "60 years later, Sandy Koufax's perfect game is still amazing",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5533220/sandy-koufax-perfect-game-60-years-dodgers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T17:39:48.000Z",
      "summary_90w": "",
      "raw": "Tuesday marks 60 years since Sandy Koufax threw a perfect game at Dodger Stadium. The 1-0 victory over the Chicago Cubs is still considered one of the best games in baseball history.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eba10ca5c7b72488b89164acc832a12e9c216922",
      "title": "Mitchum deodorant says sorry after users complain of itchy, burning armpits",
      "url": "https://www.bbc.com/news/articles/cly0gkrqq7ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:35:26.000Z",
      "summary_90w": "",
      "raw": "Mitchum said a change in the manufacturing process had affected some of its roll-on products after users complained of soreness.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b7982ad48372c7d28378ea1a6705eb0870d197b",
      "title": "Apple launches iPhone 17 with a 120 Hz display",
      "url": "https://techcrunch.com/2025/09/09/apple-launches-iphone-17-with-a-120hz-display/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:33:56.000Z",
      "summary_90w": "",
      "raw": "The iPhone 17 has a slightly bigger screen at 6.3 inches as compared to the 6.1-inch screen of the iPhone 16. The display is getting an upgrade with ProMotion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "debf659501de676b744308ff8be82d1509a20bd2",
      "title": "Ethiopia inaugurates Africa's biggest dam amid regional tensions",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5534227/ethiopia-dam-sudan-egypt",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T17:32:58.000Z",
      "summary_90w": "",
      "raw": "Ethiopia opens Africa's largest hydropower project, the Blue Nile's Grand Ethiopian Renaissance Dam — a milestone that's sparking alarm in neighboring Sudan and Egypt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c83a9f83dd41b99bd765f1ee56d3515f896e189",
      "title": "Ramp says it has hit $1B in annualized revenue",
      "url": "https://techcrunch.com/2025/09/09/ramp-says-it-has-hit-1b-in-annualized-revenue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:23:12.000Z",
      "summary_90w": "",
      "raw": "Ramp answered any lingering questions as to why investors valued the company at $22.5 billion just 45 days after they valued it at $16 billion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cc0a64de2bf79c5536121600321827c45ba5f55a",
      "title": "AirPods Pro 3 arrive with heart-rate sensing and live translation using Apple Intelligence",
      "url": "https://techcrunch.com/2025/09/09/airpods-pro-3-arrive-with-heart-rate-sensing-and-live-translation-using-apple-intelligence/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T17:16:52.000Z",
      "summary_90w": "",
      "raw": "It’s been three years since Apple refreshed the AirPods Pro line, releasing the Pro 2 model in 2022. The new AirPods Pro will be priced at $249.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "73f065a0ff97169913df5471d003c050292c6048",
      "title": "More than a dozen robbers storm jewellery shop in California",
      "url": "https://www.bbc.com/news/videos/c1edl9qppelo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:11:04.000Z",
      "summary_90w": "",
      "raw": "An 88-year-old jewellery store owner in San Jose is recovering after being assaulted during a violent smash-and-grab robbery.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "257117ff1f8bc46c80d63903b63545b2d73efb2f",
      "title": "Von der Leyen under growing pressure to take tougher line with Israel",
      "url": "https://www.theguardian.com/world/2025/sep/09/von-der-leyen-under-growing-pressure-to-show-leadership-over-israel-gaza-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:09:44.000Z",
      "summary_90w": "",
      "raw": "EU Commission president urged to ‘show leadership’ and preserve bloc’s credibility amid catastrophe in Gaza\nThe European Commission president, Ursula von der Leyen, is under growing pressure from MEPs to “show leadership” and preserve the EU’s political credibility by taking a tougher approach to Israel’s government over the humanitarian catastrophe in Gaza.\nVon der Leyen is expected to refer to the EU’s role on the world stage in her annual “state of the union” speech to the European parliament on Wednesday, where she will set out her agenda for the year ahead.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "12ee62380315570c9993a99b483a6cb3b2731a19",
      "title": "Nepal parliament set on fire after PM resigns over anti-corruption protests",
      "url": "https://www.bbc.com/news/articles/c0m4vjwrdwgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:57:48.000Z",
      "summary_90w": "",
      "raw": "KP Sharma Oli steps down amid Nepal's worst unrest in decades, with at least 22 deaths reported in clashes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b3ad59564cda6227ea2788286b393cbd8eb1579d",
      "title": "Mandelson called Epstein 'best pal' in birthday message",
      "url": "https://www.bbc.com/news/articles/cwy9dwe50leo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:53:04.000Z",
      "summary_90w": "",
      "raw": "The description is contained an alleged 50th \"birthday book\" given to the disgraced financier that has been released by US lawmakers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24bc0cf7044d0f4bbbd46962fd8f96ed7cf4cacd",
      "title": "Asylum seekers speak to BBC from inside house facing local opposition",
      "url": "https://www.bbc.com/news/videos/c8exwjkglzro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:47:55.000Z",
      "summary_90w": "",
      "raw": "Wigan has no asylum hotels but 900 homes in multiple occupation (HMOs), some of which house asylum seekers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "80cacd185f401482f16a89cf540cc816cf4c055e",
      "title": "England's NHS trust league tables revealed - find out where yours ranks",
      "url": "https://www.bbc.com/news/articles/cq8eqxlypv7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:45:32.000Z",
      "summary_90w": "",
      "raw": "Critics question the usability of new league tables meant to inform the public and let them exercise choice.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d8367446560e74fd3d933da3af90ca689377839",
      "title": "CCTV captures Israeli attack on Hamas leaders in Doha",
      "url": "https://www.bbc.com/news/videos/c1dq39204wro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:44:34.000Z",
      "summary_90w": "",
      "raw": "Qatar, which has mediated indirect negotiations between Israel and Hamas, calls the attack a \"blatant violation\" of international law.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b7ee981e5d692198813df07d93a496bfc29294f4",
      "title": "London Tube strike enters third day with more disruption expected",
      "url": "https://www.bbc.com/news/articles/cvgr9x145eyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:42:43.000Z",
      "summary_90w": "",
      "raw": "RMT workers on the London are continuing their walk out in a bid for better pay and conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Plans to cool Arctic using geo-engineering are dangerous, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c5155a1440301af96917e2a8bcc0fffe72e7a2b",
      "title": "Nvidia unveils new GPU designed for long-context inference",
      "url": "https://techcrunch.com/2025/09/09/nvidia-unveils-new-gpu-designed-for-long-context-inference/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T16:35:47.000Z",
      "summary_90w": "",
      "raw": "Nvidia's relentless development cycle has resulted in enormous profits for the company, which brought in $41.1 billion in data center sales in its most recent quarter.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ce7aad2b2c343ad6f6d8291cc1fc444ef12d831e",
      "title": "Tesla is seeking permits to offer ride-hail services at Silicon Valley airports",
      "url": "https://techcrunch.com/2025/09/09/tesla-is-seeking-permits-to-offer-ride-hail-services-at-silicon-valley-airports/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T16:26:38.000Z",
      "summary_90w": "",
      "raw": "It's a precursor to the company's larger ambitions of operating a full-blown robotaxi service in the state -- something it's still yet to prove can work at scale in Texas.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88e204dd6ac838dcd342efa2af5d7c28f1e91cff",
      "title": "BBC boss Tim Davie robust with MPs after summer of scandal",
      "url": "https://www.bbc.com/news/articles/cewnx7y2z42o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T16:20:05.000Z",
      "summary_90w": "",
      "raw": "BBC culture and media editor Katie Razzall says Tim Davie gave a \"sure-footed\" performance to MPs on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23860b3f9f961d5b7f8a07f1a387073adbdf2088",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "url": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:19:28.000Z",
      "summary_90w": "",
      "raw": "Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts\nEthiopia has inaugurated Africa’s largest hydroelectric dam, a project that could transform the country’s energy sector but may also aggravate tensions with neighbouring Egypt.\nState media showed the Ethiopian prime minister, Abiy Ahmed, touring the site of the Grand Ethiopian Renaissance Dam (GERD) in Guba district with the Kenyan president, William Ruto, the Somali president, Hassan Sheikh Mohamud, and the African Union chairperson, Mahmoud Ali Youssouf.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b79f1c7441cbd9c14a7d3d2959f0b5f4661a902",
      "title": "Michigan judge dismisses charges against 15 pro-Trump 'fake electors'",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535584/michigan-fake-electors-trump-charges-dropped",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T16:13:58.000Z",
      "summary_90w": "",
      "raw": "A Michigan judge has dismissed criminal charges against 15 people who signed false certificates saying Donald Trump won the state's electoral votes in 2020.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ad76c61b575e16df457b8e69ca4e4cbfa5b8e4b",
      "title": "Tesla revamps the Megapack in attempt to reverse its declining storage business",
      "url": "https://techcrunch.com/2025/09/09/tesla-revamps-the-megapack-in-attempt-to-reverse-its-declining-storage-business/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T16:10:55.000Z",
      "summary_90w": "",
      "raw": "The new battery product, known as Megapack 3, is a bid to lure utilities and data center developers that are desperate for power.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "51e10162b815d54805a3f5b63a8a5fd50b363c8f",
      "title": "At least nine pigs’ heads found outside mosques in Paris region",
      "url": "https://www.theguardian.com/world/2025/sep/09/pigs-heads-found-mosques-paris-region",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:03:29.000Z",
      "summary_90w": "",
      "raw": "Police do not rule out possibility of finding more as incidents raise alarm over increase of anti-Muslim hatred \nAt least nine pigs’ heads were found outside several mosques in the Paris region on Tuesday, the city’s police chief said, prompting alarm over rising anti-Muslim hatred.\n“Pigs’ heads have been left in front of certain mosques ... Four in Paris and five in the inner suburbs,” Laurent Nuñez told a press conference, adding that officers were not “ruling out the possibility of finding more”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d054bb6fba36ae5a9e03f5280bb3183ac3ac9744",
      "title": "The Gaza family torn apart by IDF snipers from Chicago and Munich",
      "url": "https://www.theguardian.com/world/2025/sep/09/the-gaza-family-torn-apart-by-idf-snipers-from-chicago-and-munich",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:50:13.000Z",
      "summary_90w": "",
      "raw": "Five-month investigation reveals how four members of one family were shot and killed in a single day and highlights a pattern in which Israeli troops target unarmed civilians\nDaniel Raab shows no hesitation as he watches footage of 19-year-old Salem Doghmosh crumpling to the ground beside his brother in a street in northern Gaza.\n“That was my first elimination,” he says. The video, shot by a drone, lasts just a few seconds. The Palestinian teenager appears to be unarmed when he is shot in the head.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "033f6c3a0453a4ad353120f19c76d89f4cccd58a",
      "title": "Smart ring maker Oura’s CEO addresses recent backlash, says future is a ‘cloud of wearables’",
      "url": "https://techcrunch.com/2025/09/09/smart-ring-maker-ouras-ceo-addresses-recent-backlash-says-future-is-a-cloud-of-wearables/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-09T15:37:58.000Z",
      "summary_90w": "",
      "raw": "Oura CEO Tom Hale is trying to set the record straight about the smart ring maker's partnership with the Department of Defense (DoD) and data miner Palantir, which is used by defense, intelligence, and law enforcement agencies in the United States and elsewhere.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "915ebd81df01ad0174a3a261ac49eb5a1d1be4fc",
      "title": "Prince Harry donates £1.1m to Children in Need",
      "url": "https://www.bbc.com/news/articles/ckg2xknwyp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T15:25:12.000Z",
      "summary_90w": "",
      "raw": "Prince Harry offers support to a project tackling youth violence in Nottingham.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e6d2b2f035cf173b33c0ae11878437efd5889f96",
      "title": "Slashing migration would actually lead to higher house prices in Australia. Here’s why",
      "url": "https://www.theguardian.com/business/2025/sep/10/slashing-migration-would-actually-lead-to-higher-house-prices-in-australia-heres-why",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:00:46.000Z",
      "summary_90w": "",
      "raw": "Economic modelling reveals the effects of eliminating migration for a decade on growth, the workforce and the budget\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThink closing our borders would fix the housing crisis? Think again.\nEliminating migration for the coming decade would actually leave property prices 2.3% higher by the mid-2030s, according to economic modelling by KPMG; and there are other negative economic consequences too.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5514135c085b69262bd873673ff4792934f187ed",
      "title": "Victorian Labor targets affluent Melbourne suburbs for rezoning to allow 16-storey apartment towers",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/victorian-labor-targets-affluent-melbourne-suburbs-for-rezoning-to-allow-16-storey-apartment-towers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:00:46.000Z",
      "summary_90w": "",
      "raw": "Under the plan, the state government will seize planning controls for the designated areas – near train and tram stops – from local councils\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAffluent Melbourne suburbs such as Hampton, Hawthorn and Kew could be rezoned to allow apartment towers of up to 16 storeys, according to new draft maps released by the Victorian government.\nThe premier, Jacinta Allan, and the planning minister, Sonya Kilkenny, will on Wednesday release the maps showing proposed heights and boundaries for 25 of the government’s 50 activity centres, which were first announced in October 2024.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf4ceef2db24dfebd362fa722a8d92a51789bf91",
      "title": "Pocock questions Bishop’s ANU leadership as pressure builds for chancellor and vice chancellor to step down",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/pocock-questions-bishops-anu-leadership-as-pressure-builds-for-chancellor-and-vice-chancellor-to-step-down",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T15:00:45.000Z",
      "summary_90w": "",
      "raw": "Independent senator claims there was ‘no faith’ in leadership of Genevieve Bell or Julie Bishop among university staff\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nDavid Pocock has called on the federal government to urgently intervene into the leadership crisis at the Australian National University as pressure mounts on the chancellor and vice-chancellor to resign.\nIt comes after the independent senator told ABC earlier on Tuesday he hoped to see “some change in leadership at the top” of ANU, following a tumultuous year including redundancies, proposed course closures and allegations of a toxic work culture.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b7bbe56c335a5284801381e0fb0268841ce0acb",
      "title": "'The Office' creators deliver 'The Paper,' a sharp mockumentary about journalism",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535137/the-office-creators-deliver-the-paper-a-sharp-mockumentary-about-journalism",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T14:54:18.000Z",
      "summary_90w": "",
      "raw": "The issues facing journalism these days — from online clickbait to corporate interference — run throughout The Paper. But it's primarily a comedy, with characters and actors that will win you over.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2cbc52a60c278440b9feaacfd22134c511670f48",
      "title": "Russian air strike kills 24 in pension queue, Ukraine says",
      "url": "https://www.bbc.com/news/articles/c1jz08j8313o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T14:36:46.000Z",
      "summary_90w": "",
      "raw": "The attack targeted the eastern village of Yarova, officials say, a few kilometres from the front line.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5d3fe54eb2166cf9b3ac8d3643b89d908d7232c6",
      "title": "Spanish government moves to ban smoking on bar terraces",
      "url": "https://www.theguardian.com/world/2025/sep/09/spanish-government-moves-ban-smoking-bar-terraces",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:36:29.000Z",
      "summary_90w": "",
      "raw": "Tobacco law would also prohibit minors from using vapes and stop sale of single-use electronic cigarettes\nThe Spanish government has approved a draft tobacco law that would ban smoking and vaping on bar and restaurant terraces, prohibit minors from using vapes and related products, and end the sale of single-use electronic cigarettes.\nThe legislation, which was signed off by the cabinet on Tuesday morning, is intended to “reinforce protections on people’s health and to adapt the law to consumption patterns and to the tobacco-product market”, according to the health ministry.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "400f674fecbc0511aeac11938cd9f483e70d8bc2",
      "title": "Surprise as Ivory Coast's ex-first lady cleared to contest presidency",
      "url": "https://www.bbc.com/news/articles/cy4jpjqy9wlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T14:33:25.000Z",
      "summary_90w": "",
      "raw": "Simone Gbagbo will run against President Alassane Ouattara, who is seeking a controversial fourth term.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54c811e354dd58ba41b5872e4c20b6f6b1979314",
      "title": "Dozens of DR Congo mourners killed in attack linked to jihadist group",
      "url": "https://www.bbc.com/news/articles/czdj4qgm4d9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T14:30:05.000Z",
      "summary_90w": "",
      "raw": "A funeral ceremony was being held in a village when the night-time assault took place, officials say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows annual hiring was overstated by 911,000 jobs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dca2ecd0afbc054bf1d12216cba5a31ed1155838",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "url": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:16:54.000Z",
      "summary_90w": "",
      "raw": "ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery\nAn international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.\nThe ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.\nReuters and Agence France-Presse contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3dae5db8ecaa3c4d1cf2664358ae0f482b04fc10",
      "title": "Who could replace Angela Rayner as Labour deputy leader?",
      "url": "https://www.bbc.com/news/articles/c8jm9lk19v3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T14:08:09.000Z",
      "summary_90w": "",
      "raw": "The winning candidate - voted for by Labour members - will be announced on 25 October.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31bd01bf9c60501d44aa088c1b19295afecb7b55",
      "title": "France to get third PM in a year as Bayrou resigns after confidence vote – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:02:44.000Z",
      "summary_90w": "",
      "raw": "Emmanuel Macron to name successor ‘within days’ as political crisis grips France\n\nFrance to get third PM in a year\n\nLithuania has also said it will strengthen its borders with Belarus and Russia during the Zapad military exercise, the country’s border guard said today.\nThe authorities said they would carry “even more active border monitoring, patrols, and other border control measures,” looking for any potential border violations and provocations against Lithuania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36b2ccbe619eb773df29b79a84dff8a8e8527486",
      "title": "Proposed ‘nation-leading’ NSW childcare reforms to include $500,000 fines",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/proposed-nation-leading-nsw-childcare-reforms-to-include-500000-fines",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:01:43.000Z",
      "summary_90w": "",
      "raw": "Greens welcome Minns government’s ‘bare-minimum’ changes but say more work is needed to restore faith in the sector\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nLarge childcare providers found in breach of safety directives will face $500,000 fines – a 900% increase – under new laws to be introduced by New South Wales parliament on Wednesday.\nThe proposed legislation will grant greater powers to the early childhood regulator to suspend educators and revoke quality ratings in a suite of measures addressing grave concerns about safety in the sector.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "365cd288398b5d86d04dbd8c81a918383729c3d8",
      "title": "Israel tried to kill Hamas leaders in a strike in Qatar. Trump disapproves",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535210/israel-qatar-hamas-doha",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-09T13:47:50.000Z",
      "summary_90w": "",
      "raw": "The White House expressed disapproval with the attack, saying a unilateral strike in a country that's a U.S. ally \"does not advance Israel or America's goals,\" and tried to tip off Qatar in advance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32db2407a94e414f83c0b83b96fc7c1cdc34389d",
      "title": "White House denies Trump's alleged birthday message to Epstein is authentic",
      "url": "https://www.bbc.com/news/articles/cvgqnn4ngvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T12:48:55.000Z",
      "summary_90w": "",
      "raw": "The message purportedly written by Trump is inside a 238-page book released by a House committee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b3984b0d0eb2e510cdc51e291e349ccf3bdaca9",
      "title": "Israeli military orders all Gaza City residents to evacuate ahead of ground assault",
      "url": "https://www.bbc.com/news/articles/cvg47kvld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:48:49.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Netanyahu says recent strikes on high-rises are \"only the beginning of the main, intensive operation\" to capture the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec005248a3896bda17a53ced282d69a827255940",
      "title": "ICC hears war crimes case against Ugandan rebel leader",
      "url": "https://www.bbc.com/news/articles/c1kwe02vyvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:31:06.000Z",
      "summary_90w": "",
      "raw": "This is the court's first-ever confirmation of charges hearing without the accused present.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1097d90ff1d8a06a7f69bf485cef26b33abb0a4a",
      "title": "Here's what happens when private equity buys homes in your neighborhood",
      "url": "https://www.npr.org/sections/planet-money/2025/09/09/g-s1-87699/private-equity-corporate-landlords",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T11:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes rents go down and neighborhood diversity go up? Corporate landlords. But they also make it harder to own for yourself.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drone, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:08:50.000Z",
      "summary_90w": "",
      "raw": "Global Sumud Flotilla says a fire was started but Tunisian authorities deny that a drone was involved.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7f0fef5926ad08fac48daea9ee918216942349fa",
      "title": "Murdochs reach deal in succession battle over media empire",
      "url": "https://www.bbc.com/news/articles/cn825x71g4do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T10:01:36.000Z",
      "summary_90w": "",
      "raw": "Lachlan Murdoch will retain control of the conservative Fox and News Corp empire under the deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9378e09d87d3a68b88f425c5d0382e5eee98f44a",
      "title": "At least 10 dead after train crashes into bus in Mexico",
      "url": "https://www.bbc.com/news/articles/c98elewrepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T09:40:09.000Z",
      "summary_90w": "",
      "raw": "An investigation is under way after a freight train hit a bus as it tried to cross railway tracks.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4908a9e47356afa8eac588b20a065e2900a7b343",
      "title": "Norway's left clinches vote win as populist right surges into second place",
      "url": "https://www.bbc.com/news/articles/cq65255l27qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T07:38:58.000Z",
      "summary_90w": "",
      "raw": "Labour has a chance of forming a narrow majority if it secures the support of four smaller parties on the centre left.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8d88eadd40bf7553df55ac7237b44d4b8733ff7",
      "title": "Thai court rules ex-PM Thaksin must serve one year in jail",
      "url": "https://www.bbc.com/news/articles/cly7k2g37g4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:41:09.000Z",
      "summary_90w": "",
      "raw": "The Supreme Court ruling is yet another blow to the influential Shinawatra political dynasty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9448aa73221d75321a7cae4cc340fbb464b4943",
      "title": "NZ 'suitcase murder': Anti-depressants found in children's bodies",
      "url": "https://www.bbc.com/news/articles/c1wgqpx3q1go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T06:07:00.000Z",
      "summary_90w": "",
      "raw": "A jury heard Hakyung Lee killed her children in an attempted mass suicide after her husband's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d2490d90ed4ec14bc10563301cb4cba1d28932c4",
      "title": "First photos of site where NZ bushman hid children released",
      "url": "https://www.bbc.com/news/articles/cj4y9ev2rw4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T04:32:15.000Z",
      "summary_90w": "",
      "raw": "Police also found a stash of firearms and ammunition at the campsite surrounded by dense vegetation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T04:30:18.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "56bb7bae5d6fad8a89cc779a183e2d37e0cfa7c1",
      "title": "Images of Tom Phillips’ remote campsite revealed a day after fugitive father shot dead by New Zealand police",
      "url": "https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:06:31.000Z",
      "summary_90w": "",
      "raw": "After four years on the run with their father, Phillips’ three children have all been located and are ‘doing well under the circumstances’, say authorities\nPolice in New Zealand have released images and given details of the campsite where two of fugitive Tom Phillips’ children were found, after their father was shot and killed by police on Monday.\nPhillips had spent nearly four years hiding in the wilderness with his children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio. A police officer is recovering in hospital after being shot in the head by Phillips with a high-powered rifle in the standoff. About 11 hours after Phillips was killed, two of his children were found safe and well at the campsite in Waitomo. It is understood the third child was with Phillips at the time of the shooting.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d033bcc9ad5bb685bd656044f345a264761ab17",
      "title": "Ferrari chair to do community service over tax case",
      "url": "https://www.bbc.com/news/articles/c8d7q99yd06o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T23:36:20.000Z",
      "summary_90w": "",
      "raw": "John Elkann and two of his siblings will pay €183m to settle an Italian inheritance tax dispute.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6dade64ae52995623a9e2f23eec4082f04e47baa",
      "title": "Supreme Court lifts limits on  LA immigration raids",
      "url": "https://www.bbc.com/news/articles/c784697j2v8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T21:41:45.000Z",
      "summary_90w": "",
      "raw": "US top court says that immigration agents can stop people based solely on their race, language or job.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e04a43f51845386c2aa2ce3b2add249a232808b5",
      "title": "Boris Johnson was paid £240,000 after Maduro meeting, invoice shows",
      "url": "https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T18:12:48.000Z",
      "summary_90w": "",
      "raw": "Johnson’s office sent invoice to hedge fund manager, which was paid, weeks after meeting Venezuelan leader last year\n\nRevealed: how Boris Johnson traded PM contacts for global business deals\n\nFrom a private jet somewhere over the Caribbean Sea in February last year, Boris Johnson called his old political adversary David Cameron, then the foreign secretary, to notify him of a visit.\nJohnson had taken a day out from a family holiday in the Dominican Republic for an unlikely meeting with the leftwing president of Venezuela, Nicolás Maduro, a man whom Johnson, when in office, had likened to a “dictator of an evil regime”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8cd7c4e39cfd0f683f4b2cf54a484029416907d1",
      "title": "Hamas discussing US 'ideas' for Gaza ceasefire after Trump's 'last warning'",
      "url": "https://www.bbc.com/news/articles/cn0rxl7jwwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T18:08:14.000Z",
      "summary_90w": "",
      "raw": "Hamas says it received \"some ideas\" from the US through mediators on how to reach a Gaza ceasefire deal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e8ffabc41a1ce9e91f468dc28e2cd39800eb6703",
      "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
      "url": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T16:44:16.000Z",
      "summary_90w": "",
      "raw": "President touted contest in Buenos Aires province – 40% of electorate – as ‘life or death battle’ but won only 34% of vote\nArgentina’s president, Javier Milei, has suffered his worst electoral defeat since taking office, as he faces his administration’s most serious corruption scandal and signs that the economy is slowing.\nIn local legislative elections on Sunday for Buenos Aires province – home to almost 40% of the country’s electorate – the coalition led by the self-styled anarcho-capitalist was beaten by the opposition by 47% to 34%.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf8c157d26916af75c042b4ff5a1bc9aefc11af3",
      "title": "Six Israelis killed by Palestinian gunmen at Jerusalem bus stop",
      "url": "https://www.bbc.com/news/articles/cr70ny0l7vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T13:09:39.000Z",
      "summary_90w": "",
      "raw": "Israeli police say two gunmen were killed after the attack, which was one of the deadliest in the city in years.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8090bee0b7bbd41ad9c10cbe8d3aa6af2166b744",
      "title": "World Cup ticket sales are about to begin. Scoring them may not be easy — or cheap",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529273/fifa-world-cup-2026-ticket-sales",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "FIFA is set to launch the first window of regular ticket sales for the 2026 World Cup on Wednesday. Brace yourself: because they may not be easy to get — or cheap.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "92c6e3934c891244053cede02b47ac3dd9bb0119",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T07:01:03.000Z",
      "summary_90w": "",
      "raw": "Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said\nA fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.\nThe whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he fled into the Waikato wilderness with his children Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2c05487bf4009e970ec540a06f48f1e758431b5",
      "title": "Fugitive father shot dead by police – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T06:17:21.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed. Our full report is here: Tom Phillips shot dead after attempted burglary, NZ police confirm\nThe mayor of Waitomo, John Robertson, told the Guardian this morning’s events were the worst possible outcome for the community.\n“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.\nSo it’s just devastating news. Really the worst outcome we could have expected.\nNo day that goes by that I don’t think about all four of them.\nIt hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "560ce79c5ad9c75d0a13333406a1f6952e60334e",
      "title": "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5533207/carlos-alcaraz-trump-us-open-tennis-rolex",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T00:37:01.000Z",
      "summary_90w": "",
      "raw": "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dbad04708a3dc7972c447fc4ea8545ac9955e61d",
      "title": "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "url": "https://www.bbc.com/news/articles/c5yqg0rln74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-07T23:14:55.000Z",
      "summary_90w": "",
      "raw": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}