{
  "version": "1757528381203",
  "generatedAt": "2025-09-10T18:19:41.203Z",
  "items": [
    {
      "id": "7aaf7d2d8b9f38e144f9e2f2b0783864316b33bf",
      "title": "Poland says it shot down Russian drones after airspace violation",
      "url": "https://www.bbc.com/news/articles/c147065pzdzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T18:15:03.000Z",
      "summary_90w": "",
      "raw": "Nato jets were deployed to respond to drones that entered Polish airspace during Russian strikes on Ukraine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74f3528a701a386a6b900c3fa8104322368cfdd3",
      "title": "About 93% of pilots admit napping during flights in German survey",
      "url": "https://www.theguardian.com/world/2025/sep/10/about-93-of-pilots-admit-napping-during-flights-in-german-survey",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T18:08:51.000Z",
      "summary_90w": "",
      "raw": "Pilots’ union says napping during flights has become a ‘worrying reality’ for its members due to rising fatigue\nA German pilots’ union has said that napping during flights has become a “worrying reality” for its members, as it sounded the alarm over “increasing fatigue” in the sector.\nThe Vereinigung Cockpit union said it had carried out a survey of more than 900 pilots in recent weeks, which found that 93% of them admitted to napping during a flight in the past few months.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "86930cf8dcb8d0002a141956106ee004328f5e28",
      "title": "Poland dismisses Russia’s claim drone incursion was unintentional as Ukraine calls for joint European air defence system – live",
      "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T18:07:53.000Z",
      "summary_90w": "",
      "raw": "Poland’s deputy PM said Russian drones ‘did not veer off course’ but deliberately targeted Poland; Zelenskyy says Europe needs effective air shield\n\nFull report: Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to drone incursion\n\nLubelskie region governor Krzysztof Komorski is leading an emergency meeting with the police this morning. \n\r\n In a post on X, he urged residents to follow the guidance from the relevant authorities.\nPrime minister Donald Tusk meanwhile said in his latest update that he is in “constant contact” with Nato secretary general Mark Rutte.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f0c530c0888212e92b4f6a6371a20c41c35dc20d",
      "title": "Anti-Islamic biker gang members hired to run security at controversial Gaza aid sites",
      "url": "https://www.theguardian.com/world/2025/sep/10/anti-islamic-biker-gang-infidels-mc-gaza-aid-sites",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T18:00:45.000Z",
      "summary_90w": "",
      "raw": "More than 10 Infidels MC members deployed to sites run by US- and Israeli-backed Gaza Humanitarian Foundation\nSenior members of an anti-Islamic biker gang have been hired by US contractors and deployed to Gaza to oversee security at food distribution sites backed by the US and Israeli governments, according to a BBC investigation.\nThe investigation found that more than 10 members of Infidels MC, a US biker gang that uses the Crusader cross as its symbol and whose members have anti-Islamic tattoos, have been hired by UG Solutions and deployed to food aid sites run by the Gaza Humanitarian Foundation. According to the BBC, seven members of the gang are in “senior positions overseeing [GHF] sites”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "45e47eeba17b40783853f42f78d97ee8b27c5e8d",
      "title": "YouTube’s multi-language audio feature for dubbing videos rolls out to all creators",
      "url": "https://techcrunch.com/2025/09/10/youtubes-multi-language-audio-feature-for-dubbing-videos-rolls-out-to-all-creators/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:58:32.000Z",
      "summary_90w": "",
      "raw": "YouTube's multi-language audio feature is rolling out to millions of creators, helping them reach a wider global audience.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1d9e57d3268116d7a5b6b0269f71bf404945ab10",
      "title": "Tube strike union boss wants 'summit' with mayor",
      "url": "https://www.bbc.com/news/articles/c4gwlen7wn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T17:56:53.000Z",
      "summary_90w": "",
      "raw": "The RMT union's leader says he wants the mayor to help resolve its dispute with transport bosses.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a16ca0b2e40e53757452bd2a8742fc4d4d854e84",
      "title": "Prince Harry meets King Charles for first time in more than a year",
      "url": "https://www.bbc.com/news/articles/cly14jq42djo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T17:49:16.000Z",
      "summary_90w": "",
      "raw": "There had been no face to face meeting between father and son since February 2024.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e166c2bf37ff6c2640791480899fcdab0c6a77a1",
      "title": "New French PM Sébastien Lecornu promises ‘profound break’ with past politics",
      "url": "https://www.theguardian.com/world/2025/sep/10/new-french-pm-sebastien-lecornu-promises-profound-break-with-past-politics",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T17:49:11.000Z",
      "summary_90w": "",
      "raw": "Lecornu, 39, faces difficult task of gaining enough support from divided parliament to pass a budget\nThe new French prime minister, Sébastien Lecornu, has promised a “profound break” with past politics as he took over from the unpopular centrist François Bayrou, who was ousted this week over a proposed budget squeeze.\nLecornu, 39, who said “humility” was the key approach, now faces the difficult task of gaining enough support from France’s divided parliament to pass a budget if he is to avoid being swiftly ousted in the same way as Bayrou, and before him, the rightwing Michel Barnier, who only lasted three months.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7aaa438c51bbedb99211b556db59356aa36effe5",
      "title": "TechCrunch Disrupt 2025: Full agenda reveal for the brand-new Going Public Stage",
      "url": "https://techcrunch.com/2025/09/10/techcrunch-disrupt-2025-first-full-agenda-reveal-for-the-brand-new-going-public-stage/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:45:35.000Z",
      "summary_90w": "",
      "raw": "We recently unveiled the Going Public Stage at TechCrunch Disrupt 2025 — a new destination for founders navigating the complexities of company building, from early traction to IPO and beyond.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dc85351c3c39cf943d49f5c84a81a2a6cfb67976",
      "title": "PlayStation launches new app for parental controls",
      "url": "https://www.theverge.com/news/775918/playstation-family-parental-controls-ios-android-app",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:43:34.000Z",
      "summary_90w": "",
      "raw": "PlayStation is launching a new PlayStation Family app for iOS and Android to help parents manage their child’s playtime on PS5 and PS4. Parents can already set parental control features directly on a console, but this app gives parents another way to set limits and keep track of what their kid is playing.\n“The app includes a number of new customizable features for parents to manage their children’s playtime, including an activity report, more visibility into what their children are playing, and approving extra playtime requests,” according to a blog post. The app also has an onboarding experience to help parents set up a child account, lets parents manage a child’s spending on the PlayStation Store, and gives parents the ability to customize privacy settings for their children.\n\nNintendo and Microsoft also offer dedicated parental control apps for iOS and Android that lets parents manage playtime on the Nintendo Switch and Xbox.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4e6823579d8dfe3f3e01dc8667e99f54f699d3e9",
      "title": "Arc gets its first major order for electric tugboats worth $160M",
      "url": "https://techcrunch.com/2025/09/10/arc-gets-its-first-major-order-for-electric-tugboats-worth-160m/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:43:09.000Z",
      "summary_90w": "",
      "raw": "It's a big step in the company's ambitous plan to electrify all watercraft.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c9df4697bccd46604cbd7f2c0bdb46c61486132",
      "title": "‘My first barricade’: French protests unite teachers, gilets jaunes and students",
      "url": "https://www.theguardian.com/world/2025/sep/10/my-first-barricade-latest-french-protests-unite-people-from-variety-of-backgrounds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T17:41:20.000Z",
      "summary_90w": "",
      "raw": "Thousands join Block Everything rallies across France to express anger at government and austerity\nAt 7am on the eastern edge of the busy Paris ring road at Montreuil, Jess, a 35-year-old hospital neurologist, had joined protesters attempting to stop traffic in order to show her anger at the French government.\n“Inequality is rife in France and this is the only way to be heard,” she said. Pushed back with teargas by riot police, Jess, who asked for her real name not to be published, said she was scared by police tactics but felt it was crucial to be on the streets.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f6e57cb3624f608d238fe884380cd09a438d7f94",
      "title": "Bluesky brings age verification to South Dakota and Wyoming",
      "url": "https://www.theverge.com/news/775901/bluesky-age-verification-us-south-dakota-wyoming",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:40:36.000Z",
      "summary_90w": "",
      "raw": "Bluesky will now check the ages of users located in South Dakota and Wyoming to comply with local online safety laws. The platform announced on Wednesday that users in both states will be able to prove their age using an ID, payment card, face scan, or other method.\nJust like Bluesky’s age verification launch in the UK, the social network will process age checks through Epic Games’ Kids Web Services (KWS), a tool that allows developers to integrate age verification and parental controls within their platforms.\nBoth South Dakota and Wyoming pushed ahead with their online safety laws after a Supreme Court ruling upheld a Texas law requiring age verification for porn sites. While many states only apply online safety laws to adult websites or platforms containing a certain threshold of harmful content, 404 Media points out that South Dakota and Wyoming’s laws don’t include this carveout. That means they could affect a much broader swatch of online platforms, including Reddit, X, and Discord, according to the Electronic Frontier Foundation.\nLast month, Bluesky and Mastodon stopped operating in Mississippi after the Supreme Court refused to block a “likely unconstitutional” law that forces platforms to verify the ages of users when they create an account. Bluesky said the law “would block everyone from accessing the site — teens and adults — unless they hand over sensitive information.”\nIn the UK, Bluesky restricts unverified and underage users from accessing adult content, as well as from using certain features, like direct messaging. The Verge has contacted Bluesky for more details on the restrictions in these US states, but didn’t immediately hear back.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "30f5344cf1a38cacd76c15aef6c8fd07e834127a",
      "title": "Windows developers can now publish apps to Microsoft’s store without fees",
      "url": "https://www.theverge.com/news/775877/windows-developers-microsoft-store-publishing-free",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:38:54.000Z",
      "summary_90w": "",
      "raw": "Microsoft is allowing developers to submit apps to its Windows store without having to pay any onboarding fees. Individual developers in nearly 200 countries can now sign up to publish apps on the Microsoft Store with just a personal Microsoft account, and no more one-time fees.\nMicrosoft started cutting its $19 one-time fee to publish apps to its Windows store in June in certain markets, and it’s now essentially removing this fee for all developers worldwide. Apple still charges an annual $99 fee to developers, and Google charges a one-time registration fee of $25. \n“Developers will no longer need a credit card to get started, removing a key point of friction that has affected many creators around the world,” explains Chetna Das, senior product manager at Microsoft. “By eliminating these one-time fees, Microsoft is creating a more inclusive and accessible platform that empowers more developers to innovate, share and thrive on the Windows ecosystem.”\nMicrosoft has been gradually upgrading its Windows store over the past few years, with standalone installers, an updated web version, and improvements to the user experience of downloading and installing apps. The Microsoft Store is now used by more than 250 million monthly active users, according to Microsoft.\nMicrosoft is now encouraging more developers to make use of the store, where they can publish a variety of Win32, UWP, PWA, .NET, MAUI, or Electron apps. Developers can even use their own in-app commerce system to keep 100 percent of their revenues on non-gaming apps.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison tops Elon Musk as world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T17:33:51.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth has overtaken Musk's fortune, propelled by an AI boom.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5808d2c2569fd1dea340c0064521b16d9e33f6a2",
      "title": "Meta adds new features to Community Notes fact checks, including alerts for corrected posts",
      "url": "https://techcrunch.com/2025/09/10/meta-adds-new-features-to-community-notes-fact-checks-including-alerts-for-corrected-posts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:33:21.000Z",
      "summary_90w": "",
      "raw": "Now, users will be notified when they've interacted with a post on Facebook, Instagram, or Threads that receives a Community Note. Plus, anyone can now request a note or rate a note if it's been helpful to them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bb590e000c72cbcdece0df51b42e5bff971cd5e6",
      "title": "Anthropic reports outages, Claude and Console impacted",
      "url": "https://techcrunch.com/2025/09/10/anthropic-reports-outages-claude-and-console-impacted/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:33:05.000Z",
      "summary_90w": "",
      "raw": "Anthropic reported a service outage impacting APIs, Console, and Claude earlier this afternoon.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e2434ceef70c779da2a2d27c95e519bf3805576",
      "title": "Blackmagic’s camera dock works with the new iPhone’s professional filmmaking features",
      "url": "https://www.theverge.com/news/775855/blackmagic-design-camera-prodock-iphone-17-pro-filmmakers",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:27:02.000Z",
      "summary_90w": "",
      "raw": "The Camera ProDock includes top and bottom mounting points for incorporating it into professional filming rigs. | Image: Blackmagic Design\t\n\nIt was briefly mentioned by Apple’s Greg Joswiak during the company’s “Awe dropping” event yesterday, but today Blackmagic Design officially announced its new Camera ProDock that “adds professional camera connections to iPhone 17 Pro and iPhone 17 Pro Max.” These include additional USB-C ports for connecting accessories like external storage drives and BNC connectors that take advantage of the 17 Pro’s new genlock support for syncing with multiple cameras and other filmmaking gear.\nThe Blackmagic Camera ProDock will be available through the company’s global network of resellers and Apple for $295, although Apple’s online store currently has it listed as “coming soon” for $299.95.\nWhen connected to the iPhone 17 Pro’s USB-C port, the Camera ProDock enables the smartphone to connect to professional video production tools like switchers and timecode generators. Now that Apple’s flagship smartphone supports genlock it can be synchronized to other cameras in a multi-cam environment and be used to film LED walls in a virtual production without flickering by matching its capture rate to the refresh rate of the giant screens.\nThe Camera ProDock adds three additional USC-ports, a locking 12V DC power input, an HDMI port for an external preview display, two BNC connectors to interface with professional genlock and timecode generators, and a pair of 3.5mm stereo audio in and out ports for using external microphones or headphones. On the top and bottom of the dock you’ll also find locking mounting points so it can be securely incorporated into a more elaborate iPhone filming rig. The Camera ProDock is designed to work seamlessly with the free Blackmagic Camera app that features more manual control and tools designed for professional videographers you won’t find in the stock iOS camera app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eee3f0b89366dbedb3525e4c214f097ae6d698ac",
      "title": "We tested six smart rings, and there’s a clear winner",
      "url": "https://www.theverge.com/2024/10/1/24259284/oura-ring-samsung-galaxy-ring-ultrahuman-ring-air-ringconn-circular-ring-evie-ring-review-wearables",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:23:33.000Z",
      "summary_90w": "",
      "raw": "I have six ring tans now.\t\n\nSmart rings are having a moment. After years as a niche gadget, regular people are starting to see the appeal. They're thinner, more accurate, and more wearable compared to a decade ago - and for some people, they're a smarter choice than smartwatches.\nSmartwatches may dominate the wearable landscape, but they don't work for everyone. They can be bulky. Daily charging is a pain. Plus, they don't always work for people with wrist tattoos or those who participate in more niche sports. (Ever try stuffing a Garmin under a boxing glove? It's not fun.) Conversely, smart rings are discreet and often have multiday battery life, and your finger can  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b753a18ef96ba35248cb24f3ad10769eac3fc264",
      "title": "Sony rolls out new ‘PlayStation Family’ parental controls app",
      "url": "https://techcrunch.com/2025/09/10/sony-rolls-out-new-playstation-family-parental-controls-app/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:20:04.000Z",
      "summary_90w": "",
      "raw": "While Sony has long offered parental controls, the new app brings all of these tools into one dedicated place for easier access.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e10da05afee1f99f524f5dcb6aa3c7e624653b9f",
      "title": "Drones in Poland are another unsettling post-Alaska escalation by Russia",
      "url": "https://www.theguardian.com/world/2025/sep/10/drones-poland-post-alaska-escalation-russia-analysis",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T17:18:16.000Z",
      "summary_90w": "",
      "raw": "Kremlin’s war in Ukraine has spilled over into Nato country – but whether to create fear or test response, aim is unclear\nWhatever Donald Trump discussed with Vladimir Putin in Alaska last month, the outcome has only been a stepped increase in Russian aggression that has now forced Nato’s military forces into action. On Tuesday night 19 Russian drones entered the country’s airspace, according to the prime minister, Donald Tusk – a number that cannot be easily explained away as accidental.\nUntil that point, Russia’s war in Ukraine had not spilled over in a notable way to a Nato country. Though the drone incursion cannot be described as militarily significant (only one house has been reported damaged so far) the Polish incident is qualitatively different from anything that has happened since February 2022.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "648a5ffb0974308a0964af667f684c3ced5c83ae",
      "title": "Tuchel's England analysed: How good are they?",
      "url": "https://www.bbc.com/sport/football/articles/cnvrqz76mejo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T17:17:44.000Z",
      "summary_90w": "",
      "raw": "Thomas Tuchel's England have only played six games together, but Tuesday's 5-0 win against Serbia was the most impressive. What have we learnt from the victory?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "43bec9a36dd105f8b49fde400eb6ca3af529a822",
      "title": "Here&#8217;s everything you need to know about preordering the 2025 iPhone lineup",
      "url": "https://www.theverge.com/tech/772748/iphone-17-pro-air-preorder-price-how-to-buy-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T17:04:56.000Z",
      "summary_90w": "",
      "raw": "The new iPhone Air starts at $999. | Image: The Verge\t\n\nApple announced its new iPhone 17 lineup during its “Awe dropping” event on Tuesday. As expected, the company introduced the iPhone 17, the flagship iPhone 17 Pro, and a bigger iPhone 17 Pro Max. There’s also a new addition to the lineup this year: the slimmed-down iPhone Air, which features a 6.5-inch ProMotion display and measures at just 5.6mm thick.\nBeyond the Air’s slimmer design, Apple’s latest iPhone lineup features a number of notable updates. The standard iPhone 17 now features a larger 6.3-inch display with ProMotion and an adaptive refresh rate of up to 120Hz. Meanwhile, the Pro model has returned to an aluminum build while adding the biggest battery of any iPhone yet. The iPhone Air and Pro models have a lot in common, including having a “plateau” bump on the back, which Apple says creates additional space for internal components, like a larger battery.\nThe iPhone 17, 17 Pro, 17 Pro Max, and Air start at $799, $1,099, $1,199, and $999, respectively, with preorders beginning Friday, September 12th, and shipments set to arrive the following Friday, September 19th. Below, you’ll find more information about each new device, along with where you can place a preorder.\nWhere to preorder the iPhone Air\nThe iPhone Air finally made its debut after months of rumors. It’s Apple’s thinnest iPhone ever at 5.6mm thick, and features a 6.5-inch ProMotion display and a refresh rate of up to 120Hz. Apple says the design is its “most durable” yet, with a ceramic shield that encloses a titanium frame on both sides (also found in the iPhone 17 Pro). The device also sports a single 48MP fusion camera, along with an A19 Pro processor and Apple’s in-house C1X modem. Despite its thinner design, Apple says the Air features “all-day battery life,” with up to 27 hours of video playback, or 40 hours when the $99 iPhone Air MagSafe battery is attached.\nYou’ll be able to preorder the iPhone Air at Apple and Best Buy alongside the other models on Friday, September 12th, with the launch set to follow on Friday, September 19th. The Air starts at $999 with 256GB of storage, and goes all the way up to $1,399 for the 1TB model.\niPhone Air\nThe iPhone Air is Apple’s thinnest iPhone yet at 5.6mm, featuring a 6.5-inch ProMotion display, a 48MP fusion camera, and an 18MP front camera with Center Stage support. It also boasts the most Apple-designed chips in an iPhone: the A19 Pro, N1, and C1X.\n\nWhere to Buy:\n\n $999 at Apple (256GB)\n $999.99 at Best Buy (256GB)\n $1199 at Apple (512GB)\n\nWhere to preorder the iPhone 17\nThe iPhone 17 is Apple’s latest entry-level smartphone. Like last year’s release, it borrows many of its best features from the previous-generation Pro line, including a larger 6.3-inch 120Hz ProMotion display. The device also features a new A19 processor and a dual 48MP fusion camera system that has a main camera and an ultrawide camera. A new 18MP Center Stage front camera features a square sensor, allowing users to take high-quality landscape-mode selfies without having to rotate their phone.\nThe phone is available in five colors (black, lavender, mist blue, sage, and white) and features a starting storage of 256GB. The iPhone 17 is set to launch on Friday, September 19th, with preorders beginning Friday, September 12th at Apple and Best Buy starting at $799 with 256GB of storage or $999 with 512GB of storage.\niPhone 17\nThe standard iPhone 17 has a 6.3-inch ProMotion display that can reach 3,000 nits of peak brightness, an A19 chip, and a 48MP dual camera system. It also features an 18MP Center Stage selfie camera with a square sensor, allowing users to take landscape selfies while holding the device vertically. \n\nWhere to Buy:\n\n $799 at Apple (256GB)\n $829.99 at Best Buy (256GB)\n $999 at Apple (512GB)\n\nWhere to preorder the iPhone 17 Pro and Pro Max\nThe iPhone 17 Pro and 17 Pro Max look different than last year’s Pro models. While they keep the same 6.3-inch and 6.9-inch displays, respectively, Apple has made a few tweaks to the design. One of the first things you’ll probably notice is the plateau camera bump on the back, which houses a trio of 48MP fusion cameras. Both devices also boast an upgraded 18MP selfie camera with support for Center Stage, and a more powerful A19 Pro processor inside. The Pro models feature larger batteries than before, too, with the 17 Pro Max delivering the best battery life ever in an iPhone, according to Apple.\nThe iPhone 17 Pro and 17 Pro Max launch alongside the non-Pro models on Friday, September 19th. The smaller Pro starts at $1,099 with 256GB of storage, while the 17 Pro Max starts at $1,199 with 256GB of storage, with preorders beginning Friday, September 12th. For the first time ever, Apple is offering a 2TB configuration of the 17 Pro Max for $1,999. You can nab a preorder for the 17 Pro from Apple and Best Buy; the 17 Pro Max is also available for preorder at Apple and Best Buy.\niPhone 17 Pro\nThe iPhone 17 Pro features a 6.3-inch OLED panel with a 120Hz refresh rate, and it’s powered by an A19 Pro chip. It features a 48MP triple camera system, plus a new “plateau” bar on the back, which Apple says creates additional space for internal components, including a larger battery.\n\nWhere to Buy:\n\n $1099 at Apple (256GB)\n $1099.99 at Best Buy (256GB)\n $1299 at Apple (512GB)\n\n\niPhone 17 Pro Max\nThe larger iPhone 17 Pro Max sports a 6.9-inch OLED screen and the best battery life ever in an iPhone. It has most of the same features as the smaller iPhone 17 Pro, though, but offers storage up to 2TB — a first in the iPhone line.\n\nWhere to Buy:\n\n $1199 at Apple (256GB)\n $1199.99 at Best Buy (256GB)\n $1399 at Apple (512GB)\n\nUS carrier deals and incentives\nRather than pay all at once for your phone of choice, several US carriers are offering deals if you purchase or upgrade through them. Just keep in mind that taking advantage of a carrier deal will lock your phone to that network for a period of time, and likely mean you’ll break up the total price into payments that may increase your monthly bill.\nVerizon is offering new and existing customers who trade-in an eligible device up to $1,099 toward an iPhone 17 Pro with a new or upgraded smartphone line on an Unlimited Ultimate plan (minimum $90 per month with autopay, plus taxes and fees for 36 months); the trade-in / promo credit is applied over 36 months. Meanwhile, Verizon is offering new and existing customers who trade in an eligible device up to $1,100 off the iPhone 17 Pro Max with a new or upgraded smartphone line on an Unlimited Ultimate plan, with the trade-in / promo credit applied over 36 months. For upgrades, phones that are traded in must be active on an account for 60 days prior to purchasing a new device.\nT-Mobile is offering up to $1,100 off any 2025 iPhone in 24 monthly bill credits with an eligible trade-in and qualifying service ($100+ per month with auto pay, plus taxes and fees). Meanwhile, you can get up to $830 (no trade-in required) via 24 monthly bill credits when you switch to T-Mobile and add a line on one of its Experience plans.\nAT&T is offering new and existing customers up to $1,100 off an iPhone 17 Pro or 17 Pro Max, and up to $830 off an iPhone 17 or iPhone Air, with the credit being applied over 36 months. The offer is available for new and existing customers with an eligible trade-in in any condition, and activation of a new line or an upgrade of an existing line. For new customers, AT&T says the offer requires a postpaid unlimited voice and data plan starting at $75.99 before the discounts.\nUpdate, September 10th: Updated with links to Best Buy landing pages and information about carrier deals.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9fcb080251f1314b7294cb277b6249eaf59dbdb7",
      "title": "An election law expert weighs in on Trump's effort to reshape our democracy",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5536528/an-election-law-expert-weighs-in-on-trumps-effort-to-reshape-our-democracy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T17:01:03.000Z",
      "summary_90w": "",
      "raw": "Before 2026's midterms, President Trump wants to ban mail-in ballots and electronic voting machines, and change voting rules. Legal expert Richard Hasen discusses the future of free and fair elections.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23841b31c181359fada861e70c5d0819b46f8414",
      "title": "Humanoids, AVs, and what’s next in AI hardware at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/10/humanoids-avs-and-whats-next-in-ai-hardware-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T17:00:00.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 hits Moscone West in San Francisco from October 27 to 29, bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f669446916e1e964d117b5e69b0d08621f116518",
      "title": "Israel defiant after international outrage at Qatar airstrike targeting Hamas",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:59:00.000Z",
      "summary_90w": "",
      "raw": "Defence minister Katz says ‘there is no place they can hide’ after attack condemned as violation of Qatar’s sovereignty\nIsrael has reacted with defiance and further threats in response to international outrage at its strikes targeting a meeting of Hamas’s leaders in Qatar on Tuesday.\nAmid continuing doubt over whether the missiles fired by Israeli air force planes had killed any of their primary targets, the country’s defence minister, Israel Katz, warned its “long arm will act against its enemies anywhere”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1eb19fba487e6c11508fe2ca6e042376b77213b8",
      "title": "How to preorder the Apple Watch SE 3, Apple Watch Series 11, and Apple Watch Ultra 3",
      "url": "https://www.theverge.com/tech/773089/apple-watch-se-3-series-11-ultra-3-preorder-buy-price-release-date",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T16:55:13.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch SE 3 starts at $249 and is available for preorder today. | Image: Apple\t\n\nThe iPhone Air and the iPhone 17 fleet of phones took the spotlight during Apple’s “Awe dropping” event. If you weren’t tempted by the new phones, the fact that the entire Apple Watch lineup got refreshed might have been even bigger news to you. Soon, the Apple Watch SE 3, Apple Watch Series 11, and Apple Watch Ultra 3 will arrive, and each is bringing along some big upgrades, which we’ll get into a bit below.\nAll three are available for preorder starting today, with the SE 3 starting at $249, the Series 11 starting at $399, and the Ultra 3 starting at $799. They’ll all ship on September 19th. We’ll update this post as carrier deals roll in.\nAll three watches launch with watchOS 26, which includes the new Liquid Glass design, just like the new updates coming to most of Apple’s other devices on September 15th. The update also includes an AI-powered Workout Buddy to encourage you during exercise. Flicking your wrist up will clear your notifications. The watchOS 26 update will be released for older Apple Watch models (going back to Series 6, SE 2, and Ultra) on September 15th.\nWe’ve gone hands-on with the upcoming Apple Watches — delivering impressions to the extent that it’s possible in a limited hands-on environment — but we’ll soon be getting each of them in for a full review. We also have initial impressions of the iPhone 17 line, including the iPhone 17, the iPhone 17 Pro and Pro Max, and the iPhone Air.\nWhere to preorder the Apple Watch SE 3\nThe Apple Watch SE 3 is the first update to Apple’s entry-level smartwatch line since 2022. It has the same S10 chip as the Apple Watch Series 11 and Ultra 3, and an always-on display that Apple says is four times more scratch resistant than the previous model. It supports Apple’s SOS and fall-detection features, plus an entirely new feature called Sleep Score, which analyzes the amount of time you spend in each sleep stage and gives you a score based on the overall quality of sleep. The Apple Watch SE 3 also supports sleep apnea detection.\nApple says the SE 3’s charging speed is twice as fast as the previous Apple Watch SE, offering eight hours of battery life off a 15 minute charge. The cellular version of the Apple Watch SE 3 supports 5G for the first time. When you’re not connected to the internet, you can use on-device Siri to handle local requests.\nThe Apple Watch SE 3 is available in two case sizes: 42mm and 44mm. The 42mm GPS model costs $249, and is available for preorder at Amazon, Best Buy, and Walmart. It jumps to $299 if you want cellular connectivity, and you can preorder that model at Amazon, Best Buy, and Walmart. \nThe 44mm GPS model costs $279 and is available for preorder at Amazon, Best Buy, and Walmart. The cellular version of the 44mm Apple Watch SE 3 costs $329 and is available for preorder at Amazon, Best Buy, and Walmart.\nApple Watch SE 3 (GPS; 42mm)\n\nWhere to Buy:\n\n $249 at Amazon\n $249 at Best Buy\n $249 at Walmart\n\nWhere to preorder the Apple Watch Series 11\nThe Apple Watch Series 11 may look the same as the Series 10 it’s replacing, but it has a 5G cellular modem for the first time. Its displays are the same size, but Apple says the glass it used is twice as scratch resistant. Its heart rate sensor can now measure how blood is flowing through your veins to detect hypertension in the background, a feature that’s currently waiting for clearance at the FDA. That feature is also going to be available on the Apple Watch Series 9 and Ultra 2. It also supports the new Sleep Score feature. The Series 11’s battery life has been bumped to 24 hours, up from 18 hours.\nThe Apple Watch Series 11 comes in two sizes: 42mm and 46mm. The 42mm GPS model costs $399, and is available for preorder at Amazon, Best Buy, and Walmart. The 42mm cellular version costs $499, and is available for preorder at Amazon, Best Buy, and Walmart.\nThe 46mm GPS model costs $429, and it’s available for preorder at Amazon, Best Buy, and Walmart. The 46mm cellular model costs $529 and is available for preorder at Amazon, Best Buy, and Walmart.\nApple Watch Series 11 (42mm; GPS)\n\nWhere to Buy:\n\n $399 at Amazon\n $399 at Best Buy\n $399 at Walmart\n\nWhere to preorder the Apple Watch Ultra 3\nThe refreshed Apple Watch Ultra 3 has a larger wide-angle OLED display that can ratchet its refresh rate down to 1Hz for a more responsive always-on display. The smartwatch’s case size hasn’t changed, but the display is slightly larger thanks to a reduction in bezel size. It lasts up to 48 hours per charge, and has the same new 5G modem as the rest of Apple’s upcoming smartwatches. It’s also gained support for satellite texting, which will allow you to send a message and enable Find My to share your location when Wi-Fi and cellular service aren’t available.\nThe Apple Watch Ultra 3 is available in one case size, 49mm, and you can preorder it from Amazon, Best Buy, or Apple for $799. \nApple Watch Ultra 3\n\nWhere to Buy:\n\n $799 at Amazon\n\nCorrection, September 9th: An earlier version of this article misstated two Apple Watch Series 11 prices. The 42mm cellular version costs $499, not $429; the base 46mm version costs $429, not $499.\nUpdate, September 10th: Added retail links for Best Buy, Amazon, and Walmart for the smartwatches.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "168331069449903a4d7e5dc063cdcec4f5999bbe",
      "title": "Replit hits $3B valuation on $150 million annualized revenue",
      "url": "https://techcrunch.com/2025/09/10/replit-hits-3b-valuation-on-150-million-annualized-revenue/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T16:54:48.000Z",
      "summary_90w": "",
      "raw": "Replit's annualized revenue has skyrocketed from $2.8 million to $150 million in less than a year, it said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "87c991d12472a76e2734e9a0d62967b9b9ce8543",
      "title": "Reddit is testing a way to read articles without leaving the app",
      "url": "https://www.theverge.com/news/775722/reddit-news-publishers-beta-articles-analytics",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T16:52:26.000Z",
      "summary_90w": "",
      "raw": "As AI tools gobble up news publishers’ traffic on traditional referral platforms like Google, Reddit is offering publishers another way to share their content — within its app. \nOn September 10th, Reddit announced a slew of new features available to some publishers that are meant to help them better understand where their stories are being shared and to encourage them to post more on the platform. On the user side, the most significant change is a test that allows readers to open article links directly in the Reddit app, with Reddit comments from other users pinned to the bottom. In other words, you can scroll through an article while reading Reddit comments. Reddit spokesperson Courtney Geesey-Dorr told The Verge that the feature respects publisher paywalls, meaning some users may hit subscriber-only content; some publications may opt to share unlocked gift links or soften their paywalls for Reddit users.\nOn the backend, publishers will have specialized analytics tools, which will let them track which subreddits are sharing their stories and performance metrics like upvotes and how many people are clicking on their stories on Reddit. It sounds similar to CrowdTangle, a now-defunct Meta tool that journalists and researchers used to monitor what was going viral on Facebook. Reddit will also allow publishers to sync their RSS feeds and automatically import stories, which they can then share on different subreddits. And because we are living in the age of AI recommendations, there’s also an AI tool that will suggest which subreddits publishers should share their stories with. The suite of tools is part of Reddit Pro, a business platform that the company introduced last year. Publisher-side features have been in early testing with some outlets, with new applications for the beta test opening today.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f941aa6a42dc26e2886df058363f237cb352f6c",
      "title": "Israeli military kills at least 41 people as it continues to order evacuation of Gaza City",
      "url": "https://www.theguardian.com/world/2025/sep/10/israeli-military-kills-at-least-people-as-it-continues-to-order-evacuation-of-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:45:26.000Z",
      "summary_90w": "",
      "raw": "Many of 1 million residents say they will not leave as they do not believe al-Mawasi humanitarian zone is safe\nThe Israeli military has killed at least 41 people in Gaza, including 12 aid seekers, over the last 24 hours as it continued to order the population of Gaza City to evacuate before its planned offensive.\nThe evacuation orders were accompanied by intensified Israeli bombing of the city, the Israeli military interspersing orders with announcements of high-rise towers they had bombed.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48db1a970e1d91c6c6f1541c78672043203a16ba",
      "title": "The iPhone 17 is a shockingly great deal",
      "url": "https://www.theverge.com/news/775802/apple-iphone-17-deal-compare-pro",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T16:45:16.000Z",
      "summary_90w": "",
      "raw": "Apple made a lot of noise about its super-slim iPhone Air and super-citrusy iPhone 17 Pro this week, but the company gave the base iPhone 17 some major updates that make it a really great deal - and all without raising its $799 starting price.\nLet's start with the iPhone 17's display, which is now bigger and has a higher refresh rate with a load of features that have been exclusive to the iPhone Pro for years. \nHere's a quick rundown: Apple has bumped the iPhone 17's screen size up to 6.3 inches. The screen finally has Apple's ProMotion tech, meaning it has an adaptive refresh rate of up to 120Hz, which makes scrolling and games smoother.  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8b780f9b4c8d96d7c2cf50af863d5c134af51842",
      "title": "Trump makes a rare D.C. restaurant visit to tout his federal crackdown on crime",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5536570/trump-dc-restaurant-protests-joes-seafood",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T16:37:37.000Z",
      "summary_90w": "",
      "raw": "In his first term, President Trump only dined out at the steakhouse in his former hotel. He visited a steakhouse near the White House on Tuesday, saying, \"I wouldn't have done this three months ago.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac80bff6ea922455776c4e7a955e3e1fad7529fd",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "url": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:34:14.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Thousands of film workers join new boycott initiative criticized by Israeli producers’ group as ‘misguided’\nThousands of actors, directors and other film industry professionals have signed a new pledge vowing not to work with Israeli film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.\n“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” the pledge reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb68248c92c9258dd49995548514f71d695fcd25",
      "title": "Watch: Footage shows second claimed attack on Greta Thunberg Gaza flotilla",
      "url": "https://www.bbc.com/news/videos/cyv64eppj56o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:33:01.000Z",
      "summary_90w": "",
      "raw": "BBC Verify analyses footage of the suspected drone attacks and images of a device found after the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "74ef81755aaea69195c7ae90890ff5d3e9b7b473",
      "title": "No 10 files raise questions over whether Tory donations were legal",
      "url": "https://www.bbc.com/news/articles/cp3qww29146o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:32:09.000Z",
      "summary_90w": "",
      "raw": "A foreign billionaire who met then-PM Boris Johnson at Downing Street was described in an official log as a \"donor\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2223af0290a88ad1482c9e40589d7d7707c202b",
      "title": "Larry Ellison usurps Elon Musk as the world’s richest person",
      "url": "https://www.theverge.com/news/775763/larry-ellison-oracle-elon-musk-richest-person",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-10T16:29:12.000Z",
      "summary_90w": "",
      "raw": "Elon Musk can no longer claim the title of the world’s richest man — at least for the time being. The net worth of Oracle CTO and co-founder, Larry Ellison, ballooned by $101 billion on Wednesday morning, bringing his total fortune to $393 billion, according to a report from Bloomberg.\nEllison’s wealth now surpasses Musk’s, which sits at $385 billion, Bloomberg reports. Musk first topped the list of the world’s richest people in 2021. Though he ended up losing the title to Amazon’s Jeff Bezos and Bernard Arnault, the CEO of luxury brand LVMH, he slid back into the top spot last year and became the first person with a $400 billion net worth.\nEllison’s fortune soared after Oracle’s latest earnings report suggested that its cloud infrastructure business would rake in a whopping $144 billion over the next four years. Meanwhile, Musk may be on track to become the world’s first trillionaire if Tesla shareholders approve his exorbitant new pay package.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0f76ad215c1560219d8cc3921d269f7ef3a8809e",
      "title": "Cuba hit with fifth blackout in less than a year with 10m people in the dark",
      "url": "https://www.theguardian.com/world/2025/sep/10/cuba-electricity-power-blackout",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T16:28:09.000Z",
      "summary_90w": "",
      "raw": "Grid failure follows string of nationwide blackouts that plunged antiquated power system into near-total disarray\nEmergency crews were working to restore power to 10 million people on Wednesday as Cuba suffered its fifth nationwide blackout in under a year, the energy ministry announced.\n“There has been a total disconnection of the electric system,” the energy ministry and National Electric Union said early on Wednesday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "524b7b64ea3fe82a91f7428c0f55d1fe769811ab",
      "title": "Watch: How the Nepal protests unfolded",
      "url": "https://www.bbc.com/news/videos/c740mkzgzd4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:18:20.000Z",
      "summary_90w": "",
      "raw": "The BBC’s Charlotte Scarr explains how the use of two slogans sparked a wave of protests in Kathmandu.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "917520d4206bc749989cdf4716b74eca9b1e8626",
      "title": "McGovern exits Labour deputy race and backs Phillipson",
      "url": "https://www.bbc.com/news/articles/c5yvdxvx449o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T16:15:43.000Z",
      "summary_90w": "",
      "raw": "The housing minister said she would not have the required backing of 80 MPs to progress in the contest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e33163f88b726341f7665fb60df09f51a9edec9",
      "title": "Nepal protests 'hijacked', Gen Z claim, as army patrols the streets",
      "url": "https://www.bbc.com/news/articles/cjd1ndmrej0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T16:15:28.000Z",
      "summary_90w": "",
      "raw": "Fierce protests against corruption and nepotism spiralled into arson and violence on Tuesday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32ed87d8575a6e90fb892d17fe0bf939da4ac35f",
      "title": "Bluesky will comply with age-verification laws in South Dakota and Wyoming after exiting Mississippi",
      "url": "https://techcrunch.com/2025/09/10/bluesky-will-comply-with-age-verification-laws-in-south-dakota-and-wyoming-after-exiting-mississippi/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T16:12:14.000Z",
      "summary_90w": "",
      "raw": "Bluesky says the age-verification laws strike \"the right balance,\" so it won't have to exit the states as it did in Mississippi.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e18ebc844f64fa5414cf4ff3eb32f4455ad51e50",
      "title": "Fired FBI agents allege retribution, incompetence at top security agency",
      "url": "https://www.npr.org/2025/09/10/g-s1-87947/fbi-lawsuit-firing-retribution",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T16:03:09.000Z",
      "summary_90w": "",
      "raw": "The lawsuit from three senior and lauded FBI agents at the bureau says Trump administration demanded loyalty for those staying at the bureau.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "47038f3a69f345b1ea3d6609fae7228ea666028f",
      "title": "Perfect your pitch: Investors share what really makes founders stand out at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/10/at-techcrunch-disrupt-2025-medha-agarwal-jyoti-bansal-and-jennifer-neundorfer-discuss-what-makes-a-pitch-land/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T16:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes a startup pitch stand out? At TechCrunch Disrupt 2025, October 27–29 in San Francisco, hear candid insights from Defy.vc’s Medha Agarwal, Harness CEO Jyoti Bansal, and January Ventures’ Jennifer Neundorfer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9fdcf43bd41e1462082cf51354af827b1fd0ebe6",
      "title": "Trump asks EU to impose tariffs of up to 100% on India and China",
      "url": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:59:45.000Z",
      "summary_90w": "",
      "raw": "In effort to end Russia’s war in Ukraine, US president reportedly proposes tariffs targeting Putin allies and trade partners\n\nBusiness live – latest updates\n\nEurope live – latest updates\n\nDonald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine.\nThe US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to a White House official.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a7816b715abea9b64511b5fbd8fa4350323f846d",
      "title": "Harris calls Biden's re-election bid reckless in new memoir",
      "url": "https://www.bbc.com/news/articles/cq5jgg1491do?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:48:57.000Z",
      "summary_90w": "",
      "raw": "In her forthcoming memoir 107 Days, the former vice-president says it was reckless to let Biden make a re-election decision on his own.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f86e6bb1ea95fa0fe5e834a54f759950062e3f3",
      "title": "All of the iPhone 17 models compared",
      "url": "https://techcrunch.com/2025/09/10/all-of-the-iphone-17-models-compared/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T15:40:55.000Z",
      "summary_90w": "",
      "raw": "All four of the devices will be available to preorder on Friday and will be available on September 19.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4fd76b83c01aa4823edba66f9883959b72c9b5fd",
      "title": "Weleda investigates claims cream was tested on Nazi camp prisoners",
      "url": "https://www.bbc.com/news/articles/cy7pgd5nkr6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:28:52.000Z",
      "summary_90w": "",
      "raw": "A new study alleges the skincare brand's product was used for human experiments by a Nazi doctor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b99a0852951b8286dd342eb5e3b963db0daa2cc",
      "title": "Reddit launches tools for publisher to track and share stories",
      "url": "https://techcrunch.com/2025/09/10/reddit-launches-tools-for-publisher-to-track-and-share-stories/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T15:17:06.000Z",
      "summary_90w": "",
      "raw": "These tools include article insights to see where stories have been shared and stats related to them, including views, upvotes, and clicks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "081a8f198a4278d360d26539e173d4f931377890",
      "title": "Teacher who hid with child from Southport killer feels 'crushing guilt'",
      "url": "https://www.bbc.com/news/articles/ckg3xnv1lq2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:01:05.000Z",
      "summary_90w": "",
      "raw": "Speaking publicly for the first time, dance teacher Heidi Liddle says she feels \"crushing guilt\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2e333ed904760056e7117cb7b7803fdd999380f1",
      "title": "Life on Mars? 'Leopard-spot' rocks could be biggest clue yet",
      "url": "https://www.bbc.com/news/articles/cd725pj0g9ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T15:00:16.000Z",
      "summary_90w": "",
      "raw": "Unusual mudstones found on the Red Planet are potentially associated with ancient Martian microbes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0936eaa4ad7c06954a034a45fc5f80e02b54be67",
      "title": "Natural disasters forecast to cost Australia’s young people $100bn by 2060",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/natural-disasters-forecast-cost-australia-young-people-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:00:11.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Unicef-commissioned report shows being unable to finish high school – and the associated wage loss – is the most significant impact of increasingly frequent disasters on young people\nKangaroo Valley was hit by raging fires and floods three times in three years.\nIn 2019, the black summer bushfires had forced Layla Wang’s family to flee their home. Then in 2022, after floods and landslides isolated the valley, she was trapped there, spending several “stressful” weeks isolated from school – in the middle of year 12, with no access to her classes and limited resources.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a526d1ea4edad82ca87f2bfe880a429882fd6086",
      "title": "Some of Australia’s biggest thinktanks refuse to reveal their biggest donors. Should they?",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/australia-influential-thinktanks-transparency-refuse-to-reveal-their-biggest-donors-financial-backers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:00:11.000Z",
      "summary_90w": "",
      "raw": "Several raise concerns that disclosing their donors exposes them to political attack but others warn not doing so can prompt legitimate questions about influence\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s biggest thinktanks are deeply divided on whether disclosing their financial backers is in the public interest, with several raising concerns that efforts to keep them secret may be undermining trust in the sector.\nThree influential policy groups that together receive almost $20m in donations a year refuse to reveal their key donors, including those whose commercial interests may overlap with their public advocacy campaigns.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2770069e4745ed4a0afc057a2267674de549b400",
      "title": "Tim Wilson has a long-held bet against Australia’s sharemarket. Experts say it would now have ‘lost quite a bit of money’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/11/tim-wilson-liberal-mp-etf-investment-bet-against-australia-sharemarket-lost-money",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T15:00:11.000Z",
      "summary_90w": "",
      "raw": "The Liberal MP bought the product, which profits when the ASX 200 falls, in early 2020, his register of interests shows, but an analysis and experts say it has been a poor investment\n\nGet our breaking news email, free app or daily news podcast\n\nTim Wilson has a long-held bet against the national sharemarket.\nThe Liberal MP’s register of interests, disclosed in August after his tight victory for the seat of Goldstein at the federal election, shows Wilson has a leveraged investment that profits when the benchmark ASX 200 falls.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7084d1b94e73758f1c8e13e9177ddae1441ceda4",
      "title": "Exploring the future of voice AI with Mati Staniszewski at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/10/exploring-the-future-of-voice-ai-with-mati-staniszewski-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T15:00:00.000Z",
      "summary_90w": "",
      "raw": "From audiobooks and dubbing to gaming and avatars, AI-generated voice is breaking into the mainstream — and Mati Staniszewski, CEO and co-founder of ElevenLabs, is helping lead the charge. At TechCrunch Disrupt 2025, he’ll take the stage to talk about what it takes to make voice AI truly human.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bfad7997234b2eb147230a7bfcca6f5ad4636b81",
      "title": "Dutch battery startup LeydenJar’s silicon anode tech could pose a challenge to China",
      "url": "https://techcrunch.com/2025/09/10/dutch-battery-startup-leydenjars-silicon-anode-tech-could-pose-a-challenge-to-china/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T14:56:55.000Z",
      "summary_90w": "",
      "raw": "LeydenJar raised €13 million along with €10 million from a U.S. consumer electronics company to scale production of its silicon anode material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "80ec7ca163fd750fb3b6affde27625f655fe2a5c",
      "title": "Olympic medallist becomes first Briton to join Enhanced Games",
      "url": "https://www.bbc.com/sport/swimming/articles/c5yevrrv1kwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T14:55:50.000Z",
      "summary_90w": "",
      "raw": "Olympic swimmer Ben Proud becomes the first British athlete to join the controversial Enhanced Games, as AquaticsGB says it is \"immensely disappointed\" by his decision.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f46fd62eb33bd94a37683832d0239447685b72b5",
      "title": "More embarrassing Epstein exchanges to come, says Mandelson, as Starmer pressed at PMQs",
      "url": "https://www.bbc.com/news/articles/c5yevwvvneyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T14:38:16.000Z",
      "summary_90w": "",
      "raw": "The UK's ambassador to the US likens his past association with the convicted paedophile to \"an albatross around my neck\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ed193062af23e3ec14d5390608fbc31d7e541743",
      "title": "California considers allowing doctors to prescribe abortion drugs anonymously",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/10/nx-s1-5535877/california-shield-law-abortion-prescription-label",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T14:37:41.000Z",
      "summary_90w": "",
      "raw": "If passed, the law would protect doctors from legal risk by letting them omit their names from prescription labels for abortion pills. It would affect the many doctors who use California pharmacies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32cadb347ba7c34db799d556e8650ad6c729676c",
      "title": "After selling to Spotify, Anchor’s co-founders are back with Oboe, an AI-powered app for learning",
      "url": "https://techcrunch.com/2025/09/10/after-selling-to-spotify-anchors-co-founders-are-back-with-oboe-an-ai-powered-app-for-learning/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T14:27:55.000Z",
      "summary_90w": "",
      "raw": "Oboe is a new AI-powered learning platform that lets you create personalized courses on any topic with a prompt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7c0b5ea7139ac5983946be2051054ed6f7ceaf7d",
      "title": "Vimeo to be acquired by Bending Spoons in $1.38B all-cash deal",
      "url": "https://techcrunch.com/2025/09/10/vimeo-to-be-acquired-by-bending-spoons-in-1-38b-all-cash-deal/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T14:09:49.000Z",
      "summary_90w": "",
      "raw": "The announcement comes as Bending Spoons was interested in a potential takeover of Vimeo as far back as March 2024.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "92e464b21e2c0889fc3a1ff771ae525e9a32a945",
      "title": "'I thought the world was going to end', Qatar strikes witness tells BBC",
      "url": "https://www.bbc.com/news/articles/cz9jeg7zv8no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T14:06:03.000Z",
      "summary_90w": "",
      "raw": "Qatar's capital, Doha, is back to normal today, but there are new tensions across the Middle East",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db62ec71ad5bf351e04a1acac3d2a4cf8c8d7221",
      "title": "Israel is forcing us to leave Gaza City. We know they may never let us return",
      "url": "https://www.theguardian.com/world/2025/sep/10/israel-is-forcing-us-to-leave-gaza-city-we-know-they-might-never-let-us-return",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T13:57:08.000Z",
      "summary_90w": "",
      "raw": "The Guardian’s reporter in Gaza describes the dilemma facing her family and others, many hungry, penniless and without transport\nThe ninth of September is my sister Enas’s birthday, so we were happy this morning, drinking coffee as a family and telling jokes, until we saw the leaflets dropping down telling us to evacuate. So now, instead of preparing biscuits and cakes to celebrate, we are packing for another displacement.\nThe Israeli army’s plan to occupy Gaza City sent me back to memories of the early days of the war: the tension, the terror and the psychological pressure. I am afraid the cycle of displacement will repeat itself again.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce8065ae705ce28dff5ebc6a0cab1afbc46bcd16",
      "title": "Fertility clinics must stop unproven treatments, watchdog warns",
      "url": "https://www.bbc.com/news/articles/cyv64377z91o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T13:50:22.000Z",
      "summary_90w": "",
      "raw": "The draft guidance advises against many popular but unproven fertility add-ons offered by clinics.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b8f60069271615ef64737a70891308efce67271",
      "title": "Greetings from a peaceful woodland near the River Thames west of London",
      "url": "https://www.npr.org/2025/09/10/g-s1-87866/england-thames-woodland-london",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T13:38:26.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b61c5f9e1827e1b90b6c610d8c76d2509e1223da",
      "title": "Jaguar Land Rover says data stolen in disruptive cyberattack",
      "url": "https://techcrunch.com/2025/09/10/jaguar-land-rover-says-data-stolen-in-disruptive-cyberattack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:19:29.000Z",
      "summary_90w": "",
      "raw": "The cyberattack at Jaguar Land Rover, which began on September 2, has ground vehicle assembly lines to a standstill.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cd8690be21917a29a371e6101fece498d2d723f4",
      "title": "RSS co-creator launches new protocol for AI data licensing",
      "url": "https://techcrunch.com/2025/09/10/rss-co-creator-launches-new-protocol-for-ai-data-licensing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:07:26.000Z",
      "summary_90w": "",
      "raw": "A new system called Real Simple Licensing would allow AI companies to license training data at a massive scale — if they're willing to pay for it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d32193fcc4c99c45ad2c6792971ad069f2f9972",
      "title": "Lyft and May Mobility launch robotaxis in Atlanta",
      "url": "https://techcrunch.com/2025/09/10/lyfts-modest-robotaxi-launch-highlights-growing-gap-with-uber-and-waymo/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Lyft is trying to carve out a presence in the autonomous vehicle market. But the ride-hailing company still lags far behind Uber.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "97857e351a407ffc87bf29ba4a0974fdcd1cbfde",
      "title": "Rendezvous Robotics exits stealth with $3M to build reconfigurable space infrastructure",
      "url": "https://techcrunch.com/2025/09/10/rendezvous-robotics-exits-stealth-with-3m-to-build-reconfigurable-space-infrastructure/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-10T13:00:00.000Z",
      "summary_90w": "",
      "raw": "Rendezvous Robotics wants to scale the space industry by changing the way structures are built on orbit.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c7b70e8456a1017fae26d04b586fb5d56937d0a0",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T12:56:42.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice\nA court in South Korea has acquitted a woman convicted six decades ago for biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.\nChoi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae. He pinned her to the ground and repeatedly forced his tongue into her mouth, at one point blocking her nose to stop her from breathing, according to court records.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54bead6924e1957eea844b26e7272b40100733ec",
      "title": "Remains found of man missing for six years ",
      "url": "https://www.bbc.com/news/articles/c5yevdrxjj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:52:35.000Z",
      "summary_90w": "",
      "raw": "Jordan Moray went missing from his flat six years ago with his mobile phone still charging.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0d419850870765f0051c95b57e13ec916ed95efb",
      "title": "Strictly's Thomas Skinner sorry for grabbing reporter's phone",
      "url": "https://www.bbc.com/news/articles/c1l8vnzmeqpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:46:42.000Z",
      "summary_90w": "",
      "raw": "The ex-Apprentice star says he walked out of interviews after seeing a message on a journalist's screen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b0615520663f609bb01d6849f514cc2e5d7b6e7",
      "title": "Sacked referee David Coote accused of making indecent image of child",
      "url": "https://www.bbc.com/news/articles/c80g5v1lg0eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:40:20.000Z",
      "summary_90w": "",
      "raw": "The former Premier League referee is due in court in Nottingham on Thursday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2fb309309a9468af62804db8cba280746e0ba862",
      "title": "Jihadists 'summarily executed' 127 people in Niger, says rights group  ",
      "url": "https://www.bbc.com/news/articles/c4gkx78xeg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:29:01.000Z",
      "summary_90w": "",
      "raw": "Worshippers have been gunned down in mosques and homes have been torched in escalating violence, Human Rights Watch says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "09dc1a17ec670bfdc1ac04057e487bb29a122b12",
      "title": "Chinese nationals jailed for human trafficking in South Africa",
      "url": "https://www.bbc.com/news/articles/c20v3n7wllzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:18:13.000Z",
      "summary_90w": "",
      "raw": "A raid on a Johannesburg factory found 91 Malawians, including 37 children, living in appalling conditions.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "220c941ab8c89c56cc1f04ff6ec0b8dfd99133e3",
      "title": "Banksy mural scrubbed from Royal Courts of Justice",
      "url": "https://www.bbc.com/news/articles/cm2z30p033ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T12:13:54.000Z",
      "summary_90w": "",
      "raw": "The artwork of a judge hitting a protester with a gavel has been removed from the listed building.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d15d9a5891ad997b6c2babf039c4a54231edf42b",
      "title": "By listening to these birds for decades, scientists track signs of a changing forest",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535788/songbirds-experimental-forest-change-new-hampshire",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T12:09:53.000Z",
      "summary_90w": "",
      "raw": "Scientists tracking the birds in an experimental forest in New Hampshire have also tracked changes in the forest ecosystem over decades.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5442a524c38cdfcaa396e60d2c4a53b31b783ce1",
      "title": "Protests hit France as new PM takes office",
      "url": "https://www.bbc.com/news/articles/c8643qg252lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T12:01:20.000Z",
      "summary_90w": "",
      "raw": "A grassroots movement is encouraging people to protest against the political class and proposed budget cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef0cd82f539a356143e316ff5c05a92b60e6b42f",
      "title": "Shock as Kenyan lawyer killed in drive-by shooting in Nairobi",
      "url": "https://www.bbc.com/news/articles/c20v34qpr98o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T11:36:34.000Z",
      "summary_90w": "",
      "raw": "Kyalo Mbobu was driving home when a gunman on a motorbike shot him dead on a busy street in the capital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd272ba7260163fc20d79d00929d20250c493ce8",
      "title": "Childhood obesity: The South African campaigners fighting for healthy food",
      "url": "https://www.bbc.com/news/articles/ce84n6zpxx9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T11:35:03.000Z",
      "summary_90w": "",
      "raw": "The UN says the number of obese teenagers has nearly tripled globally in the last two decades.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a394d24cbb37857d0e4d7c062802add69609198c",
      "title": "Trump is used to shaking off criticism - but the Epstein story is different",
      "url": "https://www.bbc.com/news/articles/cp8j3e5g74no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T11:33:53.000Z",
      "summary_90w": "",
      "raw": "While there is no suggestion of criminal wrongdoing by Trump, the political consequences of the Epstein saga on the US president are very real",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03c730fbc3c7289d1769090ae65ac6a18d0f9cc7",
      "title": "Dr. Peter Hotez takes the war against science very personally",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/10/g-s1-87614/dr-peter-hotez-science-rfk-jr",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T11:18:41.000Z",
      "summary_90w": "",
      "raw": "In an interview about the new book he co-authored, Science Under Siege, Hotez talks about forces driving the anti-science movement, the risks it poses — and why he won't debate RFK Jr.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "62d9d5e99a42d0a044e9b69101e8735f0ced7ad0",
      "title": "Israel targets Hamas Qatar strike. And, JB Pritzker on Trump's threats to Chicago",
      "url": "https://www.npr.org/2025/09/10/g-s1-87939/up-first-newsletter-israel-qatar-hamas-trump-jb-pritzker-maha-election-citizenship",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T11:05:10.000Z",
      "summary_90w": "",
      "raw": "Israel says it carried out an airstrike targeting senior Hamas officials in Qatar's capital of Doha. And, Trump says he wants to fight crime in Illinois. Gov. JB Pritzker sees a power grab.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36bfe6c4f3313e95430b5531feab0618f45800dd",
      "title": "Greta Thunberg's Gaza flotilla hit by drones, organisers claim",
      "url": "https://www.bbc.com/news/articles/cly67g7pdlko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:43:54.000Z",
      "summary_90w": "",
      "raw": "Organisers said two boats were hit in separate incidents; Tunisian authorities disputed the first and have not commented yet on the second.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3342c14e145cfb08b793be98d54fe88805dfa992",
      "title": "Hong Kong lawmakers say no to more rights for same-sex couples",
      "url": "https://www.bbc.com/news/articles/c5yqeggvwgpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:34:10.000Z",
      "summary_90w": "",
      "raw": "The law would have recognised some rights for couples who were married overseas.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "33bc623fa4b98469ed6d7eeb3ca66f79faa83a4e",
      "title": "Watch: Army patrols streets of Kathmandu after fierce protests",
      "url": "https://www.bbc.com/news/videos/cyv647g63gvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T10:32:09.000Z",
      "summary_90w": "",
      "raw": "Charlotte Scarr reports from the Kathmandu where deadly protests against corruption and nepotism took place.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef95c7eba627dce8e41fef5eb513669ce3ed052e",
      "title": "James McAvoy reportedly assaulted  in Toronto bar",
      "url": "https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:12:49.000Z",
      "summary_90w": "",
      "raw": "Actor promoting his directorial debut California Schemin’ at the city’s film festival is reported to have been punched by another drinker\nThe actor James McAvoy was assaulted in a bar in Toronto, it has been reported.\nAccording to People magazine, McAvoy was “sucker punched” by another visitor to Charlotte’s Room bar on Monday evening, two days after the premiere of his directorial debut, California Schemin’, at the Toronto film festival.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "644620eb6a3a106df5cbdf9b296169debce82997",
      "title": "Why Gov. Pritzker says Trump's threats to Chicago make him worry about 2026 elections",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5533120/pritzker-trump-chicago-troops",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Steve Inskeep speaks with Illinois Governor JB Pritzker about President Trump's threats to send National Guard troops to Chicago and the future of the Democratic Party.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "742180f7cb3a46027c5faf7ad8cc6b49e713d3e4",
      "title": "The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo",
      "url": "https://www.theguardian.com/australia-news/2025/sep/10/jacinta-nampijinpa-price-sussan-ley-indian-migration-comments-repercussions-for-coalition",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T09:51:57.000Z",
      "summary_90w": "",
      "raw": "Price’s refusal to endorse Sussan Ley’s leadership on Wednesday was a deliberate provocation that left the opposition leader no choice\n\nReport: Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments\n\nGet our breaking news email, free app or daily news podcast\n\nFor much of her short career in Canberra, the usual rules of political gravity have appeared not to apply to Jacinta Nampijinpa Price.\nA firebrand, outspoken and unapologetic about almost everything, she went from a first-term backbencher from the Northern Territory to a member of the shadow cabinet in less than a term. Easily the most prominent opponent of the Indigenous voice to parliament, Price used the referendum campaign to build her political brand exponentially.\nTom McIlroy is Guardian Australia’s chief political correspondent\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1af6d8f31dc8f641fd2e03813b1ae929b6631a77",
      "title": "Abbott says dumped frontbencher ‘will be a big loss’ - as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T09:16:53.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nLey dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments\n\nAnalysis: The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo\n\nGet our breaking news email, free app or daily news podcast\n\nMatt Thistlethwaite, the assistant minister for foreign affairs and trade, said Israel’s strikes against top Hamas members in Qatar violated the nation’s sovereignty and imperilled ceasefire talks, adding the Australian government was not informed of the actions beforehand.\nThistlethwaite told RN Breakfast this morning the government condemned the strikes, adding:\nThese strikes violate Qatar’s sovereignty and they imperil a ceasefire and the release of the Israeli hostages. And unfortunately, they risk further escalation in the conflict.\nQatar’s been working quite hard behind the scenes alongside the United States and Egypt to try and broker a ceasefire and a release of hostages deal. So these strikes will imperil that. Nonetheless, it’s encouraging to hear Qatari leaders say that they remain committed to trying to broker an agreement and a ceasefire.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1048b6c9a0496fa1c607765db28b7d128291289",
      "title": "Qatari official discusses Israeli strikes on country targeting Hamas officials",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535527/qatari-official-discusses-israeli-strikes-on-country-targeting-hamas-officials",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-10T09:01:59.000Z",
      "summary_90w": "",
      "raw": "NPR talks with Majed Al Ansari, adviser to Qatar's prime minister and official spokesperson for the Ministry of Foreign Affairs, about Israeli strikes on Qatar targeting Hamas officials.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f5f7bd78ca39fa302ac879fc431ad2a1235ae06",
      "title": "Who is Lachlan Murdoch, the anointed media tycoon?",
      "url": "https://www.npr.org/2025/09/10/nx-s1-5535569/lachlan-murdoch-rupert-news-corp-fox",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T09:01:00.000Z",
      "summary_90w": "",
      "raw": "His position in leading News Corp. and Fox is now secure, as his father ends a dramatic succession battle. Lachlan grew up in New York City but has lived in Australia for much of his adult life.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7114bf6194f1cddff2d7d7dfa7ea08b601d92ca4",
      "title": "Watch: Mandelson says he regrets falling for Epstein's lies",
      "url": "https://www.bbc.com/news/videos/c5y5v8l14p6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T08:51:03.000Z",
      "summary_90w": "",
      "raw": "Watch: Mandelson says he regrets falling for Epstein's lies",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca54d46f94d5dbc1392b82407ff727cdfbd54523",
      "title": "Woman who bit off attacker's tongue acquitted after 61 years",
      "url": "https://www.bbc.com/news/articles/ckgezkrdjeko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T06:53:33.000Z",
      "summary_90w": "",
      "raw": "Choi Mal-ja only managed to break free after biting off about 1.5cm of her alleged attacker's tongue.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6d2dc749311b26b3a8323d703766f50549f55f47",
      "title": "How 'BMX in a wheelchair' became an online sensation",
      "url": "https://www.bbc.com/sport/articles/cvg3px16zlmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T05:50:17.000Z",
      "summary_90w": "",
      "raw": "WCMX - short for wheelchair motocross - is the para-sport taking social media by storm. So what is it, and what is its future?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d2656caf5b61b0264a1b2533e0508ddfb637a47",
      "title": "Anti-Islamic US biker gang members run security at deadly Gaza aid sites",
      "url": "https://www.bbc.com/news/articles/cm2zy4l8jgeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T05:00:09.000Z",
      "summary_90w": "",
      "raw": "BBC identifies members of Infidels MC gang hired as armed security at US and Israel-backed aid sites.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T04:49:54.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7314c5d1c78502f4efe20b8d90ba421798102985",
      "title": "Federal judge blocks Trump from firing Fed Governor Lisa Cook, for now",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5529281/appeals-court-lisa-cook-federal-reserve-independence-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-10T03:29:38.000Z",
      "summary_90w": "",
      "raw": "Federal Reserve Governor Lisa Cook won a round in federal court in her bid to keep her job despite President Trump's effort to fire her.  On Wednesday, the Justice Department said Trump would appeal.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6f917466683095255dab3a4e1782a394f7c187e9",
      "title": "Discovery of new campsite shows fugitive Tom Phillips had ‘outside help,’ NZ police say",
      "url": "https://www.theguardian.com/world/2025/sep/10/tom-phillips-new-zealand-man-fugitive-father-outside-help-nz-police-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T02:57:50.000Z",
      "summary_90w": "",
      "raw": "Phillips had spent nearly four years hiding in the wilderness with his three children before he was killed in an exchange of fire with police on Monday\nFugitive father Tom Phillips was receiving outside help during his years on the run before he was killed in a police shoot-out this week, New Zealand police said on Wednesday as they released images that show a newly discovered campsite.\nPhillips had spent nearly four years hiding in the wilderness with his three children. He was killed in an exchange of fire with police after reports of a burglary in the remote town of Piopio, in the central North Island, on Monday.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c8806bc79f439f27ac2774b287d7319b8a569d12",
      "title": "Hamas claims leadership survived Israeli attack in Doha, but confirms six deaths",
      "url": "https://www.bbc.com/news/articles/ced58zywdwno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T02:06:16.000Z",
      "summary_90w": "",
      "raw": "Meanwhile, the White House says the Israeli strike \"does not advance Israel or America's goals\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ede068236d5528edbf4df0047ce9cb8f340fd05",
      "title": "Nepal anti-corruption protests explained",
      "url": "https://www.bbc.com/news/articles/crkj0lzlr3ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-10T01:38:31.000Z",
      "summary_90w": "",
      "raw": "Protests in Nepal turned  deadly after thousands of youngsters marched against the blocking of social media platforms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2e6aa52f4c884c36ffed1ff202583bab55424a8",
      "title": "See stunning shots of Chappell Roan, Charli XCX and Doja Cat up for music photo award",
      "url": "https://www.bbc.com/news/articles/c306n1ve8y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-10T00:17:44.000Z",
      "summary_90w": "",
      "raw": "Abbey Road studios' nominees for its Music Photography Awards had 20,000 submissions from 30 countries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbfa6840189ef6b0abde8217328c3b41afcf0ed8",
      "title": "Abducted Israeli-Russian researcher Elizabeth Tsurkov freed in Iraq",
      "url": "https://www.bbc.com/news/articles/cx2xydl9pdjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T21:45:29.000Z",
      "summary_90w": "",
      "raw": "A Princeton student \"tortured for many months\" by Iraqi militia is now in the US embassy, President Trump says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf4a56d44ef7fdeb4cd2eccd77400c36a6c59d82",
      "title": "First two Brazilian judges vote to convict Jair Bolsonaro in coup plot trial",
      "url": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T21:30:45.000Z",
      "summary_90w": "",
      "raw": "Three more supreme court justices to cast their votes in coming days, with verdict expected by Thursday\n\n‘He’s always on the attack’: the Brazilian judge prosecuting Bolsonaro inspires both love and hate\n\nJair Bolsonaro led a criminal organisation that sought to plunge Brazil back into dictatorship with a murderous power grab involving special forces assassins and a vast disinformation campaign, the supreme court judge presiding over the former president’s trial has claimed as he voted for Bolsonaro’s conviction.\nAlexandre de Moraes was the first supreme court justice of five to announce his decision on Tuesday, as the trial of Bolsonaro and seven alleged co-conspirators – including four senior members of the military and the former head of Brazil’s answer to MI6 – entered its final stretch.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "af0bd3238973b03e67bcd48cf2d3be2573adb540",
      "title": "Pressure mounts on Bolsonaro as two out of five judges find him guilty",
      "url": "https://www.bbc.com/news/articles/ceq2lv20rp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:54:49.000Z",
      "summary_90w": "",
      "raw": "The Brazilian ex-president is accused of plotting a coup to cling to power, which he denies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "147efeea67aea93f276f37a14b2d4fea1b8c886f",
      "title": "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535813/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:47:28.000Z",
      "summary_90w": "",
      "raw": "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4594d1aba0cfe8215d7c138089f20cd34937c619",
      "title": "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535806/supreme-court-trump-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T20:43:10.000Z",
      "summary_90w": "",
      "raw": "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e91d45d92e13eeac88ffa27aa92e3fb153140722",
      "title": "Russian air strikes get deadlier and bigger, hitting Ukraine's very heart",
      "url": "https://www.bbc.com/news/articles/cgrqwpee05ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T20:20:36.000Z",
      "summary_90w": "",
      "raw": "Ukraine says Russia deliberately hit the main government building in Kyiv with a missile last Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e7d2f29e26637ce4c23acfcd8c9663e5b1ba977a",
      "title": "Israel Strikes Hamas In Qatar",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1tc3m?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T20:07:00.000Z",
      "summary_90w": "",
      "raw": "Hamas says six people killed in air strike but its leadership team survived.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ab57dffe2f1e167f72af1643fea1f785c951095c",
      "title": "Bowen: Diplomacy in ruins after Israel strikes Hamas leaders in Qatar",
      "url": "https://www.bbc.com/news/articles/cm2zepgp5neo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T19:06:52.000Z",
      "summary_90w": "",
      "raw": "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb0f4fb08dcbd799b74300e0208aebfc7f5fbc13",
      "title": "What's in the book of birthday messages to Epstein",
      "url": "https://www.bbc.com/news/articles/cr5q68j2169o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T18:08:42.000Z",
      "summary_90w": "",
      "raw": "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3e8da303c0ae690bcabf79ae59862e52da45f4e2",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "url": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T17:45:02.000Z",
      "summary_90w": "",
      "raw": "Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged\nA Canadian beekeeper has described fending off thousands of “robber bees” as they raided her shop in a brazen attempt to steal honey.\nChristine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e07b34831be5e4cb07a32f4935262aa84c1d532e",
      "title": "A government building struck in Kyiv and a new threat from Trump",
      "url": "https://www.bbc.co.uk/sounds/play/p0m1srdr?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-09T17:39:00.000Z",
      "summary_90w": "",
      "raw": "Trump says he'll respond after Ukraine's main cabinet building was hit",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73f065a0ff97169913df5471d003c050292c6048",
      "title": "More than a dozen robbers storm jewellery shop in California",
      "url": "https://www.bbc.com/news/videos/c1edl9qppelo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T17:11:04.000Z",
      "summary_90w": "",
      "raw": "An 88-year-old jewellery store owner in San Jose is recovering after being assaulted during a violent smash-and-grab robbery.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f5918c218af77de942924ab7e1d34ca9e41297eb",
      "title": "Protect Arctic from 'dangerous' climate engineering, scientists warn",
      "url": "https://www.bbc.com/news/articles/c5yqw996q1ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T16:41:07.000Z",
      "summary_90w": "",
      "raw": "Controversial approaches to cooling the planet are unlikely to work, according to dozens of polar scientists.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "23860b3f9f961d5b7f8a07f1a387073adbdf2088",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "url": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T16:19:28.000Z",
      "summary_90w": "",
      "raw": "Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts\nEthiopia has inaugurated Africa’s largest hydroelectric dam, a project that could transform the country’s energy sector but may also aggravate tensions with neighbouring Egypt.\nState media showed the Ethiopian prime minister, Abiy Ahmed, touring the site of the Grand Ethiopian Renaissance Dam (GERD) in Guba district with the Kenyan president, William Ruto, the Somali president, Hassan Sheikh Mohamud, and the African Union chairperson, Mahmoud Ali Youssouf.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b6c653830a09a7b83e60d235b433366ef9d4cb9",
      "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
      "url": "https://www.bbc.com/news/articles/cr4qx6377qgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T15:33:01.000Z",
      "summary_90w": "",
      "raw": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0b7bbe56c335a5284801381e0fb0268841ce0acb",
      "title": "'The Office' creators deliver 'The Paper,' a sharp mockumentary about journalism",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5535137/the-office-creators-deliver-the-paper-a-sharp-mockumentary-about-journalism",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:54:18.000Z",
      "summary_90w": "",
      "raw": "The issues facing journalism these days — from online clickbait to corporate interference — run throughout The Paper. But it's primarily a comedy, with characters and actors that will win you over.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ff781d4ecbf542b83b9a66b2ca9a2351a4006098",
      "title": "BLS revision shows annual hiring was overstated by 911,000 jobs",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5527000/bls-us-job-growth-numbers-revised",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T14:25:54.000Z",
      "summary_90w": "",
      "raw": "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dca2ecd0afbc054bf1d12216cba5a31ed1155838",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "url": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T14:16:54.000Z",
      "summary_90w": "",
      "raw": "ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery\nAn international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.\nThe ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.\nReuters and Agence France-Presse contributed to this report\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "32db2407a94e414f83c0b83b96fc7c1cdc34389d",
      "title": "White House denies Trump's alleged birthday message to Epstein is authentic",
      "url": "https://www.bbc.com/news/articles/cvgqnn4ngvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T12:48:55.000Z",
      "summary_90w": "",
      "raw": "The message purportedly written by Trump is inside a 238-page book released by a House committee.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b3984b0d0eb2e510cdc51e291e349ccf3bdaca9",
      "title": "Israeli military orders all Gaza City residents to evacuate ahead of ground assault",
      "url": "https://www.bbc.com/news/articles/cvg47kvld8go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-09T11:48:49.000Z",
      "summary_90w": "",
      "raw": "Prime Minister Netanyahu says recent strikes on high-rises are \"only the beginning of the main, intensive operation\" to capture the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1097d90ff1d8a06a7f69bf485cef26b33abb0a4a",
      "title": "Here's what happens when private equity buys homes in your neighborhood",
      "url": "https://www.npr.org/sections/planet-money/2025/09/09/g-s1-87699/private-equity-corporate-landlords",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-09T11:00:00.000Z",
      "summary_90w": "",
      "raw": "What makes rents go down and neighborhood diversity go up? Corporate landlords. But they also make it harder to own for yourself.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c8bcfe7c298f2af143f6a3d6085bd62a04637a23",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T10:32:15.000Z",
      "summary_90w": "",
      "raw": "Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate\nCampaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.\nAfter two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b43f1a70cd709e15aa36363cd06d0de67efbd2d1",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "url": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T06:31:43.000Z",
      "summary_90w": "",
      "raw": "Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nThe federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.\nSpeaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ece71a23b6e5a2325eb7e2270ecc836c45ed488",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T04:33:45.000Z",
      "summary_90w": "",
      "raw": "Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023\nThailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.\nThe court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when he returned to the country from self-imposed exile in 2023. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the VIP wing of a hospital on health grounds, where he stayed for six months before he was released on parole.\n\r\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.\n\r\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "debd7e2c46e25ddc522864d3905219109fa8275b",
      "title": "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5534435/rupert-murdoch-fox-news-family-succession-lachlan",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T21:37:22.000Z",
      "summary_90w": "",
      "raw": "The owner of Fox News, the Wall Street Journal and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "5b0777425ff706aa0a48864d0d28e30987c4189a",
      "title": "Why the French PM had to go and what happens next?",
      "url": "https://www.bbc.com/news/articles/cy4r7dmxgxmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T17:18:52.000Z",
      "summary_90w": "",
      "raw": "France's prime minister has lost a confidence vote, sending parliament into another period of chaos and uncertainty.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9cb378cc85e8cb3a084ce045d63bad7d81ad4efb",
      "title": "How the coup trial of Jair Bolsonaro has divided Brazil",
      "url": "https://www.bbc.com/news/articles/cn4wx9zlpj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T14:37:59.000Z",
      "summary_90w": "",
      "raw": "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad493b6571b070104319d7c7cc6ee9601d114a87",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-08T10:38:22.000Z",
      "summary_90w": "",
      "raw": "Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap\nThe first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.\nAfrican leaders are meeting this week in Addis Ababa, Ethiopia, for the Africa Climate Summit, a precursor to the global UN Cop30 in November. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a17d725e28af25ca18a225e04e46ddd1a9a797a8",
      "title": "Watch: Glitz, glamour and emotional speeches at VMAs 2025",
      "url": "https://www.bbc.com/news/videos/crl5ngr2069o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-08T09:04:06.000Z",
      "summary_90w": "",
      "raw": "The MTV Video Music Awards (VMAs) have taken place in New York, with high profile figures in the music industry taking to the red carpet.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6e00fb424ec91f139262628f5690412ff9932b90",
      "title": "Food-makers are phasing out artificial dyes. The problem: Americans love the color",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5529276/sams-club-food-dye-taste-history",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Sam's Club is among the food makers removing artificial dyes from products, yet hoping shoppers don't notice a difference in color. But why?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4e133915e567a4a9e7e19cac9a646df02aaff1b",
      "title": "The U.S. is a major importer of Indian products made from Russian oil",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5522001/india-tariffs-russia-oil-imports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-08T09:00:00.000Z",
      "summary_90w": "",
      "raw": "The United States imports oil products from India's Reliance Industries refinery, which sources nearly half its oil from Russia.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "03b8fd0252e81ca33e69e04c5abb9c6184e01504",
      "title": "Protein: how much do we really need?",
      "url": "https://www.bbc.co.uk/sounds/play/m001xzrx?at_mid=JAhdrOsaPb&at_campaign=Protein_Powerhouse_or_Piffle&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=m001xzrx&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Protein_Powerhouse_or_Piffle&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2024-03-27T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Protein is having a moment in the spotlight. Should you be worried about getting enough?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "718896b0758d6c64e59ebada083240771ee61c61",
      "title": "Barry Humphries' funniest, rudest and most revealing moments",
      "url": "https://www.bbc.co.uk/iplayer/episode/m001mg0t/barry-humphries-at-the-bbc?at_mid=0YPJFFVFb6&at_campaign=Barry_Humphries_at_the_BBC&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m001mg0t&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Barry_Humphries_at_the_BBC&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2023-05-28T21:02:25.000Z",
      "summary_90w": "",
      "raw": "Alex Jones looks back at the highlights of Barry’s career on a selection of BBC shows.",
      "topics": [
        "World"
      ]
    }
  ]
}