{
  "version": "1758025471765",
  "generatedAt": "2025-09-16T12:24:31.765Z",
  "items": [
    {
      "id": "d75492610f9e1ab79f9bad28b6be26f61f7c2027",
      "title": "Hillsborough Law will force officials to tell truth in investigations",
      "url": "https://www.bbc.com/news/articles/czrpvrrrmj2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T12:15:29.000Z",
      "summary_90w": "",
      "raw": "The proposed law would force public bodies to co-operate with investigations into major disasters.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "15db70eb01303d19b9a5e212536025cf5f530c11",
      "title": "Y Combinator-backed Rulebase wants to be the AI coworker for fintech",
      "url": "https://techcrunch.com/2025/09/16/y-combinator-backed-rulebase-wants-to-be-the-ai-coworker-for-fintech/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T12:03:04.000Z",
      "summary_90w": "",
      "raw": "Y Combinator-alum Rulebase is betting that the next wave of automation in financial services will be the unglamorous tasks.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7b4a3c8f5e4a0d6ca5a739ee8c0409daf458b4e1",
      "title": "Israel turning Gaza City into mass graveyard, Palestinian foreign ministry says, as IDF launches ground offensive - latest updates",
      "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T12:01:46.000Z",
      "summary_90w": "",
      "raw": "Palestinian foreign ministry accuses IDF of deliberately targeting civilians\nWafa, the Palestinian news agency, has been told by medical sources that at least 38 Palestinian people, including women and children, have been killed by Israeli forces since dawn today.\nAs well as facing relentless bombardments, Gaza City, the biggest built-up area of the territory, is being gripped by a famine caused by Israel’s restrictions on aid.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "112af67a558fb54a33387af5ed76c1ca28aa5816",
      "title": "Apple Watch Series 11 review: stuck in the middle",
      "url": "https://www.theverge.com/smartwatch-review/778012/apple-watch-series-11-review-hypertension-5g-sleep-score-wearables-smartwatch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The Series 11 is a great smartwatch, but it’s not the most exciting one.\t\n\nNo one is going to wax lyrical about the Apple Watch Series 11. Not because it's a bad smartwatch - it's a great smartwatch, actually. There's just nothing that makes it feel special this year. Alas, the $399 Series 11 is the middle child of Apple Watches.\nIt's not the Series 11's fault that the entry-level Apple Watch SE 3 got a major glow-up. It can't help that the Apple Watch Ultra 3 gets everything the Series 11 has plus satellite connectivity. But there's little to mask the fact that this watch doesn't offer much more than the entry-level SE 3. You're mostly paying extra for a bit of polish.\nHardware-wise, the Series 11 is nearly iden …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cb138704bc9f013c7c1387921fa6b9c8979894e",
      "title": "Kayak co-founder takes on Calendly with new Supercal scheduling platform",
      "url": "https://techcrunch.com/2025/09/16/kayak-co-founder-takes-on-calendly-with-new-supercal-scheduling-platform/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The entrepreneur has launched Supercal, a free scheduling platform that’s designed to make booking meetings more efficient and simple.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f0c43a483d7315827196d748c4ac96ac30c4f2",
      "title": "Meta&#8217;s new smart glasses are coming this week",
      "url": "https://www.theverge.com/news/777541/meta-connect-2025-what-to-expect",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Meta’s next big Connect conference is nearly here, and this year, we’re expecting to see a lot of news about glasses. AI-focused hardware is all the rage, and Meta arguably already has the best gadgets around in its Ray-Ban and Oakley glasses. At this year’s show, we’re expecting to see more about glasses, but also some standalone AI updates and even some talk of the metaverse.\nHere’s what we’re expecting from Connect, which will feature a keynote from CEO Mark Zuckerberg that we’ll be covering live on Wednesday at 8PM ET / 5PM PT.\nSmart glasses with a display and a wristband\nMeta plans to announce new smart glasses with a small display in the right lens that can be controlled with hand gestures via a wristband, CNBC reports. The display apparently has a limited field of view and is only intended to show small pieces of information. The Verge reported on the glasses, codenamed Hypernova, in 2022.\nThe wristband will apparently use surface electromyography (sEMG) technology that “reads and interprets the electrical signals from hand movements,” according to CNBC. The tech comes from CTRL-Labs, a startup Meta acquired in 2019, and Meta demoed it last year with its augmented reality Orion glasses. Meta is very optimistic about sEMG technology; in a recent blog post, it said that “sEMG could revolutionize how we interact with our devices” and that sEMG “may just prove to be the perfect input for virtually any device.”\nThe new glasses are expected to cost “about $800,” CNBC says, and could be thicker and heavier than some of Meta’s other smart glasses offerings. And a now-removed video from Meta caught by UploadVR actually showed a pair of new glasses with a display with the branding “Meta | Ray-Ban” and “Display,” so it seems like Meta is on the cusp of actually launching these.\nSmart glasses without a display\nMeta’s smart glasses have been a big success — EssilorLuxottica, which produces the Ray-Ban Metas, said that the company has sold 2 million pairs of the glasses — and rumors indicate that Meta could introduce new models at Connect.\nCNBC reports that Meta plans to announce third-generation Ray-Ban Metas. The timing would make some sense. Meta launched the previous-generation Ray-Bans about two years ago, and this year’s Oakley Meta HSTN Limited Edition glasses have a better 3K video resolution and double the battery life, so perhaps Meta will bring some of those improvements over to the Ray-Ban line.\nThe Meta video spotted by UploadVR also showed off a pair of new wraparound “Sphaera” Oakleys with a camera on the nose bridge, so it seems like those could show up at Connect, too.\nNew Quest VR headsets? We’ll see\nMeta released the Quest 3 in 2023 and the Quest 3S in 2024, but it doesn’t seem like we should expect a new Quest at Connect this year. According to UploadVR, Meta is working on an ultra-light headset that offloads the compute to a puck that runs the company’s Horizon OS, but the headset isn’t scheduled for release until 2026. \nMeta has also started licensing Horizon OS to hardware companies like Lenovo and Asus, and a rumor from earlier this year indicated that Asus is developing a VR headset codenamed Tarius with eye tracking and face tracking. Should that headset be real, it could debut at Connect.\nThe company is promising that Zuckerberg will touch on the metaverse in some way, so we’ll have to wait and see what that actually means.\nMore Meta AI\nMeta, like most tech companies, is obsessed with AI right now, so it seems likely the company will tout AI features coming to its apps and hardware. Meta recently relaunched its companion app for its smart glasses as a standalone Meta AI app that lets you browse AI-generated creations posted by other users, and Meta could further build out its social features. The company has also continued to add AI tools to its smart glasses, so in addition to brand-new hardware, existing hardware could get some AI-focused upgrades.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9633266cc6557871f71eecbf2efffe6e6f67af89",
      "title": "The Apple Watch SE 3 is the one to buy",
      "url": "https://www.theverge.com/smartwatch-review/778037/apple-watch-se-3-review-battery-specs-watchos-26-smartwatch-wearable",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T12:00:00.000Z",
      "summary_90w": "",
      "raw": "The Apple Watch SE 3 is the star of this year’s lineup.\t\n\nWhen I walked into Apple Park last week, there was one thing that I did not have on my bingo card: the $249 Apple Watch SE 3 stealing the show from the Apple Watch Series 11 and the Apple Watch Ultra 3.\nBut here we are. It's 2025, and the entry-level Apple Watch is the one I'm most excited by.\nThat's because compared to the iterative updates of the Series 11 and Ultra 3, the third-gen SE has gotten a massive, wide-ranging glow-up. Unlike the other watches, there also weren't any leaks suggesting this was even in the cards, making this jam-packed release a total surprise. And the cherry on top? In the lead-up to the event, I wrote the easie …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b916bd26f9b9f65d016b95233d8fa0e6006b6dc",
      "title": "Spain first of Eurovision ‘big five’ to decide on boycott if Israel participates",
      "url": "https://www.theguardian.com/tv-and-radio/2025/sep/16/spain-eurovision-boycott-israel-gaza-war",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T11:57:21.000Z",
      "summary_90w": "",
      "raw": "State broadcaster says it will withdraw from next year’s contest in Vienna unless Israel is excluded over Gaza war\nSpain has become the latest country to say it will not take part in next year’s Eurovision song contest if Israel participates.\nBoard members of the state broadcaster RTVE voted in majority favour of boycotting the contest if Israel is among the countries fielding an entry next year.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2484c5f7f4d149f5041fe5b085336ea69bda5310",
      "title": "Report those who celebrate Charlie Kirk death to employers, Vance says",
      "url": "https://www.bbc.com/news/articles/cn0r5y33pj5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T11:40:56.000Z",
      "summary_90w": "",
      "raw": "The vice-president's remarks come amid a wave of firings over posts deemed inappropriate about Kirk's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cf5ead8e462806116c105c96def30dc2d8cbacbf",
      "title": "Starmer orders investigation into MI5 after BBC exposed false evidence in spy case",
      "url": "https://www.bbc.com/news/articles/cn834zwe83lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T11:37:41.000Z",
      "summary_90w": "",
      "raw": "It will look at why the security service gave false evidence to three courts about conversations with BBC News.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a33e6b8175f49e19274401f35426a9bfc0b4ec85",
      "title": "Former Tory minister Maria Caulfield defects to Reform",
      "url": "https://www.bbc.com/news/articles/c1wg3zx4r0qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T11:30:36.000Z",
      "summary_90w": "",
      "raw": "Caulfield lost her seat at last year's general election, after nearly nine years as the MP for Lewes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b74f3900ce94a0b30b37c6c36ad774dac862cb1",
      "title": "Spain says it will withdraw from 2026 Eurovision song contest if Israel takes part — Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/16/zelenskyy-trump-sanctions-russia-news-updates-europe-live",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T11:24:26.000Z",
      "summary_90w": "",
      "raw": "Spain is the first of the ‘Big Five’ countries to threaten withdrawal from the competition following vote at state broadcaster RTVE\nEU commissioners will on Wednesday agree to impose new sanctions against Israel over its war in Gaza, a spokesperson for the commission said on Tuesday.\n“Tomorrow, commissioners will be adopting a package of measures on Israel,” spokesperson Paula Pinho said, as reported by Reuters.\n“Specifically, a proposal to suspend certain trade provisions in the agreements between the EU and Israel.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1f437c4305d1475e2189317bbe83da7439a4239f",
      "title": "Queen Camilla pulls out of Duchess of Kent's funeral",
      "url": "https://www.bbc.com/news/articles/cpq5eynnn8ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T11:23:53.000Z",
      "summary_90w": "",
      "raw": "Mourners, including the King and other senior royals, will gather later at Westminster Cathedral.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "08fc7c2a54c00dca2d02e477cbd9f5b83c6a9950",
      "title": "'The bombing has been insane': Gaza City Palestinians scramble to flee Israeli assault",
      "url": "https://www.bbc.com/news/articles/cly0qnnx5w5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T11:17:33.000Z",
      "summary_90w": "",
      "raw": "Palestinians tell the BBC whole residential blocks have been levelled as the Israeli army ramps up its offensive in the city.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7b70c9f777466deddfb2fcdaf1d9193dbf3b1d6",
      "title": "Who will win Champions League? BBC Sport experts make predictions",
      "url": "https://www.bbc.com/sport/football/articles/c1kwmjxwpkxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:58:45.000Z",
      "summary_90w": "",
      "raw": "As the Champions League returns on Tuesday, BBC Sport experts predict their winners, which English team will go furthest, a surprise package and most exciting player to watch.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b9e6b3975ec95d38d6df0851b888e32fdfed389",
      "title": "Kenya issues arrest warrant for British national over young mother's murder",
      "url": "https://www.bbc.com/news/articles/cwywng4jp08o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:56:53.000Z",
      "summary_90w": "",
      "raw": "The 21-year-old was killed in 2012 and her body found in a septic tank in the garrison town of Nanyuki.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ceb2cd4bfde16df65f0b72ca232a69f7671d51e8",
      "title": "Federal court blocks Trump from sacking Lisa Cook",
      "url": "https://www.bbc.com/news/articles/c0ezqr7l774o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T10:51:27.000Z",
      "summary_90w": "",
      "raw": "Trump is trying to oust Cook from her role as part of a standoff between the president and the US central bank.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04da945fe8ca211209ead66e44b87ebf9ea0039c",
      "title": "Self-styled 'African tribe' evicted from Scottish woodland camp",
      "url": "https://www.bbc.com/news/articles/c0kn3ex156mo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:51:13.000Z",
      "summary_90w": "",
      "raw": "Three members of the self-proclaimed Kingdom of Kubala have been living near Jedburgh for several months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "600187cceee2450e313fe3dd0fada30c15388daf",
      "title": "Trump says he will sue New York Times for $15bn",
      "url": "https://www.bbc.com/news/articles/cevz419pk8vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:49:14.000Z",
      "summary_90w": "",
      "raw": "He has accused the paper of defamation and libel, saying it served as a \"mouthpiece\" for Democrats.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4fda108e96638becd32441a61f74ead623332d49",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "url": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T10:46:54.000Z",
      "summary_90w": "",
      "raw": "High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old\nA warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.\nThe high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and seeking the application for a warrant of arrest to facilitate his extradition to Kenya.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "819ec2c450805943512a79d1053c8b8b734871c7",
      "title": "Kirk shooting suspect appeared to confess on Discord",
      "url": "https://www.bbc.com/news/articles/cm2zkxy2xmno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:46:28.000Z",
      "summary_90w": "",
      "raw": "Tyler Robinson is thought to have discussed the killing on the online platform before his arrest.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "81c73f387ee8b7b1b8cd37bd3c997a180f2a06f8",
      "title": "Partey 'ready' to face Spurs before court appearance",
      "url": "https://www.bbc.com/sport/football/articles/cgj18w8886vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:42:35.000Z",
      "summary_90w": "",
      "raw": "Thomas Partey is \"ready\" to face Tottenham, a day before he is set to appear in court on rape and sexual assault charges, says Villarreal manager Marcelino.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc4c0f4f0ff9b00978383f98545ab1f2b23a1fa5",
      "title": "Winter fuel payments stopped for 9.3 million people before government U-turn",
      "url": "https://www.bbc.com/news/articles/cgrq5049j0yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:39:00.000Z",
      "summary_90w": "",
      "raw": "Official data shows the number of people who received winter fuel payments after now-reversed government cuts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d9c43fb441c35770a1cccead69f430428d827274",
      "title": "Justin Bieber and Sabrina Carpenter to headline Coachella 2026 ",
      "url": "https://www.bbc.com/news/articles/cr5q8zg0zy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:34:04.000Z",
      "summary_90w": "",
      "raw": "Karol G will also top the bill at the festival held in the Californian desert.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "531e086dadcc5af5e20401606ad1a5a3f9f55381",
      "title": "Artefacts recovered from Titanic's sunk sister ship",
      "url": "https://www.bbc.com/news/articles/cn4wq2we4jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T10:30:20.000Z",
      "summary_90w": "",
      "raw": "Items retrieved from the wreck of HMHS Britannic in the Aegean include a bell and binoculars, Greece says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "186387d96ddac98408cdbe3f00f17ed1441d075e",
      "title": "Homes damaged, cars swept away as rains flood India's Uttarakhand",
      "url": "https://www.bbc.com/news/videos/c8641vd73jxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T10:22:35.000Z",
      "summary_90w": "",
      "raw": "Rescue efforts are under way after the Himalayan region was hit by torrential downpour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "759b9a63b3d804b85d6b0f0a8d9f0858781c8238",
      "title": "State pension likely to rise by 4.7% in April",
      "url": "https://www.bbc.com/news/articles/c62lnzdndkeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:19:29.000Z",
      "summary_90w": "",
      "raw": "Earnings figures for the three months to July are used for the yearly increase.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "508523d29fa5a0b054bf832601485b156966430e",
      "title": "Jaguar Land Rover could face disruption until November after hack",
      "url": "https://www.bbc.com/news/articles/czewlj57e24o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T10:11:30.000Z",
      "summary_90w": "",
      "raw": "The firm will restart production on 24 September but industry sources warn the impact could last longer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bee2d671e792b9e41d8c8b279f661c456773fba7",
      "title": "Microsoft favors Anthropic over OpenAI for Visual Studio Code",
      "url": "https://www.theverge.com/report/778641/microsoft-visual-studio-code-anthropic-claude-4",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T10:08:19.000Z",
      "summary_90w": "",
      "raw": "Microsoft is adding automatic AI model selection to its Visual Studio Code editor that will automatically pick the best model for \"optimal performance.\" This new auto model feature will select between Claude Sonnet 4, GPT-5, GPT-5 mini and other models for GitHub Copilot free users, but paid users will \"primarily rely on Claude Sonnet 4.\"\nIt's a tacit admission from Microsoft that the software maker is favoring Anthropic's AI models over OpenAI's latest GPT-5 models for coding and development. Sources familiar with Microsoft's developer plans tell me that the company has been instructing its own developers to use Claude Sonnet 4 in recent m …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15bae7e8b385010477e7d6b33550a7c3e4f3e3b1",
      "title": "JD Vance vows to carry on Kirk's legacy. And, the Fed meets to decide interest rates.",
      "url": "https://www.npr.org/2025/09/16/g-s1-88997/up-first-newsletter-jd-vance-charlie-kirk-kash-patel-testimony-federal-reserve-interest-rates",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T10:03:28.000Z",
      "summary_90w": "",
      "raw": "Vice President Vance hosted Charlie Kirk's podcast yesterday and vowed to carry on his friend's political legacy. And, the Federal Reserve meets to decide interest rates.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b85028e4ac0ffa1cf53c882974310a7fc3380067",
      "title": "Nothing plans to launch &#8216;first AI-native devices next year&#8217;",
      "url": "https://www.theverge.com/news/778636/nothing-ai-native-devices",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T10:02:07.000Z",
      "summary_90w": "",
      "raw": "Nothing’s Android-based Phone 3.\t\n\nLondon-based consumer tech startup Nothing has raised $200 million and vowed to usher in a new generation of “AI-native” devices running on operating systems that “are significantly different from the ones today.”\nIn a press release that reads part ode to technology and part manifesto, Nothing founder and CEO Carl Pei said the cash infusion — which values Nothing at $1.3 billion — will help the company ramp up distribution and accelerate innovation. \nAt the heart of Nothing’s plans is AI. Pei said the company is “building the foundations for the future” on a focused “AI OS” to deliver a “hyper-personalized experience.” However, it’s unclear if Nothing’s operating system ambitions are built on top of Android like Nothing OS. We’ve reached out for clarification.\nThis “AI-native platform” will run hardware in widespread use today like smartphones, headphones, and smart watches, Pei said, as well as other devices like smart glasses, electric vehicles, and humanoid robots. He confidently predicts Nothing’s new OS will run “whatever comes next,” too. That said, last October Pei just as confidently proclaimed that “AI is just a tool” and that the company’s OS should not be described as an AI operating system.\nNothing plans to release its first AI-native devices next year. Its chief challenge will be generating demand in a category that has historically failed to engage the mass market and where success has eluded even the industry’s biggest players like Apple. There’s no shortage of competitors either, including the mysterious “screen free” device former Apple designer Jony Ive is creating with OpenAI. \nNothing says it’s uniquely positioned to create these future AI devices. “Owning the last-mile distribution point with all its contextual and user knowledge is essential to developing an OS that will help people in their daily lives,” said Pei. “An AI OS that doesn’t know its user and isn’t ever-present can’t deliver a hyper-personalised experience. This is the next chapter for Nothing, integrating an AI experience into our hardware devices to reinvent how technology amplifies us.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf1ead77844492def427441a62a9e551b68f045c",
      "title": "Donald Trump files $15 billion defamation lawsuit against The New York Times",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543030/donald-trump-nytimes-lawsuit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T10:00:40.000Z",
      "summary_90w": "",
      "raw": "President Donald Trump filed a $15 billion defamation lawsuit against The New York Times and four of its journalists on Monday, according to court documents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5e978d33c4ef7cb6123a6191a84d5223e9a2b250",
      "title": "Is telehealth a good idea, or should I see my regular doctor?",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5500317/telehealth-prescribing-visits-insurance",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Social media is full of their colorful ads, but are online doctors legit? Here's the lowdown on the pros and cons of online medicine.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48fea43efd9bb587e9331c6fed4335f764cd9a40",
      "title": "On 9/16/25, celebrate a date of mathematical beauty",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5535545/pythagorean-triple-square-day-9-16-25",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Pythagorean Triple Square Day, as one man affectionately calls 9/16/25, is a day like no other this century.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ce5fb89bfc1a54454bb1ea596313e3a27e86fe1",
      "title": "Russia has network of 200 camps for ‘brainwashing’ Ukrainian children – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/16/russia-has-network-of-200-camps-for-brainwashing-ukrainian-children-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T09:50:54.000Z",
      "summary_90w": "",
      "raw": "Investigation uncovers documents and satellite imagery that confirm children being taken to sites for patriotic indoctrination, weapons training and combat drills\nRussia is running an extensive network of more than 200 camps to re-educate, Russify and militarise Ukrainian children, a new investigation has found.\nThe facilities, across Russia and occupied Ukraine, include camps as well as schools, military bases, medical facilities, religious sites and universities.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc7fc0e97e2ed12b20cdd947e7c960badb2b3e9f",
      "title": "Israel launches ground offensive deep inside Gaza City",
      "url": "https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T09:48:55.000Z",
      "summary_90w": "",
      "raw": "Overnight advance aimed at ‘dismantling Hamas’s grip’ as Israel accused of genocide in UN human rights report\n\nMiddle East crisis – live updates\n\nIsrael has launched its long-threatened ground offensive into the densely packed streets of Gaza City, military officials have confirmed.\nOne Israel Defense Forces (IDF) official said that troops had begun what he called the “main phase” of the offensive, with an overnight advance from the outskirts towards the city centre.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0a6312505e8e474f11a0efed51b03de5f5914245",
      "title": "Google owner reveals £5bn AI investment in UK ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/crmek723dz9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T09:44:20.000Z",
      "summary_90w": "",
      "raw": "Google's president and chief investment officer Ruth Porat tells the BBC there are \"profound opportunities in the UK\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a7a9e2255935613c1c77cb94017f78c46b44da9",
      "title": "Israel has committed genocide in Gaza, UN commission of inquiry says",
      "url": "https://www.bbc.com/news/articles/c8641wv0n4go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T09:19:39.000Z",
      "summary_90w": "",
      "raw": "The panel finds that four of the five genocidal acts defined under international law have been carried out against Palestinians during the war.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "24b5508922bae914571822ca338995e9828500b3",
      "title": "How long can the UK afford the pension triple lock?",
      "url": "https://www.bbc.com/news/articles/c9wdgk7ggezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T09:04:55.000Z",
      "summary_90w": "",
      "raw": "The policy has been a success, but economists have raised questions around its fairness and its sustainability.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9829d3c1e9141a133549cf99e2a22fd6427ccf37",
      "title": "Microsoft’s Xbox PC app adds Steam games and access to other stores",
      "url": "https://www.theverge.com/news/778627/microsoft-xbox-pc-app-stream-integration-stores-update",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T09:03:20.000Z",
      "summary_90w": "",
      "raw": "Microsoft is rolling out a new aggregated gaming library inside its Xbox PC app today on Windows. The updated app will now list games from Steam, Battle.net, and other PC storefronts — making it a launcher for games you have installed on your PC.\nMicrosoft has been testing this aggregated library in recent months with Xbox Insiders, but it’s now available to all Xbox PC app users. It’s designed primarily for the new fullscreen Xbox experience that will ship on the Xbox Ally devices, but it’s also part of Microsoft’s efforts to make the Xbox app on Windows the home of PC gaming.\n“When you install a game from a supported PC storefront, it automatically appears in ‘My Library’ within the Xbox PC app, as well as the ‘Most Recent’ list of titles in the sidebar, so you can jump back into your favorite games with just a click,” explains Jason Beaumont, vice president of experiences at Xbox.\nAlongside the library integration, Microsoft is also rolling out a new My Apps section in the Xbox PC app that allows PC gamers to quickly install and launch third-party apps like browsers, gaming utilities, and rival storefronts. This new feature is also designed primarily for handhelds, to help people download and launch games from multiple stores.\nLater this month, Microsoft will also add cloud-playable games and game history to the Xbox app that syncs your recent games list on Xbox consoles, PC, or handheld. Microsoft already started rolling this out on Xbox consoles last month. “Once this feature is released, look for the ‘Jump back in’ list on the Home screen of your console, PC, or handheld to find your recent play history and pick up where you left off,” says Beaumont.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f87fdf5e55ad9c948f34f80a98065ac8c7d89da7",
      "title": "Queensland government to ban pill testing in move criticised by health advocates",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/queensland-government-to-ban-pill-testing-in-move-criticised-by-health-advocates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T09:01:00.000Z",
      "summary_90w": "",
      "raw": "Liberal National party expected to legislate ban this week, putting an end to testing of illicit drugs at festivals\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland’s state government is expected to ban pill testing, including at festivals, by attaching amendments to an unrelated bill in parliament in a move criticised by health advocates.\nUnder the previous Labor government, Queensland was the first state to establish a fixed pill-testing strategy on an ongoing basis, in 2024. Clinics were opened on the Gold Coast and in Brisbane.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "96397b93a92b62c72177a918aac2aa62a1069deb",
      "title": "FBI Director Patel set to testify on Capitol Hill amid questions over his leadership",
      "url": "https://www.npr.org/2025/09/16/g-s1-88926/fbi-director-patel-testimony-congress",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Kash Patel's appearance in the Senate comes at a delicate time for the director, who is a loyalist of President Trump but has no experience leading an organization like the FBI.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4317d487d4cca5872d01d8bf21ffe13cdac68c11",
      "title": "Kennedy's vaccine panel expected to recommend delaying hepatitis B shot in children",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/16/nx-s1-5542405/rfk-jr-acip-vaccine-advisory-panel-vote-delay-hepatitis-b-shot-in-infants",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T09:00:00.000Z",
      "summary_90w": "",
      "raw": "RFK Jr.'s hand-picked panel of vaccine advisors is expected to vote to delay the hepatitis B shot for newborns. Doctors warn that could fuel a return of a disease virtually eradicated in U.S. kids.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d835ded85dc470b853402c9bc294ee9dd1327bef",
      "title": "On Texas border, uninsured people stress the health system. It's set to get worse",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/16/nx-s1-5542408/health-insurance-obbba-texas-uninsurance-rates",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In South Texas' Rio Grande Valley, many people go without health insurance, and the health system struggles as a result. Similar communities dot the nation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "635ae6a06f8b559806b034c77594e4237d2eeb18",
      "title": "Woman, 81, spoke to undercover agent about animal euthanasia drugs to kill people, court hears",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/elaine-arch-rowe-spoke-to-undercover-agent-about-supplying-animal-euthanasia-drugs-to-kill-people-court-hears-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T08:33:50.000Z",
      "summary_90w": "",
      "raw": "Coroner ordered police investigation after postmortem of Gold Coast man revealed lethal dose of animal life-ending drug pentobarbitone\n\nGet our breaking news email, free app or daily news podcast\n\nAn 81-year-old woman accused of supporting a dodgy euthanasia service that provided a Gold Coast victim with a life-ending veterinary drug has been released from police custody.\nElaine Arch-Rowe was one of three people – including a father and son – charged over a police probe into the alleged assisted suicide of a Gold Coast man, with about 20 other deaths being investigated.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8695bc9c8460946c40bec409835f6afb1f096f58",
      "title": "Israel's military says its expanded operation in Gaza City has begun",
      "url": "https://www.npr.org/2025/09/16/nx-s1-5543007/israel-military-gaza",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T08:19:54.000Z",
      "summary_90w": "",
      "raw": "The announcement by the Israeli military further escalated the Israel-Hamas war as any potential ceasefire feels even further out of reach despite weeks of diplomacy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6029111fbdb7101fa9b6a60090a0869c22dcc24d",
      "title": "Wong says Netanyahu government ‘more isolated than ever’ – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T08:15:24.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nLiberal senator warns Ley of potential frontbench ‘exodus’ over party’s net zero policy\n\nGet our breaking news email, free app or daily news podcast\n\nMatt Canavan says landmark climate assessment a ‘cynical attempt to spread fear and panic’\nNationals senator Matt Canavan discounted the headlines behind the landmark national climate risk assessment, saying the government had conveniently timed the report while calling the document a “cynical attempt to spread fear and panic among people”.\nThe problem is the headline figures are never as bad as the detailed science that underlies it. …\nIt reads like the Book of Daniel, not a government report. I mean, I like government reports that are sober and reasonable. … I think Australians like a government, that just tell them the truth and not try and scare them. We saw that during Covid. People are trying to scare you because they’ve got an agenda, right?\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ef4433992380fb90df4dfab8ef8bc1ed1351e96c",
      "title": "India and US seek breakthrough in day-long trade talks",
      "url": "https://www.bbc.com/news/articles/c99g13xezdvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T07:51:05.000Z",
      "summary_90w": "",
      "raw": "The meeting comes after weeks of tension between the allies with Trump imposing high tariffs on Indian goods.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b1a48233e1b2537c3f190bdae8b680c7563779c4",
      "title": "Sydney’s west on frontline for most extreme heat and biggest health risks – but inner city faces water threat",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/climate-sydney-west-suburbs-most-extreme-heat-biggest-health-risks-inner-city-flooding",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T07:41:07.000Z",
      "summary_90w": "",
      "raw": "Western suburbs, where temperatures are often 5C warmer, need shaded bus stops, more green space and better environmental standards in rented homes, locals say\n\nFollow our Australia news live blog for latest updates\n\nFull Story: Rising sea levels and soaring heat deaths: will climate action match the risks?\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nBud Moses is all too aware of the longer, hotter summers impacting his community in Sydney’s west.\nAs black summer bushfires raged on 4 January 2020, Penrith was sweltering in temperatures of 48.9C, making it the hottest place on the planet that day. It was just one of a growing number of above-40C days Moses has witnessed in recent years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ade04e5e45b1bf3408e5d1a8c1541b79917e6a01",
      "title": "Israel has committed genocide in Gaza, says UN commission of inquiry",
      "url": "https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T07:34:28.000Z",
      "summary_90w": "",
      "raw": "Report cites scale of killings and aid blockages and accuses Benjamin Netanyahu of inciting commission of genocide\n\nMiddle East crisis – live updates\n\nA UN commission of inquiry has concluded that Israel is committing genocide in Gaza and accused senior Israeli officials including Benjamin Netanyahu of inciting it.\nThe United Nations independent international commission of inquiry (COI), which does not speak on behalf of the UN and has been criticised strongly by Israel, cited the scale of the killings, aid blockages, forced displacement and the destruction of a fertility clinic in the territory to support its finding of genocide.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b2914e242af7fcbe31bbde4de1e054a5673857f",
      "title": "Jeremy Bowen: UN genocide report a blunt indictment of Israel's actions in Gaza",
      "url": "https://www.bbc.com/news/articles/c0m4rxjppl8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T07:01:46.000Z",
      "summary_90w": "",
      "raw": "A new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "13a9c1149e8448bf25a3fc4fba6890e6cb19ee4d",
      "title": "Malawi votes for next president as cost-of-living bites",
      "url": "https://www.bbc.com/news/articles/ckgy3g7zpl3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T06:33:27.000Z",
      "summary_90w": "",
      "raw": "Campaigns were overshadowed by price rises and fuel shortages.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b86729c4939d688060cbf3aa3741212dd654403f",
      "title": "Nigerian chef breaks world record for largest jollof rice dish",
      "url": "https://www.bbc.com/news/articles/cz7r0rjzpqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T05:44:39.000Z",
      "summary_90w": "",
      "raw": "Guinness World Records confirms the achievement, saying the rice weighed in at a staggering 8,780kg.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "585e0d9e9f0dada995471a2f324451122efba92e",
      "title": "Up to 185,000 Queensland homes could be at ‘very high risk’ with many uninsurable if global heating unchecked",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/climate-change-queensland-properties-high-risk-natural-disaster-heatwaves-flooding-cyclones-bushfires-homes-uninsurable",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T05:43:39.000Z",
      "summary_90w": "",
      "raw": "State faces more frequent heatwaves, floods, cyclones and bushfires as world warms, national climate risk assessment warns\n\nFollow our Australia news live blog for latest updates\n\nFull Story: Rising sea levels and soaring heat deaths: will climate action match the risks?\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nUp to 185,000 properties in Queensland would be considered at “very high risk” of natural disaster if global heating continues unabated, according to a new report that warns that many of those homes would also become uninsurable.\nThe federal government’s national climate risk assessment report – released on Monday – says climate-related natural disasters would occur more frequently if global temperatures increase.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac7030d028f79a8f3956896217ab8ffb4ca45b23",
      "title": "Trump says the U.S. military targeted a boat allegedly carrying drugs from Venezuela",
      "url": "https://www.npr.org/2025/09/16/g-s1-88985/u-s-military-again-targeted-boat-carrying-drugs-venezuela",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T05:31:04.000Z",
      "summary_90w": "",
      "raw": "President Trump said the U.S. military on Monday again targeted a boat allegedly carrying drugs from Venezuela, killing three aboard the vessel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e348e37b1f9c19c9f2838629cef3d67dea76fd70",
      "title": "US Secretary of State inaugurates Israeli settler-led archaeological site in Jerusalem",
      "url": "https://www.bbc.com/news/articles/cg42v2r10kyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T05:25:26.000Z",
      "summary_90w": "",
      "raw": "Marco Rubio was a guest of honour at contentious tunnel excavated under Palestinian homes in occupied East Jerusalem.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b06bda89a180c29aff9df948b0fd7e3ed3f9d7ae",
      "title": "Cramp cocktails and apps - how rugby tracks 'fifth vital sign'",
      "url": "https://www.bbc.com/sport/rugby-union/articles/cgqnklkq81po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T05:17:19.000Z",
      "summary_90w": "",
      "raw": "Cramp cocktails and apps are just some of the ways women's' rugby teams have been trying to ensure their players are able to perform at the highest level throughout their menstrual cycle.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0f476411f3f071de810342f6f109f566b69a6cd3",
      "title": "'You feel a bit invincible': Triathlete's warning to fellow students over signs of sepsis",
      "url": "https://www.bbc.com/news/articles/cr70zr51rmeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T05:13:59.000Z",
      "summary_90w": "",
      "raw": "Lily McGarry thought she had \"fresher's flu\" but it was a condition that nearly claimed her life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7068f915bd34e8ddd7db78c173dab3abf0597410",
      "title": "Inside the century-old Bank of England building that houses 400k gold bars",
      "url": "https://www.bbc.com/news/articles/c15kzd19zz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T05:12:23.000Z",
      "summary_90w": "",
      "raw": "As a new exhibition opens about the Bank of England, the BBC takes a rare look inside the building.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fcef04881759a48c80a2057e5150da42312309fd",
      "title": "Ten teenage stars to look out for in Champions League",
      "url": "https://www.bbc.com/sport/football/articles/cy85x9ywnjxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T05:10:06.000Z",
      "summary_90w": "",
      "raw": "The Champions League is back this week and BBC Sport has taken a look at 10 teenagers who will be aiming to impress this season.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c6bc24c33bcc13833f42af82cb06c3d61f2d3682",
      "title": "Opioid deaths 50% higher than official data, research shows",
      "url": "https://www.bbc.com/news/articles/cg7dzmyjrjzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T05:01:37.000Z",
      "summary_90w": "",
      "raw": "The error - affecting England and Wales - raises concerns about the impact on the government's approach to drug deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5b3f1a3edaca89f31d673e3c7971528ad17b0088",
      "title": "Beaten and held in Russia for three years - but never charged with a crime",
      "url": "https://www.bbc.com/news/articles/cm28674vnp6o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T05:00:37.000Z",
      "summary_90w": "",
      "raw": "Russia imprisoned Dmytro shortly after its invasion of Ukraine in 2022. He was freed last month.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "de1c079692720c2ec48189b3694b613af2df9055",
      "title": "Amazon to host Prime Big Deals Day sales event on October 7 and 8",
      "url": "https://techcrunch.com/2025/09/15/amazon-to-host-prime-big-deals-day-sales-event-on-october-7-and-8/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Amazon is hosting its Prime Big Deals Day sales event in October again.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "59456c5264ff12d7c455cf9e4dfb7e478f44774a",
      "title": "Amazon’s next Prime Day sale is happening on October 7th",
      "url": "https://www.theverge.com/news/774151/amazon-october-prime-day-fall-dates-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-16T05:00:00.000Z",
      "summary_90w": "",
      "raw": "Amazon has announced its fall Prime Big Deal Days event. It starts at 12:01AM PT / 3:01AM ET on Tuesday, October 7th, and runs through Wednesday, October 8th. Of course, we’ll bring you all the best deals on Verge-approved gadgets once they become available.\nAmazon’s latest Prime Big Deal Days sale is shorter than the extended four-day Prime Day in July. Even so, that should be plenty of time for Prime members to save ahead of Black Friday and Cyber Monday. The previous Prime Day delivered some of the lowest prices we’ve seen on popular devices like the iPad Air and AirPods 4, and we’re hoping for a similar caliber of deals this time around. In years past, we’ve seen deep discounts on big-name brands like Samsung, Apple, and Beats, plus all-time low prices on Amazon devices.\nAlthough the next Prime Deal Days doesn’t start for another few weeks, Amazon is offering early deals starting today. You can save up to 50 percent off select Amazon devices, including the Fire HD 8 Kids Pro Tablet, Kindle Kids, and Echo Dot Kids bundle. Other deals include a discount on the Kindle Paperwhite Essentials bundle, Luna Wireless Controller, and the Ring Battery Doorbell with Ring Pan-Tilt Indoor Camera bundle. Meanwhile, eligible Prime members can get three months of Kindle Unlimited for free.\nWhile Prime Day deals are exclusive to subscribers, Best Buy, Walmart, and other retailers often offer similar discounts, so you’ll have plenty of ways to shop. If you want to sign up for Prime, a subscription runs $14.99 per month or $139 per year. If you’re between the ages of 18 and 24, you can get a six-month subscription for free, with it renewing after that period for $7.49 per month (half the normal cost of Prime). Prime Big Deal Days will take place in the US, the UK, Australia, Belgium, Brazil, Canada, France, Germany, Italy, Japan, Netherlands, Poland, Singapore, Spain, and Sweden, and for the first time, Colombia, Ireland, and Mexico.\nBefore Prime Big Deal Days gets underway, Amazon is holding a fall hardware event on September 30th. Amazon traditionally uses the annual event to reveal a slew of new products, including Echo smart speakers, Fire TV devices, Kindles, and more. Hopefully, we’ll see at least some of the new tech discounted during Amazon’s annual pre-Black Friday sale.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T04:48:25.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4a8b043a5ef482f7f78bd53960e4dbfb00477ea8",
      "title": "Australia-PNG defence treaty: countries to agree to defend each other from military attack as China’s Pacific influence grows",
      "url": "https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T04:28:39.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese and Papua New Guinea’s defence minister downplayed the delay to the Pukpuk defence treaty being formalised\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia and Papua New Guinea will agree to defend each other in the event of a military attack, part of a landmark defence agreement due to be signed on the sidelines of celebrations to commemorate the country’s independence this week.\nAnthony Albanese and PNG’s defence minister, Billy Joseph, both downplayed a delay to the deal being formalised, insisting the plan known as a Pukpuk treaty won’t affect sovereignty in the former Australian colony.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "48f52f3c00c8ae0040e0db21d39296361bdaea85",
      "title": "US says 'framework' for TikTok ownership deal agreed with China",
      "url": "https://www.bbc.com/news/articles/c5yj5xj78p5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-16T04:20:10.000Z",
      "summary_90w": "",
      "raw": "The deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cfd308e9a22013f6d337f4674e39547031472259",
      "title": "Nothing closes $200M Series C led by Tiger Global, plans AI-first device launch",
      "url": "https://techcrunch.com/2025/09/15/nothing-closes-200m-series-c-led-by-tiger-global-plans-ai-first-device-launch/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-16T04:15:00.000Z",
      "summary_90w": "",
      "raw": "Carl Pei's Nothing is raising $200 million in a Series C round from Tiger Global at a $1.3 billion valuation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e6821f3a8f10380573c80bccb1732d67e32b6c1e",
      "title": "These teens turned their rooms into tech-free zones. This was the result",
      "url": "https://www.bbc.com/news/articles/c1lelqg0jy3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T04:08:01.000Z",
      "summary_90w": "",
      "raw": "Elizabeth and Henry are among those ditching technology in their bedrooms to see how they cope.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ec2d8780154f2edbb6a1366d86ed3d9072d324c3",
      "title": "'Tinder Swindler' con artist arrested in Georgia",
      "url": "https://www.bbc.com/news/articles/cn95jjn1q40o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T02:53:36.000Z",
      "summary_90w": "",
      "raw": "Israeli Simon Leviev, accused of defrauding multiple women of up to $10m, is taken into custody at an airport.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7b99d9252c79d8fb38e65cdfc6052aa5246c664",
      "title": "Pacific leaders gather to celebrate 50th anniversary of Papua New Guinea’s independence",
      "url": "https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T02:30:58.000Z",
      "summary_90w": "",
      "raw": "Celebrations and events have been held across the country to mark the milestone\n\nPNG independence: 50 years on\n\nPacific leaders have gathered in Port Moresby to celebrate Papua New Guinea’s 50th anniversary of independence from Australia, as prime minster James Marape reflected on the moment and voiced his optimism for the future despite the country’s challenges.\nPapua New Guinea was administered by Australia as a single territory from 1945. The territory included the former British protectorate of Papua and the former German colony of New Guinea. In 1975, Papua New Guinea was granted independence.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "84bfd7f45b9b307f0d9e824e51a55860513e4a8a",
      "title": "Trump announces deadly US strike on another alleged Venezuelan drug boat",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-16T01:26:57.000Z",
      "summary_90w": "",
      "raw": "President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’\nDonald Trump said on Monday that the United States had carried out a strike on a second Venezuelan boat and killed three alleged terrorists he claimed were transporting drugs, expanding his administration’s war against drug cartels and the scope of lethal military force to stop them.\nThe US president gave few details about the strike, saying in a social media post that the action was on his orders and that it had happened earlier in the morning. The post was accompanied by a video clip showing the boat, which appeared to be stationary, erupting into a fireball.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e135ec80894cd2a5c02e6adce122652f90013776",
      "title": "Chris Mason: Reform UK amplifies jitters for Labour and Conservatives",
      "url": "https://www.bbc.com/news/articles/cj4y2ejlpdjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T01:03:37.000Z",
      "summary_90w": "",
      "raw": "The BBC's political editor says people at the top of government acknowledge the last few weeks have been dreadful for them.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5747b8476441fa8d66da50cdeaba29b97d41f796",
      "title": "Appeals court says Lisa Cook can stay on the Federal Reserve board -- for now",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539252/lisa-cook-fed-trump-firing-court",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-16T00:57:53.000Z",
      "summary_90w": "",
      "raw": "A federal appeals court blocked President Trump from firing Federal Reserve governor Lisa Cook, just ahead of a key vote on interest rates.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3236a462c061d6a06737bdbfbba33dfb7e44197e",
      "title": "Mark Ronson on being a night person - and Lady Gaga trashing his car",
      "url": "https://www.bbc.com/news/articles/c8xrge1prpyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-16T00:44:56.000Z",
      "summary_90w": "",
      "raw": "Mark Ronson looks back on a troubled childhood, and how it informed his career as a DJ and producer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e614b31b59ed465624224bc06d7a93165c00fb37",
      "title": "Why more women get cancer in India - but more men die ",
      "url": "https://www.bbc.com/news/articles/c04q9v49ndgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-16T00:32:03.000Z",
      "summary_90w": "",
      "raw": "Women account for just over half of all new cases, but men make up the majority of deaths.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "992891a84305925f819c7c7db66dc94be6a4842b",
      "title": "Trump's state visit is mired with potential pitfalls despite careful planning",
      "url": "https://www.bbc.com/news/articles/c4gw25w9841o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T23:06:35.000Z",
      "summary_90w": "",
      "raw": "Months of preparations have gone into the state visit - but the Lord Mandelson question is not the only concern troubling insiders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b45e9aa3d08bc0739cdfa535af6f6b3aaa8e935",
      "title": "First ‘one in, one out’ deportation flight reportedly takes off without migrants",
      "url": "https://www.theguardian.com/uk-news/2025/sep/15/first-one-in-one-out-deportation-flight-reportedly-takes-off-without-migrants",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T22:46:19.000Z",
      "summary_90w": "",
      "raw": "Group of people who crossed Channel by boat understood not to have been on Air France plane after legal challenge\nThe first flight to France carrying people who crossed the Channel under Keir Starmer’s “one in, one out” deal has not taken place as planned, according to reports.\nA small group of individuals were removed from an Air France flight on Monday due to travel from Heathrow to Paris after a legal challenge, according to multiple newspaper reports.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0ad9214823cfd04c43105d40546694c877a121a8",
      "title": "US destroys alleged Venezuelan drug boat, killing three",
      "url": "https://www.bbc.com/news/articles/cx2jel4gyezo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T22:21:43.000Z",
      "summary_90w": "",
      "raw": "The attack came after the Venezuelan president said Caracas would defend itself against US \"aggression\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7a510821bddac3e95088f59b4be4b6cebe158182",
      "title": "The best Xbox controller to buy right now",
      "url": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T22:00:00.000Z",
      "summary_90w": "",
      "raw": "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing between several high-quality controllers from Microsoft as well as a plethora of great options from the likes of 8BitDo, PowerA, Razer, Scuf, GameSir, Nacon, and Turtle Beach. Some of them have drift-resistant Hall effect or TMR-based joysticks for improved longevity, yet all of them are good for one reason or another. The days of the cheap “little sibling” controller that looked cool, but barely worked, are over.\nWe’ve spent a ton of time playing all kinds of games (first-person shooters, fighters, third-person action-adventure, racing, indie roguelikes, etc.) to test a wide swath of Xbox controllers, and it may not be a surprise that the standard, Xbox Wireless Controller is the best option for most folks. It makes for a great PC and Steam Deck controller, too. The default Xbox gamepad strikes the right balance of quality, comfort, versatility, and price, but there are several alternatives worth considering.\nFeatured in this article\nBest overall: Xbox Wireless Controller\nThe official Xbox Wireless Controller has a dedicated share button for saving clips and screenshots and sharing them online, Bluetooth support, and a USB-C port for charging up Microsoft’s play-and-charge rechargeable battery.\n\nWhere to Buy:\n\n $64.99 $49.95 at Amazon\n $64.99 $49.95 at Walmart\n $59.99 at GameStop\n\nBest budget option: 8BitDo Ultimate Wired Controller for Xbox\nThe latest 8BitDo Ultimate Wired Controller for Xbox includes Hall effect analog sticks and triggers, plus two rear buttons, customizable mapping and sensitivity, and compatibility with PC and mobile devices.\n\nWhere to Buy:\n\n $44.99 $29.99 at 8BitDo\n $44.99 $33.74 at Amazon\n $44.99 $35.99 at Best Buy\n\n\n\n\n\n\nThe best Xbox controller for most people\nThe best cheap Xbox controller\nThe best “pro” Xbox controller\nA formidable alternative to the Elite\nAn affordable alternative to the Elite\nOther Xbox controllers we tested\nWhat’s coming next?\n\nThe best Xbox controller for most people\nXbox Wireless Controller\n\n\n\nProsCons\n\n\nIncredible value for Xbox Wireless support\nGreat ergonomic design\nSatisfying buttons and triggers\n\nLacks customization\nRequires AA batteries (or an optional rechargeable cell)\n\n\n\nWhere to Buy:\n\n $64.99 $49.95 at Amazon\n $64.99 $49.95 at Walmart\n $64.99 $59.99 at GameStop\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: No / Software customization: No / Power: AA batteries or add-on rechargeable\nOkay, I already know what you’re thinking. “The best controller for Xbox is the one that comes with the Xbox?” That may seem like a no-brainer, but this standard controller truly does earn this title as the best. It lacks some extras found on pricier options, but this controller is the distillation of all that has made the last 20 years of Xbox gamepads great, and it shows.\nThanks to Microsoft’s proprietary wireless protocol, this is the only affordable wireless Xbox controller out there. (Third-party wireless options have been trickling out in recent years, but they’re mostly at the high end.) While some hate the standard Xbox wireless controller for its use of AA batteries instead of a built-in rechargeable cell, that also means it’s flexible, allowing for rechargeable AAs or a battery pack. And user-replaceable batteries mean you’re not stuck with a controller that doesn’t hold its charge after years of use. It also works over a USB-C wired connection.\nBut the standard-issue Xbox pad isn’t just great because of its varied connectivity. The hardware itself is excellent for the controller’s $65 (and often less) asking price. The sticks, buttons, triggers, and the sunken dish-shaped D-pad all feel impeccably tight, with the latter having a satisfying clickiness to it. If you’re a hardcore fighting game fan, you’ll probably be best served by a dedicated fight stick or a controller geared toward that genre — one with a superb D-pad like Hori’s Horipad Pro — but the Xbox Wireless Controller is otherwise an extraordinary jack-of-all-trades.\nThe only things it really lacks compared to pricier options are extra, customizable buttons and software tuning for things like stick sensitivity (button remapping is available), though Microsoft does offer cosmetic customization through its Xbox Design Lab, which bumps the price from $79.99 to $124.93 depending on the configuration. There’s a lot to love about these controllers, whether you make your own or pick one from the many colors that Microsoft offers.\nThe best cheap Xbox controller\n8BitDo Ultimate Wired Controller for Xbox\n\n\n\nProsCons\n\n\nInexpensive\nLightweight and comfortable\nSatisfying buttons and Hall effect components\nProgrammable back buttons are easy to press\n\nLacks trigger stops\n\n\n\nWhere to Buy:\n\n $44.99 $29.99 at 8BitDo\n $44.99 $33.74 at Amazon\n $44.99 $35.99 at Best Buy\n\nConnectivity: Wired / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Wired\nThe 8BitDo Ultimate Wired Controller for Xbox is a fantastic budget model that typically retails for $44.99 but can often be found for as little as $29.99. The shape is reminiscent of Nintendo’s Switch Pro Controller, only a bit smaller, with hints of Xbox influence and a curvaceous design that feels great to hold.\nOn the hardware front, the Ultimate Wired Controller features Hall effect sticks with satisfying tension. It also uses Hall effect triggers with dedicated vibration motors, though it lacks trigger stops, unlike our previous budget pick, the PowerA Advantage Wired. Its D-pad, face buttons, and bumpers are nice and clicky, too, despite being smaller than we’d typically like. It has two rear paddles, remappable buttons, and the ability to save up to three profiles, which you can switch between on the fly using a dedicated button. There’s even a built-in mute switch for audio, which isn’t common on cheaper controllers. You can download the 8BitDo Ultimate Software X app on PC or Xbox to fully customize this controller.\nThe 8BitDo Ultimate Wired works as a wired controller with your PC, but if you prefer wireless connectivity, the company also makes a three-mode wireless version for $69.99 with support for both Bluetooth and 2.4GHz wireless (via a dongle). The wireless version is a bit more expensive, however, and it’s still limited to wired connectivity on Xbox consoles. \nThe best “pro” Xbox controller\nXbox Elite Wireless Controller Series 2\n\n\nScore: 8.5\n\nProsCons\n\n\nExtensive modular customization\nPremium look and feel\nRechargeable battery lasts an incredible 40 hours\n\nPricey\nQuestionable quality control\nNo Hall effect components\n\n\n\nWhere to Buy:\n\n $179.99 $153 at Walmart\n $199.99 $157.95 at Microsoft\n\nConnectivity: Xbox wireless, Bluetooth, wired / Connector type: USB-C / Mappable rear buttons: Up to four / Software customization: Yes / Power: Built-in rechargeable\nThe Xbox Elite Wireless Controller Series 2 is Microsoft’s fanciest controller, and it’s got a lot of nice extras, like better build quality, extra buttons, user-swappable sticks and D-pad, a built-in rechargeable battery, and loads of software customization. Where the standard Xbox controller is constructed entirely of unassuming plastic, the Elite mixes higher quality soft-touch plastic, rubberized grips, and metallic touches for a superior fit and finish. This makes it heftier than the stock controller, and as a result, it just feels nicer in your hands. It also comes with a charging dock and zip-up case with passthrough charging, completing a really nice package for $199.99 (or sometimes less, if it’s on sale). \nThere’s also the stripped-down Elite Series 2 “Core” version with an MSRP of $149.99, which ditches the add-ons but is equally customizable. You can buy them separately in a $59.99 accessories pack, but you’ll end up paying more that way, barring sales or discounts.\nA pricey controller like an Xbox Elite is a bit of a splurge purchase. Most of us are not competing at e-sports levels that require its high-end features. Nevertheless, it’s fun to use something that feels nicer, offers ways to custom-tailor it to your liking, and maybe gives you a slight competitive edge thanks to features like hair triggers and removable rear paddles. In theory, you may be able to get shots off faster in an online shooter with the hair triggers, and you can map the paddles to functions like jump, crouch, reload, etc., while keeping your thumb on the right stick. You could teach yourself claw grip to accomplish the latter with even a cheap wired controller, sure, but it just won’t feel as cool or easy as when using an Elite.\nWhile the Elite is still a great controller in 2025, you should keep in mind that it’s been around since 2019 and a Series 3 revision is feeling long overdue. The Series 2 also has a bit of a reputation for lackluster quality control — with horror stories from users about going through multiple replacements under warranty. Microsoft extended the controller’s warranty from 90 days to a year in late 2020 to help address concerns, but buying an Elite Series 2 may still feel like a slightly risky proposition. It also predates the current-gen implementation of a dedicated Share button, and its potentiometer-based sticks run the risk of stick drift after long-term use (something third parties are addressing with controllers that use drift-free Hall effect sticks, unlike all three big console manufacturers). \nEven so, the Elite 2 remains by far the most well-rounded option for a step-up Xbox controller — thanks in large part to its impressive build and expansive software experience. If all these caveats give you pause, though, there is another promising option.\nRead our Xbox Elite Wireless Controller Series 2 review.\nA formidable alternative to the Elite\nRazer Wolverine V3 Pro\n\n\n\nProsCons\n\n\nSupports Xbox Wireless protocol\nHall effect sticks use replaceable tops\nFour rear buttons smartly positioned for comfort\nTwo extra shoulder buttons add unique versatility\nTrigger stops and back buttons offer a satisfying mouse-like click\n\nExpensive\nRequires a USB dongle\nRazer Synapse software needs work\n\n\n\nWhere to Buy:\n\n $199.99 at Amazon\n $199.99 at Best Buy\n $199.99 at GameStop\n\nConnectivity: Wireless USB dongle (Xbox / PC), wired / Connector type: USB-C / Mappable rear buttons: Four / Software customization: Yes / Power: Built-in rechargeable\nAt $199.99, Razer’s Wolverine V3 Pro controller is as expensive (or more, depending on available deals) than the Elite Series 2, but it’s worth the cost if you want a high-end controller with drift-free sticks. Not only is the V3 Pro Razer’s first foray into using Hall effect sticks, it’s the company’s first fully wireless Xbox gamepad. It also sports some of the best hair-trigger lockouts around, yielding a mouse-like click usually found on even pricier Scuf controllers (a previous high-ranking pick of ours). \nOther than that, the V3 Pro is similar to the previous V2 Pro, with six remappable buttons — four rear paddles in new, angled orientations and two extra shoulder buttons — and some RGB lighting. The buttons and D-pad still have that satisfying micro-switch tactility and audible clickiness like the previous-gen V2 Pro, but the RGB lighting is more subtle this time around.\nThe Wolverine V3 Pro’s biggest shortcomings compared to Microsoft’s Elite Series 2 are its more basic software customization, its lack of Bluetooth, and the fact that it needs a USB dongle to work wirelessly. The V3 Pro is otherwise the better pick if you can justify its high price, which, unlike the Series 2, is rarely subjected to discounts. Luckily, if you can’t, there’s also the $99.99 Wolverine V3 Pro Tournament Edition that has a nearly identical set of features in a wired configuration.\nAn affordable alternative to the Elite\nGameSir G7 Pro\nGameSir’s G7 Pro is a wired Xbox controller with remapable rear buttons, adjustable triggers, and TMR joysticks. It can also be connected wirelessly to a PC (via a 2.4Ghz dongle) or Android (via Bluetooth).\n\nWhere to Buy:\n\n $79.99 at Amazon\n $79.99 at Best Buy\n $79.99 at Walmart\n\nConnectivity: Wired (Xbox), wireless USB dongle (PC), Bluetooth (Android)  / Connector type: USB-C / Mappable rear buttons: Two / Software customization: Yes / Power: Built-in rechargeable\nIf you don’t mind using a wired controller, GameSir’s G7 Pro offers some features of the splurge-worthy Xbox Elite Controller 2 for under $100. It has remappable buttons, smooth-feeling drift-resistant TMR control sticks, a satisfying weight, and textured grips that made it feel comfortable to hold even with sweaty palms.\nThe G7 Pro is actually a battery-powered wireless controller, but its cable free connectivity is limited to PC (via an included 2.4Ghz dongle) and Android (via Bluetooth). You’ll need to plug the controller into the Xbox with a cable, and GameSir provides a lengthy USB-C to USB-A cord. The cable was long enough that I could play games from my couch (roughly six feet away) without feeling tethered.\nI was impressed with the G7 Pro’s overall build quality, especially the triggers, which could be locked by flipping switches on its back. GameSir includes three swappable direction pads with the G7 Pro, which can be swapped by lifting the front of the controller’s shell and popping them in and out. However, its face buttons felt noticeably cheaper than the ones on the Elite 2, which makes sense given their price difference.  Button feel aside, the controller never dropped an input, even when I mashed buttons to string together elaborate combos in Tony Hawk’s Pro Skater, or continuously cast spells, dodged, and healed in Diablo IV. If an action was mistimed, it was on me.\nWhat the controller lacks in face button quality is more than made up for in customizability. GameSir Nexus, a free app on the Xbox Store, allowed me to remap any button (including the L4 and R4 buttons on its backside), adjust the vibration intensity of both triggers, enable two flavors of hair trigger mode, and set the deadzone for each control stick. You can save up to four profiles with different settings, and quickly switch between them by pressing the controller’s M button along with one of the face buttons. You never need to touch these options, or even download the GameSir Nexus app for the G7 Pro to work, but doing so will unlock its full potential.\nThe GameSir G7 Pro is an excellent Xbox controller, especially in its price range. I’d have liked the option to use it wirelessly, but that wasn’t a dealbreaker for me. That said, it’s something to consider depending on how far away you are from your Xbox when playing. If you’re a multi-platform gamer and want a controller to use with both an Xbox and PC (or Android device), it’s an even better choice.\nOther Xbox controllers we tested\nThe Scuf Valor Pro is the company’s first Xbox controller with Hall effect sticks, as well as its cheapest at $109.99. Scuf emulates Microsoft’s winning ergonomics while implementing redesigned remappable rear buttons (two are removable) and shoulder bumpers that are more comfortable to reach. It also has trigger stops that produce a satisfying click with next to no travel when pressed. The D-pad produces a similarly satisfying click, one we prefer over the softer tactile feel of the Instinct. The Valor Pro is not the most exciting controller on paper, but it’s a solid option for Scuf faithful or anyone who wants more durable analog sticks. Read our hands-on impressions.\nWe tested PowerA’s latest pro-style Xbox controllers, including the Fusion Pro 4 Wired ($74.99) and PowerA Fusion Pro Wireless ($159.99). They’re standard fare for pro-style controllers these days, with height-adjustable Hall effect sticks, four remappable rear buttons, three-way trigger locks, and onboard volume controls. They’re similar, but the Pro Wireless has four trippy Lumectra lighting zones that respond to your button presses. Both controllers are satisfying to use and a clear step up from PowerA’s older products in terms of overall quality, but they ultimately don’t stand out much at these price points.\nNacon’s Revolution X ($25.90) remains one of the most customizable wired controllers you can get (it even has removable weights in its handles), and its software is nearly as expansive as Microsoft’s first-party app.\nIf you’re the nostalgic type, the Hyperkin Duke ($89.99), DuchesS ($49.99), and Xenon ($49.99) are faithful wired recreations of Xbox gamepads from Microsoft’s first two console generations. They’re kind of dumb but endearing (especially the chunky Duke), but they’re unique collector pieces you can also use on modern games.\nWhat’s coming next?\nHyperkin’s Competitor controller, which it announced in January at CES, will be released in October for $49.99. The wired gamepad looks almost identical to the PlayStation 5’s DualSense controller, with a pair of analog sticks next to one another at the bottom of the controller, glassy buttons, and a non-contiguous D-pad. Hyperkin is offering the Competitor in five colors, but only the black and white controllers will be available in the US at launch.  \nUpdate, September 15th: Updated to reflect current pricing / availability, additional details about Hyperkin’s Competitor controller and added GameSir’s G7 Pro controller. Brandt Ranj also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c8b56231a9a3d0e2f12d4231b7f8a2ad9b08f456",
      "title": "Rodatherm Energy wants to make geothermal more efficient, but will it be cheaper?",
      "url": "https://techcrunch.com/2025/09/15/rodatherm-energy-wants-to-make-geothermal-more-efficient-but-will-it-be-cheaper/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T21:48:02.000Z",
      "summary_90w": "",
      "raw": "Rodatherm Energy emerged from stealth with $38 million in Series A funding. It plans to build a closed-loop geothermal power plant that uses refrigerants to move heat to the surface.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "807471822fbc881653f70b5ce196c5d7b39c3e37",
      "title": "Gulf leaders call on Trump to rein in Israel after Qatar emergency summit",
      "url": "https://www.theguardian.com/world/2025/sep/15/gulf-leaders-call-on-trump-to-rein-in-israel-after-qatar-emergency-summit",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T21:38:00.000Z",
      "summary_90w": "",
      "raw": "Arab states say US should use its leverage and influence as they promise to ‘activate joint defence mechanisms’ \nGulf leaders meeting at an emergency summit in Qatar have called on the Trump administration to use its leverage to rein in Israel following the unprecedented Israeli attempt last Tuesday to assassinate Hamas negotiators in Doha.\nSpeaking after the meeting of the Gulf Cooperation Council (GCC), the group’s secretary general, Jasem Mohamed al-Budaiwi, said: “We … expect our strategic partners in the United States to use their influence on Israel in order for it to stop this behaviour … they have leverage and influence on Israel, and it’s about time that this leverage and influence be used.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5f605730952359712a80a838c9eb1a47006f30c1",
      "title": "Italian skier Matteo Franzoso dies at the age of 25 after training crash in Chile",
      "url": "https://www.theguardian.com/sport/2025/sep/15/italian-skier-matteo-franzoso-dies-at-25-after-training-crash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T21:26:52.000Z",
      "summary_90w": "",
      "raw": "Franzoso suffered ‘major head trauma’ in accident\n\nLindsey Vonn: ‘This is incredibly sad … RIP Matteo’\n\nThe Italian skier Matteo Franzoso has died at the age of 25 following a crash during pre-season training in Chile at the weekend, his country’s winter sports federation (FISI) has confirmed.\nAfter suffering “a major head trauma” in the accident at the La Parva track on Saturday, Franzoso was taken by helicopter to the intensive care unit of a clinic in Santiago and placed in an induced coma. The FISI confirmed on Monday that he did not recover after “cranial trauma” and a subsequent swelling of his brain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a6cd9623a9a09d20ddb32d1df65ab4370d513a85",
      "title": "With no DOJ breakup, Alphabet becomes a $3 trillion company ",
      "url": "https://techcrunch.com/2025/09/15/with-no-doj-breakup-alphabet-becomes-a-3-trillion-company/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T21:23:14.000Z",
      "summary_90w": "",
      "raw": "Investors continue to reward Alphabet's stock after a judge declined to break up Google earlier this month.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f8e7e98cf47162095bcef6e4088429cea341853",
      "title": "Here are the best AirPods deals you can get right now",
      "url": "https://www.theverge.com/21302051/best-apple-airpods-deals",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T21:03:35.000Z",
      "summary_90w": "",
      "raw": "The latest AirPods Pro 3 aren’t yet on sale, but their predecessor is. | Photo: Chris Welch / The Verge\t\n\nIf you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, though you can still find great deals throughout the year.\n \n\nThe best AirPods 4 deals\nThe best AirPods Pro (third-gen) deals\nThe best AirPods Max deals\n\nBelow, we’ve rounded up the best deals currently available on each model, including both iterations of the AirPods 4, the latest AirPods Pro, and the AirPods Max. \nThe best AirPods 4 deals\nApple AirPods 4\n\nWhere to Buy:\n\n $129 $116 at Amazon\n $129 $116 at Walmart\n $129.99 $119 at Best Buy\n\n\nAirPods 4 with Active Noise Cancellation\n\nWhere to Buy:\n\n $179 $168.99 at Amazon\n $179 $168.99 at Walmart\n $179.99 $172 at Best Buy\n\nAt its September 2024 event, Apple introduced the AirPods 4, a pair of wireless earbuds available in two variations: a $129 standard model and a $179 noise-canceling model. Both versions represent significant upgrades over the third-gen AirPods, with a more comfortable design and improved audio performance. They’re also better for taking calls thanks to Apple’s Voice Isolation feature, which focuses the mics on your voice so you can be heard more clearly in noisy environments.\nThe $179 AirPods 4 with Active Noise Cancellation offer a surprisingly effective noise-canceling mode, a helpful transparency mode, and several other Pro-level features. The latest AirPods Pro do a better job of tuning out noise, but the AirPods 4 with ANC still do a good job of reducing sound. They also feature other perks formerly reserved for Apple’s top-of-the-line earbuds, including wireless charging and a case with a built-in speaker that allows you to easily track it down via Apple’s Find My app.\nGiven they’ve been out for nearly a year, we consistently see discounts on both versions of the AirPods 4. Right now, for instance, the standard AirPods 4 are on sale at Amazon and Walmart for $116 ($13 off), which is $27 shy of their all-time low. The AirPods 4 with ANC, meanwhile, are available at Amazon and Walmart for their typical sale price of $168.99 (also $10 off), which is a far cry from their Prime Day low of $119.\nRead our full AirPods 4 review.\nThe best AirPods Pro (third-gen) deals\nAirPods Pro 3\nThe third-gen AirPods Pro add a new built-in heart rate sensor and live translation feature. They also improve upon their predecessor with twice the noise cancellation, better sound, and a fifth swappable ear tip option.\n\nWhere to Buy:\n\n $249 at Amazon\n $249 at Best Buy\n $249 at Walmart\n\nAt its recent “Awe Dropping” event, Apple introduced the new AirPods Pro 3. In addition to improved noise cancellation and sound, the earbuds now include a built-in heart rate sensor that syncs with the iPhone Fitness app to track your pulse and calories burned across more than 50 workout types — essentially doubling as a fitness tracker. They’re also more comfortable and secure than their predecessor, thanks to a redesigned, more angled fit and five ear tip sizes, including a new XXS option. On top of that, they carry a more robust  IP57 rating for dust, water, and sweat resistance and debut a live translation feature that generally conveys the gist well, though with enough errors that it can’t beat a human interpreter.\nBecause the AirPods Pro 3 are brand new and won’t hit shelves until September 19th, there aren’t any deals available yet. For now, you can only pick them up at their full $249 price from Amazon, Best Buy, and Walmart.\nRead our full AirPods Pro 3 review.\nApple AirPods Pro (second-gen) with USB-C charging case\n\nWhere to Buy:\n\n $249 $199 at Amazon\n $249 $199 at Walmart\n $249.99 at Best Buy\n\nHowever, if you’re looking to save, the second-gen AirPods Pro with USB-C remain a solid option and are still widely available despite no longer being part of Apple’s official lineup. They’re currently available at Amazon and Walmart for $199 ($50 off), which is their typical sale price and a relatively minor discount compared to previous sales. While they lack the AirPods Pro 3’s heart rate sensor, live translation feature, and new XXS ear tips, the second-gen AirPods Pro still deliver excellent noise cancellation that outperforms the first-gen model. They also add swipe-based controls and an extra-small fourth ear tip. Apple additionally updated them in 2023 with a USB-C charging case and an upgraded IP54 rating for water and dust resistance, while the latest version also supports lossless audio when used with Apple’s Vision Pro headset and doubles as a pair of FDA-approved hearing aids.\n\n\n\nRead our AirPods Pro with USB-C impressions.\nThe best AirPods Max deals\nApple AirPods Max\n\nWhere to Buy:\n\n $549 $499.99 at Amazon (USB-C)\n $549 $499.99 at Walmart (USB-C)\n $549 $499.99 at Best Buy (USB-C)\n\nThe AirPods Max aren’t the iconic in-ears that have become synonymous with the AirPods name. They’re large and luxurious, comprised of aluminum, steel, and mesh fabric that remains comfortable during extended listening sessions. They also sport excellent noise cancellation, Apple’s spatial audio feature, and expansive, balanced sound, even if they lag behind some of their peers when it comes to bass response and features. They’re not the best noise-canceling headphones for most people — blame the sticker price — but it’s hard to find a better pair of Bluetooth headphones if you’re an iPhone user.\nToward the end of last year, Apple replaced the first-gen Max with a new model that features support for USB-C charging and a few new color options. As of this writing, they’re on sale at Amazon, Best Buy, and Walmart in select colors starting at $499.99 ($50 off), which isn’t nearly as low as the $399 asking price we saw during Prime Day.\nRead our original AirPods Max review.\nUpdate, September 15th: Updated to reflect current pricing / availability and to mention the new AirPods Pro 3.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "bf1959e95c53db7f79f4c02808d5a1630218cd63",
      "title": "Facebook gave our data to Cambridge Analytica and all I got was this $38.36",
      "url": "https://www.theverge.com/tech/778472/facebook-gave-our-data-to-cambridge-analytica-and-all-i-got-was-this-38-36",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T20:59:46.000Z",
      "summary_90w": "",
      "raw": "Remember back in 2023, when we told you how to get your cut of a $725 million class action settlement? A couple of years later, that money is going out.\nI received an email earlier this week saying my claim had been approved in In re: Facebook, Inc. Consumer Privacy User Profile Litigation, a class action settlement that covered anyone who had a Facebook account between 2007 and 2022. The agreement settled a variety of privacy accusations against Facebook (now Meta), including that it allowed Cambridge Analytica and others to improperly access user data. Earlier today I got the money through PayPal: a total of $38.36. A few other Verge staf …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4994b4856888b010dbc2d1cc01cffa8b224c62d8",
      "title": "First group of children from Gaza arrive in UK for life-saving NHS treatment",
      "url": "https://www.theguardian.com/world/2025/sep/15/first-group-of-children-from-gaza-arrive-in-uk-for-life-saving-nhs-treatment",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T20:46:05.000Z",
      "summary_90w": "",
      "raw": "Care and support package, including housing, will help 30-50 young Palestinians for an initial two years\nThe first group of children from Gaza have arrived in the UK for specialist life-saving treatment on the NHS, the Guardian understands.\nYvette Cooper, the foreign secretary, informed the parliamentary Labour party on Monday evening about the development. On arrival in the UK, the patients and their families have been granted access to NHS treatment, appropriate housing and comprehensive support services for an initial two-year period.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9aabd502037a29c365488a57d2706ec178d539fb",
      "title": "Divergent raises $290M to expand production of specialized military parts",
      "url": "https://techcrunch.com/2025/09/15/divergent-raises-290m-to-expand-production-of-specialized-military-parts/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:39:23.000Z",
      "summary_90w": "",
      "raw": "Divergent Technologies' new round will help the company expand its manufacturing footprint across the U.S.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "49c3e141e936b87d24aa9bcf64b86b1537622bde",
      "title": "Robinhood plans to launch a startups fund open to all retail investors ",
      "url": "https://techcrunch.com/2025/09/15/robinhood-plans-to-launch-a-startups-fund-open-to-all-retail-investors/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:22:16.000Z",
      "summary_90w": "",
      "raw": "The “Robinhood Ventures Fund I” is intended to allow any retail investor to make money on startups, but the details are scant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d8e6bd9aea55bd102738758bb098e710e73281f5",
      "title": "The 9 most sought-after startups from YC Demo Day",
      "url": "https://techcrunch.com/2025/09/15/the-9-most-sought-after-startups-from-yc-demo-day/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:11:51.000Z",
      "summary_90w": "",
      "raw": "We asked YC-focused investors to name the startups from the Summer 2025 batch that generated the most interest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb97c5b2f3738ed9b4cd571c26923f860fa802b4",
      "title": "Company that owns Gucci, Balenciaga, other brands confirms hack",
      "url": "https://techcrunch.com/2025/09/15/company-that-owns-gucci-balenciaga-other-brands-confirms-hack/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:03:09.000Z",
      "summary_90w": "",
      "raw": "Kering said the hackers did not steal credit card numbers and that it has contacted the customers whose data is part of the breach, without saying how many were affected.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "178270cec200de03e445b4d1a9eb52ff65ad3afb",
      "title": "Do startups still need Silicon Valley? Founders and funders debate at TechCrunch Disrupt 2025.",
      "url": "https://techcrunch.com/2025/09/15/do-startups-still-need-silicon-valley-hear-from-the-founders-and-funders-challenging-old-assumptions-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T20:00:00.000Z",
      "summary_90w": "",
      "raw": "Does Silicon Valley still give founders an edge? At TechCrunch Disrupt 2025 (Oct 27–29, SF), Anh-Tho Chuong (Lago), David Hall (Revolution), and Tawni Nazario-Cranz (SignalFire) debate whether location still drives startup success.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "41d0022ed7b0000dbcaceaf17872198bbb5f7b10",
      "title": "Awake’s new app requires heavy sleepers to complete tasks in order to turn off the alarm",
      "url": "https://techcrunch.com/2025/09/15/awakes-new-app-requires-heavy-sleepers-to-complete-tasks-in-order-to-turn-off-the-alarm/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T19:00:59.000Z",
      "summary_90w": "",
      "raw": "Unlike traditional alarm clocks that can be silenced with a simple tap, Awake is intended to actively engage users' brains to ensure they fully wake up.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ba9c7f61527ec20745bebc86f34c5d28d403dda3",
      "title": "Snap unveils Snap OS 2.0 with native browser, WebXR support, and more",
      "url": "https://techcrunch.com/2025/09/15/snap-unveils-snap-os-2-0-with-native-browser-webxr-support-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T18:46:13.000Z",
      "summary_90w": "",
      "raw": "The launch comes as the company rolled out its fifth-generation Snap Spectacles for developers last year and plans to launch a consumer version sometime in 2026.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11ce3f51984463257897114260a62d1797c8729f",
      "title": "Does Israel face a 'South Africa moment' over Gaza?",
      "url": "https://www.bbc.com/news/articles/cx2xe5v70evo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T18:37:26.000Z",
      "summary_90w": "",
      "raw": "BBC diplomatic correspondent Paul Adams looks at parallels between reactions to Israel and apartheid-era South Africa.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6026cc8859de8bc9a81914aae63649a61cdf2493",
      "title": "Why Trump wants companies to report earnings less frequently",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542137/trump-corporate-earnings-sec",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T18:34:22.000Z",
      "summary_90w": "",
      "raw": "President Trump would like companies to report their earnings less frequently. Executives have long called for that -- but some financial experts worry it would go badly.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a72cf81c7379445ca0b060d65b763f8df8d5d858",
      "title": "Are The Conservatives 'Over'?",
      "url": "https://www.bbc.co.uk/sounds/play/p0m30j0b?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T18:34:00.000Z",
      "summary_90w": "",
      "raw": "Tory MP and shadow minister Danny Kruger defects to Reform.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b768a80b7f41e8feeec08c67dd8d720ecfb6200e",
      "title": "Watch: JD Vance hosts Charlie Kirk's daily talk radio show",
      "url": "https://www.bbc.com/news/videos/ckge487nr6ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T18:29:57.000Z",
      "summary_90w": "",
      "raw": "The US vice-president said the late conservative influencer played a \"critical part\" in getting President Donald Trump re-elected.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e5615e8c30214ca08fbe7062eb02f463f90e82be",
      "title": "Apple’s iOS 26 with the new Liquid Glass design is now available to everyone",
      "url": "https://techcrunch.com/2025/09/15/apples-ios-26-with-the-new-liquid-glass-design-is-now-available-to-everyone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:45:19.000Z",
      "summary_90w": "",
      "raw": "Other features include a call screening assistant, a new gaming and preview app, in-app translation across the system, and updates to Genmoji and Image Playground apps.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "48341e22cf197b930c55378266f1044034e5ce18",
      "title": "Senate confirms Stephen Miran to Fed Board. Who is he and why's he so controversial?",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5542126/stephen-miran-fed-reserve-board",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T17:39:32.000Z",
      "summary_90w": "",
      "raw": "The Senate voted Monday to confirm Stephen Miran to the Federal Reserve Board. Miran, who has served in both Trump administrations, has said he will not resign from the White House but take a leave of absence, further stoking concerns about its independence.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "cab26b92019fd670400a1222a05ca0b2c78a4077",
      "title": "Inside the shift at Disrupt: Building community and scaling in the AI era",
      "url": "https://techcrunch.com/2025/09/15/on-stage-at-techcrunch-disrupt-2025-how-ai-is-forcing-late-stage-startups-to-rewire-gtm-or-be-left-behind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:15:00.000Z",
      "summary_90w": "",
      "raw": "Nirav Tolia (Nextdoor), Jane Alexander (CapitalG), and Vanessa Larco (Premise, NEA) join TechCrunch Disrupt 2025 (October 27–29, SF) to share strategies for building resilient companies and scaling in the AI era.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fcfdc8182a52a69744a874c481e7899892c841ab",
      "title": "OpenAI upgrades Codex with a new version of GPT-5",
      "url": "https://techcrunch.com/2025/09/15/openai-upgrades-codex-with-a-new-version-of-gpt-5/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T17:03:40.000Z",
      "summary_90w": "",
      "raw": "OpenAI's AI coding agent, Codex, can now spend anywhere from a few seconds to several hours on a task, thanks to a new, customized version of GPT-5.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "77d1a2117eb3304ee265211225eb3cca3ac5e5ff",
      "title": "China says Nvidia violated antitrust regulations",
      "url": "https://techcrunch.com/2025/09/15/china-says-nvidia-violated-antitrust-regulations/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:44:02.000Z",
      "summary_90w": "",
      "raw": "China is investigating Nvidia's 2020 acquisition of Mellanox Technologies as trade tensions between the U.S. and China heat up.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b2147bf84d6043c37b507082d91c5aca3c1103e5",
      "title": "Israel announces seizure of $1.5M from crypto wallets tied to Iran",
      "url": "https://techcrunch.com/2025/09/15/israel-announces-seizure-of-1-5-million-from-crypto-wallets-tied-to-iran/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:08:14.000Z",
      "summary_90w": "",
      "raw": "The Israeli government ordered the seizure of 187 wallets it said belong to the IRGC, which have over time received $1.5 billion in crypto, according to a blockchain analysis firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c186f3cf8bf6597e85fce82bf92abd6290d3db7",
      "title": "Time’s running out to volunteer at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/15/times-running-out-to-volunteer-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T16:05:17.000Z",
      "summary_90w": "",
      "raw": "TechCrunch Disrupt 2025 takes place October 27–29 at Moscone West in San Francisco, and we’re looking for motivated, curious, and energetic volunteers to help make it all happen.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f24f9cf50f19530fdcdd2da95285d8e569f5a5dc",
      "title": "Cuban prisoners forced to work making cigars and charcoal for export to Europe, report claims",
      "url": "https://www.theguardian.com/world/2025/sep/15/cuba-prisoners-forced-labour-cigars-charcoal-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T16:01:13.000Z",
      "summary_90w": "",
      "raw": "Madrid-based NGO estimates at least 60,000 inmates subject to forced labour with little or no pay in Cuban jails\nPrisoners in Cuba are forced to work producing the country’s world-famous cigars and marabu charcoal sold to European consumers, according to a new report.\nThe Madrid-based NGO Prisoners Defenders estimates that at least 60,000 people are being forced to work with little or no pay, under threats, in exhausting conditions and without adequate equipment, with reports of violence including the sexual abuse of female detainees.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a26f39ea664acd863c12fd8080bfe97d0e704a0",
      "title": "PayPal adds new one-to-one payment links that will soon support crypto",
      "url": "https://techcrunch.com/2025/09/15/paypal-adds-new-one-to-one-payment-links-that-will-soon-support-crypto/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-15T15:58:26.000Z",
      "summary_90w": "",
      "raw": "The new PayPal Links allow customers to either request or make a payment to another person by selecting the link option, inputting the amount, and then copying the link into a conversation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d403c14dba9941c45d07f2a3f97e6cf9714311d",
      "title": "Belarus and Russia stage joint military drills",
      "url": "https://www.bbc.com/news/videos/cx2prn617nyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:57:14.000Z",
      "summary_90w": "",
      "raw": "The BBC's Russia editor, Steve Rosenberg, reports from joint manoeuvres by Russia and Belarus, as part of the Zapad 2025 (West 2025) military drills.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04dbcb219c7d352f422f52ee4f0eaa41d52fcebb",
      "title": "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5539868/tiktok-framework-bessent-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T15:44:33.000Z",
      "summary_90w": "",
      "raw": "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ba1a69c28d42c1982858afe85fca23104d56d0f4",
      "title": "Israel demolishes more high-rise towers as Gaza City offensive ramps up",
      "url": "https://www.bbc.com/news/videos/cr5q8mj6nrvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T15:40:30.000Z",
      "summary_90w": "",
      "raw": "BBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f511cb5e98734050ed69f00865ef04b31c52c199",
      "title": "They were shot dead for protesting against corruption in Nepal",
      "url": "https://www.bbc.com/news/articles/cm2zkmxlkm9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T14:57:52.000Z",
      "summary_90w": "",
      "raw": "Many young people were among more than 70 people killed in anti-corruption protests in Nepal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6b662516d0d0971669ae05d80a09575d7d5b78d",
      "title": "Musk buys $1bn worth of Tesla shares ",
      "url": "https://www.bbc.com/news/articles/cp982z3xrz7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:53:37.000Z",
      "summary_90w": "",
      "raw": "The purchases, the billionaire's first since 2020, boost his investment in the firm.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fab3b60f48e3f64795f98c7272f570494766bcf5",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "url": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T14:23:32.000Z",
      "summary_90w": "",
      "raw": "Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition\nTwo men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.\nLeonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c24c7a78c8475e4474ac8efb6a0e77ac76537605",
      "title": "Gucci, Balenciaga and Alexander McQueen private data ransomed by hackers",
      "url": "https://www.bbc.com/news/articles/crl5j8ld615o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-15T14:07:37.000Z",
      "summary_90w": "",
      "raw": "Kering, the luxury French fashion house which owns the brands, confirmed the attack to BBC News.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T13:24:59.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "17fd6e7987226a3829b516ca050181fdbfd3dea7",
      "title": "South Korea to review possible human rights violations in US raid on workers",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/south-korea-to-review-possible-human-rights-violation-after-us-raid-on-workers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T11:53:30.000Z",
      "summary_90w": "",
      "raw": "Lee Jae Myung says ‘bewildering’ incident may scare off future investment after Ice detained about 475 people\n\nUS politics live – latest updates\n\nSouth Korea’s government has said it will launch an investigation into whether human rights violations were committed when hundreds of its citizens were detained in a US immigration raid.\nAbout 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory in the US state of Georgia on 4 September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e665ec773bbb259ec25a2513e1bd9fb2925d298b",
      "title": "Bali battles worst floods in more than a decade",
      "url": "https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:18:22.000Z",
      "summary_90w": "",
      "raw": "At least 17 dead as torrential downpours trigger landslides, while heavy rain lashes India, Pakistan and Australia\nAt least 17 people have been confirmed dead in Bali, Indonesia, after the island’s worst flooding in more than a decade.\nTorrential rain last Tuesday and Wednesday triggered widespread flooding and landslides, leaving a trail of destruction. Eight victims were found in Denpasar, the island’s capital, and rescue teams continue to search for several others who remain missing.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db8b03e9757119836a6a0bf393b3b5bdbf922ef9",
      "title": "Democrats face an 'extinction moment' as strategists push them onto new platforms",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5484125/democrats-social-media-strategy-influencers",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Prominent Democratic lawmakers and influencers are encouraging their fellow Democrats to embrace social media and online video to reach voters or risk being left behind.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4aaf0b1519b1693ecda36ab19e69553918787683",
      "title": "Watch: Soda truck falls into sinkhole in Mexico City",
      "url": "https://www.bbc.com/news/videos/cj9zex1r3kjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T02:13:50.000Z",
      "summary_90w": "",
      "raw": "Initial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c32da42e9fdeae0a4b31d8d24406bc6fadbbb59",
      "title": "Brazilian musician identified as victim of 1976 killing by Argentina military",
      "url": "https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T09:00:29.000Z",
      "summary_90w": "",
      "raw": "The bossa nova pianist Francisco Tenório Cerqueira Júnior went out for cigarettes after a concert in Buenos Aires – a forensic team has finally revealed his fate\nEarly on 18 March 1976, Francisco Tenório Cerqueira Júnior, a Brazilian pianist who had played alongside some of Latin America’s greatest musicians, disappeared from the streets of Buenos Aires.\nFor nearly 50 years, his fate has remained a mystery, sparking desperate searches, raising suspicions of government complicity, and inspiring international documentaries. Now the mystery has been solved, with forensic scientists formally identifying Tenório Júnior’s body – and confirming he was a victim of Argentina’s bloody dictatorship.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf87dacabbd7c88b7a4526ff5ddb23e836521f3c",
      "title": "Trump administration launches trial program to fast-track electric air taxis",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540722/faa-air-taxi-pilot-program",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T23:38:26.000Z",
      "summary_90w": "",
      "raw": "The FAA is seeking proposals for projects that will include piloted and unmanned operations with a focus on electric air taxis, also called an electric vertical takeoff and landing aircraft.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "dd6ceb3988caed3aec42c88cbb7419d2377cf3aa",
      "title": "UN condemns reported Haitian village massacre by armed gangs",
      "url": "https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T22:26:51.000Z",
      "summary_90w": "",
      "raw": "Fishing village of Labodrie reportedly set on fire after killing of a gang leader in sign of rising violence outside capital\nThe UN secretary-general has condemned the reported killing of at least 40 people during an attack by armed gangs in a fishing village north of Haiti’s capital.\nMedia in Haiti widely reported that the attack took place on Thursday night in Labodrie. It is another sign of escalating gang violence that has spread outside the capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db6fb4e100a8587a10354226fa8af622dde02f46",
      "title": "Mexican congressional staffer resigns after TV comments about Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T19:59:09.000Z",
      "summary_90w": "",
      "raw": "News network Milenio releases public apology after US deputy secretary of state threatens to revoke Mexican visas\nA congressional staffer from Mexico’s ruling party has resigned after being called out online for comments he made on a major Mexican television news program about Turning Point USA executive director Charlie Kirk’s murder.\nThe news network, Milenio, also released a public apology after the United States’ deputy secretary of state – a former ambassador to Mexico – evidently threatened to have Donald Trump’s presidential administration revoke any US visas on which it may count.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6a87619aabc325ecc5b17cbadff1d38ab6cbc762",
      "title": "FAA seeks to fine Boeing $3.1 million for safety violations, door plug blowout",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540728/boeing-faa-safety-fines-door-plug-blowout",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T17:45:16.000Z",
      "summary_90w": "",
      "raw": "The FAA said it identified hundreds of quality system violations at Boeing's 737 factory in Renton, Wash., and Boeing subcontractor Spirit AeroSystems' 737 factory in Wichita, Kan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "a4976f072389d6e6b108dd1494ba10e71543b0f3",
      "title": "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540691/fed-governor-lisa-cook-vacation-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T15:23:53.000Z",
      "summary_90w": "",
      "raw": "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5e3e7d837141c7147db44ab24d24331323eed6d1",
      "title": "The Aristocrat, the Convict and the Missing Baby",
      "url": "https://www.bbc.co.uk/iplayer/episode/m001z954?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-07-14T14:30:00.000Z",
      "summary_90w": "",
      "raw": "An aristocrat and her convict partner go on the run with their newborn, ending in tragedy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}