{
  "version": "1757935696740",
  "generatedAt": "2025-09-15T11:28:16.740Z",
  "items": [
    {
      "id": "0a4792745f1377b58dc7496c2a0346f9fda5768c",
      "title": "UK and US unveil nuclear energy deal ahead of Trump visit",
      "url": "https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T11:20:33.000Z",
      "summary_90w": "",
      "raw": "Key among the plans is a proposal to build up to 12 advanced modular nuclear reactors in Hartlepool.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da88483c406faf61da49a6d5413f720ffde0885d",
      "title": "Russia and Belarus carry out military drills amid rising tension – Europe live",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T11:11:58.000Z",
      "summary_90w": "",
      "raw": "Allies rehearsing scenarios of an attack on Belarus in the first such exercises since Russia invaded Ukraine\nEU trade spokesperson Olof Gill also defended the EU’s sanctions from criticism that they are not going far enough.\nHe said:\n“Our assessment is that the successive sanctions packages we have brought forward, which includes new initiatives plus additional initiatives to make the previous one stronger if that makes sense, our assessment is that those sanctions are working. \nThe economic evidence shows that they are having an impact on the Russian economy, and that is precisely what they intended to do. \n“Phasing out of Russian fossil fuels is something that we have been doing and are doing actively for a number already of years, since the beginning of the war, with a very clear roadmap, with now even a clear legislative proposal in order to phase out the remaining gas still entering the EU.\n… This is something on which the EU has been very actively and we have a very, very clear roadmap, and how to go about it.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36ce4c998cc03a96b350913c6b67551c6ad45549",
      "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – Middle East crisis live",
      "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T11:11:17.000Z",
      "summary_90w": "",
      "raw": "Secretary of state holds press conference with Benjamin Netanyahu during visit to Jerusalem\nThat brings the press conference to a close, as Netanyahu takes a moment to acknowledge both his and Rubio’s staff who are sat in the front row.\nThe main takeaways from the event, which lasted just over half an hour, are that the US views international efforts to recognise the Palestinian state as a hindrance to peace efforts and that Netanyahu refuses to rule out future strikes on Hamas leaders – wherever they are.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8511e1812223ede424a8d13a1bea855d3ef0439e",
      "title": "Final stage of Vuelta abandoned because of protests",
      "url": "https://www.bbc.com/sport/cycling/articles/crl5dele2wro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T11:08:36.000Z",
      "summary_90w": "",
      "raw": "The final stage of the Vuelta a Espana is abandoned after pro-Palestinian protesters enter the course in the centre of Madrid.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "879dadf80061e3cff277e6fa1ea9b58dcdab064b",
      "title": "To save its rare birds, New Zealand is relying on a nation of backyard trappers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5508920/birds-new-zealand-conservation-invasive-species-predators-eradication",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T11:00:00.000Z",
      "summary_90w": "",
      "raw": "New Zealand's unique birds are at risk of extinction, like the kiwi. So the country is trying to eradicate the invasive species that prey on them. Everyday people are lining up to help.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "26d0075cfaf47c6294bbd4d12bcee4f8bf90abab",
      "title": "Tory MP and shadow minister Danny Kruger defects to Reform",
      "url": "https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:59:39.000Z",
      "summary_90w": "",
      "raw": "The East Wiltshire MP said the Conservatives were no longer the main party of opposition.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "309d58f696e0d3f8fcb2e94ff377a3f8a6dfb0f5",
      "title": "Charges dropped against two men accused of spying for China",
      "url": "https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:51:45.000Z",
      "summary_90w": "",
      "raw": "Christopher Cash, 30, and Christopher Berry, 33, had previously denied the allegations.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31c7777f7c3fc293abaf95f5c065ffd19de2f23b",
      "title": "Bloody Sunday deaths 'unnecessary and gratuitous', court told",
      "url": "https://www.bbc.com/news/articles/c79v8lddx0no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:42:36.000Z",
      "summary_90w": "",
      "raw": "The non-jury trial is taking place at Belfast Crown Court with the former soldier accused of two murders and five attempted murders.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f1a57b933a7bdf0fb3758e3a226f9dd3b801a63",
      "title": "What we know about the suspect arrested in Charlie Kirk's killing. And, Emmy takeaways",
      "url": "https://www.npr.org/2025/09/15/g-s1-88848/up-first-newsletter-charlie-kirk-shooting-investigation-middle-east-meetings-emmys-recap",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T10:42:32.000Z",
      "summary_90w": "",
      "raw": "Authorities say the suspect in the Charlie Kirk murder investigation is not cooperating. However, the people around him are. Here's what we know. And, takeaways from the 2025 Emmys.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "98a71d5511b50e3bc45a8827ace99736f71a6e45",
      "title": "Conor McGregor ends bid to be Irish president",
      "url": "https://www.bbc.com/news/articles/cly9rnv54jno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T10:26:41.000Z",
      "summary_90w": "",
      "raw": "The MMA fighter says the decision comes after \"careful reflection\" and consultation with his family.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b891f4057e857a162e24da6c124adcf9bd8434e5",
      "title": "Microsoft is changing how Xbox controllers work on Windows 11",
      "url": "https://www.theverge.com/news/777898/microsoft-xbox-controller-changes-windows-11",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T10:16:16.000Z",
      "summary_90w": "",
      "raw": "Microsoft has started testing a change to how Xbox controllers operate on Windows 11. The change will allow Xbox controllers to easily access the Task View on Windows 11 to tab between apps and games, using the Xbox button.\n“A new change we’re introducing is when you long press the Xbox button, it will open Task View,” explains Microsoft’s Windows Insider team. “Pressing and holding the Xbox button continues to turn off the game controller.”\nThe change will align Xbox controllers with the work Microsoft is doing for handheld gaming PCs with Windows 11. The upcoming Xbox Ally devices will have an Xbox button, which opens a handheld-friendly task switcher with a long press. Microsoft has tweaked the task switcher on handhelds so it has new animations, and it’s not clear if this same interface will come to all Windows 11 gaming PCs.\nYou can already use a single press of the Xbox button on handhelds or controllers to open the Game Bar in Windows 11, and access widgets, games, and performance information. Microsoft has started testing this change with Windows Insiders in the Dev Channel, so they should be available to all Windows 11 users in the coming months.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25ad518d772bd54de3d167ff70a9ace9258d1f60",
      "title": "Strong winds sweeping across UK - but why isn't this Storm Amy?",
      "url": "https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:08:41.000Z",
      "summary_90w": "",
      "raw": "There is a chance of travel disruption on Monday with a Met Office yellow warning for England and Wales but this is not a named storm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eee8d8b260d1c9436cb4fb0ee2c196cca114add9",
      "title": "Rubio meets Netanyahu to discuss fallout from Israel's Qatar strike",
      "url": "https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:07:59.000Z",
      "summary_90w": "",
      "raw": "Israel's strike targeting Hamas leaders in Doha last week drew international outrage and was publicly criticised by the US.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fb9461a9d90ab7f659bb07f3d15350d6fe1d9d53",
      "title": "Political row erupts in Spain after Vuelta cycle race abandoned amid Gaza protests",
      "url": "https://www.theguardian.com/world/2025/sep/15/spains-pm-criticised-after-vuelta-a-espana-race-abandoned-over-pro-palestinian-protests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T10:07:38.000Z",
      "summary_90w": "",
      "raw": "PM Pedro Sánchez accused of ‘embarrassing’ Spain after praising protesters who forced final stage to be abandoned\nThe premature and chaotic end of the Vuelta a España cycle race has triggered a bitter political row in Spain, with opposition politicians accusing the prime minister, Pedro Sánchez, of causing the country “international embarrassment” by encouraging pro-Palestinian demonstrators to disrupt the event.\nThe race’s final stage was abandoned after groups protesting against the participation of the Israel-Premier Tech team swamped the finish line area and presentation podium in central Madrid on Sunday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "57e08730e5c0ccf9cd1d6e3a65b55c9420525164",
      "title": "Ricky Hatton's family pay tribute, saying his heart was as big as his smile",
      "url": "https://www.bbc.com/sport/boxing/articles/cvg9q28l49no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T10:04:40.000Z",
      "summary_90w": "",
      "raw": "Ricky Hatton's family pay tribute to the former world champion, who was found dead at the age of 46 at his home in Manchester on Sunday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7bc0e01716e04fb215d665ae7749db450a67983e",
      "title": "Starmer facing leadership questions after Mandelson sacking",
      "url": "https://www.bbc.com/news/articles/ce32qepq12qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T09:51:12.000Z",
      "summary_90w": "",
      "raw": "Some Labour MPs have become more vocal in their criticism of the prime minister after the departures of Angela Rayner and Peter Mandelson.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92da274d7844b9a86cdf639a950e468463f02630",
      "title": "Human rights commissioner blasts Queensland government’s ‘hostile’ approach to First Nations people",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/human-rights-commissioner-blasts-queensland-government-hostile-approach-first-nations-people",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:36:42.000Z",
      "summary_90w": "",
      "raw": "Scott McDougall uses speech at parliament to warn the LNP is ‘walking us backwards’ on reconciliation as he prepares to exit role\n\nGet our breaking news email, free app or daily news podcast\n\nQueensland’s human rights commissioner has blasted the state government’s “hostile”, “assimilationist” approach to First Nations people in a speech at Parliament House.\nScott McDougall, Queensland’s first-ever human rights commissioner, has consistently criticised both sides of politics over a range of issues, particularly the state’s youth law and order crackdown. His seven-year term in the role comes to an end next month.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "19fb18833494bed2c1cf721e0279be4fc5bf235f",
      "title": "Australian PM blames ‘aggressive protesters’ for closure of local electorate office",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/anthony-albanese-closes-grayndler-electorate-office-marrickville-palestine-protesters",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:35:23.000Z",
      "summary_90w": "",
      "raw": "Anthony Albanese says site next to church ‘became untenable’ after repeated protests against Gaza war in inner Sydney suburb\n\nGet our breaking news email, free app or daily news podcast\n\nThe Australian prime minister, Anthony Albanese, has closed his inner-Sydney electorate office after almost 30 years, saying his hand had been forced by repeated protests outside the office.\nAlbanese’s office in Marrickville, in his electorate of Grayndler, has long been a target of demonstrations, particularly over the war in Gaza, including a months-long sit-in outside the office in 2024.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae768bbe9ffa5bdd217ed5d67ea4f6bd7f4f9a67",
      "title": "Elon Musk could become the world's 1st trillionaire. Here's the effect it could have",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534086/elon-musk-could-become-the-worlds-1st-trillionaire-heres-the-effect-it-could-have",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-15T09:28:58.000Z",
      "summary_90w": "",
      "raw": "Elon Musk could become the world's first trillionaire if Tesla's new compensation package gets approved. Brookings Institution Senior Fellow Darrell West talks about the implications of the offer.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "caeb16e649da1805e48e2c71fea5955e01b1a51d",
      "title": "India court stays key provisions of controversial new law on Muslim properties",
      "url": "https://www.bbc.com/news/articles/cgq4vx2l45no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T09:24:18.000Z",
      "summary_90w": "",
      "raw": "The court refused to strike down the entire law saying \"the grant of stay is only in the rarest of rare category\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e665ec773bbb259ec25a2513e1bd9fb2925d298b",
      "title": "Bali battles worst floods in more than a decade",
      "url": "https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:18:22.000Z",
      "summary_90w": "",
      "raw": "At least 17 dead as torrential downpours trigger landslides, while heavy rain lashes India, Pakistan and Australia\nAt least 17 people have been confirmed dead in Bali, Indonesia, after the island’s worst flooding in more than a decade.\nTorrential rain last Tuesday and Wednesday triggered widespread flooding and landslides, leaving a trail of destruction. Eight victims were found in Denpasar, the island’s capital, and rescue teams continue to search for several others who remain missing.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d58d7157d2af9b5ed45705870a792932df64294f",
      "title": "‘We’ve got no tourists’: small businesses caught up in Australia’s largest manhunt struggle as aid announced",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/porepunkah-victorian-government-support-package-tourism-small-business-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:16:56.000Z",
      "summary_90w": "",
      "raw": "Victorian government pledges up to $2.5m to help visitor economy in alpine region as search for alleged Porepunkah killer Dezi Freeman continues\n\nGet our breaking news email, free app or daily news podcast\n\nThe Victorian government has announced a support package for tourism operators and small businesses caught up in Australia’s largest manhunt.\nThe government announced on Monday that as much as $2.5m would be paid to support the visitor economy in Porepunkah, Bright and surrounding region, as the search for alleged police killer Dezi Freeman edged towards a fourth week.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a09f76d6ea340e86a56862cf5eb5a76f45f4be2f",
      "title": "Kirk suspect 'not co-operating' with authorities, governor says",
      "url": "https://www.bbc.com/news/articles/c4gvrw2pgedo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T09:06:28.000Z",
      "summary_90w": "",
      "raw": "He adds that \"much more evidence and information\" will become available once charges are filed in the case.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "485a887f48deb1e5fbf1f88873cd6a4773a67618",
      "title": "Conor McGregor pulls out of Ireland’s presidential race",
      "url": "https://www.theguardian.com/world/2025/sep/15/conor-mcgregor-pulls-out-of-ireland-presidential-race",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T09:02:23.000Z",
      "summary_90w": "",
      "raw": "Former mixed martial arts fighter had vowed to curb immigration to shore up ‘Irish culture’ and give power ‘back to the people’\nThe former mixed martial arts fighter Conor McGregor has withdrawn from Ireland’s presidential election and complained that nomination rules were a “straitjacket” that prevented a true democratic contest.\n“Following careful reflection, and after consulting with my family, I am withdrawing my candidacy from this presidential race,” he posted on X on Monday morning. “This was not an easy decision, but it is the right one at this moment in time.”\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "44a6d52d970d412aeba42e2da31ae9f78fc059af",
      "title": "A record number of congressional lawmakers aren't running for reelection in 2026. Here's the list",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5534254/house-senate-retirement-tracker-2026",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR is tracking the record number of lawmakers in Congress who have already announced they don't plan to run for reelection ahead of the 2026 midterms.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c76900fcf4ad49a2cb21c40c28f407a88e630ae6",
      "title": "A Utah church embarks on a healing journey in the aftermath of the Kirk assassination",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5541417/orem-utah-church-healing-charlie-kirk-assassination",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "A church in Orem, Utah, the city where Charlie Kirk was killed, brings healing during its Sunday service. \"We're going to be navigating this as a community and as a church family for months to come.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db8b03e9757119836a6a0bf393b3b5bdbf922ef9",
      "title": "Democrats will 'either adapt or die' as strategists push them onto new platforms",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5484125/democrats-social-media-strategy-influencers",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Prominent Democratic lawmakers and influencers are encouraging their fellow Democrats to embrace social media and online video to reach voters or risk being left behind.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "682f7fde67ac0b0c1fe241c4bb3ae3c40d37e492",
      "title": "Is it the magnesium or the massage? The facts about magnesium lotion for sleep",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5529375/magnesium-lotion-massage-sleep",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Social media influencers claim that using lotion with magnesium promotes sleep. But there's little evidence magnesium taken in this way is effective.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18e6666c8d85f6ac89abcc97a5f43729e644b6ff",
      "title": "Melting glaciers mean an uncertain future for Europe's rivers",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5535161/europe-melting-glaciers-switzerland-alps",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Europe is warming faster than any continent. That's speeding up glacial melt, which is already threatening Europe's largest rivers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1486f9b96cae2b5e1f2628c86cd4f178799ed5be",
      "title": "Trump, fascinated by the royals, gets a rare second U.K. state visit",
      "url": "https://www.npr.org/2025/09/15/nx-s1-5507253/trump-royals-uk-state-visit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Trump has long expressed fascination with the royal family. The U.K. government will tap into that this week during a state visit that combines pageantry and politics.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ba9c6cffda714aa3cf269b6307e77264b840c9bc",
      "title": "Brazil's Lula hits back at Trump over Bolsonaro trial and tariffs",
      "url": "https://www.bbc.com/news/articles/cj3yxkkdlkvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:43:19.000Z",
      "summary_90w": "",
      "raw": "In an essay, he says Brazil's democracy and sovereignty \"are not on the table\" after clashes with the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d0fccf81ec9654ec392374f2c720ac061927237",
      "title": "Up to 20 deaths linked to ‘end of life’ business that sourced veterinary drug through fake whale charity, police allege",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/police-investigating-deaths-linked-to-end-of-life-business-gold-coast-veterinary-drug-found-mans-body-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T08:40:50.000Z",
      "summary_90w": "",
      "raw": "Police allege Gold Coast business owner used charity to secure euthanasia drugs as 53-year-old charged with aiding suicide and trafficking dangerous drugs\n\nGet our breaking news email, free app or daily news podcast\n\nPolice have uncovered an alleged “end of life” business believed to be linked to as many as 20 deaths, with investigations across three states after a man died from a veterinary euthanasia drug.\nQueensland police have charged a Gold Coast man alleged to have operated the business, Brett Daniel Taylor, with two counts of aiding suicide and several drug offences including trafficking dangerous drugs.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "baa6ed9feabcc4d5e8e3d1ee77681980fb643881",
      "title": "The SSD version of LaCie’s iconic Rugged drive gets a speed boost",
      "url": "https://www.theverge.com/news/776676/seagate-lacie-rugged-ssd4-external-drive-apple-prores-4k",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T08:30:00.000Z",
      "summary_90w": "",
      "raw": "The new LaCie Rugged SSD4 is compatible with computers, tablets, and smartphones. | Image: Seagate\t\n\nNeil Poulton succeeded in elevating the design of external drives two decades ago with the introduction of LaCie’s Rugged line, which features a bright orange bumper to protect data from drops. Today, Seagate announced an updated version of the LaCie Rugged Mini SSD with a few small design tweaks and a big boost to transfer speeds.\nThe drive is now called the LaCie Rugged SSD4 and is available starting today in 1TB, 2TB, and 4TB capacities (Seagate is dropping the 500MB option) for $134.99, $249.99, and $479.99, respectively.\nThe Rugged SSD4 is exactly the same size as its predecessor but now features a brushed aluminum finish and a centered USB-C port. It now supports transfer speeds up to 40Gbps with 4,000MB/s read speeds and 3,000MB/s write speeds. Seagate’s older Rugged Mini SSD had a USB-C port that was slightly off-center, a smoother aluminum finish, and read speeds that maxed out at 2,000MB/s.\nThe new drive isn’t quite as fast as the LaCie Rugged SSD Pro5 that was introduced earlier this year at CES with 6,700MB/s read and 5,300MB/s write speeds, but when it’s connected to a USB-C iPhone, the Rugged SSD4 is fast enough to capture ProRes 4K footage at 120fps.\nAs with the previous version, the new Rugged SSD4 has an IP54 rating against dust and water, but it’s definitely not waterproof so while splashes are okay, a complete dunking would not be. Its orange bumper also protects it from drops as high as nearly 10 feet, but that’s definitely not an invitation to casually toss it around.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0e5fc3f75bc5a8163f9ec8a7d1c560e28f8dca1",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T08:26:29.000Z",
      "summary_90w": "",
      "raw": "Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus\n\nBusiness live – latest updates\n\n\nChina’s economy showed further signs of weakness last month as it comes under strain from Donald’s Trump trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.\nThe disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "797925f69b9147b404065744896971bb9cb2fa6f",
      "title": "History-making wins and heartfelt thank yous - highlights from the ceremony in LA",
      "url": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T08:22:42.000Z",
      "summary_90w": "",
      "raw": "Host Nate Bargatze's plan to keep speeches snappy backfires and political statements take centre stage at the 77th Primetime Emmy Awards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93b867dff742cdf6387083e9cfa832d6a513aee3",
      "title": "Fourteen NHS trusts' maternity care to be investigated over 'failures'",
      "url": "https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T08:15:11.000Z",
      "summary_90w": "",
      "raw": "Families impacted have criticised the review, calling it \"not fit for purpose\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "29ed782f76bf4e53012abbfce3681deafac19e7b",
      "title": "Apple’s new iPhone charger is a first of its kind",
      "url": "https://www.theverge.com/news/777883/apple-charger-usb-pd-3-2-avs-dynamic",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-15T08:14:59.000Z",
      "summary_90w": "",
      "raw": "Apple’s 40W Dynamic Power Adapter with 60W Max. | Image: Apple\t\n\nAlongside its new iPhone 17 lineup, Apple casually launched a world’s first last week inside the very dull sounding “Apple 40W Dynamic Power Adapter with 60W Max.” It’s the first charger to support the USB PD 3.2 AVS protocol, giving you some of the benefits of a more powerful 60W charger in a compact 40W package.\nAVS — which stands for Adjustable Voltage Supply — provides granular voltage options allowing the power source to offer more precise and efficient charging of devices like smartphones and laptops. You can see it listed on the charger specs from Apple Insider’s hands-on.\nFor reasons of safety, efficiency, and longevity, the batteries in our phones and laptops do not charge at their maximum possible input for the entirety of the charging cycle. Instead it’s regulated at predefined voltages to slow down charging as the battery fills. With AVS, the power source can provide a very specific voltage that is closer to the ideal needed for the device being charged, speeding up charging without overheating.\nHowever, unlike a true 60W charger, Apple’s little 40W GaN charger can not maintain that peak 60W rate forever — only 18 minutes as demonstrated by Privaterbok over at the r/UsbCHardware subreddit. That makes it suitable for fast charging a new iPhone 17 but not a MacBook Pro, which is why Apple sells it as a 40W charger “with 60W Max” and not a 60W charger.\nIt also means that you might need Apple’s $39 Dynamic Power Adapter if you want to match Apple’s fast charging claim for the iPhone 17 models (“up to 50 percent in 20 minutes”) or wait for Anker and others to provide a compatible USB PD 3.2 AVS charger of their own.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9a46cab926665418770364de50e843b4dc9264b",
      "title": "Millions of Australians at risk from rising sea levels and heat deaths to soar, national climate risk assessment report warns",
      "url": "https://www.theguardian.com/australia-news/2025/sep/15/millions-of-australians-at-risk-from-rising-sea-levels-and-heat-deaths-could-soar-landmark-climate-report-warns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T07:58:58.000Z",
      "summary_90w": "",
      "raw": "National climate risk assessment report finds heat-related deaths would surge 450% in Sydney if global heating surpasses 3C\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nAnthony Albanese says a landmark report on the climate risks confronting Australia is a “wake-up call” that reinforces the need for “serious” action to combat global heating.\nThe prime minister said the findings of the national climate risk assessment would inform the government’s soon-to-be released 2035 emissions target, while stressing the need to plan for an “orderly” energy transition to avoid losing public support for climate action.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "64818ba30a0c60188e0771285de8c2e100c0665f",
      "title": "US and China hold second day of trade talks as TikTok deadline looms",
      "url": "https://www.bbc.com/news/articles/cj9zedgkm21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T07:30:55.000Z",
      "summary_90w": "",
      "raw": "The negotiations are the latest attempt to end a trade war between the world's two biggest economies.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b79092c60c1bbfe618292fd8c5545606d73d6ac6",
      "title": "Watch: The winning speeches - in two minutes",
      "url": "https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T07:26:45.000Z",
      "summary_90w": "",
      "raw": "Adolescence star Owen Cooper became the youngest ever male winner and The Pitt took out the top drama series award.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "35622f7a132dfb266b5843968526910d80568944",
      "title": "'Killer' child car seats still on sale 10 years on",
      "url": "https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T07:24:33.000Z",
      "summary_90w": "",
      "raw": "Which? advised families to buy approved seats with a clear orange label indicating they are safe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ac3b016c4c4ec03f354aceae5c11f89e54306cd",
      "title": "Qatar hosts Arab-Islamic emergency summit over Israeli strike on Doha",
      "url": "https://www.bbc.com/news/articles/c4gk8nx5nw3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T06:49:38.000Z",
      "summary_90w": "",
      "raw": "A draft resolution reportedly says Israeli \"hostile acts\" threaten peace in the Middle East.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "773eff430307ffb0d9281068cae5b2ad338acb0a",
      "title": "Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor",
      "url": "https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T06:28:30.000Z",
      "summary_90w": "",
      "raw": "This year's Strictly contestants spill the beans on the backstage gossip ahead of the show's launch.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f7695f814927e386ec1b52d72640bd14608aac66",
      "title": "Monday briefing: Israel’s bombing of Qatar threatens the fabric of Gulf security",
      "url": "https://www.theguardian.com/world/2025/sep/15/monday-briefing-israels-bombing-of-qatar-threatens-the-fabric-of-gulf-security",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T05:36:33.000Z",
      "summary_90w": "",
      "raw": "In today’s newsletter: For decades, Gulf states have believed that a close relationship with US will guarantee their safety. That is no longer the case\nGood morning. Last Monday, Israel’s foreign minister, Gideon Saar, announced that his country had accepted the US ceasefire proposal to end the devastating war in Gaza. The very next day, Israel attempted to kill Hamas’s negotiating team while they were in Qatar’s capital to discuss that same proposal.\nIsrael, initially bullish about the success of the operation, has since grown more doubtful that it killed any Hamas leaders in Doha. Hamas said that while six people were killed in the bombing – including the son of Khalil al-Hayya, the deputy head of its political bureau – the top leadership including the negotiating team survived.\nUK news | Britain will “never surrender” to far-right protesters who use the English flag as cover for violence and to instil fear, Keir Starmer has said, condemning attacks against police officers and racist harassment after more than 110,000 people attended an extremist London rally.\nCrime | Christian Brueckner, prime suspect in the disappearance of Madeleine McCann, has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, Scotland Yard has said.\nUS | The Utah governor, Spencer Cox, has said 22-year-old Tyler Robinson, the man accused of killing Turning Point USA executive director Charlie Kirk, “does come from a conservative family – but his ideology was very different than his family”. Robinson was not cooperating with authorities, said Cox.\nEurope | Poland’s foreign minister has said the Russian drone incursion into Polish airspace was an attempt by the Kremlin to test Nato’s reactions by incremental escalations without prompting a full-scale response, as Romania became the second Nato country to report an incursion in a matter of days.\nTelevision | It was a full sweep for Adolescence at the Emmys, winning every award in which the show was nominated tonight. Fifteen-year-old Owen Cooper made history as the youngest ever actor to win the Emmy for best supporting actor in a limited series. Emmy awards 2025 – full list of winners\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2a877d42bb9dd3d18e601613b86e8c8bab0baa5a",
      "title": "Rising seas will threaten 1.5 million Australians by 2050 - report",
      "url": "https://www.bbc.com/news/articles/c930454e77xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T05:34:24.000Z",
      "summary_90w": "",
      "raw": "Australia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "aa9d15bf324a05cc36d9d2de63a6f97a63046f9a",
      "title": "Prime Madeleine McCann suspect refuses Met interview before German prison release",
      "url": "https://www.theguardian.com/uk-news/2025/sep/15/prime-madeleine-mccann-suspect-refuses-met-interview-before-german-prison-release",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T05:00:57.000Z",
      "summary_90w": "",
      "raw": "Scotland Yard made formal request to interview Christian Brueckner, due for release from seven-year rape sentence\nThe prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, the force has said.\nThe Met confirmed it had submitted a formal international request to question Christian Brueckner, the 49-year-old German national who has long been under investigation in connection with Madeleine’s disappearance, but the suspect declined.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dda56fa31f970d69ff81f2e359c87e7b9940b7a1",
      "title": "Trade war and faltering economy - five challenges facing Canada's Mark Carney",
      "url": "https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:59:38.000Z",
      "summary_90w": "",
      "raw": "From a faltering economy to high expectation from the public, parliament's return could bring challenges for Canada's new PM.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ffb7ca9f0926897b91751f91eec744a956e89068",
      "title": "'So surreal... I didn't expect to be in the US, never mind here'",
      "url": "https://www.bbc.com/news/videos/c2370d58pk5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:59:24.000Z",
      "summary_90w": "",
      "raw": "The star of Adolescence won in the best supporting actor in a limited series category.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T04:51:12.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbe93a918a6b83d4c8cec412d90ee204eeb13386",
      "title": "Europe’s summer of extreme weather caused €43bn of short-term losses, analysis finds",
      "url": "https://www.theguardian.com/world/2025/sep/15/europes-summer-of-extreme-weather-caused-43bn-of-short-term-losses-analysis-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T04:00:55.000Z",
      "summary_90w": "",
      "raw": "Greatest damage from heat, drought and flooding done in Cyprus, Greece, Malta and Bulgaria \nThe violent weather that battered Europe this summer caused short-term economic losses of at least €43bn, according to an EU-wide estimate, with costs expected to rise to €126bn by 2029.\nThe immediate hit to the economy from a single brutal summer of heat, drought and flooding amounted to 0.26% of the EU’s economic output in 2024, according to the rapid analysis, which has not been submitted for peer review but is based on relationships between weather and economic data that were published in an academic study this month.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90bf2b02a364567b8812f5ce2202fadf23424be5",
      "title": "How Adolescence pulled off an Emmys sweep",
      "url": "https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T03:40:13.000Z",
      "summary_90w": "",
      "raw": "The Netflix drama, starring Owen Cooper, explored the impact of smartphones on teenagers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "00a7f4307afa99ddb5d740dbe2c0be9aaed877c1",
      "title": "Adolescence star Owen Cooper makes Emmys history as youngest male winner",
      "url": "https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T03:30:53.000Z",
      "summary_90w": "",
      "raw": "The 15-year-old has become the youngest male winner in Emmys history for his role in Netflix's drama.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4aaf0b1519b1693ecda36ab19e69553918787683",
      "title": "Watch: Soda truck falls into sinkhole in Mexico City",
      "url": "https://www.bbc.com/news/videos/cj9zex1r3kjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-15T02:13:50.000Z",
      "summary_90w": "",
      "raw": "Initial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c194725d1ea9696b0a5c61d7eec02f2b48bc2862",
      "title": "Bobby Hart, who co-wrote 'Last Train to Clarksville' and other Monkees hits, dies",
      "url": "https://www.npr.org/2025/09/14/nx-s1-5541399/bobby-hart-monkees-dead",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T00:45:42.000Z",
      "summary_90w": "",
      "raw": "Bobby Hart teamed with Tommy Boyce on such hits as \"Last Train to Clarksville\" and \"I'm Not Your Steppin' Stone.\"",
      "topics": [
        "World"
      ]
    },
    {
      "id": "812101fea2492226fe35c003b91ddef1c522d31c",
      "title": "Trump insists foreign workers are ‘welcome’ days after arrest of hundreds of South Koreans",
      "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-foreign-workers-welcome-south-korea-arrests",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-15T00:39:54.000Z",
      "summary_90w": "",
      "raw": "US president says he doesn’t want to ‘disincentivize investment’ after images of workers chained and handcuffed caused widespread alarm in South Korea\nPresident Donald Trump has said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platform, Trump wrote: “I don’t want to frighten off or disincentivize investment.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c0687931e50fcdf7d4473c13d79732d68294470f",
      "title": "In pictures: Best looks from the Emmys red carpet in LA",
      "url": "https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-15T00:26:06.000Z",
      "summary_90w": "",
      "raw": "Sydney Sweeney, Jenna Ortega and Selena Gomez are among the stars who posed for pictures ahead of the event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61056306a53935963c9aee6ed1c38ce93fedfe34",
      "title": "Australia approves vaccine to protect koalas from chlamydia",
      "url": "https://www.npr.org/2025/09/14/nx-s1-5541358/australia-koala-chlamydia-vaccine",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-15T00:11:23.000Z",
      "summary_90w": "",
      "raw": "Chlamydia in koalas can cause blindness, infertility and even death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3d0baf61a59e44d4ce882f4771182b6f1cbe2e92",
      "title": "Madeleine McCann suspect refuses Met Police interview",
      "url": "https://www.bbc.com/news/articles/cr5qd18y8j5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:50:42.000Z",
      "summary_90w": "",
      "raw": "Christian Brückner is due to be released from prison in Germany on a separate offence this week.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3f20771bc1da7b4c5b72d164b114330cdf992415",
      "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
      "url": "https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:36:44.000Z",
      "summary_90w": "",
      "raw": "Why so many corn belt Americans continue to back Trump, even while feeling economic pressure driven partly by his trade policy",
      "topics": [
        "World"
      ]
    },
    {
      "id": "403bfa1b35100d874342d1236d3f7c72bc5db77c",
      "title": "'It's just scary': In Florida, parents ponder future with fewer vaccines",
      "url": "https://www.bbc.com/news/articles/cd07jn0m2y5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T23:25:04.000Z",
      "summary_90w": "",
      "raw": "Florida is pushing to end vaccine mandates as RFK Jr, an immunisation sceptic, remakes US vaccine policy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c736b4edfca330c869707142f35cef62163afbc1",
      "title": "Struggling with brain fog? Here's how to fix it",
      "url": "https://www.bbc.com/news/articles/c87ydw7xdxvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:22:44.000Z",
      "summary_90w": "",
      "raw": "It's common to become forgetful or mentally sluggish but there are easy ways to cut through the haze.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb2488492f59ca5b56e1396f665ff2dab37c7d9c",
      "title": "'Something had been stolen from me': Children share the lows - and highs - of pandemic",
      "url": "https://www.bbc.com/news/articles/cx2jll1wx4ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:14:25.000Z",
      "summary_90w": "",
      "raw": "Children describe positive memories of family time, as well as the darker side of pandemic life online.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "875f9e36e7dab6be16dfe2731be6172d1467cd8f",
      "title": "'Everybody wants to know what's going to happen' - Summer I Turned Pretty star on the finale of the breakout TV hit",
      "url": "https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:41.000Z",
      "summary_90w": "",
      "raw": "With 25 million viewers and a passionate fandom, season three of The Summer I Turned Pretty is a global sensation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ee1bcd1710b1703ad3dc17e278c8fed6eeb14c6b",
      "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
      "url": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T23:08:02.000Z",
      "summary_90w": "",
      "raw": "Young Ugandan women tell BBC they are being lured to Dubai to take part in extreme sex acts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc72e58d54b03f9ecda2b3ed493e76146c23e328",
      "title": "Why Man Utd's problem is not the system, it's the personnel",
      "url": "https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T22:47:02.000Z",
      "summary_90w": "",
      "raw": "MOTD pundit Danny Murphy explains how Manchester United's defeat by Manchester City was not down to Red Devils coach Ruben Amorim's rigid 3-4-2-1 formation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd12c04e0781a181213f7f387203dc7e0996d16a",
      "title": "'My wife died giving birth after Trump cut funding to our clinic'",
      "url": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T20:59:49.000Z",
      "summary_90w": "",
      "raw": "The BBC hears devastating accounts of Afghan mothers and babies dying after US-backed clinics shut.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1243e3bb82239cdf31f9a27d929dcb7b7c1aba01",
      "title": "OpenAI board chair Bret Taylor says we’re in an AI bubble (but that’s okay)",
      "url": "https://techcrunch.com/2025/09/14/openai-board-chair-bret-taylor-says-were-in-an-ai-bubble-but-thats-okay/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T19:33:22.000Z",
      "summary_90w": "",
      "raw": "Like OpenAI CEO Sam Altman, Bret Taylor thinks we're in an AI bubble — but he doesn't sound too worried about it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2e3cb823abf8fd38db62555a3156f917e00df3ee",
      "title": "What’s next for Apple after the iPhone 17?",
      "url": "https://www.theverge.com/apple-rumors/777791/whats-next-for-apple-iphone-17-m5-ipad-pro",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T19:18:59.000Z",
      "summary_90w": "",
      "raw": "We only just put Apple's iPhone 17 launch event behind us, but Bloomberg's Mark Gurman is already glancing into his crystal ball to see what's next for the company. In today's Power On newsletter Gurman says that there are at least 10 more products from Apple that are expected to launch either later this year or in the first half of 2026. \nSome of those products have been rumored for some time, or are just kind of obvious upgrades. The M5 iPad Pro, for instance, is a matter of when not if. Though the rumors that it will have a second front facing camera for those that prefer to use their iPad in portrait mode is interesting. The iPad Pro co …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "45a48bf6f5f7e507ef89dec4ef3fadf8a6bf3051",
      "title": "Guy Pearce and Annie Lennox join call to end ‘normalised horror’ for children in Gaza",
      "url": "https://www.theguardian.com/world/2025/sep/14/guy-pearce-and-annie-lennox-join-call-to-end-normalised-horror-for-children-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T19:00:41.000Z",
      "summary_90w": "",
      "raw": "Stars read Michael Rosen’s 2014 poem Don’t Mention the Children in film released by Save the Children\nGuy Pearce, Annie Lennox and Vanessa Redgrave are among the celebrities calling for an end to the “normalised horror” of children being killed in Gaza, as part of new short film.\nReleased by Save the Children and Choose Love, it features the stars reciting the words to a poem by Michael Rosen. Titled Don’t Mention the Children, the poem was written in 2014 in response to a Guardian article about the Israeli government banning a radio advert naming children killed in Gaza. It begins:\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf97b38c63fc5e47b59479ba2c495a3dda116f1e",
      "title": "Vibe coding has turned senior devs into ‘AI babysitters,’ but they say it’s worth it",
      "url": "https://techcrunch.com/2025/09/14/vibe-coding-has-turned-senior-devs-into-ai-babysitters-but-they-say-its-worth-it/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T19:00:00.000Z",
      "summary_90w": "",
      "raw": "TechCrunch spoke to experienced coders about their time using AI-generated code about what they see as the future of vibe coding.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6e4b9bd1395bf24c06c4549487476441ba4949ee",
      "title": "Users turn to chatbots for spiritual guidance",
      "url": "https://techcrunch.com/2025/09/14/users-turn-to-chatbots-for-spiritual-guidance/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T18:45:26.000Z",
      "summary_90w": "",
      "raw": "At least one website claims to allow users to chat with God.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "904251f1ce2565ad2a24283cd3b0e4842bdd9db2",
      "title": "Karen Hao on the Empire of AI, AGI evangelists, and the cost of belief",
      "url": "https://techcrunch.com/2025/09/14/karen-hao-on-the-empire-of-ai-agi-evangelists-and-the-cost-of-belief/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T17:00:34.000Z",
      "summary_90w": "",
      "raw": "OpenAI’s rise isn’t just a business story — it’s an ideological one. On Equity, Karen Hao, author of Empire AI, explores how the cult of AGI has fueled a billion-dollar race, justified massive spending on compute and data, and blurred the line between mission and profit.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5729cc1c169d8f60e9e3b319cba8c1453a447350",
      "title": "Rolling Stone’s parent company sues Google over AI Overviews",
      "url": "https://www.theverge.com/ai-artificial-intelligence/777788/rolling-stone-penske-media-sue-google-ai-overviews",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T16:49:38.000Z",
      "summary_90w": "",
      "raw": "Disclosure: Penske Media Corporation is an investor in Vox Media, The Verge’s parent company.\nPenske Media Corporation, the publisher of Rolling Stone and The Hollywood Reporter, has become the first major American media company to sue Google over its AI summaries. The company claims that the AI Overviews that often appear at the top of search results leave users with little reason to click through to the source, hurting traffic and illegally benefitting from the work of its reporters. \nWhile Penske Media is the biggest name to take on Google over its AI Overviews, it’s not the first. Online education company Chegg sued Google in February, as did a group of independent publishers in Europe. The News / Media Alliance has also spoken out about the feature, calling it the “definition of theft” and seeking action from the DOJ. \nGoogle spokesperson José Castañeda defended the summaries to the Wall Street Journal saying, “with AI Overviews, people find search more helpful and use it more.” But Penske and other publishers say there is little reason to follow the links provided in search results and, as a result, they have seen significant drops in traffic and revenue. Penske claims in the suit that revenue from affiliate links is down by over 1/3 this year, and it attributes that directly to a drop in traffic from Google.\nThe company also claims it’s in a tough situation. It can either block Google from indexing its content, essentially removing itself from all search results, which would further devastate its business. Or, it can continue to provide training material to Google for its AI, “adding fuel to a fire that threatens PMC’s [Penske Media Corporation] entire publishing business,” the complaint states, according to the Wall Street Journal.\nThis is, of course, just the latest battle between AI companies and the creators of the content they harvest. Encyclopedia Britannica and Merriam-Webster recently sued Perplexity, as did News Corp last year. Meanwhile Microsoft and OpenAI have found themselves in the crosshairs of the New York Times, the New York Daily News, the Chicago Tribune, and others. Google might also have a tougher time defending itself now that it’s been forced to admit that “the open web is already in rapid decline,” as it faces multiple antitrust complaints.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a46d1579e465359b7bdb94317cbfb6ef660b22a6",
      "title": "Romania becomes second Nato country to report Russian drone in its airspace",
      "url": "https://www.bbc.com/news/articles/c80g7g5rmlno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T16:41:33.000Z",
      "summary_90w": "",
      "raw": "Ukraine's President Zelensky called the incursion \"an obvious expansion of the war by Russia\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8cf7a2fc5130b7dbf152e77a41df944d4bff50b",
      "title": "iPhone 17, iPhone Air, AirPods Pro 3, and everything else announced at Apple’s hardware event",
      "url": "https://techcrunch.com/2025/09/14/iphone-17-iphone-air-airpods-pro-3-and-everything-else-announced-at-apples-hardware-event/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:32:39.000Z",
      "summary_90w": "",
      "raw": "From a new slim iPhone Air model to  redesigned AirPods, here's what was announced at this year's Apple event.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d255e0d51c980977f1b46f94ea14e4793540e5a",
      "title": "Rolling Stone owner Penske Media sues Google over AI summaries",
      "url": "https://techcrunch.com/2025/09/14/rolling-stone-owner-penske-media-sues-google-over-ai-summaries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:20:00.000Z",
      "summary_90w": "",
      "raw": "Penske's lawsuit accuses Google of abusing its monopoly power in search to force publishers to support AI summaries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0dc0dca23aed0dfd2bcb84fd574c38952b866731",
      "title": "Via raises $492.9M in IPO, and German automakers go on the offensive",
      "url": "https://techcrunch.com/2025/09/14/via-raises-492-9m-in-ipo-and-german-automakers-go-on-the-offensive/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T16:05:00.000Z",
      "summary_90w": "",
      "raw": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c3a38529f8ffb404cc8894a0ab6c5077f60f11b1",
      "title": "Rubio in Israel for talks to limit diplomatic damage over Qatar strikes",
      "url": "https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T15:47:55.000Z",
      "summary_90w": "",
      "raw": "US secretary of state says Trump ‘not happy’ about Israeli attack that targeted Hamas officials in Doha for Gaza talks\nThe US secretary of state, Marco Rubio, has held talks in Israel with Benjamin Netanyahu aimed at limiting the diplomatic damage to both countries by Israel’s attempt to assassinate Hamas leaders in Qatar, its continued demolition of Gaza, and the accelerated expansion of settlements in the occupied West Bank.\nThe Israeli prime minister took Rubio on a tour of the Western Wall, where both men placed written prayers between the stones, before taking his American visitor underground to view archeological excavations.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c2c598731d08b8a2c67883fcf9179abfff61f7e0",
      "title": "‘Selling coffee beans to Starbucks’ – how the AI boom could leave AI’s biggest companies behind",
      "url": "https://techcrunch.com/2025/09/14/selling-coffee-beans-to-starbucks-how-the-ai-boom-could-leave-ais-biggest-companies-behind/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-14T15:00:00.000Z",
      "summary_90w": "",
      "raw": "The competitive landscape of AI is changing in ways that undermine the advantages of the biggest AI labs.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cd69904455027885361320d10af3916bd5036f02",
      "title": "The Helldivers community is coping with a spotlight it doesn’t want",
      "url": "https://www.theverge.com/games/777738/helldivers-community-reddit-discord-charlie-kirk",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T15:00:00.000Z",
      "summary_90w": "",
      "raw": "\"Yesterday was an interesting day for the Helldivers community.\" That's the very obvious understatement that announced the reopening of the Helldivers gaming subreddit in the small hours of Saturday morning. On Friday it was discovered that Tyler Robinson, arrested for the alleged killing of Charlie Kirk, had inscribed messages on the casings of several bullets found at the crime scene. One of those read \"Hey fascist! Catch!\" accompanied by an up arrow symbol, a right arrow, and three down arrows, a reference to the code to call down the 500KG Bomb stratagem in the cooperative shooter Helldivers 2.\nUnsurprisingly, within minutes the officia …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b5de3fadc2b23d5ce9b5b5e5bc2e293889ab0e33",
      "title": "Scarlet turns Shakespeare into an animated fantasy epic",
      "url": "https://www.theverge.com/toronto-international-film-festival/777609/tiff-2025-reviews-scarlet-project-y-sentimental-value",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Scarlet.\t\n\nWell, I was wrong, and I did manage to make it to one last day at the Toronto International Film Festival. One of the movies I wanted to see the most this year was Scarlet, the latest from Mamoru Hosoda, whose most recent film was the metaverse fairy tale Belle. Whereas that film was a reimagining of Beauty and the Beast, Scarlet is a twist on Hamlet that's full of bold, creative ideas. I mostly enjoyed it, but unfortunately it's saddled with an ending that doesn't really fit.\nI also managed to squeeze in two other films: a Korean revenge / heist thriller, and a Norwegian film about connecting through art. You can read my thoughts on all th …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e9c42ec2b7533e4dc9e060e2bdf6b91f36c40f4d",
      "title": "Zulu king challenges professor to stick fight",
      "url": "https://www.bbc.com/news/articles/c99gpg3jk80o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T13:23:10.000Z",
      "summary_90w": "",
      "raw": "Prof Musa Xulu tells the BBC he has received threats from hired assassins and has complained to the police.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "30214e25375e51111e4787c783f5383580b3847d",
      "title": "In Silksong, spite is my motivation to keep playing",
      "url": "https://www.theverge.com/games/777653/silksong-impressions-team-cherry-metroidvania-sherma-is-cool",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T13:00:00.000Z",
      "summary_90w": "",
      "raw": "I would not call the time I'm having with Hollow Knight: Silksong \"fun,\" and yet I'm still playing.\nIn the depths of The Marrow, the second major area of Silksong, there's a particularly nasty midboss. I eventually beat him, but my reward wasn't a new ability, item, or a bench where I could rest and save my progress. All I got was pain, suffering, and death. In Silksong, the only way out is through, but the \"through\" is a tunnel lined with spikes that occasionally spew gouts of flame. \nI should have given up right then and there, but I have not abandoned Silksong the same way I do other unfun games. For the life of me, I couldn't figure ou …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b7c164c4b8785b976a68aecf85502cf20773c708",
      "title": "Hermeto Pascoal, 'the wizard' of Brazilian music, dies at 89",
      "url": "https://www.bbc.com/news/articles/c98dgd2n5y2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T12:30:19.000Z",
      "summary_90w": "",
      "raw": "Pascoal - famed for his blend of jazz and traditional music - wrote more than 2,000 instrumental pieces.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2379029fbc3d2f8878aef94d5d99ecf0bd28921",
      "title": "Phone batteries are getting more compact, but the US is missing out",
      "url": "https://www.theverge.com/the-stepback-newsletter/776517/silicon-carbon-batteries-phones",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T12:00:00.000Z",
      "summary_90w": "",
      "raw": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on phones and other tech outside the US, follow Dominic Preston. The Stepback arrives in our subscribers' inboxes at 8AM ET. Opt in for The Stepback here.\nHow it started\nSmartphone batteries are bigger than ever, while the phones themselves are shrinking. But whether you're seeing the benefit - thin phones with big batteries - depends on where you live.\nThe key is the introduction of silicon-carbon batteries, which make it possible to fit more battery capacity into the same size cell, as in phones like the Honor Power, whose 8,000mAh  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b2532362ca1de100d18550e029645de56a6db7c1",
      "title": "The iPhone to get this year",
      "url": "https://www.theverge.com/installer-newsletter/777346/best-iphone-17-airpods-jeopardy-installer",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-14T12:00:00.000Z",
      "summary_90w": "",
      "raw": "Hi, friends! Welcome to Installer No. 97, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, hope you're having a good iPhone / back to school / it's-finally-not-hot-anymore week, and also you can read all the old editions at the Installer homepage.) \nIt's so good to be back! Huge, huge thanks to Jay Peters for doing such a fabulous job here over the last couple of months, and huge thanks to all of you as always for having such good contributions and ideas. Jay will still be around these parts from time to time, too, so don't worry, your esoteric gaming recommendations aren't going anywhere.\nI was going …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7261f147f8155fbd6705a2f449556f093a156cc7",
      "title": "Medics in southern Gaza sound alarm over wave of newly displaced Palestinians",
      "url": "https://www.theguardian.com/world/2025/sep/14/southern-gaza-nasser-medics-displaced-palestinians-fleeing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T11:59:44.000Z",
      "summary_90w": "",
      "raw": "Doctors at Nasser medical complex say it will not be able to cope with large numbers of people fleeing Gaza City\nDoctors and medical staff at the largest hospital still functioning in Gaza say they will be overwhelmed by a wave of new wounded and sick patients if hundreds of thousands of Palestinians flee the north of the devastated territory in the face of an intensifying Israeli offensive.\nDr Mohammed Saqr, the director of nursing at the Nasser medical complex near Khan Younis, in the south of Gaza, said there were not enough staff to cope with even existing demand and that supplies of medicine and fuel were running low.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be9aefab72e75683f6c61604c48f2321c8bc27ff",
      "title": "Epstein Victim's Family Speaks Out Over Mandelson",
      "url": "https://www.bbc.co.uk/sounds/play/p0m2sd9g?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-14T11:59:00.000Z",
      "summary_90w": "",
      "raw": "Virginia Giuffre's family says Mandelson should never have been appointed US ambassador.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "499677522d068ec7dc5507989b39afd8fe89ac28",
      "title": "Pot breaks as Nigerian chef attempts to cook largest jollof rice dish",
      "url": "https://www.bbc.com/news/articles/c306m1j542po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T11:17:32.000Z",
      "summary_90w": "",
      "raw": "Hilda Baci and a team of assistants took nine hours to complete the popular West African dish.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c32da42e9fdeae0a4b31d8d24406bc6fadbbb59",
      "title": "Brazilian musician identified as victim of 1976 killing by Argentina military",
      "url": "https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T09:00:29.000Z",
      "summary_90w": "",
      "raw": "The bossa nova pianist Francisco Tenório Cerqueira Júnior went out for cigarettes after a concert in Buenos Aires – a forensic team has finally revealed his fate\nEarly on 18 March 1976, Francisco Tenório Cerqueira Júnior, a Brazilian pianist who had played alongside some of Latin America’s greatest musicians, disappeared from the streets of Buenos Aires.\nFor nearly 50 years, his fate has remained a mystery, sparking desperate searches, raising suspicions of government complicity, and inspiring international documentaries. Now the mystery has been solved, with forensic scientists formally identifying Tenório Júnior’s body – and confirming he was a victim of Argentina’s bloody dictatorship.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b29c76de62f0c102c9d13a35815ef97261ffeb4d",
      "title": "Nepal's interim PM to hand over power within six months",
      "url": "https://www.bbc.com/news/articles/cp8wjz90z4no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T08:48:42.000Z",
      "summary_90w": "",
      "raw": "Sushila Karki said the government must heed protesters' demands for \"an end to corruption, good governance and economic equality\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6c1f97911443d84721b26e55c9c27fa85500af2b",
      "title": "Chinese carmakers told to improve locking devices for UK market",
      "url": "https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-14T06:00:26.000Z",
      "summary_90w": "",
      "raw": "UK insurers require critical modifications for sale in country with higher levels of car theft than China\nBritish authorities may have certain concerns about the cyber-spying threat from vehicles made in China, but it turns out the country’s manufacturers have security worries of their own.\nInsurers have told Chinese carmakers they need critical modifications for vehicles on British streets: namely, tougher locking devices to make them harder to steal.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac10d8c60c6fe1cc45f216508f7e0fc8a7c61df6",
      "title": "Malawi - where the petrol queue might overshadow the queue to vote",
      "url": "https://www.bbc.com/news/articles/cvgve3xnj02o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-14T00:05:43.000Z",
      "summary_90w": "",
      "raw": "With long petrol queues on city roads, everyday issues dominate in the run-up to Tuesday's vote.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "73259b095d6d5210f90fba0eac436963f2ba28ac",
      "title": "'We knew the family': Utah town in disbelief after local resident accused of killing Charlie Kirk",
      "url": "https://www.bbc.com/news/articles/czew1nz17rro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:39:57.000Z",
      "summary_90w": "",
      "raw": "Tyler Robinson is accused of killing Charlie Kirk during an open-air speaking event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf87dacabbd7c88b7a4526ff5ddb23e836521f3c",
      "title": "Trump administration launches trial program to fast-track electric air taxis",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540722/faa-air-taxi-pilot-program",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T23:38:26.000Z",
      "summary_90w": "",
      "raw": "The FAA is seeking proposals for projects that will include piloted and unmanned operations with a focus on electric air taxis, also called an electric vertical takeoff and landing aircraft.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "47b3364a153c9626294b9d18d302d4ffead0140d",
      "title": "What to expect from the Emmys and how to watch the ceremony",
      "url": "https://www.bbc.com/news/articles/c1mxlm42l9vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:14:25.000Z",
      "summary_90w": "",
      "raw": "Owen Cooper and Stephen Graham from Netflix's Adolescence are among the nominees at this year's event.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "927be21593572d03fe622495e4e91aafabd76d29",
      "title": "After fatal crash, Sikh truck drivers in the US fear backlash",
      "url": "https://www.bbc.com/news/articles/cy4rmymrl2ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T23:06:47.000Z",
      "summary_90w": "",
      "raw": "Sikh truck drivers say they've experienced an uptick in harassment after a fatal crash thrust them into the national spotlight.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dd6ceb3988caed3aec42c88cbb7419d2377cf3aa",
      "title": "UN condemns reported Haitian village massacre by armed gangs",
      "url": "https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T22:26:51.000Z",
      "summary_90w": "",
      "raw": "Fishing village of Labodrie reportedly set on fire after killing of a gang leader in sign of rising violence outside capital\nThe UN secretary-general has condemned the reported killing of at least 40 people during an attack by armed gangs in a fishing village north of Haiti’s capital.\nMedia in Haiti widely reported that the attack took place on Thursday night in Labodrie. It is another sign of escalating gang violence that has spread outside the capital.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "18893dcff66a1b089a75af6cffafc52b1e89584a",
      "title": "The Indian city that sparkles like Paris at night",
      "url": "https://www.bbc.com/news/articles/c14704vj4r2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T22:11:22.000Z",
      "summary_90w": "",
      "raw": "In 21 months, citizens have lit up 92 Kolkata landmarks with a simple model: your property, their lights.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "cc55c8fb5db1f0f461db1f2d570226dd6fc4e13a",
      "title": "Tesla board chair calls debate over Elon Musk’s $1T pay package ‘a little bit weird’",
      "url": "https://techcrunch.com/2025/09/13/tesla-board-chair-calls-debate-over-elon-musks-1t-pay-package-a-little-bit-weird/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T21:33:34.000Z",
      "summary_90w": "",
      "raw": "Tesla's board chair is defending a proposed 10-year, $1 trillion compensation package for CEO Elon Musk.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "cf1875224740bc86f0fd3ee4e15b2da23e85d79d",
      "title": "Workers taken to hospital after FBI uses furnace to burn seized meth",
      "url": "https://www.bbc.com/news/articles/cly7wzp23lpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T20:22:03.000Z",
      "summary_90w": "",
      "raw": "Fourteen staff were hospitalised and 75 cats and dogs evacuated.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "63650b045121ce8371f56d2211f1f0da2dcd5d52",
      "title": "Billion-dollar coffins? New technology could make oceans transparent and Aukus submarines vulnerable",
      "url": "https://www.theguardian.com/australia-news/2025/sep/14/aukus-australian-submarines-vulnerable-new-technology",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T20:00:14.000Z",
      "summary_90w": "",
      "raw": "Quantum sensing, satellite tracking and AI are part of an accelerating arms race in detection that should prompt a re-evaluation of Australia’s defence strategy\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nMilitary history is littered with the corpses of apex predators.\nThe Gatling gun, the battleship, the tank. All once possessed unassailable power – then were undermined, in some cases wiped out, by the march of new technology.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db6fb4e100a8587a10354226fa8af622dde02f46",
      "title": "Mexican congressional staffer resigns after TV comments about Charlie Kirk",
      "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-13T19:59:09.000Z",
      "summary_90w": "",
      "raw": "News network Milenio releases public apology after US deputy secretary of state threatens to revoke Mexican visas\nA congressional staffer from Mexico’s ruling party has resigned after being called out online for comments he made on a major Mexican television news program about Turning Point USA executive director Charlie Kirk’s murder.\nThe news network, Milenio, also released a public apology after the United States’ deputy secretary of state – a former ambassador to Mexico – evidently threatened to have Donald Trump’s presidential administration revoke any US visas on which it may count.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "93da0a2483a6b1aedc43689592f33bc7d5e8b16f",
      "title": "Trump 'ready' to sanction Russia if Nato nations stop buying its oil",
      "url": "https://www.bbc.com/news/articles/c62zxp1y5lwo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T19:46:49.000Z",
      "summary_90w": "",
      "raw": "The US president has repeatedly threatened tougher measures against Moscow, but has so far failed to take action.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "71b6764f64f9c3c75e2d76b7b26a40717d0476be",
      "title": "Pilot union urges FAA to reject Rainmaker’s drone cloud-seeding plan",
      "url": "https://techcrunch.com/2025/09/13/pilot-union-urges-faa-to-reject-rainmakers-drone-cloud-seeding-plan/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T19:10:43.000Z",
      "summary_90w": "",
      "raw": "Rainmaker wants to use flares to seed clouds — the airline pilots' union says it won't be safe.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8921d87eb87f72a7e8a0ffdc872db9ed0934d73",
      "title": "California lawmakers pass AI safety bill SB 53 — but Newsom could still veto",
      "url": "https://techcrunch.com/2025/09/13/california-lawmakers-pass-ai-safety-bill-sb-53-but-newsom-could-still-veto/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T18:56:50.000Z",
      "summary_90w": "",
      "raw": "The state's landmark safety bill sets new transparency requirements for large AI companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6a87619aabc325ecc5b17cbadff1d38ab6cbc762",
      "title": "FAA seeks to fine Boeing $3.1 million for safety violations, door plug blowout",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540728/boeing-faa-safety-fines-door-plug-blowout",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T17:45:16.000Z",
      "summary_90w": "",
      "raw": "The FAA said it identified hundreds of quality system violations at Boeing's 737 factory in Renton, Wash., and Boeing subcontractor Spirit AeroSystems' 737 factory in Wichita, Kan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "f5177bfc966e602ff2b32da90b59e84f6061a400",
      "title": "xAI reportedly lays off 500 workers from data annotation team",
      "url": "https://techcrunch.com/2025/09/13/xai-reportedly-lays-off-500-workers-from-data-annotation-team/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T15:50:50.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's AI startup says it's shifting focus from generalist AI tutors to specialists.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a4976f072389d6e6b108dd1494ba10e71543b0f3",
      "title": "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5540691/fed-governor-lisa-cook-vacation-home",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-13T15:23:53.000Z",
      "summary_90w": "",
      "raw": "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d82d63a404acfec7b75d5a21bbdf5620e3991ed4",
      "title": "Here’s the tech powering ICE’s deportation crackdown ",
      "url": "https://techcrunch.com/2025/09/13/heres-the-tech-powering-ices-deportation-crackdown/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T15:00:00.000Z",
      "summary_90w": "",
      "raw": "From phone spyware and facial recognition to forensic phone hacking technology to databases and more, this tech powers Trump's deportation machine.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a5bcbd26d3563339deda7664541cf3d6c14d9bae",
      "title": "Hike, once a unicorn, shuts down as India cracks down on real-money gaming",
      "url": "https://techcrunch.com/2025/09/13/hike-once-a-unicorn-shuts-down-as-india-cracks-down-on-real-money-gaming/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-13T14:05:49.000Z",
      "summary_90w": "",
      "raw": "Hike, which started as a WhatsApp rival before pivoting to real-money gaming, is now sunsetting after India's sweeping ban.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1b43aaf67255fc1b1bcb96fdd3a99b1aa69ed84e",
      "title": "'We escaped certain death': Israel intensifies Gaza City bombardment, forcing families to flee",
      "url": "https://www.bbc.com/news/articles/c20v15j9l3wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T13:15:19.000Z",
      "summary_90w": "",
      "raw": "A wave of heavy aerial attacks in recent days have triggered a surge in civilian displacement.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c631afb463e1d01c63cd77855018ce6ea36883d0",
      "title": "Why parents need to talk to their teens about AI — and how to start the conversation",
      "url": "https://www.npr.org/2025/09/13/nx-s1-5506114/why-parents-need-talk-teens-ai-how-to-start-conversation",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-13T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Many teens are using artificial intelligence chatbots like ChatGPT for everything from homework to relationship advice. Experts say parents must lead the way in helping them understand the technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f85f0496c8d31e128ccd0fd31785fa23b9dfaf9e",
      "title": "Woman held by Taliban warns British couple 'dying' in prison",
      "url": "https://www.bbc.com/news/articles/cm28jd2enz5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-13T07:45:03.000Z",
      "summary_90w": "",
      "raw": "Faye Hall was arrested with Peter and Barbie Reynolds in February, and released after two months.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1a475abb3dc16ccdb5d98f98a66ee869d359880a",
      "title": "Tech Now",
      "url": "https://www.bbc.co.uk/iplayer/episode/m002jnl0?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-13T01:00:00.000Z",
      "summary_90w": "",
      "raw": "Lara Lewington explores the tech being trialled to find 'hidden' pancreatic cancer cases.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f271005f7d7cf9fd9ed25251132159288c267d72",
      "title": "Ram ends EV pickup truck plans",
      "url": "https://techcrunch.com/2025/09/12/ram-ends-ev-pickup-truck-plans/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T22:56:16.000Z",
      "summary_90w": "",
      "raw": "Stellantis, the parent company of Ram, said Friday that it will no longer develop a battery-electric full-size pickup. The company cited low demand for full-size battery-electric trucks as the primary reason.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4b56e156c650fb548ddba8c7fddab2551c1b24e8",
      "title": "What's costing you more lately, and how is it affecting you? NPR wants to hear",
      "url": "https://www.npr.org/2025/09/12/g-s1-88442/cost-of-living-prices",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T22:03:20.000Z",
      "summary_90w": "",
      "raw": "The NPR Network is working on a series about the rising cost of living. We want to hear from you: What costs are going up, and how are you coping? How is it changing the way you live?",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6f1f24253a55b329ead63c4d9f3eefab327a1a18",
      "title": "Via shrugs off tepid open to end first day of trading slightly above IPO price",
      "url": "https://techcrunch.com/2025/09/12/via-shrugs-off-tepid-open-to-end-first-day-of-trading-slightly-above-ipo-price/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T21:16:00.000Z",
      "summary_90w": "",
      "raw": "Transit tech software startup Via had its IPO debut on Friday, starting at below offering price before rising to close at nearly $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f051b79eb9840dec785f676cc021be7335ec8ae7",
      "title": "Why the Oracle-OpenAI deal caught Wall Street by surprise",
      "url": "https://techcrunch.com/2025/09/12/why-the-oracle-openai-deal-caught-wall-street-by-surprise/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T20:01:41.000Z",
      "summary_90w": "",
      "raw": "The $300B deal is a reminder that despite Oracle’s legacy status, it shouldn’t be overlooked when it comes to AI infrastructure. But key questions around power and how OpenAI will pay for this remain.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "331af7111bc61d667a2b14aad482f800f1e07e1f",
      "title": "Google is a ‘bad actor’ says People CEO, accusing the company of stealing content",
      "url": "https://techcrunch.com/2025/09/12/google-is-a-bad-actor-says-people-ceo-accusing-the-company-of-stealing-content/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T18:53:26.000Z",
      "summary_90w": "",
      "raw": "People CEO Neil Vogel says Google's AI crawler can't be blocked because it would block the web crawler too. This lets the search giant steal its content for AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a75a07ea2c6d5229c294f6d42fa7fb851495256c",
      "title": "All of the iPhone 17 models compared",
      "url": "https://techcrunch.com/2025/09/12/all-of-the-iphone-17-models-compared/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T18:46:51.000Z",
      "summary_90w": "",
      "raw": "All four of the devices will be available to preorder on Friday and will be available on September 19.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c62f31224017c8df6b4e1f818633947cd36e5ddf",
      "title": "Tipper Gore, Twisted Sister and the fight to put warning labels on music",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5460888/music-parental-advisory-sticker-tipper-gore",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T17:03:34.000Z",
      "summary_90w": "",
      "raw": "40 years ago, musicians faced off against a Washington committee over whether to warn parents about explicit lyrics.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "266dd9d483de1a1d02b0f4a53abb0f525d6f329e",
      "title": "Micro1, a competitor to Scale AI, raises funds at $500M valuation",
      "url": "https://techcrunch.com/2025/09/12/micro1-a-competitor-to-scale-ai-raises-funds-at-500m-valuation/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-12T17:00:00.000Z",
      "summary_90w": "",
      "raw": "A three-year-old startup providing data for AI labs is trying to fill the gap in the market left by Scale AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1ca38d2acdc84eff3f1b94733cc4a7018d68a94e",
      "title": "Brazilians take to the streets to celebrate Bolsonaro conviction",
      "url": "https://www.theguardian.com/world/2025/sep/12/brazilians-take-to-the-streets-to-celebrate-bolsonaro-conviction",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T14:54:33.000Z",
      "summary_90w": "",
      "raw": "Indigenous groups and other minorities praise verdict while US officials issue warnings of possible sanctions\n• Operation World Cup: the murder plot at the heart of Brazil’s trial of the century\n• Bolsonaro sentenced to 27 years for plotting military coup in Brazil\nThousands of Brazilians have taken to the streets to rejoice at Jair Bolsonaro’s conviction for plotting a coup, as progressive politicians celebrated the historic move and rightwing figures linked to Donald Trump responded with anger and threats.\nChile’s leftwing president, Gabriel Boric, led regional congratulations of the decision to jail Bolsonaro for 27 years for leading a criminal organisation that sought to seize power after the far-right populist lost the 2022 election.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "72a8355947940444b1920079eb33fd8f7f3b024c",
      "title": "Operation World Cup: the murder plot at the heart of Brazil’s trial of the century",
      "url": "https://www.theguardian.com/world/2025/sep/12/operation-world-cup-the-plot-at-the-heart-of-brazils-jair-bolsonaro-trial-of-the-century",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-12T12:32:28.000Z",
      "summary_90w": "",
      "raw": "Intricate plan to murder top judge, president- and vice-president elect was central to Jair Bolsonaro coup hopes\nThe conspirators used codenames to conceal their identities as they prepared for their mission: to plunge Brazil into chaos by assassinating a celebrity supreme court judge called Alexandre de Moraes.\nOn an encrypted messaging group, one plotter used the alias Brazil, another Japan and a third Austria.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a1b5947a5d01004603858eddac2afbceee54a6fa",
      "title": "AI 'friend' chatbots probed over child protection",
      "url": "https://www.bbc.com/news/articles/c74933vzx2yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T10:36:53.000Z",
      "summary_90w": "",
      "raw": "The Federal Trade Commission is inquiring into seven tech companies including Snap, Meta, OpenAI and XAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c138099a2a36320e916a93ada7834aa80418ab5",
      "title": "Why mothers in the U.S. are scaling back on their work lives",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5537129/why-mothers-in-the-u-s-are-scaling-back-on-their-work-lives",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:02:37.000Z",
      "summary_90w": "",
      "raw": "Workforce participation for moms in the U.S. has been dropping for most of this year, and the reasons are more complicated than return-to-office mandates. The team from \"The Indicator\" explains why.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b62dd234321e169fd665051a6b4b490c2a5520d8",
      "title": "CBS shifts to appease the right under new owner",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5537152/cbs-news-ellison-steps-appease-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "CBS' new owner, David Ellison, has taken concrete steps to address the concerns of the news division's sharpest critics — particularly President Trump and his allies.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "854280c8db3007021237029f2f114f05856ba3e2",
      "title": "Health care costs are soaring. Blame insurers, drug companies — and your employer",
      "url": "https://www.npr.org/2025/09/12/nx-s1-5534416/health-care-costs-soaring-blame-your-employer",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-12T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Some 154 million people in the United States get health care through their employer — and for many, their costs are about to go way up.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8e7128f08ecbfe36b2de3ac3fb4ae63212d5c88c",
      "title": "Will the latest iPhone kill off the Sim card?",
      "url": "https://www.bbc.com/news/articles/c4gz30grggqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-12T04:27:58.000Z",
      "summary_90w": "",
      "raw": "The iPhone Air will only have an eSim - will other phone makers also shift away from the familiar - but fiddly - plastic cards?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8ea7dda534bb5115f3047b7400a68891762f6cfd",
      "title": "A play about the revolt of human workers — not machines — gave us the word 'robot'",
      "url": "https://www.npr.org/2025/09/11/nx-s1-5532095/where-word-robot-came-from-rur",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T21:03:34.000Z",
      "summary_90w": "",
      "raw": "A Czech playwright introduced the word to English in the 1920s. But back then, it wasn't analogous to machinery. New interpretations of the robot reflect a modernity once skewered by the writer.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "aba2904f68b489475d414ac12b9a2f097681ac29",
      "title": "Ban social media for under-15s, says French report warning of TikTok risks",
      "url": "https://www.bbc.com/news/articles/crkjep23403o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T15:38:43.000Z",
      "summary_90w": "",
      "raw": "The six-month inquiry also proposes an overnight \"digital curfew\" for 15-18 year olds from 22:00 to 08:00.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1603f64c3b2545445a91f6160abb259e27b91089",
      "title": "Children hacking their own schools for 'fun', watchdog warns",
      "url": "https://www.bbc.com/news/articles/c203pedz58go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-11T10:59:34.000Z",
      "summary_90w": "",
      "raw": "The Information Commissioner's Office says schools face an \"insider threat\" from children as young as seven.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9c68eb1350902ebc1e4088a4edb38f18063fdfa0",
      "title": "Running your lab results by ChatGPT? Here's what to keep in mind",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/11/nx-s1-5537067/ai-medicine-privacy-test-results",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-11T10:00:00.000Z",
      "summary_90w": "",
      "raw": "While patients wait to hear back from their doctors about test results, many turn to AI assistants for answers. There are issues with privacy and accuracy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fdb8c624b1617d6b2d595accaf352f47cc86c913",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-11T04:01:22.000Z",
      "summary_90w": "",
      "raw": "Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries\nPoliticians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.\nHowever, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "565188f48472d277c2063e39d09f397260f5b473",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T23:01:16.000Z",
      "summary_90w": "",
      "raw": "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders\nPress freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.\nAccording to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA), democracy has declined in 94 countries over the last five years and only a third have made progress.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4203f91d58b7d568f61dda0f1ad350dfa8872375",
      "title": "Larry Ellison briefly becomes world's richest person",
      "url": "https://www.bbc.com/news/articles/cx2rp992y88o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T20:55:26.000Z",
      "summary_90w": "",
      "raw": "The Oracle cofounder's wealth temporarily overtook Musk's fortune, propelled by an AI boom.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "68521725bce4a61019650cf8d886dcb058167bd2",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "url": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T19:09:35.000Z",
      "summary_90w": "",
      "raw": "Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world\nSouth African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist Steve Biko, nearly 50 years after he died in police custody.\nBiko, the founder of South Africa’s Black Consciousness Movement, died in a prison cell in 1977 aged just 30, after being beaten into a coma by police who had arrested him nearly a month earlier.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb3f2cace26d0fec51115a030986ebc79cd15080",
      "title": "Jaguar Land Rover admits hackers may have taken data",
      "url": "https://www.bbc.com/news/articles/cp8wk7rdz8yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T13:43:57.000Z",
      "summary_90w": "",
      "raw": "The car-maker previously said there was no evidence that customers information had been taken.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd91aa13e318357d61b6ece0bb4c1794d695834a",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "url": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-10T10:07:25.000Z",
      "summary_90w": "",
      "raw": "Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  \nSix people have been shot dead in two days in a crime-plagued area of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.\nAt 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, South African police said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f3d11c46995f0a754795bd6fc17cb51278da63cd",
      "title": "Meta covered up potential child harms, whistleblowers claim ",
      "url": "https://www.bbc.com/news/articles/c5y8x3md05no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-10T02:05:05.000Z",
      "summary_90w": "",
      "raw": "Meta denies the allegations and described the \"claims at the heart\" of the Senate hearing as \"nonsense\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c92c63d48a18fdb319860ef4227b15a3b437f5f4",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "url": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-09T23:01:54.000Z",
      "summary_90w": "",
      "raw": "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef\nMore children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.\nThere are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6b3a878af0d65401d30b2b22e759db794e484cb6",
      "title": "Tech Life",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6zp7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T19:30:00.000Z",
      "summary_90w": "",
      "raw": "Robot sailboats are helping forecasters predict where hurricanes will hit land.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "eb434b6040dc3a728f1bf892db9aff0fe30d9d63",
      "title": "Trump wants to win AI race, but his immigration policies could get in the way",
      "url": "https://www.npr.org/2025/09/09/nx-s1-5479090/trump-wants-to-win-ai-race-but-his-immigration-policies-could-get-in-the-way",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-09T09:03:36.000Z",
      "summary_90w": "",
      "raw": "President Trump says he wants the U.S. to be a world leader on AI development, but his administration's immigration policies could interfere with that goal.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db9d221393647f1d00cfd89ae79ff1d6963d329a",
      "title": "Nepal lifts social media ban after 19 killed in protests",
      "url": "https://www.bbc.com/news/articles/cp98n1eg443o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-09T05:21:20.000Z",
      "summary_90w": "",
      "raw": "Thousands had taken to the streets demanding that the government lift the ban and tackle corruption.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "650cdff15223761bb9f2b9c5da0e0a913ec8e09c",
      "title": "It's taken three years to recover from China hack, election watchdog says",
      "url": "https://www.bbc.com/news/articles/c80gl8yvj9go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-08T23:11:46.000Z",
      "summary_90w": "",
      "raw": "In the first interview about the hack, the commission's new boss admits that huge mistakes were made, but says the organisation is now secure.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca4cf3adce10083b9f81a5f9e14d562923c6b037",
      "title": "After 6 years, Hollow Knight Silksong is here at last — and it was worth the wait",
      "url": "https://www.npr.org/2025/09/08/nx-s1-5533199/hollow-knight-silksong",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-08T14:32:05.000Z",
      "summary_90w": "",
      "raw": "Hollow Knight was a Kickstarter-backed project that obliterated expectations. Now, after years of rumors, memes and anticipation, the three-person indie developer Team Cherry has delivered the sequel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b9c66271d4391435db8cdbfd48ea2e9ca0c2d68f",
      "title": "Microsoft cloud services disrupted by Red Sea cable cuts ",
      "url": "https://www.bbc.com/news/articles/c3rvx470yg8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-07T15:20:43.000Z",
      "summary_90w": "",
      "raw": "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c60951788cba238ae8e80d3ccefdef248c2a3b23",
      "title": "Fantasy or faith? One company's AI-generated Bible content stirs controversy",
      "url": "https://www.npr.org/2025/09/07/nx-s1-5518263/ai-bible-christianity-content",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-07T09:00:00.000Z",
      "summary_90w": "",
      "raw": "\"The AI Bible is a way to really bring these stories to life in a way that people have never seen before. Think of if we were like, the Marvel Universe of faith,\" said one of the site's creators.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5e3e7d837141c7147db44ab24d24331323eed6d1",
      "title": "The Aristocrat, the Convict and the Missing Baby",
      "url": "https://www.bbc.co.uk/iplayer/episode/m001z954?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-07-14T14:30:00.000Z",
      "summary_90w": "",
      "raw": "An aristocrat and her convict partner go on the run with their newborn, ending in tragedy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}