{
  "version": "1757184746400",
  "generatedAt": "2025-09-06T18:52:26.400Z",
  "items": [
    {
      "id": "556756db9f728bc1909ca76431725bf6084277db",
      "title": "England to face Scotland in quarter-finals after thrashing Australia",
      "url": "https://www.bbc.com/sport/rugby-union/videos/c0r08dqzrpdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T18:46:20.000Z",
      "summary_90w": "",
      "raw": "England recover from a shaky first-half showing to comprehensively beat Australia 47-7 to set up a Women's Rugby World Cup quarter-final against Scotland.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4bc4762eb9daf3a3c42ef73ac335b1671a751db0",
      "title": "Israel destroys second high-rise as assault on Gaza City intensifies ",
      "url": "https://www.bbc.com/news/articles/cz9jpzql958o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T18:44:36.000Z",
      "summary_90w": "",
      "raw": "Israel continues to expand its military operation in Gaza, urging Palestinians to leave Gaza City and move south.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "db2bc0034514a103ef59caeb2b1880c4a461120f",
      "title": "Patchy England beat Australia to set up Scotland quarter-final",
      "url": "https://www.bbc.com/sport/rugby-union/articles/c80gr4pd45jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T18:08:21.000Z",
      "summary_90w": "",
      "raw": "England recovered from a glitchy first-half showing to beat Australia and set up a Women's Rugby World Cup quarter-final against Scotland,",
      "topics": [
        "World"
      ]
    },
    {
      "id": "250eb28d8d0dcf888c17b318be47751e201f5b68",
      "title": "Reform conference shows party's growing ambition like never before",
      "url": "https://www.bbc.com/news/articles/c62zdpke8kko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T17:59:05.000Z",
      "summary_90w": "",
      "raw": "The conference feels like that of a big party - but retains the insurgency vibe that the party is seeking to channel.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd839d4165acca927488f6bf22dcb78d98310891",
      "title": "Mourners pay tribute at public viewing of Giorgio Armani's coffin",
      "url": "https://www.bbc.com/news/videos/cnvrd46e4q1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T17:24:45.000Z",
      "summary_90w": "",
      "raw": "Mourners queue in Milan to say goodbye to the Italian designer who died on Thursday, aged 91.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126cb85fc3f66a189bc693da8a17c18c1b6fcafa",
      "title": "EU fines Google $3.5B over adtech ‘abuse’",
      "url": "https://techcrunch.com/2025/09/06/eu-fines-google-3-5b-over-adtech-abuse/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T17:06:03.000Z",
      "summary_90w": "",
      "raw": "This is the EU's largest antitrust penalty ever — and Trump has already threatened to \"nullify\" it.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b451477741d6e294249b94e2ef352ae7f1a0efdf",
      "title": "Home Office clearout as Starmer reshuffles top team",
      "url": "https://www.bbc.com/news/articles/cj4ydgr0nwpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T16:59:16.000Z",
      "summary_90w": "",
      "raw": "Keir Starmer is working his way through the ministerial ranks as he puts the finishing touches to a major shake-up.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c7c929e1d28cbbce6e0cc4ad2293543c251d51b4",
      "title": "Seoul holds emergency meeting after citizens detained in US Hyundai raid",
      "url": "https://www.bbc.com/news/articles/c5yvjnp295xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T16:57:21.000Z",
      "summary_90w": "",
      "raw": "US immigration officials detained 475 workers on Thursday - most of them South Korean nationals - saying they were working illegally.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "464fa318d5a3cc4d8e59084e62d3510cef673c76",
      "title": "Arrests made at rally against Palestine Action ban in London",
      "url": "https://www.bbc.com/news/articles/c62qrmpd7l5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T16:27:50.000Z",
      "summary_90w": "",
      "raw": "At least 150 people have been arrested at the protest opposing the group's ban under anti-terrorism legislation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dc346fc5a83ca32668fb9dc044c9b6bdee6e10ed",
      "title": "Davey Johnson, who won 2 World Series with Orioles, managed Mets to title, dies at 82",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532607/davey-johnson-baseball-orioles-mets-mlb-obit",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T16:00:32.000Z",
      "summary_90w": "",
      "raw": "Davey Johnson, an All-Star second baseman who won the World Series twice with the Baltimore Orioles as a player and managed the New York Mets to the title in 1986, died Friday.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f91331ab9ced0122cb114baaed64ae8c1db40d1a",
      "title": "Pocket Scion is a synth you play with plants",
      "url": "https://www.theverge.com/news/773352/pocket-scion-synth-mushroom-music",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T16:00:00.000Z",
      "summary_90w": "",
      "raw": "A few years ago, artist Modern Biology became a viral sensation when he posted videos of himself controlling a modular synth with mushrooms on TikTok. Pocket Scion gives anyone similar capabilities, but without having to spend thousands of dollars on a Eurorack rig – and in a much more portable package. \nA core part of Modern Biology’s setup is a module called Scion from Glasgow-based Instruo. Scion turns biofeedback, whether that’s from houseplants or your own skin, into CV (control voltage) for controlling other synth modules in a larger setup. Touching two sensors to your hand or a mushroom completes a circuit, and then electrical fluctuations in that circuit can be used to trigger different notes, or change the cutoff on a filter, for instance.\nA little over a year ago, he approached Instruo about building something new. The fruit of that collaboration is the Pocket Scion, an affordable self-contained instrument that can turn small electrical changes from living organisms into MIDI data and create soundscapes using one of the four built-in sound engines. \nThe Pocket Scion has a number of advanced capabilities too, including MIDI out for controlling external instruments. There’s also a companion app for Windows, macOS, and Linux that exposes sound design tools for creating your own synth patches, and can send data over Open Sound Control (OSC), which gives it control over a ton of audio and video programs like Max/MSP, Pure Data, and Unreal Engine for creating visualization or complex reactive art installations. It’s more powerful than you’d expect given its $149 price.\nThe initial run of Pocket Scions sold out almost immediately. But you can place a preorder for when the next batch ships “early next week,” according to retailer Control Voltage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fc5cf139d1885e2cce343c8250c6d234105df878",
      "title": "The growing debate over expanding age verification laws",
      "url": "https://techcrunch.com/2025/09/06/wtf-is-going-on-with-age-verification-laws/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T16:00:00.000Z",
      "summary_90w": "",
      "raw": "As age and identity verification laws become more mainstream, this legislation could have a dire impact on privacy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "64c9d34f2608e4c0532d8cf7e9afa87cfb21e479",
      "title": "Families pay tribute to British couple killed in Lisbon funicular crash",
      "url": "https://www.bbc.com/news/articles/c62lmed42p1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T15:55:18.000Z",
      "summary_90w": "",
      "raw": "Kayleigh Smith and partner Will Nelson described as \"selfless\" and \"caring\" .",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ae13987155eb53f7e1873a94cedac0e68c0e638f",
      "title": "Families of British couple killed in Lisbon funicular crash ‘heartbroken’",
      "url": "https://www.theguardian.com/world/2025/sep/06/british-couple-killed-in-lisbon-funicular-crash-named",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T15:46:09.000Z",
      "summary_90w": "",
      "raw": "Relatives pay tribute to Kayleigh Smith, 36, and William Nelson, 44, who died when the Elevador da Glória derailed\nThe families of a British couple killed in Lisbon after a funicular streetcar derailed have paid tribute to them and have said they are “heartbroken”.\nKayleigh Smith, 36, and William Nelson, 44, died alongside 14 other people after the Elevador da Glória hurtled down a hill and careered into a building on Wednesday night.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f4eec54d7f6938052626e78f6db65ba41581b9e1",
      "title": "Verstappen grabs Monza pole with fastest F1 lap",
      "url": "https://www.bbc.com/sport/formula1/articles/c39rl80jgwyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T15:37:29.000Z",
      "summary_90w": "",
      "raw": "Red Bull's Max Verstappen takes pole position for the Italian Grand Prix from McLaren's Lando Norris.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "932f055085e85a89d9fbb3d3d5adf7b28de5d47e",
      "title": "Fire breaks out at BBC's former HQ Television Centre",
      "url": "https://www.bbc.com/news/articles/c62qr5ldppqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T15:11:48.000Z",
      "summary_90w": "",
      "raw": "Firefighters have been tackling the blaze for 12 hours, the London Fire Brigade says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dfcb4330b4745abcca9cf2647266451d1ad91978",
      "title": "Park Chan-wook&#8217;s No Other Choice is as bleak as it is hilarious",
      "url": "https://www.theverge.com/movie-reviews/773376/tiff-2025-no-other-choice-man-in-my-basement-reviews",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T15:00:00.000Z",
      "summary_90w": "",
      "raw": "No Other Choice.\t\n\nAt my second day at TIFF 2025, the longest line I saw wasn't for a movie: it was for the Criterion Closet. The space is housed in a van so that it could make it up to Toronto, and honestly, it felt a little wrong to see the outside of it after watching everyone from Michael Cera to Hideo Kojima spend time in its cramped interior digging through Blu-Rays.\nThe line was long enough that I didn't even bother trying to get inside, which is probably a good thing since I'd just be overwhelmed anyways. Besides, standing in that line would cut into my movie time, which is already a precious resource given there are so many things to check out.\nIf t …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb246ba9b0dee17e5bf337c739d7afa85f99540b",
      "title": "Royal Catholic funeral announced for Duchess of Kent",
      "url": "https://www.bbc.com/news/articles/c1mx9vzmjy3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T14:19:21.000Z",
      "summary_90w": "",
      "raw": "The Duchess of Kent's funeral, attended by the King and Queen, will be at Westminster Cathedral on September 16.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a924b908341c1c86f307db4c6c9498dfecd63811",
      "title": "Musk’s $1T pay package is full of watered-down versions of his own broken promises",
      "url": "https://techcrunch.com/2025/09/06/musks-1t-pay-package-is-full-of-watered-down-versions-of-his-own-broken-promises/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-06T14:02:36.000Z",
      "summary_90w": "",
      "raw": "Musk used to say Tesla would make 20 million cars and one million humanoid robots per year. The company's board wants far less than that in exchange for $1 trillion.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2c52936332fe58f8ab1d2f87fe5462a66eaa0889",
      "title": "More than 7,000 under-fives in Gaza put in malnutrition recovery in two-week period",
      "url": "https://www.theguardian.com/world/2025/sep/06/unicef-under-5s-recovery-programmes-acute-malnutrition-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T14:00:53.000Z",
      "summary_90w": "",
      "raw": "Unicef expects August malnutrition cases to top 15,000, as famine declared in Gaza City spreads south\nMore than 7,000 children under the age of five were put on recovery programmes for acute malnutrition at clinics run by Unicef in Gaza in just two weeks last month, figures reveal.\nThe overall total for August is being compiled by Unicef but is expected to exceed 15,000 new patients, more than seven times the total in February.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4dcc62e89993455bb84006b36921d413fa61a27d",
      "title": "Bluetti says it can reduce vanlife power installations to ‘30 minutes’",
      "url": "https://www.theverge.com/news/767283/all-in-one-vanlife-power-system-rvsolar-bluetti",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T14:00:00.000Z",
      "summary_90w": "",
      "raw": "The RVSolar System living its best vanlife. | Image: Bluetti\t\n\nIt only took three years, but Bluetti is following EcoFlow’s lead with a fully integrated power system of its own to make vanlifers, off-grid cabins, and boats energy independent. The RVSolar System’s main advantage over bespoke systems is a relatively quick and easy installation, requiring just “30 minutes,” according to Bluetti’s announcement at IFA 2025. \nWhile it’s undoubtedly faster than installing a fully bespoke solution from Victron Energy, for example, the last time I installed EcoFlow’s comparable system, it took closer to five hours — and that was after several hours of planning, measuring, and double-checking. Thirty minutes is just the time needed to screw everything together, so there’s still a hint of truth here.\nBluetti’s 48V RVSolar System is capable of 5,000W of max AC output or 1,360W DC. That’s plenty of power for everything from a roof-mounted air conditioner and induction cooktop to a 12V water pump and lighting system. It can be configured with a whopping 122kWh of Bluetti’s self-heated LFP batteries — enough for me to live and work off the grid for as long as 76 days, based upon the 1.6kWh average that I consume daily in my own van. As a bonus, Bluetti’s system also supports compatible third-party batteries, which is something EcoFlow can’t claim with its proprietary connectors.\nMaxing out a system with batteries will be overkill for most since these systems are designed to be easily rechargeable when out in the sticks. Batteries connected to the system can be recharged from a number of sources, including solar panels (up to 3600W), shore-power hookup (up to 5000W), a diesel generator (up to 5000W), and your vehicle’s own alternator (up to 1200W).\n\n\n\n\nThe system is built around an RV5 Power Hub unit that houses all the devices, which typically have to be wired together separately in a bespoke installation. These include the DC-to-AC inverter to convert DC energy to AC power for the microwave or coffee machine, an MPPT solar charger to regulate solar panel input, a DC-DC charger to top up the batteries when the vehicle’s motor is running, and a DC converter to step down the voltage for 12V / 24V devices like lights, USB sockets, pumps, and modern A/C units. \nThe kit also comes with a smart distribution panel for 8 AC and 20 DC circuits, with remote control over four of those AC circuits and six DC. You also get a wired 10.1-inch control screen that can be installed at a central location in the vehicle for remote monitoring and circuit-level control — functionality that’s replicated in the Bluetti app.\nThe RVSolar System will be available globally on September 30th. Pricing information wasn’t available at the time of publication, but I’d expect it to be on par with Victron components, especially if it’s using third-party batteries.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6314ee64a0542ed1054ece76a3133c1c5daca5f6",
      "title": "Super Robot Wars Y plays just like a kid’s giant robo fanfiction",
      "url": "https://www.theverge.com/games/773191/super-robot-wars-y-impressions-demo-nintendo-switch-2",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T14:00:00.000Z",
      "summary_90w": "",
      "raw": "When I was 16 years old, I wrote my first fanfiction. It was a crossover fic where the cast from Queer Eye for the Straight Guy gave the anime dog demon Inuyasha a makeover. It was stupid and poorly written, and yet, to this very day, I remember it fondly. This is exactly what it's like playing Super Robot Wars Y - an exceedingly silly, nonsensical plot featuring characters that have no business speaking to each other all, stitched together by tactical robot action. It rules.\nSuper Robot Wars Y was released on Nintendo Switch 2 and Steam on August 29th. For this blog, I played the demo that covers the game's first chapter with progress carr …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "25f1fa6160adb1b90112ccf2be1a394766edc159",
      "title": "Farage shifts on two-week small boats pledge",
      "url": "https://www.bbc.com/news/articles/c237k55y90ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T13:51:52.000Z",
      "summary_90w": "",
      "raw": "The Reform UK leader says he'd stop the boats within two weeks of passing laws, not immediately after winning power.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bb0e71b201bbd7002f2993f2bbb71e8d8c0309a5",
      "title": "When is the emergency alert test on mobile phones and can you opt out?",
      "url": "https://www.bbc.com/news/articles/c8e1n4d14kro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T13:36:30.000Z",
      "summary_90w": "",
      "raw": "The UK's emergency alert system will be tested for the second time on Sunday 7 September.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54253b5d158f615c3d943c7173f4638cddeca3bb",
      "title": "US tells Kilmar Ábrego García he faces deportation to Eswatini",
      "url": "https://www.bbc.com/news/articles/cn0r3nx4rd7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T13:22:47.000Z",
      "summary_90w": "",
      "raw": "The Salvadoran has been at the heart of an immigration row since he was mistakenly deported in March.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "54253b5d158f615c3d943c7173f4638cddeca3bb",
      "title": "US tells man in immigration row he faces deportation to Eswatini",
      "url": "https://www.bbc.com/news/articles/cn0r3nx4rd7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T13:22:47.000Z",
      "summary_90w": "",
      "raw": "The Salvadoran has been at the heart of an immigration row since he was mistakenly deported in March.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "dbe3fce1b8aace9ac4026fff3ce7f0979b42c134",
      "title": "Herdling is a serene and adorable way to unwind",
      "url": "https://www.theverge.com/games-review/764810/herdling-panic-review-pc-switch-playstation-xbox",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T13:00:00.000Z",
      "summary_90w": "",
      "raw": "A screenshot from Panic’s Herdling game. | Image: Panic / Okomotive\t\n\nHerdling is a slow game about herding fuzzy animals through a vibrant natural world. That may not sound particularly exciting, but I found it to be a perfect game to unwind with after a stressful day.\nIn Herdling, you play as a kid who makes friends with and shepherds large fluffy creatures called Calicorns, which kind of look like a mix of a sheep and a woolly mammoth. The Calicorns are adorable, with cute snorts and head shakes that make them feel like real animals. You'll even get opportunities to play fetch, and yes, you can pet the Calicorns. You can also name your furry friends, and the game even suggests ideas, which is why my flock  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2c73044f688ccc6c845d4455326443cd59b1ad4c",
      "title": "Ken Dryden, Hall of Fame goalie for the Montreal Canadiens, dies at age 78",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5532576/ken-dryden-hockey-nhl-montreal-canadiens-obituary",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T12:47:25.000Z",
      "summary_90w": "",
      "raw": "Dryden backstopped the NHL's most successful franchise to championships in six of his eight seasons in the league from 1970-71 to '78-79. He died after a fight with cancer.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f75709c4b531ec9faefbc25fb9d8263394b6cbe5",
      "title": "Google Pixel 10 review: perfectly fine",
      "url": "https://www.theverge.com/reviews/772813/google-pixel-10-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T12:30:00.000Z",
      "summary_90w": "",
      "raw": "Pencils down.\t\n\nAsking the Pixel 10 to be more than what it is feels greedy.\nGoogle's non-Pro Pixel is priced fairly at $799, which is significantly less than the $999 Pixel 10 Pro. It comes with some handy upgrades, like Qi2 charging with built-in magnets. Its AI features finally show promise. It includes a dedicated telephoto lens for the first time. It's a proper flagship and an all-around easygoing Android phone. But if I'm being greedy, then I do have one request: better cameras.\nThe rear cameras on the Pixel 10 are totally fine. For someone who's not picky about image quality, they'd be better than fine. And maybe I'd think they were fine, too, if I …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dc13f8d53fb6404e2beb3b56e54cbfe55fe5e149",
      "title": "MAGA populists call for holy war against Big Tech",
      "url": "https://www.theverge.com/politics/773154/maga-tech-right-ai-natcon",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T12:00:00.000Z",
      "summary_90w": "",
      "raw": "If you wanted a sense of the current relationship between the tech right and the populists, you had to be sitting in Breakout Room C on the first day of NatCon 5, the annual gathering of the MAGA right's powerhouses. At the end of the afternoon panel on the culture wars (\"The Need for Heroism\"), Geoffrey Miller was handed the mic and started berating one of the panelists: Shyam Sankar, the chief technology officer of Palantir, who is in charge of the company's AI efforts.\n\"I argue that the AI industry shares virtually no ideological overlap with national conservatism,\" Miller said, referring to the conference's core ideology. Hours ago, Mil …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ff5bffa30fc613afcdb7a34b907996e064561552",
      "title": "Opinion: Susan Stamberg, trailblazer and NPR Founding Mother, retires",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5522120/opinion-susan-stamberg-trailblazer-and-npr-founding-mother-retires",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T12:00:00.000Z",
      "summary_90w": "",
      "raw": "NPR Founding Mother Susan Stamberg is retiring. She became the first woman to anchor a nightly national news program in 1972, and helped loosen up the serious, stodgy sound of radio hosts.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f36f0e77506cb84d8c19cfdea4bf5f36a49bc129",
      "title": "Starmer resets after Rayner row, but Labour turmoil is a gift for Reform",
      "url": "https://www.bbc.com/news/articles/c39rk4jlpw7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T11:59:10.000Z",
      "summary_90w": "",
      "raw": "The start of this political season has been wild, writes Laura Kuenssberg, and Labour now has Reform UK breathing down its neck.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6080e3cece03e25b3f4aeae01770c493564b4f99",
      "title": "'Strange noises' heard before squatter found living in house with lights, TV and bed",
      "url": "https://www.bbc.com/news/articles/c059gqml15go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T11:52:58.000Z",
      "summary_90w": "",
      "raw": "Law enforcement arrested a man in the crawl space of an Oregon home after the owner said no one should be there.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e83b338a6e9c872ab268824a9e18b7fcee7e6d1",
      "title": "Why some longtime gerrymandering opponents are reconsidering their views",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5519312/why-some-longtime-gerrymandering-opponents-are-reconsidering-their-views",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T11:47:45.000Z",
      "summary_90w": "",
      "raw": "The congressional redistricting fights that President Trump has sparked in Texas, California and Missouri are leading some advocacy groups to reconsider their position on partisan gerrymandering.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76265f4643ce1873bf03f261dc6891b5657f0fd4",
      "title": "Matt Tebbutt to replace Gregg Wallace on MasterChef: The Professionals",
      "url": "https://www.bbc.com/news/articles/cn4wydg4212o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T11:06:47.000Z",
      "summary_90w": "",
      "raw": "The Saturday Kitchen host replaces Wallace, who was sacked after a report upheld complaints over his behaviour.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "81e9d8b5a183fbe93a64698bc5a6bbd98de23bc6",
      "title": "Sudanese villagers dig with hands to reach landslide victims, group says",
      "url": "https://www.bbc.com/news/articles/cn0xepvr0x4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T11:02:38.000Z",
      "summary_90w": "",
      "raw": "People have no access to tools or machinery to conduct their rescue efforts, Save the Children says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04f64312059b1aa29a182530f112c797830ea1b3",
      "title": "How an 18th-century portrait stolen by the Nazis was recovered 80 years later in Argentina",
      "url": "https://www.theguardian.com/world/2025/sep/06/18th-century-portrait-stolen-by-nazis-recovered-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T11:00:50.000Z",
      "summary_90w": "",
      "raw": "Painting was spotted online by Dutch journalists when the daughter of a former Nazi official put her house up for sale in Mar del Plata\nThere was nothing very remarkable about the middle-aged couple who lived in the low, stone-clad villa on calle Padre Cardiel, a quiet residential street in the leafy Parque Luro district of Argentina’s best-known seaside town, Mar del Plata.\nPatricia Kadgien, 59, was born in Buenos Aires, five hours to the north. Her social media described her as a yoga teacher and practitioner of biodecoding, an obscure alternative therapy that claims to cure illness by resolving past traumas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1aed5c177c456a04792b86faa644118707d33711",
      "title": "In April NPR profiled people who couldn't get their HIV drugs. How are they faring now?",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/09/06/g-s1-86617/hiv-positive-aids-zambia",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T10:51:26.000Z",
      "summary_90w": "",
      "raw": "In Zambia, we met people who are HIV positive, couldn't get drugs to suppress the virus after U.S. aid cuts and were seeing symptoms. We checked in on them — and the man who's been their champion.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a74e03ab665f6092bceaf5517642cac25606a143",
      "title": "Trump says Venezuelan jets will be shot down if they endanger US ships",
      "url": "https://www.bbc.com/news/articles/cr70511v774o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T10:12:33.000Z",
      "summary_90w": "",
      "raw": "Venezuelan President Nicolás Maduro says \"differences\" between the countries do not justify a \"military conflict\".",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f8ade96d0d2168f86f74dc47339295e8d8721b6b",
      "title": "Amid debate about U.S. history, Harlem Hellfighters receive Congressional Gold Medal",
      "url": "https://www.npr.org/2025/09/06/g-s1-87313/amid-debate-about-u-s-history-harlem-hellfighters-receive-congressional-gold-medal",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T10:01:00.000Z",
      "summary_90w": "",
      "raw": "The Harlem Hellfighters, who became legends for their service during World War I, were honored this week with a Congressional Gold Medal.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "eb7aca3d53def64e2f2d4ab60e3753ffb6ad5271",
      "title": "Concerned about federal vaccine policies, states are crafting their own",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/06/nx-s1-5532121/states-vaccine-guidance-washington-oregon-new-mexico",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T10:00:00.000Z",
      "summary_90w": "",
      "raw": "As federal health agencies change their approach to vaccine policy leaving access for COVID shots uncertain, some states are taking things into their own hands.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "037291a12d530d3922a13fdcac11e8627f14a465",
      "title": "HHS responds to report about autism and acetaminophen",
      "url": "https://www.npr.org/sections/shots-health-news/2025/09/06/nx-s1-5532143/hhs-responds-to-report-about-autism-and-acetaminophen",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T10:00:00.000Z",
      "summary_90w": "",
      "raw": "A report that health secretary Robert F. Kennedy, Jr. has promised will come out this  month will look at the causes of autism. Many worry it will have claims unsupported by science.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8bd09d2c17cbbbcb942ffdc5a49d110e8ea07740",
      "title": "Body found on Greek island identified as missing British tourist",
      "url": "https://www.theguardian.com/world/2025/sep/06/body-found-greek-island-identified-missing-british-tourist-michele-bourda",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T09:57:14.000Z",
      "summary_90w": "",
      "raw": "Michele Bourda’s husband says police and coastguard were ‘criminally slow’ in responding to her disappearance in August\nA body found on a barren Greek island has been identified as that of Michele Bourda, the British tourist who vanished from a beach more than a month ago.\nGreece’s coastguard confirmed that the body of the 59-year-old, whose disappearance sparked a big rescue operation, had been discovered by a passing yacht on the islet of Fidonisi.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e825cdf6a1dcf17d8595a94ad52cacfe679f51cc",
      "title": "'No doubt' Russia will cross Nato border if Ukraine falls, former US VP says",
      "url": "https://www.bbc.com/news/videos/cq65410424qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T09:46:41.000Z",
      "summary_90w": "",
      "raw": "Former US Vice-President Mike Pence calls for security guarantees in Ukraine to help deliver “just and lasting peace”.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3794f964587144234edc9f83aa82980e8068c58e",
      "title": "India's honk-happy drivers are switching to even louder horns",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5508242/india-traffic-noise-car-horns",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In India's bustling megacities, honking is a common form of communication among drivers. But in this case, one person's language is another person's noise pollution.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5a2426d62852fa5eaee22ef7b0516b98217eec02",
      "title": "The U.S. government is taking a stake in Intel. It's rare — and it has some risks",
      "url": "https://www.npr.org/2025/09/06/nx-s1-5530190/government-stake-intel-ai-competition-china",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-09-06T09:00:00.000Z",
      "summary_90w": "",
      "raw": "In the past, the federal government has taken stakes in American companies during wars or economic crises. But now the government's motivation has more to do with the race for AI chips and technology.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b470a237ca409bf5fcaa9504c826e08dbcc9cbc0",
      "title": "Lisbon funicular worker among those killed in crash",
      "url": "https://www.bbc.com/news/articles/cnvryg271ymo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T08:12:55.000Z",
      "summary_90w": "",
      "raw": "Four employees of a non-profit organisation and a transport worker are among those who died.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c5ded6d0502a324ec423c7f4c2e313406febd69a",
      "title": "‘A great tragedy’: man dies in shark attack near Dee Why on Sydney’s northern beaches",
      "url": "https://www.theguardian.com/australia-news/2025/sep/06/fatal-shark-attack-long-reef-beach-sydney-northern-beaches-nsw",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T07:41:12.000Z",
      "summary_90w": "",
      "raw": "Beaches from Manly to Narrabeen closed after death of 57-year-old who leaves behind wife and child\n\nGet our breaking news email, free app or daily news podcast\n\nA man has died near Dee Why on Sydney’s northern beaches after being bitten by what is believed to be a large shark, in what police have called “a great tragedy”.\nShortly after 10am on Saturday, New South Wales emergency services were called to Long Reef beach following reports a man had suffered critical injuries.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "31fee717ca9d1af4209b9cc7d308884287dbc09a",
      "title": "First look: Dyson’s Spot+Scrub Ai robot seeks out stains",
      "url": "https://www.theverge.com/ifa-berlin/772423/dyson-spot-scrub-ai-robot-vacuum-mop-multifunction-dock-first-look",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-06T07:00:00.000Z",
      "summary_90w": "",
      "raw": "The Dyson Spot+Scrub Ai is the first robot vacuum mop from the company and the first to use a multifunctional dock.\t\n\nThe Dyson Spot+Scrub Ai Robot is the company's first combination robot vacuum and mop. It debuted at Dyson's Berlin store during the IFA tech show this week and is a follow-up to the company's 360 VisNav robot vacuum, which launched in 2023. Featuring a new round design, a self-cleaning roller mop, lidar navigation, and Dyson's first multifunctional dock, the Spot+Scrub also comes with an \"AI\" moniker because it's 2025 and doesn't everything?\nI spent some hands-on time with Dyson's newest robot floor cleaner and came away underwhelmed. Dyson's traditional vacuums set high expectations, but its robot versions have yet to meet them. I didn't  …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "510f2a787927981d32e2fbefec765a14b5f18010",
      "title": "Humble & sweet, but a lion - the story of the first female £1m player",
      "url": "https://www.bbc.com/sport/football/articles/cn82lx29558o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T06:32:15.000Z",
      "summary_90w": "",
      "raw": "Meet the person behind women's football's first £1m player, Arsenal's new superstar forward Olivia Smith.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9c367f282609dd9dec304f8a246ea34c024171bf",
      "title": "‘It is a war of drones now’: the ever-evolving tech dominating the frontline in Ukraine",
      "url": "https://www.theguardian.com/world/2025/sep/06/drones-evolving-technology-at-ukraine-conflict-heart",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T06:00:46.000Z",
      "summary_90w": "",
      "raw": "Models for reconnaissance, rescue, interception and attack are changing the way both sides operate\n\n“It’s more exhausting,” says Afer, a deputy commander of the “Da Vinci Wolves”, describing how one of the best-known battalions in Ukraine has to defend against constant Russian attacks. Where once the invaders might have tried small group assaults with armoured vehicles, now the tactic is to try and sneak through on foot one by one, evading frontline Ukrainian drones, and find somewhere to hide.\nUnder what little cover remains, survivors then try to gather a group of 10 or so and attack Ukrainian positions. It is costly – “in the last 24 hours we killed 11,” Afer says – but the assaults that previously might have happened once or twice a day are now relentless. To the Da Vinci commander it seems that the Russians are terrified of their own officers, which is why they follow near suicidal orders.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "681c5df26744781b048a9e19a736ebc81637cec0",
      "title": "'We are the troops': Inside Chicago's split communities as Trump vows to deploy National Guard",
      "url": "https://www.bbc.com/news/articles/c4gj489q6e0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T05:56:59.000Z",
      "summary_90w": "",
      "raw": "Some locals are working to prevent youngsters from sliding into gangs, but others ask the troops to come sooner.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "49cc4ce104941f40ed2856a66043cb33877db648",
      "title": "He was a respected surgeon so I believed him, but he had a secret about his amputations",
      "url": "https://www.bbc.com/news/articles/cy0vr20gxvno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T05:55:31.000Z",
      "summary_90w": "",
      "raw": "Neil Hopper told me losing his legs had made him rethink his life - but all was not as it seemed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bf7a51b486a1e16f94a359b7c4616066a99e390f",
      "title": "Japan’s second in line to emperor’s throne comes of age amid succession debate",
      "url": "https://www.theguardian.com/world/2025/sep/06/japans-second-in-line-to-emperor-throne-comes-of-age-amid-succession-debate",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T05:54:58.000Z",
      "summary_90w": "",
      "raw": "Teenage Prince Hisahito’s elaborate ceremony overshadowed by questions over royal family’s male-only succession rules\nJapan has heralded the coming of age of Prince Hisahito with an elaborate ceremony at the Imperial Palace, where a succession crisis is brewing.\nThe nephew of Emperor Naruhito, Hisahito received a black silk and lacquer crown at Saturday’s ceremony in Tokyo, which marks the beginning of his royal adult life.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c46d49637a5337b41fa747390d93df195717d5eb",
      "title": "The sunscreen scandal shocking Australia - the world's skin cancer hotspot",
      "url": "https://www.bbc.com/news/articles/c4gzl41rpdqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T05:41:05.000Z",
      "summary_90w": "",
      "raw": "It has shaken consumer trust and raised questions about global sunscreen regulation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T05:15:57.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2d5dc6fea4b3c40f3d666b42fdfa131ee621b0fc",
      "title": "Man dies after suspected shark attack in Sydney",
      "url": "https://www.bbc.com/news/articles/cy8r9p28yp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T05:06:06.000Z",
      "summary_90w": "",
      "raw": "A morning surfer \"died at the scene\" after being pulled out of the water, Australian police say.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e85346933322712aa128c05c5f982e47323a2dd8",
      "title": "Xi, Putin, Kim and the optics of a new world order",
      "url": "https://www.theguardian.com/news/ng-interactive/2025/sep/06/xi-jinping-vladimir-putin-kim-jong-un-optics-new-world-order",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T05:00:44.000Z",
      "summary_90w": "",
      "raw": "Alliance of global autocrats has been accelerated by Donald Trump’s use of political and economic pressure against friends and foes alike\nWaving beatifically over the crowd of 50,000 spectators assembled in Beijing’s Tiananmen Square on Wednesday, Xi Jinping exuded an aura of confidence that many leaders in the west could only envy. To his left stood North Korea’s Kim Jong-un, the supreme leader of an increasingly strident hermit kingdom. To his right was the Russian president, Vladimir Putin, Xi’s “old friend” and China’s biggest ally in opposing the US-led world order. The last time that the leaders of these three countries were together in public was at the height of the cold war.\n“Humanity once again faces the choice between peace or war, dialogue or confrontation,” the Chinese president told the gathered crowds. His insistence that China would “adhere to the path of peaceful development” was punctured somewhat by the country’s biggest ever military parade that marched through the square beneath his rostrum atop the Gate of Heavenly Peace, the entrance to the Forbidden City that has – on and off – been the seat of Chinese power since the 15th century.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "15b12f9547b7294259fe546ceed5c913f443d8db",
      "title": "Pope prepares to canonise London-born teenager nicknamed ‘God’s influencer’",
      "url": "https://www.theguardian.com/world/2025/sep/06/pope-prepares-to-canonise-london-born-teenager-nicknamed-gods-influencer",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T04:00:41.000Z",
      "summary_90w": "",
      "raw": "Carlo Acutis, who died in 2006 and built websites to spread Catholic message, to become first millennial saint\nIn a see-through safe carved into a wall behind the altar of a chapel in northern Rome lies a collection of relics of Carlo Acutis. These include a splinter from his wooden bed, a fragment of a jumper and a piece of the sheet used to cover him after his death. Locks of his hair are on display in other churches in the Italian capital and beyond.\nAcutis, the London-born Italian who on Sunday will become the Catholic church’s first millennial saint, built websites to spread Catholic teaching, earning him the nickname “God’s Influencer” after his death, aged 15, from leukaemia.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ce40ab4be0d3bae2754191ca930559be17bb0d41",
      "title": "Samoa’s first female PM fails to win re-election after months of political infighting",
      "url": "https://www.theguardian.com/world/2025/sep/06/samoas-first-female-pm-fails-to-win-re-election-after-months-of-political-infighting",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T03:50:40.000Z",
      "summary_90w": "",
      "raw": "Fiame Naomi Mata’afa, known as the ‘Iron Lady of the Pacific’, likely to be replaced by leader of opposition Fast party\nSamoa’s first female leader, Fiame Naomi Mata’afa, has failed to win a majority in the Pacific nation’s elections this week, capping months of political infighting.\nOfficial results published by the electoral commission on Friday showed the opposition Fast party won 30 out of the 50 contested seats in parliament.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "675114ae57e11103dfc906f1e0d138e05659aa88",
      "title": "Police announce $1m reward for information on Dezi Freeman and warn public not to go looking for ‘high-risk’ Porepunkah fugitive",
      "url": "https://www.theguardian.com/australia-news/2025/sep/06/dezi-freeman-porepunkah-search-victoria-police-announce-reward-for-information-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T02:55:58.000Z",
      "summary_90w": "",
      "raw": "Victoria’s largest reward ever offered for arrest as alpine hunt for alleged killer of two police enters 12th day\n\nGet our breaking news email, free app or daily news podcast\n\nVictoria police have announced a million-dollar reward for information leading to the arrest of fugitive Dezi Freeman but given strict warnings to the public not to go searching, after the alleged murder of two police officers in Porepunkah last month.\nThe reward of “up to $1m” is the largest ever offered in Victoria for an arrest, said Det Insp Dean Thomas from the homicide squad. Thomas told media on Saturday morning that a number of “heavily armed” specialist police continued to search bushland in the Porepunkah area.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "023fbcd32cb461d9fda78296e89a663fa0bb5f12",
      "title": "Judge rules ending protections for Venezuelan and Haitian migrants is unlawful",
      "url": "https://www.bbc.com/news/articles/c3vzknpywp4o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T02:27:27.000Z",
      "summary_90w": "",
      "raw": "The decision is in response to the Trump administration's efforts to end temporary protected status (TPS).",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b499a2a965df15695e4f5cf07c0d19725d61a24f",
      "title": "I ordered drug-laced vapes on Snapchat. It was as easy as picking up pizza",
      "url": "https://www.bbc.com/news/articles/czerxjeny9zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-06T01:14:43.000Z",
      "summary_90w": "",
      "raw": "On a Warwickshire housing estate, a BBC journalist poses as a schoolgirl to meet the dealers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "37947137d683cb3f96ed50b0219340f8dbf557a4",
      "title": "New Bollywood romcom sparks debate over stereotyping south India",
      "url": "https://www.bbc.com/news/articles/c4gveer8wgro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T00:46:16.000Z",
      "summary_90w": "",
      "raw": "Param Sundari has reignited conversation on how India's most influential film industry represents non-Hindi speaking states.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8862e1f71f4ac521fc8da9d3072a40ee372795bc",
      "title": "Rosenberg: What's behind Putin's uncompromising stance on Ukraine?",
      "url": "https://www.bbc.com/news/articles/c0m40pv44kgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T00:42:54.000Z",
      "summary_90w": "",
      "raw": "Moscow's diplomatic success in China, and Trump's lack of action, have emboldened Putin, reports Steve Rosenberg.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ac6c240cc7301e15e50964e552d7a24af51494db",
      "title": "Why the world is watching RFK's fight with US health agency",
      "url": "https://www.bbc.com/news/articles/c62ngkpxk9lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-06T00:24:45.000Z",
      "summary_90w": "",
      "raw": "The US health secretary's plans could have a huge impact on health policy not just in the US, but across the globe.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7e26a9c85d6373ffb4bde0ef5a1bd60ad4fa9190",
      "title": "Anthropic settles with authors in first-of-its-kind AI copyright infringement lawsuit",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529404/anthropic-settlement-authors-copyright-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-06T00:19:33.000Z",
      "summary_90w": "",
      "raw": "A U.S. district court is scheduled to consider whether to approve the settlement next week, in a case that marked the first substantive decision on how fair use applies to generative AI systems.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8e981994fae87e6701052b3c42875995f801d9f6",
      "title": "Neo-Nazis have occupied the steps of Victoria’s parliament twice in two years. Are protest laws to blame?",
      "url": "https://www.theguardian.com/australia-news/2025/sep/06/neo-nazis-victoria-parliament-steps-protest-laws",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-06T00:00:37.000Z",
      "summary_90w": "",
      "raw": "Calls for tougher ‘move-on’ laws overlook the fact that police already have considerable powers in Victoria\n\nGet our breaking news email, free app or daily news podcast\n\nAs neo-Nazis occupied the steps of Victoria’s parliament for the second time in as many years, many are asking the question: how has this happened again – and what can be done to prevent it?\nOn Sunday, neo-Nazi Thomas Sewell, the leader of the National Socialist Network (NSN), mounted the steps of the building, stood behind a podium draped with an Australian flag and delivered what can only be described as the keynote speech at the city’s March for Australia rally. Neo-Nazis were also involved in rallies in other states, although statements on the March for Australia Facebook page distanced the events from white supremacists.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e2932708424e6e71c9f068ae2c254e9ac7eaea1b",
      "title": "The best robot vacuums we&#8217;ve tested for 2025",
      "url": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T23:38:27.000Z",
      "summary_90w": "",
      "raw": "Robot vacuums are impressive devices that will clean your floors well and — thanks to bigger batteries and better robot brains — rarely get tired of doing their job. Over the last few years, they have gone from being utilitarian devices that sweep your floor to full-fledged home robots that can vacuum and mop your home and then trundle off to clean themselves to be ready for the next run. \nI’ve been testing robot vacuums for seven years and have run over 70 robot vacuums all over my house. These are my top picks if you’re looking for the best: a robot vacuum that can do it all with limited intervention from you.\nAlong with my top picks, I have options to fit specific needs, such as mopping or besting pet hair. The good news is that there are a lot of great options. Whether you have a 3,000-square-foot home and three shaggy dogs or a small, stylish apartment you share with a goldfish, there’s a robot vacuum to suit your needs. \nFeatured in this article\nBest overall: Roborock S8 MaxV Ultra\nWith top-notch vacuuming performance, an easy-to-use app, and built-in voice control, the S8 MaxV Ultra is a superb vacuum and good mop.\n\nWhere to Buy:\n\n $1799.99 $999.99 at Amazon\n $1799.99 $999.99 at Best Buy\n $1799.99 $999.99 at Kohl’s\n\nBest budget option: Tapo RV30 Max Plus\nTap’s RV30 Max Plus is a robot vacuum / mop hybrid with room-specific cleaning, carpet boost, smart navigation, and an optional auto-empty dock.\n\nWhere to Buy:\n\n $329.99 $229.99 at TP-Link (with code 70RV30MAX)\n $329.99 $249.99 at Amazon\n\n\n\n\n\n\nBest robot vacuum\nBest budget robot vacuum\nBest mopping robot vacuum for hard floors\nBest robot vacuum / mop hybrid\nBest midrange robot vacuum / mop \nBest robot vacuum for pet hair\nOther robot vacuums to consider\nWhat I’m testing and what’s coming next\n\nBest robot vacuum\nRoborock S8 MaxV Ultra\n\n\nScore: 9\n\nProsCons\n\n\nExcellent vacuuming performance\nGood sonic mopping\nExtendable side brush gets into corners better\nVery good app\n\nDock is still quite ugly\nMopping tray is hard to clean\nExpensive\n\n\n\nWhere to Buy:\n\n $1799.99 $999.99 at Amazon \n $1799.99 $999.99 at Best Buy\n $1799.99 $999.99 at Kohl’s\n\nDustbin capacity: 270ml / Self-empty dock option: Yes / Auto-refill mop option: Yes / Mop lift: Yes, 20mm / Mop washing: Hot water and heated air drying / Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 10,000Pa / Remote check-in: Yes / Keep-out zones: Yes, virtual / Brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Apple Home via Matter\nRoborock’s S8 MaxV Ultra ($1,799.99) is an exceptional vacuum cleaner and a very good mop. Its dual rubber roller brushes and 10,000Pa suction make it great on carpets; its sonic mopping is very good on hard floors, and its improved AI-powered obstacle detection means it will most likely get the job done without getting trapped or derailed.\nThe S8 MaxV Ultra is the best in the category of “hands-free” robot vacs, bots that do virtually everything for you: empty their bins, refill their mop tanks, and clean and dry their mop pads. Roborock invented this category with the S7 MaxV Ultra and has been steadily improving it.\nThat’s the big selling point here; this bot is basically hands-free. Fill the S8 MaxV Ultra’s clean water tank and empty its dirty water once a week and change out the dust bag every couple of months. The robot will take care of the rest.\nFor $100 more, you can dispense with dealing with the water tanks entirely and buy the Refill & Drainage System model. This lets you plumb the charging base directly into your home’s water supply. I’ve not tested this on the Roborock, but my experience with the SwitchBot S10 with the same feature leads me to recommend this option if you can swing it.\nThe S8 MaxV Ultra comes with excellent AI-powered obstacle detection, bringing back the camera it last had on the S7 MaxV Ultra. It’s not quite as good as Roomba’s obstacle detection — it sometimes confused a pile of Cheerios for a charging cable and avoided them — but it’s much better than the Roborocks that rely on non-camera obstacle detection. It deftly navigates around most household clutter, allowing you to get the job done without having to tidy up.\nRoborock has caught up to Roomba on cleaning prowess, and the S8 MaxV Ultra’s dual rubber brushes and 10,000Pa of suction power tackled the pet hair on my fluffy carpet and demolished my oatmeal test. \nIt also did a better job at mopping than Roomba’s mopping bots, though not quite as well as the Narwal Freo X Ultra or Dreame X40 Ultra, though it’s a better vacuum than either. \nIts sonic mopping system — which vibrates its mop pad 4,000 times a minute — ably simulated scrubbing and wiped out my OJ and ketchup tests, though I did have to set it to deep scrub. Plus, the addition of a side mop and flexi-arm brush that extends from the bot helped with cleaning edges and corners.\nRoborock’s mobile app is easy to use and comes with a laundry list of features and customizations that give you ample control over your cleaning. The S8 MaxV Ultra also has a built-in voice assistant, which makes getting the bot to clean the mess your kid made after dinner as easy as saying, “Rocky, clean here.” \nRoborock also sells the S8 Max Ultra (no V) for $1,599.99. It has the same cleaning hardware as the MaxV but no camera, so its obstacle detection will not be as good. However, you also don’t have to worry about a camera in your house. It has a lower 8,000Pa of suction and lacks a voice assistant, too, which makes it seem overpriced since it’s currently only a couple hundred dollars less than the MaxV.\nThere are several great vacuum / mop hybrids in this guide. Of them, the S8 MaxV Ultra is the best at vacuuming and obstacle detection, and it’s a very good mop. It can also do both in one run, as it can lift its mop 20mm, which will clear all but the highest-pile rugs. If you have a lot of those, go for the Dreame X40, with its automatic mop removal. Its vacuuming and object detection are a notch below the Roborock’s, but its mopping is a notch above. The Narwal Freo X Ultra is an even better mop than the Dreame, but its obstacle detection isn’t great, and its vacuuming is merely pretty good.\nRead my Roborock S8 MaxV Ultra review.\nBest budget robot vacuum\nTapo RV30 Max Plus\n\n\nScore: 8\n\nProsCons\n\n\nCheap, even with the auto-empty dock \nA dual mop and dustbin means no swapping\nRoom-specific cleaning\nCarpet boost\n\nShort battery life\nSlow to recharge\nDocking can be spotty\nBasic obstacle detection\n\n\n\nWhere to Buy:\n\n $329.99 $229.99 at TP-Link (with code 70RV30MAX)\n $329.99 $249.99 at Amazon\n\nDustbin capacity: 300ml / Self-empty dock option: Yes / Auto-refill mop option: No / Mop lift: No / Mop washing: No /  Mapping: Yes, lidar / AI-powered obstacle detection: No / Suction power: 5,300Pa / Remote check-in: No / Keep-out zones: Yes, virtual / Brush style: Single rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nFor around $300, the Tapo RV30 Max Plus is a very capable robot vacuum and mop with some key features usually only found on vacuums that are more than twice its price. These include room-specific cleaning, multiple suction and water levels, smart lidar-based navigation, and an auto-empty dock. With brands like Roomba and Roborock, you’re often paying double for the privilege of not having to empty the bot’s bin.\nThanks to lidar navigation, the RV30 did an excellent job of navigating my house, cleaning the perimeters of the rooms, and then using a mesh grid to clean inside the rooms. I did have to tidy up before it ran, though, as there’s no camera on board or AI-powered obstacle detection — so cables and socks will trip it up. \nIts 5,200Pa suction power is impressive on a bot at this price, and ably sucked up Cheerios and dry oatmeal on hard flooring. It left some of the finer dust and debris, as its single bristle / rubber brush isn’t super effective. It fared less well on carpet. However, in the app, I could set it to clean a room three times for each job, after which it had generally picked up all visible debris.\nMopping was better than average for a mop with no pressure or oscillation. It has a wide mop pad, and the bot has a big 300ml tank (which also incorporates a 300ml dustbin), so it applies enough water to do a good surface clean.\nAnother unique feature for a budget robot is the ability to set customized cleaning for each room, choosing from five suction levels and three water levels as well as the three rotations.\n\n5,200Pa suction power is impressive on a bot at this price\n\n\nThe Tapo app is very simple to use, with an easy-to-edit map that lets you add virtual walls and no-go zones, add furniture, and designate carpet areas. There’s no carpet sensing, so you need to tell it where carpets are if you don’t want it to mop them. You can even set the cleaning direction and build up to four maps — again, features usually only found on higher-end robots.\nIt’s also super easy to start a clean, and I really like that you can just tap on the map to send the robot to that spot. The biggest downside of the Tapo is its tiny battery, which is just 2,600mAh. That is half the size of most vacs, and it couldn’t clean my entire 800-square-foot downstairs without needing to go back and recharge. It also takes a while to charge and occasionally had trouble repositioning itself on its dock. You can get the RV30 without the auto-empty dock for around $80 less if you prefer an even simpler robot vacuum setup. This way, it will fit under a couch or bed, but you’ll have to manually empty its bin.\nBest mopping robot vacuum for hard floors\nNarwal Freo X Ultra\n\n\nScore: 8\n\nProsCons\n\n\nThe best mopping robot\nAlso good at vacuuming\nVery quiet\nBig water tanks mean less refilling\n\nMiddling laser-based obstacle avoidance\nWonky app\nHuge charging dock\n\n\n\nWhere to Buy:\n\n $899.99 $549.99 at Narwal (with code BTSXU)\n $899.99 $699.99 at Costco (with Accessory Pack Bundle)\n\nDustbin capacity: 1L / Self-empty dock option: No / Auto-refill mop option: Yes / Mop lift: Yes, 12mm / Mop washing: Yes, hot air drying /  Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,200Pa / Remote check-in: No / Keep-out zones: Yes, virtual / Brush style: Single, conical rubber bristle hybrid / Works with: Amazon Alexa, Google Home, Siri Shortcuts\nThe Narwal Freo X Ultra is one of the best mopping robots I’ve tested — and it’s a good vacuum, too. Its spinning triangular mop pads rotate at 180RPM with 12n of downward pressure. Combined with its ability to swing slightly to get closer to baseboards, the Narwal does a very good job on hard floors. Its dual four-liter water tanks will keep you going longer than most other mopping bots as well, the majority of which feature smaller tanks.\nThe Narwal has some innovative features, including dirt sense — which analyzes the dirt level in the water and prompts it to remop — and an ability to adapt the pressure of its mop based on the type of floor, applying more pressure to tile and less to hardwood. “Freo” refers to the bot’s ability to make cleaning “decisions,” including going back to clean dirty floors.\nIts charging dock is very big, though, giving off a real Wall-E vibe. But despite the size, there’s no spot for an auto-empty dustbin; instead, Narwal’s disposable onboard bin compresses the dust, and Narwal claims you won’t need to empty it for up to 60 days. It wasn’t close to full after two weeks of testing. A bonus here is that there’s no loud noise, as is the case with most auto-empty docks.\n\nIts charging dock is very big, giving off a real Wall-E vibe\n\n\nIn fact, the Freo X Ultra is one of the quietest bots I’ve tested. Even at full power, it was so quiet that I had to check that it was working. Its anti-tangle brush and 8,200Pa suction did a good job on most carpet, but its 12mm mop lifting isn’t good for plush carpets.\nNarwal’s obstacle detection is also only okay; there’s no camera, and it routinely eats cables. Its three lasers can identify objects as small as a sock and move around them, and it did pass my fake pet poop test.\nThe app is very hard to follow, making it tricky to access all of the bot’s features. Mapping was fast, but it didn’t recognize all my rooms on the first go. It did better the second time, although splitting up rooms and naming them in the app was painful. The lack of a camera also means its navigation is spotty, and sending it to clean specific rooms wasn’t always successful. But if you’ve got a lot of hard floors to keep clean, it will do an excellent job.\nBest robot vacuum / mop hybrid\nDreame X40 Ultra\n\n\nScore: 8\n\nProsCons\n\n\nSelf-removing mop pads \nMop extension reaches under edges\nSelf-cleaning washboard\nDirt detection tech\n\nMiddling AI obstacle detection \nSingle rubber roller brush\nApp can be flaky\n\n\n\n\nWhere to Buy:\n\n $1499.99 $849.99 at Dreame\n $1499.99 $899.99 at Amazon\n $1499.99 $899.99 at Walmart\n\nDustbin capacity: 300ml / Self-empty dock option: Yes / Auto-refill mop option: Yes / Mop-lift: Yes, 20mm / Mop washing: Hot water, hot air drying /  Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 12,000Pa / Remote check-in: Yes / Keep-out zones: Yes, virtual / Brush style: Single, rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts \nThe Dreame X40 is the best robot vacuum / mop hybrid because it can drop its mop pads automatically, extend them, and swing them to get under your cabinets and consoles. I watched the X40 spread its mops wide apart and swing behind my TV console, allowing it to access the dust wedged a good inch under it. That’s impressive.\nThe X40 also features an extending side brush arm to reach corners — like the Roborock S8 MaxV Ultra — and its dual oscillating mop pads are more effective than Roborock’s thin microfiber pad. If you have a mix of carpeted rooms and hardwood floors with high-pile rugs, the Dreame is the best robot vacuum for you.\nIts signature feature is its ability to automatically remove and reattach its mop pads, depending on whether it’s vacuuming or mopping. This solves the problem of how to vacuum and mop without getting your rugs wet. The robot will do this procedure multiple times during cleaning to ensure carpets are vacuumed and floors are mopped. Genius.\nWhile it’s a superb mopper, its vacuuming prowess is slightly behind the Roborock S8 MaxV Ultra because, despite its 12,000Pa suction power, it still only has a single roller rubber brush. The Roborock’s dual rollers are simply better at getting dirt out of carpets and tackling pet hair.\n\nIf you have a mix of carpeted rooms and hardwood floors with high-pile rugs, the Dreame is the best robot vacuum for you\n\n\nRoborock’s app is also more stable and easier to use than Dreame’s, which often crashes and can take a while to load. While the Roborock S8 MaxV Ultra is my top pick overall, the Dreame X40 is a very good vacuum, and the two companies are neck and neck regarding innovative features.\nThe X40 can also clean its washboard, something the Roborock can’t. That area can get quite grungy, so it needs a cleaning every few weeks. The X40 has AI-powered smart dirt detection that uses its cameras to identify spills like milk or particularly dirty areas. When it spots something, it will slow down and do a more thorough cleaning. I also like Dreame’s option to vacuum first and then mop, which the Roborock doesn’t offer.\nThe X40 has AI-powered obstacle detection, although Roborock’s is just a bit better. However, both still get tripped up occasionally by pencils and other small items — something that never happens with the Roombas with this feature.\nBest midrange robot vacuum / mop \nEufy X10 Pro Omni\n\n\nScore: 7\n\nProsCons\n\n\nGood AI-powered obstacle detection\nEffective mopping\nExcellent value\nNice dock\n\nSingle rubber / bristle brush\nLower suction power \nNo heated mop washing\nSome navigation issues\n\n\n\nWhere to Buy:\n\n $799.99 $549.99 at Amazon (with coupon)\n $799.99 $549.99 at Eufy (with code WS24T2351)\n $799.99 $699.99 at Best Buy\n\nDustbin capacity: Unknown / Self-empty dock option: Yes / Auto-refill mop option: Yes / Mop lift: Yes, 12mm / Mop washing: Yes, hot air drying /  Mapping: Yes, lidar / AI-powered obstacle detection: Yes / Suction power: 8,000Pa / Remote check-in: No / Keep-out zones: Yes, virtual / Brush style: Single rubber / bristle hybrid / Works with: Amazon Alexa, Google Home \nThe Eufy X10 Pro Omni combines the Eufy Clean X9 Pro mopping robot vacuum and the Eufy X8 Pro self-empty robot vacuum. It’s the first Eufy with a multifunction auto-empty / wash / fill dock, and unlike many bots in this price range, it comes with AI-powered obstacle detection.\nWith 8,000Pa suction and oscillating dual spinning brushes for mopping, the X10 has all the same functions as the top-of-the-line, all-in-one bots — but it’s not quite as good at any of them. Which is sort of the definition of “midrange.”\n\n The X10 has all the same functions as the top-of-the-line, all-in-one bots — but it’s not quite as good at any of them\n\n\nThe Eufy performed excellently in my mopping tests, even eradicating dried stains with its 1kg of downward pressure. Thanks to an onboard water reservoir, it didn’t have to head home to fill up as frequently as some mopping bots do. It also has heated mop drying to help prevent the base from getting stinky — a first in this price range. (There’s no hot water washing.)\nAn edge-hugging mode makes the robot swing its behind into the baseboards to help mop edges. With its square-ish shape, it got into corners better than most of the round bots. But its 12mm mop pad lift over carpet wasn’t effective, resulting in its pads getting hung up in a few places.\nThe X10 has great object recognition, allowing it to suck up Cheerios and piles of oatmeal while deftly navigating fake dog turds and cables. However, its navigation sometimes got screwy; it would go into a corner and stay there for a while, trying to figure itself out.\nWhile its vacuuming is good, particularly on carpet and tile surfaces, the single rubber / bristle roller brush lets it down and is a good illustration of my point that it’s not all about suction power; it’s also about the brushes and how you use them. The Eufy’s brush is supposedly anti-tangle — a cutting tool inside the robot should shred the hair — but this wasn’t effective.\nThe Eufy Clean app is very easy to use, and the lidar-powered mapping was fast and accurate, dividing my rooms correctly on the first try. There are many customization options — including room-specific cleaning, zone cleaning, and customized cleaning — but the app is clear and well laid out.\nBest robot vacuum for pet hair\nRoomba Combo 10 Max\n\n\nScore: 7\n\nProsCons\n\n\nExcellent vacuuming\nSuperior AI obstacle detection\nSmart scrub feature works well\nAttractive dock that doubles as a table\n\nSmall mop pad\nLimited cleaning customization\nMapping can take a long time\nNavigation can be buggy\n\n\n\nWhere to Buy:\n\n $1399.99 $599 at Amazon\n $1399.99 $599 at Best Buy\n $1399.99 $1199.99 at iRobot\n\nDustbin capacity: 250 ml / Self-empty dock option: Yes / Auto-refill mop option: Yes / Mop lift: Yes, up and over / Mop washing: Yes / Mapping: Yes, vSLAM / AI-powered obstacle detection: Yes / Suction power: N/A / Remote check-in: No / Keep-out zones: Yes, virtual / Brush style: Dual rubber / Works with: Amazon Alexa, Google Home, Siri Shortcuts, Apple Home via the Matter protocol.\nWhile Roombas may have fallen behind the competition in terms of features and innovation, there’s one area in which they reign supreme, and that’s cleaning prowess. Their dual rubber roller brushes rotate in opposite directions to effectively dig up dirt from carpets, and they are by far the best at tackling pet hair on all surfaces. They are also one of the most self-repairable robot vacuums you can buy, with spare parts for most of the bot’s bits readily available. \nThe newest model, the Combo 10 Max, is the best Roomba for pet hair as it ties for the highest suction power of the current Roomba line, plus it can clean its own mop. It also has top-notch AI-powered obstacle detection that is able to tell the difference between pet poop and a pile of popcorn (and vacuum up one while avoiding the other). \nWhile its mopping isn’t great — the pad is tiny, and there’s no swinging to get along baseboards — it does a decent job, and its retractable mopping system is handy if you have a lot of carpets. All of this makes the Combo 10 Max a great buy for pet parents who are in a daily battle with shedding and occasional muddy paw prints. \nThe Combo is the first Roomba with a multifunction dock that can refill its mopping tank and self-wash its mopping pad, meaning less hands-on time for you. (The j9 Combo Plus has the same suction power and can refill its mopping tank but can’t wash the mop pad.) The SmartScrub feature that tells the robot to wiggle its butt to scrub your floors works surprisingly well, but it’s really only effective on small areas, making it good to run in hallways and around pet bowls for an extra clean. \n\nThe Dirt Detect feature remembers the dirtiest rooms, actively seeking out spots my hairy Wirehaired Pointing Griffon hangs out\n\n\nThe Dirt Detect feature remembers the dirtiest rooms, and I found that meant it actively seeks out the spots my hairy Wirehaired Pointing Griffon hangs out. The 10 Max can also be set to mop only, which is a new option and is handy for deep cleans. But there’s no hot water washing or hot air drying of the mop as there is on similar Dreame and Roborock models, so you’ll want to throw the pad in the washing machine every now and then. \niRobot’s app is also a bit of a pain point. While I appreciate its simplicity, I miss the deeper cleaning customization options that most other high-end robot vacuum apps offer. And it’s recently started popping up ads for Roomba products when I navigate between screens — which is one of the features I did not want to see migrate over from the competition.\nWhile its mapping is very good, it can take a really long time (Roombas use vSLAM, not lidar), and it doesn’t seem to adapt to changes in my home as easily as other robots. (It also doesn’t lose my maps as often as other robots.) I’ve also noticed that the newer Roombas (j9 and 10 Max) suffer from the occasional navigation glitches, occasionally getting confused and needing to be rebooted.\nI really like Roomba’s dock design, which, while large enough to accommodate two rather small water tanks, is the most stylish of all the multifunction docks. Plus, because you access the water tanks from the front rather than the top (as on most other models), it can be used as a table. That’s a small quality-of-life upgrade I enjoy. \nOverall, it’s a good-looking robot that vacuums really well and is smart enough to get the job done with limited intervention. If you’re not interested in mopping at all, however, save some money and get the Roomba j9 Plus. It has similar cleaning prowess, a self-empty dock, and no messing with mopping.\nOther robot vacuums to consider\nThe 360 Vis Nav ($499.99 $999.99), Dyson’s first robovac in the US in almost a decade, is a powerful beast and the best robot vacuum for carpets I’ve tested. But its navigation needs a lot of work. If you have a simple floor plan with a lot of carpets, it is worth considering, but the short battery life and lack of an auto-empty dock are major cons. Read more in this hands-on.\nThe Roomba j7 ($599.99) is a previous top pick that has great AI-powered obstacle detection, excellent navigation skills, and superior cleaning power. It can be a bit rough with furniture, but it is aggressive at getting your floors clean and is a great vacuum-only Roomba.\nThe Dreame X30 Ultra ($599.98  $899.99) is the older version of my top pick for a vacuum / mop hybrid and is a great buy if you can get it on sale. It does most everything the X40 Ultra does, just with lower suction power (8,3000Pa) and no flexi-arm.\nThe Roborock Q8 Max Plus ($379.99 $659.99) is the bigger brother to the Q5 Pro (my pick for pet hair in my budget robot vacuum guide), adding better obstacle detection (still no camera) and better mopping. However, it has a smaller bin to make way for a much bigger water reservoir for mopping (350ml). If you like the idea of the Q5 Pro but want better mopping, this is a good option.\nThe Shark Matrix Plus 2-in-1 ($399.99 $699.99) was my previous runner-up pick for a midrange option that self-empties its bin, vacuums, and mops. It mops very well, but you have to manually fill and attach the mop reservoir and empty the bin.\nWhat I’m testing and what’s coming next\nRoborock’s Saros 10 ($1,299.99 $1,599.99) and 10R ($1,599.99) are upgrades to the S8 MaxV Ultra. Both can automatically remove their mop pads when not needed — a new option for Roborock — and feature an AdaptLift chassis to climb high room transitions. The 10R features 19,000Pa suction power, StarSight 2.0 navigation, and oscillating mops. The Saros 10 has 22,000Pa of suction power, lidar navigation, and the vibrating flat mopping pad of the S8 MaxV.\nRoborock also recently released the Saros Z70 ($2,599), which is the first mass-produced robovac to feature a robotic arm that can pick up objects like socks and tissues. The arm itself isn’t particularly reliable, but the Z70 still functions as an excellent robot vacuum with 22,000Pa suction power, support for Roborock’s StarSight navigation system, and an AdaptLift chassis. Read our review.\nIn March, iRobot announced a new Roomba lineup that starts at $299 and goes up to $999. All of the robovacs come with lidar navigation and mapping, 7,000Pa suction power, and four suction levels. The pricier 405 and 505 models are the first Roombas to feature dual spinning mopping pads, while the 505 also offers heated mop drying, which is something even the higher-end Combo 10 Max lacks.\nIn April, iRobot also introduced the Roomba Max 705 ($599 $899.99), which comes with an auto-empty dock. The Matter-compatible robovac brings back iRobot’s dual rubber roller brushes, which, based on our previous testing, do an excellent job of picking up pet hair; the 705 also features AI-powered obstacle detection, lidar navigation, and 13,000Pa of suction — the most of any Roomba to date.\n iRobot recently released the Roomba Max 705 Combo ($1,299.99), an upgraded version of the Roomba Max 705. The step-up model comes with a new self-deploying mop cover to protect carpets from getting wet, along with an extendable mop that cleans corners and wall edges for a more thorough clean.\nThe new Eufy Robot Vacuum Omni E28 ($799.99 with code WS24T2352111 $999.99) is a self-emptying, self-refilling, and self-washing robot vacuum / mop hybrid. The vac comes with a deep cleaner integrated into the charging dock, which you can use to spray clean water on stains before sucking everything into a separate wastewater tank. It’s also powerful, boasting up to 20,000Pa of suction power, and offers AI-powered obstacle detection and Matter support.\nThe Dreame X50 Ultra ($1,259.99 $1,699.99) adds a “motorized swing arm” that acts like a leg, allowing the robovac to climb a transition up to 6cm tall. Otherwise, it’s a lot like the X40 Ultra, only with higher suction power.\nThe Ecovacs Deebot X8 Pro Omni ($899.99 $1,399.99) is the first Deebot with a roller mop. It features an extendable mop that can clean itself, boasts 18,000Pa of suction power, and comes with a redesigned auto-empty fill dock.\nThe Switchbot K10 Plus Pro Combo ($379.99 with on-page coupon 399.99) is an upgrade to the compact K10 Plus, a previous pick for the best robot vacuum for small spaces. It has better obstacle detection and a bump up to 3,000Pa of suction power. Plus, its auto-empty dock incorporates a manual stick vacuum.\nThe Switchbot S20 robot vacuum / mop hybrid ($640 with code SLOD20 $799.99), which looks like the Switchbot S20 Pro announced at CES, launched in early August. It features an extendable roller mop and side brush, as well as 15,000Pa of suction power, which is more than twice that of our previous pick for the best mopping vacuum (the last-gen S10).\nSharkNinja’s PowerDetect NeverTouch Pro 2-in-1 robot vacuum / mop ($699.99 $999.99) can lift itself over rugs by up to 20mm. Uniquely, its automatic empty /wash / dry cleaning station doesn’t require bags.\nRoborock’s Qrevo Curv ($1,099.99 $1,599.99) can raise itself to clear thresholds up to 40mm. The svelte-looking bot gets its name from a curved FlexiArm Arc side brush, which helps prevent hair from tangling as much.\nNarwal’s Freo Z Ultra ($949.99 with on-page coupon $1,499.99) is an upgrade to my current pick for the best mopping bot. It features dual cameras and dual AI chips for seeing and identifying objects, which should help with obstacle detection and vacuuming methods.\nThe Eufy S1 Pro ($949.99 with on-page coupon $1,499.99) has a long roller mop that self-cleans as it mops and features a square-ish design that allows it to get into corners more easily. A single rubber roller brush, 8,000Pa of suction, and 3D-powered obstacle detection tackle the vacuuming.\nThe Matic is a $1,095 robot vacuum that doesn’t need a cloud connection and uses cameras to navigate. It’s also the first robovac mop I’ve seen that can suck up wet spills as well as dry ones. Here’s some video of it in action.\nPhotos by Jennifer Pattison Tuohy / The Verge\nUpdate, September 5th: Adjusted pricing / availability. Sheena Vasani also contributed to this post.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1731bbfe2d88f2f34ec7d43bcd198b36ff02523f",
      "title": "OpenAI reorganizes research team behind ChatGPT’s personality",
      "url": "https://techcrunch.com/2025/09/05/openai-reorganizes-research-team-behind-chatgpts-personality/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T23:19:12.000Z",
      "summary_90w": "",
      "raw": "OpenAI is shuffling the team that shapes its AI models' behavior, and its leader is moving on to another project within the company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35d4cb5e43598fcbe7311b97a3d6059017cf94d5",
      "title": "Silicon Valley’s most powerful alliance just got stronger",
      "url": "https://www.theverge.com/command-line-newsletter/773260/google-apple-search-deal-money-ai",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-09-05T23:05:54.000Z",
      "summary_90w": "",
      "raw": "Eddy Cue deserves a raise. \nAs the executive overseeing Apple's services division, he's highly incentivized to protect the tens of billions of dollars a year that Google pays to be the default search engine in Safari. \"I've lost a lot of sleep thinking about it,\" he said from the witness stand during Google's antitrust trial earlier this year. \nLuckily for Cue, his court testimony appears to have had a significant impact on Judge Amit Mehta, who ruled this week that Google's default payments to Apple and others can continue. You can see Cue's arguments at trial mirrored in Mehta's ruling: the Apple SVP said it would be \"crazy\" to punish th …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1467baf17cd5bb21a1897e198cc9e445a76fdb2a",
      "title": "Watch: What's in the 'missing minute' of Epstein's jail video?",
      "url": "https://www.bbc.com/news/videos/c98eyn3xey2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T23:01:23.000Z",
      "summary_90w": "",
      "raw": "The US House Oversight Committee has released new surveillance footage recorded hours before the convicted paedophile's death.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f91242b4221fd87a6ecc8ab07a305a61e582cab",
      "title": "Russia targets WhatsApp and pushes new 'super-app' as internet blackouts grow",
      "url": "https://www.bbc.com/news/articles/ce9rj2145jgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T23:00:51.000Z",
      "summary_90w": "",
      "raw": "Millions of Russians have faced restrictions on popular apps while a new app called Max is aggressively promoted.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "76d81638d9b80d90fd38c1e1e8fc79e09b51402a",
      "title": "Under Trump, the Federal Trade Commission is abandoning its ban on noncompetes",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528937/ftc-noncompete-ban-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T21:46:33.000Z",
      "summary_90w": "",
      "raw": "Federal Trade Commission Chair Andrew Ferguson has called his agency's rule banning noncompetes unconstitutional. Still, he says protecting workers against noncompetes remains a priority.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "8a756f86af8b9e727568afbc53119ada7d8084da",
      "title": "Screw the money — Anthropic’s $1.5B copyright settlement sucks for writers",
      "url": "https://techcrunch.com/2025/09/05/screw-the-money-anthropics-1-5b-copyright-settlement-sucks-for-writers/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T20:59:21.000Z",
      "summary_90w": "",
      "raw": "Writers aren't getting this settlement because their work was fed to an AI -- this is just a costly slap on the wrist for Anthropic because it illegally downloaded books instead of buying them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0a2945e4f3d3901564e99ea2e0388645285dae0",
      "title": "Judge blocks ending of legal protections for 1m Venezuelans and Haitians in US",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/ruling-end-protections-haitian-venezuelan-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T20:50:00.000Z",
      "summary_90w": "",
      "raw": "Homeland security had tried to end temporary protected status granted by the Biden administration\nA federal judge on Friday ruled against the Trump administration from ending temporary legal protections that have granted more than 1 million people from Haiti and Venezuela the right to live and work in the United States.\nThe ruling by US district judge Edward Chen of San Francisco for the plaintiffs means that 600,000 Venezuelans whose temporary protections expired in April or whose protections were about to expire on 10 September have status to stay and work in the United States.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8d29b74291d2ed51150d670db2f6f0b385f17236",
      "title": "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "url": "https://www.npr.org/2025/09/05/g-s1-87367/anthropic-authors-settlement-pirated-chatbot-training-material",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T20:33:18.000Z",
      "summary_90w": "",
      "raw": "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ef61311d9b24d0c6e8188fcb56ba70dc157195e3",
      "title": "You can trust the jobs report, Labor Department workers urge public",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5530733/bls-jobs-report-labor-statistics-trump",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T19:43:42.000Z",
      "summary_90w": "",
      "raw": "A strongly-worded statement from Bureau of Labor Statistics workers comes a month after President Trump attacked the integrity of the jobs numbers they release monthly.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1fac018585534a85042bdba44819092ee5443c10",
      "title": "Google fined €2.95bn by EU for abusing advertising dominance",
      "url": "https://www.bbc.com/news/articles/c1wgn3lre14o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T19:42:04.000Z",
      "summary_90w": "",
      "raw": "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a15f675293d87d02b0d0eafad506e9a423a5df44",
      "title": "Personalized AI companion app Dot is shutting down",
      "url": "https://techcrunch.com/2025/09/05/personalized-ai-companion-app-dot-is-shutting-down/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:27:47.000Z",
      "summary_90w": "",
      "raw": "Dot, a personalized AI companion, is shutting down.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6f9de73b6975230518b0e1021d77aad815ac5ba1",
      "title": "Angela Rayner: Resignationcast AND a Reshuffle!",
      "url": "https://www.bbc.co.uk/sounds/play/p0m15j4h?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T19:27:00.000Z",
      "summary_90w": "",
      "raw": "Keir Starmer rearranges his top team after losing his deputy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d43e495d89e6265b7aa597cb08a59ddbe134fac7",
      "title": "Attorneys general warn OpenAI ‘harm to children will not be tolerated’",
      "url": "https://techcrunch.com/2025/09/05/attorneys-general-warn-openai-harm-to-children-will-not-be-tolerated/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:21:45.000Z",
      "summary_90w": "",
      "raw": "California Attorney General Rob Bonta and Delaware Attorney General Kathy Jennings met with and sent an open letter to OpenAI to express their concerns over the safety of ChatGPT, particularly for children and teens.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ab43f2749f854c9cb6147eb9e5e83bac30a01186",
      "title": "Google Gemini dubbed ‘high risk’ for kids and teens in new safety assessment",
      "url": "https://techcrunch.com/2025/09/05/google-gemini-dubbed-high-risk-for-kids-and-teens-in-new-safety-assessment/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T19:09:12.000Z",
      "summary_90w": "",
      "raw": "Google's Gemini comes up short on kids' safety, says Common Sense Media.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1dd6e09a0de87a396a8f5161015879791f359f50",
      "title": "Cutting through the equity noise: Don’t miss this powerhouse panel at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/startup-hiring-isnt-just-about-the-pitch-its-about-the-package-pulley-645-ventures-and-epigram-legal-break-it-down-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T18:30:00.000Z",
      "summary_90w": "",
      "raw": "Leaders from Pulley, 645 Ventures, and Epigram Legal join the Builders Stage at TechCrunch Disrupt 2025, happening October 27-29 in San Francisco. Register to join.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f8698efee7b6366b4354843f2b1d30953244ef13",
      "title": "A timeline of the US semiconductor market in 2025",
      "url": "https://techcrunch.com/2025/09/05/a-timeline-of-the-u-s-semiconductor-market-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T18:26:00.000Z",
      "summary_90w": "",
      "raw": "From leadership changes at legacy semiconductor companies to wishy washy policy around chip exports, a lot has happened already.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ca83770bea7db1cd518f0fdcda7fd87da8429d57",
      "title": "UK ignored obligation to prevent genocide, witnesses tell Gaza tribunal",
      "url": "https://www.theguardian.com/world/2025/sep/05/uk-ignored-obligation-to-prevent-genocide-witnesses-tell-gaza-tribunal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T18:07:48.000Z",
      "summary_90w": "",
      "raw": "Independent tribunal told government did little to hold Israel to account and aimed to shield itself from scrutiny\nBritain is not just complicit in Israel’s breaches of humanitarian law in Gaza but a participant that has repeatedly ignored its legal obligation to prevent a genocide, witnesses have told the independent Gaza tribunal.\nThe two-day tribunal in London, which is independent of government and parliament, is seeking to amass evidence of Britain’s failure to distance itself from what the tribunal organisers regard as Israeli war crimes amounting to genocide.\nRAF pilots flying from the UK Akrotiri airbase in Cyprus systematically shared intelligence in real time with the Israel Defense Forces (IDF), but not with the international criminal court.\nNo 10 failed to provide the support requested by lawyers acting for James Henderson, the British World Central Kitchen aid worker killed by the IDF on 1 April 2024, leaving them reliant on an IDF internal investigation, with a coroners’ inquiry still as long as two years away.\nBritain provided no support to the chief prosecutor at the international criminal court, Karim Khan, after the US government imposed sanctions that led a British bank to close his account, “so emboldening those who seek to dismantle international accountability”.\nThe UK trade department continued to allow the import of products from Israel-occupied territories after the international court of justice in July 2024 ruled in an advisory opinion that the occupation was unlawful.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d5830397df29e859c53b4344c7f1edae5fefca71",
      "title": "EU fines Google nearly €3bn for ‘abusing’ dominant position in ad tech",
      "url": "https://www.theguardian.com/technology/2025/sep/05/google-fined-european-union",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T17:36:06.000Z",
      "summary_90w": "",
      "raw": "Regulators ordered the tech giant to end ‘self-preferencing practices’ in advertising services but declined to force sale\nEuropean Union regulators on Friday hit Google with a €2.95bn ($3.5bn) fine for breaching the bloc’s competition rules by favoring its own digital advertising services, marking the fourth such antitrust penalty for the company as well as a retreat from previous threats to break up the tech giant.\nThe European Commission, the 27-nation bloc’s executive branch and top antitrust enforcer, also ordered the US company to end its “self-preferencing practices” and take steps to stop “conflicts of interest” along the advertising technology supply chain.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b163cba03be477c514c241d0963303189072c087",
      "title": "Roblox announces short-form video feed for gameplay clips, new AI tools for creators, and more",
      "url": "https://techcrunch.com/2025/09/05/roblox-announces-short-form-video-feed-for-gameplay-clips-new-ai-tools-for-creators-and-more/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:30:00.000Z",
      "summary_90w": "",
      "raw": "Users can scroll through a feed of gameplay moments shared by the Roblox community and react to the clips using emojis, and they can jump into an experience right from a video.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fafe67d1c238559a3f28c0320cf48f7c80c577b8",
      "title": "Three ways Epstein scandal could go for Trump",
      "url": "https://www.bbc.com/news/articles/c059gmypj4jo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-05T17:27:51.000Z",
      "summary_90w": "",
      "raw": "This week the victims of Epstein's crimes came forward to demand more information, piling pressure on the White House.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2141ca0516074b1169f7531b3a03deabdd76ee76",
      "title": "Trump sends 10 stealth fighter planes to Puerto Rico amid war on Caribbean drug cartels",
      "url": "https://www.theguardian.com/us-news/2025/sep/05/trump-fighter-planes-puerto-rico-venezuela-drug-cartel",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T17:11:58.000Z",
      "summary_90w": "",
      "raw": "Move comes after US accuses Venezuela of buzzing warship and a deadly US missile strike in Caribbean Sea\nDonald Trump is sending 10 F-35 fighter jets to Puerto Rico to bolster US military operations against drug cartels in the Caribbean region, it was reported on Friday.\nIf follows a deadly US missile strike on Tuesday on a boat in the Caribbean Sea that the Trump administration insisted was carrying 11 Venezuelan drug traffickers, and comments by the secretary of state, Marco Rubio, on Wednesday that such attacks “will happen again”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "494ed2a119c67ec6821db377e6d05760cc0a7976",
      "title": "Tesla’s ad spend on X has shrunk to almost nothing",
      "url": "https://techcrunch.com/2025/09/05/teslas-ad-spend-on-x-has-shrunk-to-almost-nothing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T17:00:46.000Z",
      "summary_90w": "",
      "raw": "Tesla spent a fraction on X in early 2025 compared to 2024. It also paid $300,000 to Kimbal Musk's drone company.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f700046314679d7e8d3d08b68565cd1e2551341c",
      "title": "Warner Bros. sues Midjourney for AI images of Superman, Batman, and other characters",
      "url": "https://techcrunch.com/2025/09/05/warner-bros-sues-midjourney-for-ai-images-of-superman-batman-and-other-characters/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:56:38.000Z",
      "summary_90w": "",
      "raw": "Warner Bros. says that Midjourney knowingly engaged in wrongful conduct, noting that the company previously restricted subscribers from generating content based on infringing images but recently lifted those protections.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f47cf51ec49080f15aaf9f3e920a4ee733deec97",
      "title": "Natron’s liquidation shows why the US isn’t ready to make its own batteries",
      "url": "https://techcrunch.com/2025/09/05/natrons-liquidation-shows-why-the-us-isnt-ready-to-make-its-own-batteries/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:37:48.000Z",
      "summary_90w": "",
      "raw": "The sodium-ion battery startup went from announcing a $1.4 billion factory to filing for liquidation in just over a year. Natron's troubled journey illustrates the challenges in making batteries in the U.S.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6589b86f63f97d2296cea28ce113319a02fee6f0",
      "title": "US imposes sanctions on Palestinians for requesting war crimes inquiry",
      "url": "https://www.theguardian.com/world/2025/sep/04/us-sanctions-palestinian-human-rights",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T16:15:14.000Z",
      "summary_90w": "",
      "raw": "Rights groups in Gaza and Ramallah had asked international criminal court to investigate Israel over genocide claims\nThe US has imposed sanctions against three Palestinian human rights groups that asked the international criminal court (ICC) to investigate Israel over allegations of genocide in Gaza, according to a notice posted to the US treasury department’s website.\nThe three groups – the Gaza-based Palestinian Centre for Human Rights and Al Mezan Center for Human Rights, and the Ramallah-based Al-Haq – were listed under what the treasury department said were ICC-related designations.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "77712dc1834f78041cf8c012fe49d03465a117ee",
      "title": "X is now offering me end-to-end encrypted chat — you probably shouldn’t trust it yet",
      "url": "https://techcrunch.com/2025/09/05/x-is-now-offering-me-end-to-end-encrypted-chat-you-probably-shouldnt-trust-it-yet/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T16:04:03.000Z",
      "summary_90w": "",
      "raw": "X's new encrypted messaging feature, XChat, has some red flags.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "48230ed337f7af0c59ef5765c6e45ff52ddbd6d7",
      "title": "US and UN discuss Gaza reconstruction plan before general assembly",
      "url": "https://www.theguardian.com/world/2025/sep/05/us-and-un-discuss-gaza-reconstruction-plan-before-general-assembly",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T15:27:59.000Z",
      "summary_90w": "",
      "raw": "Talks aimed at preventing row at UN conference, where several countries plan to recognise state of Palestine \nA potential UN-endorsed reconstruction plan for Gaza, including a one-year technocratic government, an international stabilisation force, disarmament of Hamas and a rejection of mass deportation of Palestinians, is being discussed with the US to prevent the UN general assembly descending into a bitter row about the symbolic recognition of Palestine as a state.\nIt is almost certain that the UK, France, Canada, Belgium and Malta will recognise the state of Palestine at a UN conference on 22 September to be held on the sidelines of the general assembly, in the week when world leaders deliver major speeches.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f858d8da54211474d9c9ac1d5573c08e93fdb434",
      "title": "Australia’s Ukrainian community calls for Oscar Jenkins to be included in prisoner swaps or risk being ‘forgotten’",
      "url": "https://www.theguardian.com/australia-news/2025/sep/06/oscar-jenkins-ukraine-russia-prisoner-swap-request",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T15:00:30.000Z",
      "summary_90w": "",
      "raw": "Exclusive: Local group calls on Penny Wong to push Russia for Jenkins’ priority inclusion in ongoing prisoner swaps program with Ukraine\n\nGet our breaking news email, free app or daily news podcast\n\nAustralia’s Ukrainian community is urging the Albanese government to intervene to have captured soldier Oscar Jenkins included in planned prisoner swaps, warning he risks becoming a “forgotten” prisoner of Russia’s war.\nJenkins, a 33-year-old former teacher and Australian citizen, travelled to Ukraine and enlisted to fight with the country’s military following Russia’s 2022 invasion. After being captured by Russian forces in December 2024, he was jailed for 13 years on the charge of being a “mercenary”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f275cd7994e3f995e147aadc7fe3d572b839cb61",
      "title": "Scale AI’s former CTO launches AI agent that could solve big data’s biggest problem",
      "url": "https://techcrunch.com/2025/09/05/scale-ais-former-cto-launches-ai-agent-that-could-solve-big-datas-biggest-problem/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T15:00:00.000Z",
      "summary_90w": "",
      "raw": "Isotopes, co-founded by Arun Murthy, launched a sophisticated analytics agent. Arun was one of the creators of Hadoop who later joined Scale AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "35bf2b855838e48b64ea6075760c9c0d0a0ce811",
      "title": "Hundreds of South Koreans are among 475 detained in a Georgia immigration raid",
      "url": "https://www.npr.org/2025/09/05/g-s1-87208/georgia-hyundai-immigration-raid-bryan-county-south-korea-response",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T14:58:37.000Z",
      "summary_90w": "",
      "raw": "\"The business activities of our investors and the rights of our nationals must not be unjustly infringed,\" a foreign ministry spokesman said after about 300 South Koreans were detained.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "ad49db7f8332d8ca744433b7d55edfb5a9e2b198",
      "title": "OpenAI hires the team behind Xcode coding assistant Alex",
      "url": "https://techcrunch.com/2025/09/05/openai-hires-the-team-behind-xcode-coding-assistant-alex-codes/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:58:32.000Z",
      "summary_90w": "",
      "raw": "The team behind Alex, which built a popular tool that let devs use AI models within Apple's development suite Xcode, is joining OpenAI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b26267a91853e2982910e025ade885f2fa875813",
      "title": "The blueprint for lasting companies and communities with Discord’s Jason Citron and Campuswire’s Tade Oyerinde at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/creating-communities-and-companies-that-last-with-discords-founder-jason-citron-and-campuswires-tade-oyerinde-only-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:30:00.000Z",
      "summary_90w": "",
      "raw": "When you design for people instead of institutions, you don’t just build a product. You build a movement. That’s the idea behind this Builders Stage session called “Creating Communities and Companies That Last.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bdd651a181fbc9653e0414eba2867220af20072",
      "title": "US Navy Seals killed North Korean civilians in botched 2019 mission, report says",
      "url": "https://www.theguardian.com/world/2025/sep/05/commando-team-north-korea-civilians-2019-mission",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T14:28:18.000Z",
      "summary_90w": "",
      "raw": "New York Times says Trump authorized mission to plant listening device; team killed fishers they encountered\nUS Navy Seals shot and killed a number of North Korean civilians during a botched covert mission to plant a listening device in the nuclear-armed country during high-stakes diplomatic negotiations in 2019, the New York Times reported on Friday.\nCiting unidentified sources, including current and former military officials with knowledge of the still-classified details, the newspaper said Donald Trump approved the operation during his first administration, as he was involved in historic talks with the North Korean leader, Kim Jong-un.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "59bb0bcffeb7d76521ca5a33a168e6a3d6584905",
      "title": "Tesla shareholders to vote on investing in Musk’s AI startup xAI",
      "url": "https://techcrunch.com/2025/09/05/tesla-shareholders-to-vote-on-investing-in-musks-ai-startup-xai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:23:20.000Z",
      "summary_90w": "",
      "raw": "A shareholder proposal would allow Tesla to invest in Elon Musk's rival AI firm, xAI if approved. Tesla's board didn't recommend one way or another.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c34bc307d72f561937c2fb07f88b7b22af4ac8ca",
      "title": "Today is your last chance to exhibit your brand in front of 10K tech leaders at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/09/05/today-is-your-last-chance-to-exhibit-your-brand-in-front-of-10k-tech-leaders-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-09-05T14:00:00.000Z",
      "summary_90w": "",
      "raw": "If you want to get in front of more than 10,000 startup and VC leaders, connect with media, and generate a nonstop pipeline this October, you need to act now.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "15e8b21e58482e13dcdfe555ca4eee980d476678",
      "title": "‘Standing up for Palestinians’: why Greta Thunberg wears a Bohemian FC shirt",
      "url": "https://www.theguardian.com/world/2025/sep/05/bohemian-fc-thank-greta-thunberg-for-wearing-their-kit-during-aid-mission",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T13:50:36.000Z",
      "summary_90w": "",
      "raw": "The Swede has has not necessarily become a fan of Irish football, as she sports a club jersey made with help from Fontaines DC\nThe humanitarian aid flotilla to Gaza is a serious mission with an incongruous detail: Greta Thunberg sporting a jersey of the Dublin football club Bohemians.\nThe Swedish activist wore the pale blue shirt during an earlier flotilla in June and again this week as vessels prepared to leave Barcelona.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2b52e21c992b1776cae6ea411d43b133686be8fe",
      "title": "Tycoon who led push to decriminalise cannabis becomes Thai PM",
      "url": "https://www.theguardian.com/world/2025/sep/05/tycoon-anutin-charnvirakul-thai-pm-cannabis-campaign",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T13:37:44.000Z",
      "summary_90w": "",
      "raw": "Anutin Charnvirakul voted in by parliament after promising election in four months, as Thaksin Shinawatra jets out\nAnutin Charnvirakul, a staunch royalist, has been appointed by lawmakers as Thailand’s next prime minister after days of heated negotiations and political drama.\nThe 58-year-old tycoon turned politician is considered a conservative, though he made a name for himself for leading a campaign to decriminalise cannabis. He was voted in after a chaotic scramble by parties to gain enough support to replace the ousted PM, Paetongtarn Shinawatra, who was removed from office by a court ruling.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a30b994ca2023fccde9d0e9102f549054ea40358",
      "title": "Cracks in the U.S. economy: Job growth slows 75% from a year ago",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529937/economy-jobs-trump-bls",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T12:51:43.000Z",
      "summary_90w": "",
      "raw": "The U.S. job market showed more signs of weakness Friday, as the Labor Department reported just 22,000 jobs added in August. Revised figures show the economy lost jobs in June, for the first time since the pandemic winter of 2020.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "4b6d3adb35ae1da835b90341e8935e6cdc0f9485",
      "title": "Weather tracker: British Columbia breaks Canada’s September heat record",
      "url": "https://www.theguardian.com/environment/2025/sep/05/weather-tracker-record-heat-british-columbia-canada-september-record-temperature-kansas-oklahoma-hail",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T10:20:29.000Z",
      "summary_90w": "",
      "raw": "Temperatures climb above 40C, while a powerful hailstorm in the US lashes Kansas and Oklahoma\nA spate of extremely hot weather in British Columbia has broken Canada’s national maximum temperature record for September.\nOn Tuesday, it reached 40C (104F) in Lytton, matching the previous all-time high. That was only the third time that temperature has been recorded in the country in September.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c1a1cadea41b9ddfdb82ff53732f95f732f2418",
      "title": "Why the end of the de minimus tariff exemption is causing shipping chaos worldwide",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5518283/why-the-end-of-the-de-minimus-tariff-exemption-is-causing-shipping-chaos-worldwide",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:11:05.000Z",
      "summary_90w": "",
      "raw": "Planet Money looks at what the de minimis tariff exemption is, who wins and loses with the end of this policy and why ending it has resulting in shipping chaos worldwide.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6cc48c7eb011636e7455cf12aed5c68a0ebfe147",
      "title": "Wong responds to Andrews photo; proposed Harbour Bridge march headed to court – as it happened",
      "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-05T09:09:31.000Z",
      "summary_90w": "",
      "raw": "This blog is now closed\n\nNeo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community\n\nGet our breaking news email, free app or daily news podcast\n\nCoalition of the willing meeting a ‘positive sign’ for Ukraine, former ambassador says\nThe former Australian ambassador to Russia, Peter Tesch, has appeared on ABC News Breakfast after Anthony Albanese joined a virtual meeting with world leaders signed up to the coalition of the willing for Ukraine on Thursday night.\nThe issue is that we are still no closer to a credible and durable peace settlement, because Moscow keeps walking both sides of the street, and that is provoking a degree of frustration. But in the absence of serious, additional pressure upon Moscow, it’s difficult to see a near-term solution here - notwithstanding Ukraine’s clear willingness to engage seriously in discussions.\nAnd importantly, although the details are vague … President Trump at least remains engaged in that dialogue and that’s very important.\nOur case for a 35% pay increase over three years will begin in the NSW Industrial Relations Commission later this month. As part of this case, which is one of the biggest industrial cases this state has seen, we will present evidence around the gendered undervaluation of nurses and midwives’ work and the work value changes our professions have seen over the past 16 years.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "65f30a4711ebcceaaac959def5fb948739ba1c42",
      "title": "Trump hosts biggest names in tech at White House dinner",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529377/trump-hosts-biggest-names-in-tech-at-white-house-dinner",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-05T09:08:57.000Z",
      "summary_90w": "",
      "raw": "Some of the biggest names in tech dined with President Trump at the White House Thursday night, as the administration pursues lawsuits against Silicon Valley companies.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "453a8bf46ea2f979e193f4ef69370999876a955f",
      "title": "Nike's nearly 40-year-old slogan gets an update",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5528897/nikes-nearly-40-year-old-slogan-gets-an-update",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:07:52.000Z",
      "summary_90w": "",
      "raw": "NPR's A Martinez speaks with AdWeek's Brittaney Kiefer about Nike's update to their iconic \"Just Do It\" slogan.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "b7dd982c89f9a15b4f02eb24874da987293b8801",
      "title": "Etsy sellers are being hit hard by tariffs and the end of the de minimis rule",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5522054/etsy-sellers-de-minimus-canada-tariffs",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:00:00.000Z",
      "summary_90w": "",
      "raw": "For years, the U.S. was essentially \"an extension of our domestic market,\" says an Etsy seller in Canada. But now the rules and costs are far more imposing.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "e0afda5ab1eb8a4cc8fc1993d245bec0de9dc5d8",
      "title": "Have questions about homeownership or renting? NPR wants to know",
      "url": "https://www.npr.org/2025/09/05/nx-s1-5529253/homeownership-renting-questions",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-09-05T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Your input will help shape a new NPR series on renting, homeownership and everything that comes with it.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7f095e20299a00098215b0da803a329436c94fac",
      "title": "How to see Sunday's 'Blood Moon' total lunar eclipse",
      "url": "https://www.bbc.com/news/articles/c8739rrez23o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-05T07:36:36.000Z",
      "summary_90w": "",
      "raw": "A total lunar eclipse will be visible from parts of the UK on Sunday evening, weather permitting.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f73c0d99d6b6851a7c9180120d42934e1825a48",
      "title": "Gamers frustrated as Hollow Knight: Silksong crashes stores on launch",
      "url": "https://www.bbc.com/news/articles/ckgejpxzepko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-05T03:27:29.000Z",
      "summary_90w": "",
      "raw": "Social media users also struggle to grab the game on the Nintendo, PlayStation and Xbox game stores.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d39c31ca7b4b7bcb88c6b5c7932e784746e86e5c",
      "title": "'The hit was very hard': Eyewitness in second carriage shares video of crash moment",
      "url": "https://www.bbc.com/news/videos/c3vzx4wk10ko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T19:42:39.000Z",
      "summary_90w": "",
      "raw": "The incident in Lisbon's funicular has left 16 dead and multiple injured.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6befdfab880fac294aa6d9b0be1b1aa80a8f0b7b",
      "title": "Canada’s Mark Carney signals austerity measures as government shifts focus from Trump to economy",
      "url": "https://www.theguardian.com/world/2025/sep/04/canada-carney-budget-trump",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-04T18:42:20.000Z",
      "summary_90w": "",
      "raw": "Prime minister cautions Canadians as Ottawa moves to curb spending to balance near-record military expenditures\nMark Carney has told Canadians to prepare for austerity measures and his finance minister warned of “tough choices” in the coming months, as the government attempts to balance near-record defence spending, cuts to government programs and a trade war with the United States.\nCarney, the former central banker and economist turned politician, has been meeting senior ministers before the fall budget, and hinted cuts were coming to the federal bureaucracy.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6f4ac2bdbaf2c6ac0b8306ef876270e698fc2905",
      "title": "Watch: Key moments from RFK Jr's heated Senate hearing",
      "url": "https://www.bbc.com/news/videos/ce8604l4vkmo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T18:01:30.000Z",
      "summary_90w": "",
      "raw": "The US health secretary faced questions on Covid deaths and vaccines a week after firing the head of the Centers for Disease Control and Prevention.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a51907517ab25be81c74dd53d622d1f45eeb92ab",
      "title": "Head of UK's Turing AI Institute resigns after funding threat",
      "url": "https://www.bbc.com/news/articles/c8rvx85z3z7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:37:13.000Z",
      "summary_90w": "",
      "raw": "Dr Jean Innes is stepping down after the government told the charity to focus on defence research.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "89b24efc7cbd4877872449748c4f895d2ada8b60",
      "title": "'He doesn't follow trends': How celebrities described Armani over the years",
      "url": "https://www.bbc.com/news/videos/c5y85eyvlm0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T15:31:16.000Z",
      "summary_90w": "",
      "raw": "The Italian fashion designer and billionaire brand owner Giorgio Armani has died at the age of 91.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04fd4d773ea9152601fb5f769b0cbf55dbef44d8",
      "title": "Google told to pay $425m in privacy lawsuit",
      "url": "https://www.bbc.com/news/articles/c3dr91z0g4zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T15:05:06.000Z",
      "summary_90w": "",
      "raw": "Google says the decision misunderstands how its products work, and it will appeal the ruling.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88358a79276520db2a3c7248d8b34bd9a07c7138",
      "title": "Watch: BBC correspondent at scene of Lisbon funicular crash",
      "url": "https://www.bbc.com/news/videos/c7v15j8ydreo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-09-04T11:08:23.000Z",
      "summary_90w": "",
      "raw": "Local media reports suggest a cable came loose along the railway's route, causing it to lose control - a national day of mourning is being observed",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d70dfc04f94146a70b86d7d1569122ab0c49487b",
      "title": "Creator of Charli XCX Apple dance settles Roblox lawsuit",
      "url": "https://www.bbc.com/news/articles/cdxqljv7nvdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:41:33.000Z",
      "summary_90w": "",
      "raw": "Kelley Heyer had accused the online platform of copying her choreography without permission.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0eb07b23dea63a86b91c605328ee7cdcd580884f",
      "title": "World's largest sports piracy site shut down by police",
      "url": "https://www.bbc.com/news/articles/c62q4l0d171o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T10:33:38.000Z",
      "summary_90w": "",
      "raw": "The take-down of the site has been championed as a major victory for live sports broadcasters.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1bc0f53d3acbc7723b2eb9713dc2f1a6a8e7bb46",
      "title": "Wikipedia editors publish new guide to help readers detect entries written by AI",
      "url": "https://www.npr.org/2025/09/04/nx-s1-5519267/wikipedia-editors-publish-new-guide-to-help-readers-detect-entries-written-by-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-04T08:54:52.000Z",
      "summary_90w": "",
      "raw": "Can you tell whether something you read on Wikipedia was written by a human or AI? Wikipedia's editors hope a new guide will help you spot the difference.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5dbb34225979e86522cc6f2fb9796eb6e48b92aa",
      "title": "The Global Story: The deal that broke Ukraine's trust",
      "url": "https://www.bbc.co.uk/programmes/w3ct714l?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-09-04T05:00:00.000Z",
      "summary_90w": "",
      "raw": "An exploration of the 1994 Budapest Memorandum, intended to enshrine Ukraine's security.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fd55fb3eaab2d847435ea0ff07a8201acb8f6176",
      "title": "Lost in translation - How Africa is trying to close the AI language gap",
      "url": "https://www.bbc.com/news/articles/crkzgkkpx0lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-04T00:28:10.000Z",
      "summary_90w": "",
      "raw": "A new dataset with African languages should improve access to AI for millions on the continent.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4dfbf7b9975558d1f1cb1f9565dc4b0c7b3f4003",
      "title": "M&S hackers claim to be behind Jaguar Land Rover cyber attack",
      "url": "https://www.bbc.com/news/articles/c4gqepe5355o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T17:08:41.000Z",
      "summary_90w": "",
      "raw": "The hack has caused severe disruption at manufacturing plants globally, with some staff told not to come into work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ad50c3f884e53d43d619d1e7cb05bdae86149c85",
      "title": "Luigi Mangione's likeness used to model shirt on Shein",
      "url": "https://www.bbc.com/news/articles/c4g5vr4vzpzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T14:08:55.000Z",
      "summary_90w": "",
      "raw": "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1786fe2779196c4b895587d539ece5b4bd3520e0",
      "title": "Trump’s aid cuts in east Africa led to unwanted abortion and babies being born with HIV – report",
      "url": "https://www.theguardian.com/global-development/2025/sep/03/trumps-aid-cuts-in-east-africa-led-to-unwanted-abortions-and-babies-being-born-with-hiv-report",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T13:00:23.000Z",
      "summary_90w": "",
      "raw": "Doctors, nurses, patients and other experts describe the loss of decades of progress in beating the virus in 100 days after Pepfar was disrupted\nAid cuts in east Africa have led to cases of babies being born with HIV because mothers could not get medication, a rise in life-threatening infections, and at least one woman having an unwanted abortion, according to interviews with medical staff, patients and experts.\nA report by Physicians for Human Rights (PHR) sets out dozens of examples of the impact of disruption to Pepfar – the president’s emergency plan for aids relief – in Tanzania and Uganda.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "126603778fa91624d6398a697d19f6407310f47f",
      "title": "Judge lets Google keep Chrome but orders other penalties in major antitrust ruling",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5526037/judge-lets-google-keep-chrome-but-orders-other-penalties-in-major-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:02:28.000Z",
      "summary_90w": "",
      "raw": "In a major antitrust ruling, a federal judge stopped short of ordering Google to sell off its popular Chrome browser, but ordered other penalties against the tech giant.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7307f57c01a154a9a268dc0de0c39cef46cd7e3a",
      "title": "'Founders Museum' from White House and PragerU blurs history, AI-generated fiction",
      "url": "https://www.npr.org/2025/09/03/nx-s1-5521261/white-house-ai-founders-museum",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-03T09:00:00.000Z",
      "summary_90w": "",
      "raw": "Historians say it's good to highlight America's founders, but the project takes too narrow a view of history.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1939cd31661d803ada77873946e8dd9c2e436fd5",
      "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
      "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-03T08:48:53.000Z",
      "summary_90w": "",
      "raw": "The men, who had been released after serving criminal sentences, are from Laos, Vietnam, Cuba, Jamaica and Yemen\nLawyers for five men deported by the US to Eswatini, formerly Swaziland, said they are being denied proper access to their clients, who they said are being imprisoned illegally.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba have criminal convictions, but had all served their sentences and been released in the US, their lawyers said. The US deported them to the small southern African country without warning in July, claiming they were “depraved monsters”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a65797a59c3471a345be835206ef23e36a493821",
      "title": "Family of dead teen say ChatGPT's new parental controls not enough",
      "url": "https://www.bbc.com/news/articles/cg505mn84ydo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T08:41:18.000Z",
      "summary_90w": "",
      "raw": "OpenAI has introduced new rules in the wake of the family's allegations that ChatGPT encouraged their child to take his own life.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d69070c2afed8e2a7753c6ed51fb329cb1b27481",
      "title": "A let-off or tougher than it looks? What the Google monopoly ruling means",
      "url": "https://www.bbc.com/news/articles/cx2q2kkdedno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-03T07:28:22.000Z",
      "summary_90w": "",
      "raw": "The search giant is not being broken up -so how much will it be affected by the remedies a judge has instead ordered?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d3a37391c989465991192d98927b19af4c13ee8a",
      "title": "Google avoids break-up but must share data with rivals",
      "url": "https://www.bbc.com/news/articles/cp8zdrenm1zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T23:51:46.000Z",
      "summary_90w": "",
      "raw": "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "045970b17b4c011c324cafad4bbd48503cfcbafb",
      "title": "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "url": "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-09-02T21:15:23.000Z",
      "summary_90w": "",
      "raw": "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5169a1d77584e988dd511fd856cacbabb1fb3bfa",
      "title": "Jaguar Land Rover production severely hit by cyber-attack",
      "url": "https://www.bbc.com/news/articles/c9wywvllq7wo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-02T18:39:39.000Z",
      "summary_90w": "",
      "raw": "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "abac9e9c336213d4fbc3fcd9948450af4027f61d",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "url": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-09-02T12:28:19.000Z",
      "summary_90w": "",
      "raw": "Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor\nMore than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.\nThe landslide on Sunday, which followed heavy rain, destroyed the village of Tarasin in the Marra mountains area of western Sudan and left only one survivor, the Sudan Liberation Movement/Army (SLM) said.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8a9c3f09776a9094c3cc425984fa3b7e6380f965",
      "title": "Ticketless train travel to be trialled across cities",
      "url": "https://www.bbc.com/news/articles/cly702xd0edo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T13:25:57.000Z",
      "summary_90w": "",
      "raw": "The digital ticketing trials will allow passengers to check in and out using a location-identifying app.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9261488da75f12481f1c942d8430e638bf2553e6",
      "title": "Meta to stop its AI chatbots from talking to teens about suicide",
      "url": "https://www.bbc.com/news/articles/c2kzl79jv15o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T12:05:05.000Z",
      "summary_90w": "",
      "raw": "The firm says it will add more guardrails \"as an extra precaution\" and temporarily limit chatbots teens can use.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0b653a33890e329596b38b040090e977c5f6d57d",
      "title": "Children at risk of identity theft and fraud from 'sharenting' ",
      "url": "https://www.bbc.com/news/articles/c8904njvy03o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T11:57:07.000Z",
      "summary_90w": "",
      "raw": "Researchers at the University of Southampton are warning of the dangers of posting your children's photos online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "11bb68c9eb1ae36273c401408e3d530704541490",
      "title": "BYD shares slide as China's EV price war hits profits  ",
      "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T07:50:54.000Z",
      "summary_90w": "",
      "raw": "The EV maker faces a crowed market, with rivals like XPeng and Telsa, which have all cut prices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a1adb860fc6d32d550d2d65abe7b023af8f732c4",
      "title": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
      "url": "https://www.bbc.com/news/articles/clyrkj0d44vo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-09-01T02:34:13.000Z",
      "summary_90w": "",
      "raw": "The impending ban is popular with many parents, but experts have raised concerns over privacy and age verification technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "54652df1e1413fe075fda8bce97ef3e81c966cf4",
      "title": "The first game to feel truly cinematic is back - years after its creator left",
      "url": "https://www.bbc.com/news/articles/cy08jr6jwn2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-31T00:58:36.000Z",
      "summary_90w": "",
      "raw": "The first new game in the series in a decade - a remake - has been released, without involvement of the series creator.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a2ee361b0b853e9cc770a283711dea89c8c46c89",
      "title": "What are the skills critical for the future of work",
      "url": "https://www.npr.org/2025/08/30/nx-s1-5502438/what-are-the-skills-critical-for-the-future-of-work",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-30T21:16:26.000Z",
      "summary_90w": "",
      "raw": "A study from Stanford says AI is taking jobs and making it harder for young people to find work. Tech education company founder Sinead Bovell talks about the skills that will be critical for the future of work.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9069467c0cb9af5b3af34934d4cf2bd3f8ea9467",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "url": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-29T17:31:50.000Z",
      "summary_90w": "",
      "raw": "Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott\nSixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.\nThe accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b6215588352af272d359efd1f7973b69de6e785a",
      "title": "Court documents shed new light on UK-Apple row over user data",
      "url": "https://www.bbc.com/news/articles/cx293qg7z39o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T15:58:33.000Z",
      "summary_90w": "",
      "raw": "The document suggests the government may still want access despite US officials saying it had dropped the demand.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ae000b6a45c784eacea5c38b6ee00b8b5a3cd36d",
      "title": "Musk files to dismiss lawsuit over his purchase of Twitter shares",
      "url": "https://www.bbc.com/news/articles/cn47ey2wxkpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T11:09:32.000Z",
      "summary_90w": "",
      "raw": "US regulators allege his late disclosure of Twitter share purchases allowed him to buy them at \"artificially low prices\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c610be62e172e6d1599db73b511cb5382e33eebf",
      "title": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
      "url": "https://www.bbc.com/news/articles/ckgyk2p55g8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-29T10:33:42.000Z",
      "summary_90w": "",
      "raw": "The fast food chain is reassessing its use of the tech after a number of errors were shared widely online.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "631326f2d5cb9d42d3c11c0d631908b1900d28a2",
      "title": "Thirsty data centres boom in drought-hit Mexico",
      "url": "https://www.bbc.com/news/articles/cx2ngz7ep1eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T23:03:41.000Z",
      "summary_90w": "",
      "raw": "Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f17eb264b2af3a2f6b49d1e0c0f29f1c6271dd00",
      "title": "With no federal facial recognition law, states rush to fill void",
      "url": "https://www.npr.org/2025/08/28/nx-s1-5519756/biometrics-facial-recognition-laws-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-28T17:23:08.000Z",
      "summary_90w": "",
      "raw": "Nearly two dozen states have passed laws regulating how tech companies collect data from our faces, eyes and voices. It comes as Congress has yet to pass any facial recognition technology.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b96a265e3eb3d3dcadb4a8f185e8cb73bd3c93bd",
      "title": "Kick accuses French authorities of politicising streamer's death",
      "url": "https://www.bbc.com/news/articles/cx23zdvk854o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T16:03:28.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, died during a live stream on the Kick website.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "31927e0041da8b0103558331d362018340bf5114",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "url": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-28T11:58:49.000Z",
      "summary_90w": "",
      "raw": "Trump administration pushing controversial deal to send people to non-home countries including South Sudan and Eswatini\nSeven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.\nThe Trump administration has been negotiating arrangements to send people to third countries including South Sudan and Eswatini, formerly Swaziland, as part of its wider deportation drive.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "61576eb5df699cc497052d29ef3d6d05246675b5",
      "title": "AI boom boosts Nvidia despite 'geopolitical issues'",
      "url": "https://www.bbc.com/news/articles/c3wnj8611y7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T06:38:35.000Z",
      "summary_90w": "",
      "raw": "Nvidia remains exposed to geopolitical tensions between the US and China.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "3c662f36c15ffac29ea14cf767c7a66eaadf920a",
      "title": "Japanese town proposes two-hour daily limit on smartphones",
      "url": "https://www.bbc.com/news/articles/cqlew2rv337o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-28T02:27:00.000Z",
      "summary_90w": "",
      "raw": "The limit would only apply outside of work and study time and no fines would be given if breached",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e8445bf0046c86f939ba3d28b0ced957c159ca20",
      "title": "Apple warns UK against introducing tougher tech regulation",
      "url": "https://www.bbc.com/news/articles/ckgj9kjmvzzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T21:03:24.000Z",
      "summary_90w": "",
      "raw": "The iPhone maker is pushing back against proposed changes required by the UK competition watchdog",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    }
  ]
}