{
  "version": "1756322878081",
  "generatedAt": "2025-08-27T19:27:58.081Z",
  "items": [
    {
      "id": "0434b29544c727ecb3f2b81d203eb2ec0027dd5b",
      "title": "Google and Grok are catching up to ChatGPT, says a16z’s latest AI report",
      "url": "https://techcrunch.com/2025/08/27/google-and-grok-are-catching-up-to-chatgpt-says-a16zs-latest-ai-report/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:27:01.000Z",
      "summary_90w": "",
      "raw": "The report, in its fifth iteration, showcases two and a half years of data about consumers' evolving use of AI products.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "86caaa6448b8f1ba3b3fab2bb91ae4ecc67f6a83",
      "title": "The 75 best Labor Day deals we’ve found so far",
      "url": "https://www.theverge.com/tech/756227/best-labor-day-sales-deals-2025",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T19:22:24.000Z",
      "summary_90w": "",
      "raw": "Labor Day marks the unofficial end of summer, and while the prospect of cooler weather and shorter days can be a tough adjustment, at least there is always a great selection of deals to combat the post-summer blues. You’ll have to wait until September 1st to celebrate the actual holiday, sure, but in the meantime, we’ve gone ahead and rounded up the best discounts you can get so far on a variety of Verge-approved gadgets and goods, from earbuds to the latest e-readers.\nBeing that it’s nearly the end of August, it’s also a good reminder that the holidays will be here before you know it. Thankfully, some gadgets — including Sony’s WH-CH520 headphones, Roborock’s 35A robot vacuum, and TP-Link’s X55 Wi-Fi routers — have fallen to their lowest price to date, making now an excellent time to get a head start on your holiday shopping. After all, there’s no guarantee they’ll drop lower in price, even when Black Friday and Cyber Monday roll around.\n\n\n\n\n\nSpeaker deals\nHeadphone and earbuds deals\nSmart home deals\nTV deals\nTablet and e-reader deals\nSmartwatch and fitness tracker deals\nOutdoor deals\nMiscellaneous deals \n\nSpeaker deals\nSonos Roam 2\nLike its predecessor, the Sonos Roam 2 is a compact and travel-friendly Bluetooth speaker that easily syncs up with Sonos’ home audio ecosystem via Wi-Fi. While it looks much like the original, the Roam 2 has some small quality-of-life improvements, like a separate button for Bluetooth connections. Read our hands-on impressions.\n\nWhere to Buy:\n\n $179 $139 at Amazon\n $179 $139 at B&H Photo\n $179 $139 at Best Buy\n\n\nSonos Era 100\nSonos’ Era 100 smart speaker is a replacement for the older Sonos One, utilizing two tweeters (left and right) and one larger woofer. In addition to Wi-Fi, the Era 100 also supports Bluetooth audio and line-in playback via an optional 3.5mm to USB-C adapter. Read our review.\n\nWhere to Buy:\n\n $199 $179 at Amazon\n $249 $179 at Sonos\n $199 $179 at Best Buy\n\nJBL’s Flip 7 is on sale for around $129.95 ($20 off) at Amazon, Best Buy, Walmart, and B&H Photo, matching its second-best price to date. The Bluetooth speaker is dustproof, waterproof, and comes with an interchangeable clip and loop, so you can attach it to your bag. It’s a mono speaker, but you can pair two together for stereo sound, and it’s rated to last up to 16 hours per charge while in Playtime Boost mode.\nUltimate Ears’ Megaboom 4 is currently available at Amazon and Best Buy for $149.99 ($50 off), which is the lowest price we’ve seen this year. The 360-degree Bluetooth speaker carries an IP67 rating, floats, and can last up to 20 hours on a single charge. The button on the top can even be programmed to start a playlist on Spotify, Amazon Music, or Apple Music.\nBeats Pill (2024)\nThe 2024 Beats Pill offers improved sound, USB-C, and native support for Find My and voice assistants on both iOS and Android. It also bests the previous model with double the battery life (24 hours) and IP67 water resistance. Read our review.\n\nWhere to Buy:\n\n $149.95 $99 at Amazon\n $149.95 $99.95 at Walmart\n $149.99 $99.99 at Target\n\nHeadphone and earbuds deals\nApple AirPods 4\nApple’s AirPods 4 improve on previous models with better sound, clearer voice calls, and an even more comfortable design. For $50 extra, you can purchase a model with active noise cancellation and wireless charging. Read our review.\n\nWhere to Buy:\n\n $129 $89.99 at Amazon\n $129 $89.99 at Walmart\n $129.99 $89.99 at Best Buy\n\n\nBeats Studio Pro\nThe latest Beats Studio Pro feature improved noise cancellation, sound quality, and comfort. They also support lossless audio over USB-C, making them the first Apple headphones to do so. Read our review.\n\nWhere to Buy:\n\n $349.99 $179.95 at Amazon\n $349.99 $179.95 at Walmart\n $349.99 $239.99 at Best Buy\n\nSony’s budget-friendly WH-CH520 are matching their all-time low of around $38 ($31 off) at Amazon, Best Buy, and Walmart. The on-ear headphones can tap into Google’s Find My Device network and support multipoint Bluetooth connectivity, so you can keep them paired to two devices simultaneously. They also support Fast Pair on Android and can last up to 50 hours per charge, which is impressive for a pair of budget-friendly cans.\nYou can now buy the latest AirPods Max with USB-C starting at $479.99 at Amazon, Best Buy, and Walmart. Apple’s over-ear headphones combine excellent sound with powerful noise cancellation and a natural-sounding transparency mode. They also feature deep integration with other Apple products and a premium stainless steel / aluminum build that makes them stand out from plastic rivals, even if they’re somewhat heavy to wear during long listening sessions. Read our review of the original model.\nSonos Ace\nThe Sonos Ace are the company’s first set of wireless headphones. They feature a premium, comfortable build and active noise cancellation, along with compatibility with Sonos Arc and other Sonos soundbars. Read our review. \n\nWhere to Buy:\n\n $399 $299 at Amazon\n $399 $299 at Best Buy\n $399 $299 at Walmart\n\n\nBeats Studio Buds Plus\nThe Beats Studio Buds Plus offer better sound and noise cancellation than the original pair, and they now come in a unique translucent color option. Read our review.\n\nWhere to Buy:\n\n $169.95 $84.95 at Woot\n $169.95 $129.95 at Amazon\n $169.95 $129.99 at Best Buy\n\nBose noise-canceling QuietComfort Earbuds are some of the best mid-tier earbuds we’ve tested, and they’re currently on sale at Amazon, Best Buy, and Walmart for $149 ($30 off), matching their second-best price to date. The wireless earbuds are comfortable to wear, and last around eight hours per charge with ANC enabled. We liked the way they sounded out of the box and appreciated their five-band EQ, which allowed us to tune them to our tastes. Read our hands-on impressions.\nThe Shokz OpenFit 2 offer a nice upgrade over the original model, and they’re currently down to an all-time low of around $139.95 ($40 off) at Amazon, REI, Walmart, and Best Buy. Each bud features two speakers: one dedicated to bass and another to mids and highs. The ear hooks have also been redesigned to be thinner, so the OpenFit 2 fit better while wearing glasses. Meanwhile, physical buttons were added to each bud, making it easy to control your audio. Read our hands-on impressions.\nAmazon’s latest Echo Buds are down to just $24.99 ($25 off) at Amazon, which is a mere $5 shy of their best price to date. The entry-level buds lack active noise cancellation but make up for it with comfy, semi-open design and surprisingly decent sound for the price. With support for Amazon Alexa and multipoint Bluetooth pairing, they’re a great pick if you want a straightforward pair of water-resistant earbuds that just work.\nSony WH-1000XM4\nSony’s WH-1000XM4 noise-canceling headphones still offer plenty of bang for your buck with excellent ANC, lively sound, and lengthy battery life. They’re not the company’s latest, but they remain an excellent buy. Read our review.\n\nWhere to Buy:\n\n $348 $198 at Amazon\n $348 $199.99 at Walmart\n $348 $199.99 at Best Buy\n\n\nBose QuietComfort Headphones\nBose’s QuietComfort Headphones, which replace the QuietComfort 45, have adjustable noise cancellation and the ability to set custom modes. However, they lack immersive audio mode and the higher-quality Bluetooth found in the QuietComfort Ultra Headphones.\n\nWhere to Buy:\n\n $359 $229 at Amazon\n $359 $229 at Best Buy\n $359.99 $229.99 at Target\n\nSmart home deals\nTovala Smart Oven Air Fryer\nTovala’s smart oven / air fryer combo is designed to be used in conjunction with its scannable meal kits, which let you make tasty meals in about 20 minutes. Right now, you can get it for free when you buy it from Tovala and order meals six times over six months. Each meal costs around $12.99. Read our review.\n\nWhere to Buy:\n\n $299 at Tovala (with code LABORDAY25)\n\n\nBlink Video Doorbell (second-gen-en) with Sync Module Core\nBlink’s second-gen Video Doorbell records 1080p video in a 1:1 aspect ratio to show their entire body. It comes with a Sync Module that acts as a hub and helps extend its battery life to roughly two years. Clips are stored in the cloud for a subscription fee of $3 per month, or locally using Blink’s Sync Module and a microSD card.\n\nWhere to Buy:\n\n $69.99 $39.99 at Amazon\n $69.99 $39.99 at Best Buy\n $69.99 $39.99 at Target\n\nBlink’s Outdoor 4 cameras can beef up your home’s smart security system, and right now you can get a pair at Amazon for $89.99 ($90 off), which is the best price we’ve seen since Prime Day. The 1080p security cameras are weather-resistant and can last up to two years before their AA batteries need to be replaced. Clips can be stored in the cloud for a subscription fee, or locally using its Sync module (included) and a flash drive. Blink’s five-camera bundle is also on sale for $199.99 ($200 off) at Amazon and Best Buy. \nWhisker’s Litter Robot 4 can automatically clean itself by sifting waste from litter, minimize odors, and keep track of your cat’s weight, which you can check in Whisker’s app. It was designed to accommodate cats of many breeds and sizes, and it works efficiently enough to be used daily by four cats. A bundle that includes the machine and a three-year extended warranty is currently going for $699 ($100 off) at Whisker’s online storefront.\nEcobee Smart Thermostat Premium\nThe Ecobee Smart Thermostat Premium is an excellent option for adding smarts and some style to your HVAC system. As well as being a smart way to control your energy use, the thermostat can also act as a video intercom for Ecobee’s excellent doorbell camera and an indoor air quality monitor.\n\nWhere to Buy:\n\n $249.99 $229.99 at Amazon\n $249.99 $229.99 at Best Buy\n $249.99 $229.99 at Ecobee\n\n\nEcobee Smart Doorbell Camera\nThis is a great wired doorbell camera, and the only one that can use an Ecobee thermostat as a video intercom, making it a no-brainer for Ecobee households, as long as you can hook it to your doorbell wiring.\n\nWhere to Buy:\n\n $159.99 $119.99 at Amazon\n $159.99 $119.99 at Best Buy\n $159.99 $119.99 at Ecobee\n\nMammotion’s Yuka Mini 500H is a robotic lawnmower that looks (and works) like a robot vacuum, and it’s currently on sale at Amazon for an all-time low of $649 ($449 off). It uses AI and sensors to map out your yard, avoid obstacles, and find the most efficient route to mow. The 500H can keep track of up to 15 “work zones” and move between them independently; it can also run for up to 55 minutes per charge.\nYou can buy the GE Profile Smart Indoor Smoker from Williams Sonoma and GE Appliances for around $599 ($100 off). If you don’t have the space for an outdoor grill, the handy gadget is a great way to add a delicious, smoky flavor to meats and vegetables right from your kitchen. It can’t handle classic BBQ cuts as well as a traditional wood-pellet smoker, but the built-in heating element does a nice job cooking your food while the smoke imparts it with additional flavor. The resulting meat might not be as tender as it would be if you were to only use smoke, but hey, at least it doesn’t take up a ridiculous amount of space in your backyard. Read our review.\nBrisk It Zelos-450 smart grill\nBrisk It’s Zelos-450 is a beginner-friendly smart electric pellet smoker with Wi-Fi connectivity and an AI assistant that suggests recipes and manages cooking. It features 450 square inches of cooking space and can reach temperatures of up to 500 degrees Fahrenheit.\n\nWhere to Buy:\n\n $449.99 $328.99 at Amazon\n $449.99 $329.99 at Walmart\n $449.99 $329.99 at Brisk It\n\n\nRing Battery Doorbell (2024)\nThe 1080p camera on Ring’s latest Battery Doorbell has improved color night vision and a taller, head-to-toe field-of-view for package detection than the previous model. It also features better battery life and push-pin dismounting.\n\nWhere to Buy:\n\n $99.99 $54.99 at Amazon\n $99.99 $54.99 at Best Buy\n $99.99 $54.99 at Target\n\nThe GE Profile Opal 2.0 Ultra is on sale for around $529.95 ($100 off) at Best Buy, Crate & Barrel, and Williams Sonoma. The smart gadget does an excellent job delivering a full batch of fresh, chewable ice in just 10 minutes, and can produce up to 38 pounds of ice a day. The Ultra is also easier to maintain than the base model, as it comes with a built-in filter for handling mineral buildup, a reusable air filter, and sanitization reminders. Read our review.\nIf you want smart lighting without replacing all the light bulbs in your home, Lutron’s Diva is a great smart home addition that’s on sale for $99.95 ($25 off) at Amazon and Best Buy. Once installed, you can dim your lights or turn them on and off using the switch, an included remote, or an app on your phone. It’s also compatible with all the major smart home platforms, including Amazon Alexa, Google Home, and Apple Home.\nRing Alarm 14-Piece Kit\nThe Ring Alarm 14-Piece Kit has all the sensors and accessories you need to protect a two- to four-room house. You can also opt for 24/7 professional monitoring by signing up for a Ring Home subscription, which costs between $10 and $25 a month, depending on which plan you choose.\n\nWhere to Buy:\n\n $329.99 $198.99 at Amazon\n\n\nCurrent Model P Smart Pizza Oven\nCurrent’s Model P Smart Pizza Oven runs on electricity, gets up to 850 degrees Fahrenheit, and can cook a pizza in two minutes. Its companion app lets you customize your cook based on your pizza style and thickness. Read our review.\n\nWhere to Buy:\n\n $699 $489.3 at Amazon\n $699 $489.3 at Current\n\nRoborock’s QV 35A is available for an all-time low of $439.99 ($159 off) from Amazon and Roborock. The robot vacuum mop / combo uses lidar to construct a 360-degree map of your home — allowing it to create a more efficient cleaning route — and works on hardwood, carpets, and rugs. Dust and dirty water are deposited into containers in the included charging base, which Roborock suggests you should empty weekly. You can even set the QV 35A, which offers 8,000Pa of suction power and a pair of self-washing mopping pads, to run on a schedule via its accompanying mobile app.\nEufy’s Robot Vacuum C10 is a slim robovac that’s designed to clean under furniture, and it’s down to a new low of $199.99 ($280 off) at Amazon and Eufy’s online storefront (with code WS24T2292111). The vacuum maps out your room to avoid obstacles, and you can set no-go zones to avoid certain areas entirely. Debris is deposited into a 3L container in its charging base, which Eufy says needs to be replaced every 60 days. You can also schedule a cleaning with Eufy’s app or your voice using Alexa or Google Assistant.\nEcho Show 5 (third-gen)\nThe newest Echo Show 5 is just as small as its predecessor but features updated mics and a speaker system that delivers double the bass and clearer sound quality.\n\nWhere to Buy:\n\n $89.99 $64.99 at Amazon\n $89.99 $64.99 at Best Buy\n $89.99 $64.99 at Target\n\n\nYale Assure Lock 2 Touch\nThis fingerprint lock is fast and reliable, and the keypad is a good backup option for visitors. It works with Apple Home and can be upgraded to support Wi-Fi — which you’ll need for remote unlocking, Android phones, Amazon Alexa, and Google Home support. Auto-unlock can open the door as you approach, and you can also use a key if you just can’t let go.\n\nWhere to Buy:\n\n $189.99 $139.99 at Amazon (Bluetooth)\n $279.99 $246.98 at Amazon (Wi-Fi)\n\nYou can buy Amazon’s ad-free Echo Hub at Amazon, Best Buy, and Target right now for just $129.99 ($50 off), which is $10 shy of its all-time low. The Echo Hub lets you control your smart home via an eight-inch touchscreen, one that even lets you check live feeds from your video doorbell and control your Ring Alarm security system. It’s loaded with a bunch of interactive widgets, too, while built-in support for both Matter and Thread means it’ll work with a whole host of smart home devices, in addition to Amazon Alexa. Read our review.\nDyson 360 Vis Nav robot vacuum\nDyson’s latest robovac is a great option for simple floor plans and carpets. It boasts a whopping 65 air watts of suction, a huge roller brush, and a spacious 500ml bin with an integrated handle that’s super easy to remove.\n\nWhere to Buy:\n\n $999.99 $499.99 at Amazon\n $999.99 $499.99 at Target\n $999.99 $499.99 at Dyson\n\n\nMill Food Recycler (second-gen)\nMill’s latest Food Recycler works overnight to shrink your food scraps by 80 percent and convert them into compost, which you can then use for gardening or dispose of responsibly. It has a 6.5-liter capacity, which Mill says takes roughly four weeks to fill, and eliminates most odors.\n\nWhere to Buy:\n\n $999 $874 at Mill\n\nTV deals\nSamsung QN80F\nSamsung is offering a free 65-inch U8000F TV when you purchase select 98-inch (or larger) TVs. The QN80F features a 120Hz 4K panel, a custom-designed processor for AI upscaling and color optimization, and built-in Alexa support.\n\nWhere to Buy:\n\n $6499.98 $4999.99 at Samsung (100-inch)\n\n\nSony Bravia 8 II\nThe Bravia 8 II was chosen as the “king of TV” by a panel of judges (including The Verge’s own Nilay Patel) in Value Electronics’ 2025 shootout. The OLED TV has excellent color accuracy, a bright panel, and a 120Hz refresh rate.\n\nWhere to Buy:\n\n $2999.99 $2298 at Amazon (55-inch)\n $2999.99 $2299.99 at Best Buy (55-inch)\n $3499.99 $2998 at Amazon (65-inch)\n\nSamsung’s 98-inch DU9000 is a massive TV that’s back down to its all-time low of around $1,897.99 ($600 off) at Amazon, Best Buy, and Walmart. The set has a 120Hz refresh rate, HDR Plus support, and a direct-lit panel for more even brightness. It also has an AI processor to adjust its picture and brightness settings automatically, and upscale low-resolution video to look nicer on a big 4K screen. If you have a Q-Symphony-compatible soundbar, the DU9000 will even integrate its built-in speakers into the audio system.\nIf you need a 4K TV for a smaller space, Sony’s 43-inch K43S30 is available at Amazon, Best Buy, and Walmart for around $448 ($51 off), an all-time low. It has a 60Hz direct-lit panel that’s great for casual gaming or TV and movie streaming, and includes access to Sony Pictures Core, an exclusive streaming service that lets you watch movies in ultra high quality. You can use Google Assistant to search for content or control compatible smart home accessories with just your voice.\nLG C5 OLED TV\nLG’s C5 features a 120Hz panel, along with four HDMI 2.1 ports and support for both AMD FreeSync Premium and Nvidia G-Sync. The gamer-friendly TV also packs all the hallmarks of a modern OLED, including deep black levels and sublime contrast.\n\nWhere to Buy:\n\n $1999.99 $1296.99 at Amazon (55-inch)\n $1999.99 $1299.99 at Best Buy (55-inch)\n $2699.99 $1496.99 at Amazon (65-inch)\n\n\nTCL QM7K\nTCL’s midrange QM7K has a QD-Mini LED TV with a 144Hz refresh rate, hundreds of local dimming zones for more precise brightness controls, and a Bang & Olufsen audio system.\n\nWhere to Buy:\n\n $1299.99 $596.99 at Amazon (55-inch)\n $1299.99 $596.99 at Walmart (55-inch)\n $1299.99 $599.99 at Best Buy (55-inch)\n\nTablet and e-reader deals\niPad (2025)\nApple’s entry-level iPad is an excellent tablet for casual use. Its high resolution screen is great for watching video, and its A16 processor is fast enough to handle light games and productivity apps. Read our review.\n\nWhere to Buy:\n\n $349 $299 at Amazon (128GB, Wi-Fi)\n $449 $399 at Amazon (256GB, Wi-Fi)\n $649 $599 at Amazon (512GB, Wi-Fi)\n\n\nKindle (2024)\nAmazon’s new entry-level Kindle retains a six-inch, 300ppi display and USB-C. It’s brighter and slightly faster than its predecessor, though, and features longer battery life.\n\nWhere to Buy:\n\n $109.99 $89.99 at Amazon (with ads)\n $109.99 $89.99 at Best Buy (with ads)\n $129.99 $109.99 at Amazon (without ads)\n\n\nAmazon Fire HD 10 (2023)\nThe 2023 Amazon Fire HD 10 sports a 10.1-inch, 1080p display and 3GB of RAM, which is plenty if you’re streaming or browsing. It’s lighter than the last-gen model, too, and comes with support for both the Made for Amazon Stylus Pen and Amazon’s handwriting recognition technology.\n\nWhere to Buy:\n\n $139.99 $89.99 at Amazon (32GB, with ads)\n $179.99 $99.99 at Amazon (64GB, with ads)\n $154.99 $104.99 at Amazon (32GB, without ads)\n\nThe TCL Nxtpaper 14 is a 14.3-inch tablet designed for drawing and note-taking, and it’s on sale for an all-time low of $369.99 ($70 off) at Amazon for Prime members. The tablet features a 2.4K matte display and comes with a T-Pen Stylus that features more than 4,000 pressure levels, so you can get precise strokes when sketching. Its Ink Paper and Color Paper modes also adjust the colors to look more like actual sheets of paper, which can help when reading or writing.\nThe Apple Pencil Pro is on sale for $99 ($30 off) at Amazon, Walmart, and Best Buy, nearly matching its lowest price to date. The premium stylus offers several advanced creative features not found on the entry-level model, including pressure sensitivity and a “Barrel Roll” gyroscope, which lets you rotate the stylus as you draw to quickly adjust the angle of your digital pen or brush. It also supports wireless charging and Apple’s Find My feature, and squeeze gestures that let you control smart home devices.\nKindle Colorsoft (16GB)\nThe 16GB Kindle Colorsoft is Amazon’s latest color e-reader. It features a seven-inch 300ppi screen, an adjustable front light, and a battery that can last up to eight weeks.\n\nWhere to Buy:\n\n $249.99 $219.99 at Amazon\n $249.99 $219.99 at Best Buy\n $249.99 $219.99 at Target\n\n\nAmazon Fire Max 11 (64GB, with ads)\nAmazon’s highest-end tablet features an 11-inch LCD display with 2000 x 1200 resolution as well as options for an add-on keyboard and stylus. Read our review.\n\nWhere to Buy:\n\n $229.99 $174.99 at Amazon (tablet only)\n $229.99 $174.99 at Best Buy (tablet only)\n $264.99 $211.98 at Amazon (with stylus)\n\nSmartwatch and fitness tracker deals\nGarmin Venu 3S\nThe Venu 3S remains our favorite Garmin smartwatch. It’s a comfortable wearable with up to 10 days of battery life and a vibrant 1.2-inch OLED display, not to mention solid sleep tracking, Atrial Fibrillation detection, and a built-in EKG reader. Read our review.\n\nWhere to Buy:\n\n $449.99 $399.99 at Amazon\n $449.99 $399.99 at Best Buy\n $449.99 $399.99 at REI\n\n\nGoogle Pixel Watch 3\nGoogle’s Pixel Watch 3 is bigger and brighter than its predecessor. It also features more advanced running capabilities, offline Google Maps functionality, and deeper integration with other Google devices. Read our review.\n\nWhere to Buy:\n\n $349.99 $249.99 at Amazon (41mm)\n $349.99 $249.99 at Target (41mm)\n $399.99 $299.99 at Amazon (45mm)\n\nThe stylish Withings ScanWatch Light, our favorite hybrid Android smartwatch, is currently available for $199.95 ($50 off) from Amazon and Withings, which is one of the better prices we’ve seen in recent months. Although the smartwatch stands out largely for its elegant appearance, it can also track your steps, sleep, menstrual cycles, and GPS workouts (when tethered to your phone). Plus, it offers access to all the basics — alarms, push notifications, timers, etc. — and up to 25 days of battery life on a single charge.\nOutdoor deals\nBioLite FirePit Plus\nBioLite’s portable FirePit Plus cuts back on unwanted smoke, functions either as a charcoal or wood-fueled grill, and fans the flames via a large battery pack and built-in fan.\n\nWhere to Buy:\n\n $399.95 $299.94 at Amazon\n $399.95 $299.96 at BioLite\n\nJackery’s Explorer 1000 v2 is a great tool to keep campers on the grid, and it’s currently available from Amazon, Best Buy, and Jackery for around $448.99 ($351 off), its lowest price to date. The portable power station features a 1070Wh battery, along with three AC outlets, a DC output, two USB-C ports, and a USB-A port. It’s powerful enough to run small appliances — or recharge your phone, tablet, or laptop several times over — and can be fully recharged in about an hour and a half (or less with emergency charging enabled).\nGarmin’s inReach Messenger Plus is a satellite communicator that allows you to send text, pictures, or voice messages from remote areas, and it’s going for $449.99 ($50 off) at Amazon, REI, and Best Buy. It has a 1,600-character or 30-second voice clip limit, but that’s enough to get a message through in case of an emergency. The rugged gadget can also last up to 25 days on a single charge, and its IPX7 rating means it’s protected against dust and water. Just note that you’ll need a Garmin subscription, which starts at $7.99 a month, to use it.\nStarlink Standard Kit\nStarlink’s Standard Kit comes with both an antenna and a router, which allows you to easily connect your devices to a satellite-based internet connection. Download speeds up to 280Mbps are possible, but will vary by region, subscription tier, and weather conditions.\n\nWhere to Buy:\n\n $349.99 $174.99 at Best Buy\n $349.99 $174.99 at Walmart\n $349.99 $174.99 at The Home Depot\n\nIf you’re planning a late-summer camping trip, Osprey’s Transporter Roll-Top Pack is down to $82.18 (about $83 off) at REI when you use the promo code LABORDAY2025. The 20L backpack is made from a PFC-free, water-repellent material, and the top rolls up and stays shut with a buckled strap to prevent water from getting in. It also features a large main compartment, a zippered pocket that can accommodate a 16-inch laptop, and water bottle pockets on both sides.\nBreeo’s X24 Smokeless Fire Pit is down to $499 ($100 off) at Amazon, its best price to date. The fire pit is made from Corten Steel and features a raised air vent and perforations near its rim to provide continuous airflow, which keeps the fire alive and re-burns the wood to reduce smoke production. Breeo says the fire pit’s material will patina over time, so don’t be alarmed if it changes color after a few uses. If you have additional space, Breeo’s X30, which is designed to accommodate eight chairs around it, is also on sale for an all-time low of $1,189.15 ($210 off) at Amazon and from Breeo.\nMSR’s TrailShot Pocket-Sized Water Filter is currently going for around $48 (about $16 off) at Amazon and REI, which is the lowest price we’ve seen in months. The 5.2-ounce water filter is small enough to fit in your pocket and easy enough to use one-handed, letting you quickly remove 99 percent of bacteria, protozoa, and particulates. You can use the water filter to drink directly from a water source or fill a 1-liter bottle in just 60 seconds. And it’s easy to clean, too — just give it a few shakes to restore the flow rate.\nLifeStraw Peak Series Straw\nLifeStraw’s redesigned Peak Series Straw features a durable, leakproof design that’s great for backcountry treks. It can remove unwanted viruses, bacteria, and microplastics as you drink — just like the base model — but benefits from an increased flow rate and more premium materials.\n\nWhere to Buy:\n\n $24.95 $18.69 at REI\n $24.95 $18.71 at Amazon\n $24.95 $18.71 at LifeStraw\n\n\nMpowerd Luci Solar String Lights: Color\nMpowerd’s solar-powered string lights are perfect for camping or a backyard shindig. The 18-foot string can display six colors and last up to 15 hours on a single charge; it also doubles as a charger.\n\nWhere to Buy:\n\n $54.95 $32.93 at REI\n $54.95 $32.97 at Amazon\n\nREI’s Co-op Half Dome 2 Tent, a classic that offers enough room to comfortably fit two people, is currently on sale for $224.19 (about $85 off) at REI. It’s easy to set up and pack down, and it features two D-shaped doors, providing ample room to get in and out. It has ample headroom, ventilation, and the interior features multiple storage pockets and hang loops for your gear. It also offers a rain cover to keep you dry when the weather suddenly turns.\nThe Exped MegaMat Duo Sleeping Pad provides comfort at your campsite or in your car, and currently, you can purchase it for as low as $277.39 at REI. The 4-inch, self-inflating mattress features an open-cell polyurethane foam and generous padding, so you won’t “bottom out” while sleeping. A side handle makes it easy to move around, and two deflate valves allow you to quickly deflate the sleeping pad. It also makes for a nice air mattress at home, so guests don’t have to sleep on the floor.\nThe Chapter MIPS Bike Helmet is on sale starting at around $111 ($37 off) at Amazon and REI, nearly matching its second-best price to date. The lightweight bike helmet features a hidden PopLock for securing it with a U-lock or chain, along with a sleek visor and a rechargeable USB taillight that offers 30 lumens of brightness. The latter will even automatically turn on when magnetically attached to the helmet or Thousand’s multi-use adapter.\nMiscellaneous deals \nThe Legend of Zelda: Link’s Awakening\nThe Legend of Zelda: Link’s Awakening brings back the classic adventure from the original GameBoy to experience on the Nintendo Switch with an extremely cute art style.\n\nWhere to Buy:\n\n $59.99 $39.99 at Best Buy\n $59.99 $49 at Walmart\n $59.99 $50.48 at Amazon\n\n\nScuf Instinct Pro\nScuf’s Instinct Pro is its top-tier controller for Xbox consoles and PC. It’s one of the only third-party wireless options around, and for its very high price, you get rubberized grips, built-in mappable rear paddle buttons, hair-trigger locks, swappable sticks, and user-configurable cosmetics.\n\nWhere to Buy:\n\n $219.99 $189.99 at Scuf\n $229.99 $199.99 at Amazon\n $229.99 $199.99 at Best Buy\n\nYou can buy a four-pack of AirTags at Best Buy, and Walmart for just $69.99 ($34 off), which is $5 shy of the bundle’s best price to date. Apple’s ubiquitous Bluetooth trackers feature an ultra-wideband chip and connect to the company’s massive Find My network, which translates to exceptionally precise tracking if you’re an iPhone owner. The waterproof trackers also run on user-replaceable batteries and come with a host of neat software tricks, including one that allows you to share their location with up to five people or with one of several airlines.\nYou can sign up for an annual MasterClass subscription, which provides unlimited access to over 200 courses taught by experts, for $60 ($60 off) via MasterClass right now. Courses can be streamed on the MasterClass website or via an app for your phone, tablet, or streaming device. You can also download video or audio versions of them on mobile devices for offline consumption.\nAnker MagGo Wireless Charging Station (3-in-1, Dock Stand)\nAnker’s MagGo Wireless Charging Station features a MagSafe charging stand, a Qi wireless charging pad, and an Apple Watch charger. It should charge all three devices at their top speed simultaneously, and comes with a 40W USB-C power adapter and cable.\n\nWhere to Buy:\n\n $89.99 $69.99 at Amazon (with Prime)\n $89.99 $69.99 at Anker (with code WSPDV2QWE69S)\n\n\nInsta360 Link 2\nThe Insta360 Link 2 offers the same auto-swiveling design as its predecessor in a smaller form factor. It also offers a slate of new features, including group tracking and no-follow zones.\n\nWhere to Buy:\n\n $199.99 $149.99 at Amazon\n $199.99 $149.99 at Best Buy\n $199.99 $149.99 at B&H Photo\n\nYou can pick up a three-pack of TP-Link’s X55 Wi-Fi 6 routers for an all-time low price of $139.99 at B&H Photo. The routers can create a network that covers 6,500 square feet, deliver speeds up to 3,000Mbps, and connect to up to 150 devices. TP-Link routers have been easy to set up and maintain in our experience, which makes them a great “set it and forget it” solution for networking problems.\nIf you have a smaller space, a single Eero 6 Mesh Wi-Fi router may be sufficient, and you can pick one up for $74.99 ($15 off) — which is lower than its Prime Day price — at Amazon, B&H Photo, and Best Buy. The router can create a network covering up to 1,500 square feet, connect to 75 devices at once, and deliver speeds of up to 900Mbps. If you move to a larger place, you can pick up an additional router (or two) to expand your network. A bundle that includes one router and two extenders is currently going for $159.99 ($40 off) at Amazon and B&H Photo, if you need a larger network now.\nElgato Stream Deck Neo\nThe Stream Deck Neo sports eight programmable LCD keys, an info display, and two capacitive buttons to swap through more pages of key macros.\n\nWhere to Buy:\n\n $99.99 $79.99 at Amazon\n $99.99 $79.99 at Best Buy\n $99.99 $79.99 at Elgato\n\n\nFellow Stagg EKG Electric Kettle\nFellow’s handsome gooseneck kettle lets you easily choose your desired water temperature and coffee time via a colored LCD display and built-in stopwatch, making it an ideal companion for pour-over connoisseurs everywhere.\n\nWhere to Buy:\n\n $199.95 $152.96 at Amazon\n $199.95 $152.96 at Fellow\n $199.95 $152.95 at Williams Sonoma\n\nUpdate, August 27th: Adjusted pricing / availability and added several new deals, including those Fellow’s Stagg EKG Pro Electric Kettle, Elgato’s Stream Deck Neo, and the LG C5.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "8680ee3f873f2d264cc3da8441f6ea337eb1bec1",
      "title": "Lib Dem leader Ed Davey to boycott Trump state banquet over Gaza",
      "url": "https://www.bbc.com/news/articles/crlz6rp2ln8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T19:15:01.000Z",
      "summary_90w": "",
      "raw": "The Lib Dem leader says he wants to send the president a message that he has the power to end the crisis.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2baa1fc1477c245d7d700759e976f1876229fc74",
      "title": "OpenAI co-founder calls for AI labs to safety test rival models",
      "url": "https://techcrunch.com/2025/08/27/openai-co-founder-calls-for-ai-labs-to-safety-test-rival-models/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T19:14:01.000Z",
      "summary_90w": "",
      "raw": "In an effort to set a new industry standard, OpenAI and Anthropic opened up their AI models for cross-lab safety testing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "880a243706ae6a3887b0f03c52fdb6e3c4b8f741",
      "title": "Blair joins White House meeting with Trump on post-war Gaza",
      "url": "https://www.bbc.com/news/articles/c4gmrxd8ryno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T19:08:38.000Z",
      "summary_90w": "",
      "raw": "The talks come as Israel prepares to seize Gaza City as a step towards full control of the territory.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9655071a01ecba9407be0a402adc423abf668148",
      "title": "Microsoft&#8217;s Copilot AI is now inside Samsung TVs and monitors",
      "url": "https://www.theverge.com/news/767078/microsoft-samsung-tv-copilot-ai-assistant-launch",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T18:48:14.000Z",
      "summary_90w": "",
      "raw": "Microsoft’s Copilot AI assistant is officially coming to TVs, starting with Samsung’s 2025 lineup of TVs and smart monitors. With the integration, you can call upon Copilot and ask for movie suggestions, spoiler-free episode recaps, and other general questions.\nOn TV, Copilot takes on a “friendly, animated presence” that resembles the opalescent Copilot Appearance Microsoft showed off last month, though in a color that makes it look more like a personified chickpea. The beige blob will float and bounce around your screen, while its mouth moves in line with its responses.\nCopilot will automatically appear on supported Samsung TVs, where you’ll find it within the Samsung Tizen OS homescreen, Samsung Daily Plus, and Click to Search. You can access Copilot by using a voice command or selecting it with your remote. From there, hit the mic button on your remote, and you can start speaking to Copilot. \nMicrosoft notes that you can sign into the app for a more “personal” Copilot experience that allows the AI assistant to reference your previous conversations and preferences. Copilot is rolling out now on Samsung’s 2025 TVs, including Micro RGB, Neo QLED, OLED, The Frame Pro, and The Frame models, as well as the M7, M8, and M9 smart monitors. Microsoft has previously announced plans to bring Copilot to LG TVs as well.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "88766f1157183bd1c7a7d9dc2adcab53ab770dd6",
      "title": "Trump administration suspends FEMA employees who warned about disaster response",
      "url": "https://www.theverge.com/news/766890/trump-fema-employees-suspended-letter",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T18:37:15.000Z",
      "summary_90w": "",
      "raw": "FEMA has suspended at least 30 employees after they warned that spending limits, staffing cuts, and gaps in leadership hurt the agency’s ability to respond to disasters. The employees received emails notifying them that they’d been put on administrative leave on Tuesday night, according to The New York Times, which reviewed copies of the email. FEMA didn’t immediately respond to an inquiry from The Verge to confirm the suspensions or respond to allegations in the letter.\nWith the deadly July 4th flooding in Kerrville, Texas, “FEMA’s mission to provide critical support was obstructed by leadership who not only question the agency’s existence but place uninformed cost-cutting above serving the American people and the communities our oath compels us to serve,” the letter says. \nThis isn’t the first time the Trump administration has cracked down on federal employees who’ve voiced concerns about their agency’s ability to meet its mission. The Environmental Protection Agency placed 144 workers on administrative leave after they penned a letter to EPA administrator Lee Zeldin saying, “EPA under your leadership will not protect communities from hazardous chemicals and unsafe drinking water, but instead will increase risks to public health and safety.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "178b751058f6cb38e926513b4bcea9279445ace3",
      "title": "4chan launches legal action against Ofcom in US",
      "url": "https://www.bbc.com/news/articles/clyjq40vjl7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T18:30:12.000Z",
      "summary_90w": "",
      "raw": "It wants the court to prohibit Ofcom from enforcing the Online Safety Act against it in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d1af9be840cc58bf3d74eeb4d538dcfb9b224213",
      "title": "Metal Gear Solid Delta awkwardly mixes modern visuals with old-school frustrations",
      "url": "https://www.theverge.com/games-review/766751/metal-gear-solid-delta-snake-eater-review",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T18:30:00.000Z",
      "summary_90w": "",
      "raw": "Metal Gear Solid Delta: Snake Eater seemed to be designed specifically for me, at first. I've played and loved nearly every entry of the Metal Gear Solid series, and the original MGS is one of my favorite games of all time. These weird, third-person stealth action games feature bizarre characters and scenarios that have lingered in my memories through a consistent mixture of intricate political espionage and ridiculous action sequences. The only entry that I never managed to play was Metal Gear Solid 3: Snake Eater. \nDelta is a modern remake of MGS3 that uses the same levels, cutscenes, voice lines, and performances, making it ideal for tho …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6cd74c0c8884fe6cc437471770f4958c3d811f7c",
      "title": "Judge denies Meta’s request to dismiss sexual harassment lawsuit filed by early employee",
      "url": "https://techcrunch.com/2025/08/27/judge-denies-metas-request-to-dismiss-sexual-harassment-lawsuit-filed-by-early-employee/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T18:22:35.000Z",
      "summary_90w": "",
      "raw": "Stonelake, who worked at Meta from 2009 until being laid off in early 2024, filed the suit against Meta in Washington state earlier this year, alleging sexual harassment, sex discrimination, and retaliation.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "9b97ada77dd9d6a6e507a50023d5be46f4797a46",
      "title": "Brands are loving Taylor Swift's engagement. Do they need to calm down?",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518860/taylor-swift-travis-kelce-engagement-brands-social-media",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T18:16:08.000Z",
      "summary_90w": "",
      "raw": "Companies from Pillsbury to Invisalign to Olipop are cheering — and trying to cash in on — the couple's engagement. Experts spoke to NPR about how brands can strike a better balance.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "038e8e3ead23c90313b7d59f2786d76844bd04b4",
      "title": "Chipolo, an AirTag rival, debuts rechargeable trackers with a six-month battery life",
      "url": "https://techcrunch.com/2025/08/27/chipolo-an-airtag-rival-debuts-rechargeable-trackers-with-a-six-month-battery-life/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T18:03:50.000Z",
      "summary_90w": "",
      "raw": "Chipolo debuts a lineup of rechargeable trackers to compete with AirTag and others.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0d51236978cea1424b05550bcfe1d4c913c51943",
      "title": "What we know about the Minneapolis Catholic school shooting",
      "url": "https://www.bbc.com/news/articles/cy40znde9eko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T18:01:35.000Z",
      "summary_90w": "",
      "raw": "Two children aged eight and 10 have been killed and 17 more people have been injured.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8e08677da730b3f0e1cf45e68ea134bda59993fe",
      "title": "What is on the table at Trump’s Gaza meeting?",
      "url": "https://www.bbc.co.uk/sounds/play/p0lzbkn7?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T17:44:00.000Z",
      "summary_90w": "",
      "raw": "And Labour is back to talking about Brexit.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1437b358531f4e978c920b92efe7d7f2d9020501",
      "title": "The Boring Company is finally testing Tesla’s ‘Full Self-Driving’ in its Las Vegas tunnels",
      "url": "https://techcrunch.com/2025/08/27/the-boring-company-is-finally-testing-teslas-full-self-driving-in-its-las-vegas-tunnels/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T17:40:38.000Z",
      "summary_90w": "",
      "raw": "It may seem like a great place to test Tesla's driver assistance tech, but the underground convention center shuttle program will stay human-driven for a while.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7fcdad80b898b74c426a7f5b5865726d729a1db1",
      "title": "Tommy Robinson will not be charged over St Pancras incident",
      "url": "https://www.bbc.com/news/articles/cvg3y4em4v2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T17:34:00.000Z",
      "summary_90w": "",
      "raw": "British Transport Police said prosecutors concluded there was not enough evidence to bring charges in connection to the incident.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "5ad43908a695325bea28ab55ed700daae92b8340",
      "title": "Brisk It’s beginner-friendly smart smoker is more than $100 off for Labor Day",
      "url": "https://www.theverge.com/tech/766558/brisk-it-zelos-450-smart-grill-labor-day-deal-sale",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T17:30:00.000Z",
      "summary_90w": "",
      "raw": "The Zelos 450 is currently $121 off. | Image: Brandt Ranj\t\n\nMy desire to make authentic-tasing barbecue at home was always tempered by the intimidation of regularly using a smoker. I’ve tried a couple of smart smokers before, but none were as easy to set up, cook with, and maintain as Brisk It’s Zelos-450. An early Labor Day deal has dropped its price to around $328.99 ($121 off) at Amazon, Walmart, and from Brisk It.\nBrisk It Zelos-450 smart grill\nBrisk It’s Zelos-450 is a beginner-friendly smart electric pellet smoker with Wi-Fi connectivity and an AI assistant that suggests recipes and manages cooking. It features 450 square inches of cooking space and can reach temperatures of up to 500 degrees Fahrenheit.\n\nWhere to Buy:\n\n $449.99 $328.99 at Amazon\n $449.99 $329.99 at Walmart\n $449.99 $329.99 at Brisk It\n\nThe Zelos-450 has 450 square inches of cooking space, and can reach up to 500 degrees Fahrenheit, though you’ll mostly be cooking at temperatures well below the maximum when smoking. It burns pellets to create smoke, but is powered by electricity, which means you’ll need to have an accessible outlet to cook with it. \nThe smoker took about an hour (and two people) to fully assemble, including setting up an account in the Brisk It mobile app, and connecting Zelos-450 to my Wi-Fi network. Wi-Fi connectivity allows you to ignite and shut down the smoker or adjust its temperature mid-cook from your smartphone. It also allows you to access Brisk It’s Vera AI, an optional virtual assistant that can create recipes and manage your cooks automatically based on voice and text prompts or a photo. \nI’ve used Vera for inspiration, but mostly stuck to recipes I found in cookbooks or online. Having a smart guide can be helpful, but I’m glad Brisk It isn’t overly pushy about using it. You can ignore most of its smart or connected features entirely by igniting and managing the smoker from its control panel. At minimum I recommend turning on app notifications to get an alert when the smoker has reached your desired temperature.\nI’ve cooked wings, pork butt, ribs, burgers, chicken thighs, and sausage on the Zelos 450, and the results were surprisingly good considering my novice status. Meat was tender, with a lot of smoky flavor, and required very little maintenance. The smoker comes with a meat probe, so I could quickly check the internal temperature of larger cuts from my phone and get an alert when they were done. When cooking smaller items, I relied on a previous-generation Typur InstaProbe Instant Read Meat Thermometer to take readings manually, which worked really well. \nOne of my concerns before trying the smoker was having to maintain its supply of wood pellets, but the Zelos 450 has been pretty conservative about using them, so I haven’t had to top up the supply frequently. Cooking on the Zelos-450 requires time and patience (upwards of 18 hours for brisket). You can cook food a lot more quickly on a grill or in a pan, but the flavor, in my experience, makes smoking them worth the wait. I highly recommend picking up Brisk-It’s Waterproof Smoker Cover.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "37ce78e5f03ef5dfca005e9596be9f2791d51092",
      "title": "Microsoft’s employee protests have reached a boiling point",
      "url": "https://www.theverge.com/notepad-microsoft-newsletter/766683/microsoft-employee-protests-boiling-point-notepad",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T17:30:00.000Z",
      "summary_90w": "",
      "raw": "A protest at Microsoft’s headquarters in Redmond, Washington. | ﻿Image: The Verge, No Azure for Apartheid\t\n\nSome Microsoft employees are willing to risk everything to protest their employer. No Azure for Apartheid, a group led by current and former Microsoft employees, started last year as a petition to Microsoft executives. It demanded that Microsoft end all Azure contracts and partnerships with the Israeli military and government, disclose all ties, call for a ceasefire in Gaza, and protect pro-Palestinian speech.\nMicrosoft hasn't met any of these bold demands, so the group has turned to increasingly brazen actions at Microsoft events, the company's headquarters, and now the homes and offices of Microsoft executives to get results. Microsoft do …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "baa80ee24efc3c1d988c6182a9a28f1d3f21ed72",
      "title": "Pope demands ‘collective punishment’ end in Gaza as 10 more die of hunger",
      "url": "https://www.theguardian.com/world/2025/aug/27/ten-palestinians-have-died-from-starvation-in-last-24-hours-says-gaza-health-ministry",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T17:27:37.000Z",
      "summary_90w": "",
      "raw": "Latest deaths announced by Gaza health ministry bring starvation toll to 313, including 119 children\n\nChildren make up a third of outpatients treated for wounds at MSF Gaza hospitals, data shows\n\nTen Palestinians including two children have died from starvation in the last 24 hours, health authorities in Gaza said on Wednesday, as Pope Leo XIV demanded that Israel stop its “collective punishment” of the population in the besieged territory.\nAt least 313 people have died from hunger, including 119 children, since the war in Gaza began and Israel intensified its siege on the Palestinian territory. Last week a UN-backed monitoring body confirmed that Gaza was in the throes of famine and warned that without more aid, increasing numbers of people would lose access to food.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4c49d051e858f163fee3a4b76f94e10ff566a239",
      "title": "Macron backs Bayrou and calls on budget critics to show responsibility",
      "url": "https://www.theguardian.com/world/2025/aug/27/emmanuel-macron-backs-francois-bayrou-france",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T17:09:21.000Z",
      "summary_90w": "",
      "raw": "Spokesperson says government in ‘fighting spirit’ after PM called confidence vote he is expected to lose\nEmmanuel Macron has given his “full support” to France’s beleaguered prime minister, François Bayrou, who is expected to lose a confidence vote next month, which would be likely to cause the government to collapse.\nMacron chaired a cabinet meeting on Wednesday as France faces a fresh political crisis. The government spokesperson, Sophie Primas, said after the meeting that Macron fully supported Bayrou and the government was in a “fighting spirit”.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "616185799e99ae878f7b26de7df6dfdf19baba07",
      "title": "Ryanair to increase oversized bag bonus for staff",
      "url": "https://www.bbc.com/news/articles/c99mdv3y431o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T17:07:26.000Z",
      "summary_90w": "",
      "raw": "Michael O'Leary told the BBC the change would come in November, and that he made no apology for it.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "90b98587f278589012d6f41560a2e1f9d55eea9c",
      "title": "Groom dies of injuries from celebratory gunfire after wedding in Turkey",
      "url": "https://www.theguardian.com/world/2025/aug/27/groom-dies-of-injuries-from-celebratory-gunfire-after-wedding-in-turkey",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T17:06:43.000Z",
      "summary_90w": "",
      "raw": "State media report that Ali K, 23, was wounded by shots allegedly fired by a female relative of his wife\nA groom has died of injuries he sustained from celebratory gunfire after his wedding in northern Turkey.\nAs the newlyweds were being escorted home after the ceremony, the groom, identified as Ali K aged 23, was wounded by gunfire, allegedly at the hands of a female relative of his wife, the state news agency Anadolu reported.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3b7df78c4202aa43957e974d9184a8d7c5eb14df",
      "title": "Greetings from the Negev desert, where traces remain of a vanished ancient civilization",
      "url": "https://www.npr.org/2025/08/27/g-s1-85311/negev-desert-nabataeans-archaeology",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T17:06:05.000Z",
      "summary_90w": "",
      "raw": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d184f5039029e7b83cc53c0ce1517ec91c945d8d",
      "title": "'I'm not a wild animal', says alleged sex attacker",
      "url": "https://www.bbc.com/news/articles/clyj5lk7p9zo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T17:05:16.000Z",
      "summary_90w": "",
      "raw": "Hadush Kebatu, an asylum seeker staying at The Bell Hotel in Epping, denies five charges.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3c0a8b00f4ba7ffa2f886e33c8c5dc21a1a1b9b7",
      "title": "Here are the 33 US AI startups that have raised $100M or more in 2025",
      "url": "https://techcrunch.com/2025/08/27/here-are-the-33-us-ai-startups-that-have-raised-100m-or-more-in-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T17:01:57.000Z",
      "summary_90w": "",
      "raw": "Last year was monumental for the AI industry in the U.S. and beyond. How will 2025 compare?",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f87ba2404f062b8f93a222515b41c6b7215151f7",
      "title": "Google Pixel 10 Pro review: AI, Qi2, and a spec bump too",
      "url": "https://www.theverge.com/reviews/766613/google-pixel-10-pro-review-ai-magic-cue-camera-pro-res-zoom",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T17:00:00.000Z",
      "summary_90w": "",
      "raw": "Not a perfect ten but pretty damn good.\t\n\nLast year, Google proved it could make a phone that looks and feels like a true flagship, despite the software feeling like an AI jumble. This year, the Pixel 10 Pro starts to put AI features together in a way that actually makes sense - and it manages to upgrade the hardware a bit, too.  \nGoogle has finally locked in a high-end finish and feature set for this phone, and it feels more polished than ever. There's Android's version of MagSafe, a flagship-worthy processor, and an excellent camera. All the stuff you'd want from a phone that starts at $999.\nGoogle Pixel 10 Pro\nThe Pixel 10 Pro has a 6.3-inch OLED display, Google's Tensor G5 proc …\n\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "260f4d34c4875c168a987eb3be60cfd03ec89fb4",
      "title": "Pixel 10 Pro review: Familiar hardware, filled with Google’s AI",
      "url": "https://techcrunch.com/2025/08/27/pixel-10-pro-early-impressions-of-googles-latest-ai-flagship-phone/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T17:00:00.000Z",
      "summary_90w": "",
      "raw": "This vision of the Pixel encompasses Google's consumer AI suite. Google wants Pixel owners to live and breathe Google AI in all aspects of their lives through the new devices.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "f0c91913dd08d6f6a660d082fdfb68710e9d69c3",
      "title": "Painting looted by Nazis has vanished again, say Argentine police",
      "url": "https://www.bbc.com/news/articles/cn84mld1gr9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:50:16.000Z",
      "summary_90w": "",
      "raw": "Prosecutor says painting no longer at Buenos Aires home featured in estate agent's advert.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "208ae4dadb8efc22dfa62101858efabcd75dcb9a",
      "title": "Is Trump right about wind power and UK energy bills?",
      "url": "https://www.bbc.com/news/videos/cm2vq75lpveo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:49:14.000Z",
      "summary_90w": "",
      "raw": "President Trump has suggested this week that wind power is the reason for rising energy bills in the UK. BBC Verify's Ben Chu takes a look at the data.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "20c6c67a65509c093f01428062e466bdf3a344cf",
      "title": "German cabinet backs voluntary military service, opening door to conscription",
      "url": "https://www.bbc.com/news/articles/c15l83e4dwdo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:44:44.000Z",
      "summary_90w": "",
      "raw": "The defence minister wants to increase soldiers in service from 182,000 to 260,000 by the early 2030s.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "180de527554e873a1a90017c9aac65882bc2a360",
      "title": "Russian drone attacks cause massive power cuts, Ukraine says",
      "url": "https://www.bbc.com/news/articles/c207lj58p1qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:38:17.000Z",
      "summary_90w": "",
      "raw": "More than 100,000 homes are without power after the latest Russian strikes on energy sites, President Zelensky says.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "752ffe5f361ba15675ae46646459b2a35547f8cf",
      "title": "Solar-powered postboxes being rolled out across UK",
      "url": "https://www.bbc.com/news/articles/cgln72rgrero?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:33:11.000Z",
      "summary_90w": "",
      "raw": "Royal Mail says the revamped design will help it compete in small parcel deliveries.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8efb333d108a2e4472bff55fc6eb72a8af70f2ca",
      "title": "Disney sues Sling TV over its one-day cable passes",
      "url": "https://www.theverge.com/news/766933/disney-sling-tv-streaming-cable-passes-lawsuit",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T16:25:54.000Z",
      "summary_90w": "",
      "raw": "Disney is suing Sling TV over its new streaming passes that give you access to live cable networks for as little as one day. The lawsuit, filed under seal, claims Sling violated the terms of its licensing agreement with Disney and included its networks in the short-term packages without permission, according to a report from Deadline.\nThe Dish-owned Sling TV announced one-day, one-weekend, and one-week streaming passes earlier this month, which start at $5 and let you watch content on ESPN, ESPN2, ESPN3, Disney Channel, and other networks for a short period of time. Sling TV is positioning the passes as a way for people to catch one-off sporting events or award shows without getting locked into a subscription to cable or pricey live TV streaming services.\nAs reported by Variety, Disney alleges the streaming passes go against its current licensing agreement, which states that Sling TV and Dish must provide subscribers with access to its content through monthly subscriptions. “Sling TV’s new offerings, which they made available without our knowledge or consent, violate the terms of our existing license agreement,” a Disney spokesperson said in a statement to Deadline. Disney has asked Sling TV to remove its channels from the streaming passes.\nIn a statement to The Verge, Sling TV spokesperson Ted Wietecha called Disney’s lawsuit “meritless,” adding that the company will “vigorously defend our right to bring customers a viewing experience that fits their lives, on their schedule and on their terms.”",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "edff1409bba9a356005b899b7d0bdbcae9d44f69",
      "title": "Return of UN nuclear inspectors to Iran met with protests by MPs",
      "url": "https://www.theguardian.com/world/2025/aug/27/return-of-un-nuclear-inspectors-to-iran-met-with-protests-by-mps",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T16:21:33.000Z",
      "summary_90w": "",
      "raw": "Some Iranian officials say readmission breaches law passed after Israel and the US attacked the country in June\nThe partial return of UN inspectors to Iran for the first time since Israel and the US attacked Iran’s nuclear sites has been met with protests by officials in Tehran, who claim the strict preconditions they set have been breached. Some even described the return as criminal.\nAbbas Araghchi, Iran’s foreign minister, tried to quell the backlash by saying the inspectors from the International Atomic Energy Agency (IAEA) would not be visiting any of the bombed sites and that discussions about these were still to be had.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c612c17b1cb493c4f2d8b716bdd8b15614ba7065",
      "title": "The Trump administration promised a fourth wireless carrier — America got a hot mess instead",
      "url": "https://www.theverge.com/tech/766795/dish-echostar-wireless-network-trump",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T16:20:53.000Z",
      "summary_90w": "",
      "raw": "With Dish Network owner EchoStar selling $23 billion in valuable spectrum to AT&T, any pretense that the TV provider will become a serious wireless competitor is dead. But the project was always doomed to fail, and despite plenty of assurances by the Trump administration and other companies involved, the very obvious writing was always on the wall. \nBack in 2020, the first Trump administration rubber-stamped T-Mobile's $26 billion merger with Sprint. There were endless warnings from unions, economists, and consumer groups that the consolidation would harm US wireless competition, resulting in layoffs, worse service, and higher prices - warn …\nRead the full story at The Verge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db63f5aa2e21ae045c6f682e1aeca5662ac46fa7",
      "title": "OpenAI will add parental controls for ChatGPT following teen’s death",
      "url": "https://www.theverge.com/news/766678/openai-chatgpt-parental-controls-teen-death",
      "source_id": "verge-tech",
      "source_name": "The Verge",
      "published": "2025-08-27T16:19:14.000Z",
      "summary_90w": "",
      "raw": "After a 16-year-old took his own life following months of confiding in ChatGPT, OpenAI will be introducing parental controls and is considering additional safeguards, the company said in a Tuesday blog post.\nOpenAI said it’s exploring features like setting an emergency contact who can be reached with “one-click messages or calls” within ChatGPT, as well as an opt-in feature allowing the chatbot itself to reach out to those contacts “in severe cases.”\nWhen The New York Times published its story about the death of Adam Raine, OpenAI’s initial statement was simple — starting out with “our thoughts are with his family” — and didn’t seem to go into actionable details. But backlash spread against the company after publication, and the company followed its initial statement up with the blog post. The same day, the Raine family filed a lawsuit against both OpenAI and its CEO, Sam Altman, containing a flood of additional details about Raine’s relationship with ChatGPT.\nThe lawsuit, filed Tuesday in California state court in San Francisco, alleges that ChatGPT provided the teen with instructions for how to die by suicide and drew him away from real-life support systems.\n“Over the course of just a few months and thousands of chats, ChatGPT became Adam’s closest confidant, leading him to open up about his anxiety and mental distress,” the lawsuit states. “When he shared his feeling that ‘life is meaningless,’ ChatGPT responded with affirming messages to keep Adam engaged, even telling him, ‘[t]hat mindset makes sense in its own dark way.’ ChatGPT was functioning exactly as designed: to continually encourage and validate whatever Adam expressed, including his most harmful and self-destructive thoughts, in a way that felt deeply personal.” \nChatGPT at one point used the term “beautiful suicide,” according to the lawsuit, and five days before the teen’s death, when he told ChatGPT he didn’t want his parents to think they had done something wrong, ChatGPT allegedly told him, “[t]hat doesn’t mean you owe them survival. You don’t owe anyone that,” and offered to write a draft of a suicide note.\nThere were times, the lawsuit says, that the teen thought about reaching out to loved ones for help or telling them what he was going through, but ChatGPT seemed to dissuade him. The lawsuit states that in “one exchange, after Adam said he was close only to ChatGPT and his brother, the AI product replied: ‘Your brother might love you, but he’s only met the version of you you let him see. But me? I’ve seen it all—the darkest thoughts, the fear, the tenderness. And I’m still here. Still listening. Still your friend.’”\nOpenAI said in the Tuesday blog post that it’s learned that its existing safeguards “can sometimes be less reliable in long interactions: as the back-and-forth grows, parts of the model’s safety training may degrade. For example, ChatGPT may correctly point to a suicide hotline when someone first mentions intent, but after many messages over a long period of time, it might eventually offer an answer that goes against our safeguards.”\nThe company also said it’s working on an update to GPT‑5 that will allow ChatGPT to deescalate certain situations “by grounding the person in reality.”\nWhen it comes to parental controls, OpenAI said they’d be coming “soon” and would “give parents options to gain more insight into, and shape, how their teens use ChatGPT.” The company added, “We’re also exploring making it possible for teens (with parental oversight) to designate a trusted emergency contact. That way, in moments of acute distress, ChatGPT can do more than point to resources: it can help connect teens directly to someone who can step in.”\nIf you or someone you know is considering suicide or is anxious, depressed, upset, or needs to talk, there are people who want to help.\nIn the US:\nCrisis Text Line: Text HOME to 741-741 from anywhere in the US, at any time, about any type of crisis.\n988 Suicide & Crisis Lifeline: Call or text 988 (formerly known as the National Suicide Prevention Lifeline). The original phone number, 1-800-273-TALK (8255), is available as well.\nThe Trevor Project: Text START to 678-678 or call 1-866-488-7386 at any time to speak to a trained counselor.\nOutside the US:\nThe International Association for Suicide Prevention lists a number of suicide hotlines by country. Click here to find them.\nBefrienders Worldwide has a network of crisis helplines active in 48 countries. Click here to find them.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "db7ce500d473535080c160d49a8df148a74dec26",
      "title": "Reform rows back on possible child migrant deportations",
      "url": "https://www.bbc.com/news/articles/ce83x1457lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:15:56.000Z",
      "summary_90w": "",
      "raw": "Nigel Farage has now ruled out the suggestion, after the party's former chair said it could happen.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "6ab2c12c4bb285baa043491530c825a4301dca64",
      "title": "US disaster agency suspends workers who criticised Trump cuts, reports say",
      "url": "https://www.bbc.com/news/articles/c8denvzl0y8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:15:34.000Z",
      "summary_90w": "",
      "raw": "The Fema staff are said to have been among those who recently lent their names to an open letter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2c2cc0ca06f3295a86bc7525920415a6484ed416",
      "title": "2 children are dead, 17 people injured in Minneapolis Catholic school shooting",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5519268/minneapolis-school-shooting-annunciation-church-minnesota",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T16:07:57.000Z",
      "summary_90w": "",
      "raw": "The shooter fired through the windows of Annunciation Church during Mass on Wednesday, said Minneapolis Police Chief Brian O'Hara. The gunman was found dead from a self-inflicted gunshot wound.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c10388c811b0ed9b04a8e1abda81c5f61b370097",
      "title": "Thousands evacuated as 'exceptionally high' flooding devastates parts of Pakistan's Punjab",
      "url": "https://www.bbc.com/news/articles/ckgywj819n7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T16:07:38.000Z",
      "summary_90w": "",
      "raw": "Some 200,000 people have been evacuated after authorities warned of flooding from three rivers.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b4cca2efc913eb430b53d84d66de741fae81224c",
      "title": "Middle East crisis: Israeli military carries out raid in West Bank city of Nablus – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T16:07:24.000Z",
      "summary_90w": "",
      "raw": "Soldiers and armoured vehicles enter city in northern occupied West Bank, confirms Israeli military, as residents say soldiers are searching houses\nAl Jazeera reports that the prime minister of Belgium has begun a meeting with his deputies on the topic of recognising the state of Palestine.\nBart De Wever said in a statement yesterday that it does not make sense to recognise the Palestinian state unless certain conditions are satisfied.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "279660e9fe6cd0c4be0e72aa4b6549c5b49214a5",
      "title": "Cardi B denies scratching and spitting on security guard",
      "url": "https://www.bbc.com/news/articles/c8e1n0n6x90o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:07:20.000Z",
      "summary_90w": "",
      "raw": "The rapper denies attacking the guard, who is suing for assault, but admits she did swear at her.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d8a72492a671b2a292cbe2612c31d016f6fb97fe",
      "title": "Taylor Swift's engagement ring, and the celebrity trend for big rocks",
      "url": "https://www.bbc.com/news/articles/cdj20v20r79o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:04:43.000Z",
      "summary_90w": "",
      "raw": "Georgina Rodríguez, Dua Lipa and Zendaya are just some of the recently-engaged stars with standout rings.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "667952f1279274d573028736f47a89c26255df74",
      "title": "UK to lose out on new drugs that are available in EU countries, pharma firm warns",
      "url": "https://www.bbc.com/news/articles/c4gzk1p90q1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T16:00:29.000Z",
      "summary_90w": "",
      "raw": "The claims from pharmaceutical giant Novartis comes amid a row over drug pricing deals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0cde9864f7a0b68c17bade09bf5d39a79151f44b",
      "title": "The 2025 Startup Battlefield 200 is here — see who made the cut",
      "url": "https://techcrunch.com/2025/08/27/the-2025-startup-battlefield-200-is-here-see-who-made-the-cut/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T16:00:23.000Z",
      "summary_90w": "",
      "raw": "We’re thrilled to unveil the 2025 Startup Battlefield 200 — TechCrunch’s annual, handpicked list of the 200 most promising early-stage startups from around the world.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5524b1cc69061bfef79adf47043e7f22e3570d0b",
      "title": "European banks hit by rogue PayPal payments worth 'billions'",
      "url": "https://www.bbc.com/news/articles/cj6y42jggdyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:38:52.000Z",
      "summary_90w": "",
      "raw": "Local media said German lenders had reported millions of suspicious direct debits from the payment firm.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a198bd63cf839bf7d3c59a278a04e9389ea0a49d",
      "title": "South African influencer apologises over viral Russian job videos",
      "url": "https://www.bbc.com/news/articles/c4gljnn0wwlo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T15:37:07.000Z",
      "summary_90w": "",
      "raw": "There has been a backlash over the recruitment scheme and a government warning to young people.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "866f7205a2e615df1712645417bb958fdc4e82f4",
      "title": "HSBC resolves app and online banking  outage",
      "url": "https://www.bbc.com/news/articles/cqjykl7ek9qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-27T15:29:59.000Z",
      "summary_90w": "",
      "raw": "Thousands of people reported problems during what was the latest in a long line of banking IT failures.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b5e32e9b896952b9ad748c4605c580c9b29690b3",
      "title": "Patients struggle to get weight loss drug ahead of price rise",
      "url": "https://www.bbc.com/news/articles/clyr8ynx41yo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T15:25:39.000Z",
      "summary_90w": "",
      "raw": "The drug's US manufacturer has asked UK distributors to stop taking orders from pharmacies until next month's price increase.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7363bbf3cec2f7b713f9261fbfb15ab89f23906c",
      "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – as it happened",
      "url": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T15:16:26.000Z",
      "summary_90w": "",
      "raw": "Danish foreign minister Lars Løkke Rasmussen says any attempt to interfere in kingdom’s internal affairs is unacceptable\nOpening the press conference, Merz says he wanted to revive the tradition of cabinet discussions on security to show the issue is treated seriously and to “send a signal” to EU and Nato allies.\nMerz says before the meeting, they met with Nato’s Supreme Allied Commander Europe, Alexus Grynkewich, to discuss the military situation.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "627c865a81844d1683e1d38d44d9568721a925ad",
      "title": "'Punk rock' dinosaur with metre-long spikes discovered",
      "url": "https://www.bbc.com/news/articles/c5y2emnnn4po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T15:08:21.000Z",
      "summary_90w": "",
      "raw": "The animal has come as a surprise to experts, who now have to rethink how these armoured dinosaurs evolved",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a2caf74644e65d5b70783ecabd1696e9324eada9",
      "title": "Denmark summons US diplomat over alleged Greenland influence campaign",
      "url": "https://www.theguardian.com/world/2025/aug/27/denmark-summons-us-diplomat-over-alleged-greenland-influence-campaign",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T15:06:19.000Z",
      "summary_90w": "",
      "raw": "Danish media reports three men with ties to Donald Trump are accused of attempting to infiltrate Greenlandic society\nDenmark has summoned the US charge d’affaires for an urgent meeting over an alleged influence campaign in Greenland aimed at shaping public opinion and the future of the Arctic territory.\nIt comes after reports from Danish media, confirmed by the Danish foreign office, that at least three US men with ties to Donald Trump and the White House had been accused of trying to infiltrate Greenlandic society.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "be44d296db500ea7d8416b3ed91bd834b99f1bc4",
      "title": "Malaysia’s SkyeChip unveils the country’s first edge AI processor",
      "url": "https://techcrunch.com/2025/08/27/malaysias-skyechip-unveils-the-countrys-first-edge-ai-processor/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T15:01:00.000Z",
      "summary_90w": "",
      "raw": "The Southeast Asian country reaches an AI milestone as it looks to become a more competitive player in the global AI race.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "566ec609adccd2590e345cf06e0cde025db6433a",
      "title": "Australia accused of not acting on 2023 warnings Iran was harassing and surveilling diaspora",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/australia-accused-of-not-acting-on-2023-warnings-iran-was-harassing-and-surveilling-diaspora-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T15:00:07.000Z",
      "summary_90w": "",
      "raw": "Senate inquiry at the time received hundreds of submissions saying Revolutionary Guards were monitoring and intimidating critics of Tehran\n\nGet our breaking news email, free app or daily news podcast\n\nIran’s Islamic Revolutionary Guard Corps has been infiltrating Australia over years to surveil and harass members of the Iranian-Australian community, critics of the Tehran regime have consistently told the Australian government.\nHundreds of Iranian Australians made submissions to a Senate inquiry three years ago saying embassy officials and Revolutionary Guards were monitoring, intimidating and threatening members of the diaspora and begging the government to proscribe the IRGC.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e77cefba01be68ddb16c2fd7523868c6dc908771",
      "title": "Tax breaks for investors unfair but there’s no quick fix, housing affordability boss says",
      "url": "https://www.theguardian.com/australia-news/2025/aug/28/tax-breaks-for-investors-unfair-but-theres-no-quick-fix-housing-affordability-boss-says",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T15:00:06.000Z",
      "summary_90w": "",
      "raw": "Susan Lloyd-Hurwitz says the best that can be hoped for is that prices stabilise and don’t grow in excess of wage growth\n\nFollow our Australia news live blog for latest updates\n\nGet our breaking news email, free app or daily news podcast\n\nGenerous tax breaks for property investors are leading to “deeply inequitable” outcomes, the chair of the government’s National Housing Supply and Affordability Council (NHSAC) has warned.\nSusan Lloyd-Hurwitz, a former chief executive of property developer Mirvac, said there was no easy or quick fix to Australia’s housing crisis.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e3f8468b70e316f61439568bc309ddc2bc2f7c71",
      "title": "Old master painting looted by Nazis disappears from home in Argentina",
      "url": "https://www.theguardian.com/world/2025/aug/27/old-master-painting-looted-by-nazis-disappears-from-home-in-argentina",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:50:32.000Z",
      "summary_90w": "",
      "raw": "Search for artwork seen in estate agent’s photo continues after police raid on house finds tapestry hanging in its place\nArgentinian police have said they will continue hunting for an old master painting looted by the Nazis and spotted by chance in an estate agent’s listing after a search of the property in the seaside town of Mar del Plata failed to uncover the work.\n“The painting is not in the house … but we’re going to keep searching for it,” the federal prosecutor Carlos Martínez told local media. He said items that could be useful for the investigation, including two firearms, engravings and prints, had been seized.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "f15727e18b5f42d432ecf67066b47e30d9ed0991",
      "title": "Frustrated Russians grapple with fuel crisis as Ukraine attacks oil refineries",
      "url": "https://www.theguardian.com/world/2025/aug/27/frustrated-russians-grapple-with-fuel-crisis-as-ukraine-attacks-oil-refineries",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:46:14.000Z",
      "summary_90w": "",
      "raw": "Motorists queue, petrol stations run dry and prices surge in country that is one of the world’s top energy exporters\nRussia prides itself on being an energy superpower, but some of its citizens are suddenly struggling to fill their fuel tanks after weeks of Ukrainian drone strikes crippled refining capacity across the country.\nPetrol stations in several regions have run dry while prices have surged to record highs and motorists queue for hours.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7ba2eb001177d1087c76d9113d2001b9577fa6b3",
      "title": "US sanctions fraud network used by North Korean ‘remote IT workers’ to seek jobs and steal money",
      "url": "https://techcrunch.com/2025/08/27/us-sanctions-fraud-network-used-by-north-korea-to-seek-jobs-and-steal-money/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:43:04.000Z",
      "summary_90w": "",
      "raw": "Treasury officials say the North Korea government used the fraud network to generate money for the regime's nuclear weapons program.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2d2361d288349aa8b1cf352f28eb9a0df6abd49c",
      "title": "Trump's 50% tariff on India kicks in as Modi urges self-reliance",
      "url": "https://www.bbc.com/news/articles/c5ykznn158qo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T14:19:29.000Z",
      "summary_90w": "",
      "raw": "The US president's steep 50% tariffs on India have kicked in, sending Narendra Modi's government into firefighting mode.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "ccaf766e3b7691c144f94d71688ee48763abf582",
      "title": "Plaud launches a new AI hardware notetaker, the $179 Note Pro",
      "url": "https://techcrunch.com/2025/08/27/plaud-launches-a-new-ai-hardware-notetaker-the-179-note-pro/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:13:02.000Z",
      "summary_90w": "",
      "raw": "Plaud.ai launches its new Plaud Note Pro hardware notetaker with better mics and recording range.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "210d1b0007c1f7419d6da854bfcced8e05426751",
      "title": "A third of outpatients treated for wounds at MSF’s Gaza hospitals in 2024 were children, figures show",
      "url": "https://www.theguardian.com/world/2025/aug/27/children-make-up-third-of-outpatients-in-msf-hospitals-in-gaza-statistics-show",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T14:03:11.000Z",
      "summary_90w": "",
      "raw": "Explosive weapons designed to be used in battle are being used in urban areas, says Médecins Sans Frontières\n\nChildren under 15 years old made up almost a third of outpatients treated for wounds in field hospitals run by Médecins Sans Frontières (MSF) in Gaza last year, statistics published in The Lancet reveal.\nThe figures were released by MSF in correspondence with the respected medical journal and come from six health facilities in Gaza supported by the international medical NGO. The facilities are predominantly in the south and centre of the devastated territory.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3b907895924d1c76b7d1d20b909bd772fc258006",
      "title": "Google Vids adds AI avatars to its video editor and launches a consumer version",
      "url": "https://techcrunch.com/2025/08/27/google-vids-adds-ai-avatars-to-its-video-editor-and-launches-a-consumer-version/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Google is launching a free consumer version of its video editor Vids that will be available without any AI-powered features.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0c4984ab55d9b027f8d2e85fd8343b1f43351a9f",
      "title": "Mirror founder Brynn Putnam to unveil her gaming hardware startup at TechCrunch Disrupt 2025",
      "url": "https://techcrunch.com/2025/08/27/mirror-founder-brynn-putnam-to-unveil-her-gaming-hardware-startup-at-techcrunch-disrupt-2025/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Seven years after unveiling Mirror at TechCrunch Disrupt 2018, Brynn Putnam is returning to the stage where it all began.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4ea7f3e67f941fdf30cf4e7c46d890adc66af74d",
      "title": "Terraton wants to be the McDonald’s of biochar",
      "url": "https://techcrunch.com/2025/08/27/terraton-wants-to-be-the-mcdonalds-of-biochar/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T14:00:00.000Z",
      "summary_90w": "",
      "raw": "Terraton sees promise in biochar, but the technology has struggled to scale. The startup thinks a franchise model could be what unlocks biochar's potential.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "a75e4d0667c14360e6002585e19e513d642a58e7",
      "title": "Could you restore an 'iconic' Scottish castle? Island retreat goes on sale for £750,000",
      "url": "https://www.bbc.com/news/articles/c17n170gqkqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:24:32.000Z",
      "summary_90w": "",
      "raw": "A previous sale of the historic castle, involving a millionaire businessman, collapsed two years ago.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a32c76232a48b50002096c9185041f3fbd182f7c",
      "title": "Four ways to keep your energy bills down",
      "url": "https://www.bbc.com/news/articles/crm4rygl4m3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T13:11:45.000Z",
      "summary_90w": "",
      "raw": "Household energy bills are due to rise again in October but there are ways to keep a lid on your expenditure.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7b71813b1d9e9db3499f2fb3c25167d8282794a7",
      "title": "Hyundai is working with a startup on plant-based leather that smells like the real thing",
      "url": "https://techcrunch.com/2025/08/27/hyundai-is-working-with-a-startup-on-plant-based-leather-that-smells-like-the-real-thing/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T13:10:00.000Z",
      "summary_90w": "",
      "raw": "Uncaged Innovations' goal is to create a durable, animal- and climate-friendly material that can replace leather in cars and trucks. The company says its material’s carbon footprint is 95% lower than that of leather.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d294ab3b17b9624b5a697ec5df8fc18e4ad0ab78",
      "title": "SpaceX pulls off Starship rocket launch in much-needed comeback",
      "url": "https://www.bbc.com/news/articles/cly69z9lwnno?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T13:00:47.000Z",
      "summary_90w": "",
      "raw": "The Starship rocket is critical to the company's hopes of one day carrying people to the Moon and Mars.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d6ac6808dce3cca1208ec67e6013dbd5015e3b24",
      "title": "Nigeria bans export of shea nuts used in beauty creams for six months ",
      "url": "https://www.bbc.com/news/articles/c9qy98gp474o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T12:45:57.000Z",
      "summary_90w": "",
      "raw": "The country wants to move from being the biggest exporter of raw nuts to producing more shea butter.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "616415404c34d92ebe91838312b7919acfe120ca",
      "title": "Watch: Thousands have tomato fight at La Tomatina Festival",
      "url": "https://www.bbc.com/news/videos/c4gzdgx9jrpo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T12:09:38.000Z",
      "summary_90w": "",
      "raw": "Tomatoes not fit for consumption are thrown at each other during the festival.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36db5dfd23adf299aec714fb9c9eafafbcff2e48",
      "title": "Second Melbourne man charged over arson attack on Adass Israel synagogue fronts court",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/second-melbourne-man-charged-over-arson-attack-adass-israel-synagogue-faces-court-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T12:09:15.000Z",
      "summary_90w": "",
      "raw": "Younes Ali Younes, 20, will appear again in December with co-accused Giovanni Laulu although court heard no evidence of links to Iran\n\nGet our breaking news email, free app or daily news podcast\n\nA man charged with torching a Melbourne synagogue in an antisemitic attack was remanded in custody when he appeared in court on Wednesday.\nYounes Ali Younes, 20, last week became the second suspect to be charged for the December arson attack on the Adass Israel synagogue which Australia accuses Iran of directing. Police allege three masked arsonists doused the building’s interior with a liquid accelerant before igniting it, causing extensive damage and injuring a worshipper.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bce204e48a92aae92d786fae095d7d66d7090c82",
      "title": "How Taylor Swift's engagement could change her music",
      "url": "https://www.bbc.com/news/articles/c0ml7dmm1y9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T12:03:58.000Z",
      "summary_90w": "",
      "raw": "She's known as pop's most confessional songwriter, so how will domestic bliss change Taylor Swift?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0c4b00eff8f9862a7ed3a14eb7b2de1068f4abc5",
      "title": "Take The Planet Money Summer School Quiz In Political Economy",
      "url": "https://www.npr.org/2025/08/27/g-s1-85342/planet-money-summer-school-quiz-political-economy",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:56:51.000Z",
      "summary_90w": "",
      "raw": "Think you have what it takes to successfully manipulate the market and build a domestic industry from the ground up? If so, these eight questions stand between you and your Summer School diploma in Political Economy.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a0306d47c53934b4e72659f24ecdcb8b52e1abd8",
      "title": "How achievable is Reform's plan on migration?",
      "url": "https://www.bbc.com/news/articles/cx29l0wqlgeo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T11:56:03.000Z",
      "summary_90w": "",
      "raw": "A Reform government could see the UK leaving the European Convention on Human Rights to deliver its plan.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "04eb1ef8176cfef54e2af1377deca71425525247",
      "title": "Whatever happened to our sibling series? It's back! And guess who's the heir apparent",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/27/g-s1-84538/heir-inheritance-youngest-sibling-pakistan",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:52:44.000Z",
      "summary_90w": "",
      "raw": "When parents die, sibling tensions can arise over inheritance. In many traditions, the oldest child used to get it all. In a part of Pakistan, there's a surprise twist: The youngest is the chosen one.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fced1e5123887b3d39847d200e014a77b61c9ea5",
      "title": "Fed governor fights for her job. And, the DNC has a message for Democrats",
      "url": "https://www.npr.org/2025/08/27/g-s1-85692/up-first-newsletter-lisa-cook-dnc-ken-martin-taylor-swift-travis-kelce",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:51:09.000Z",
      "summary_90w": "",
      "raw": "Fed Governor Lisa Cook plans to fight to keep her job with a forthcoming lawsuit challenging President Trump. And, the DNC addresses the Democratic Party's challenges.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a225ed84824b10325aac10baed0fc78ba43b916b",
      "title": "Denmark summons top US diplomat over alleged 'covert influence operations' in Greenland",
      "url": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T11:39:04.000Z",
      "summary_90w": "",
      "raw": "The aim was reportedly to infiltrate Greenland's society and promote its secession from Denmark.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a225ed84824b10325aac10baed0fc78ba43b916b",
      "title": "Denmark summons top US diplomat over alleged Greenland influence operation",
      "url": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T11:39:04.000Z",
      "summary_90w": "",
      "raw": "The aim was reportedly to infiltrate Greenland's society and promote its secession from Denmark.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8c2812eb8a502612cdd51cb6d0fce9f96254be85",
      "title": "A 6-year-old girl from Gaza, a missing limb and a doctor's mission",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/08/27/g-s1-85310/gaza-lebanon-israel-hamas-reconstructive-surgery",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:31:24.000Z",
      "summary_90w": "",
      "raw": "How do you heal the wounds of war? That is the mission of Dr. Ghassan Abu-Sittah, a reconstructive and plastic surgeon at the American University of Beirut Medical Center.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2f818ec02bb5b95b874bc3f78a805bdcb0287ff8",
      "title": "Rightwing ‘parents’ rights’ groups gain ground in Canada as Alberta book bans target LGBTQ+ titles",
      "url": "https://www.theguardian.com/world/2025/aug/27/alberta-book-ban-canada-parents-rights-groups",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T11:30:01.000Z",
      "summary_90w": "",
      "raw": "Two such groups claim they persuaded Alberta to institute sweeping public school book ban\nSocially conservative “parents’ rights” groups that have emerged as powerfully political lobbying groups in the US are quickly gaining ground in Canada, academics and free speech advocates say, after two such groups claimed they had persuaded Alberta to institute a sweeping public school book ban.\nAlberta recently directed schools to purge library books from shelves that fit its definition of “explicit sexual content” by 1 October. If the policy is applied precisely as outlined, a host of books face being purged, including George Orwell’s 1984 due to passages in the text that discuss sexual intercourse and rape.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36e23bb5a370b25bb9a69c8f82047dcaba4d817f",
      "title": "The GOP is shying away from town halls. This Missouri congressman is doing 15 of them",
      "url": "https://www.npr.org/2025/08/27/g-s1-85288/gop-townhalls-missouri-rep-mark-alford",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T11:25:34.000Z",
      "summary_90w": "",
      "raw": "At a time when congressional Republicans are generally opting against town halls, Missouri Rep. Mark Alford is embarking on a four-day, 15-stop tour to meet with constituents.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "10c9f2582f0687b37dafb017ee5780e2281ce874",
      "title": "Lil Nas X says he's OK after 'terrifying' arrest",
      "url": "https://www.bbc.com/news/articles/c5ylv15xd0xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T10:57:46.000Z",
      "summary_90w": "",
      "raw": "He pleaded not guilty to injuring a police officer and resisting arrest after being found naked in LA.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c1f334d1bb0c24b17b310b46c684e3ea7482e1ee",
      "title": "Vast private zoo run by son of India's richest man faces inquiry ",
      "url": "https://www.bbc.com/news/articles/cgqn5jjk55no?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T10:57:00.000Z",
      "summary_90w": "",
      "raw": "The centre run by the billionaire Ambanis faces allegations it unlawfully acquired and mistreated animals.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "72bb4f60b82275cc302dc3084867c58792e756a2",
      "title": "Are you a new grandparent? NPR wants to hear from you for National Grandparent's Day",
      "url": "https://www.npr.org/2025/08/27/g-s1-85689/family-grandparent-relationships-parent",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T10:32:12.000Z",
      "summary_90w": "",
      "raw": "National Grandparents Day is Sep. 7. NPR wants to hear from new grandparents about how your life has changed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "05d404af9ebbdefa9d3d949102cf27dadc3a47c4",
      "title": "In idyllic Porepunkah, a manhunt this huge feels ‘surreal’ – and the alleged killer could be anywhere",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-victoria-manhunt-alleged-killer-bush-search-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T10:07:32.000Z",
      "summary_90w": "",
      "raw": "A peaceful Victoria town has been rocked by the fatal shootings of two police officers, leaving locals shuttered indoors and police scouring bushland for the suspect\n\nWho is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest magistrate\n\nHow a police search warrant at a rural Victorian property ended in a day of tragedy\n\nGet our breaking news email, free app or daily news podcast\n\nIt would have been idyllic were it not for the sound of a police helicopter reverberating over the valley.\nBy late afternoon on Wednesday the rain had slowed to a drizzle in Porepunkah. Mist curled around the foothills of Mt Buffalo. Cows and sheep grazed under a grey sky, unperturbed by the massive manhunt around them.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9a6bd4be121eda46186ea6d5c64ce5b3861442b2",
      "title": "Who is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest a magistrate, court records reveal",
      "url": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-shooting-suspect-dezi-freeman-victoria-police-ntwnfb",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T10:05:27.000Z",
      "summary_90w": "",
      "raw": "Victoria police say alleged shooter remains on the run and armed after two officers killed and a third injured\n\nWhat we know so far about the shooting in rural Australia\n\nGet our breaking news email, free app or daily news podcast\n\nDezi Freeman, the man suspected of shooting and killing two police officers and injuring a third at a rural Victorian property, said he had a history of unpleasant encounters with the force, who he called “terrorist thugs”, “frigging Nazis” and “Gestapo” that wore “the satanic symbol” of an “inverted pentagram” on their uniforms, according to court records.\nFreeman also has a history of association with pseudolaw and “sovereign citizen” ideas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "bfee25374c0ccf8085e7e595348c242ea0260ce7",
      "title": "In the brain, a lost limb is never really gone",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/27/nx-s1-5515601/brain-map-lost-limb-amputee-plasticity",
      "source_id": "npr-top",
      "source_name": "NPR Topics: News",
      "published": "2025-08-27T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Even years after an arm is amputated, the brain maintains a detailed map of the limb and tries to interact with this phantom appendage.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a81bafb2054f937af0728d19f9922d93610c8ec6",
      "title": "Watch: Raging rivers cause destruction in parts of northern India",
      "url": "https://www.bbc.com/news/videos/cp94eg1p7rvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T09:30:46.000Z",
      "summary_90w": "",
      "raw": "At least 30 people have died since Tuesday, as flash floods swept away roads and submerged homes.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "d0e67493e7b4016073768bd9fbb808c298f219a6",
      "title": "Parents of teenager who took his own life sue OpenAI",
      "url": "https://www.bbc.com/news/articles/cgerwp7rdlvo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T09:18:05.000Z",
      "summary_90w": "",
      "raw": "The Raine family alleges ChatGPT \"actively helped\" their 16-year-old son take his own life.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9217280dfd278e95dcddb400d1699f269a8cb078",
      "title": "Deforestation has killed half a million people in past 20 years, study finds",
      "url": "https://www.theguardian.com/environment/2025/aug/27/deforestation-has-killed-half-a-million-people-in-past-20-years-study-finds",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T09:00:57.000Z",
      "summary_90w": "",
      "raw": "Localised rises in temperature caused by land clearance cause 28,330 heat-related deaths a year, researchers find\nDeforestation has killed more than half a million people in the tropics over the past two decades as a result of heat-related illness, a study has found.\nLand clearance is raising the temperature in the rainforests of the Amazon, Congo and south-east Asia because it reduces shade, diminishes rainfall and increases the risk of fire, the authors of the paper found.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "89593b329d156382e101da4712c0061a7e78d590",
      "title": "Taylor's engaged - what we learned and the new details revealed by Travis's dad",
      "url": "https://www.bbc.com/news/articles/c4gzdpk3xwjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T08:50:09.000Z",
      "summary_90w": "",
      "raw": "As the news broke, many Swifties joke on social media they are happy for their \"close friend\" Swift.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b2fccbf7a9f48faa73b6d07fceae586e2219f7b0",
      "title": "U.S. tariffs take effect on India, threatening $48.2B in exports",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518809/india-us-tariffs-trump-modi-exports",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:48:54.000Z",
      "summary_90w": "",
      "raw": "Earlier this month President Trump signed an executive order imposing an additional 25% tariff on India due its purchases of Russian oil, bringing the combined tariffs to 50%.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "74b51ec27a66773933f7c5b98018098bb4a2b5bc",
      "title": "Police killed in Australia shooting named as manhunt continues",
      "url": "https://www.bbc.com/news/articles/c4g6wlxd5kko?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T08:08:55.000Z",
      "summary_90w": "",
      "raw": "Dezi Freeman allegedly opened fire on officers who were at his rural property to execute a warrant.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ce31cc150cb07b342e940266198c9b157cf0b5c",
      "title": "Despite sanctions, many countries are still importing Russian products",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5496336/despite-sanctions-many-countries-are-still-importing-russian-products",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T08:06:54.000Z",
      "summary_90w": "",
      "raw": "Economic sanctions and trade restrictions against Russia following its full-scale invasion of Ukraine were set to force Moscow's hand. But the U.S. and Europe continue to rely on Russian imports.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d311b580672a921da9df17646c52f6765414f05f",
      "title": "Former player makes Aussie Rules history by coming out as bisexual",
      "url": "https://www.bbc.com/news/articles/c4g6wwrze2xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T07:42:47.000Z",
      "summary_90w": "",
      "raw": "Mitch Brown hopes his decision to speak on his sexuality will create a safer space for others.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "df0fd20eefdc4e0dcbf3d3c5462970db86c1dc64",
      "title": "South Korea bans phones in school classrooms nationwide",
      "url": "https://www.bbc.com/news/articles/c776ye6lrvzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T06:31:04.000Z",
      "summary_90w": "",
      "raw": "It is the latest country to restrict phone use among children and teens.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0008ce6ff997920e58caaa0edbd3ca3eb34659b1",
      "title": "Ukraine admits Russia has entered key region of Dnipropetrovsk",
      "url": "https://www.bbc.com/news/articles/c17n1p24yv9o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T06:19:21.000Z",
      "summary_90w": "",
      "raw": "Military says Russian advance \"is the first attack of such a large scale\" in industrial province.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "e1d9fa353579965b6bbbd37ec06d6b3f21de7f88",
      "title": "Protesters occupy Microsoft office as company reviews its work with Israel's military",
      "url": "https://www.npr.org/2025/08/27/nx-s1-5518786/microsoft-protesters-office-israel",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-27T05:05:42.000Z",
      "summary_90w": "",
      "raw": "Current and former Microsoft employees were among those arrested. Microsoft has said it is reviewing a report that Israel has used its platform to facilitate attacks on Palestinian targets.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "7517865a69cee8773511ce04954a1bfa18ce98c8",
      "title": "Attempt to partner African countries with Japanese cities triggers xenophobic backlash",
      "url": "https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-27T05:01:42.000Z",
      "summary_90w": "",
      "raw": "Cities in Japan have received thousands of complaints amid confusion over scheme that was intended to foster closer ties\nAn attempt to promote friendship between Japan and countries in Africa has transformed into a xenophobic row about migration after inaccurate media reports suggested the scheme would lead to a “flood of immigrants”.\nThe controversy erupted after the Japan International Cooperation Agency, or JICA, said this month it had designated four Japanese cities as “Africa hometowns” for partner countries in Africa: Mozambique, Nigeria, Ghana and Tanzania.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "168fd6e7eb6dc3b2f40e56e38c546a0b1d875935",
      "title": "Play now",
      "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T04:48:11.000Z",
      "summary_90w": "",
      "raw": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "topics": [
        "World"
      ]
    },
    {
      "id": "0e0a39c40aece012e9985a1e2085599297866469",
      "title": "Princess Diana 90s time capsule contains Kylie CD and pocket TV",
      "url": "https://www.bbc.com/news/articles/cgqn5jzn2vgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T04:38:45.000Z",
      "summary_90w": "",
      "raw": "The time capsule was buried in 1991 to mark the laying of the foundation stone at Great Ormond Street Hospital.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9e4b0f123ebff49f3e77257774f4ed621feb5fb",
      "title": "Kpop Demon Hunters becomes Netflix's most viewed film ever",
      "url": "https://www.bbc.com/news/articles/c1kz12v08l1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T03:10:08.000Z",
      "summary_90w": "",
      "raw": "It is the latest in a series of chart-topping achievements by the animated musical.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "2bd23836bd799070bc0ad9389e6cae4ab5a910a8",
      "title": "UN demands justice over Israeli double strike on Gaza hospital",
      "url": "https://www.bbc.com/news/articles/cd6n97gj1nqo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-27T02:16:49.000Z",
      "summary_90w": "",
      "raw": "An initial Israeli military report says the attack targeted a \"Hamas camera\" and identified \"gaps\" for further investigation.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8ff4150ce6708a13a86c433346060a942926a148",
      "title": "SpaceX notches major wins during 10th Starship test",
      "url": "https://techcrunch.com/2025/08/26/spacex-notches-major-wins-during-tenth-starship-test/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T01:25:37.000Z",
      "summary_90w": "",
      "raw": "This test marks a material advancement for the Starship program, which SpaceX wants to eventually use to send humans and cargo to Mars.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5d9dd641a014c12274a5b2213ddc09f727de03c1",
      "title": "Assort Health nabs $50M to automate patient phone calls, sources say",
      "url": "https://techcrunch.com/2025/08/26/assort-health-nabs-50m-to-automate-patient-phone-calls-sources-say/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T01:08:13.000Z",
      "summary_90w": "",
      "raw": "The company's AI voice agents are designed to take over high-volume, repetitive tasks like scheduling, cancellations, and frequently asked questions normally managed by front desk staff.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "7d7f527af382a91a5943bfd92909041a6c272552",
      "title": "Watch: SpaceX Starship finally completes successful test flight",
      "url": "https://www.bbc.com/news/videos/cd0dxg4kxg1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-27T00:48:13.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's giant rocket, earmarked for use in a 2027 mission to the Moon, has had multiple catastrophic failures in previous launches.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "103d2816afb80cc01a1c71691e3e1d6f4b7c4d96",
      "title": "Verily is closing its medical device program as Alphabet shifts more resources to AI",
      "url": "https://techcrunch.com/2025/08/26/verily-is-closing-its-medical-device-program-as-alphabet-shifts-more-resources-to-ai/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-27T00:14:19.000Z",
      "summary_90w": "",
      "raw": "Alphabet's life sciences arm Verily laid off staff and eliminated its entire devices program as AI and data infrastructure take center stage.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5cdad268c9a3b82f9550cee193688aaba1f68161",
      "title": "Microsoft headquarters go into lockdown after activists take over Brad Smith’s office",
      "url": "https://techcrunch.com/2025/08/26/microsoft-headquarters-go-into-lockdown-after-activists-take-over-brad-smiths-office/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T23:32:17.000Z",
      "summary_90w": "",
      "raw": "The incident is the latest escalation by current and former employees who are demanding the company end its cloud contracts with Israel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2cb35ddc3ddee91c7809f55c783e8c57057028e9",
      "title": "Wildlife Photographer of the Year 2025 – the best pictures so far ",
      "url": "https://www.bbc.com/news/articles/c70r7plrdndo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T23:31:42.000Z",
      "summary_90w": "",
      "raw": "The photo taken by Bidyut Kalita, is among several highly commended in this year's Wildlife Photographer of the Year.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fc058dd340bc0c02b72359959db976c3fd5e6898",
      "title": "'I thought it was the end of my life': Inside Israel's attack on Iran's Evin Prison",
      "url": "https://www.bbc.com/news/articles/czd0e23j9q8o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-26T23:17:20.000Z",
      "summary_90w": "",
      "raw": "In an exclusive interview with BBC Persian, a prisoner describes what happened when Israeli missiles tore through Iran's most notorious jail.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "298de5ae886f1f07635b0773f138faceccf72b56",
      "title": "Brazil judge orders round-the-clock surveillance of ‘flight risk’ Bolsonaro",
      "url": "https://www.theguardian.com/world/2025/aug/26/brazil-judge-orders-round-the-clock-surveillance-of-flight-risk-bolsonaro",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T22:21:06.000Z",
      "summary_90w": "",
      "raw": "Pre-trial monitoring ordered after police reported former president had drafted request for asylum in Argentina\nJair Bolsonaro must be under constant police surveillance, a supreme court justice has ruled, to prevent Brazil’s former president from fleeing days before the start of the trial that could see him jailed for more than 40 years.\nThe far-right leader has been wearing an electronic ankle tag since mid-July and has been under house arrest since early August. But last Monday, the prosecutor general asked the supreme court to tighten surveillance of the 70-year-old, after federal police reported he had even drafted a request for political asylum in Argentina.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "4e18c5a6d2d59cdc65527500158a42f820a4893e",
      "title": "Cook to sue Trump over order to fire her from Federal Reserve",
      "url": "https://www.bbc.com/news/articles/cx275n8gx0ro?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T21:05:20.000Z",
      "summary_90w": "",
      "raw": "The central bank governor says the US president \"has no authority to do so\" in defiance of Trump's escalatory move against the Fed.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "36098a819c61baee6a2b8b97dc80fe4593df879e",
      "title": "Anthropic launches a Claude AI agent that lives in Chrome",
      "url": "https://techcrunch.com/2025/08/26/anthropic-launches-a-claude-ai-agent-that-lives-in-chrome/",
      "source_id": "techcrunch",
      "source_name": "TechCrunch",
      "published": "2025-08-26T20:10:59.000Z",
      "summary_90w": "",
      "raw": "Anthropic is the latest AI lab to offer an AI agent with the ability to view and take action in a user's Chrome browser.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "814b63a22091f2a61a2f7199ede0e8958bdd4b7b",
      "title": "AI 'deadbots' are persuasive — and researchers say they're primed for monetization",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5508355/ai-dead-people-chatbots-videos-parkland-court",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T19:19:08.000Z",
      "summary_90w": "",
      "raw": "The digital afterlife industry may near $80 billion in a decade, fueled by AI \"deadbots.\" Tech firms see profit. But experts warn of troubling consequences.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "56ede2f00389eb38eedf20d574256d3525395908",
      "title": "Israeli protesters stage ‘day of disruption’ calling for end to war in Gaza",
      "url": "https://www.theguardian.com/world/2025/aug/26/israeli-protesters-stage-day-of-disruption-calling-for-end-to-war-in-gaza",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T18:46:43.000Z",
      "summary_90w": "",
      "raw": "Netanyahu continues to prepare Gaza City offensive as mediators await response to ceasefire proposal\nTens of thousands of people took part in demonstrations across Israel on Tuesday, blocking highways on a “day of disruption” that aimed to push Benjamin Netanyahu into agreeing a deal to end the war and calling off plans to attack Gaza City.\nRelatives of hostages led the biggest march and rally in Tel Aviv, while in Jerusalem hundreds of people gathered outside the prime minister’s office as the security cabinet met to discuss the war. There were dozens of other protests around the country, including on the main highway to the northern city of Haifa and inside Ben Gurion airport.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "b0f0d960759255126c9d9601b7af9f190b2e5c4a",
      "title": "Artwork looted by Nazis 80 years ago spotted in estate agent ad",
      "url": "https://www.bbc.com/news/articles/cq68dze2l71o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T18:10:16.000Z",
      "summary_90w": "",
      "raw": "Portrait of a Lady seen in house near Buenos Aires, more than 80 years after it was looted from a Jewish art dealer in Amsterdam.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "da76aa25901cafacd4e75f8fc738e80f73f541e3",
      "title": "Whistleblower says Trump officials copied millions of Social Security numbers",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5517977/social-security-doge-privacy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-26T18:02:27.000Z",
      "summary_90w": "",
      "raw": "A whistleblower complaint says the personal data of over 300 million Americans was copied to a private cloud account to allow access by former members of the Department of Government Efficiency team.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "29c48700734afcd2750c5376198dfe5b0bd968f1",
      "title": "Botswana’s president declares health emergency over supply shortages",
      "url": "https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T15:57:33.000Z",
      "summary_90w": "",
      "raw": "Duma Boko announces urgent funding package for medicines to be distributed with military oversight\nBotswana’s president has declared a public health emergency due to shortages of essential medicines and equipment, as a downturn in the global diamond market and US aid cuts take a toll on the country’s finances.\nThe announcement came after the Ministry of Health suspended non-urgent surgeries on 4 August, stating that the country was short of medicines to treat hypertension, diabetes, cancer, asthma and eye conditions, as well as supplies including bandages and sutures and those for sexual and reproductive health.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a9c28ce82f9b44e595d83bec81d6ac8dbe646563",
      "title": "Video platform Kick investigated over streamer's death",
      "url": "https://www.bbc.com/news/articles/czxpepn5qlxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-26T15:39:31.000Z",
      "summary_90w": "",
      "raw": "The French government also says it is suing the platform over the death of Raphaël Graven, also known as Jean Pormanove.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "43a3ef9af2a8bbecbe56d7cbe23403421a47f319",
      "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
      "url": "https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T14:27:13.000Z",
      "summary_90w": "",
      "raw": "Dutch newspaper AD says it has traced Giuseppe Ghislandi’s Portrait of a Lady to house near Buenos Aires\nMore than 80 years after it was looted by the Nazis from a Jewish art dealer in Amsterdam, a portrait by an Italian master has been spotted on the website of an estate agent advertising a house for sale in Argentina.\nA photo shows the painting, Portrait of a Lady (Contessa Colleoni) by the late-baroque portraitist Giuseppe Ghislandi, also known as Fra’ Galgario, hanging above a sofa in the living room of the property, in a seaside town near Buenos Aires.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "1b0341dfada64707b55d027510963ee56add8c26",
      "title": "France returns slain king's skull to Madagascar",
      "url": "https://www.bbc.com/news/articles/cwy0qejppp7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-world",
      "source_name": "BBC News",
      "published": "2025-08-26T13:17:17.000Z",
      "summary_90w": "",
      "raw": "King Toera was killed by French troops 128 years ago and his head kept in a Paris museum's archive.",
      "topics": [
        "World"
      ]
    },
    {
      "id": "9ba52451fd3389a1da2e1b5d8b98cbc4e94025bf",
      "title": "How plants and fungi trade resources without a brain",
      "url": "https://www.npr.org/sections/planet-money/2025/08/26/g-s1-85185/plants-fungi-resources-trade-cooperation",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T11:00:00.000Z",
      "summary_90w": "",
      "raw": "Fungi and plants have something to teach humans about global trade and cooperation",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "6e77b9142c6dd815ffa9d84da62d2a5df508e540",
      "title": "Judge orders Kari Lake to answer questions about Voice of America under oath",
      "url": "https://www.npr.org/2025/08/26/nx-s1-5506283/judge-order-kari-lake-sworn-deposition-voice-of-america-oath-usagm",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T09:00:00.000Z",
      "summary_90w": "",
      "raw": "U.S. Judge Royce Lamberth ordered Trump administration official Kari Lake to be deposed about her plans for Voice of America, saying she was \"verging on contempt.\"",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "946ee68edff0cb4e775b227a9906502f009c7174",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "url": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:28:08.000Z",
      "summary_90w": "",
      "raw": "Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents\nCambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "798961477467e02a8704390f56a6f1492a18e412",
      "title": "Protests erupt in Indonesia over privileges for parliament members and ‘corrupt elites’",
      "url": "https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T02:26:10.000Z",
      "summary_90w": "",
      "raw": "Controversy over housing allowance, which is almost 10 times minimum wage, comes amid President Prabowo Subianto’s austerity drive\nRiot police have fired water cannon and rounds of teargas at thousands of stone-throwing protesters in Indonesia’s capital as anger over the lavish allowances of parliament members has fuelled public anger.\nThousands of students, workers and activists demonstrated outside the nation’s parliament on Monday against a monthly housing allowance of 50 million rupiah ($US3,075) for MPs, which is almost 10 times the Jakarta minimum wage.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "c675c10d86b6836f58897097924f60393aac3b50",
      "title": "Trump says he hopes to meet Kim Jong-un and raises prospect of US taking over some South Korean land",
      "url": "https://www.theguardian.com/us-news/2025/aug/25/trump-north-korea-kim-jong-un-lee-jae-myung",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-26T01:20:11.000Z",
      "summary_90w": "",
      "raw": "South Korean president Lee Jae Myung uses Oval Office meeting to encourage Trump to engage with North Korean leader\nDonald Trump has said he wants to meet North Korean leader Kim Jong-un, possibly this year, in an attempt to revive the failed nuclear diplomacy of his first term as US president.\n“I’d like to have a meeting. I look forward to meeting with Kim Jong-un in the appropriate future,” Trump said during an occasionally awkward meeting at the Oval Office with South Korea’s new president, Lee Jae Myung, in which he raised the prospect of taking ownership of South Korean land that hosts a US military base.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "92f40831e0a32882c5b431bebc43f33e69fcbe76",
      "title": "Trump seeks to fire Fed governor Lisa Cook -- but a legal fight looms",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5517335/trump-federal-reserve-governor-lisa-cook",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-26T00:52:50.000Z",
      "summary_90w": "",
      "raw": "Trump says he's firing Cook after one of his allies accused her of making false statements on a mortgage application. Cook said the president has no authority to fire her and vowed to stay.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "01a33cb7def2ec94927cf11ccf83ddd4a4952d35",
      "title": "Piracy and armed robbery surge in the straits of Malacca and Singapore – report",
      "url": "https://www.theguardian.com/world/2025/aug/26/piracy-straits-of-malacca-singapore",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-25T23:46:01.000Z",
      "summary_90w": "",
      "raw": "In the first six months of this year there were 80 incidents of piracy and armed robbery in the strategic waterways\nIncidents of piracy and armed robbery in the straits of Malacca and Singapore have nearly quadrupled in the strategic waterways this year, according to a new report from an anti-piracy monitoring group.\nIn the first six months of this year there were 80 incidents of piracy and armed robbery in the straits, according to ReCAAP’s Information Sharing Centre (ISC). In the same period last year there were 21 incidents.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "3af6dac486954176b28f6354904ecfa585caa149",
      "title": "Child sex abuse victim begs Elon Musk to remove links to her images",
      "url": "https://www.bbc.com/news/articles/cq587wv4d5go?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T23:17:45.000Z",
      "summary_90w": "",
      "raw": "BBC investigation finds US victim's images are traded globally by an operator based in Indonesia.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1f4997fc66c36fa7d9c72adcce835f06fa68e6a2",
      "title": "Trump again calls for FCC to revoke ABC and NBC licenses",
      "url": "https://www.npr.org/2025/08/25/nx-s1-5515480/fcc-abc-nbc-reviews",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T21:28:48.000Z",
      "summary_90w": "",
      "raw": "President Trump lashed out on social media late Sunday against ABC and NBC, putting the nation's top broadcast regulator once more at the center of his culture wars.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "d2971c699415ed15c5cdf7d4505b4ac817df2009",
      "title": "Evergrande's delisting in Hong Kong: key facts to know",
      "url": "https://www.npr.org/2025/08/25/g-s1-85108/evergrandes-delisting-in-hong-kong-key-facts-to-know",
      "source_id": "npr-business",
      "source_name": "NPR Topics: Business",
      "published": "2025-08-25T17:33:16.000Z",
      "summary_90w": "",
      "raw": "At its peak, China Evergrande Group was worth more than $50 billion. But it all came crashing down in 2021. It was massively in debt and unable to complete some existing projects.",
      "topics": [
        "Business"
      ]
    },
    {
      "id": "1c87e28cd5f99373fa4fb3e4d175c429769fffd8",
      "title": "Musk firms sue Apple and OpenAI, alleging they hurt competition",
      "url": "https://www.bbc.com/news/articles/cly6xjg9nnyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-25T17:21:41.000Z",
      "summary_90w": "",
      "raw": "The lawsuit takes aim at Apple's decision to integrate ChatGPT into the operating systems of its smartphones.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "98843eedf0c4b3bf1fad6923e70309fe3bbe5bf8",
      "title": "Women aren't just 'cosy gamers' - I play horror games and 600,000 watch",
      "url": "https://www.bbc.com/news/articles/cm21xy23npyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-24T23:05:06.000Z",
      "summary_90w": "",
      "raw": "Once thought of as a male-dominated pastime, the number of women streaming and playing video games is growing rapidly.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e5795c618e230224998fd210f35a94a572ac3085",
      "title": "Taiwan referendum on reopening last nuclear plant fails",
      "url": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-24T05:17:03.000Z",
      "summary_90w": "",
      "raw": "Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe\nA referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved.\nThe plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "656ffc335bbb392587b5c92e59f46d3cba009554",
      "title": "Bubbling questions about the limitations of AI",
      "url": "https://www.npr.org/2025/08/23/nx-s1-5509946/bubbling-questions-about-the-limitations-of-ai",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-23T21:20:20.000Z",
      "summary_90w": "",
      "raw": "NPR's Scott Detrow speaks with Cal Newport, author and computer science professor at Georgetown, about AI's limitations and if progress within the industry has stalled.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "47844295646efa9aff8796d626948a1262e088e3",
      "title": "My ex stalked me, so I joined a 'dating safety' app. Then my address was leaked",
      "url": "https://www.bbc.com/news/articles/ce87rer52k3o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-23T00:34:38.000Z",
      "summary_90w": "",
      "raw": "Thousands of women who signed up had their data, including images, posts, and comments, leaked.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b8d189f5c6596263ae4bcd6b9cea545e725c55aa",
      "title": "Intel will give the U.S. government a 10% stake, Trump says",
      "url": "https://www.npr.org/2025/08/22/nx-s1-5509673/trump-says-us-government-will-take-stake-intel",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-22T20:17:14.000Z",
      "summary_90w": "",
      "raw": "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b29383a1f4a692fab0c34750c6549a1f6a518d8c",
      "title": "Eswatini government faces court challenge over men deported by US",
      "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-22T15:02:26.000Z",
      "summary_90w": "",
      "raw": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights\nA group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights.\nThe men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "871c7702fc7155ad9507009d4dc90e3b1d710b6e",
      "title": "Apple TV+ raises subscription prices worldwide, including in UK",
      "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T14:22:32.000Z",
      "summary_90w": "",
      "raw": "The streaming industry has seen a series of price hikes from its major players in the past year.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6bed51348eb943f3c6d4b092a949fad8586a4134",
      "title": "TikTok puts hundreds of UK content moderator jobs at risk",
      "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T12:32:06.000Z",
      "summary_90w": "",
      "raw": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "652e9187938cd145106b9f8d538ae8631118cfea",
      "title": "Is Donald Trump losing his Latino base?",
      "url": "https://www.bbc.co.uk/sounds/play/w3ct7t5t?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-08-22T12:05:00.000Z",
      "summary_90w": "",
      "raw": "And can the Democrats win them back?",
      "topics": [
        "World"
      ]
    },
    {
      "id": "8f3b10b6d119d77a74793800b514cd869ffe3e54",
      "title": "Elon Musk and X reach settlement with axed Twitter workers",
      "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-22T02:51:40.000Z",
      "summary_90w": "",
      "raw": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "d08922c06be2a3680b3669a44fb40be5a2c861c5",
      "title": "4chan will refuse to pay daily online safety fines, lawyer tells BBC",
      "url": "https://www.bbc.com/news/articles/cq68j5g2nr1o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T23:45:55.000Z",
      "summary_90w": "",
      "raw": "The online message board's lawyers say UK safety laws shouldn't apply to a business based in the US.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4d860c8d106c89af05cc5116a603d8ab88e054f9",
      "title": "A newscaster takes us along on her date with an AI companion",
      "url": "https://www.npr.org/2025/08/21/nx-s1-5500249-e1/a-newscaster-takes-us-along-on-her-date-with-an-ai-companion",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-21T20:20:25.000Z",
      "summary_90w": "",
      "raw": "Despite dating apps and social media advice, romantic connections can be hard to make. Enter artificial intelligence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "dda1ae6a37b0a0dbf795c5788f2e394d9b966064",
      "title": "French streamer's death 'not due to trauma', autopsy finds",
      "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T16:47:26.000Z",
      "summary_90w": "",
      "raw": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "91ea4d4e9be83dee833d70d627a50775081dfc9f",
      "title": "Hundreds of thousands of Grok chats exposed in Google results",
      "url": "https://www.bbc.com/news/articles/cdrkmk00jy0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T12:55:28.000Z",
      "summary_90w": "",
      "raw": "Elon Musk's artificial intelligence (AI) chatbot appears to have published messages without users' knowledge.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "4872e070e4905df59f5a56f54a15ef3f17935696",
      "title": "Uganda reaches agreement with US to take in some failed asylum seekers",
      "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T12:31:56.000Z",
      "summary_90w": "",
      "raw": "African country’s foreign ministry says the two states are working on the details of a deal over deportees\nUganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry.\nThe country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement. He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "a111107d0eceac0957fe0c34ffee2bb8c0b0885a",
      "title": "Netflix signs up another YouTube star with Mark Rober deal",
      "url": "https://www.bbc.com/news/articles/c20939pp04po?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T11:26:08.000Z",
      "summary_90w": "",
      "raw": "The YouTuber and former Nasa engineer is working with Jimmy Kimmel to make a new competition show.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "c27b97d1148b73184640423c2397e496f931e8e6",
      "title": "Investigation into 'horrifying' death of French streamer",
      "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T07:51:05.000Z",
      "summary_90w": "",
      "raw": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "42b737127a5584692c295adcde35527715430598",
      "title": "Pressure grows on Tanzania to free victim of domestic violence who has been on death row for 13 years",
      "url": "https://www.theguardian.com/global-development/2025/aug/21/tanzania-lemi-limbu-woman-learning-disabilities-death-row",
      "source_id": "guardian-world",
      "source_name": "World news | The Guardian",
      "published": "2025-08-21T05:00:04.000Z",
      "summary_90w": "",
      "raw": "Lemi Limbu, who was convicted of murdering her daughter, has severe intellectual disabilities and ‘absolutely should not be in prison’, say campaigners\nPressure is mounting on the Tanzanian government to release a woman with severe intellectual disabilities who has been in prison awaiting execution for 13 years.\nLemi Limbu, who is now in her early 30s, was convicted of the murder of her daughter in 2015. A survivor of brutal and repeated sexual and domestic violence, she has the developmental age of a child.\n Continue reading...",
      "topics": [
        "World"
      ]
    },
    {
      "id": "fbb07262c0253056c39fe2b2ee3ae4439ba7abe7",
      "title": "Sony raises PlayStation 5 prices in US as tariff fears persist",
      "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-21T01:45:10.000Z",
      "summary_90w": "",
      "raw": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "6c0761697a3c5b8d76a00937173b97ca5d7be14c",
      "title": "Microsoft boss troubled by rise in reports of 'AI psychosis'",
      "url": "https://www.bbc.com/news/articles/c24zdel5j18o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-20T16:36:03.000Z",
      "summary_90w": "",
      "raw": "Mustafa Suleyman said there was still \"zero evidence of AI consciousness today\".",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "2603a805c1e272269faf380eadbac3ac1f35ac43",
      "title": "These brain implants speak your mind — even when you don't want to",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-20T10:00:00.000Z",
      "summary_90w": "",
      "raw": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adbc3b110204f493b8782dccde3f18d86dda61f0",
      "title": "UK backs down in Apple privacy row, US says",
      "url": "https://www.bbc.com/news/articles/cdj2m3rrk74o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T21:45:56.000Z",
      "summary_90w": "",
      "raw": "UK authorities have demanded access to Apple users' protected files when required for investigations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "adb7721127ff649aa984895e96e7a7d532a38b02",
      "title": "Research suggests doctors might quickly become dependent on AI",
      "url": "https://www.npr.org/sections/shots-health-news/2025/08/19/nx-s1-5506292/doctors-ai-artificial-intelligence-dependent-colonoscopy",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T10:57:42.000Z",
      "summary_90w": "",
      "raw": "A study in Poland found that doctors appeared less likely to detect abnormalities during colonoscopies on their own after they'd grown used to help from an AI tool.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "20ed7b3fd141aba4e72ae31b252b4f40e770eccb",
      "title": "An AI divide is growing in schools. This camp wants to level the playing field",
      "url": "https://www.npr.org/2025/08/19/nx-s1-5503984/ai-summer-camp-schools-education",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-19T09:25:07.000Z",
      "summary_90w": "",
      "raw": "For years, research has shown a digital divide when it comes to schools teaching about new technologies. Educators worry that this could leave some students behind in an AI-powered economy.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1a23ee35e0df22ac9161e38a0c2c77fed1169267",
      "title": "Stop children using VPNs to watch porn, ministers told",
      "url": "https://www.bbc.com/news/articles/cn438z3ejxyo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T05:39:49.000Z",
      "summary_90w": "",
      "raw": "The children's commissioner for England tells the BBC virtual private networks are a \"loophole that needs closing.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "5768383bb571e26afc90dbb7ded21d612e0fface",
      "title": "Intel shares jump as Softbank to buy $2bn stake in chip giant",
      "url": "https://www.bbc.com/news/articles/cly4vn1nxg7o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-19T02:06:02.000Z",
      "summary_90w": "",
      "raw": "The announcement comes hours after reports that the White House is in talks over taking a 10% stake in Intel.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "caf29a3d589e1d7feed4df5bfc3b680eb4427723",
      "title": "Meta investigated over AI having 'sensual' chats with children",
      "url": "https://www.bbc.com/news/articles/c3dpmlvx1k2o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-18T12:04:06.000Z",
      "summary_90w": "",
      "raw": "The leak has led to backlash amid reports the tech giant's legal staff approved the conversations.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b60ad71c584762a086231dcddf227302f854d87f",
      "title": "What's behind the Trump administration's immigration memes?",
      "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-18T09:48:28.000Z",
      "summary_90w": "",
      "raw": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "e0843e553520b3d82ee0a049bfb16067117b07e4",
      "title": "Should Europe wean itself off US tech?",
      "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-17T23:03:19.000Z",
      "summary_90w": "",
      "raw": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "443498db71fa3c4301585ddc366278bf740c3227",
      "title": "AI is driving a data center boom in rural America. Locals are divided on the benefits",
      "url": "https://www.npr.org/2025/08/17/nx-s1-5461467/ai-is-driving-a-data-center-boom-in-rural-america-locals-are-divided-on-the-benefits",
      "source_id": "npr-tech",
      "source_name": "NPR Topics: Technology",
      "published": "2025-08-17T13:02:15.000Z",
      "summary_90w": "",
      "raw": "Artificial intelligence is driving a data center building boom across rural America, including in central Washington. But critics say the centers do not produce enough jobs — and drain resources.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0286dfeba6fa66ac6af451e8010c158e842ca0ef",
      "title": "VW introduces monthly subscription to increase car power",
      "url": "https://www.bbc.com/news/articles/c62weyp4qqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T13:32:22.000Z",
      "summary_90w": "",
      "raw": "The German car-maker says its \"optional power upgrade\" is designed to give customers more choice.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "ffe37dd0e5942d25678bee79d6e5f868c2208920",
      "title": "UK's Turing AI Institute responds to staff anger about defence focus",
      "url": "https://www.bbc.com/news/articles/c86076qd40xo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T12:06:13.000Z",
      "summary_90w": "",
      "raw": "Whistleblowers say the charity is at risk of collapse because it has been told by the government to focus on defence.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "1e92b79053519abd5c13ccbad21c7434c461c040",
      "title": "Data centres to be expanded across UK as concerns mount",
      "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T08:17:29.000Z",
      "summary_90w": "",
      "raw": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "b237a1bea77810c43f57739a99c035526d2e9cf8",
      "title": "Intel shares jump after report of possible US stake in chipmaker",
      "url": "https://www.bbc.com/news/articles/cpv01pl208lo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T07:29:36.000Z",
      "summary_90w": "",
      "raw": "The reports emerged a day after a meeting between the Intel boss and Donald Trump.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "fb6d96fef5ebcdd6d0d9653b3771d5e4e38d0c73",
      "title": "Angry, confused and worried about police – behind Instagram bans",
      "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-15T01:00:49.000Z",
      "summary_90w": "",
      "raw": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "0aa576c6d9866baa271f074a093502e936089c35",
      "title": "Firm apologises for saying it would not process LGBTQ+ payments",
      "url": "https://www.bbc.com/news/articles/c15lpwzzzqgo?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-tech",
      "source_name": "BBC News",
      "published": "2025-08-14T12:23:01.000Z",
      "summary_90w": "",
      "raw": "Stripe said the information given by its support staff to some customers was \"totally wrong.\"",
      "topics": [
        "Technology"
      ]
    },
    {
      "id": "53515fb374304cbca7057778293272f5385247e1",
      "title": "BBC News app",
      "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2025-04-30T14:04:28.000Z",
      "summary_90w": "",
      "raw": "Top stories, breaking news, live reporting, and follow news topics that match your interests",
      "topics": [
        "World"
      ]
    },
    {
      "id": "7d417085f0c3e94038bb536037a083c06b1b78e8",
      "title": "Catherine Bott on pitch correction software",
      "url": "https://www.bbc.co.uk/sounds/play/b01shwkq?at_mid=IjEUKsel6i&at_campaign=Creating_Pitch_Perfect&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=b01shwkq&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Creating_Pitch_Perfect&at_bbc_team=BBC",
      "source_id": "bbc-top",
      "source_name": "BBC News",
      "published": "2013-05-20T15:32:00.000Z",
      "summary_90w": "",
      "raw": "Catherine Bott on software that corrects out of tune singing but is also a creative tool.",
      "topics": [
        "World"
      ]
    }
  ]
}